{
    "data": [
        {
            "title": "Visa Closes Acquisition of Prisma, Newpay in Argentina",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/visa-closes-acquisition-of-prisma-newpay-in-argentina-ce7e5cdfd880f02c",
            "pub_date": "2026-02-27 21:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block shares soar as Dorsey leans on AI to trim workforce",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-shares-soar-as-dorsey-leans-on-ai-to-trim-workforce-ce7e5cdfd880f122",
            "pub_date": "2026-02-27 21:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cocoa bean demand should remain under pressure in 2025-2026 cycle - Hedgepoint",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cocoa-bean-demand-should-remain-under-pressure-in-2025-2026-cycle-hedgepoint-ce7e5cdfd880f22d",
            "pub_date": "2026-02-27 21:30:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spot gold rises nearly 1% to $5,236.99/oz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spot-gold-rises-nearly-1-to-5-236-99-oz-ce7e5cdfd880f220",
            "pub_date": "2026-02-27 21:30:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wheat at new multi-month highs on Iran uncertainty",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wheat-at-new-multi-month-highs-on-iran-uncertainty-ce7e5cdfd880f327",
            "pub_date": "2026-02-27 21:30:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orix Corporation Announces Organizational Reform, Effective March 1, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>ORIX Corporation made public an announcement regarding management changes and organizational reform, effective as of March 1, 2026. Japan &amp; APAC Business Unit: Pension Business Promotion Department and Healthcare &amp; Public Solution Department will be newly established and incorporated into Corporate Business Headquarters. Johoku Area will be newly established and incorporated into Corporate Business Headquarters.</p><p>Johoku Branch Office will be newly established and incorporated into Johoku Area. Corporate Strategy and Management Unit: New Business Development Department will be abolished. Investor Relations and Sustainability Department will be divided into Investor Relations Department and Sustainability Department.</p><!-- Article --><p>Risk Management Unit: Credit and Investment Information Management Department will be renamed Risk Information Management Department.</p></div>",
            "link": "https://hk.marketscreener.com/news/orix-corporation-announces-organizational-reform-effective-march-1-2026-ce7e5cdfd881fe20",
            "pub_date": "2026-02-27 21:25:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German regulator approves power line from Rhineland-Palatinate to Luxembourg border",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-regulator-approves-power-line-from-rhineland-palatinate-to-luxembourg-border-ce7e5cdfd881fe27",
            "pub_date": "2026-02-27 21:25:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spot silver rises over 3% to $91.26/oz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spot-silver-rises-over-3-to-91-26-oz-ce7e5cdfd881ff2c",
            "pub_date": "2026-02-27 21:25:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global Smartphone Shipments to Drop in 2026 Due to Memory Chip Shortages",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/global-smartphone-shipments-to-drop-in-2026-due-to-memory-chip-shortages-ce7e5cdfd881f025",
            "pub_date": "2026-02-27 21:25:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ares Management Acquires Netflix London Office for $215.6 Million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ares-management-acquires-netflix-london-office-for-215-6-million-ce7e5cdfd881f423",
            "pub_date": "2026-02-27 21:25:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cocoa market should see continued volatility in 2026 - Hedgepoint Global Markets",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cocoa-market-should-see-continued-volatility-in-2026-hedgepoint-global-markets-ce7e5cdfd881f422",
            "pub_date": "2026-02-27 21:25:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blackstone, Brookfield Among Bidders in Next Round for Volkswagen's Heavy Diesel Engine Unit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/blackstone-brookfield-among-bidders-in-next-round-for-volkswagen-s-heavy-diesel-engine-unit-ce7e5cdfd881f527",
            "pub_date": "2026-02-27 21:25:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Italy set for EU green light on public finances, but fiscal risks ahead",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/italy-set-for-eu-green-light-on-public-finances-but-fiscal-risks-ahead-ce7e5cdfd881f626",
            "pub_date": "2026-02-27 21:25:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave shares slump as doubling capital expenditure sparks margin concerns",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Shares of CoreWeave slumped around 12% before the bell on Friday, after the company's plans to double capital expenditure this year fueled investor concerns about margin pressure and effective returns from its artificial intelligence push. </p><p>\n              The cloud infrastructure company has committed significant capital toward the construction of large data centers filled with top-of-the line Nvidia chips to capitalize on the booming demand for AI services. </p><!-- Article --><p>\n              CoreWeave has budgeted $30 billion to $35 billion in capital expenditure this year, more than double the $14.9 billion it spent in 2025. The increased spending will put some \"short-term pressure on the margins,\" the company said.</p><p>\n              The company's ballooning spending mirrors that of hyperscale cloud providers such as Alphabet's Google and Amazon , which have collectively committed more than $600 billion this year for AI infrastructure buildouts. </p><p>\n              Unlike Big Tech companies that are cushioned by massive cash reserves, neoclouds like CoreWeave and peer Nebius are more exposed to significant market downturns due to their business models.</p><p>\n              CoreWeave had $3.13 billion in cash and its equivalents, compared with Microsoft's $24.3 billion and Amazon's $86.8 billion, according to their most recent earnings reports. </p><p>\n              Amsterdam-based Nebius earlier this month reported a sharp rise in capital spending to $2.1 billion in the December quarter from just $416 million in the prior year period.</p><p>\n              Neoclouds offer hardware and cloud capacity as services to other tech firms, usually by providing access to high-quality processors and cloud infrastructure. </p><p>\n              Moreover, a rush to build out data centers could put pressure on chip availability. Any disruption to the supply could hamper CoreWeave's infrastructure plans and leave it with a revenue backlog it cannot fulfill. </p><p></p><p>(Reporting by Zaheer Kachwala in Bengaluru; Editing by Leroy Leo)</p></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-shares-slump-as-doubling-capital-expenditure-sparks-margin-concerns-ce7e5cdfd881f720",
            "pub_date": "2026-02-27 21:25:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Energy Profit Jumps 28% in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-energy-profit-jumps-28-in-2025-ce7e5cdfd881f726",
            "pub_date": "2026-02-27 21:25:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wan Kei Raises HK$12.5 Million from Share Placement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wan-kei-raises-hk-12-5-million-from-share-placement-ce7e5cdfd88efe21",
            "pub_date": "2026-02-27 21:25:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shenzhen Investment's Daily Toll Revenue Jumps in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shenzhen-investment-s-daily-toll-revenue-jumps-in-january-ce7e5cdfd88eff20",
            "pub_date": "2026-02-27 21:16:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Feiyu Technology International Forecasts Turnaround to 2025 Profit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/feiyu-technology-international-forecasts-turnaround-to-2025-profit-ce7e5cdfd88eff27",
            "pub_date": "2026-02-27 21:16:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Solar's Profit Slips 16% in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-solar-s-profit-slips-16-in-2025-ce7e5cdfd88ef02d",
            "pub_date": "2026-02-27 21:16:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SPT Energy Forecasts Narrower Loss in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spt-energy-forecasts-narrower-loss-in-2025-ce7e5cdfd88ef023",
            "pub_date": "2026-02-27 21:16:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omani foreign minister to meet Vance in Washington, source familiar says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/omani-foreign-minister-to-meet-vance-in-washington-source-familiar-says-ce7e5cdfd88ef427",
            "pub_date": "2026-02-27 21:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia sets March crude palm oil reference price at $938.87 per ton",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-sets-march-crude-palm-oil-reference-price-at-938-87-per-ton-ce7e5cdfd88ef621",
            "pub_date": "2026-02-27 21:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration taps far-right official for key Brazil post",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 27 (Reuters) - The Trump administration has appointed a hard-right critic of Brazil's current government to a position shaping U.S. policy toward the South American nation, a move that suggests relations between the Western Hemisphere's two largest democracies remain delicate despite a recent rapprochement. </p><p>\n              Darren Beattie, who is also the acting assistant secretary of state for educational and cultural affairs, was tapped recently for a senior advisory role overseeing Brazil, said three sources familiar with the matter, all of whom requested anonymity to discuss non-public personnel moves.</p><!-- Article --><p>\n              The move was confirmed by a senior State Department official, who said Beattie \"currently serves as a Senior Advisor for Brazil Policy.\" </p><p>\n              Brazil's Foreign Ministry did not respond immediately to a request for comment.</p><p>\n              In August, Beattie, who was fired as a White House speechwriter in 2018 for addressing an event frequented by white nationalists, provoked a diplomatic incident after describing Brazilian Supreme Court Justice Alexandre de Moraes in an X post as \"the key architect of the censorship and persecution complex directed against (former Brazilian President Jair) Bolsonaro.\"</p><p>\n              Brazil's Foreign Ministry summoned the top U.S. diplomat in Brasilia to explain the comments.</p><p>\n              Moraes, the judge Beattie criticized, presided over the criminal case against Bolsonaro, an ally of U.S. President Donald Trump. Bolsonaro was convicted of plotting a coup to overturn Brazil's 2022 presidential election and is now serving a 27-year jail sentence. </p><p>\n              The U.S. had sanctioned Moraes in July, with Trump officials accusing him of authorizing arbitrary pre-trial detentions and suppressing freedom of expression as he presided over cases related to the 2022 coup plot.</p><p>\n              After the sanctions against Moraes were announced, Eduardo Bolsonaro, one of the ex-president's sons and a prominent right-wing politician in Brazil, thanked Beattie for his efforts in an X post. Another son of Bolsonaro, Flavio, is a leading contender in Brazil's next presidential election in October.</p><p><b>UP-AND-DOWN RELATIONSHIP</b></p><p>\n              While Beattie worked last year to counter what the Trump administration considers undue censorship in foreign countries, his new appointment signals a focus on Brazil going forward. </p><p>\n              It also suggests that Washington has not jettisoned its free speech concerns in Brazil, nor has it totally made peace with the leftist government of President Luiz Inacio Lula da Silva.</p><p>\n              Two Brazilian government officials said they were not yet aware of Beattie's appointment, adding that his impact on bilateral relations would depend on how much power he was given internally. The officials said they were wary given Beattie's public statements.</p><p>\n              Washington's relationship with Brasilia turned chilly after Trump returned to office last year. In addition to hitting Brazilian officials with sanctions, the U.S. slapped tariffs on Brazilian goods, due in part to what Trump called unjust persecution of Bolsonaro.</p><p>\n              But ties improved after Lula and Trump met briefly at the U.N. General Assembly in New York in September, where the U.S. president said they had an instant rapport. Late last year, the Trump administration lowered tariffs on some Brazilian goods and lifted sanctions on Moraes.</p><p><b>LULA COMES TO WASHINGTON</b></p><p>\n              The next big test in the Trump-Lula relationship may come in the next few weeks, as Lula said he plans to visit Washington in March. </p><p>\n              Lula has emerged as a leading critic of the U.S. operation to capture former Venezuelan leader Nicolas Maduro last month, as well as its efforts to cut off oil flows to Cuba.</p><p>\n              In addition to Beattie's new Brazil position and his work as the acting head of the State Department's educational and cultural affairs bureau, he is the president of the U.S. Institute of Peace, a national institute funded by Congress that is tasked with global conflict resolution. </p><p>\n              In December, the Trump administration renamed it the \"Donald J. Trump Institute of Peace,\" though the administration may not have legal authority to change its name.    </p><p>\n              During the 2024 presidential campaign, Beattie suggested the U.S. intelligence community could be behind attempts to kill Trump. He also drew accusations of racism and sexism for saying on social media that \"competent white men must be in charge if you want things to work\".</p><p>\n              In 2021, he tweeted: \"Imagine having respect for the State Department.\"</p><p></p><p> (Reporting by Gram Slattery and Humeyra Pamuk in Washington and Lisandra Paraguassu in BrasiliaEditing by Brad Haynes and Peter Graff)</p><p>\n            By Gram Slattery, Humeyra Pamuk and Lisandra Paraguassu</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-administration-taps-far-right-official-for-key-brazil-post-ce7e5cdfd88ef721",
            "pub_date": "2026-02-27 21:10:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orix Corporation Announces Management Changes, Effective March 1, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>ORIX Corporation announced regarding management changes. Name: Reiko Okubo; Present Position: Executive Officer Corporate Strategy and Management Unit Responsible for CEO?s Office and New Business; New Position: Executive Officer Corporate Strategy and Management Unit Responsible for CEO?s Office. Effective as of March 1, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/orix-corporation-announces-management-changes-effective-march-1-2026-ce7e5cdfd88ef727",
            "pub_date": "2026-02-27 21:11:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to Remove Artificial Dyes From Cereal Aisle -- Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Connor Hart </p><br/><p>\n  Target said it will only carry cereals made without certified synthetic colors at its stores, citing sales data and customer research showing a shift toward foods made without artificial additives. </p><!-- Article --><p>\n\n  The retailer said Friday it has worked closely with national brands and owned-brand partners to reformulate products where necessary. It plans to implement the change by the end of May. </p><p>\n\n  The shift comes as food makers face renewed scrutiny over additives. Health and Human Services Secretary Robert F. Kennedy Jr. has pushed to strip artificial food dyes from Americans' diets as part of the Trump administration's \"Make America Healthy Again\" movement, which argues synthetic colors and other ingredients contribute to chronic health problems. </p><p>\n\n  Large manufacturers have already begun adjusting their portfolios. Kraft Heinz has said it plans to remove dyes from its U.S. products by the end of 2027. Conagra Brands is similarly working to discontinue certain color additives by the end of next year, while Nestle USA has said it aims to eliminate certified food, drug and cosmetic colors from its U.S. food and beverage portfolio by mid-2026. </p><p>\n\n  Retailers are taking part too. Walmart said last fall it would remove synthetic dyes from its store-brand foods and phase out roughly 30 other ingredients, including certain artificial sweeteners and preservatives. </p><p>\n\n  Target has previously sought to position its food assortment around cleaner labels. The retailer in 2019 launched its largest private-label brand, Good &amp; Gather, without synthetic colors, artificial sweeteners and flavors. </p><p>\n\n  The cereal shift is part of a broader effort by Target to sharpen its merchandise assortment and rebuild momentum after several uneven years marked by weaker discretionary spending and operational challenges in stores. The company is investing billions in store remodels, improved inventory systems and e-commerce capabilities as it works to regain shoppers' confidence. </p><p>\n\n  \"We know consumers are increasingly prioritizing healthier lifestyles, and we're moving quickly to evolve our offerings to meet their needs,\" Chief Merchandising Officer Cara Sylvester said. </p><br/><p>\n  Write to Connor Hart at connor.hart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0808ET</p></div>",
            "link": "https://hk.marketscreener.com/news/target-to-remove-artificial-dyes-from-cereal-aisle-update-ce7e5cdfd88ef724",
            "pub_date": "2026-02-27 21:11:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's January net gold imports via Hong Kong rose almost 69% from December",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-january-net-gold-imports-via-hong-kong-rose-almost-69-from-december-ce7e5cdfd88fff2d",
            "pub_date": "2026-02-27 21:11:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bel declares dividend of 1.95 rupees per share",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bel-declares-dividend-of-1-95-rupees-per-share-ce7e5cdfd88fff26",
            "pub_date": "2026-02-27 21:11:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pakistan bonds slip, Egypt and Jordan also fall",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/pakistan-bonds-slip-egypt-and-jordan-also-fall-ce7e5cdfd88ff023",
            "pub_date": "2026-02-27 21:11:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omani foreign minister to meet with U.S. vice president Vance in Washington on Friday -source familiar",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/omani-foreign-minister-to-meet-with-u-s-vice-president-vance-in-washington-on-friday-source-famili-ce7e5cdfd88ff025",
            "pub_date": "2026-02-27 21:11:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Stock Futures Lower Ahead of Key Inflation Report Amid Tech Volatility",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-lower-ahead-of-key-inflation-report-amid-tech-volatility-ce7e5cdfd88ff426",
            "pub_date": "2026-02-27 21:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ISO trims 2025/26 global sugar surplus forecast",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iso-trims-2025-26-global-sugar-surplus-forecast-ce7e5cdfd88ff620",
            "pub_date": "2026-02-27 21:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novartis Says EMA Panel Recommends Remibrutinib for Chronic Spontaneous Urticaria",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/novartis-says-ema-panel-recommends-remibrutinib-for-chronic-spontaneous-urticaria-ce7e5cdfd88dfe2c",
            "pub_date": "2026-02-27 21:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fall on AI concerns, Nasdaq set for steep monthly loss",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - U.S. stock index futures slid on Friday as growing AI unease dragged on tech stocks, with the Nasdaq on track for its steepest monthly drop since March 2025, and investors awaited key inflation data later in the day.</p><p>\n              Technology stocks saw immense turbulence this month due to AI concerns, even as investors fretted about the payoff from massive planning spending on artificial-intelligence technology.</p><!-- Article --><p>\n              Brewing tariff uncertainty also stoked volatility after the U.S. Supreme Court last week voided most of the duties U.S. President Donald Trump imposed last year. In response, Trump announced a temporary global tariff of 10% that came into effect on Tuesday. </p><p>\n              Nvidia shares inched 0.1% lower in premarket trading after sliding more than 5% in the previous session despite strong earnings, a sign that risk sentiment for all things AI remained shaky.</p><p>\n              \"It's easy to feel anxious when the tech darlings that carried the market stumble,\"  said Brian Jacobsen, chief economic strategist at Annex Wealth Management.  </p><p>\n              \"We are witnessing a true market rotation, where opportunities are broadening out beyond a handful of megacap tech stocks and flowing into value stocks, small-caps and industrial sectors.\" </p><p>\n              Zscaler lost 10.5% after the cloud security firm reported a wider net loss in the second quarter, while Intuit dipped 3.1% after the financial software company forecast third-quarter profit below estimates. </p><p>\n              Software shares were rocked earlier this year on fears of industrywide AI-led disruptions. Financial brokerages, data analytics and legal services, real estate services and trucking are also hit hard by brewing AI concerns. </p><p>\n              The S&amp;P 500 and the Nasdaq clocked losses in the last session, with the Nasdaq closing below its 50-day moving average for the 17th straight session. The closely followed moving average is seen as a proxy for the intermediate-term trend. </p><p>\n              However, the Dow Jones Industrial Average was set to log 10 straight months of gains. </p><p>\n              In economic data, a January producer prices reading due before the bell could offer insights into the U.S. Federal Reserve's interest rate path. </p><p>\n              At 07:31 a.m. ET, Dow E-minis lost 294 points, or 0.59%, S&amp;P 500 E-minis fell 27.75 points, or 0.4%, and Nasdaq 100 E-minis shed 98.25 points, or 0.39%. </p><p>\n              Most megacap and growth stocks inched lower. Chip stocks including AMD and Broadcom also declined. </p><p>\n              Netflix added 8.1% as investors cheered its decision to exit the fight for Warner Bros Discovery, which fell 1.4%. Paramount Skydance rose 7.5% after winning the race for some of the world's most prized TV and film assets. </p><p>\n              Block surged 20% after the payments firm said it would cut over 4,000 jobs, nearly half its workforce, as part of an overhaul to embed artificial intelligence across its operation. </p><p>\n              Dell climbed 12.1% after the PC-maker said it expects revenue from its key AI-optimized servers business to double in fiscal year 2027 and promised to return more cash to shareholders.</p><p>\n              Duolingo dropped 24.2% after the language-learning app forecast first-quarter and 2026 bookings below expectations.</p><p></p><p> (Reporting by Shashwat Chauhan and Ragini Mathur in Bengaluru; Editing by Pooja Desai)</p><p>\n            By Shashwat Chauhan and Ragini Mathur</p></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-fall-on-ai-concerns-nasdaq-set-for-steep-monthly-loss-ce7e5cdfd88df020",
            "pub_date": "2026-02-27 21:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese embassy in Israel: asks nationals to strengthen security precautions and emergency preparedness - statement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chinese-embassy-in-israel-asks-nationals-to-strengthen-security-precautions-and-emergency-preparedn-ce7e5cdfd88df024",
            "pub_date": "2026-02-27 21:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-on-the-day-ahead-in-canada-ce7e5cdfd88df120",
            "pub_date": "2026-02-27 20:56:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Regeneron, Sanofi's Dupixent Recommended for EU Approval to Treat CSU in Children",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/regeneron-sanofi-s-dupixent-recommended-for-eu-approval-to-treat-csu-in-children-ce7e5cdfd88df526",
            "pub_date": "2026-02-27 20:56:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury 10-year yield falls below 4%, hits lowest since late November, last down 3.4 bps at 3.981%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-10-year-yield-falls-below-4-hits-lowest-since-late-november-last-down-3-4-bps-at-3-98-ce7e5cdfd88df722",
            "pub_date": "2026-02-27 20:50:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Premarket Gainers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-premarket-gainers-ce7e5cdfd88aff25",
            "pub_date": "2026-02-27 20:50:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nam Cheong logs FY revenue 619.7 mln RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nam-cheong-logs-fy-revenue-619-7-mln-rgt-ce7e5cdfd88aff24",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. equity fund inflows cooled ahead of Nvidia's earnings",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-equity-fund-inflows-cooled-ahead-of-nvidia-s-earnings-ce7e5cdfd88af023",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}