{
    "data": [
        {
            "title": "LSEG plans $4.1 billion buyback amid investor pressure",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: London Stock Exchange Group said on Thursday it would buy back a further $4.1 billion of shares over the next year.</p><p>\n              It's under pressure from activist investor Elliott Management and worries AI could squeeze its business.</p><!-- Article --><p>\n              LSEG executives said the buyback was not a response to New York-based Elliott, which has recently emerged as a shareholder. </p><p>\n              A source told Reuters it is pressing CEO David Schwimmer to review LSEG's portfolio, lift margins that trail rivals, and better communicate its resilience to AI threats.</p><p>\n              Shares in LSEG rose more than 6% by mid-morning trade.</p><p>\n              Analysts welcomed the buyback, new guidance for 2027 to 2029.</p><p>\n              And slightly better-than-expected forecasts for this year.</p><p>\n              LSEG shares had lost around 30% of their value in the past year.</p><p>\n              As the data and exchanges group was dragged into concerns that AI will hit its business and those of its peers.</p><p>\n              Schwimmer has dismissed the risk that AI models will replace its data business.</p><p>\n              It has already struck deals with OpenAI and Anthropic that allow their users to access and interrogate its data.</p></div>",
            "link": "https://hk.marketscreener.com/news/lseg-plans-4-billion-buyback-amid-investor-pressure-ce7e5cd8dc88f12c",
            "pub_date": "2026-02-26 21:56:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-on-the-day-ahead-in-canada-ce7e5cd9db8dfe25",
            "pub_date": "2026-02-26 21:45:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China c.bank: supports domestic banks to carry out yuan cross-border interbank financing business in accordance with principles of legal compliance and risk controllability - statement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-c-bank-supports-domestic-banks-to-carry-out-yuan-cross-border-interbank-financing-business-in-ce7e5cd9db8dff2d",
            "pub_date": "2026-02-26 21:45:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fitch Affirms Engie's Rating Over UK Power Networks Deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fitch-affirms-engie-s-rating-over-uk-power-networks-deal-ce7e5cd9db8df122",
            "pub_date": "2026-02-26 21:45:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC and Canada's other biggest lenders beat profit estimates as economy resists tariff impact",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Canada's six biggest banks all exceeded profit forecasts this week in results boosted by wealth management and fee-based income, underlining the resilience of the country's economy to the impact of U.S. tariffs and broader policy uncertainty.</p><p>\n              On Thursday, Royal Bank of Canada &lt;&gt;, TD Bank &lt;&gt; and CIBC &lt;&gt;  beat analysts' profit estimates, as did BMO Financial and National Bank on Wednesday and Bank of Nova Scotia that delivered their results earlier this week. </p><!-- Article --><p>\n              Prime Minister Mark Carney's diversification of trade ties has helped the economy to perform better than expected in the November-January quarter, in turn giving the banks a boost. </p><p>\n              \"There's still some uncertainty in the market, but what we're seeing is that consumers are continuing to show resilience and they are feeling a little bit better,\" TD's CFO Kelvin Tran told Reuters in an interview. </p><p><b>MARKETS ARE ADJUSTING TO UNCERTAINTIES </b></p><p>\n              Canada's banks have a large U.S. exposure, with some referring to the country as a second home market as it has provided opportunities to expand their retail network and build their capital market business.</p><p>\n              TD is among the banks to have invested heavily in U.S. retail banking, until an anti-money laundering investigation into the bank paused the expansion. It pleaded guilty to violating a federal law in 2024.</p><p>\n              In recent months, tension between the U.S. and Canada has increased, primarily over trade. The United States-Mexico-Canada Agreement, a continental trade pact that has shielded much of Canada's exports from U.S. tariffs, is set for review by a July 1 deadline.</p><p>\n              \"(Those uncertainties) are something that the market is adjusting and adapting to,\" Tran said. </p><p><b>STRONG FEE INCOME OFFSETS UNCERTAINTY</b></p><p>\n              Canadian lenders have relied more on fee-based, higher-margin wealth businesses and expanding their advisory network to capture clients relatively sheltered from weakened business and consumer confidence.</p><p>\n              At RBC, Canada's biggest bank by market capitalisation, higher fees boosted earnings at its advisory unit by 32%.</p><p>\n              The upbeat earnings that have resulted put the banks on track to reach their targets for mid-term return on equity, a profit metric that demonstrates how effectively a bank generates profits from its shareholders' investments. </p><p>\n              RBC's adjusted ROE of 17.8% met its target of 17% or higher. </p><p>\n              Meanwhile, RBC, TD and CIBC all reported growth at domestic retail banking segments of 17%, 12% and 25% respectively, largely benefiting from higher net interest income, or earnings on loans minus deposit costs. </p><p>\n              Net income in RBC's capital markets segment increased 3%, at CIBC it rose 42%. TD Bank's wholesale banking segment recorded a 65% rise in adjusted net income.  </p><p>\n              RBC's earnings of C$4.08 per share surpassed analysts' average estimates of C$3.85, according to LSEG data. TD recorded earnings of C$2.44 per share, beating the estimate of C$2.26. CIBC's EPS of C$2.76 was well above the estimate of C$2.40. </p><p>\n              ($1 = 1.3676 Canadian dollars)</p><p></p><p>(Reporting by Utkarsh Shetti, Ateev Bhandari and Arasu Kannagi Basil in Bengaluru, Nivedita Balu in Toronto; Editing by Shilpi Majumdar and Barbara Lewis)</p><p>\n            By Nivedita Balu and Utkarsh Shetti</p></div>",
            "link": "https://hk.marketscreener.com/news/rbc-and-canada-s-other-biggest-lenders-beat-profit-estimates-as-economy-resists-tariff-impact-ce7e5cd9db8df225",
            "pub_date": "2026-02-26 21:45:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Dollar Rises Early Thursday Ahead of Jobless Claims, Natural Gas Stocks, Kansas City Fed Manufacturing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-dollar-rises-early-thursday-ahead-of-jobless-claims-natural-gas-stocks-kansas-city-fed-manufact-ce7e5cd9db8df327",
            "pub_date": "2026-02-26 21:45:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia eyes higher Urals oil exports to China amid Indian cutbacks, traders say",
            "description": "<div class=\"txt-s4 article-text\"><p>MOSCOW, Feb 26 (Reuters) - Russia will aim to keep its Urals crude oil exports steady in March by boosting shipments to China as India, a key buyer, cuts purchases following a trade deal with the U.S.    </p><p>\n              Export options for seaborne Urals cargoes are set to narrow next month, with India expected to sharply reduce intake. Suppliers are turning to China, the world's top crude importer, as Turkey - the third-largest Urals buyer - lacks the capacity to process more Russian barrels.</p><!-- Article --><p>\n              In the current market, Russia has two main choices: increase discounts or curb production. Both would add pressure to Kremlin budget revenues, one trader said.    </p><p>\n              Market participants anticipate discounts for Urals in China could widen by $2-$5 per barrel from the current $10-$12 on a delivered-to-port basis, with some expecting deeper cuts in the months ahead.</p><p>\n              \"There haven't been any fresh Urals deals in China yet, but traders are preparing for negotiations to start at around minus $15 per barrel on a DES (delivered ex ship) basis,\" a trading source told Reuters.</p><p>\n              Russian oil imports to China could rise for a third consecutive month in February, potentially reaching a record 2.1 million barrels per day as independent refiners take advantage of discounted cargoes following India's reduced buying.</p><p>\n              Even so, some market participants warn that Chinese demand for Russian oil may be nearing its peak. </p><p>\n              \"April could be a critical month for shipments. The Chinese 'teapots' (small refiners) will have bought up supplies, demand may drop, and Russia could be forced to cut production. But the situation remains fluid,\" said a source at a major Western oil company.</p><p>\n              Further discounting may help sustain high import volumes in China over the coming months, sources added.</p><p>\n              India is expected to sharply reduce Urals imports from March, with volumes in April projected to fall to about 400,000 bpd. Nayara refinery will likely be the only remaining importer, market sources said.    </p><p>\n              India's imports of Russian oil fell 12% in January from December, and the downward trend is expected to continue this month. </p><p></p><p> (Reporting by Reuters. Editing by Mark Potter)</p></div>",
            "link": "https://hk.marketscreener.com/news/russia-eyes-higher-urals-oil-exports-to-china-amid-indian-cutbacks-traders-say-ce7e5cd9db8df423",
            "pub_date": "2026-02-26 21:45:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dae to buy Macquarie AirFinance for enterprise value of $7 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dae-to-buy-macquarie-airfinance-for-enterprise-value-of-7-billion-ce7e5cd9db8df723",
            "pub_date": "2026-02-26 21:40:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia shares open firmer in Frankfurt on higher earnings forecast",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-shares-open-firmer-in-frankfurt-on-higher-earnings-forecast-ce7e5cd9db8afe22",
            "pub_date": "2026-02-26 21:40:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMCOR Group, Inc. Provides Earnings Guidance for Full Year 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>EMCOR Group, Inc. provided earnings guidance for the full year 2026. For the period, the company expects revenues of $17.75 billion ? $18.50 billion, Operating Margin of 9.0% ?</p><p>9.4% and Diluted EPS of $27.25 ? $29.25.</p></div>",
            "link": "https://hk.marketscreener.com/news/emcor-group-inc-provides-earnings-guidance-for-full-year-2026-ce7e5cd9db8aff27",
            "pub_date": "2026-02-26 21:40:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. dollar index little changed after data, last up 0.03% at 97.64",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-dollar-index-little-changed-after-data-last-up-0-03-at-97-64-ce7e5cd9db8af125",
            "pub_date": "2026-02-26 21:40:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Euro up 0.01% at $1.1812",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/euro-up-0-01-at-1-1812-ce7e5cd9db8af223",
            "pub_date": "2026-02-26 21:40:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dollar/yen down 0.19% at 156.03",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dollar-yen-down-0-19-at-156-03-ce7e5cd9db8af224",
            "pub_date": "2026-02-26 21:40:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A peculiar behavior that's worth calling out",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/a-peculiar-behavior-that-s-worth-calling-out-ce7e5cd9db8af52d",
            "pub_date": "2026-02-26 21:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arabian Gulf Steel Industries Secures Green Facility from Emirates NBD",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arabian-gulf-steel-industries-secures-green-facility-from-emirates-nbd-ce7e5cd9db8bfe2d",
            "pub_date": "2026-02-26 21:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (LNG) Cheniere Energy Posts Q4 Total Revenue $5.45B, vs. FactSet Est of $5.63B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-lng-cheniere-energy-posts-q4-total-revenue-5-45b-vs-factset-est-of-5-63b-ce7e5cd9db8bf124",
            "pub_date": "2026-02-26 21:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (LNG) Cheniere Energy Posts Q4 EPS $10.68",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-lng-cheniere-energy-posts-q4-eps-10-68-ce7e5cd9db88fe22",
            "pub_date": "2026-02-26 21:35:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DHL, JD.com sign MoU to help German brands enter China",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dhl-jd-com-sign-mou-to-help-german-brands-enter-china-ce7e5cd9db88ff27",
            "pub_date": "2026-02-26 21:35:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Italy's Eni posts 35% adjusted net profit rise on strong upstream business",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/italy-s-eni-posts-35-adjusted-net-profit-rise-on-strong-upstream-business-ce7e5cd9db88ff26",
            "pub_date": "2026-02-26 21:35:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EBay is laying off about 800 workers, 6% of global workforce - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ebay-is-laying-off-about-800-workers-6-of-global-workforce-bloomberg-news-ce7e5cd9db88f02d",
            "pub_date": "2026-02-26 21:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell Reportedly Mulls Offloading Some Shell Ventures Investments",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shell-reportedly-mulls-offloading-some-shell-ventures-investments-ce7e5cd9db88f021",
            "pub_date": "2026-02-26 21:36:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (EME) EMCOR Group, Inc. Reports Q4 Revenue $4.51B, vs. FactSet Est of $4.28B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-eme-emcor-group-inc-reports-q4-revenue-4-51b-vs-factset-est-of-4-28b-ce7e5cd9db88f120",
            "pub_date": "2026-02-26 21:36:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (EME) EMCOR Group, Inc. Posts Q4 Adjusted EPS $7.19 per Share, vs. FactSet Est of $6.68",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-eme-emcor-group-inc-posts-q4-adjusted-eps-7-19-per-share-vs-factset-est-of-6-ce7e5cd9db88f22d",
            "pub_date": "2026-02-26 21:36:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Norway's wealth fund using AI to screen for ESG risks",
            "description": "<div class=\"txt-s4 article-text\"><p>OSLO, Feb 26 (Reuters) - Norway's $2.2 trillion sovereign wealth fund, the world's largest, is using AI to screen companies for risks such as potential links to forced labour and corruption, and help avoid financial losses as a result, it said on Thursday.</p><p>\n              One of the world's largest investors, the fund holds stakes in around 7,200 companies globally, owning about 1.5% of all listed stocks. It has often set the pace on environmental, social and governance issues. </p><!-- Article --><p>\n              The fund's investments are measured against a benchmark index set by the finance ministry, with equities tracked against the FTSE Global All Cap index.</p><p>\n              Each time that index includes new companies, the fund's operator, Norges Bank Investment Management (NBIM), must screen them before they enter the portfolio.</p><p>\n              Since 2025, NBIM has used large language models to screen all companies on the day they enter the equity portfolio, rapidly scanning for public information that data vendors typically do not provide.</p><p>\n              \"Within 24 hours of our investment, the AI tools flag new companies in the fund's equity portfolio with potential links to, for example, forced labour, corruption or fraud,\" NBIM said in its annual responsible investment report, published on Thursday.</p><p>\n              \"In multiple instances, we identified and sold these investments before the broader market reacted to the risks, avoiding potential losses.\"</p><p>\n              AI is especially useful for researching smaller companies in emerging markets, NBIM said, noting that data vendors often offer limited coverage and international media may not report on them.</p><p>\n              \"News may be limited to small media outlets in local languages, and controversies suggesting systemic failures in risk management may go unreported in international media,\" it said. </p><p></p><p> (Reporting by Gwladys Fouche in Oslo. Editing by Mark Potter)</p></div>",
            "link": "https://hk.marketscreener.com/news/norway-s-wealth-fund-using-ai-to-screen-for-esg-risks-ce7e5cd9db88f320",
            "pub_date": "2026-02-26 21:36:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NextEra Energy Plans Public Offering of $2 Billion of Equity Units",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nextera-energy-plans-public-offering-of-2-billion-of-equity-units-ce7e5cd9db89f423",
            "pub_date": "2026-02-26 21:30:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Robots welcome German chancellor on second day of China visit",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: :: Robots welcome German chancellor Friedrich Merz on the second day of his visit to China</p><p>\n              :: Hangzhou, China / February 26, 2025</p><!-- Article --><p>\n              On his two-day trip to China the chancellor was accompanied by top executives from 30 German firms including top carmakers such as Volkswagen and BMW which are acutely feeling the strain of Chinese competition - contributing to the growing trade imbalance.</p><p>\n              China has been seeking to present itself as a reliable economic partner, as Europe struggles with a new, less-certain relationship with Washington and the vulnerabilities in its supply chains exposed last year.</p></div>",
            "link": "https://hk.marketscreener.com/news/robots-welcome-german-chancellor-on-second-day-of-china-visit-ce7e5cd9db89f62c",
            "pub_date": "2026-02-26 21:30:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LSEG plans $4 billion buyback amid investor pressure",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lseg-plans-4-billion-buyback-amid-investor-pressure-ce7e5cd9db89f727",
            "pub_date": "2026-02-26 21:30:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia's Sberbank says 2025 net profit at 1.7 trln roubles",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russia-s-sberbank-says-2025-net-profit-at-1-7-trln-roubles-ce7e5cd9d880fe20",
            "pub_date": "2026-02-26 21:30:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NextEra Energy to Sell $2 Billion of Equity Units in Public Offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nextera-energy-to-sell-2-billion-of-equity-units-in-public-offering-ce7e5cd9d880f227",
            "pub_date": "2026-02-26 21:30:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU court adviser rejects Meta's fight against EU antitrust demands for Facebook data",
            "description": "<div class=\"txt-s4 article-text\"><p>BRUSSELS, Feb 26 (Reuters) - An adviser to Europe's top court on Thursday backed Meta Platforms' fight against EU antitrust regulators over what the U.S. tech giant said were aberrant requests for information from the later during two investigations into the company.</p><p>\n              Meta had taken its case to the Luxembourg-based Court of Justice of the European Union, questioning EU demands related to its Facebook social network and online classified ads.</p><!-- Article --><p>\n              \"In his opinion, Advocate General Athanasios Rantos proposes that the Court of Justice dismiss both appeals and uphold the judgments of the General Court\", the court said in a statement, adding that Rantos said in his non-binding opinion that the General Court \"did not err in law in assessing the necessity of the information requested or in examining the safeguards for its provision.\"</p><p>\n              Judges, who usually follow the majority of such recommendations, will rule in the coming months.</p><p>\n              The cases are C-496/23 P Meta Platforms Ireland v Commission (Facebook Marketplace) and C-497/23 P Meta Platforms Ireland v Commission (Facebook Data).</p><p></p><p> (Reporting by Foo Yun Chee, Editing by Charlotte Van Campenhout)</p></div>",
            "link": "https://hk.marketscreener.com/news/eu-court-adviser-rejects-meta-s-fight-against-eu-antitrust-demands-for-facebook-data-ce7e5cd9d880f721",
            "pub_date": "2026-02-26 21:16:25",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's Rolls-Royce annual profit soars 40%, upgrades outlook",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-s-rolls-royce-annual-profit-soars-40-upgrades-outlook-ce7e5cd9d881ff2d",
            "pub_date": "2026-02-26 21:16:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DHL Group and JD.com sign memorandum of understanding",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dhl-group-and-jd-com-sign-memorandum-of-understanding-ce7e5cd9d881f020",
            "pub_date": "2026-02-26 21:16:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "S.Korean shares hit record on chip, auto surge; president says market 'normalising'",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/s-korean-shares-hit-record-on-chip-auto-surge-president-says-market-normalising-ce7e5cd9d881f124",
            "pub_date": "2026-02-26 21:16:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LSEG plans $4 billion buyback amid investor pressure",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lseg-plans-4-billion-buyback-amid-investor-pressure-ce7e5cd9d881f226",
            "pub_date": "2026-02-26 21:16:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GSK plc Announces That Japan's Ministry of Health, Labour and Welfare Accepts for Review A New Drug Application for Bepirovirsen",
            "description": "<div class=\"txt-s4 article-text\"><p>GSK plc announced that Japan's Ministry of Health, Labour and Welfare (MHLW) has accepted for review a new drug application (NDA) for bepirovirsen, an investigational antisense oligonucleotide (ASO), for the treatment of adults with chronic hepatitis B (CHB). Chronic hepatitis B is a major public health challenge, affecting more than 250 million people worldwide and nearly one million people in Japan. The current standard of care - nucleos(t)ide analogues - often requires lifelong therapy and the functional cure rates remain low, typically only 1%.</p><p>Functional cure occurs when the chronic hepatitis B virus DNA and viral protein - hepatitis B surface antigen (HBsAg) - are at levels low enough to be undetectable in the blood for at least 24 weeks after stopping all treatment, and can be controlled by the immune system without medication. Functional cure is associated with significant reduction in the risk of long-term liver complications, including liver cancer. It is estimated that ~56% of liver cancer cases globally are caused by CHB.</p><!-- Article --><p>The regulatory submission is supported by positive results from the B-Well 1 and B-Well 2 Phase III trials, where bepirovirsen demonstrated a statistically significant and clinically meaningful functional cure rate. Functional cure rates were significantly higher with bepirovirsen plus standard of care compared with standard of care alone across all ranked endpoints, including in patients with lower baseline HBsAg levels where an even greater effect was observed. Bepirovirsen demonstrated an acceptable safety and tolerability profile consistent with previous studies.</p><p>The data are anticipated to be presented at a congress and submitted for scientific peer-reviewed publication in 2026. Bepirovirsen was granted SENKU designation in Japan in August 2024, reflecting its innovation and potential to address a disease with high unmet medical need. SENKU designation is intended to facilitate early patient access through an expedited regulatory review process.</p></div>",
            "link": "https://hk.marketscreener.com/news/gsk-plc-announces-that-japan-s-ministry-of-health-labour-and-welfare-accepts-for-review-a-new-drug-ce7e5cd9d881f623",
            "pub_date": "2026-02-26 21:16:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros. Discovery Q4 Loss Narrows, Revenue Decreases",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-discovery-q4-loss-narrows-revenue-decreases-ce7e5cd9d881f722",
            "pub_date": "2026-02-26 21:16:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Public Service Enterprise Group Incorporated Declares Quarterly Dividend for the First Quarter of 2026, Payable on or Before March 31, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of Public Service Enterprise Group declared a $0.67 per share quarterly common stock dividend for the first quarter of 2026, payable on or before March 31, 2026, to shareholders of record on March 10, 2026. This action represents an increase of $0.04 per share in the company's quarterly common stock dividend, bringing the 2026 indicative annual rate to $2.68 per share.</p></div>",
            "link": "https://hk.marketscreener.com/news/public-service-enterprise-group-incorporated-declares-quarterly-dividend-for-the-first-quarter-of-20-ce7e5cd9d88ef122",
            "pub_date": "2026-02-26 21:16:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-Geopolitical turmoil gives OPEC+ cover for cautious output hike: Bousso",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-geopolitical-turmoil-gives-opec-cover-for-cautious-output-hike-bousso-ce7e5cd9d88ef320",
            "pub_date": "2026-02-26 21:10:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oversea-Chinese Banking Corporation Limited Prices USD 500,000,000 of Tier 2 Subordinated Notes",
            "description": "<div class=\"txt-s4 article-text\"><p>Oversea-Chinese Banking Corporation Limited (\"OCBC\" or the \"Bank\") has priced USD 500,000,000 of fixed rate subordinated notes (\"Notes\") under its USD30 billion Global Medium Term Note Programme (\"Programme\"). The net proceeds from the issue of the Notes will be used for general corporate purposes of OCBC. The Notes are expected to qualify as Tier 2 capital of the Bank under the requirements of the Monetary Authority of Singapore (\"MAS\").</p><p>The Notes are priced at 100%, and will bear a coupon of 4.517% per annum from the issue date to the call date on 4 March 2031 (\"Call Date\"). If the Notes are not redeemed, the interest rate from the Call Date to the maturity date on 4 March 2036 will be reset to a fixed rate per annum equal to the aggregate of the then-prevailing 5-year U.S. Treasury Rate and 0.90%. As a Basel III capital instrument, if the Bank is determined by MAS to be non-viable, the Notes will be written off in whole or in part and may be subject to cancellation, modification, conversion, or change in form under MAS?s powers pursuant to the Financial Services and Markets Act 2022 of Singapore without prior notice.</p><!-- Article --><p>Citigroup Global Markets Singapore Pte. Ltd., ING Bank N.V., Singapore Branch, J.P. Morgan Securities Asia Private Limited, Oversea-Chinese Banking Corporation Limited, The Toronto-Dominion Bank and Wells Fargo Securities International Limited acted as Joint Lead Managers and Joint Bookrunners. The Notes are expected to be rated A2 by Moody?s Investors Service, BBB+ by Standard &amp; Poor?s and A by Fitch Ratings Ltd, issued on 4 March 2026, and listed on the Singapore Exchange Securities Trading Limited on 5 March 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/oversea-chinese-banking-corporation-limited-prices-usd-500-000-000-of-tier-2-subordinated-notes-ce7e5cd9d88ef420",
            "pub_date": "2026-02-26 21:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "London Stock Exchange Group plc Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>London Stock Exchange Group plc reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was GBP 9,081 million compared to GBP 8,579 million a year ago. Revenue was GBP 9,346 million compared to GBP 8,858 million a year ago.</p><p>Net income was GBP 1,249 million compared to GBP 685 million a year ago. Basic earnings per share from continuing operations was GBP 2.384 compared to GBP 1.288 a year ago. Diluted earnings per share from continuing operations was GBP 2.37 compared to GBP 1.28 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/london-stock-exchange-group-plc-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9d88ef621",
            "pub_date": "2026-02-26 21:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}