{
    "data": [
        {
            "title": "No US combat casualties despite Iranian retaliation, U.S. military says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/no-us-combat-casualties-despite-iranian-retaliation-u-s-military-says-ce7e5cdcd98aff27",
            "pub_date": "2026-03-01 02:25:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Centcom: Damage to U.S. installations was minimal and has not impacted operations",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-centcom-damage-to-u-s-installations-was-minimal-and-has-not-impacted-operations-ce7e5cdcd98af720",
            "pub_date": "2026-03-01 02:11:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Centcom: There have been no reports of U.S. casualties or combat-related injuries",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-centcom-there-have-been-no-reports-of-u-s-casualties-or-combat-related-injuries-ce7e5cdcd98af726",
            "pub_date": "2026-03-01 02:11:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Centcom: Centcom forces successfully defended against hundreds of Iranian missile and drone attacks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-centcom-centcom-forces-successfully-defended-against-hundreds-of-iranian-missile-and-drone-attac-ce7e5cdcd98bfe2c",
            "pub_date": "2026-03-01 02:11:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Three members of Iran's IRGC-linked Basij paramilitary forces killed in Israeli-US attacks - Mehr News Agency",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/three-members-of-iran-s-irgc-linked-basij-paramilitary-forces-killed-in-israeli-us-attacks-mehr-ne-ce7e5cdcd988f323",
            "pub_date": "2026-03-01 01:36:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on lower insurance income, Occidental writedown",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 28 (Reuters) - Berkshire Hathaway said on Saturday operating profit fell in the fourth quarter, reflecting lower income from its insurance operations, and wrote down a longstanding investment in Occidental Petroleum.</p><p>\n              The quarter was Warren Buffett's last as the conglomerate's chief executive, a job now held by Greg Abel. Buffett remains chairman.</p><!-- Article --><p>\n              Berkshire reported ending 2025 with $373.3 billion of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</p><p>\n              The quarter was also the 13th in a row in which Berkshire sold more stocks than it bought, and the sixth straight with no share buybacks.</p><p>\n              Quarterly operating profit fell 30% to $10.2 billion, or about $7,092 per Class A share, from $14.53 billion a year earlier.</p><p>\n              Much of this came from a 38% drop in quarterly insurance profit. Falling interest rates reduced income on Berkshire's cash, while pricing pressures limited the willingness of the Geico auto insurer and reinsurance businesses to add customers.</p><p><b>ABEL PAYS TRIBUTE TO BUFFETT</b></p><p>\n              Net income fell 3% to $19.2 billion from $19.69 billion, as the writedown and lower operating profit offset the value of Berkshire's holdings in Apple, American Express and other stocks.</p><p>\n              For the full year, operating profit fell 6% to $44.49 billion, while net income fell 25% to $66.97 billion.</p><p>\n              Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire is not selling.</p><p>\n              In his first annual letter to Berkshire shareholders, Abel paid tribute to his mentor, calling Buffett a \"remarkable CEO\" and \"arguably the greatest investor of all time\" and pledging to maintain his discipline in investing Berkshire's capital.</p><p>\n              \"We are committed to strengthening the great legacy built by Warren Buffett and his business partner Charlie Munger, ensuring it endures through our commitment to excellence,\" Abel wrote, referring to Berkshire's late vice chairman. \"I recognize how you want us to succeed together, and to do so in the right way.\"</p><p>\n              Abel also said some of Berkshire's businesses needed better operating performance.  He is widely expected to have a more hands-on role than Buffett in overseeing them, though the businesses are expected to maintain their general day-to-day autonomy.</p><p>\n              \"Top-line growth is a challenge, and Abel teed up an expectation that reinsurance and commercial insurance growth may be nonexistent in 2026,\" said Cathy Seifert, an analyst at CFRA Research in New York. \"Revenue growth across the board was also pretty tepid.\"</p><p><b>DECLINE IN OCCIDENTAL SHARE PRICE NOT TEMPORARY</b></p><p>\n              Berkshire's $4.5 billion writedown of its 26.9% stake in Occidental reflected its belief that the oil company's declining stock price was not \"temporary,\" though it said it had no intention to sell any of its stock.</p><p>\n              Buffett began investing in Occidental in 2019 by helping finance that company's purchase of Anadarko Petroleum, and has often praised Occidental's leadership.</p><p>\n              The writedown was Berkshire's second in 2025, in addition to a $3.76 billion writedown of its investment in Kraft Heinz.</p><p>\n              Geico said pretax underwriting profit fell by nearly half in the fourth quarter, as it spent more on advertising and accident claims increased.</p><p>\n              Profit at the BNSF railroad rose 6% in the fourth quarter, while profit from Berkshire's energy operations fell 5%.</p><p>\n              Berkshire also said profit from its manufacturing, retail and service businesses rose 3% in the quarter and 4% for the year, even as \"sluggish\" consumer demand contributed to full-year revenue declines at some consumer businesses, including Duracell, Fruit of the Loom and Squishmallows maker Jazwares.</p><p>\n              Lower gains related to foreign currency also weighed on operating profit.</p><p>\n              Berkshire shares have lagged the Standard &amp; Poor's 500 by more than 27 percentage points since Buffett announced May 3 he was stepping down.  Berkshire shares and the index have both risen less than 1% in 2026.</p><p>\n              (Reporting by Jonathan Stempel in New York; Editing by Louise Heavens, Lisa Shumaker, Rod Nickel)</p><p>\n            By Jonathan Stempel</p></div>",
            "link": "https://hk.marketscreener.com/news/berkshire-hathaway-profit-falls-on-lower-insurance-income-occidental-writedown-ce7e5cdfd081f220",
            "pub_date": "2026-03-01 01:22:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global reaction to US, Israeli attacks on Iran",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 28 (Reuters) - Israel and the United States launched strikes on Iran on Saturday, plunging the Middle East into a renewed military confrontation.</p><p>\n              Tehran responded by launching missiles at Israel and called the strikes against it unprovoked and illegal.</p><!-- Article --><p>\n              Below is international reaction to the attacks:</p><p><b>UNITED NATIONS SECRETARY-GENERAL ANTONIO GUTERRES</b></p><p>\n              \"I condemn today's military escalation in the Middle East. The use of force by the United States and Israel against Iran, and the subsequent retaliation by Iran across the region, undermine international peace and security.\" </p><p>\n              \"I call for an immediate cessation of hostilities and de-escalation. Failing to do so risks a wider regional conflict with grave consequences for civilians and regional stability. I strongly encourage all parties to return immediately to the negotiating table,\" he said.</p><p>\n              \"I reiterate that there is no viable alternative to the peaceful settlement of international disputes, in full accordance with international law, including the UN Charter.\" </p><p><b>GERMANY, FRANCE AND BRITAIN</b></p><p>\n              In a joint statement, the three countries condemned Iranian attacks, saying Iran must refrain from indiscriminate military strikes.</p><p>\n              \"We reiterate our commitment to regional stability and to the protection of civilian life,\" French President Emmanuel Macron, German Chancellor Friedrich Merz and British Prime Minister Keir Starmer said in a joint statement, adding that they wanted a resumption of negotiations.</p><p><b>FRENCH PRESIDENT EMMANUEL MACRON</b></p><p>\n              Macron called for an urgent meeting of the United Nations Security Council, saying the outbreak of a war between the United States, Israel and Iran has \"serious consequences\" for international peace and security.</p><p>\n              \"The current escalation is dangerous for everyone. It must stop. The Iranian regime must understand that it now has no other option but to engage in good-faith negotiations to end its nuclear and ballistic missile programs, as well as its actions to destabilise the region,\" Macron said on X.</p><p><b>UN HUMAN RIGHTS CHIEF VOLKER TURK</b></p><p>\n              \"I deplore the military strikes across Iran this morning by Israel and the United States of America, and the subsequent retaliatory strikes by Iran. As always, in any armed conflict, it is civilians who end up paying the ultimate price.</p><p>\n              \"Bombs and missiles are not the way to resolve differences but only result in death, destruction and human misery.</p><p>\n              \"To avert these terrible consequences for civilians, I call for restraint and implore all parties to see reason, to de-escalate, and for a return to the 'negotiating table' where they had been actively seeking a solution only hours earlier.  </p><p>\n              \"I have already warned that failing to do so risks an even wider conflict, that will inevitably lead to further senseless civilian deaths and destruction on a potentially unimaginable scale, not just in Iran but across the Middle East region.\"</p><p><b>CANADIAN PRIME MINISTER MARK CARNEY</b></p><p>\n              Canadian Prime Minister Mark Carney said that Canada supports the U.S. \"acting to prevent Iran from obtaining a nuclear weapon and to prevent its regime from further threatening international peace and security\".  </p><p><b>SPANISH PRIME MINISTER PEDRO SANCHEZ</b></p><p>\n              \"We demand immediate de-escalation and full respect for international law,\" Sanchez said in a statement posted on social media platform X.</p><p>\n              Spanish Foreign Minister Albares later said on X that Madrid demanded respect for international law, de-escalation and dialogue, showing support and solidarity with those who are receiving the strikes.</p><p>\n              \"The attacks must stop,\" he added.</p><p><b>OMAN</b></p><p>\n              Oman's Foreign Minister Badr Albusaidi said that active and serious negotiations mediated by his country between Iran and the U.S. were \"yet again undermined\".</p><p>\n              \"Neither the interests of the United States nor the cause of global peace are well served by this...I urge the United States not to get sucked in further. This is not your war,\" he said on X.</p><p><b>LEBANESE PRIME MINISTER NAWAF SALAM</b></p><p>\n              \"I reiterate that we will not accept anyone dragging the country into adventures that threaten its security and unity.\"</p><p><b>NORWEGIAN FOREIGN MINISTER ESPEN BARTH EIDE</b></p><p>\n              \"The attack is described by Israel as a preventive strike, but it is not in line with international law. Preventive attacks require an immediately imminent threat.\"    </p><p><b>UKRAINE'S FOREIGN MINISTRY</b></p><p>\n              \"The cause of the current events is precisely the violence and impunity of the Iranian regime, in particular the killings and repression of peaceful protesters, which have become particularly widespread in recent months,\" the foreign ministry said.    </p><p><b>DMITRY MEDVEDEV, DEPUTY CHAIRMAN OF RUSSIA'S SECURITY COUNCIL </b></p><p>\n              \"The peacemaker once again showed his face,\" Medvedev, a former Russian president, said. \"All negotiations with Iran are a cover operation. No one doubted it. No one really wanted to negotiate anything.\"</p><p>\n              \"The question is who has more patience to wait for the inglorious end of their enemy. The USA is only 249 years old. The Persian Empire was founded more than 2,500 years ago. Let's see in 100 years...\"</p><p></p><p> (Editing by Barbara Lewis)</p></div>",
            "link": "https://hk.marketscreener.com/news/global-reaction-to-us-israeli-attacks-on-iran-ce7e5cdcd989f022",
            "pub_date": "2026-03-01 01:11:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "All US, Israeli assets in region are legitimate military targets, Iran tells UN",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/all-us-israeli-assets-in-region-are-legitimate-military-targets-iran-tells-un-ce7e5cdfd080f521",
            "pub_date": "2026-03-01 00:30:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India braces for hotter-than-normal summer, more heatwave days expected",
            "description": "<div class=\"txt-s4 article-text\"><p>MUMBAI, Feb 28 (Reuters) - India is set to experience a hotter-than-normal summer this year, with heatwave days during March and May expected to exceed the seasonal average, the weather office said on Saturday.</p><p>\n              In March, the first month of the summer season, minimum temperatures are likely to remain above average across most areas, said Mrutyunjay Mohapatra, director-general of the India Meteorological Department (IMD).</p><!-- Article --><p>\n              In February, both maximum and minimum temperatures were above average, making it the fifth-warmest February since records began in 1901, according to IMD data.</p><p>\n              Winter crops such as wheat, rapeseed, and chickpeas are planted from October to December and require cold weather conditions throughout their growth cycle for optimal yields.</p><p>\n              Above-average temperatures in March could affect the grain size of maturing winter-sown crops, potentially reducing yields, said a Mumbai-based dealer with a global trade house.</p><p>\n              India, the world's second-largest wheat producer and biggest importer of edible oils, is counting on bumper 2026 crops to export surplus wheat and cut costly imports of palm, soy and sunflower oils.</p><p>\n              \"Above-normal heatwave days are expected over most parts of the country during March to May 2026,\" said Mohapatra.</p><p>\n               (Reporting by Rajendra Jadhav: Editing by Sharon Singleton)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-braces-for-hotter-than-normal-summer-more-heatwave-days-expected-ce7e5cdfd080f620",
            "pub_date": "2026-03-01 00:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maritime agency says it received reports on closure of Strait of Hormuz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/maritime-agency-says-it-received-reports-on-closure-of-strait-of-hormuz-ce7e5cdfd080f727",
            "pub_date": "2026-03-01 00:21:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran tells UN in letter: all US, Israeli bases, facilities, assets in the region are legitimate military targets",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-tells-un-in-letter-all-us-israeli-bases-facilities-assets-in-the-region-are-legitimate-mili-ce7e5cdfd080f726",
            "pub_date": "2026-03-01 00:21:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "White House says Trump spoke with Netanyahu, monitoring Iran situation",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/white-house-says-trump-spoke-with-netanyahu-monitoring-iran-situation-ce7e5cdfd081fe2d",
            "pub_date": "2026-03-01 00:17:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump's Iran strikes mark his biggest foreign policy gamble",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-s-iran-strikes-mark-his-biggest-foreign-policy-gamble-ce7e5cdfd081fe23",
            "pub_date": "2026-03-01 00:17:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UN nuclear watchdog sees no 'radiological impact' from strikes on Iran",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/un-nuclear-watchdog-sees-no-radiological-impact-from-strikes-on-iran-ce7e5cdfd081ff2d",
            "pub_date": "2026-03-01 00:17:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-Iran war throws oil market into biggest crisis in decades: Bousso",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-iran-war-throws-oil-market-into-biggest-crisis-in-decades-bousso-ce7e5cdfd081ff26",
            "pub_date": "2026-03-01 00:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OPEC+ may consider 411,000 bpd oil output boost, sources say after Iran strike",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/opec-may-consider-411-000-bpd-oil-output-boost-sources-say-after-iran-strike-ce7e5cdfd081ff24",
            "pub_date": "2026-03-01 00:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IAEA: Is in permanent contact with countries in the region, so far no evidence of any radiological impact",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iaea-is-in-permanent-contact-with-countries-in-the-region-so-far-no-evidence-of-any-radiological-i-ce7e5cdfd081f02c",
            "pub_date": "2026-03-01 00:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IAEA: Closely monitoring developments in the Middle East, and urges restraint to avoid any nuclear safety risks to people in the region",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iaea-closely-monitoring-developments-in-the-middle-east-and-urges-restraint-to-avoid-any-nuclear-s-ce7e5cdfd081f022",
            "pub_date": "2026-03-01 00:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prior to Iran attacks, U.S. CIA assessed that even if Supreme Leader Khamenei was killed, he would likely be replaced by hardline elements of the Islamic Revolutionary Guard Corps, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/prior-to-iran-attacks-u-s-cia-assessed-that-even-if-supreme-leader-khamenei-was-killed-he-would-l-ce7e5cdfd081f020",
            "pub_date": "2026-03-01 00:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Targeted by airstrikes, Ayatollah Khamenei has Iran in iron grip",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 28 (Reuters) - Among the first targets in U.S. and Israeli strikes on Iran on Saturday was the headquarters of Supreme Leader Ayatollah Ali Khamenei, an inveterate foe of the West who has crushed internal opposition while supporting proxy forces across the region. </p><p>\n              A source with knowledge of the matter said Khamenei had been transferred in advance to a secure location outside Tehran, but Reuters could not immediately verify his status, as satellite images showed significant damage to his Tehran compound.</p><!-- Article --><p>\n              Killing Khamenei, as an Israeli official said the strikes had tried to do, would deal a massive blow to the Islamic Republic that he has led since 1989, a decade after rising to prominence in the theocratic revolution that toppled Iran's monarchy and rocked the Middle East. </p><p><b>GRAVEST CRISIS OF KHAMENEI'S RULE</b></p><p>\n              The 86-year-old has survived foreign pressure before but, even before Saturday's attack, he was facing the gravest crisis of his 36-year rule, attempting to spin out negotiations with the United States over Iran's nuclear programme. </p><p>\n              Already this year, he has ordered the deadliest crackdown since the 1979 Islamic Revolution, saying those protesting nationwide, initially against soaring prices, \"should be put in their place\" before security forces opened fire on demonstrators chanting \"Death to the dictator!\". </p><p>\n              Only last June, Khamenei had been forced into hiding during 12 days of airstrikes by Israel and then the U.S. that killed several close associates and Revolutionary Guard commanders and smashed prized nuclear and missile facilities.</p><p>\n              That assault was among the many indirect results of the attack on Israel by the Iranian-backed Palestinian group Hamas on October 7, 2023, which not only triggered the war in Gaza but also spurred Israel to hammer Tehran's other regional proxies. </p><p>\n              With Hezbollah weakened in Lebanon and Syria's Bashar al-Assad toppled, Khamenei's reach across the Middle East has been stunted, while the U.S. has been demanding he abandon Iran's last major strategic lever - its ballistic missiles. </p><p>\n              Khamenei refused to even discuss giving up missiles, which Iran sees as its only remaining deterrent to Israeli attack, a display of intransigence that may have helped invite the latest airstrikes. </p><p>\n              As the U.S. military massed air and naval forces in the region, Khamenei's calculations drew on a character moulded by revolution, years of turmoil and war with Iraq, decades of sparring with the United States, and a ruthless accumulation of power.     </p><p>\n              While elected officials manage day-to-day affairs, no major policy - especially one concerning the United States - proceeds without his explicit approval; Khamenei's mastery of Iran's complex system of clerical rule combined with limited democracy ensures that no other group can challenge his decisions.    </p><p><b>AS LEADER, KHAMENEI WAS ONCE FAR FROM SUPREME</b></p><p>\n              Early in his rule, Khamenei was often dismissed as weak and an unlikely successor to the Islamic Republic's late founder, the charismatic Ayatollah Ruhollah Khomeini.</p><p>\n              Not having achieved the religious rank of ayatollah when he was appointed Supreme Leader, Khamenei had difficulty wielding power through religious authority, as the theocratic system foresaw.</p><p>\n              After struggling for a long time to emerge from the shadow of his mentor, it was by forging a formidable security apparatus devoted solely to him that he finally imposed himself.</p><p>\n              Khamenei distrusts the West, particularly the U.S., which he has long accused of seeking to topple him. </p><p>\n              In a typically pugnacious speech after January's protests, he blamed U.S. President Donald Trump for the unrest, saying: \"We consider the U.S. president criminal for the casualties, damages and slander he inflicted on the Iranian nation.\"</p><p>\n              Yet despite his ideological rigidity, he has shown a willingness to bend when the survival of the Islamic Republic is at stake. </p><p>\n              The concept of \"heroic flexibility\", first mentioned by Khamenei in 2013, permits tactical compromises to advance his goals, mirroring Khomeini's choice in 1988 to embrace a ceasefire after eight years of war with Iraq. </p><p>\n              Khamenei's guarded endorsement of Iran's 2015 nuclear deal with six world powers was another such moment, as he calculated that sanctions relief was necessary to stabilise the economy and buttress his grip on power. </p><p>\n              Trump quit the 2015 pact during his first term in 2018 and reimposed crippling sanctions on Iran. Tehran reacted by gradually violating all agreed curbs on its nuclear programme.</p><p><b>LOYAL SECURITY STRUCTURE KEY TO KHAMENEI'S POWER </b></p><p>\n              At times of increasing pressure, Khamenei has repeatedly turned to the Islamic Revolutionary Guard Corps (IRGC) and the Basij, a paramilitary force numbering hundreds of thousands of volunteers, to snuff out dissent.</p><p>\n              It was they who crushed the protests that exploded after Mahmoud Ahmadinejad's re-election as president in 2009 amid allegations of vote fraud.</p><p>\n              In 2022, Khamenei was just as ruthless in arresting, imprisoning or executing protesters enraged by the death in custody of the young Iranian-Kurdish woman Mahsa Amini.</p><p>\n              And it was again the Guards and Basij who crushed the latest round of protests in January. </p><p>\n              His power also owes much to the parastatal financial empire known as Setad, which is under Khamenei's direct control. Worth tens of billions of dollars, it has grown hugely during his rule, investing billions in the Revolutionary Guards. </p><p>\n              Scholars outside Iran paint a picture of a secretive ideologue fearful of betrayal - an anxiety fuelled by an assassination attempt in June 1981 with a bomb hidden in a tape recorder that paralysed his right arm.</p><p>\n              Khamenei himself suffered severe torture, according to his official biography, in 1963, when at 24 he served the first of many terms in prison for political activities under the rule of the shah.</p><p>\n              After the Revolution, as deputy defence minister, Khamenei became close to the Guards during the 1980-88 war with Iraq, which claimed a million lives from both sides. </p><p>\n              He won the presidency with Khomeini's support but was a surprise choice as successor when the supreme leader died, lacking both his popular appeal and his superior clerical credentials.</p><p>\n              Karim Sadjadpour at the Carnegie Endowment for International Peace said that \"accident of history\" had transformed a \"weak president to an initially weak supreme leader to one of the five most powerful Iranians of the last 100 years\".</p><p>\n              (Reporting by Parisa Hafezi; editing by Angus McDowall and Kevin Liffey)</p><p>\n            By Parisa Hafezi</p></div>",
            "link": "https://hk.marketscreener.com/news/targeted-by-airstrikes-ayatollah-khamenei-has-iran-in-iron-grip-ce7e5cdfd081f025",
            "pub_date": "2026-02-28 23:56:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran's revolutionary guards tell ships passage through Strait of Hormuz 'not allowed', EU naval mission official says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-s-revolutionary-guards-tell-ships-passage-through-strait-of-hormuz-not-allowed-eu-naval-mis-ce7e5cdfd081f123",
            "pub_date": "2026-02-28 23:51:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spokesperson of Iran's IRGC Khatam ol Anbia Command says 14 bases targeted and hundreds of U.S. soldiers killed",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spokesperson-of-iran-s-irgc-khatam-ol-anbia-command-says-14-bases-targeted-and-hundreds-of-u-s-sold-ce7e5cdfd081f121",
            "pub_date": "2026-02-28 23:51:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UN Security Council to meet on Saturday on Iran conflict",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/un-security-council-to-meet-on-saturday-on-iran-conflict-ce7e5cdfd081f22d",
            "pub_date": "2026-02-28 23:46:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel assures investors after taking baton from Buffett, with 'fortress-like' balance sheet",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 28 (Reuters) - Berkshire Hathaway's new chief executive Greg Abel moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its \"fortress-like\" balance sheet while upholding the values of his predecessor and mentor, Warren Buffett.</p><p>\n              Abel, 63, said he would not rush to deploy Berkshire's near-record $373.3 billion cash stake, though it gave the company plenty of \"dry powder,\" and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has also repurchased none of its own stock since the spring of 2024.</p><!-- Article --><p>\n              \"I recognize how you want us to succeed together, and to do so in the right way,\" Abel wrote. \"My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.\"</p><p>\n              Abel also paid homage to Buffett, 95, who stepped down at year-end after 60 years as chief executive. Buffett remains chairman and goes to Berkshire's offices five days a week.</p><p>\n              \"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen,\" Abel wrote. \"To invest in Berkshire has long been a vote of trust in our founder - a trust that now rests with Berkshire.\"</p><p><b>ABEL TRIES TO SHOW CONTINUITY</b></p><p>\n              Abel said Berkshire's culture and values will continue \"into perpetuity,\" and signaled no changes in its decentralized structure where its dozens of businesses operate largely without interference from him.</p><p>\n              He also said Berkshire, which owns the BNSF railroad, had \"no interest\" in buying another major railroad, and acknowledged pressures facing the PacifiCorp utility from litigation over wildfires in Oregon.</p><p>\n              \"PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,\" Abel wrote.</p><p>\n              Cathy Seifert, an analyst at CFRA Research, said Abel's letter might be reassuring to investors.</p><p>\n              \"He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,\" she said. \"In my opinion, he hit the mark.\"</p><p><b>PROFIT DECLINES</b></p><p>\n              Berkshire also reported declining profit for both the fourth quarter and the full year, after taking write-downs for longstanding investments in packaged food company Kraft Heinz and Occidental Petroleum.</p><p>\n              Quarterly operating profit fell 30% to $10.2 billion. Including changes in the value of equity holdings led by Apple and American Express, net income fell 3% to $19.2 billion.</p><p>\n              For all of 2025, operating profit fell 6% to $44.49 billion, while net income fell 25% to $67 billion.</p><p>\n              Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire is not selling.</p><p>\n               (Reporting by Jonathan Stempel in New York; Editing by Louise Heavens and Lisa Shumaker)</p><p>\n            By Jonathan Stempel</p></div>",
            "link": "https://hk.marketscreener.com/news/berkshire-ceo-abel-assures-investors-after-taking-baton-from-buffett-with-fortress-like-balance-s-ce7e5cdfd081f220",
            "pub_date": "2026-02-28 23:42:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "State Department official: State Department has set up a task force to assist American citizens and support diplomatic efforts in region",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/state-department-official-state-department-has-set-up-a-task-force-to-assist-american-citizens-and-ce7e5cdfd081f227",
            "pub_date": "2026-02-28 23:42:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netanyahu, Trump held phone call -Netanyahu's office",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/netanyahu-trump-held-phone-call-netanyahu-s-office-ce7e5cdfd081f322",
            "pub_date": "2026-02-28 23:42:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU Aspides official says vessels have been receiving VHF transmission from Iran's Revolutionary Guards saying 'no ship is allowed to pass the Strait of Hormuz'",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eu-aspides-official-says-vessels-have-been-receiving-vhf-transmission-from-iran-s-revolutionary-guar-ce7e5cdfd081f326",
            "pub_date": "2026-02-28 23:31:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck & Co Inc says FDA sets PDUFA date of June 19, 2026 for Welireg and Keytruda",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/merck-says-keytruda-plus-welireg-reduces-risk-of-recurrence-or-death-by-28-ce7e5cdfd08efe21",
            "pub_date": "2026-02-28 23:15:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck says Welireg plus Lenvima reduces risk of disease progression by 30%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/merck-says-welireg-plus-lenvima-reduces-risk-of-disease-progression-by-30-ce7e5cdfd08efe26",
            "pub_date": "2026-02-28 23:06:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire Hathaway profit falls on lower insurance income, writedown",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 28 (Reuters) - Berkshire Hathaway on Saturday said operating profit fell in the fourth quarter, reflecting lower income from its insurance operations, and wrote down a longstanding investment in Occidental Petroleum.</p><p>\n              The quarter was Warren Buffett's last as the conglomerate's chief executive, a job now held by Greg Abel. Buffett remains chairman.</p><!-- Article --><p>\n              Berkshire also reported ending 2025 with $373.3 billion of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</p><p>\n              It was also the thirteenth consecutive quarter in which Berkshire sold more stocks than it bought, and the sixth with no share buybacks.</p><p>\n              Quarterly operating profit fell 30% to $10.2 billion, or about $7,092 per Class A share, from $14.53 billion a year earlier.</p><p>\n              Net income fell 3% to $19.2 billion from $19.69 billion, as the writedown and lower operating profit offset the value of Berkshire's holdings in Apple, American Express and other stocks.</p><p><b>ABEL PAYS TRIBUTE TO BUFFETT</b></p><p>\n              For the full year, operating profit fell 6% to $44.49 billion, while net income fell 25% to $89 billion.</p><p>\n              Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire isn't selling.</p><p>\n              In his first annual letter to Berkshire shareholders, Abel paid tribute to his mentor, calling Buffett a \"remarkable CEO\" and \"arguably the greatest investor of all time\" and pledging to maintain his discipline in determining how to invest Berkshire's capital.</p><p>\n              \"We are committed to strengthening the great legacy built by Warren Buffett and his business partner Charlie Munger, ensuring it endures through our commitment to excellence , Abel wrote, referring to Berkshire's late vice chairman. \"I recognize how you want us to succeed together, and to do so in the right way.\"</p><p>\n              Berkshire's $4.5 billion writedown for Occidental reflected its belief that the recent decline in the oil company's stock price was not \"temporary,\" though it said it had no intention to sell any of its stock.</p><p>\n              The writedown was Berkshire's second in 2025, in addition to a writedown of its investment in Kraft Heinz.</p><p>\n              Quarterly insurance profit fell 38% to $4.63 billion.  Falling interest rates reduced income on Berkshire's cash, while pricing pressures limited the willingness of the Geico auto insurer and reinsurance businesses to add customers.</p><p>\n               (Reporting by Jonathan Stempel in New York; Editing by Louise Heavens)</p><p>\n            By Jonathan Stempel</p></div>",
            "link": "https://hk.marketscreener.com/news/berkshire-hathaway-profit-falls-on-lower-insurance-income-writedown-ce7e5cdfd08efe24",
            "pub_date": "2026-02-28 23:06:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ahead of strikes, Trump told Iran attack was high risk, high reward",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ahead-of-strikes-trump-told-iran-attack-was-high-risk-high-reward-ce7e5cdfd08eff23",
            "pub_date": "2026-02-28 23:01:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump was briefed ahead of Iran strikes that operation would be high-risk and high-reward, U.S. official says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-was-briefed-ahead-of-iran-strikes-that-operation-would-be-high-risk-and-high-reward-u-s-offi-ce7e5cdfd08eff22",
            "pub_date": "2026-02-28 23:01:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ukraine's Naftogaz says Russia struck gas extraction facility in Kharkiv region overnight, causing serious damage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ukraine-s-naftogaz-says-russia-struck-gas-extraction-facility-in-kharkiv-region-overnight-causing-s-ce7e5cdfd08ef023",
            "pub_date": "2026-02-28 22:55:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia, China request urgent UN Security Council meeting on Iran, RIA reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russia-china-request-urgent-un-security-council-meeting-on-iran-ria-reports-ce7e5cdfd08ef021",
            "pub_date": "2026-02-28 22:46:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cathay Group suspends Middle East operations after Israel, US strike Iran",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cathay-group-suspends-middle-east-operations-after-israel-us-strike-iran-ce7e5cdfd08ef12c",
            "pub_date": "2026-02-28 22:46:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Consulate General in Karachi, Pakistan, is restricting U. S. government personnel movements until Monday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-consulate-general-in-karachi-pakistan-is-restricting-u-s-government-personnel-movements-unt-ce7e5cdfd08ef122",
            "pub_date": "2026-02-28 22:46:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil and gas majors and traders suspend shipments via Hormuz as US attacks Iran, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/oil-and-gas-majors-and-traders-suspend-shipments-via-hormuz-as-us-attacks-iran-sources-say-ce7e5cdfd08ef220",
            "pub_date": "2026-02-28 22:36:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IndiGo has suspended all flight operations to and from Middle East and other select international sectors until 1 March",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indigo-has-suspended-all-flight-operations-to-and-from-middle-east-and-other-select-international-se-ce7e5cdfd08ef224",
            "pub_date": "2026-02-28 22:36:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US official: Pentagon also provided notifications to armed services committees early this morning after strikes had commenced",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-official-pentagon-also-provided-notifications-to-armed-services-committees-early-this-morning-af-ce7e5cdfd08ef321",
            "pub_date": "2026-02-28 22:36:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US official: Rubio laid out the situation and consulted Gang of 8 Tuesday in an hour long briefing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-official-rubio-laid-out-the-situation-and-consulted-gang-of-8-tuesday-in-an-hour-long-briefing-ce7e5cdfd08ef320",
            "pub_date": "2026-02-28 22:36:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}