{
    "data": [
        {
            "title": "Altera's Programmable Solutions Accelerate the Next Generation of 5G-Advanced and 6G Wideband Radios",
            "description": "<div class=\"txt-s4 article-text\"><p>At Mobile World Congress 2026, Altera highlighted how it's leveraging strategic partnerships to enable the next generation of advanced radio systems through programmable innovations. By ensuring seamless integration between leading radio platforms and Altera's FPGAs and Open RAN reference solutions, Altera is enabling communications providers to accelerate advanced 5G deployments, prototype early 6G architectures, and expand into emerging Non-Terrestrial Network (NTN) applications such as satellite and airborne connectivity. Altera recently collaborated with Broadcom to help enable the next generation of high-performance radio platforms by combining Altera's Agilex??</p><p>7 FPGAs with Broadcom's leadership in advanced radio silicon. Together, the companies successfully completed interoperability testing between Agilex 7 FPGAs and Broadcom's BroadPeak SoC platform, validating robust, deterministic, high-throughput performance across wideband radio configurations leveraging JESD204C connectivity at 32.44Gbps. Designed for large-scale deployments, the solution meets stringent power consumption envelopes and thermal hotspot constraints, enabling dense, high-capacity radios without compromising reliability or form factor.</p><!-- Article --><p>Together, the BroadPeak SoC platform allows equipment manufacturers and network operators to deploy wideband radios with advanced RF performance, evolving beamforming and AI-assisted signal processing, and open innovation as the industry moves toward 5G-Advanced and beyond. Successful interoperability between Altera and Broadcom's latest silicon platforms enables customers to rapidly build scalable radio platforms supporting O-RAN 7.2x splits, from 8T8R to 128T128R configurations and beyond. The combined solution supports next-generation 3GPP FR1 and FR3 bands, while efficiently partitioning baseband and RF processing to simplify system design and accelerate time-to-market.</p><p>Altera's collaboration with Broadcom reflects the company's broader momentum in working with leading technology partners to accelerate Open RAN innovation and deployment. Altera recently collaborated with NEC on a 5G Massive MIMO radio developed using Altera's Agilex 7 FPGA technology. The solution helped NEC rapidly bring to market a sub-6GHz radio unit that boosts network capacity with significant throughput gains while reducing power consumption by more than 40%, enabling more efficient Open RAN and vRAN deployments.</p></div>",
            "link": "https://hk.marketscreener.com/news/altera-s-programmable-solutions-accelerate-the-next-generation-of-5g-advanced-and-6g-wideband-radios-ce7e5cd9dc80f02c",
            "pub_date": "2026-02-27 01:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Instagram to Alert Teens' Parents of Repeated Self-Harm Searches",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Mauro Orru and Edith Hancock </p><br/><p>\n  Instagram said it would alert parents if their teens repeatedly search for terms related to self-harm or suicide, stepping up efforts to protect minors as several governments weigh social-media bans for younger users. </p><!-- Article --><p>\n\n  The app owned by Facebook parent Meta Platforms wrote in a blog post on Thursday that parents who have adopted Instagram's supervision tools to monitor their children's profile activity would start receiving alerts next week. </p><p>\n\n  Alerts will be triggered only when teens search repeatedly within a short period of time for terms like \"self-harm,\" \"suicide\" or phrases suggesting they want to harm themselves. </p><p>\n\n  The service will initially be available through emails, texts, WhatsApp messages and in-app notifications for parents and guardians in the U.S., Canada, the U.K. and Australia, expanding to other countries later this year. </p><p>\n\n  The move shows that Instagram is ramping up efforts to shield younger users from potentially dangerous content as social-media platforms face renewed criticism from governments and regulators that say they aren't going far enough. </p><p>\n\n  In December, Australia became the first country in the world to enact a social-media ban for under-16s, triggering a lawsuit from Reddit. Australian officials said the decision was needed to protect teens from experiencing harm on social media. </p><p>\n\n  Since then, several countries, including the U.K., France and Spain, have considered banning or have introduced bills to ban social media for certain age groups of minors. Earlier this month, Spanish Prime Minister Pedro Sanchez announced plans to ban social-media access for children under the age of 16 by implementing age-verification systems. </p><p>\n\n  The European Commission, the executive arm of the European Union, has also been piloting an age-verification app since July, which it says enables users to prove that they are over 18 when they attempt to access adult content. </p><p>\n\n  Instagram said it had opted for a threshold that requires a few searches of specific terms within a short period of time to trigger the alerts, erring on the side of caution, even if its systems might at times notify parents when there isn't a real risk for teens. </p><p>\n\n  The company said it would continue to alert emergency services when its systems detect that users might be at imminent risk of physical harm. </p><br/><p>\n  Write to Mauro Orru at mauro.orru@wsj.com and Edith Hancock at edith.hancock@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1252ET</p></div>",
            "link": "https://hk.marketscreener.com/news/instagram-to-alert-teens-parents-of-repeated-self-harm-searches-ce7e5cd9dc80f027",
            "pub_date": "2026-02-27 01:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Africa CDC head cites major concerns over data, pathogen sharing in US health deals",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 26 (Reuters) - There are big issues in the deals the United States is pursuing with African countries that govern how U.S. global health funding will work from now on, the head of the Africa Centres for Disease Control and Prevention said on Thursday.</p><p>\n              \"There are huge concerns regarding data, regarding pathogen sharing,\" Director-General Jean Kaseya told a virtual press conference. </p><!-- Article --><p>\n              On Wednesday, Zimbabwe pulled out of talks with the U.S. for its agreement, worth $367 million over the next five years, raising concerns over sensitive data and saying it was unequal. Zambia's government also said it had pushed back on a section of its deal.</p><p>\n              Other global health advocates have criticised the pathogen-sharing element of the deals, which ask countries to promptly share data with Washington about pathogens that could spark epidemics in their countries, as a condition of getting the funding. The deals do not guarantee that any drugs or vaccines developed as a result of that exchange would go to the countries affected.</p><p><b>RESHAPING U.S. GLOBAL HEALTH FUNDING </b></p><p>\n              The deals are the latest in a series of bilateral agreements reshaping how U.S. President Donald Trump's administration delivers billions of dollars in global health funding, after dismantling its aid agency last year, cutting funding and contracts worldwide, and pledging to put \"America First\" in its global health strategy. </p><p>\n              Kaseya said he had initially greeted that strategy with enthusiasm, because it would see African countries get money more directly, while simultaneously requiring them to co-invest. But he said he had rejected an opportunity for Africa CDC to be an observer to the deals, as he respected the sovereignty of individual nations. </p><p>\n              However, he said the agency had been supporting countries where requested, and would continue to advise if they wanted to renegotiate with the U.S., as well as supporting them to implement any agreement they do sign. </p><p>\n              \"I said to all of my countries, you have full support from Africa CDC. Even if you want to re-negotiate ... if you want Africa CDC to be there, we'll be there,\" he said.</p><p></p><p> (Reporting by  Anait Miridzhanian, Jennifer Rigby; Editing by Chris Reese)</p><p>\n            By Anait Miridzhanian and Jennifer Rigby</p></div>",
            "link": "https://hk.marketscreener.com/news/africa-cdc-head-cites-major-concerns-over-data-pathogen-sharing-in-us-health-deals-ce7e5cd9dc80f124",
            "pub_date": "2026-02-27 01:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tensor and Arm Partner to Deliver Ai-Defined Compute Foundation for Personal Robocar",
            "description": "<div class=\"txt-s4 article-text\"><p>Tensor and Arm announced a multi-year strategic collaboration to deliver the foundational compute architecture behind the world's first agentic AI personal Robocar. Through this partnership, Tensor is leveraging the Arm®? compute platform, which unifies hardware, software and ecosystem enablement, to power physical AI workloads spanning the entire vehicle.</p><p>Tensor has integrated more than 400 safety-capable, power-efficient Arm-based cores in each vehicle - the highest concentration of Arm technology in a consumer vehicle today. As Tensor scales its personal Robocar fleet for global commercialization in 2026, the companies will work together to enable the Level 4 autonomous capabilities required for next-generation mobility, supported by the extensive Arm software ecosystem of more than 22 million developers. AI is shifting to the physical world, where intelligence is embodied in machines and defining a new class of autonomous systems that sense, decide and act under uncompromising power, safety, and reliability constraints.</p><!-- Article --><p>Tensor is defining its vehicle around this intelligence rather than adapting autonomy onto legacy platforms. The Robocar is powered by the world's most vertically integrated Level 4 autonomy stack, and a comprehensive sensor suite of 37 cameras, 5 lidars, 11 radars, 22 microphones, 10 ultrasonic sensors, 3 IMUs, GNSS, 16 collaboration detectors, 8 water-level detectors, 4 tire-pressure sensors, a smoke detector, and triple-channel 5G connectivity. This unique depth of hardware and software integration represents a meaningful advancement in automotive sensing, enabling continuous perception, environmental awareness, and resilient system performance across diverse operating conditions. To make this possible, Tensor is using the leading-edge Arm compute platform to distribute safety-capable intelligence across the vehicle -from the onboard supercomputer to the smallest sensors - allowing the Robocar to safely perceive and navigate its environment through its foundation models.</p><p>Each Tensor Robocar incorporates433 Arm-based cores, including Neoverse®? AE for high-throughput AI processing, Cortex®?-X for agentic AI cabin and peak performance system control, Cortex-A for drive-by-wire, lidars, redundancy, and general compute, Cortex-R for real-time safety-critical systems, and Cortex-M for low-power subsystem management. The Arm compute platform enables Tensor to deploy AI workloads across diverse compute domains while meeting stringent automotive safety, thermal, and power requirements, operating in concert with NVIDIA-accelerated AI processing to support Tensor's proprietary autonomy stack.</p><p>The AI-native vehicle architecture used in each Tensor Robocar is enabled by a growing network of leading partners spanning AI compute, advanced manufacturing, safety systems, and critical vehicle technologies. Tensor has also selected industry leading automotive suppliers, semiconductor companies, and cloud partners including Autoliv, ZF, Continental, NVIDIA, AMD, Qualcomm, Samsung, and Oracle for the most advanced personal autonomous vehicle to ever be mass produced. The Tensor Robocar will be offered in the US, EU, and Middle East markets in 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/tensor-and-arm-partner-to-deliver-ai-defined-compute-foundation-for-personal-robocar-ce7e5cd9dc80f221",
            "pub_date": "2026-02-27 01:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC quarterly profit jumps on capital markets strength",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-quarterly-profit-jumps-on-capital-markets-strength-ce7e5cd9dc80f62d",
            "pub_date": "2026-02-27 01:50:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "L3Harris Sets 'Encouraging' Outlook at Investor Day, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/l3harris-sets-encouraging-outlook-at-investor-day-rbc-says-ce7e5cd9dc80f623",
            "pub_date": "2026-02-27 01:50:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US FDA to offer bonuses to speed up drug reviews, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - The U.S. Food and Drug Administration plans to give bonuses to scientific staff for speeding up drug reviews, Bloomberg News reported on Thursday, citing an FDA official familiar with the matter.</p><p>\n              The Department of Health and Human Services, which oversees the FDA, did not immediately respond to a Reuters request for comment. </p><!-- Article --><p></p><p> (Reporting by Kamal Choudhury in Bengaluru)</p></div>",
            "link": "https://hk.marketscreener.com/news/us-fda-to-offer-bonuses-to-speed-up-drug-reviews-bloomberg-news-reports-ce7e5cd9dc81fe22",
            "pub_date": "2026-02-27 01:50:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Erste Group Bank AG Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Erste Group Bank AG reported earnings results for the full year ended December 31, 2025. For the full year, the company reported net interest income was EUR 7,739 million compared to EUR 7,843 million a year ago. Net income was EUR 3,510 million compared to EUR 3,125 million a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/erste-group-bank-ag-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9dc81fe24",
            "pub_date": "2026-02-27 01:50:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lowe's Aims for $1 Billion in Productivity Gains in 2026 to Counter Cost Inflation, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lowe-s-aims-for-1-billion-in-productivity-gains-in-2026-to-counter-cost-inflation-rbc-says-ce7e5cd9dc81ff2d",
            "pub_date": "2026-02-27 01:50:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Does Trump's new 'surcharge' make EU worse off than under trade deal?",
            "description": "<div class=\"txt-s4 article-text\"><p>BRUSSELS, Feb 26 (Reuters) - The EU has demanded that the United States stick to the terms of a trade deal they agreed last year after the U.S. Supreme Court struck down President Donald Trump's global tariffs and he responded with a new, across-the-board \"import surcharge\".</p><p><b>WHAT ARE THE TERMS OF THE 'TURNBERRY DEAL'?</b></p><!-- Article --><p>\n              Trump and European Commission President Ursula von der Leyen concluded a deal at Trump's Turnberry golf course in Scotland last July.</p><p>\n              It set a broad 15% U.S. tariff for most EU exports or, for a very small range of products, the pre-existing most-favoured nation (MFN) duty rate if that is higher than 15%. Steel and aluminium tariffs remained at 50%, while no extra tariffs applied for a limited number of EU goods, including unavailable natural resources such as cork, aircraft and aircraft parts and generic pharmaceuticals and their ingredients.</p><p>\n              Washington also agreed to reduce its tariff for EU car imports to 15% from a previous 25%.</p><p>\n              The European Union committed to remove its import duties on all U.S. industrial goods and to provide preferential market access for a wide range of U.S. seafood and agricultural goods, as well as to extend zero tariffs for U.S. lobsters, as initially agreed with Trump in 2020.</p><p><b>WHAT DOES THE 'IMPORT SURCHARGE' MEAN FOR THE EU?</b></p><p>\n              The Supreme Court ruled that Trump had exceeded his authority in using the 1977 International Emergency Economic Powers Act, which was the legal basis for the broad 15% tariff on EU products.</p><p>\n              So those tariffs have been superseded by Trump's new \"import surcharge\", which the U.S. began collecting at a 10% rate on Tuesday. The Trump administration is working to increase the rate to 15%, the level that had generally applied to EU exports.</p><p>\n              However, unlike the tariff terms of the EU-U.S. trade deal, the surcharge applies in addition to the MFN rate.</p><p>\n              The surcharge does not affect the tariffs on cars or steel and does not apply to critical minerals, pharmaceuticals, some electronic products, beef, tomatoes and oranges and any products subject to 'Section 232' tariffs imposed on grounds of national security.</p><p>\n              The EU has acknowledged it faces a \"transition period\" of a few months during which U.S. tariffs will be higher for certain EU exports.</p><p><b>WHICH EU PRODUCTS FACE HIGHER TARIFFS?</b></p><p>\n              Given the average U.S. MFN duty is 3.4%, overall tariffs (MFN+10%) for many EU products under the new system will be lower than 15%, particularly for industrial goods. It does become problematic if and when the surcharge rate rises to 15%.</p><p>\n              Some EU exports, though, face higher tariffs than before. The European Commission says 7% of EU exports to the U.S. are subject to an MFN duty above 5%. EU goods exports to the U.S. totalled 536 billion euros ($631.9 billion) in 2024.</p><p>\n              Products affected include textiles, clothing and shoes, with rates on footwear up to 48%, and consumer goods, including suitcases and handbags, glassware, pillows and cushions and some light fittings.</p><p>\n              Of agricultural and food goods, MFN rates above 5% apply for many dairy products, with Edam and Parmesan cheeses at 10% and Roquefort at 8%, as well as for certain fruit and vegetables, including melons, strawberries, Brussels sprouts and carrots.</p><p>\n              ($1 = 0.8482 euros)</p><p></p><p> (Reporting by Philip BlenkinsopEditing by Gareth Jones)</p><p>\n            By Philip Blenkinsop</p></div>",
            "link": "https://hk.marketscreener.com/news/does-trump-s-new-surcharge-make-eu-worse-off-than-under-trade-deal-ce7e5cd9dc81f02d",
            "pub_date": "2026-02-27 01:50:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS executive says one item remains in migration of Credit Suisse clients",
            "description": "<div class=\"txt-s4 article-text\"><p>ZURICH, Feb 26 (Reuters) - UBS has one item remaining in the migration of former Credit Suisse clients onto UBS's system, the Switzerland head of the Zurich-based bank said on Thursday.</p><p>\n              \"We have another switchover event, where we will transfer the remaining client relationships,\" Sabine Keller-Busse said. </p><!-- Article --><p>\n              Those left to be migrated were mostly the bank's international clients booked in Switzerland, while the transfer of domestic clients had almost been completed, she added.</p><p>\n              \"I have to say, I'm enormously relieved. It's gone really, really well so far.\"</p><p>\n              At the end of March, the bank would start turning off Credit Suisse systems and finalise that process by the end of 2026, Keller-Busse said at a finance event in Zurich.</p><p>\n               (Reporting by Ariane Luthi, editing by Thomas Seythal)</p></div>",
            "link": "https://hk.marketscreener.com/news/ubs-executive-says-one-item-remains-in-migration-of-credit-suisse-clients-ce7e5cd9dc81f027",
            "pub_date": "2026-02-27 01:50:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTC says Walmart agreed to $100 million judgment to settle deceptive earnings charges",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Walmart has agreed to a $100 million judgment to settle allegations that the company caused delivery drivers to lose tens of millions of dollars in earnings, the U.S. Federal Trade Commission said in a statement on Thursday.</p><p></p><p>(Reporting by Daphne Psaledakis; editing by Michelle Nichols )</p></div>",
            "link": "https://hk.marketscreener.com/news/ftc-says-walmart-agreed-to-100-million-judgment-to-settle-deceptive-earnings-charges-ce7e5cd9dc81f12d",
            "pub_date": "2026-02-27 01:50:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Press Metal Aluminium posts quarterly revenue 4.04 billion RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/press-metal-aluminium-posts-quarterly-revenue-4-04-billion-rgt-ce7e5cd9dc81f123",
            "pub_date": "2026-02-27 01:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mainland Headwear expects 2025 profit not less than HK$100 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mainland-headwear-expects-2025-profit-not-less-than-hk-100-million-ce7e5cd9dc81f121",
            "pub_date": "2026-02-27 01:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's Strong Double-Digit Growth Expected Well Into 2027, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-s-strong-double-digit-growth-expected-well-into-2027-rbc-says-ce7e5cd9dc81f22d",
            "pub_date": "2026-02-27 01:50:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's Q1 Sales Guidance Exceeds Buy-Side Expectations, Wedbush Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-s-q1-sales-guidance-exceeds-buy-side-expectations-wedbush-says-ce7e5cd9dc81f72d",
            "pub_date": "2026-02-27 01:41:24",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snowflake Seen as 'AI Winner' as Companies Move More Data to AI Workflows, Wedbush Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/snowflake-seen-as-ai-winner-as-companies-move-more-data-to-ai-workflows-wedbush-says-ce7e5cd9dc81f722",
            "pub_date": "2026-02-27 01:41:25",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rosenberg Research Notes Canada's CUSMA \"Conundrum\"",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rosenberg-research-notes-canada-s-cusma-conundrum-ce7e5cd9dc8efe23",
            "pub_date": "2026-02-27 01:41:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Broadcom Inc. Ships 3.5D Face-To- Face Compute SoC Powering AI Revolution",
            "description": "<div class=\"txt-s4 article-text\"><p>Broadcom Inc. announced it has begun shipping the industry's first 2nm custom compute SoC built on its 3.5D eXtreme Dimension System in Package (XDSiP) platform. A proven modular, multi-dimensional stacked die platform, 3.5D XDSiP combines 2.5D techniques and 3D-IC integration using Face-to-Face (F2F) technology. 3.5D XDS iP is foundational to next-generation XPUs.</p><p>With 3.5D XDSaP, consumer AI customers can deliver the most advanced XPU with unparalleled signal density, superior power efficiency and low latency to meet the massive computational demands of gigawatt-scale AI clusters. Broadcom's XDSiP platform allows compute, memory and network I/O to scale independently in a compact form factor, enabling high-efficiency, low-power computing at scale.</p></div>",
            "link": "https://hk.marketscreener.com/news/broadcom-inc-ships-3-5d-face-to-face-compute-soc-powering-ai-revolution-ce7e5cd9dc8efe24",
            "pub_date": "2026-02-27 01:41:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lenovo Announces the Availability of Lenovo Premier Support Plus for Servers",
            "description": "<div class=\"txt-s4 article-text\"><p>Lenovo announced the availability of Lenovo Premier Support Plus for Servers, a new premium support offering designed to help enterprises reduce downtime, simplify IT operations, and keep mission-critical infrastructure always ready. Built for today's always-on environments, Premier Support Plus combines AI-driven proactive and predictive support, preventative maintenance, 24/7 access to Lenovo experts, and designated Service Engagement Managers to help organizations move from reactive issue resolution to proactive system care. As digital operations continue to expand and infrastructure environments grow more complex, IT teams are under increasing pressure to maintain uptime while managing limited resources.</p><p>Traditional, reactive support models can lead to extended outages, repeated issues, and unpredictable costs. Premier Support Plus for Servers addresses these challenges by identifying potential issues early and resolving them before they impact business operations. Premier Support Plus for Servers is Lenovo's highest-tier support offering for enterprise server environments, building on the foundation of Lenovo Premier Support.</p><!-- Article --><p>The service is designed for Lenovo ThinkSystem and ThinkAgile servers and delivers intelligent support for organizations that depend on continuous availability. Key capabilities of Lenovo Premier Support Plus for Servers include: Proactive and predictive support powered by AI-driven monitoring and Call Home automation, which detects potential issues early and automatically initiates support cases and parts dispatch. Preventative maintenance through wellness dashboards, firmware health checks, and expert guidance to improve system health, reliability, and longevity.</p><p>24/7 expert assistance with a 4-hour onsite response objective for critical issues, helping ensure faster recovery and minimal disruption. A designated Lenovo Service Engagement Manager who provides onboarding, ongoing reporting, and regular service reviews, serving as a single point of accountability. Keep Your Drive, enabling customers to retain failed drives to maintain control of sensitive data and meet internal security and compliance requirements.</p><p>Global service coverage across more than 75 markets, delivering consistent, enterprise-grade support worldwide. For customers with mission-critical environments where downtime is not an option, Lenovo also offers Committed Service Repair as an optional add-on. This enhanced service provides a 6-hour onsite repair commitment, delivering faster resolution for the most demanding operational needs.</p><p>Premier Support Plus combines predictive detection, preventative maintenance, and guided planning to keep infrastructure optimized and ready to scale. With designated account oversight from a Lenovo Service Engagement Manager, global coverage, and data retention controls through Keep Your Drive, customers gain consistent, transparent support they can trust. By shifting the burden of monitoring, maintenance, and escalation to Lenovo, IT teams can spend less time reacting to issues and more time driving strategic initiatives.</p><p>Premier Support Plus for Server is part of Lenovo's broader services portfolio, which includes Lenovo Lifecycle Services which are designed to help customers plan, deploy, manage, optimize and evolve IT infrastructure with confidence.</p></div>",
            "link": "https://hk.marketscreener.com/news/lenovo-announces-the-availability-of-lenovo-premier-support-plus-for-servers-ce7e5cd9dc8eff23",
            "pub_date": "2026-02-27 01:41:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ServiceNow Launches Autonomous Workforce That Think and Acts; Adds Moveworks to the ServiceNow AI Platform",
            "description": "<div class=\"txt-s4 article-text\"><p>ServiceNow launched Autonomous Workforce, AI specialists that can execute jobs with the scope, authority, and governance required for enterprise work ? freeing people to focus on strategic problem solving and personalized service. Just two months after the Moveworks acquisition close, the company also introduced ServiceNow EmployeeWorks, which combines Moveworks' conversational AI and enterprise search with ServiceNow?s unified portal and autonomous workflows to turn natural language requests into governed, end-to-end execution for nearly 200 million employees.</p><p>As enterprises evaluate AI platforms, two competing paradigms have emerged: feature-function AI bolted onto disconnected SaaS apps, and unified platforms that execute work through proven enterprise workflows with AI built in. The difference is fundamental: the feature approach requires enterprises to maintain, integrate, and manage the complexity themselves. ServiceNow eliminates the complexity by unifying conversational AI, workflows, enterprise data, security, and governance on a platform purpose-built for mission-critical operations.</p><!-- Article --><p>ServiceNow?s Autonomous Workforce deploys AI specialists with defined roles to augment teams. Unlike AI agents that complete individual tasks, the ServiceNow Autonomous Workforce orchestrates teams of AI specialists with roles such as a Level 1 Service Desk AI Specialist, Employee Service Agent, or Security Operations Analyst to execute work from start to finish. They work alongside humans, follow established processes and policies set by the organization, learn from outcomes and employee feedback, and importantly, improve over time. ServiceNow is introducing the first AI specialist available out-of-the-box for customers, a Level 1 Service Desk AI Specialist.</p><p>This AI specialist autonomously diagnoses and resolves common IT support requests end-to-end ? password resets, software access provisioning, network troubleshooting ? using enterprise knowledge bases, historical incident data, and proactive remediation workflows.</p><p>It is designed to operate 24/7 with assignments aligned to specific skillsets and deliverables and escalate issues when human intervention is needed. At ServiceNow, Autonomous Workforce is handling 90%+ of employee IT requests. Early results show newest AI specialist, the L1 Service Desk AI Specialist, is already resolving assigned IT cases autonomously, and it's 99% faster than when these cases are handled by human agents.</p><p>AI models without workflows are probabilistic ? they see patterns, form ideas, and give different answers for the same questions. The enterprise, however, needs deterministic outcomes ?</p><p>governance, security, auditability, and operations that don't hallucinate. Because ServiceNow combines probabilistic intelligence with deterministic workflow orchestration, AI specialists can interpret a request, decide the right action using business context, and execute autonomously across systems with governance built in through the ServiceNow AI Control Tower. Every action is traceable and governed by policies embedded in the workflow layer itself.</p><p>ServiceNow is bringing the power of Moveworks to the ServiceNow AI Platform and delivering immediate value to customers with ServiceNow EmployeeWorks, a conversational front door for the enterprise. Available where employees already work and collaborate ? whether in Teams, Slack, or on any browser ?</p><p>ServiceNow EmployeeWorks connects Moveworks? conversational AI chat and deep enterprise search with ServiceNow?s unified portal and autonomous workflows, turning intent into coordinated action across systems. The platform understands organizational structure, approvals, and authorization ? executing tasks that require multi-system coordination while maintaining governance and audit trails.</p><p>Availability: ServiceNow EmployeeWorks is generally available to customers. The first AI specialist for Autonomous Workforce, a Level 1 Service Desk AI Specialist, is in controlled availability and expected to be generally available second quarter of 2026; Moveworks continues to be offered as a standalone product within the ServiceNow portfolio. Organizations can acquire the Moveworks platform as an independent AI solution or as an integrated component of their ServiceNow deployment, ensuring flexibility in enterprise-wide implementation.</p></div>",
            "link": "https://hk.marketscreener.com/news/servicenow-launches-autonomous-workforce-that-think-and-acts-adds-moveworks-to-the-servicenow-ai-pl-ce7e5cd9dc8eff20",
            "pub_date": "2026-02-27 01:41:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Threat to large IT firms 'overblown', Cognizant's AI chief says amid Anthropic-driven disruption",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/threat-to-large-it-firms-overblown-cognizant-s-ai-chief-says-amid-anthropic-driven-disruption-ce7e5cd9dc8ef023",
            "pub_date": "2026-02-27 01:41:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Penumbra Seen as 'Strategic and Financial Fit' for Boston Scientific, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/penumbra-seen-as-strategic-and-financial-fit-for-boston-scientific-rbc-says-ce7e5cd9dc8ef020",
            "pub_date": "2026-02-27 01:41:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ericsson Demonstrates Breakthrough Drone Detection Proof of Concept At Texas Headquarters",
            "description": "<div class=\"txt-s4 article-text\"><p>Ericsson announced a successful live proof of concept of its ISAC (Integrated Sensing and Communication) technology at the company's U.S. Headquarters in Plano, Texas, signaling a major step forward in the evolution of networks that both connect and sense the world around them. The live proof of concept centered on drone detection using Ericsson's massive-MIMO radios, showcasing the network's ability to track unmanned aerial vehicles (UAVs) within surrounding airspace. This proof of concept demonstrates that the US is a global leader in ISAC technology which enhances national security, optimizes spectrum use, and drives economic growth.</p><p>ISAC is an innovative technology that enables use cases across commercial, public safety and defense scenarios, enabling faster adoption of new emerging technologies like autonomous systems and drone delivery in commercial settings. From a defense scenario, itaugments national security and provides an additional layer of safety. ISAC integrates sensing and spatial location of passive (not connected) objects into the mobile communication network - extending network functionality beyond connectivity by enabling the detection and characterization of objects and movement using existing infrastructure.</p><!-- Article --><p>The capability is progressing in 3GPP with initial studies in Release 19 and is expected to form part of early 6G standardization, showing the foundation for broad, scalable sensing applications. Safer, smarter infrastructure: Network-based sensing can support use cases by augmenting local sensors with wide-area network awareness. Efficient path to scale: ISAC is designed to reuse existing mobile network sites, spectrum, and hardware, enabling pragmatic introduction and coverage at scale.</p><p>Road to 6G: 3GPP studies have begun, with ISAC poised to become a foundational capability in the 6G era. The proof of concept underscores Ericsson's commitment to advancing 6G-era capabilities and collaborating with the broader ecosystem to validate real-world scenarios and deployment approaches across sites, spectrum, and hardware integration levels. Ericsson has invested more than $150 million in the factory and is the only manufacturer making telecom equipment at scale in the US.</p><p>The highly automated, 300,000-square-foot facility supports more than 550 US manufacturing jobs and strengthens secure, resilient domestic supply chains. As 6G technology matures, Ericsson plans to build-on this US-based manufacturing foundation to support future deployments.</p></div>",
            "link": "https://hk.marketscreener.com/news/ericsson-demonstrates-breakthrough-drone-detection-proof-of-concept-at-texas-headquarters-ce7e5cd9dc8ef12c",
            "pub_date": "2026-02-27 01:41:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venezuela gasoline station federation declares emergency, says earnings unsustainable-document, sources",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/venezuela-gasoline-station-federation-declares-emergency-says-earnings-unsustainable-document-sour-ce7e5cd9dc8ef123",
            "pub_date": "2026-02-27 01:41:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tesla Reaches Settlement With German Union",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tesla-reaches-settlement-with-german-union-ce7e5cd9dc8ef121",
            "pub_date": "2026-02-27 01:41:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alphabet Launches Nano Banana 2 for Image Generation",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/alphabet-launches-nano-banana-2-for-image-generation-ce7e5cd9dc8ef325",
            "pub_date": "2026-02-27 01:35:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart to Pay $100 Million Settlement Over Alleged Deceptive Earnings Charges, FTC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/walmart-to-pay-100-million-settlement-over-alleged-deceptive-earnings-charges-ftc-says-ce7e5cd9dc8ef42c",
            "pub_date": "2026-02-27 01:35:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SD Guthrie and MBI Selangor sign MoU for strategic Carey Island development",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sd-guthrie-and-mbi-selangor-sign-mou-for-strategic-carey-island-development-ce7e5cd9dc8ef425",
            "pub_date": "2026-02-27 01:35:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia 'More Than Delivered' With Accelerating Growth, Extended AI Demand Visibility, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-more-than-delivered-with-accelerating-growth-extended-ai-demand-visibility-bofa-says-ce7e5cd9dc8ef522",
            "pub_date": "2026-02-27 01:35:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FUJIFILM Holdings Corporation entered into a share transfer agreement to acquireETG Global Information Technology Services Inc.",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    FUJIFILM Holdings Corporation (TSE:4901) entered into a share transfer agreement to acquireETG Global Information Technology Services Inc. on February 26, 2026.<br/><br/>\n\nOn March 2, ETG Global will change its company name to FUJIFILM ETG Global Inc. and commence business activities.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/fujifilm-holdings-corporation-entered-into-a-share-transfer-agreement-to-acquireetg-global-informati-ce7e5cd9dc8ef72c",
            "pub_date": "2026-02-27 01:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Charoen Pokphand Foods posts FY net profit attributable 25,197 million Baht",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/charoen-pokphand-foods-posts-fy-net-profit-attributable-25-197-million-baht-ce7e5cd9dc8ef723",
            "pub_date": "2026-02-27 01:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Correction to Royal Bank 1Q Earnings Updated Article",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  Royal Bank's allowance for credit losses on impaired loans increased. \"Royal Bank 1Q Earnings Lifted by Personal Banking, Markets Growth -- Update,\" at 10:48 ET, mistakenly said the allowance on performing loans was increased. </p><br/><p>\n  (END) Dow Jones Newswires</p><!-- Article --><p>\n\n  02-26-26 1231ET</p></div>",
            "link": "https://hk.marketscreener.com/news/correction-to-royal-bank-1q-earnings-updated-article-ce7e5cd9dc8ef722",
            "pub_date": "2026-02-27 01:36:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EUROPE POWER-Further gains in renewable energy weigh on spot prices",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/europe-power-further-gains-in-renewable-energy-weigh-on-spot-prices-ce7e5cd9dc8ffe21",
            "pub_date": "2026-02-27 01:36:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German Shares Rally Amid Corporate Earnings Buzz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-shares-rally-amid-corporate-earnings-buzz-ce7e5cd9dc8ffe25",
            "pub_date": "2026-02-27 01:36:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "British Equities End Busy Earnings Day Higher as Howden Joinery, LSEG Shares Surge",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/british-equities-end-busy-earnings-day-higher-as-howden-joinery-lseg-shares-surge-ce7e5cd9dc8fff2d",
            "pub_date": "2026-02-27 01:36:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toronto Stocks Rise; Toronto-Dominion Bank Up on Higher 1Q Revenue, Profit",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Adriano Marchese </p><br/><p>\n  Toronto stocks were higher in midday trading on Thursday, with most sectors showing gains. </p><!-- Article --><p>\n\n  Shares of transportation, tech services and producer manufacturing companies led the market higher. Consumer discretionary, tech and health tech stocks were the main decliners. </p><p>\n\n  Canada's S&amp;P/TSX Composite Index rose 0.5% to 34290.61, and the blue-chip S&amp;P/TSX 60 rose 0.4% to 1976.33. </p><p>\n\n  Banks continued to post results with Toronto-Dominion Bank and Royal Bank of Canada reporting earnings. </p><p>\n\n  Toronto-Dominion Bank's stock rose by 0.9% to 134.20 Canadian dollars, equivalent to $98.13, after logging higher first-quarter earnings. Revenue growth across its operations, including higher loan and deposit volumes in Canada, and strength in its wealth-management and markets-facing segments boosted results. </p><p>\n\n  On the broader economic front, Canada's current-account deficit narrowed in the fourth quarter, capping a year in which the shortfall doubled amid trade tensions and commodity-price volatility. </p><br/><p>\n  Other market movers: </p><p>\n\n  Royal Bank of Canada's shares slipped 1.8% to C$232.92 after reporting an elevated credit-loss provision, despite seeing growth in its wealth management, personal banking and capital markets operations. </p><p>\n\n  Quebecor shares rose 0.5% to C$55.40 after it reported higher fourth-quarter results. The addition of more mobile users to its network helped boost revenue. </p><p>\n\n  Gildan Activewear missed adjusted earnings per share and profit expectations in the fourth quarter. The company noted that it has found more synergies from its newly-acquired HanesBrands unit. Gildan also said it has put up HanesBrands' Australia unit up for sale. Shares decline 4.6% to C$93.03. </p><br/><p>\n  Write to Adriano Marchese at adriano.marchese@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1229ET</p></div>",
            "link": "https://hk.marketscreener.com/news/toronto-stocks-rise-toronto-dominion-bank-up-on-higher-1q-revenue-profit-ce7e5cd9dc8ff020",
            "pub_date": "2026-02-27 01:36:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YTL Power International Berhad Reports Earnings Results for the Second Quarter and Six Months Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    YTL Power International Berhad reported earnings results for the second quarter and six months ended December 31, 2025. For the second quarter, the company reported sales was MYR 5,252.97 million compared to MYR 5,679.78 million a year ago. Net income was MYR 436.56 million compared to MYR 767.69 million a year ago. Basic earnings per share from continuing operations was MYR 0.0506 compared to MYR 0.0935 a year ago. Diluted earnings per share from continuing operations was MYR 0.0478 compared to MYR 0.0924 a year ago.<br/>\rFor the six months, sales was MYR 10,613.28 million compared to MYR 11,363.3 million a year ago. Net income was MYR 937.13 million compared to MYR 1,238.29 million a year ago. Basic earnings per share from continuing operations was MYR 0.1092 compared to MYR 0.1509 a year ago. Diluted earnings per share from continuing operations was MYR 0.1025 compared to MYR 0.1491 a year ago.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/ytl-power-international-berhad-reports-earnings-results-for-the-second-quarter-and-six-months-ended-ce7e5cd9dc8ff125",
            "pub_date": "2026-02-27 01:30:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NTT DATA and Ericsson Team Up to Scale Private 5G and Physical AI for Enterprises",
            "description": "<div class=\"txt-s4 article-text\"><p>NTT DATA and Ericsson announced a multi-year strategic partnership to accelerate enterprise adoption of private 5G and unlock advanced edge AI and physical AI use cases. As organizations look to embed intelligence at the edge across global operations, the partnership will enable AI-driven, outcome-focused transformation. By combining Ericsson's Private 5G and Edge platforms with NTT DATA's full-stack enterprise network services, wireless network expertise, IT/OT security and managed services, the companies will deliver industry-ready solutions that help enterprises deploy private 5G networks and deliver business outcomes at a global scale with confidence.</p><p>The partnership will focus on four priority areas: Global Private 5G managed services at scale:NTT DATA will act as one of Ericsson's key global system integration and managed services providers, delivering Private 5G as a fully managed service with consistent architecture, operations and security worldwide. AI embedded directly into enterprise connectivity: NTT DATA Edge AI agents will run on Ericsson's enterprise Edge platforms, enabling real-time intelligence and autonomous decision-making where data is generated. Repeatable industry solutions: The companies will be able to deliver proven private 5G, edge AI and physical AI use case across manufacturing, mining, ports, airports, energy, transportation and smart cities, helping enterprises accelerate deployment and realize measurable ROI.</p><!-- Article --><p>Unified global go-to-market: Joint sales, marketing and delivery will give enterprises a single, consistent path to deployment, reduce vendor complexity and speed time to value. The partnership will initially focus on high-impact use cases across industries, including: Manufacturing: Automated quality inspection, predictive maintenance and real-time safety monitoring using sensor and vision data. Transportation, ports and logistics: Autonomous operations driven by real-time vehicle and asset data for dynamic routing, tracking and safety.</p><p>Energy and mining: Remote and autonomous operations, intelligent inspection and AI-driven monitoring in complex and hazardous environments. Smart cities: Intelligent traffic management, public safety monitoring and real-time optimization of energy and municipal services.</p></div>",
            "link": "https://hk.marketscreener.com/news/ntt-data-and-ericsson-team-up-to-scale-private-5g-and-physical-ai-for-enterprises-ce7e5cd9dc8ff427",
            "pub_date": "2026-02-27 01:30:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hanwha and Greek  Shipyards to expand activities in the US",
            "description": "<div class=\"txt-s4 article-text\"><p>ATHENS, Feb 26 - Greek ???? Shipyards and Technology said on Thursday it signed an agreement with South Korean Hanwha Power Systems to expand their joint activities in the United States in shipbuilding, energy production and regasification units.</p><p>\n              ONEX, which operates two shipyards in Greece, said in a press release that the deal also includes projects in power generation, shipyard efficiency, and energy storage platforms. </p><!-- Article --><p>\n              \"Hanwha and ONEX are joining forces to help bring maritime energy production back to the United States and to accelerate the development of critical energy infrastructure,\" said Panos Xenokostas, ONEX CEO, in a press release.</p><p>\n              The Trump administration said last year that the U.S. would work with South Korea to help the struggling U.S. shipbuilding industry and get support to make ships in the country. </p><p>\n              The U.S. also supports Greece's efforts to become an energy hub in the Balkans and supply central and southern Europe with U.S.-produced liquefied natural gas (LNG).</p><p></p><p> (Reporting by Lefteris Papadimas, Editing by Alexandra Hudson)</p></div>",
            "link": "https://hk.marketscreener.com/news/hanwha-and-greek-shipyards-to-expand-activities-in-the-us-ce7e5cd9dc8ff426",
            "pub_date": "2026-02-27 01:30:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}