{
    "data": [
        {
            "title": "Minister Dominic LeBlanc says on USMCA there have always been bilateral arrangements as between the three countries",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/minister-dominic-leblanc-says-on-usmca-there-have-always-been-bilateral-arrangements-as-between-the-ce7e5cd9df8bff2d",
            "pub_date": "2026-02-27 02:21:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canadian minister responsible for Canada-U.S. trade says private government to government conversations on USMCA are not discouraging",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/canadian-minister-responsible-for-canada-u-s-trade-says-private-government-to-government-conversati-ce7e5cd9df8bff23",
            "pub_date": "2026-02-27 02:21:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "France's Engie needs 4 billion euros in asset disposals to finance UK Power Network purchase",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/france-s-engie-needs-4-billion-euros-in-asset-disposals-to-finance-uk-power-network-purchase-ce7e5cd9df8bf221",
            "pub_date": "2026-02-27 02:21:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "World shares eke out record highs as Europe turns subdued",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/world-shares-eke-out-record-highs-as-europe-turns-subdued-ce7e5cd9df8bf224",
            "pub_date": "2026-02-27 02:21:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC quarterly profit jumps on capital markets strength",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-quarterly-profit-jumps-on-capital-markets-strength-ce7e5cd9df8bf320",
            "pub_date": "2026-02-27 02:15:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United States presses Syria to shift from Chinese telecom systems, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/united-states-presses-syria-to-shift-from-chinese-telecom-systems-sources-say-ce7e5cd9df8bf325",
            "pub_date": "2026-02-27 02:15:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury 7-year yield pares fall after seven-year auction; last down 3.3 bps at 3.777%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-7-year-yield-pares-fall-after-seven-year-auction-last-down-3-3-bps-at-3-777-ce7e5cd9df8bf42d",
            "pub_date": "2026-02-27 02:15:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KKR's Corel to Separate Into Two Companies",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kelly Cloonan </p><br/><p>\n  Corel, which is owned by KKR, said it plans to separate its business into two independent companies. </p><!-- Article --><p>\n\n  The Canadian software company said Thursday that private equity firm Vector Capital Management will acquire its portfolio of creativity and productivity software. Funds managed by KKR will continue to own Corel's Parallels business, which offers cross-platform and virtualization software. </p><p>\n\n  After the transaction is completed, Corel's Chief Executive Christa Quarles will continue to be CEO of Parallels. Prasannaa Ganesan, former chief operating officer of Corel, will become CEO of Corel, the company said. </p><p>\n\n  The company did not disclose the financial terms of the deal. It is expected to close in May. </p><p>\n\n  The deal aims to allow Parallels to sharpen its focus, and best position both Corel and Parallels to serve their respective customers and markets, the company said. </p><br/><p>\n  Write to Kelly Cloonan at kelly.cloonan@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1311ET</p></div>",
            "link": "https://hk.marketscreener.com/news/kkr-s-corel-to-separate-into-two-companies-ce7e5cd9df8bf525",
            "pub_date": "2026-02-27 02:16:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hungary's Orban asks EU to go verify Druzhba pipeline damage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hungary-s-orban-asks-eu-to-go-verify-druzhba-pipeline-damage-ce7e5cd9df8bf725",
            "pub_date": "2026-02-27 02:10:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada Steadfast in Avoiding Travel to U.S., Buying More Domestic Goods : Central Bank Research",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Paul Vieira </p><br/><p>\n  OTTAWA--Anger over President Trump's trade policy has fueled a notable increase in Canadian spending on domestic products and local tourism, according to research from the Bank of Canada. </p><!-- Article --><p>\n\n  The central bank's analysis, published Thursday, also suggests that momentum behind buying Canadian remains solid with no sign of ebbing. </p><p>\n\n  \"Should Canadian consumers continue to prefer domestic products over U.S. goods and services, this spending shift could not only affect the composition of Canada's gross domestic product but also have an impact on inflationary pressures,\" the report said. The research was conducted by the central bank's analysts and produced independently from the Bank of Canada's governing council, which decides on rate policy. </p><p>\n\n  Trump's protectionist trade policy, along with musings from Trump about using economic force to annex Canada as a 51st state, triggered a Buy Canadian movement in the country. People vowed not to travel to the U.S., and Statistics Canada data bear this out. Grocers continue to prominently mark certain products in aisles as made-in-Canada. </p><p>\n\n  Overall, trade-policy uncertainty has cast a pall over the Canadian economy, as companies curb investment plans and hiring until the future of the U.S.-Mexico-Canada trade treaty, or USMCA, is settled. Senior Bank of Canada officials have called the pending U.S.-led review of USMCA later this year as an important risk to the economic outlook. </p><p>\n\n  Statistics Canada data earlier this week indicated trips by Canadians to the U.S. fell by 25% in 2025 -- or the largest year-over-year decline ever recorded excluding the Covid-19 pandemic period. The Bank of Canada report indicates that Canadians, instead, took 4% more trips domestically between the first and third quarters of last year, and spent 10% more on travel and tourism during that same timeframe. </p><p>\n\n  As for the purchasing of goods, the Bank of Canada analysts used detailed, transaction-level data from NielsenIQ. The data indicate that since March, 2025, households have shifted food spending away from U.S. products and toward Canadian ones. \"The shift is modest but clearly visible,\" the report said. The central bank said the shift was more pronounced in categories such as coffee and fruit juice. </p><p>\n\n  \"Outside of food, where Canadian substitutes are often harder to find, we see no comparable shift in spending patterns,\" the central bank research said. The report added that retaliatory tariffs imposed by Canada on certain goods might have also prompted a shift away from U.S. products -- although Prime Minister Mark Carney dropped most of those duties in late August. </p><p>\n\n  Most Canadian exports arriving in the U.S. are free of tariffs, because they comply with the terms under USMCA. The White House also provided an exemption for Canada and Mexico from Trump's new global tariff of 15%, revealed about a week ago after the U.S. Supreme Court ruling invalidating his original levies. It's unclear whether that exemption will remain as part of the U.S. review of USMCA. </p><br/><p>\n  Write to Paul Vieira at paul.vieira@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1308ET</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-steadfast-in-avoiding-travel-to-u-s-buying-more-domestic-goods-central-bank-research-ce7e5cd9df88fe2d",
            "pub_date": "2026-02-27 02:10:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VEGOILS-Palm tracks Dalian, Chicago rivals lower; firm currency weigh",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/vegoils-palm-tracks-dalian-chicago-rivals-lower-firm-currency-weigh-ce7e5cd9df88fe23",
            "pub_date": "2026-02-27 02:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury 7-year yield pares fall after seven-year auction; last down 3.3 bps at 3.777%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-7-year-yield-pares-fall-after-seven-year-auction-last-down-3-3-bps-at-3-777-ce7e5cd9df88f124",
            "pub_date": "2026-02-27 02:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sempra Reports Earnings Results for the Fourth Quarter Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Sempra reported earnings results for the fourth quarter ended December 31, 2025. For the fourth quarter, the company reported sales was USD 3,749 million compared to USD 3,758 million a year ago. Revenue was USD 3,749 million compared to USD 3,758 million a year ago.</p><p>Net income was USD 352 million compared to USD 676 million a year ago. Basic earnings per share from continuing operations was USD 0.54 compared to USD 1.05 a year ago. Diluted earnings per share from continuing operations was USD 0.54 compared to USD 1.04 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/sempra-reports-earnings-results-for-the-fourth-quarter-ended-december-31-2025-ce7e5cd9df88f322",
            "pub_date": "2026-02-27 02:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple seeks dismissal of fraud lawsuit over Siri AI, Epic injunction",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Apple urged a federal judge to dismiss a proposed class action claiming it defrauded shareholders twice, by overstating the artificial intelligence capabilities of its Siri voice assistant and falsely representing its compliance with an injunction governing commissions on app sales.  </p><p>\n              In a Wednesday filing in the San Jose, California, federal court, Apple said there was no proof it knew when discussing AI at a June 2024 conference that it would take longer than expected to incorporate two advanced AI features into Siri, potentially hurting iPhone 16 sales.</p><!-- Article --><p>\n              The company delayed some Siri upgrades the following March, and Chief Executive Tim Cook said two months later that developing a \"more personal\" Siri was \"taking a bit longer than we thought.\"</p><p>\n              Apple also said it provided no assurance that its procedures designed to comply with a 2021 injunction, in a case brought by Epic Games, to let app users pay developers directly rather than have the company charge the developers hefty commissions would be foolproof.</p><p>\n              \"It is no secret that Apple faced challenges and weathered ups and downs in its stock price in 2025, like many major companies,\" Apple said. \"But plaintiff takes a massive and unsupported leap by claiming that securities fraud caused the temporary price drops.\"</p><p>\n              The lawsuit covers Apple shareholders who suffered potentially hundreds of billions of dollars of losses in the Cupertino, California-based company's stock between May 3, 2024 and May 1, 2025, the day after a judge said Apple was violating the injunction.</p><p>\n              Lawyers for shareholders led by South Korea's National Pension Service, the world's third largest pension fund with close to $1 trillion of assets, did not immediately respond to requests for comment.</p><p>\n              Apple's injunction required the company to provide app users with external links for purchases, so developers wouldn't owe 30% commissions for purchases in its App Store.</p><p>\n              The judge overseeing that case rebuked Apple for creating a new system that charged a 27% commission on some external sales. A federal appeals court partially reversed her sanctions in December.</p><p></p><p> (Reporting by Jonathan Stempel in New York; Editing by Franklin Paul)</p><p>\n            By Jonathan Stempel</p></div>",
            "link": "https://hk.marketscreener.com/news/apple-seeks-dismissal-of-fraud-lawsuit-over-siri-ai-epic-injunction-ce7e5cd9df88f623",
            "pub_date": "2026-02-27 02:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YTL Power International posts Q2 profit attributable of 436.6 million RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ytl-power-international-posts-q2-profit-attributable-of-436-6-million-rgt-ce7e5cd9df88f722",
            "pub_date": "2026-02-27 02:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU tells Kyrgyzstan to crack down on re-export of sanctioned goods to Russia",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eu-tells-kyrgyzstan-to-crack-down-on-re-export-of-sanctioned-goods-to-russia-ce7e5cd9df89fe23",
            "pub_date": "2026-02-27 02:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toyota plans around $19 billion share sale by financial institutions",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/toyota-plans-around-19-billion-share-sale-by-financial-institutions-ce7e5cd9df89fe20",
            "pub_date": "2026-02-27 02:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kenvue Bid to Dismiss Texas AG Lawsuit Rejected by Judge",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kenvue-bid-to-dismiss-texas-ag-lawsuit-rejected-by-judge-ce7e5cd9df89f32c",
            "pub_date": "2026-02-27 02:01:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kenvue Bid to Dismiss Texas AG Lawsuit Rejected by Judge",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kenvue-bid-to-dismiss-texas-ag-lawsuit-rejected-by-judge-ce7e5cd9df89f326",
            "pub_date": "2026-02-27 02:01:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kenvue Bid to Dismiss Texas AG Lawsuit Rejected by Judge, Reuters Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kenvue-bid-to-dismiss-texas-ag-lawsuit-rejected-by-judge-reuters-reports-ce7e5cd9df89f420",
            "pub_date": "2026-02-27 02:01:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tenaga Nasional posts quarterly profit attributable 1.68 billion RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tenaga-nasional-posts-quarterly-profit-attributable-1-68-billion-rgt-ce7e5cd9df89f621",
            "pub_date": "2026-02-27 02:01:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Decline as Chipmakers Dive After Nvidia's Results",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-decline-as-chipmakers-dive-after-nvidia-s-results-ce7e5cd9df89f72d",
            "pub_date": "2026-02-27 02:01:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snowflake Posts Strong Q4, Well Positioned for AI Workloads, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/snowflake-posts-strong-q4-well-positioned-for-ai-workloads-rbc-says-ce7e5cd9df89f722",
            "pub_date": "2026-02-27 02:01:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nymex Overview : Oil, Products Up in Choppy Trade on Uncertain US-Iran Talks -- OPIS",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  Petroleum contracts were trading higher by midday Wednesday as the complex erased early losses on market jitters amid tense nuclear talks between U.S. and Iranian officials. </p><p>\n\n  At 12:05 p.m. ET, April NYMEX West Texas Intermediate crude futures were up 85cts to about $66.25/bbl and May WTI was 80cts higher to $66.15/bbl. </p><!-- Article --><p>\n\n  London-based April ICE Brent was up by around $1.20 to $72.05/bbl and May Brent increased $1.15 to $71.85/bbl. Refined product contracts largely tracked crude's gains. The more-active April NYMEX RBOB was 2.5cts higher to about $2.2705/gal and March RBOB was up by 3.05cts to $2.022/gal. April ULSD was around 4.35cts higher to $2.5745/gal and March ULSD rose 3.75cts to $2.7115/gal. </p><p>\n\n  On Thursday, U.S. envoys Steve Witkoff and Jared Kushner are holding a crucial round of talks in Geneva over Iran's nuclear program. According to the Wall Street Journal, citing unnamed sources, the U.S. negotiators are expected to make clear Iran must dismantle its three main nuclear sites and deliver all of its remaining enriched uranium to the U.S. Those demands could be tough for Tehran to accept, however. </p><p>\n\n  President Trump has in the last several weeks massed a heavy military presence in the Persian Gulf and threatened to strike Iran if a deal is not reached. A possible war in the region could easily choke off key crude oil supply routes and disrupt crude oil from the Middle East to the rest of the world. </p><p>\n\n  In the spot market, U.S. Gulf Coast CBOB and RBOB rose around 19cts and San Francisco CARBOB also jumped 9cts in midday trade, as physical barrels in both markets switched to the costlier summer RVP specifications following shipping cycle changes overnight. Other cash products largely mirrored changes in NYMEX futures. </p><pre style=\"font-size:14px\">\n\n- - \n </pre><p>\n\n  This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal. </p><br/><p>\n  Reporting by Frank Tang, ftang@opisnet.com; Editing by Michael Kelly, mkelly@opisnet.com </p><p>\n\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1254ET</p></div>",
            "link": "https://hk.marketscreener.com/news/nymex-overview-oil-products-up-in-choppy-trade-on-uncertain-us-iran-talks-opis-ce7e5cd9df89f721",
            "pub_date": "2026-02-27 02:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pakistan says responding to 'unprovoked' Afghan Taliban fire along border",
            "description": "<div class=\"txt-s4 article-text\"><p>KARACHI, Feb 26 (Reuters) - Pakistan's security forces responded to \"unprovoked fire\" by Afghan Taliban forces at multiple points along the Pakistan-Afghanistan border on Thursday, Pakistan's information ministry said.</p><p>\n              The ministry wrote on X that Taliban forces opened fire across several sectors in Khyber Pakhtunkhwa province and that Pakistani troops delivered an \"immediate and effective response\", inflicting heavy casualties and destroying multiple posts and equipment.</p><!-- Article --><p></p><p> (Reporting by Ariba Shahid in Karachi; Editing by Hugh Lawson)</p></div>",
            "link": "https://hk.marketscreener.com/news/pakistan-says-responding-to-unprovoked-afghan-taliban-fire-along-border-ce7e5cd9dc80fe26",
            "pub_date": "2026-02-27 02:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altera's Programmable Solutions Accelerate the Next Generation of 5G-Advanced and 6G Wideband Radios",
            "description": "<div class=\"txt-s4 article-text\"><p>At Mobile World Congress 2026, Altera highlighted how it's leveraging strategic partnerships to enable the next generation of advanced radio systems through programmable innovations. By ensuring seamless integration between leading radio platforms and Altera's FPGAs and Open RAN reference solutions, Altera is enabling communications providers to accelerate advanced 5G deployments, prototype early 6G architectures, and expand into emerging Non-Terrestrial Network (NTN) applications such as satellite and airborne connectivity. Altera recently collaborated with Broadcom to help enable the next generation of high-performance radio platforms by combining Altera's Agilex??</p><p>7 FPGAs with Broadcom's leadership in advanced radio silicon. Together, the companies successfully completed interoperability testing between Agilex 7 FPGAs and Broadcom's BroadPeak SoC platform, validating robust, deterministic, high-throughput performance across wideband radio configurations leveraging JESD204C connectivity at 32.44Gbps. Designed for large-scale deployments, the solution meets stringent power consumption envelopes and thermal hotspot constraints, enabling dense, high-capacity radios without compromising reliability or form factor.</p><!-- Article --><p>Together, the BroadPeak SoC platform allows equipment manufacturers and network operators to deploy wideband radios with advanced RF performance, evolving beamforming and AI-assisted signal processing, and open innovation as the industry moves toward 5G-Advanced and beyond. Successful interoperability between Altera and Broadcom's latest silicon platforms enables customers to rapidly build scalable radio platforms supporting O-RAN 7.2x splits, from 8T8R to 128T128R configurations and beyond. The combined solution supports next-generation 3GPP FR1 and FR3 bands, while efficiently partitioning baseband and RF processing to simplify system design and accelerate time-to-market.</p><p>Altera's collaboration with Broadcom reflects the company's broader momentum in working with leading technology partners to accelerate Open RAN innovation and deployment. Altera recently collaborated with NEC on a 5G Massive MIMO radio developed using Altera's Agilex 7 FPGA technology. The solution helped NEC rapidly bring to market a sub-6GHz radio unit that boosts network capacity with significant throughput gains while reducing power consumption by more than 40%, enabling more efficient Open RAN and vRAN deployments.</p></div>",
            "link": "https://hk.marketscreener.com/news/altera-s-programmable-solutions-accelerate-the-next-generation-of-5g-advanced-and-6g-wideband-radios-ce7e5cd9dc80f02c",
            "pub_date": "2026-02-27 01:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Instagram to Alert Teens' Parents of Repeated Self-Harm Searches",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Mauro Orru and Edith Hancock </p><br/><p>\n  Instagram said it would alert parents if their teens repeatedly search for terms related to self-harm or suicide, stepping up efforts to protect minors as several governments weigh social-media bans for younger users. </p><!-- Article --><p>\n\n  The app owned by Facebook parent Meta Platforms wrote in a blog post on Thursday that parents who have adopted Instagram's supervision tools to monitor their children's profile activity would start receiving alerts next week. </p><p>\n\n  Alerts will be triggered only when teens search repeatedly within a short period of time for terms like \"self-harm,\" \"suicide\" or phrases suggesting they want to harm themselves. </p><p>\n\n  The service will initially be available through emails, texts, WhatsApp messages and in-app notifications for parents and guardians in the U.S., Canada, the U.K. and Australia, expanding to other countries later this year. </p><p>\n\n  The move shows that Instagram is ramping up efforts to shield younger users from potentially dangerous content as social-media platforms face renewed criticism from governments and regulators that say they aren't going far enough. </p><p>\n\n  In December, Australia became the first country in the world to enact a social-media ban for under-16s, triggering a lawsuit from Reddit. Australian officials said the decision was needed to protect teens from experiencing harm on social media. </p><p>\n\n  Since then, several countries, including the U.K., France and Spain, have considered banning or have introduced bills to ban social media for certain age groups of minors. Earlier this month, Spanish Prime Minister Pedro Sanchez announced plans to ban social-media access for children under the age of 16 by implementing age-verification systems. </p><p>\n\n  The European Commission, the executive arm of the European Union, has also been piloting an age-verification app since July, which it says enables users to prove that they are over 18 when they attempt to access adult content. </p><p>\n\n  Instagram said it had opted for a threshold that requires a few searches of specific terms within a short period of time to trigger the alerts, erring on the side of caution, even if its systems might at times notify parents when there isn't a real risk for teens. </p><p>\n\n  The company said it would continue to alert emergency services when its systems detect that users might be at imminent risk of physical harm. </p><br/><p>\n  Write to Mauro Orru at mauro.orru@wsj.com and Edith Hancock at edith.hancock@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1252ET</p></div>",
            "link": "https://hk.marketscreener.com/news/instagram-to-alert-teens-parents-of-repeated-self-harm-searches-ce7e5cd9dc80f027",
            "pub_date": "2026-02-27 01:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Africa CDC head cites major concerns over data, pathogen sharing in US health deals",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 26 (Reuters) - There are big issues in the deals the United States is pursuing with African countries that govern how U.S. global health funding will work from now on, the head of the Africa Centres for Disease Control and Prevention said on Thursday.</p><p>\n              \"There are huge concerns regarding data, regarding pathogen sharing,\" Director-General Jean Kaseya told a virtual press conference. </p><!-- Article --><p>\n              On Wednesday, Zimbabwe pulled out of talks with the U.S. for its agreement, worth $367 million over the next five years, raising concerns over sensitive data and saying it was unequal. Zambia's government also said it had pushed back on a section of its deal.</p><p>\n              Other global health advocates have criticised the pathogen-sharing element of the deals, which ask countries to promptly share data with Washington about pathogens that could spark epidemics in their countries, as a condition of getting the funding. The deals do not guarantee that any drugs or vaccines developed as a result of that exchange would go to the countries affected.</p><p><b>RESHAPING U.S. GLOBAL HEALTH FUNDING </b></p><p>\n              The deals are the latest in a series of bilateral agreements reshaping how U.S. President Donald Trump's administration delivers billions of dollars in global health funding, after dismantling its aid agency last year, cutting funding and contracts worldwide, and pledging to put \"America First\" in its global health strategy. </p><p>\n              Kaseya said he had initially greeted that strategy with enthusiasm, because it would see African countries get money more directly, while simultaneously requiring them to co-invest. But he said he had rejected an opportunity for Africa CDC to be an observer to the deals, as he respected the sovereignty of individual nations. </p><p>\n              However, he said the agency had been supporting countries where requested, and would continue to advise if they wanted to renegotiate with the U.S., as well as supporting them to implement any agreement they do sign. </p><p>\n              \"I said to all of my countries, you have full support from Africa CDC. Even if you want to re-negotiate ... if you want Africa CDC to be there, we'll be there,\" he said.</p><p></p><p> (Reporting by  Anait Miridzhanian, Jennifer Rigby; Editing by Chris Reese)</p><p>\n            By Anait Miridzhanian and Jennifer Rigby</p></div>",
            "link": "https://hk.marketscreener.com/news/africa-cdc-head-cites-major-concerns-over-data-pathogen-sharing-in-us-health-deals-ce7e5cd9dc80f124",
            "pub_date": "2026-02-27 01:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tensor and Arm Partner to Deliver Ai-Defined Compute Foundation for Personal Robocar",
            "description": "<div class=\"txt-s4 article-text\"><p>Tensor and Arm announced a multi-year strategic collaboration to deliver the foundational compute architecture behind the world's first agentic AI personal Robocar. Through this partnership, Tensor is leveraging the Arm®? compute platform, which unifies hardware, software and ecosystem enablement, to power physical AI workloads spanning the entire vehicle.</p><p>Tensor has integrated more than 400 safety-capable, power-efficient Arm-based cores in each vehicle - the highest concentration of Arm technology in a consumer vehicle today. As Tensor scales its personal Robocar fleet for global commercialization in 2026, the companies will work together to enable the Level 4 autonomous capabilities required for next-generation mobility, supported by the extensive Arm software ecosystem of more than 22 million developers. AI is shifting to the physical world, where intelligence is embodied in machines and defining a new class of autonomous systems that sense, decide and act under uncompromising power, safety, and reliability constraints.</p><!-- Article --><p>Tensor is defining its vehicle around this intelligence rather than adapting autonomy onto legacy platforms. The Robocar is powered by the world's most vertically integrated Level 4 autonomy stack, and a comprehensive sensor suite of 37 cameras, 5 lidars, 11 radars, 22 microphones, 10 ultrasonic sensors, 3 IMUs, GNSS, 16 collaboration detectors, 8 water-level detectors, 4 tire-pressure sensors, a smoke detector, and triple-channel 5G connectivity. This unique depth of hardware and software integration represents a meaningful advancement in automotive sensing, enabling continuous perception, environmental awareness, and resilient system performance across diverse operating conditions. To make this possible, Tensor is using the leading-edge Arm compute platform to distribute safety-capable intelligence across the vehicle -from the onboard supercomputer to the smallest sensors - allowing the Robocar to safely perceive and navigate its environment through its foundation models.</p><p>Each Tensor Robocar incorporates433 Arm-based cores, including Neoverse®? AE for high-throughput AI processing, Cortex®?-X for agentic AI cabin and peak performance system control, Cortex-A for drive-by-wire, lidars, redundancy, and general compute, Cortex-R for real-time safety-critical systems, and Cortex-M for low-power subsystem management. The Arm compute platform enables Tensor to deploy AI workloads across diverse compute domains while meeting stringent automotive safety, thermal, and power requirements, operating in concert with NVIDIA-accelerated AI processing to support Tensor's proprietary autonomy stack.</p><p>The AI-native vehicle architecture used in each Tensor Robocar is enabled by a growing network of leading partners spanning AI compute, advanced manufacturing, safety systems, and critical vehicle technologies. Tensor has also selected industry leading automotive suppliers, semiconductor companies, and cloud partners including Autoliv, ZF, Continental, NVIDIA, AMD, Qualcomm, Samsung, and Oracle for the most advanced personal autonomous vehicle to ever be mass produced. The Tensor Robocar will be offered in the US, EU, and Middle East markets in 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/tensor-and-arm-partner-to-deliver-ai-defined-compute-foundation-for-personal-robocar-ce7e5cd9dc80f221",
            "pub_date": "2026-02-27 01:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC quarterly profit jumps on capital markets strength",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-quarterly-profit-jumps-on-capital-markets-strength-ce7e5cd9dc80f62d",
            "pub_date": "2026-02-27 01:50:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "L3Harris Sets 'Encouraging' Outlook at Investor Day, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/l3harris-sets-encouraging-outlook-at-investor-day-rbc-says-ce7e5cd9dc80f623",
            "pub_date": "2026-02-27 01:50:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US FDA to offer bonuses to speed up drug reviews, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - The U.S. Food and Drug Administration plans to give bonuses to scientific staff for speeding up drug reviews, Bloomberg News reported on Thursday, citing an FDA official familiar with the matter.</p><p>\n              The Department of Health and Human Services, which oversees the FDA, did not immediately respond to a Reuters request for comment. </p><!-- Article --><p></p><p> (Reporting by Kamal Choudhury in Bengaluru)</p></div>",
            "link": "https://hk.marketscreener.com/news/us-fda-to-offer-bonuses-to-speed-up-drug-reviews-bloomberg-news-reports-ce7e5cd9dc81fe22",
            "pub_date": "2026-02-27 01:50:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Erste Group Bank AG Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Erste Group Bank AG reported earnings results for the full year ended December 31, 2025. For the full year, the company reported net interest income was EUR 7,739 million compared to EUR 7,843 million a year ago. Net income was EUR 3,510 million compared to EUR 3,125 million a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/erste-group-bank-ag-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9dc81fe24",
            "pub_date": "2026-02-27 01:50:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lowe's Aims for $1 Billion in Productivity Gains in 2026 to Counter Cost Inflation, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lowe-s-aims-for-1-billion-in-productivity-gains-in-2026-to-counter-cost-inflation-rbc-says-ce7e5cd9dc81ff2d",
            "pub_date": "2026-02-27 01:50:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Does Trump's new 'surcharge' make EU worse off than under trade deal?",
            "description": "<div class=\"txt-s4 article-text\"><p>BRUSSELS, Feb 26 (Reuters) - The EU has demanded that the United States stick to the terms of a trade deal they agreed last year after the U.S. Supreme Court struck down President Donald Trump's global tariffs and he responded with a new, across-the-board \"import surcharge\".</p><p><b>WHAT ARE THE TERMS OF THE 'TURNBERRY DEAL'?</b></p><!-- Article --><p>\n              Trump and European Commission President Ursula von der Leyen concluded a deal at Trump's Turnberry golf course in Scotland last July.</p><p>\n              It set a broad 15% U.S. tariff for most EU exports or, for a very small range of products, the pre-existing most-favoured nation (MFN) duty rate if that is higher than 15%. Steel and aluminium tariffs remained at 50%, while no extra tariffs applied for a limited number of EU goods, including unavailable natural resources such as cork, aircraft and aircraft parts and generic pharmaceuticals and their ingredients.</p><p>\n              Washington also agreed to reduce its tariff for EU car imports to 15% from a previous 25%.</p><p>\n              The European Union committed to remove its import duties on all U.S. industrial goods and to provide preferential market access for a wide range of U.S. seafood and agricultural goods, as well as to extend zero tariffs for U.S. lobsters, as initially agreed with Trump in 2020.</p><p><b>WHAT DOES THE 'IMPORT SURCHARGE' MEAN FOR THE EU?</b></p><p>\n              The Supreme Court ruled that Trump had exceeded his authority in using the 1977 International Emergency Economic Powers Act, which was the legal basis for the broad 15% tariff on EU products.</p><p>\n              So those tariffs have been superseded by Trump's new \"import surcharge\", which the U.S. began collecting at a 10% rate on Tuesday. The Trump administration is working to increase the rate to 15%, the level that had generally applied to EU exports.</p><p>\n              However, unlike the tariff terms of the EU-U.S. trade deal, the surcharge applies in addition to the MFN rate.</p><p>\n              The surcharge does not affect the tariffs on cars or steel and does not apply to critical minerals, pharmaceuticals, some electronic products, beef, tomatoes and oranges and any products subject to 'Section 232' tariffs imposed on grounds of national security.</p><p>\n              The EU has acknowledged it faces a \"transition period\" of a few months during which U.S. tariffs will be higher for certain EU exports.</p><p><b>WHICH EU PRODUCTS FACE HIGHER TARIFFS?</b></p><p>\n              Given the average U.S. MFN duty is 3.4%, overall tariffs (MFN+10%) for many EU products under the new system will be lower than 15%, particularly for industrial goods. It does become problematic if and when the surcharge rate rises to 15%.</p><p>\n              Some EU exports, though, face higher tariffs than before. The European Commission says 7% of EU exports to the U.S. are subject to an MFN duty above 5%. EU goods exports to the U.S. totalled 536 billion euros ($631.9 billion) in 2024.</p><p>\n              Products affected include textiles, clothing and shoes, with rates on footwear up to 48%, and consumer goods, including suitcases and handbags, glassware, pillows and cushions and some light fittings.</p><p>\n              Of agricultural and food goods, MFN rates above 5% apply for many dairy products, with Edam and Parmesan cheeses at 10% and Roquefort at 8%, as well as for certain fruit and vegetables, including melons, strawberries, Brussels sprouts and carrots.</p><p>\n              ($1 = 0.8482 euros)</p><p></p><p> (Reporting by Philip BlenkinsopEditing by Gareth Jones)</p><p>\n            By Philip Blenkinsop</p></div>",
            "link": "https://hk.marketscreener.com/news/does-trump-s-new-surcharge-make-eu-worse-off-than-under-trade-deal-ce7e5cd9dc81f02d",
            "pub_date": "2026-02-27 01:50:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS executive says one item remains in migration of Credit Suisse clients",
            "description": "<div class=\"txt-s4 article-text\"><p>ZURICH, Feb 26 (Reuters) - UBS has one item remaining in the migration of former Credit Suisse clients onto UBS's system, the Switzerland head of the Zurich-based bank said on Thursday.</p><p>\n              \"We have another switchover event, where we will transfer the remaining client relationships,\" Sabine Keller-Busse said. </p><!-- Article --><p>\n              Those left to be migrated were mostly the bank's international clients booked in Switzerland, while the transfer of domestic clients had almost been completed, she added.</p><p>\n              \"I have to say, I'm enormously relieved. It's gone really, really well so far.\"</p><p>\n              At the end of March, the bank would start turning off Credit Suisse systems and finalise that process by the end of 2026, Keller-Busse said at a finance event in Zurich.</p><p>\n               (Reporting by Ariane Luthi, editing by Thomas Seythal)</p></div>",
            "link": "https://hk.marketscreener.com/news/ubs-executive-says-one-item-remains-in-migration-of-credit-suisse-clients-ce7e5cd9dc81f027",
            "pub_date": "2026-02-27 01:50:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTC says Walmart agreed to $100 million judgment to settle deceptive earnings charges",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Walmart has agreed to a $100 million judgment to settle allegations that the company caused delivery drivers to lose tens of millions of dollars in earnings, the U.S. Federal Trade Commission said in a statement on Thursday.</p><p></p><p>(Reporting by Daphne Psaledakis; editing by Michelle Nichols )</p></div>",
            "link": "https://hk.marketscreener.com/news/ftc-says-walmart-agreed-to-100-million-judgment-to-settle-deceptive-earnings-charges-ce7e5cd9dc81f12d",
            "pub_date": "2026-02-27 01:50:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Press Metal Aluminium posts quarterly revenue 4.04 billion RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/press-metal-aluminium-posts-quarterly-revenue-4-04-billion-rgt-ce7e5cd9dc81f123",
            "pub_date": "2026-02-27 01:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mainland Headwear expects 2025 profit not less than HK$100 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mainland-headwear-expects-2025-profit-not-less-than-hk-100-million-ce7e5cd9dc81f121",
            "pub_date": "2026-02-27 01:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia's Strong Double-Digit Growth Expected Well Into 2027, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-s-strong-double-digit-growth-expected-well-into-2027-rbc-says-ce7e5cd9dc81f22d",
            "pub_date": "2026-02-27 01:50:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}