{
    "data": [
        {
            "title": "Zydus Lifesciences says successful clinical development of pembrolizumab biosimilar fyb206",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/zydus-lifesciences-says-successful-clinical-development-of-pembrolizumab-biosimilar-fyb206-ce7e5cded181f120",
            "pub_date": "2026-02-27 17:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sri Lanka's Colombo consumer price index up 1.6% year-on-year in February",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sri-lanka-s-colombo-consumer-price-index-up-1-6-year-on-year-in-february-ce7e5cded181f223",
            "pub_date": "2026-02-27 17:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "What can China do to slow down its rising currency?",
            "description": "<div class=\"txt-s4 article-text\"><p>HONG KONG, Feb 27 (Reuters) - China's yuan is surging against the U.S. dollar, boosted by booming exports and aided by falling U.S. interest rates and the wobbly greenback.</p><p>\n              The yuan strengthened 4.4% last year in its biggest annual gain since 2020, and has firmed about 2% so far in 2026, hovering near three-year highs.</p><!-- Article --><p>\n              China's central bank moved to slow the pace of yuan appreciation on Friday, scrapping risk reserves requirements for forex forward contracts in a move that would encourage dollar buying.</p><p>\n              The People's Bank of China (PBOC) may deploy additional measures to prevent the yuan from appreciating too quickly, analysts say. </p><p>\n              Here are the tools at its disposal: </p><p><b>** FX REQUIREMENTS RATIO</b></p><p>\n              The PBOC said on Friday it would scrap the 20% reserves requirements for forex forward contracts, starting on March 2.</p><p>\n              The move would reduce the cost of dollar buying, and reverses a decision in September 2022 to raise the risk reserve requirements to stem the yuan's rapid losses and capital outflows. </p><p>\n              \"It sends a clear policy signal that regulators want to prevent excessive yuan appreciation, which will help stabilize market expectations,\" said Wang Qing, chief macroeconomic analyst at Orient Golden Credit Rating.</p><p>\n              Next, the PBOC could raise outright the amount of foreign exchange that financial institutions must hold as reserves, which would require dollar buying and tighten onshore dollar liquidity - slowing yuan gains. It is currently at 4%, having been reduced from 6% in 2023 as a measure to try and stem yuan weakness.</p><p><b>** COUNTER-CYCLICAL FACTOR IN YUAN'S DAILY GUIDANCE FIX</b></p><p>\n              Since December, the central bank has been setting its daily yuan official guidance at levels weaker than market projections, signaling its attention to slow the pace of yuan appreciation. </p><p>\n              The gap has widened this week to record levels, signifying the PBOC's growing discomfort with the yuan's rise and its strong intent to manage market expectations. </p><p><b>** STATE BANK DOLLAR BUYING </b></p><p>\n              China's major state-owned banks bought dollars in the onshore spot market and held them in an unusually strong effort to rein in yuan strength, Reuters reported in December.</p><p>\n              The lenders did not appear to recycle the dollars into the swap market, likely aimed at tightening dollar liquidity and so raising the cost of long yuan bets.</p><p>\n              Although the PBOC itself wasn't seen directly in the market, the state banks could have been acting on behalf of the central bank, said Brad Setser, a currency expert at the Council on Foreign Relations, in a recent blog post. </p><p>\n              \"All the activity is with the state banks,\" he noted estimating a \"nearly unprecedented\" level of backdoor intervention in December.</p><p><b>** VERBAL GUIDANCE </b></p><p>\n              PBOC officials frequently make public statements to reaffirm its commitment to keep the yuan \"basically stable\", and warn against the risk of currency overshooting.</p><p>\n              The central bank has also repeatedly urged market participants to use derivatives to hedge against currency risks, rather than making one-way bets on the yuan. </p><p><b>** DIRECT INTERVENTION </b></p><p>\n              In extreme cases, the PBOC can directly buy and sell foreign currencies in the market to influence exchange rates.</p><p>\n              During the 2015-16 China market crash, the PBOC sold dollars in the market to stablize a slumping yuan.</p><p>\n              In recent years, China's central bank has refrained from direct intervention, which is evidenced by its relatively stable foreign currency reserves.</p><p></p><p> (Reporting by Jiaxing Li in Hong Kong; Editing by Kim Coghill)</p></div>",
            "link": "https://hk.marketscreener.com/news/what-can-china-do-to-slow-down-its-rising-currency-ce7e5cded181f424",
            "pub_date": "2026-02-27 17:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia Shares Slide After Forecast Underwhelms Investors",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"3jNakwvOmcY\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        Nvidia (NVDA), the dominant maker of artificial intelligence chips, suffered its worst stock decline in 10 months after the company's latest forecast failed to dispel fears of an AI bubble. The shares fell 5.5% to $184.89 in New York, marking the biggest one-day drop since April 16. The decline followed a first-quarter sales outlook that -- on its face -- looked impressive. Nvidia easily beat the average analyst estimate and delivered a 73% surge in fourth-quarter revenue. The reaction was a stark reminder of the skepticism now surrounding Nvidia. After explosive sales growth turned the chipmaker into the world's most valuable company, investors are seeking stronger assurances that booming AI spending can be maintained. Bloomberg Intelligence Senior Semiconductor Analyst Kunjan Sobhani, and Senior Technology Credit Analyst Robert Schiffman both join Bloomberg Businessweek Daily to discuss. They speak with Carol Massar and Tim Stenovec.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52548819');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-shares-slide-after-forecast-underwhelms-investors-ce7e5cded181f62d",
            "pub_date": "2026-02-27 17:31:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US authorises the departure of some embassy personnel from Israel due to safety risks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-authorises-the-departure-of-some-embassy-personnel-from-israel-due-to-safety-risks-ce7e5cded18efe2c",
            "pub_date": "2026-02-27 17:31:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hungary PM Orban says joint Hungarian-Slovak committee to ascertain the state of Druzhba pipeline",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hungary-pm-orban-says-joint-hungarian-slovak-committee-to-ascertain-the-state-of-druzhba-pipeline-ce7e5cded18efe22",
            "pub_date": "2026-02-27 17:31:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wartsila CEO eyes boost from Trump datacenter push",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wartsila-ceo-eyes-boost-from-trump-datacenter-push-ce7e5cded18ef12c",
            "pub_date": "2026-02-27 17:31:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Meta Platforms Strikes Deal to Rent Google's AI Chips",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/meta-platforms-strikes-deal-to-rent-google-s-ai-chips-ce7e5cded18ef325",
            "pub_date": "2026-02-27 17:25:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. authorizes departure of some embassy personnel and their families from Israel due to safety risks - embassy post on X",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-authorizes-departure-of-some-embassy-personnel-and-their-families-from-israel-due-to-safety-ris-ce7e5cded18ef42c",
            "pub_date": "2026-02-27 17:25:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hungary PM Orban: Calls on Ukraine President Zelenskiy to Grant Access to Hungarian and Slovak Inspectors, to Restart Druzhba Crude Oil Pipeline",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hungary-pm-orban-calls-on-ukraine-president-zelenskiy-to-grant-access-to-hungarian-and-slovak-inspe-ce7e5cded18ef625",
            "pub_date": "2026-02-27 17:25:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pou Sheng International Sees 57% Lower Profit for 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/pou-sheng-international-sees-57-lower-profit-for-2025-ce7e5cded18ef720",
            "pub_date": "2026-02-27 17:20:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Air Liquide to Supply Oxygen for Holcim's Carbon Capture Facility in Belgium",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/air-liquide-to-supply-oxygen-for-holcim-s-carbon-capture-facility-in-belgium-ce7e5cded18ef726",
            "pub_date": "2026-02-27 17:20:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hungary PM Orban: Agreed with Slovak PM Fico to set up joint Hungarian-Slovak committee to ascertain state of Druzhba pipeline",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hungary-pm-orban-agreed-with-slovak-pm-fico-to-set-up-joint-hungarian-slovak-committee-to-ascertain-ce7e5cded18fff22",
            "pub_date": "2026-02-27 17:20:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MS&AD Insurance Unit Prices 1.4 Billion Euro-Denominated Bonds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ms-ad-insurance-unit-prices-1-4-billion-euro-denominated-bonds-ce7e5cded18ff021",
            "pub_date": "2026-02-27 17:20:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sichuan Biokin Pharmaceutical's prelim 2025 net loss at 1.1 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sichuan-biokin-pharmaceutical-s-prelim-2025-net-loss-at-1-1-billion-yuan-ce7e5cded18ff025",
            "pub_date": "2026-02-27 17:20:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Democrats Demand Trump Follow Clintons on Epstein Testimony",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"ZBlxamRXhow\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        House Democrats on Thursday demanded President Donald Trump follow the Clintons in testifying to congressional investigators on ties to disgraced financier Jeffrey Epstein. Secretary of State Hillary Clinton began a closed-door deposition Thursday by a House panel investigating Epstein in Chappaqua in upstate New York, where she has a home with her husband, former President Bill Clinton, according to a person familiar with the proceedings. Bill Clinton is set to face questioning on Friday. Bloomberg News National Security Reporter Jamie Tarabay joins Bloomberg Businessweek Daily to discuss. She speaks with Carol Massar and Tim Stenovec.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52548667');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/democrats-demand-trump-follow-clintons-on-epstein-testimony-ce7e5cded18ff123",
            "pub_date": "2026-02-27 17:21:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MPS CEO says future of AXA joint-venture an 'issue on the table'",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mps-ceo-says-future-of-axa-joint-venture-an-issue-on-the-table-ce7e5cded18ff224",
            "pub_date": "2026-02-27 17:21:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTSE 100 up; pound down after poll blow to UK PM",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Stock prices in Europe opened mixed on Friday, though share price progress for miners helped the FTSE 100 outperform.</p><p></p><p>Investors in London digested another batch of earnings, with Rightmove and Melrose bookending the FTSE 100 after their annual results. Elsewhere, Senior shot up as it revealed it has received M&amp;A interest. </p><!-- Article --><p></p><p>The FTSE 100 index was up 44.39 points, 0.4%, at 10,891.09 on Friday morning, trading around a record high. The FTSE 250 added 70.06 points, 0.3%, at 23,789.06, and the AIM all-share rose 3.27 points, 0.4%, to 818.50.</p><p></p><p>The Cboe UK 100 was up 0.3% at 1,083.60, the Cboe UK 250 added 0.2% at 20,991.81, and the Cboe small companies added 0.1% at 18,513.62.</p><p></p><p>The CAC 40 in Paris fell 0.2% while the DAX 40 in Frankfurt was flat. </p><p></p><p>In New York on Thursday, the Dow Jones Industrial Average ended slightly higher, the S&amp;P 500 shed 0.5% and the Nasdaq Composite declined 1.2%. </p><p></p><p>In Tokyo, the Nikkei 225 ended 0.2% higher. In China, the Shanghai Composite was 0.4% higher, while the Hang Seng Index in Hong Kong was 1.0% higher. In Sydney, the S&amp;P/ASX 200 added 0.3%. </p><p></p><p>The pound fell to USD1.3490 on Friday from USD1.3513 late Thursday, The euro rose to USD1.1814 from USD1.1792. Against the yen, the dollar faded to JPY156.05 from JPY156.20. </p><p></p><p>\"This could be a relatively quiet end of the week for the dollar as uncertainty over US-Iran tensions may prevent major directional shifts. In the UK, a by-election win by the Green Party spells more trouble for PM Keir Starmer, and is opening more downside risks for the pound,\" analysts at ING commented. </p><p></p><p>The Green Party has won its first ever parliamentary by-election in Gorton &amp; Denton, dealing a bitter blow to UK Prime Minister Keir Starmer.</p><p></p><p>Labour's defeat, trailing in third behind Zack Polanski's Greens and Nigel Farage's Reform UK in the previously rock-solid Greater Manchester constituency, will pile pressure on the prime minister.</p><p></p><p>Hannah Spencer, a councillor and plumber, emerged victorious for the Greens, with 14,980 votes and a majority of 4,402 votes.</p><p></p><p>Reform UK's candidate Matt Goodwin got 10,578 votes, with Labour's Angeliki Stogia trailing on 9,364, down from 18,555 in the 2024 general election, when the turnout was similarly high.</p><p></p><p>The yield on the US 10-year Treasury ebbed to 4.0% early Friday, from 4.03% at the time of the London equities close on Thursday. The 30-year yield slimmed to 4.66% from 4.68%. The 10-year yield is sitting around its tamest level since late-November.</p><p></p><p>ING analysts added: \"The lack of major data releases is keeping Fed pricing stable and the two major risks of the past couple of weeks – Iran and AI jitters – have started to abate.  </p><p></p><p>\"On the Fed side, we'll hear from John Williams and Neel Kashkari, after some dovish-leaning comments by Austan Goolsbee yesterday. Still, markets are paying very little attention to Fedspeak at this stage, given data has simply failed to support any pricing for a rate cut in the next two meetings.\"</p><p></p><p>According to the CME FedWatch Tool, there is a 96% chance the US central bank leaves rates at 3.50%-3.75% at its next decision on March 18. For April, the tool puts the odds of a old at 80%. Both probabilities have barely budged this week. </p><p></p><p>A barrel of Brent fell to USD71.10 early Friday from USD72.58 late Thursday. Gold edged up to USD5,180.28 an ounce from USD5,180.61.</p><p></p><p>Friday's global economic calendar has a German inflation reading at 1300 GMT and US producer price data at 1330 GMT.</p><p></p><p>In London, Fresnillo added 3.4%. Endeavour Mining rose 1.9% and Anglo American climbed 2.6% as diggers were on the up. </p><p></p><p>Rightmove surged 6.5%, as the property portal reported improved annual results, lifted its dividend and announced a GBP90 million share buyback</p><p></p><p>Shares are still down 29% over the past 12 months. </p><p></p><p>Analysts at Peel Hunt commented: \"The shares have been weighed down by broader AI concerns, but we see no evidence of any impact. We expect another solid year of growth, supported by further product development that should strengthen its market position.\"</p><p></p><p>Melrose slumped 14%. The aerospace firm will buy back GBP175 million worth of shares in the next year, after \"another strong performance\", which saw it beat profit consensus. Adjusted diluted earnings per share shot up 25% to 32.1p in 2025 from 26.4p in 2024, topping consensus of 31.6p.</p><p></p><p>Revenue improved 3.5% to GBP3.59 billion from GBP3.47 billion, topping consensus of GBP3.50 billion. </p><p></p><p>Adjusted operating profit surged 20% to GBP647 million and for 2026, it expects an outcome between GBP700 million to GBP750 million, at best growth of 16%, so slowing from 2025. At constant currency, adjusted operating profit was 23% higher in 2025.</p><p></p><p>It sees revenue between GBP3.75 billion to GBP3.95 billion, representing like-for-like growth of 10% at the mid-point, sharper than 2025's like-for-like top-line hike of 8%. </p><p></p><p>Elsewhere, Senior jumped 19%. It is in talks with a suitor and said it has postponed a GBP40 million buyback, </p><p></p><p>The maker of components and systems for aerospace and defence, land vehicle, and power and energy customers said that last month, it received a preliminary, non-binding all-cash proposal from a possible bidder. This offer was rejected, with Senior deeming it undervalued the firm. Two higher proposals were made by the same bidder, the \"the second of which was unequivocally rejected\". </p><p></p><p>It added: \"Following the approaches described above, the board appointed Lazard and Jefferies to initiate discussions with a limited number of third parties regarding a possible offer for the entire issued and to be issued share capital of Senior, to determine the value that could potentially be achieved. Following a period of discussions with these other parties, the company confirms it has received two further, superior all-cash proposals from other potential offerors. Discussions with potential offerors remain ongoing.\" </p><p></p><p>Senior at the end of last year set a GBP40 million buyback, but \"mindful of the company's regulatory obligations\", it has postponed the programme's start. It had been due to kick off following its annual results, due to be announced on Monday. </p><p></p><p>Wizz Air shares slumped 8.1% after a filing showed a shareholder trimmed its stake in the firm. Indigo Hungary and Indigo Maple Hill, managed by Indigo Partners, sold a total of 10.0 million shares in the budget carrier at 1,250 pence each, GBP125 million in total. </p><p></p><p>The sellers now own 14.7 million Wizz shares, just over a 14% stake.</p><p></p><p>On the Aquis Exchange, Equipmake jumped 47%. The maker of electric motors, inverters and zero-emission electric drivetrains and power electronic systems said it has received further backing from heavy machinery maker Caterpillar. </p><p></p><p>Equipmake has entered into a GBP3 million senior secured convertible loan note with New York listing's Caterpillar Venture Capital arm. It follows a GBP5 million strategic investment and development agreement with Caterpillar announced back in March. </p><p></p><p>\"Since Caterpillar's GBP5 million strategic investment in Equipmake in March 2025 we have developed a close relationship with them. I am therefore delighted that they have recognised the value of this partnership through investing a further GBP3 million in the company. Having the backing of Caterpillar has helped position Equipmake as a credible partner to both customers and suppliers, as well as providing a natural route to market for our solutions,\" Equipmake CEO Ian Foley said. </p><p></p><p>By Eric Cunha, Alliance News news editor</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/ftse-100-up-pound-down-after-poll-blow-to-uk-pm-ce7e5cded18ff323",
            "pub_date": "2026-02-27 17:21:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kyoto Financial Group Inc - notice regarding a subsidiary's sale of investment securities",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kyoto-financial-group-inc-notice-regarding-a-subsidiary-s-sale-of-investment-securities-ce7e5cded18ff720",
            "pub_date": "2026-02-27 17:21:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SH Group (Holdings) says unit awarded 5-year contract",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sh-group-holdings-says-unit-awarded-5-year-contract-ce7e5cded18cfe20",
            "pub_date": "2026-02-27 17:11:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arts Optical International sees increase in group's total revenue in FY",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arts-optical-international-sees-increase-in-group-s-total-revenue-in-fy-ce7e5cded18cfe27",
            "pub_date": "2026-02-27 17:11:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Leong Bank Berhad Reports Earnings Results for the Second Quarter and Six Months Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Hong Leong Bank Berhad reported earnings results for the second quarter and six months ended December 31, 2025. For the second quarter, the company reported net interest income was MYR 1,002.26 million compared to MYR 992.67 million a year ago. Net income was MYR 1,168.54 million compared to MYR 1,148.18 million a year ago. Basic earnings per share from continuing operations was MYR 0.57 compared to MYR 0.56 a year ago. Diluted earnings per share from continuing operations was MYR 0.567 compared to MYR 0.557 a year ago.<br/>\rFor the six months, net interest income was MYR 2,027.37 million compared to MYR 2,002.71 million a year ago. Net income was MYR 2,259.51 million compared to MYR 2,238.14 million a year ago. Basic earnings per share from continuing operations was MYR 1.102 compared to MYR 1.092 a year ago. Diluted earnings per share from continuing operations was MYR 1.096 compared to MYR 1.086 a year ago.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/hong-leong-bank-berhad-reports-earnings-results-for-the-second-quarter-and-six-months-ended-december-ce7e5cded18cf127",
            "pub_date": "2026-02-27 17:11:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CPP Investments, Equinix in $4 Billion Deal to Buy Nordic Data-Center Operator atNorth",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Aimee Look </p><br/><p>\n  CPP Investments and digital-infrastructure company Equinix agreed to jointly acquire Nordic data-center operator atNorth for $4 billion, including debt. </p><!-- Article --><p>\n\n  AtNorth owner Partners Group, which bought the company in 2022, said that it had committed to reinvest and buy back up to 10% of the data-center operator after the sale. </p><p>\n\n  AtNorth operates multiple sites in Denmark, Finland, Iceland, Norway, and Sweden. </p><p>\n\n  \"The investment further enhances CPP Investments' global data center strategy and builds out its presence in Europe,\" the investment arm of the Canada Pension Plan said. Equinix said the deal would bolster its existing data-center operations in the Nordics. </p><br/><p>\n  Write to Aimee Look at aimee.look@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0406ET</p></div>",
            "link": "https://hk.marketscreener.com/news/cpp-investments-equinix-in-4-billion-deal-to-buy-nordic-data-center-operator-atnorth-ce7e5cded18cf126",
            "pub_date": "2026-02-27 17:11:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RHB Bank Berhad Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>RHB Bank Berhad reported earnings results for the full year ended December 31, 2025. For the full year, the company reported net interest income was MYR 3,880.19 million compared to MYR 3,869.3 million a year ago. Net income was MYR 3,363.25 million compared to MYR 3,120.21 million a year ago.</p><p>Basic earnings per share from continuing operations was MYR 0.7713 compared to MYR 0.7202 a year ago. Diluted earnings per share from continuing operations was MYR 0.7689 compared to MYR 0.718 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/rhb-bank-berhad-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cded18cf125",
            "pub_date": "2026-02-27 17:11:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LVMH shut down in Russia when the war started. But it kept a storied hotel that serves sanctioned clients",
            "description": "<div class=\"txt-s4 article-text\"><p>PARIS, Feb 27 (Reuters) - When the war in Ukraine started in February 2022, LVMH shuttered its Louis Vuitton, Dior and Bulgari boutiques in Russia days before Europe imposed export sanctions on luxury goods. </p><p>\n              The conglomerate - controlled by French billionaire Bernard Arnault - also sold its Sephora stores at a loss, even though their mass-market products were not subject to sanctions. And LVMH donated 5 million euros to the victims of what it called the \"tragic situation\" in Ukraine.</p><!-- Article --><p>\n              One of its businesses in Russia, however, has kept operating: The Grand Hotel Europe in St. Petersburg, owned through LVMH's Belmond chain of luxury hotels and trains.</p><p>\n              The storied hotel itself isn't subject to sanctions and is operating legally. However, it has continued to receive payments for providing services to corporate clients that have been sanctioned by Europe and the UK, including major Russian transport, energy and media companies as well as banks and military contractors, Reuters has found.</p><p>\n              Signs of the hotel's ownership have been scrubbed from public view, including images from social media showing an empty space at the entrance where a placard with Belmond's logo was once affixed. The hotel was also de-listed from Belmond's booking site in 2023, according to archived versions of the Belmond booking website.</p><p>\n              Belmond's ownership of the hotel, however, continues to appear in Russian, British and French corporate records. Belmond is 100% owned by LVMH, according to its 2025 accounts. Names of the hotel's corporate clients, including the sanctioned ones, appear in value-added-tax records reviewed by Reuters.</p><p>\n              Asked about the hotel's operations and business with sanctioned clients, LVMH said the Grand Hotel Europe \"operates autonomously and independently from Belmond.\"</p><p>\n              \"It is not part of the Belmond distribution systems and the dedicated local team in Russia manages this historic property separately,\" the company said. LVMH declined to respond further to detailed questions from Reuters. Belmond issued an identical response.</p><p>\n              Executives at LVMH, the world's largest luxury conglomerate, considered closing the St. Petersburg property but ultimately decided against it, two sources with direct knowledge of the matter told Reuters. \"These are people who work for us, that we have been paying for years,\" said one of the people. \"Shall we punish them because their country is being run by a fool?\" </p><p>\n              Yulia Pashkovskaya, the hotel manager, and a hotel spokesperson declined to comment to Reuters. </p><p>\n              Situated on the Nevsky Prospekt in the heart of St. Petersburg since 1875, the Grand Hotel Europe has hosted guests including Britain's then-Prince Charles and pop stars Elton John and Whitney Houston. One of its first famous guests was Pyotr Tchaikovsky, the Russian composer.</p><p>\n              The five-star hotel features a butler service and a caviar bar famous for its \"Egg in Egg\" dish - boiled truffle-flavored eggs and three types of caviar.</p><p>\n              More recently, the hotel has hosted multiple events involving Russia's political and economic elites. Last year, it hosted a meeting between diplomatic envoys of U.S. President Donald Trump and Russian President Vladimir Putin to discuss the war in Ukraine, and celebrated its 150th anniversary with a lavish gala that included bank executives, the director of the Russian State Museum, and St. Petersburg officials.</p><p>\n              For over a decade, the hotel has been an official partner of the St. Petersburg International Economic Forum, the annual business gathering chaired by Putin.</p><p><b>REASONS TO STAY</b></p><p>\n              The hotel's enduring allure may make it worth LVMH's while to hold on to the property, Russian business experts say. \"Most likely, they are hoping to wait out the situation, thinking that one day things with Ukraine will improve,\" said Artem Zhavoronkov, a partner at the St. Petersburg law firm Nordic Star, who specialises in sanctions litigation but is not advising the hotel. \"It's a good asset, it's profitable. And it is first-class real estate that will only grow in value over time,\" added Zhavoronkov. </p><p>\n              LVMH's decision to retain the property could be part of a long-term ambition to re-enter the Russian market, said Kristian Lasslett, a professor at Ulster University in Northern Ireland who studies corporate behaviour in Russia and Central Asia.</p><p>\n              \"Business in Russia has long depended on personal connections and the favour in which one is held,\" Lasslett said.</p><p>\n              There could be other reasons why LVMH has held onto the property, according to people familiar with the situation. Among the possible reasons are Russian rules requiring foreign companies to sell their assets at a hefty discount if they leave the country, and that the city of St. Petersburg holds a 6.5% stake in the art nouveau building in which the hotel is located, according to Russian property records and Belmond filings to the U.S. Securities and Exchange Commission.</p><p>\n              The St. Petersburg mayor's office didn't respond to questions about whether Belmond needed the city's permission to sell its stake in the hotel or whether there had been any requests to do so.</p><p>\n              Most Western hotel chains - including Marriott, Four Seasons, and InterContinental owner IHG - have cut ties with Russia. Unlike Belmond, all of these groups functioned through third-party investors, allowing them to withdraw from Russia quickly. Some others including Hilton halted new investments but still operate there.</p><p>\n              The St. Petersburg hotel does not face international restrictions on its operations because services like accommodation and catering aren't specifically targeted by sanctions, according to legal experts in Paris, London and Moscow and a EU Commission source. Regis Bismuth, an international law professor at Sciences Po University in Paris, noted that the hotel is a Russian subsidiary, incorporated under Russian law, providing everyday services within Russia. </p><p><b>SANCTIONED CLIENTS</b></p><p>\n              The hotel is making money from sanctioned companies, though. VAT filings to local tax authorities from the second quarter of 2022 to the first quarter of 2025 show the hotel received payments from sanctioned entities including two units of arms maker Rostec and a subsidiary of Tactical Missiles Corp, as well as from ship building company Sovcomflot and energy giant Rosneft. Other payments came from corporations under asset freezes such as Sberbank, Sovcombank and VTB.</p><p>\n              The tax filings don't specify what services the sanctioned companies purchased from the hotel. But most of the individual payments did not exceed $2,000, in line with the hotel's offerings for rooms, dinners or meeting spaces. The hotel's room prices range from roughly $270 to $1,200, with high-end suites from $1,800 to nearly $8,000 per night, according to its booking site. Some companies made repeated payments over the years. Others only once or twice. </p><p>\n              The VAT records do not specify what goods or services were received in exchange for payments.</p><p>\n              Rostec, Tactical Missiles Corp., Sovcomflot, Rosneft, Sberbank and Sovcombank did not respond to detailed requests for comment. VTB said the information Reuters provided was incorrect but did not specify.</p><p>\n              The European Commission, which has drafted several rounds of sanctions against Russia, declined to comment about the hotel. The Commission has said that its sanctions do not apply outside the European Union, but that parent companies may not \"use their Russian subsidiaries to circumvent the obligations that apply to the EU parent.\"</p><p>\n              Among the hotel's largest clients was sanctioned lender Sovcombank, which paid $140,000 to the hotel. Another major client was Prezident-Servis, a travel agency owned directly by the Kremlin, which made payments worth at least $270,000 to the hotel.</p><p>\n              Most of the payments by both entities coincided with the St. Petersburg forum in 2023 and 2024, the records show.</p><p>\n              In response to questions about the hotel, the Kremlin said it was not in the hospitality business.</p><p>\n              Europe Hotel LLC, the firm behind the property, is listed among LVMH's hundreds of 100%-owned subsidiaries on page 401 of its latest universal registration document, a detailed mandatory annual filing with the French market watchdog AMF. Reuters could find no other public mentions of the hotel by LVMH since the start of the war. </p><p>\n              Between 2022 and 2024, the hotel's annual revenues have almost doubled, reaching 1.9 billion roubles ($25 million), slightly above its top line in the three years preceding the 2020 COVID-19 pandemic, according to Russian financial filings reviewed by Reuters.</p><p>\n              The hotel in 2024 generated a net profit of some $5.7 million in 2024, its highest since data was first published in 2004. The cash from these operations reached $13 million on the hotel's balance sheet published last year, up from less than $1 million annually from 2018 to 2021, according to the documents. The records indicated that the hotel's profits stay inside Russia.</p><p>\n              The totals are tiny compared to LVMH's annual sales of around 80 billion euros, but the hotel's storied past and its ties to Russia's elite give it value beyond the revenue it generates.</p><p>\n              \"I always say that Grand Hotel Europe is one of the true places of power in St. Petersburg,\" Pashkovskaya, the hotel's manager since 2006, told a Russian YouTuber in June 2023. </p><p>\n              The bubbly flowed at the Grand Hotel Europe's 150th anniversary gala. But Veuve Clicquot, Dom Perignon and other LVMH champagne brands were nowhere to be seen in a video released by the hotel after the party was over. The bottles came from Russian-occupied Crimea. </p><p></p><p>(Reporting by Tassilo Hummel in Paris and Anton Zverev in London. Additional reporting by Lisa Jucca in Milan and Gleb Stolyarov in Tblisi, Georgia. Edited by Peter Hirschberg and Lori Hinnant.)</p><p>\n            By Tassilo Hummel and Anton Zverev</p></div>",
            "link": "https://hk.marketscreener.com/news/lvmh-shut-down-in-russia-when-the-war-started-but-it-kept-a-storied-hotel-that-serves-sanctioned-cl-ce7e5cded18cf22d",
            "pub_date": "2026-02-27 17:11:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "KFM Kingdom declares special dividend of HK$0.04 per ordinary share",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kfm-kingdom-declares-special-dividend-of-hk-0-04-per-ordinary-share-ce7e5cded18cf221",
            "pub_date": "2026-02-27 17:11:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIMB Group posts quarterly profit attributable of 1.92 billion rgt",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cimb-group-posts-quarterly-profit-attributable-of-1-92-billion-rgt-ce7e5cded18cf425",
            "pub_date": "2026-02-27 17:11:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ayala Land sells 88 million common shares of AREIT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ayala-land-sells-88-million-common-shares-of-areit-ce7e5cded18cf522",
            "pub_date": "2026-02-27 17:11:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China suspends tariffs on Canadian canola meal, peas, lobsters and crabs for 2026",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-suspends-tariffs-on-canadian-canola-meal-peas-lobsters-and-crabs-for-2026-ce7e5cded18cf72d",
            "pub_date": "2026-02-27 17:11:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petronas official: About 2 bln rgt a year set aside for exploration in next five years",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/petronas-official-about-2-bln-rgt-a-year-set-aside-for-exploration-in-next-five-years-ce7e5cded18dfe21",
            "pub_date": "2026-02-27 17:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petronas CEO: Sees crude oil prices rangebound at $65-$70 per barrel in next five years",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/petronas-ceo-sees-crude-oil-prices-rangebound-at-65-70-per-barrel-in-next-five-years-ce7e5cded18df021",
            "pub_date": "2026-02-27 17:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Petronas CEO: Geopolitical, economic uncertainty to remain for the foreseeable future",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/petronas-ceo-geopolitical-economic-uncertainty-to-remain-for-the-foreseeable-future-ce7e5cded18df026",
            "pub_date": "2026-02-27 17:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RHB Bank posts quarterly profit attributable 905.7 million RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rhb-bank-posts-quarterly-profit-attributable-905-7-million-rgt-ce7e5cded18df326",
            "pub_date": "2026-02-27 17:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Leong Financial posts qtrly profit attributable of 899.2 mln rgt",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hong-leong-financial-posts-qtrly-profit-attributable-of-899-2-mln-rgt-ce7e5cded18df423",
            "pub_date": "2026-02-27 17:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prudential Buys Back Shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/prudential-buys-back-shares-ce7e5cded18df424",
            "pub_date": "2026-02-27 17:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tenaga Nasional says Megat Jalaluddin Bin Megat Hassan shall cease to hold office as CEO",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tenaga-nasional-says-megat-jalaluddin-bin-megat-hassan-shall-cease-to-hold-office-as-ceo-ce7e5cded18df524",
            "pub_date": "2026-02-27 17:01:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BDO Unibank group FY net profit 87,479 million pesos",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bdo-unibank-group-fy-net-profit-87-479-million-pesos-ce7e5cded18df624",
            "pub_date": "2026-02-27 17:01:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIMB Group says as at quarter end, common equity tier 1 ratio 14.3%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cimb-group-says-as-at-quarter-end-common-equity-tier-1-ratio-14-3-ce7e5cded18df725",
            "pub_date": "2026-02-27 17:01:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equinix, Canada Pension Plan Investment Board to Acquire atNorth for $4 Billion Enterprise Value",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/equinix-canada-pension-plan-investment-board-to-acquire-atnorth-for-4-billion-enterprise-value-ce7e5cded18afe23",
            "pub_date": "2026-02-27 17:01:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India new issue - Bajaj Housing Finance accepts bids on bond reissue",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-new-issue-bajaj-housing-finance-accepts-bids-on-bond-reissue-ce7e5cded18af123",
            "pub_date": "2026-02-27 17:01:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}