{
    "data": [
        {
            "title": "Visa Inc. (NYSE:V) completed the acquisition of Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P.",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Visa Inc. (NYSE:V) entered into a definitive agreement to acquire Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P. on February 19, 2026. Payway S.A.U. is not part of this transaction and will remain owned by funds managed by Advent International, continuing to operate independently as a merchant acquirer.<br/><br/>\r\n \r\nThe transaction is subject to the satisfaction of closing conditions and is expected to close in first quarter of 2026.<br/><br/>\r\n\r\nVanina Caniza, Francisco Fernández Rostello Geraldine Mirelman, Esteban Rópolo, and Matías Herrero of Baker &amp; Mckenzie Sociedad Civil acted as legal advisor for Advent International, L.P.  Todd Crider, Juan Naveira, Borja Marcos, Caroline Geiger and Lori Lesser, Russell Light, Peter Guryan, Daniel Owsley, Tristan Brown, Andrew  Kofskyof, David Caldwell, and Steven DeLott of Simpson Thacher &amp; Bartlett LLP acted as legal advisor for Advent International, L.P. Morgan Stanley acted as exclusive financial advisor for Advent International, L.P. on the sale of both Prisma Medios and Newpay.<br/><br/>\r\n\nVisa Inc. (NYSE:V) completed the acquisition of Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P. on February 27, 2026. The transaction is subject to review by the Argentine competition authority.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/visa-inc-nyse-v-completed-the-acquisition-of-prisma-medios-de-pago-s-a-and-newpay-s-a-u-from-ad-ce7e5cdfdc89f626",
            "pub_date": "2026-02-28 01:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump say he wants to make a deal with Iran",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-say-he-wants-to-make-a-deal-with-iran-ce7e5cdfdc89f624",
            "pub_date": "2026-02-28 01:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck to lay off 154 employees",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/merck-to-lay-off-154-employees-ce7e5cdfdd80ff2c",
            "pub_date": "2026-02-28 01:40:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Creative director Demna presents first Gucci show as Kering pushes turnaround",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/creative-director-demna-presents-first-gucci-show-as-kering-pushes-turnaround-ce7e5cdfdd80f02d",
            "pub_date": "2026-02-28 01:40:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo Global Management Backs Manhattan Office Tower Conversion With $420 Million Loan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apollo-global-management-backs-manhattan-office-tower-conversion-with-420-million-loan-ce7e5cdfdd80f02c",
            "pub_date": "2026-02-28 01:40:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump: Not happy with Iran but more talks expected Friday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-not-happy-with-iran-but-more-talks-expected-friday-ce7e5cdfdd80f125",
            "pub_date": "2026-02-28 01:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump: Iran cannot have nuclear weapons",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-iran-cannot-have-nuclear-weapons-ce7e5cdfdd80f224",
            "pub_date": "2026-02-28 01:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Matheson investee PT Astra reports \"resilient\" earnings",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Jardine Matheson Holdings Ltd on Friday noted the release of annual results, which included lower revenue and profit, from PT Astra International TBK.</p><p></p><p>Jardine Matheson is a Hong Kong-based holding company with interests in retail, property, hotels and motor dealerships. Its 85.5%-owned subsidiary, Jardine Cycle &amp; Carriage Ltd, holds 50.1% of PT Astra. The Indonesian firm has businesses across various sectors, including coal, gold, mining services and motor vehicles. </p><!-- Article --><p></p><p>PT Astra reported net income of IDR32.769 trillion in 2025, around GBP1.44 billion, down 3% from IDR33.901 trillion in 2024. Net revenue decreased 2% to IDR323.392 trillion from IDR328.480 trillion. </p><p></p><p>The firm also declared a final dividend of IDR292 per share for the year, down from IDR308 per share. </p><p></p><p>Net earnings per share decreased 3% to IDR810 from IDR837. NAV per share, however, rose 8% to IDR5,692 at December 31, from IDR5,278 one year prior. </p><p></p><p>\"In 2025, the group's earnings declined mainly due to lower coal prices and a weak new car market,\" commented PT Astra's President Director Djony Tjondro. \"However, the group's business performance remained resilient, supported by good contribution from its other businesses.</p><p></p><p>\"Looking ahead, while the operating environment of some of our businesses may remain challenging, we expect overall consumer sentiment to improve. Astra will remain focused on operational excellence and disciplined capital allocation, leveraging our strong balance sheet to support sustainable value creation for our stakeholders.\"</p><p></p><p>PT Astra also said it has completed a \"second tranche share buyback programme\", worth IDR685 billion in total, and that its strategic review is in progress. It expects to announce the review's findings in \"the latter part of the first half of 2026.\"</p><p></p><p>PT Astra previously completed an IDR2 trillion share buyback in January. </p><p></p><p>Jardine Matheson shares were flat at USD58.38 in London on Friday.</p><p></p><p>By Emma Curzon, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/jardine-matheson-investee-pt-astra-reports-resilient-earnings-ce7e5cdfdd80f32c",
            "pub_date": "2026-02-28 01:40:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cipla announces launch of generic Saxenda for weight management therapy",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cipla-announces-launch-of-generic-saxenda-for-weight-management-therapy-ce7e5cdfdd80f52c",
            "pub_date": "2026-02-28 01:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck to lay off around 150 employees at US site amid slump in Gardasil sales",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Merck will lay off about 150 employees across its facility in North Carolina that manufactures its human papillomavirus vaccine, Gardasil, according to a notice filed in the state's database this week.</p><p>\n              Shares of Merck were up 3% in afternoon trading.</p><!-- Article --><p>\n              Gardasil has been one of Merck's top growth drivers after blockbuster cancer immunotherapy Keytruda, and much of its international growth has come from China. But the company halted shipments of the vaccine to China last year due to weak demand, driving a 39% slump in the shot's global sales in 2025.</p><p>\n              The vaccine protects against HPV infections that can lead to cervical, vulvar, vaginal and anal cancers.</p><p>\n              The U.S. also overhauled its long-standing childhood immunization schedule last month to recommend a single HPV vaccine dose instead of the approved two- or three-shot regimen. Gardasil is the only HPV vaccine licensed in the country.</p><p>\n              Merck's management last month said Gardasil was no longer a key growth driver for the company.</p><p>\n              \"We continuously assess our operations and evolving business needs and adjust as needed to ensure the effectiveness of our manufacturing network in delivering reliable, compliant supply of our medicines and vaccines,\" a company spokesperson told Reuters on Friday.</p><p>\n              The layoffs will be effective in May, according to the notice.</p><p>\n              As of December 31, 2025, the company had about 30,000 employees in the U.S., including Puerto Rico, according to a regulatory filing.  </p><p></p><p>(Reporting by Mariam Sunny in Bengaluru; Editing by Leroy Leo)</p></div>",
            "link": "https://hk.marketscreener.com/news/merck-to-lay-off-around-150-employees-at-us-site-amid-slump-in-gardasil-sales-ce7e5cdfdd80f523",
            "pub_date": "2026-02-28 01:40:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coinbase Global aware of performance issues on lend, borrow, and dex",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coinbase-global-aware-of-performance-issues-on-lend-borrow-and-dex-ce7e5cdfdd80f624",
            "pub_date": "2026-02-28 01:31:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlanta Fed US Q1 GDP Nowcast Estimate 3% Up Vs Previous 3.1% Gain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/atlanta-fed-us-q1-gdp-nowcast-estimate-3-up-vs-previous-3-1-gain-ce7e5cdfdd81fe21",
            "pub_date": "2026-02-28 01:31:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US SEC adopts final rules for holding foreign insiders accountable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-sec-adopts-final-rules-for-holding-foreign-insiders-accountable-ce7e5cdfdd81ff2c",
            "pub_date": "2026-02-28 01:31:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JPMorgan, Barclays, Fifth Third sued by investors for missing 'giant red flags' at Tricolor",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jpmorgan-barclays-fifth-third-sued-by-investors-for-missing-giant-red-flags-at-tricolor-ce7e5cdfdd81f026",
            "pub_date": "2026-02-28 01:26:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Drop Following Hot Wholesale Inflation Print",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-drop-following-hot-wholesale-inflation-print-ce7e5cdfdd81f127",
            "pub_date": "2026-02-28 01:26:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM has \"clear impression\" Ukraine does not want oil transit to resume",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-has-clear-impression-ukraine-does-not-want-oil-transit-to-resume-ce7e5cdfdd81f221",
            "pub_date": "2026-02-28 01:26:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dubai Electricity and Water Authority Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Dubai Electricity and Water Authority (PJSC) reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was AED 32,841.82 million compared to AED 30,977.35 million a year ago. Net income was AED 8,346.89 million compared to AED 7,012.66 million a year ago.</p><p>Basic earnings per share from continuing operations was AED 0.167 compared to AED 0.14 a year ago. Diluted earnings per share from continuing operations was AED 0.167 compared to AED 0.14 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/dubai-electricity-and-water-authority-reports-earnings-results-for-the-full-year-ended-december-31-ce7e5cdfdd81f323",
            "pub_date": "2026-02-28 01:26:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIMB Reportedly Among Banks Bidding for HSBC Indonesia Assets",
            "description": "<div class=\"txt-s4 article-text\"><p>CIMB Group Holdings Berhad (KLSE:CIMB) is one of the banks that are seeking to purchase assets of HSBC Indonesia (PT Bank HSBC Indonesia). The move comes as lenders seek to strengthen their presence in Southeast Asia's biggest economy. Potential bidders include Singapore's DBS Group Holdings Ltd. (SGX:D05), Oversea-Chinese Banking Corporation Limited (SGX:O39) and United Overseas Bank Limited (SGX:U11), along with Malaysia's CIMB Group Holdings Bhd and Sumitomo Mitsui Financial Group, Inc. (TSE:8316).</p><p>HSBC Holdings plc (LSE:HSBA) is looking to sell its consumer banking operations in Indonesia. The assets could be valued at more than USD 200 million.</p></div>",
            "link": "https://hk.marketscreener.com/news/cimb-reportedly-among-banks-bidding-for-hsbc-indonesia-assets-ce7e5cdfdd81f322",
            "pub_date": "2026-02-28 01:26:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Glass Holdings Limited Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Xinyi Glass Holdings Limited reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 20,829.01 million compared to CNY 22,323.57 million a year ago. Net income was CNY 2,729 million compared to CNY 3,369.17 million a year ago.</p><p>Basic earnings per share from continuing operations was CNY 0.6231 compared to CNY 0.7923 a year ago. Diluted earnings per share from continuing operations was CNY 0.6231 compared to CNY 0.7923 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-glass-holdings-limited-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdd81f422",
            "pub_date": "2026-02-28 01:21:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTSE 100 hits high; oil jumps on US-Iran tension",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - The FTSE 100 outperformed European and US peers on Friday, ending a record-breaking week at another new high.</p><p></p><p>\"Two months in, it looks like 2026 could be a second bumper year in a row for investors putting their faith in UK stocks if current performance trends continue,\" said Russ Mould, investment director at AJ Bell.</p><!-- Article --><p></p><p>The FTSE 100 index ended up 63.85 points, 0.6%, at 10,910.55, a record close. It had earlier hit a record intra-day high of 10,934.94, and is up 9.6% year-to-date.</p><p></p><p>The FTSE 250 ended up 38.15 points, 0.2%, at 23,757.15, and the AIM All-Share closed up 4.30 points, 0.5%, at 819.53.</p><p></p><p>For the week, the FTSE 100 rose 1.1%, the FTSE 250 was slightly higher, and the AIM All-Share climbed 0.9%.</p><p></p><p>The Cboe UK 100 was up 0.5% at 1,086.35, the Cboe UK 250 was 0.2% higher at 20,980.03, and the Cboe Small Companies Index advanced slightly to 18,507.60.</p><p></p><p>London's gains came despite renewed losses on Wall Street as investors weighed stronger-than-forecast wholesale inflation data, and assessed rising tension between the US and Iran.</p><p></p><p>The Dow Jones Industrial Average was down 1.0%, the S&amp;P 500 index was 0.6% lower, and the Nasdaq Composite declined 0.9%. </p><p></p><p>According to the US Bureau of Labor Statistics the producer price index rose 0.5% in January on-month, the same pace of growth as reported December.</p><p></p><p>The annual rate of growth cooled to 2.9% from 3.0%.</p><p></p><p>FXStreet consensus had forecast headline growth of 0.3% on-month and annual growth of 2.6%.</p><p></p><p>Excluding food and energy, PPI rose 0.8% on-month in January, surprisingly picking up pace from 0.7% in December. The annual rate of growth sped up to 3.8% from 3.3%.</p><p></p><p>FXStreet consensus forecast core PPI would rise 0.3% on-month giving an annual increase of 3.0%.</p><p></p><p>After folding in January CPI and PPI figures, Barclays estimates that core PCE inflation - the Federal Reserve's favoured inflation gauge - rose 0.4% on-month and 3.1% on-year in January.</p><p></p><p>Oil prices jumped as Iran said that in order to reach a deal, the US will have to drop its \"excessive demands\", tempering the optimism expressed after recent talks which had been seen as a last-ditch bid to avert war.</p><p></p><p>The Oman-mediated talks followed repeated threats from President Donald Trump to strike Iran, and with the US conducting its biggest military build-up in the region in decades.</p><p></p><p>Trump on February 19 gave Iran 15 days to reach a deal, and while Iran has insisted the discussions focus solely on its nuclear programme, the US wants Tehran's missile programme, its ballistic missile capabilities, and its support for militant groups curtailed.</p><p></p><p>The Wall Street Journal reported on Thursday that Trump's negotiating team would demand that Iran dismantle its three main nuclear sites and hand over all its remaining enriched uranium to the US.</p><p></p><p>On Friday, the US authorised the departure of non-emergency embassy staff from Israel, while growing fears of conflict spurred China to join other countries in warning its citizens to leave Iran \"as soon as possible\". The UK too withdrew its embassy staff from Iran.</p><p></p><p>Brent oil traded higher at USD72.71 a barrel on Friday afternoon, up from USD72.58 at same time on Thursday, and sharply higher from USD70.00 at the time of the equity close in New York. </p><p></p><p>The oil price strength supported BP, up  0.7%, and Shell, up 1.6%.</p><p></p><p>The geopolitical uncertainty gave a lift to the gold price, supporting Fresnillo, up 3.4%, and Endeavour Mining, up 2.3%. </p><p></p><p>But the US-Iran worries and the rising oil price put airlines under pressure. British Airways owner IAG was down 7.4%,despite strong annual results, and budget airline easyJet was down 2.6%.</p><p></p><p>Gold firmed to USD5,235.52 an ounce on Friday from USD5,180.61 on Thursday. </p><p></p><p>In European equities on Friday, the CAC 40 in Paris closed down 0.5%, while the DAX 40 in Frankfurt ended slightly lower.</p><p></p><p>The pound was lower at USD1.3458 on Friday afternoon, from USD1.3513 at the equities close on Thursday. </p><p></p><p>The euro stood higher at USD1.1818, from USD1.1792. Against the yen, the dollar was trading lower at JPY156.05, compared to JPY156.20.</p><p></p><p>The yield on the US 10-year Treasury narrowed to 3.98% on Friday from 4.03% on Thursday. The yield on the US 30-year Treasury trimmed to 4.64% from 4.68%.</p><p></p><p>London Stock Exchange Group rose 4.2%, and led blue-chip risers, on further reflection of Thursday's results. </p><p></p><p>Bank of America played fears of AI disruption to LSEG's business. </p><p></p><p>\"The market fails to differentiate between software and data providers like LSEG, where it is partnering with AI agents,\" BofA said.</p><p></p><p>Rightmove advanced 4.3% as it announced a total dividend for 2025 that was higher than expected, alongside a share buyback programme as it highlighted it entered 2026 \"with confidence.\"</p><p></p><p>The Milton Keynes, England-based online property portal said pretax profit climbed 12% to GBP290.0 million in 2025 from GBP258.4 million in 2024.</p><p></p><p>\"The shares have been weighed down by broader AI concerns, but we see no evidence of any impact. We expect another solid year of growth, supported by further product development that should strengthen its market position,\" analysts at Peel Hunt said.</p><p></p><p>But Melrose plummeted 12% after its annual earnings. </p><p></p><p>Citi analyst Charles Armitage said the share price fall was an \"over-reaction and mainly due to the increase in factoring from GBP338 million to GBP396 million.\"</p><p></p><p>Melrose bears argued that as a result of the rise in factoring, the aerospace firm \"actually\" produced GBP67 million of free cash flow last year, rather than the GBP125 million reported, and hence missed the GBP100 million plus guidance.</p><p></p><p>But Armitage explained that factoring \"was in the GBP100 million [plus] guidance - this is not a miss.\"</p><p></p><p>On the FTSE 250, Senior leapt 20% after it confirmed receipt of two cash bids, higher than offers the firm had previously turned down this year. </p><p></p><p>Boston, Massachusetts-based private equity investor Advent International subsequently confirmed it was one of the interested parties. </p><p></p><p>But it was another tough day for investors in Hays, which fell 9.6%. </p><p></p><p>The recruiter, which has seen its share price plummet 43% in the last 12 months, reported a decline in first-half earnings and said it has kicked off a search for a new boss, after Dirk Hahn's immediate resignation as chief executive officer. </p><p></p><p>Finally, Wizz Air nosedived 8.7%, after Indigo Partners LLC reported the sale of a GBP125 million chunk of the low-cost carrier.</p><p></p><p>The biggest risers on the FTSE 100 were Diageo, up 76.50p at 1,662.50p, Rightmove, up 18.60p at 447.40p, BT, up 8.90p at 216.80p, London Stock Exchange Group, up 360.00p at 8,860.00p, and Fresnillo, up 136.00p at 4,240.00p.</p><p></p><p>The biggest fallers on the FTSE 100 were Melrose Industries, down 74.20p at 565.80p, IAG, down 33.60p at 423.70p, Hikma Pharmaceuticals, down 59.00p at 1,314.00p, Barclays, down 19.80p at 452.85p, and Intercontinental Hotels Group, down 4.25p at 137.50p. </p><p></p><p>Monday's global economic calendar has a slew of manufacturing PMI reports plus UK mortgage approvals data.</p><p></p><p>Monday's UK corporate calendar has full-year results from lender Bank of Ireland, distribution and services company Bunzl and medical technology firm Smith &amp; Nephew.</p><p></p><p>By Jeremy Cutler, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/ftse-100-hits-high-oil-jumps-on-us-iran-tension-ce7e5cdfdd81f625",
            "pub_date": "2026-02-28 01:21:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies Surprises With Strong 2027 Guide Despite Commodity Headwinds, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-surprises-with-strong-2027-guide-despite-commodity-headwinds-bofa-says-ce7e5cdfdd81f624",
            "pub_date": "2026-02-28 01:21:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "NatWest Group Prices $750 Million Notes Offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/natwest-group-prices-750-million-notes-offering-ce7e5cdfdd8eff20",
            "pub_date": "2026-02-28 01:21:16",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "St. Louis Fed US Q1 GDP Nowcast Estimate 2.4% Higher vs Previous 3.0% Gain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/st-louis-fed-us-q1-gdp-nowcast-estimate-2-4-higher-vs-previous-3-0-gain-ce7e5cdfdd8ef124",
            "pub_date": "2026-02-28 01:21:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CK Hutchison's subsidiary decries Panama's \"invasion\" of property",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ck-hutchison-s-subsidiary-decries-panama-s-invasion-of-property-ce7e5cdfdd8ef523",
            "pub_date": "2026-02-28 01:16:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada's Economy Contracts in Fourth Quarter, Capping a Soft Year -- 2nd Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  OTTAWA--Canada's economy shrank as it closed out 2025, yet still managed to show resilience against the U.S. administration's protectionist shift. </p><!-- Article --><p>\n\n  Gross domestic product declined at an annualized rate of 0.6% in the October-to-December period to 2.502 trillion Canadian dollars, the equivalent of US$1.829 trillion, Statistics Canada said Friday. </p><p>\n\n  The contraction was slightly steeper than the 0.2% economists expected following a recovery in the prior quarter. But the weakness was largely thanks to a big withdrawal from business inventories that offset growth in exports, and increases in both household and government spending. </p><p>\n\n  Industry-level activity strengthened in the final month of the year, though advance data indicates a shaky start to this year and no growth as activity was likely held back by snowstorms and severe cold temperatures. </p><p>\n\n  Canada was broadsided last year by President Trump's tariffs, particularly the country's trade exposed industries and sectors singled out by the White House's sectoral levies on steel, aluminum, lumber and other goods that enter the U.S. in large volumes. </p><p>\n\n  Over 2025, Canadian real GDP grew 1.7%, the slowest pace since a drop in 2020 during the global pandemic, largely due to a decline in exports to the U.S. </p><p>\n\n  Yet data for the final quarter of last year highlights continued strength at home and a recovery in exports, helped by efforts to direct shipments to markets beyond the U.S. </p><p>\n\n  Final domestic demand, a gauge of spending by all sectors of the economy, grew 2.4% on an annualized basis in the fourth quarter after falling 0.5% the previous quarter. Household spending rose 0.4% on a nonannualized basis after weakening slightly in the prior quarter, leaving household consumption for the year up 2.3% and in line with the 2.2% pace in each of the previous two years. </p><p>\n\n  Added to that was a second consecutive quarter of increased government spending and a massive increase in defense spending. Investment by Canadian businesses dipped slightly for the quarter, though there was a sharp increase in spending on machinery and equipment, primarily computers. Overall, capital investment was up in 2025 with the jump in spending on weapons systems and a slight increase in residential construction. </p><p>\n\n  The relatively positive composition of GDP data for the quarter is expected to allow the Bank of Canada to remain on the sidelines after keeping its policy interest rate steady twice in a row, economists said. That is despite the central bank projecting a flat fourth quarter, and the possibility the first quarter of 2026 will undershoot the 1.8% growth it most recently forecast. </p><p>\n\n  Dominique Lapointe, director of macroeconomic strategy at Manulife Investment Management, said that while the fourth quarter surprised to the downside there was a revision to the contraction seen in the second quarter to just 0.9% annualized from a prior estimate of 1.8%. \"From the Bank of Canada's perspective, this leaves the output gap largely unchanged, albeit negative, and doesn't open the door to additional rate cuts,\" he said. </p><p>\n\n  The biggest drag on GDP came from the drawdown in inventories, </p><p>\n\n  an often volatile metric, after businesses boosted stocks the previous two quarters. For the year, non-farm inventories fell for the first year since 2020, even as farm stocks rose for the first time in three years with strong crop production. </p><p>\n\n  The country's exports, meanwhile, were up 1.5% for the final quarter, driven by shipments of unwrought gold and of aluminum. Yet despite the recovery in the second half of 2025, exports for 2025 were down 1.7% as trade with the U.S. failed to fully recover. Imports nudged up 0.3% in the final quarter, but were down 0.4% for the year after a steep decline in the third quarter. </p><p>\n\n  Prime Minister Mark Carney, elected last April as a counter to President Trump, has pledged to strengthen the resilience of Canada's economy and decouple it from a dependence on its biggest trading partner. The push includes efforts by the former central banker to bring financial relief to sectors hit hardest by tariffs while pushing for a doubling of non-U.S. exports over the next decade. There are indications these efforts are bearing fruit: the U.S. has gone from being the destination for roughly 70% of Canadian exports to about 64% at the latest count. </p><p>\n\n  Economists expect soft momentum in 2026 and the central bank has forecast growth will average about 1.1% for the year. A new federal groceries and essentials benefit is expected to offer a boost at mid-year with other fiscal measures, and the recovery in exports should support stronger growth in the second half, though that hinges on trade talks between with the U.S., said Michael Davenport, senior Canada economist at Oxford Economics. </p><p>\n\n  The national data agency said industry-level GDP in December was up 0.2% from the month before, the strongest growth since September as manufacturing increased after contracting two months running. Still, the advance estimate indicates GDP was essentially unchanged in January, as increases in mining, oil and gas extraction, and finance and insurance, were offset by renewed weakness in manufacturing and real estate weakness. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1211ET</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-s-economy-contracts-in-fourth-quarter-capping-a-soft-year-2nd-update-ce7e5cdfdd8ef525",
            "pub_date": "2026-02-28 01:16:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Corning Gets Strong Read Through From Nvidia Results, UBS Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/corning-gets-strong-read-through-from-nvidia-results-ubs-says-ce7e5cdfdd8ef622",
            "pub_date": "2026-02-28 01:16:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Positive Economic Growth Buoys Swiss Market Index",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/positive-economic-growth-buoys-swiss-market-index-ce7e5cdfdd8ef624",
            "pub_date": "2026-02-28 01:16:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 Ends Week in Green; Barclays Shares Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-s-ftse-100-ends-week-in-green-barclays-shares-down-ce7e5cdfdd8ef723",
            "pub_date": "2026-02-28 01:16:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Owl turmoil adds to strain in $2 trillion US private credit sector",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/blue-owl-turmoil-adds-to-strain-in-2-trillion-us-private-credit-sector-ce7e5cdfdd8ffe22",
            "pub_date": "2026-02-28 01:16:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlas SP says it proactively put two warehouses into default last week \"and is pursuing all legal avenues to maximize recoveries\" following a breach of contractual terms by Market Financial Solutions",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/atlas-sp-says-it-proactively-put-two-warehouses-into-default-last-week-and-is-pursuing-all-legal-av-ce7e5cdfdd8ffe27",
            "pub_date": "2026-02-28 01:10:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Week in Oil : U.S.-Iran Tensions Keep Risk Premium High",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Giulia Petroni </p><br/><p>\n  Here's a look at what happened in oil markets in the week of Feb. 23-27 and what the focus will be in the days to come. </p><!-- Article --><br/><p>\n  OVERVIEW: Oil prices jumped on Friday, driven by concerns over potential U.S. action against Iran after talks in Geneva ended without a breakthrough. Crude benchmarks are at their highest level in about seven months, with Brent crude above $72 a barrel and West Texas Intermediate at $66 a barrel. </p><br/><p>\n  MACRO: Markets are still betting that the Federal Reserve will lower interest rates further this year, though the pace of potential cuts remains uncertain. </p><p>\n\n  The latest U.S. producer price index data showed that wholesale inflation unexpectedly accelerated in January. The PPI is closely watched because several of its components feed into the calculation of the personal consumption expenditures price index, the Fed's preferred inflation gauge. </p><p>\n\n  At the same time, uncertainty surrounding U.S. tariff policy and the future of existing trade agreements following a recent Supreme Court ruling continues to weigh on market sentiment. </p><br/><p>\n  GEOPOLITICAL RISKS: The U.S. and Iran are set to resume discussions next week after the latest round of talks concluded on Thursday without reaching an agreement. Further negotiations \"at a technical level\" will take place in Vienna, Oman's Foreign Minister Badr bin Hamad al-Busaidi said in a post on X. </p><p>\n\n  Markets remain cautious, however, as any escalation in tensions could threaten energy flows, particularly after Washington increased its military presence in the Middle East. The impact of potential U.S. military action on oil prices would largely depend on whether it disrupts global supply and shipping traffic through the Strait of Hormuz. </p><br/><p>\n  SUPPLY AND DEMAND: The broader outlook remains bearish, as global oil supply is still expected to exceed demand this year. Under normal circumstances, such a surplus would put significant downward pressure on prices. Instead, crude futures have held up, supported by persistent geopolitical tensions that continue to sustain a sizeable risk premium in the market. </p><p>\n\n  At the same time, U.S. crude inventories surged by 16 million barrels last week to 435.8 million barrels--far above expectations and marking the largest weekly increase since February 2023, the EIA said. </p><br/><p>\n  NEXT WEEK: Heightened uncertainty over developments in the Middle East is expected to keep a significant risk premium embedded in oil prices, as markets weigh the possibility of supply disruption. </p><p>\n\n  \"President Trump's deadline for an agreement expires in a week at the latest,\" analysts at Commerzbank said. \"The continuing risk of a U.S. military strike is therefore likely to remain the dominant issue on the oil market, which suggests that oil prices will remain well supported.\" </p><p>\n\n  Traders are also focused on the upcoming OPEC+ meeting on Sunday for guidance on future production policy, with the group now widely expected to resume output increases, beginning with a modest 137,000 barrel-a-day rise. </p><p>\n\n  On the economic front, investors will be watching some remarks from Federal Reserve speakers, manufacturing PMI, ADP employment figures and weekly jobless claims for fresh clues on the strength of the economy and interest-rate outlook. </p><br/><p>\n  Write to Giulia Petroni at giulia.petroni@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1207ET</p></div>",
            "link": "https://hk.marketscreener.com/news/the-week-in-oil-u-s-iran-tensions-keep-risk-premium-high-ce7e5cdfdd8ff127",
            "pub_date": "2026-02-28 01:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India and EU to give each other Most Favoured Nation status for 5 years, draft trade deal shows",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-and-eu-to-give-each-other-most-favoured-nation-status-for-5-years-draft-trade-deal-shows-ce7e5cdfdd8ff322",
            "pub_date": "2026-02-28 01:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re AG announces an Equity Buyback for 1,500,000 shares, for $500 million.",
            "description": "<div class=\"txt-s4 article-text\"><p>Swiss Re AG (SWX:SREN) announces a share repurchase program. Under the program, the company will repurchase up to 1,500,000 shares for $500 million. The program is subject to legal and regulatory approvals.</p><p>The program will be valid till December 31, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-ag-announces-an-equity-buyback-for-1-500-000-shares-for-500-million-ce7e5cdfdd8ff520",
            "pub_date": "2026-02-28 01:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico after call with Ukraine's Zelenskiy: Ukrainian president has refused inspection activity of pipeline",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-after-call-with-ukraine-s-zelenskiy-ukrainian-president-has-refused-inspection-activ-ce7e5cdfdd8ff527",
            "pub_date": "2026-02-28 01:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re AG authorizes a Buyback Plan.",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of Swiss Re AG has authorized a buyback plan on February 27, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-ag-authorizes-a-buyback-plan-ce7e5cdfdd8ff525",
            "pub_date": "2026-02-28 01:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico: I Have Feeling Ukrainian Side Not Interested In Resuming Oil Transit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-i-have-feeling-ukrainian-side-not-interested-in-resuming-oil-transit-ce7e5cdfdd8ff62c",
            "pub_date": "2026-02-28 01:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSI Solar Co., Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>CSI Solar Co., Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 40,255.71 million compared to CNY 46,165.01 million a year ago. Net income was CNY 1,021.26 million compared to CNY 2,247.35 million a year ago.</p><p>Basic earnings per share from continuing operations was CNY 0.28 compared to CNY 0.61 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/csi-solar-co-ltd-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdd8ff621",
            "pub_date": "2026-02-28 01:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Diary - U.S. earnings week ahead",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diary-u-s-earnings-week-ahead-ce7e5cdfdd8cf322",
            "pub_date": "2026-02-28 01:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TREASURIES-Safe-haven demand drives bond rally; 10-year yield slides below 4%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/treasuries-safe-haven-demand-drives-bond-rally-10-year-yield-slides-below-4-ce7e5cdfdd8cf324",
            "pub_date": "2026-02-28 01:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE Midday : Canola declines, crude oil surges",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  WINNIPEG, Manitoba -- Canola futures on the Intercontinental Exchange were negative in the middle of Friday trading with the Chicago soy complex pulling back. </p><p>\n\n  Although Chicago soyoil was down slightly, an analyst said any time its value is between 60 to 65 U.S. cents per pound is \"a bonus.\" European rapeseed was mixed and Malaysian palm oil was higher. Crude oil rose by more than US$1 per barrel amid tensions between the U.S. and Iran, as the two countries ended their nuclear talks ahead of the weekend without a deal. </p><!-- Article --><p>\n\n  China announced on Friday it will suspend tariffs on some Canadian goods, including those for Canadian canola meal, beginning March 1. China's duty on Canadian canola will be reduced to 15 per cent as well that day. </p><p>\n\n  The Canadian Grain Commission reported 243,600 tonnes were exported during the week ended Feb. 22, down from the 257,100 shipped the previous week. So far this marketing year, canola exports totalled 4.269 million tonnes, compared to 6.021 million one year ago. </p><p>\n\n  About 33,700 canola contracts have traded at 10:11 CST. Prices in Canadian dollars per metric tonne: </p><pre style=\"font-size:14px\">\n\n \nPrice Change \n \nMay 688.80 dn 4.20 \n \nJul 699.40 dn 4.20 \n \nNov 694.00 dn 3.90 \n \nJan 701.50 dn 3.60 \n </pre><p>\n\n  Source: MarketsFarm (Adam Peleshaty, news@marketsfarm.com, 204-414-9084) </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1200ET</p></div>",
            "link": "https://hk.marketscreener.com/news/ice-midday-canola-declines-crude-oil-surges-ce7e5cdfdd8cf42d",
            "pub_date": "2026-02-28 01:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}