{
    "data": [
        {
            "title": "Diary - Europe's STOXX 600 Corporate Earnings Week Ahead",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diary-europe-s-stoxx-600-corporate-earnings-week-ahead-ce7e5cdfd989f026",
            "pub_date": "2026-02-27 19:20:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Matheson Holdings Limited Proposes Final Dividend for the Year 2025, Payable on 14 May 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Jardine Matheson Holdings Limited is recommending a final one-tier tax-exempt dividend of USD 0.85 per share (2024: USD 0.84 per share) which, together with the interim dividend of USD 0.28 per share (2024: USD 0.28 per share), will provide a total dividend for the year of USD 0.113 per share (2024: USD 0.112 per share), 1% higher than 2024.</p></div>",
            "link": "https://hk.marketscreener.com/news/jardine-matheson-holdings-limited-proposes-final-dividend-for-the-year-2025-payable-on-14-may-2025-ce7e5cdfd989f025",
            "pub_date": "2026-02-27 19:20:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan Energy Minister Says Shell to Continue Development Activities",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-energy-minister-says-shell-to-continue-development-activities-ce7e5cdfd989f127",
            "pub_date": "2026-02-27 19:20:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arts Optical Forecasts Boost in 2025 Profit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arts-optical-forecasts-boost-in-2025-profit-ce7e5cdfd989f125",
            "pub_date": "2026-02-27 19:20:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to drop synthetic colors from cereals, Axios reports",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Target will require every cereal it sells to be made without certified synthetic colors by the end of May, Axios reported on Friday.</p><p>\n              Packaged food makers such as PepsiCo, Campbell's and Conagra Brands have all announced last year that they would cut artificial dyes, in response to the Trump administration's \"Make America Healthy Again\" initiative.</p><!-- Article --><p>\n              Retail giant Walmart also said in October last year it would remove synthetic dyes from its U.S. private-label foods.</p><p>\n              Target did not immediately respond to a Reuters request for comment.</p><p></p><p> (Reporting by Neil J Kanatt in Bengaluru; Editing by Shilpi Majumdar)</p></div>",
            "link": "https://hk.marketscreener.com/news/target-to-drop-synthetic-colors-from-cereals-axios-reports-ce7e5cdfd989f525",
            "pub_date": "2026-02-27 19:21:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Issues Weak Earnings Outlook Despite Fiscal Second-Quarter Beat",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/intuit-issues-weak-earnings-outlook-despite-fiscal-second-quarter-beat-ce7e5cdfd989f62d",
            "pub_date": "2026-02-27 19:21:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's Economy Continues to Post Solid Growth",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kimberley Kao </p><br/><p>\n  India's economy expanded in the October-December quarter, maintaining strong growth. </p><!-- Article --><p>\n\n  Official data released Friday showed the economy expanded 7.8% from a year earlier under the new data series that uses the fiscal year from April 2022 to March 2023 as the base year. </p><p>\n\n  Economists surveyed by The Wall Street Journal had expected growth of 7.45% for the quarter, based on estimates compiled before the data revisions. </p><p>\n\n  The data comes as India's economic outlook has improved following a long-awaited trade agreement with the U.S. </p><p>\n\n  Earlier this month, the Reserve Bank of India left policy rates unchanged, saying the framework agreement would support growth and remove a major source of uncertainty for markets and the broader economy. </p><p>\n\n  A U.S. Supreme Court ruling on President Trump's tariffs has created fresh doubt about how U.S. trade policy will play out. Analysts think the developments could be positive for economies like India that faced higher levies compared to their peers. </p><p>\n\n  Deepali Bhargava, ING's regional head of research for Asia-Pacific highlighted India and China as potential beneficiaries from the ruling, as it likely means that they will face lower tariffs than before. </p><p>\n\n  \"Trump had already lowered the punitive 50% tariff on India to 18%, and the elimination of [International Emergency Economic Powers Act] surcharges takes this relief a step further,\" she wrote in a note. It could also give India a bit more leverage when finalizing the trade deal with the U.S. </p><p>\n\n  That said, uncertainty still looms large for global trade. </p><p>\n\n  \"We expect U.S. trade policy...to become increasingly complex and more targeted resulting in a patchwork of tariff measures and trade agreements,\" BNP Paribas Equity Research said, as the Trump administration seeks to use other measures to retain higher tariffs. </p><p>\n\n  Even if tariffs are reset, India's continued growth last year suggests that it can weather the storm. The country has also been striking trade deals with other partners, including the EU, giving it access to more markets on better terms. </p><br/><p>\n  Write to Kimberley Kao at kimberley.kao@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0615ET</p></div>",
            "link": "https://hk.marketscreener.com/news/india-s-economy-continues-to-post-solid-growth-ce7e5cdfd989f623",
            "pub_date": "2026-02-27 19:21:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "S&P Rates Indian Overseas Bank BBB on High Likelihood of Extraordinary Government Support",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/s-p-rates-indian-overseas-bank-bbb-on-high-likelihood-of-extraordinary-government-support-ce7e5cdfd989f622",
            "pub_date": "2026-02-27 19:21:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sanofi: Acoziborole Winthrop receives CHMP positive opinion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sanofi-acoziborole-winthrop-receives-chmp-positive-opinion-ce7e5cdfd989f625",
            "pub_date": "2026-02-27 19:21:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nestle has begun issuing retrenchment notices to more than 400 employees in South Africa as part of a global overhaul - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nestle-has-begun-issuing-retrenchment-notices-to-more-than-400-employees-in-south-africa-as-part-of-ce7e5cdfd989f727",
            "pub_date": "2026-02-27 19:21:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INSTANT VIEW-India's third-quarter GDP growth estimated at 7.8% following data revamp",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/instant-view-india-s-third-quarter-gdp-growth-estimated-at-7-8-following-data-revamp-ce7e5cded080fe20",
            "pub_date": "2026-02-27 19:21:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TSX futures fall as gold retreats; Wall Street futures slip",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Futures for Canada's main stock index slipped on Friday as gold prices retreated, while futures for Wall Street indexes also traded lower.</p><p>\n              March futures on the S&amp;P/TSX composite index fell 0.15%, as of 5:45 a.m. ET.</p><!-- Article --><p>\n              Spot gold declined 0.2%, but was on track for a seventh straight month of gains as uncertainty over U.S. tariff policies and tensions between the U.S. and Iran boosted safe-haven demand. Silver gained 1.3%, and copper prices also firmed. </p><p>\n              Futures for U.S. stock indexes also fell, with S&amp;P 500 E-minis and Nasdaq 100 E-minis down 0.3% and 0.22%, respectively. </p><p>\n              Toronto's benchmark index on Thursday closed at a record high for a third straight session, as stronger-than-expected earnings for banks boosted financials, while miners also gained on firm gold prices. The index is on track to log its longest monthly winning streak since April 2017. </p><p>\n              Oil prices rose on Friday and were heading for monthly gains as supply uncertainty lingered even as the United States and Iran extended their nuclear talks. Brent crude futures and U.S. West Texas Intermediate crude were up 1.5% each.</p><p>\n              Meanwhile, China said that it would suspend some tariffs on Canadian agricultural products.</p><p>\n              Canada's Prime Minister Mark Carney reached Mumbai on his first official visit to India as he seeks new global alliances. </p><p>\n              In corporate news, Bombardier CEO Eric Martel said on Thursday that India's efforts to improve its aviation infrastructure will give the aircraft manufacturer a long-term chance to boost sales of business jets.</p><p>\n              Investment firm Fairfax is the frontrunner to buy a majority stake in Indian lender IDBI Bank, Bloomberg News reported on Friday.</p><p><b>FOR CANADIAN MARKETS NEWS, CLICK ON CODES:</b></p><p>\n              TSX market report [.TO]</p><p>\n              Canadian dollar and bonds report [CAD/] [CA/]</p><p>\n              Reuters global stocks poll for Canada</p><p>\n              Canadian markets directory</p><p></p><p> (Reporting by Utkarsh Tushar Hathi; Editing by Shailesh Kuber)</p></div>",
            "link": "https://hk.marketscreener.com/news/tsx-futures-fall-as-gold-retreats-wall-street-futures-slip-ce7e5cded080f423",
            "pub_date": "2026-02-27 19:11:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Germany expects US tariffs on EU imports to stay within 2025 deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/germany-expects-us-tariffs-on-eu-imports-to-stay-within-2025-deal-ce7e5cded080f62c",
            "pub_date": "2026-02-27 19:11:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold's rise cheers Turks, takes shine off anti-inflation efforts",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-s-rise-cheers-turks-takes-shine-off-anti-inflation-efforts-ce7e5cded080f625",
            "pub_date": "2026-02-27 19:11:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US DOE granted permit for $2.5 billion power project to send electricity to Puerto Rico from Dominican Republic - developer",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-doe-granted-permit-for-2-5-billion-power-project-to-send-electricity-to-puerto-rico-from-dominic-ce7e5cded081fe23",
            "pub_date": "2026-02-27 19:11:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BDO Unibank, Inc. Announces Executive Changes, Effective March 1, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>BDO Unibank, Inc. approved the promotion of Mr. Rufus Pinto from Senior Vice President to Executive Vice President, effective March 1, 2026. Mr. Pinto will continue to serve as Group Head of the Enterprise Services Group, a role he has held since his appointment on March 1, 2025. Mr. Pinto brings 18 years of experience in the banking and financial services industry across multiple geographies.</p><p>His previous roles include Country Head for ANZ India and ANZ Philippines, Chief Executive Officer of ANZ Laos, and Board Director of several ANZ entities, including operations and technology organizations in the Asia-Pacific region. His experience spans organizational transformation, revenue growth, stakeholder engagement, staff engagement, cost management, and leadership across retail, commercial, corporate, government, and foreign exchange businesses. He is a Certified Practicing Accountant (CPA) from CPA Australia and holds a Postgraduate Certificate in Applied Finance from Macquarie University, a Master of Business Administration from Victoria University, and a Bachelor of Commerce in Management and Accounting from Mumbai University.</p><!-- Article --><p>BDO Unibank, Inc. noted the retirement of Mr. Reynaldo Arguelles Tanjangco, Jr., Senior Vice President and Unit Head of Institutional Banking Group/Corbank, FI &amp; IDesks/Corporate Banking I/Corporate Banking IB, effective March 1, 2026. The meeting date was February 27, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/bdo-unibank-inc-announces-executive-changes-effective-march-1-2026-ce7e5cded081ff22",
            "pub_date": "2026-02-27 19:11:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BDO Unibank, Inc. Declares Cash Dividend for First Quarter of 2026, Payable on March 27, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of BDO Unibank, Inc. at its regular meeting held February 27, 2026, approved the declaration of regular cash dividends on common shares of the Bank in the amount of PHP 1.10 per common share for the first quarter of 2026, payable on March 27, 2026 to all stockholders of record as of March 13, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/bdo-unibank-inc-declares-cash-dividend-for-first-quarter-of-2026-payable-on-march-27-2026-ce7e5cded081ff26",
            "pub_date": "2026-02-27 19:11:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Capgemini and Deutsche Telekom Engineering an Open Platform for Intelligent RAN Automation",
            "description": "<div class=\"txt-s4 article-text\"><p>Capgemini announced a new agreement with Deutsche Telekom to engineer a unified, open platform for intelligent Radio Access Network (RAN) automation. The solution is designed to simplify and automate operations, improve network performance, and accelerate the transition toward autonomous networks. The platform provides a level of control to the telecom operator through operator-defined policies and application to enable fully automated RAN deployment and operations.</p><p>As RANs evolve, telecom operators are managing increasingly complex RAN environments. These typically span multiple vendors, technologies, and generations. For operators, this complexity constrains agility and increases operational expenditure.</p><!-- Article --><p>One approach to solve this is Open RAN (O-RAN), a concept seeking to create open, intelligent and interoperable RANs. Capgemini and Deutsche Telekom have developed a platform for Service Management and Orchestration (SMO) that operates consistently across O-RAN but also legacy RAN environments, including 5G and 4G for Deutsche Telekom's European segments. This enables operators to modernize incrementally, protect prior investments, and adopt automation at scale without disrupting live networks.</p><p>With multi-vendor RAN management, the platform also reduces operators' dependency on proprietary vendor solutions. A key differentiator of the platform is its open architecture: It supports a full ecosystem of rApps - applications that can automate RAN functions using AI or digital twins. These capabilities are built on Radio Intelligent Controllers (RIC) that can be deployed on hyperscaler platforms or private telco clouds.</p><p>This paves the way for an \"application marketplace\" that can host and certify third-party applications, providing operators with flexibility and architectural choice. By enabling operators to define their own policies, automate operational workflows, and accelerate service innovation such as network optimization, intelligent coverage and network slicing, the solution delivers tangible business outcomes: improved network efficiency, faster service rollout, and reduced operational complexity without vendor lock-in. Capgemini and Deutsche telekom will showcase the solution at Mobile World Congress in Barcelona, demonstrating a unified RAN operations dashboard, real-time topology visualization, multi-vendor rApp deployment, AI-driven optimization, rApp conflict management, and rapid rApp development using modular templates.</p><p>The demonstration highlights how ecosystem collaboration and open platforms can translate advanced RAN intelligence into operational reality.</p></div>",
            "link": "https://hk.marketscreener.com/news/capgemini-and-deutsche-telekom-engineering-an-open-platform-for-intelligent-ran-automation-ce7e5cded081f02d",
            "pub_date": "2026-02-27 19:11:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cirrus Nexus Now Available in the Microsoft Marketplace",
            "description": "<div class=\"txt-s4 article-text\"><p>Cirrus Nexus announced the availability of TrueCarbon, in the Microsoft Marketplace, the unified online destination for customers to buy trusted cloud solutions, AI apps, and agents to meet their business needs. Cirrus Nexus customers can now discover and deploy trusted solutions through Microsoft Marketplace, with smooth integration and streamlined management across Microsoft Azure and other Microsoft products. TrueCarbon??</p><p>automatically analyzes every workload across AWS and Azure to deliver an accurate, workload-level baseline of spend, performance, and emissions. In minutes, organizations can validate excellence, expose efficiencies, quantify waste, and surface high-impact optimization opportunities that save money, energy, and time, all without operational disruption. TrueCarbon??</p><!-- Article --><p>is available for both continuous cloud optimization and periodic strategic reporting, giving enterprises the flexibility to benchmark, govern, and improve cloud estates with precision. Microsoft Marketplace is a single destination to find, try, and buy trusted cloud solutions, AI app, and agents to meet business objectives. Choose from a growing collection of solutions tailored to unique needs, available both in Marketplace and directly within Microsoft products.</p></div>",
            "link": "https://hk.marketscreener.com/news/cirrus-nexus-now-available-in-the-microsoft-marketplace-ce7e5cded081f020",
            "pub_date": "2026-02-27 19:11:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PT Astra International Tbk Proposes Final Cash Dividend for the Year 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>PT Astra International Tbk announced a final dividend of IDR 292 per share (2024: IDR 308 per share) will be proposed at the Annual General Meeting of Shareholders of the Company to be held in April 2026. The proposed final dividend, together with the interim dividend of IDR 98 per share (2024: IDR 98 per share) distributed in October 2025, will bring the proposed total dividend for 2025 to IDR 390 per share (2024: IDR 406 per share), representing a dividend payout ratio of 48%.</p></div>",
            "link": "https://hk.marketscreener.com/news/pt-astra-international-tbk-proposes-final-cash-dividend-for-the-year-2025-ce7e5cded081f024",
            "pub_date": "2026-02-27 19:11:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Matheson Holdings Limited Announces Executive Changes",
            "description": "<div class=\"txt-s4 article-text\"><p>Jardine Matheson Holdings Limited announced that John Witt retired as Chairman of the Board in November. Having served on the Board since 2021, it is my honour to assume the role of JC&amp;C's first independent chairman. On behalf of the Board, express appreciation to Ben Birks and Jeffery Tan who are stepping down as Group Managing Director and Company Secretary, respectively, after JC&amp;C's annual general meeting in April 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/jardine-matheson-holdings-limited-announces-executive-changes-ce7e5cded081f12c",
            "pub_date": "2026-02-27 19:11:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump to tout economy, energy in Texas ahead of Republican primaries",
            "description": "<div class=\"txt-s4 article-text\"><p>CORPUS CHRISTI, Texas, Feb 27 (Reuters) - U.S. President Donald Trump will travel to southern Texas on Friday to tout his economic and fossil fuel agenda, just days before Republicans face competitive primary elections in the state.</p><p>\n              Trump has so far stayed out of his party's high-profile battle over a U.S. Senate seat, but his visit to Corpus Christi places him near several contested U.S. House of Representatives districts where Hispanic voters, an important constituency for Republicans nationally, could determine the outcome in November's midterm elections.</p><!-- Article --><p>\n              The trip follows a warning from a Texas Republican who said her recent loss in a state legislature race, despite Trump's endorsement, was a \"wake-up call\" for the party. </p><p>\n              The president's economy-focused event springboards off his State of the Union address, which sought to draw sharp contrasts with Democrats on affordability and immigration enforcement as they aim to gain control of Congress later this year.</p><p>\n              White House press secretary Karoline Leavitt said in a statement Trump will tout his \"drill baby drill\" agenda in Texas. The Corpus Christi area is the top exporter of liquefied natural gas in the U.S., with 42% of the product nationwide passing through its port.</p><p>\n              Midterm elections are historically seen as a check on the sitting president, and Trump has warned his agenda will be derailed if his party loses power. But first, Republicans in the deeply conservative state must settle on who they want to represent them in November's general election. </p><p>\n              Public opinion polls show Senator John Cornyn, in office since 2002, trailing two challengers - Texas Attorney General Ken Paxton and U.S. Representative Wesley Hunt - in Texas' most cutthroat contest.</p><p>\n              Unlike in Louisiana, where Trump encouraged a challenge to the incumbent Republican senator, the president has let the Texans duke it out in a contest made personal with accusations of sexual affairs and political ineffectiveness.</p><p>\n              Republican candidates in the Senate and some House races are expected to attend Trump's event on Friday.</p><p><b>CAN FORCED REDISTRICTING RESCUE REPUBLICANS?</b></p><p>\n              At the president's urging last year, Texas Republicans launched a redistricting fight aimed at improving the party's prospects in U.S. House races. With the new map in effect, Republicans could gain up to five more seats across the state. </p><p>\n              Hispanic voters in south Texas are key to the party's electoral success, said Corpus Christi's state Senator Adam Hinojosa, the first Republican to represent the Rio Grande Valley in the Texas Senate since 1874.</p><p>\n              \"We need the job opportunities, we need to make sure that our families are taken care of, we need to be able to afford all of the groceries and things to have a decent lifestyle,\" Hinojosa said in an interview.</p><p>\n              Crediting Trump's border policy and pro-oil agenda, Hinojosa said he thought the president's visit would help energize the Republican base.</p><p>\n              Trump has prioritized maximizing U.S. fossil fuel production by rolling back environmental regulations and streamlining permitting for energy projects, benefiting places like southern Texas.</p><p>\n              Even so, a recent Reuters/Ipsos poll found that 36% of people nationwide approved of Trump's handling of the economy while 56% disapproved. </p><p>\n              \"It's hard to know if he is perceptive to economic concerns,\" Tiffany Ritchie, 50, a self-declared independent in Corpus Christi, said in an interview, noting she voted for Trump for the first time in the 2024 presidential election. \"I would like to think he is, however, he is the kind of character who will just kind of throw anything against the wall and see if it sticks.\"</p><p>\n              Republicans are targeting two Democratic-held border districts: the Brownsville-area seat represented by Vicente Gonzalez since 2016, and the Laredo-area seat held by 11-term Representative Henry Cuellar.</p><p>\n              In December, Trump pardoned Cuellar and his wife, but has since backed local Republican judge Tano Tijerina, accusing Cuellar of an \"act of disloyalty\" for seeking re-election as a Democrat.</p><p>\n              \"If Donald Trump wants to remind South Texans how terrible the economy is, he can be our guest,\" Madison Andrus, spokesperson for the Democrats' campaign arm, said in a statement. </p><p></p><p> (Reporting by Bo Erickson, Jarrett Renshaw and Nolan McCaskill; Editing by Colleen Jenkins and Chris Reese)</p><p>\n            By Bo Erickson</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-to-tout-economy-energy-in-texas-ahead-of-republican-primaries-ce7e5cded081f326",
            "pub_date": "2026-02-27 19:05:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Restaurants emerge as bright spot for US job growth as consumers seek treats",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW YORK, Feb 27 (Reuters) - On paper, American consumers spent last year tightening their belts, and even retail heavyweights stumbled. But sit-down restaurants and some drive-through chains buzzed with patrons seeking a special treat or cheap comfort food.</p><p>\n              Their upbeat sales made the U.S. restaurant industry a rare bright spot for jobs, with restaurant payrolls ticking up 1% last year, adding about 108,000 jobs, according to the Bureau of Labor Statistics. </p><!-- Article --><p>\n              In contrast, the overall U.S. economy added 181,000 non-farm jobs in 2025, marking the weakest annual payroll growth in 20 years outside a recession year.</p><p>\n              Success among restaurants was not evenly spread, though.</p><p>\n              Corporate filings show that eateries such as Brinker's Chili's, Yum Brands' Taco Bell and fast-growing coffee chain Dutch Bros lured customers by aggressively marketing bundled deals, leaning into digital innovation and limited-time offers, and focusing on high-margin, Instagrammable food. </p><p>\n              But previous darlings like Chipotle and Cava were hurt by what analysts call the \"slop-bowl fatigue\" -  growing weariness among younger consumers with high-priced, customizable grain or salad bowls. </p><p>\n              Tempe, Arizona-based Dutch Bros and its franchisees added roughly 8,000 employees in the last two years, a 33% increase, the company said. </p><p>\n              \"We have a healthy pipeline of growth,\" CEO Christine Barone told Reuters after the company's earnings in February. The brand, which serves customizable beverages, is a hit with younger consumers, Barone said.  </p><p>\n              A similar story is playing out at another chain that, like Dutch Bros, sells more treats than meals.</p><p>\n              Ice cream chain Whit's Frozen Custard has grown its payroll by up to 40% a year for the past two years, said owner Bill Aseere, to keep up with rapid growth. It now has stores in 93 locations across 10 states and some 15 to 20 employees per store. </p><p>\n              Amanda Wang, co-founder of fast-growing Chinese beverage chain Ningji Lemon Tea - part of a tidal wave of Chinese tea brands coming to the U.S. - said her chain's new restaurants in the U.S. were buoyed by demand among price-weary consumers for affordable indulgences. </p><p>\n              Tea \"offers that little bit of happiness,\" she said.</p><p>\n              As a whole, the restaurant industry grew payrolls even as it weathers depressed traffic and rising labor costs, analysts say, thanks in part to menu price increases. Menu prices at restaurants grew 4.1% in 2025 compared to grocery inflation of 2.3%, according to the Federal Reserve Bank of St. Louis. </p><p><b>DIVERGING FORTUNES</b></p><p>\n              A deeper look at 2025 payroll data shows the difference in fortunes between types of restaurants: staff headcount at snack and non-alcoholic beverage restaurants grew 3.6% in 2025 and those at sit-down restaurants rose 1%. But fast-food payrolls grew only 0.4%, while cafeterias and buffet payrolls shrank 3.9%. </p><p>\n              \"At the end of the day, people want go out to eat and celebrate those big occasions,\" said Chad Moutray, an economist at the National Restaurant Association, referring to resilient spending at sit-down restaurants. </p><p>\n              \"Consumers might be pulling back from vacations, but they still prioritize eating out.\"</p><p>\n              The payroll data and Moutray's comments underscore what the industry calls the \"lipstick effect\" - consumers tightened their budgets, canceling expensive trips and postponing big-ticket purchases, but treated themselves to an indulgent meal, coffee or dessert.</p><p>\n              Brinker's reported 23% growth in its hourly restaurant staff between fiscal years 2024 and 2025, according to SEC filings, though it indicated that a growing share of its employees were part-time. </p><p>\n              Darden, the parent company of sit-down restaurants like Olive Garden and LongHorn Steakhouse, increased staff for fiscal 2025 by about 3.8%.</p><p>\n              Most national restaurant chains are franchised and do not report total employment figures among franchisees, but Chipotle and Starbucks, which operate the majority of their own stores, reported slight declines in total headcount for fiscal year 2025. </p><p>\n              While cascades of tariff announcements have forced other industries to raise prices and reroute sourcing, restaurant owners have only faced the tariffs impacting narrow categories like cup packaging and Chinese Sichuan peppers. </p><p></p><p> (Reporting by Waylon Cunningham; Editing by Sayantani Ghosh and Nick Zieminski)</p><p>\n            By Waylon Cunningham</p></div>",
            "link": "https://hk.marketscreener.com/news/restaurants-emerge-as-bright-spot-for-us-job-growth-as-consumers-seek-treats-ce7e5cded081f522",
            "pub_date": "2026-02-27 19:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chevron-led Kazakhstan Oil Field Nears Full Production Capacity, Minister Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chevron-led-kazakhstan-oil-field-nears-full-production-capacity-minister-says-ce7e5cded081f620",
            "pub_date": "2026-02-27 19:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's third-quarter GDP growth estimated at 7.8% following data revamp",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - India's economy grew 7.8% in October-December from the same period a year earlier, after posting 8.4% growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data.</p><p>\n              For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6%, the National Statistics Office said. It had been forecast to grow by 7.4% under the old data series.</p><!-- Article --><p><b>COMMENTARY:</b></p><p><b>MADHAVI ARORA, CHIEF ECONOMIST, EMKAY GLOBAL FINANCIAL SERVICES, MUMBAI:</b></p><p>\n              \"The revised GDP series, featuring improved sectoral representation, reduced deflator-related distortions, and a more comprehensive capture of economic activity, has led to a recalibration of historical data. </p><p>\n              The FY26 Second Advance Estimate now projects real GDP growth at 7.6%, up from the 7.4% in the First Advance Estimate. This follows a stronger FY25 print of 7.1% (revised up from 6.5% under the earlier base).\"</p><p><b>RADHIKA RAO, SENIOR ECONOMIST, DBS BANK, SINGAPORE:</b></p><p>\n              \"At first glance, the momentum in the rebased growth numbers appears to be marginally stronger than the previous trend, with methodological changes expected to have captured updated production structures, wider coverage of segments, new ratios, and improved government data sets, including those that capture activity in the informal sector. </p><p>\n              Service sector performance signals a strong lift, besides double-digit growth in manufacturing. The October-December quarter also benefited from indirect tax rationalisation and festive demand, in addition to a better faring rural farm sector. The rebased numbers are close to our forecast of 7.7% YoY for FY26.\"</p><p>\n               (Reporting by Kashish Tandon, Meenakshi Maidas in Bengaluru; compiled by Abinaya Vijayaraghavan; Editing by Sonia Cheema)</p></div>",
            "link": "https://hk.marketscreener.com/news/instant-view-india-s-third-quarter-gdp-growth-estimated-at-7-8-following-data-revamp-ce7e5cded08efe20",
            "pub_date": "2026-02-27 19:05:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SocGen's Overnight Economic News Summary",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/socgen-s-overnight-economic-news-summary-ce7e5cded08efe26",
            "pub_date": "2026-02-27 19:05:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moore Threads Technology says prelim 2025 net loss narrows to 1 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/moore-threads-technology-says-prelim-2025-net-loss-narrows-to-1-billion-yuan-ce7e5cded08efe25",
            "pub_date": "2026-02-27 19:06:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WuXi XDC Licenses Cancer Tech to AI Biotech Firm Earendil in Deal Potentially Valued at $885 Million",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Jason Chau </p><br/><p>\n  Chinese pharmaceutical company WuXi XDC is partnering with U.S. biotech startup Earendil Labs in a deal it says could be worth up to $885 million. </p><!-- Article --><p>\n\n  Under the agreement, Hong Kong-listed WuXi will grant Earendil, which uses artificial-intelligence for drug discovery, exclusive global license to its proprietary cancer therapy technology. </p><p>\n\n  Earendil will use the technology to conjugate antibodies discovered through its AI intelligence platform to develop candidates for cancer treatment, WuXi said in a statement Friday. </p><p>\n\n  Including upfront and milestone payments, WuXi said the deal could have a potential value of about $885 million. It will also be eligible to receive tiered royalties on sales of any products. </p><p>\n\n  WuXi will support the chemical, manufacturing and controls stage of drug development, while Earendil will focus on commercialization. </p><p>\n\n  Earendil specializes in using machine learning to research and produce innovative drugs targeting conditions including autoimmune diseases. </p><br/><p>\n  Write to Jason Chau at jason.chau@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0559ET</p></div>",
            "link": "https://hk.marketscreener.com/news/wuxi-xdc-licenses-cancer-tech-to-ai-biotech-firm-earendil-in-deal-potentially-valued-at-885-million-ce7e5cded08eff2d",
            "pub_date": "2026-02-27 19:00:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia tightens rules for Airbnb-style rentals",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-tightens-rules-for-airbnb-style-rentals-ce7e5cded08eff2c",
            "pub_date": "2026-02-27 19:00:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dated alert on Sandmartin International Holdings withdrawn",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dated-alert-on-sandmartin-international-holdings-withdrawn-ce7e5cded08eff26",
            "pub_date": "2026-02-27 19:00:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aurobindo Pharma says completion of US FDA inspection at unit I of Eugia Pharma Specialities",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/aurobindo-pharma-says-completion-of-us-fda-inspection-at-unit-i-of-eugia-pharma-specialities-ce7e5cded08ef02d",
            "pub_date": "2026-02-27 19:00:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coupang Logs High Earnings Amid 2.19 Billion Won Fine On Marketing Breaches",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coupang-logs-high-earnings-amid-2-19-billion-won-fine-on-marketing-breaches-ce7e5cded08ef025",
            "pub_date": "2026-02-27 19:00:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU Commission probes Romania's revised plan for CE Oltenia restructuring",
            "description": "<div class=\"txt-s4 article-text\"><p>BRUSSELS, Feb 27 (Reuters) - The European Commission said on Friday it had opened an in-depth investigation into Romania's amended restructuring plan for state-owned lignite power holding company CE Oltenia.</p><p>\n              The Commission will assess whether the revised restructuring plan complies with EU State aid rules, it said in a statement.</p><!-- Article --><p></p><p> (Reporting by Gianluca Lo Nostro; Editing by Sudip Kar-Gupta)</p></div>",
            "link": "https://hk.marketscreener.com/news/eu-commission-probes-romania-s-revised-plan-for-ce-oltenia-restructuring-ce7e5cded08ef126",
            "pub_date": "2026-02-27 19:00:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trina Solar's shareholder to sell 2% stake in co",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trina-solar-s-shareholder-to-sell-2-stake-in-co-ce7e5cded08ef223",
            "pub_date": "2026-02-27 19:00:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Fiscal Q4 Adjusted Earnings, Revenue Rise; Guidance Beats -- Shares Up Pre-Bell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-fiscal-q4-adjusted-earnings-revenue-rise-guidance-beats-shares-up-pre-bell-ce7e5cded08ef222",
            "pub_date": "2026-02-27 19:01:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSI Solar prelim 2025 net profit down 54.6% Y/Y",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/csi-solar-prelim-2025-net-profit-down-54-6-y-y-ce7e5cded08ef221",
            "pub_date": "2026-02-27 19:01:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MetaX Integrated Circuits prelim 2025 net loss at 781.5 million yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/metax-integrated-circuits-prelim-2025-net-loss-at-781-5-million-yuan-ce7e5cded08ef226",
            "pub_date": "2026-02-27 19:01:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's MFG buys around 135,000 tons corn, traders say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-mfg-buys-around-135-000-tons-corn-traders-say-ce7e5cded08ef321",
            "pub_date": "2026-02-27 19:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's April-January fiscal deficit at 63% of 2025/26 target",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW DELHI, Feb 27 (Reuters) - India's fiscal deficit in April-January was 9.8 trillion rupees ($107.69 billion) or 63% of the estimate for the financial year ending March 31, government data showed on Friday.</p><p>\n              ($1 = 91.0010 Indian rupees)</p><!-- Article --><p></p><p> (Reporting by Shivangi  Acharya; Editing by Mrigank Dhaniwala)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-s-april-january-fiscal-deficit-at-63-of-2025-26-target-ce7e5cded08ff02d",
            "pub_date": "2026-02-27 18:51:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW DELHI, Feb 27 (Reuters) - India's economy grew 7.8% in October-December from the same period a year earlier, after posting 8.4% growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data.</p><p>\n              For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6%, the National Statistics Office said. It had been forecast to grow by 7.4% under the old data series.</p><!-- Article --><p>\n              Prime Minister Narendra Modi's government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. The adjustments aim to address criticism of outdated data practices and enhance accuracy. </p><p></p><p> (Reporting by Nikunj Ohri and Shubham Batra in New DelhiEditing by Gareth Jones)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-s-gdp-growth-estimated-at-7-8-in-oct-dec-following-data-revamp-ce7e5cded08ff021",
            "pub_date": "2026-02-27 18:51:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}