{
    "data": [
        {
            "title": "Baidu Q4 Non-GAAP Earnings, Revenue Fall; Shares Down Pre-Bell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/baidu-q4-non-gaap-earnings-revenue-fall-shares-down-pre-bell-ce7e5cd8d081f423",
            "pub_date": "2026-02-26 19:20:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures waver as Nvidia's blockbuster results draw muted response",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - U.S. stock index futures were muted on Thursday as Nvidia's stellar quarterly results garnered a lukewarm response from investors and downbeat earnings from software company Salesforce weighed on sentiment. </p><p>\n              Nvidia inched 0.6% higher in premarket trading after the chipmaker posted better-than-expected results for the January quarter and forecast current-quarter revenue above market estimates. </p><!-- Article --><p>\n              \"The needle has clearly shifted when it comes to what its going to take to convince investors that the billions being poured into AI infrastructure will pay off,\" said Raffi Boyadjian, lead market analyst at Trading Point. </p><p>\n              \"Markets are now moving into a phase where they want to see tangible results of AI monetization before pushing AI stocks above their recent ranges.\"</p><p>\n              Most megacap and growth stocks including Apple and Microsoft were trading in the flat-to-lower band. </p><p>\n              At 05:51 a.m. ET, Dow E-minis were down 53 points, or 0.11%, S&amp;P 500 E-minis were down 6.25 points, or 0.09%, and Nasdaq 100 E-minis were down 27 points, or 0.11%. </p><p>\n              Salesforce shed 3.1% after the cloud software provider forecast fiscal 2027 revenue below expectations, signaling sluggish spending on enterprise business software. </p><p>\n              Results from software-related companies could garner extra attention this earnings season given the S&amp;P 500 software and services index has dropped nearly 21% so far this year as concerns of AI-related disruptions hit the sector. </p><p>\n              While software has been one of the worst hit, financial brokerage, data analytics and legal services, real estate services and trucking are some other sectors that clocked heavy losses amid growing AI disruption fears earlier this year. </p><p>\n              February has been a choppy month for U.S. equities, with the main indexes swinging sharply between gains and losses as sentiment towards AI and technology stocks waver, with investors questioning if massive planned AI spending is actually paying off.</p><p>\n              The S&amp;P 500 and the Nasdaq closed at two-week highs on Wednesday, fueled by a rally in heavyweight technology stocks. </p><p>\n              Media company Warner Bros Discovery, Skippy peanut butter maker Hormel Foods and utility Vistra are some of the prominent companies reporting earnings before the bell on Thursday. </p><p>\n              A weekly jobless claims reading is due later in the day and January producer prices data is scheduled for release on Friday. </p><p>\n              Among other stocks, Trade Desk dropped 16.9% after the advertising technology firm forecast first-quarter revenue below estimates amid mounting pressure from larger rivals. </p><p>\n              C3.ai slipped 22.7% after the software provider forecast current-quarter sales below estimates and said it was cutting 26% of its global workforce. </p><p>\n              Shares of energy companies including Exxon Mobil and Chevron were down around 0.4% each, tracking lower crude oil prices as investors assessed whether U.S.-Iran talks could avert a military conflict that risks supply disruptions. </p><p></p><p> (Reporting by Shashwat Chauhan in Bengaluru; Editing by Devika Syamnath)</p></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-waver-as-nvidia-s-blockbuster-results-draw-muted-response-ce7e5cd8d081f422",
            "pub_date": "2026-02-26 19:20:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India markets regulator changes gold, silver valuation for mutual funds",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - India's markets regulator on Thursday directed mutual funds to use domestic stock exchange spot prices to value their physical gold and silver holdings from April 1, 2026.</p><p>\n              The Securities and Exchange Board of India (SEBI) said mutual funds may now use polled spot prices from recognized stock exchanges that settle physically delivered gold and silver derivatives contracts, ensuring that valuations reflect domestic market conditions.</p><!-- Article --><p>\n              The change moves away from the currently used London Bullion Market Association prices to arrive at the valuation of gold and silver held by exchange traded funds.</p><p></p><p> (Reporting by Nishit Navin in Bengaluru)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-markets-regulator-changes-gold-silver-valuation-for-mutual-funds-ce7e5cd8d081f420",
            "pub_date": "2026-02-26 19:20:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walsin Lihwa says 2025 net profit T$3.18 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/walsin-lihwa-says-2025-net-profit-t-3-18-bln-ce7e5cd8d081f426",
            "pub_date": "2026-02-26 19:20:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poste Italiane Q4 adj. EBIT at EUR 729 mln above consensus",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/poste-italiane-q4-adj-ebit-at-eur-729-mln-above-consensus-ce7e5cd8d081f526",
            "pub_date": "2026-02-26 19:20:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Targa Resources Prices $1.5 Billion Senior Notes Offering Due 2031, 2056",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/targa-resources-prices-1-5-billion-senior-notes-offering-due-2031-2056-ce7e5cd8d081f524",
            "pub_date": "2026-02-26 19:20:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Argenx Q4 Earnings Decline, Operating Income Rises",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/argenx-q4-earnings-decline-operating-income-rises-ce7e5cd8d081f622",
            "pub_date": "2026-02-26 19:20:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UCB sees 2026 adj. Ebitda to grow in high single-digit to high teens percentage range at CER",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ucb-sees-2026-adj-ebitda-to-grow-in-high-single-digit-to-high-teens-percentage-range-at-cer-ce7e5cd8d081f723",
            "pub_date": "2026-02-26 19:20:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Allianz Q4 operating profit EUR 4,297 million versus estimate EUR 4,283 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/allianz-q4-operating-profit-eur-4-297-million-versus-estimate-eur-4-283-million-ce7e5cd8d081f727",
            "pub_date": "2026-02-26 19:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mistral AI Lands Accenture as Latest Big Client",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Mauro Orru and Najat Kantouar </p><br/><p>\n  Mistral AI struck an agreement with Accenture that will make the technology consulting group its latest high-profile client, a boost for the French artificial-intelligence startup as it seeks to expand its network of alliances. </p><!-- Article --><p>\n\n  The companies said Thursday that Mistral AI would essentially make its models available to Dublin-headquartered Accenture so it can use them to assist its own clients in leveraging AI. They didn't disclose financial details for the multi-year agreement. </p><p>\n\n  Accenture employees will have access to products like Mistral AI Studio--a platform that allows users to experiment with models before embedding the technology in their operations. The software will allow Accenture to advise its customers on how to deploy AI at scale. </p><p>\n\n  For Mistral AI, the deal means it can add Accenture to its list of big-shot clients at a critical juncture in the AI race as large tech companies rush to secure partnerships with model providers to streamline their operations and improve services for customers. </p><p>\n\n  International Business Machines, Cisco Systems, SAP, carmaker Stellantis and Dutch chip-equipment giant ASML Holding are among several high-profile companies that are leveraging Mistral AI's models, according to the company's website. </p><p>\n\n  Last year, ASML agreed to inject more than $1.5 billion into Mistral AI for a roughly 11% stake, leading a round that valued the Paris-based startup at nearly $14 billion. Mistral AI has also struck partnerships with European governments, Singapore and Morocco. </p><p>\n\n  For Accenture, the deal means the consulting giant can use new models to reduce repetitive tasks, speed up delivery of projects and advise clients on how to adopt AI in their day-to-day operations. </p><p>\n\n  In December, Accenture struck a multi-year partnership with Anthropic to train about 30,000 of its employees on the startup's Claude chatbot and help enterprises shift from experimenting with AI to fully deploying it. </p><p>\n\n  Chief Executive Julie Sweet has been a fierce advocate of the technology as a primary growth driver, actively pushing employees to learn how to use it. Last year, she said the company had already trained a big portion of its roughly 780,000-strong workforce, but cautioned that employees who weren't getting the hang of AI would be shown the door. </p><br/><p>\n  Write to Mauro Orru at mauro.orru@wsj.com and Najat Kantouar at najat.kantouar@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0614ET</p></div>",
            "link": "https://hk.marketscreener.com/news/mistral-ai-lands-accenture-as-latest-big-client-ce7e5cd8d08efe2d",
            "pub_date": "2026-02-26 19:20:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sony Group Corporation announces an Increase in Equity Buyback.",
            "description": "<div class=\"txt-s4 article-text\"><p>On February 26, 2026, the company announced an increase in its equity buyback plan. The company increased its authorization by an additional 35,000,000 shares for ¥100,000 million, thereby increasing the total plan term to 90,000,000 shares, representing 1.51% of its issued share capital for ¥250,000 million.</p></div>",
            "link": "https://hk.marketscreener.com/news/sony-group-corporation-announces-an-increase-in-equity-buyback-ce7e5cd8d08efe25",
            "pub_date": "2026-02-26 19:20:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Economists Paint Optimistic Picture of Singapore's 2026 Growth Outlook",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/economists-paint-optimistic-picture-of-singapore-s-2026-growth-outlook-ce7e5cd8d08ef024",
            "pub_date": "2026-02-26 19:15:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moody's Affirms Engie's Ratings, Outlook Amid GBP10.5 Billion Purchase of UKPN",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/moody-s-affirms-engie-s-ratings-outlook-amid-gbp10-5-billion-purchase-of-ukpn-ce7e5cd8d08ef123",
            "pub_date": "2026-02-26 19:15:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese influence operation targets Japan elections, Trump, other countries, US foundation says",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - In the days surrounding Japanese Prime Minister Sanae Takaichi's February election win, several dozen X accounts linked to a Chinese misinformation campaign attacked her deeply conservative views and hawkish approach to China, said a U.S. research institute focused on national security and foreign policy. </p><p>\n              The 35 accounts, along with nine channels on the microblogging site Tumblr, pushed corruption allegations and portrayed Takaichi as illegitimate and militaristic. The accounts suggest the prime minister is a reckless \"cult-backed\" leader driving Japan toward war, said Maria Riofrio, a researcher with the Foundation for Defense of Democracy's Center on Cyber and Technology Innovation. </p><!-- Article --><p>\n              The accounts, part of a network of at least 327 X and other social media accounts, have since December or earlier attacked adversaries of Beijing or pushed pro-China policy positions, and targeted human rights organizations and sought to influence domestic politics in Japan, the United States, the Philippines and Latin America, according to a new analysis by Riofrio.    </p><p>\n              A spokesperson for Takaichi said her office is aware of suspicious foreign social media accounts that have posted content related to Japan's elections. </p><p>\n              \"We consider this to be a national security threat that undermines the very foundations of democracy, including the fairness of elections and freedom of the press. We believe that countermeasures must be urgently prioritized.\" </p><p>\n              Spokesperson Liu Pengyu for the Chinese Embassy in Washington said the \"analysis\" by the FDD was \"groundless.\"</p><p>\n              \"The Chinese government consistently opposes and combats the use of fake accounts and other tactics to manipulate public opinion or spread disinformation,\" Liu said in a statement to Reuters. </p><p>\n              \"We urge the relevant parties to stop making unfounded accusations and smearing others based on speculation.\"</p><p>\n              Riofrio identified the most recent campaign as a distinct cluster based on its pro-China narratives that has coordinated on messaging content containing overlapping hashtags and other similarities. The cluster is likely part of long-running Chinese information operations that internet security analysts have dubbed Spamouflage or Dragonbridge, she said. </p><p>\n              Although engagement with the material is low, users do see the content in social media feeds and the operators work algorithms to boost the content. One tweet that accused Takaichi of being in a cult, for example, received only two likes but was viewed more than 1,000 times. </p><p>\n              The activity demonstrates \"China has the political will to interfere in Japanese elections and internal affairs,\" Riofrio said, noting that the overall cluster has similar operations targeting other countries, including the United States. </p><p>\n              The FDD is a Washington-based nonprofit focused on \"strengthening U.S. national security and reducing or eliminating threats posed by adversaries and enemies of the United States and other free nations,\" according to its website. </p><p><b>ATTACKS ON TRUMP, ASIA-PACIFIC NATIONS</b></p><p>\n              The Nikkei newspaper reported earlier this week on another set of suspected foreign-backed online operations attacking the Japanese elections. </p><p>\n              Riofrio said nearly half of the 327 accounts attacked U.S. President Donald Trump, pushing the narrative that his drug and border policies have worsened America's fentanyl crisis, reversing gains made during the Biden era, while also deflecting blame from China, according to the FDD analysis. </p><p>\n              In a coordinated sequence of messaging in early February on Trump and fentanyl, six accounts, despite having fewer than 10 followers each, attracted hundreds of likes, retweets and replies and nearly 18,000 views as of February 12, Riofrio said.</p><p>\n              One account in the network, FentanylFreeA, created in December 2025, Riofrio said, seemingly seeks to emulate the U.S. Drug Enforcement Agency's Fentanyl Free America campaign, using a similar name and identical imagery. The account attacks both the U.S. and India, which it blames as the source of fentanyl precursor drugs. </p><p>\n              Neither the White House or the DEA responded to a request for comment. </p><p>\n              The operations known as Spamouflage or Dragonbridge have been active since at least 2017 and have repeatedly targeted audiences around the world over the years, according to experts. </p><p>\n              A spokesperson for Google's Threat Intelligence Group said Dragonbridge is the most prolific pro-PRC information operations operator that it tracks as of early 2026 based on \"its massive scale and assertive narrative agenda.\" </p><p>\n              Dragonbridge, while maintaining a foundational focus on targeting the U.S., overseas dissidents, government critics and international NGOs, has become notably more assertive in the Asia-Pacific, the Google spokesperson said, including by targeting the political leadership of Japan, Japan-Taiwan relations, Vietnam over its South China Sea activities, India and the Philippine administration. </p><p>\n              OpenAI on Wednesday reported that it had disrupted attempts in mid-October by a Chinese law enforcement official to help plan a multi-stage information attack on Takaichi. </p><p></p><p> (Reporting by AJ Vicens in Detroit; Additional reporting by Kentaro Sugiyama and Hina Suzuki in Tokyo; Editing by Chris Sanders and Tom Hogue)</p><p>\n            By AJ Vicens, Hina Suzuki and Kentaro Sugiyama</p></div>",
            "link": "https://hk.marketscreener.com/news/chinese-influence-operation-targets-japan-elections-trump-other-countries-us-foundation-says-ce7e5cd8d08ef227",
            "pub_date": "2026-02-26 19:15:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie Price Target, Estimates Raised as Barclays Notes \"Major Strategic Milestone\" With UK Power Networks Deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-price-target-estimates-raised-as-barclays-notes-major-strategic-milestone-with-uk-power-net-ce7e5cd8d08ef323",
            "pub_date": "2026-02-26 19:15:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CRISIL Upgrades Rating on Solarworld Energy Solutions' Bank Facilities to A-; Outlook Stable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/crisil-upgrades-rating-on-solarworld-energy-solutions-bank-facilities-to-a-outlook-stable-ce7e5cd8d08ef321",
            "pub_date": "2026-02-26 19:15:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Quarterly Profit Boosted by Revenue Growth Across Business Segments",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Canadian Imperial Bank of Commerce notched a jump in first-quarter earnings on the back of record revenue across each of its business units and a strengthened return on equity. </p><!-- Article --><p>\n\n  CIBC, one of the country's largest lenders, recorded net income of 3.10 billion Canadian dollars ($2.27 billion), or C$3.21 a share, for the three months ended Jan. 31, against C$2.17 billion, or C$2.19, a year earlier. On an adjusted basis, per-share earnings came in at C$2.76, above the C$2.40 mean estimate of analysts polled by FactSet. </p><p>\n\n  Total revenue climbed 15% to C$8.4 billion, beating the C$7.7 billion analysts anticipated. </p><p>\n\n  Return on equity, a measure of profitability and efficiency, widened to 17.4% on an adjusted basis from 15.3% in the same period last year. </p><p>\n\n  CIBC's provision for credit losses was C$568 million in the latest quarter, down C$37 million on the quarter before and C$5 million below a year earlier. Analysts were expecting C$562 million analysts expected to be put aside against the risk of defaults. </p><p>\n\n  The provision for credit losses on performing loans fell on a the same period last year thanks to a more favorable economic outlook, while the provision on impaired loans was up mainly due to higher provisions in Canadian commercial banking and wealth management, and Canadian personal and business banking, CIBC said. </p><p>\n\n  Excluding provisions and tax, earnings for the second quarter were 19% higher than a year earlier at C$4.08 billion, CIBC said. </p><p>\n\n  The bank's Canadian personal and business banking segment recorded a 25% rise in net income as revenue was driven by a higher net interest margin and loan growth. Commercial banking and wealth management income in Canada was up about 9% year-over-year, thanks to higher fee-based revenue in its wealth business and a lift in commissions with increased client activity. </p><p>\n\n  CIBC's U.S. commercial banking and wealth unit logged a 19% increase in net income, as a rise in commercial revenue due to higher volumes, net interest margin and increased advisory fees offset a drop in wealth management revenue with lower annual performance-based mutual fund fees. </p><p>\n\n  The bank's common equity Tier 1 capital ratio stood at 13.4% for the three-month period, slightly wider than the 13.3% at the end of the prior quarter. </p><p>\n\n  Canada's banking regulator requires the big banks to hold a capital ratio of no less than 11.5% of risk-weighted assets. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0610ET</p></div>",
            "link": "https://hk.marketscreener.com/news/cibc-quarterly-profit-boosted-by-revenue-growth-across-business-segments-ce7e5cd8d08ef324",
            "pub_date": "2026-02-26 19:15:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Most Americans back Trump's deportation goals but not his tactics, Reuters/Ipsos poll finds",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Most Americans share President Donald Trump's view that immigrants living illegally in the U.S. should be deported, but generally disapprove of his hard-line tactics, including masked agents in tactical gear who have clashed with U.S. citizens, a new Reuters/Ipsos poll found.</p><p>\n              The six-day poll, concluded on Monday, illustrates both the broad appeal of Trump's focus on immigration enforcement and the widespread disapproval of his tactics that could weigh on his Republican Party in November 3 congressional midterm elections.</p><!-- Article --><p>\n              Some 61% of respondents - including 92% of Republicans and 35% of Democrats - said they \"support deporting unauthorized immigrants.\" Trump's stand on the issue helped him win the 2024 presidential election as he accused Democratic politicians of favoring \"open borders.\"</p><p>\n              Sixty-three percent of Democrats said they do not support deporting unauthorized immigrants, compared with 7% of Republicans.</p><p>\n              During Tuesday's State of the Union address, Trump tried to reclaim the narrative on immigration, which had been among his greatest political strengths before a wave of street clashes involving ICE agents. These have included separation of families and fatal shootings of two U.S. citizens. Trump on Tuesday said his focus was on criminals, noting, \"We're getting them the hell out of here fast.\"</p><p><b>ICE GONE TOO FAR, SURVEY FINDS</b></p><p>\n              Some 60% of Americans - including a fifth of Republicans and nine in 10 Democrats - think immigration agents have gone too far, the Reuters/Ipsos poll found. Among people who do not identify with either party, 65% think authorities have gone too far. These independent voters could be a critical swing group in November when Republicans will try to maintain their thin majorities in the U.S. House of Representatives and U.S. Senate.</p><p>\n              Disapproval of Trump's tactics is particularly high among Black and Hispanic Americans, two slices of the electorate that Trump made progress with in the 2024 election.</p><p>\n              Seventy-four percent of Black respondents and 72% of Hispanics said they did not like how the administration was handling deportations, compared with 51% of white respondents.</p><p>\n              Since February 2025, Trump's overall approval rating among Hispanic Americans has dropped by 7 percentage points to 29% in the latest survey. Among Black Americans it has ticked 2 percentage points lower to 14%. Among white Americans it is down 4 points to 49%.</p><p>\n              Significant internal divisions have opened in both political parties over immigration enforcement. Among Republicans who support deportations, 23% said they were uncomfortable with the current tactics employed by immigration officers. Democrats, besides being divided on whether unauthorized immigrants should be deported at all, also disagree on whether to disband the Immigration and Customs Enforcement branch of the Department of Homeland Security, known as ICE, a central enforcement body. </p><p><b>RISING DEMOCRATIC OPPOSITION</b></p><p>\n              Some 63% of Democrats said ICE should be abolished, while 30% disagreed. The share in favor was a significant increase from a 2018 Reuters/Ipsos survey that showed 44% of Democrats supporting the idea. The latest survey showed only a third of independents back getting rid of ICE, little changed from 2018.</p><p>\n              Only a handful of Democratic congressional candidates this year have called for abolishing the agency, with centrist organizations such as Third Way warning that embracing the idea could hurt Democrats at the polls in November.</p><p>\n              The latest Reuters/Ipsos survey, which was conducted online, gathered responses from 4,638 U.S. adults nationwide and had a margin of error of two percentage points.</p><p></p><p> (Reporting by Jason Lange in Washington; editing by Scott Malone and David Gregorio)</p><p>\n            By Jason Lange</p></div>",
            "link": "https://hk.marketscreener.com/news/most-americans-back-trump-s-deportation-goals-but-not-his-tactics-reuters-ipsos-poll-finds-ce7e5cd8d08ef42d",
            "pub_date": "2026-02-26 19:15:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CARE Keeps BBB+ Long-Term Rating on POCL Enterprises' Bank Facilities; Outlook Stable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/care-keeps-bbb-long-term-rating-on-pocl-enterprises-bank-facilities-outlook-stable-ce7e5cd8d08ef42c",
            "pub_date": "2026-02-26 19:15:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hillary Clinton to testify in congressional Epstein probe",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Former U.S. Secretary of State Hillary Clinton is due to testify behind closed doors on Thursday to a congressional committee investigating the late sex offender Jeffrey Epstein, though it is not clear how much new information will come to light.</p><p>\n              Clinton, the 2016 Democratic presidential nominee, has said she has little information to provide and has accused the Republican-led panel of trying to shift focus away from President Donald Trump's ties to Epstein, who died by suicide in jail in 2019 while awaiting trial on federal sex-trafficking charges.</p><!-- Article --><p>\n              She and her husband, Democratic former President Bill Clinton, initially refused to testify before the House of Representatives Oversight Committee, but relented when lawmakers moved to hold them in contempt of Congress. </p><p>\n              Hillary Clinton is due to deliver a closed-door deposition to the committee at 11 a.m. ET (1600 GMT) in Chappaqua, New York, near their main residence. Bill Clinton is scheduled to testify at the same time on Friday. </p><p>\n              A spokesperson for the Clintons did not respond to a request for comment.</p><p>\n              Committee chairman James Comer of Kentucky, a Republican, has said transcripts of their interviews will be made public.</p><p>\n              Hillary Clinton's ties to Epstein are unclear. </p><p>\n              Bill Clinton flew on Epstein's plane several times in the early 2000s after he left office. He has denied wrongdoing and expressed regret for his association.</p><p>\n              According to Comer, Epstein visited the White House 17 times while Clinton was in office. </p><p>\n              Trump also socialized extensively with Epstein in the 1990s and 2000s, before his 2008 conviction for soliciting prostitution from a minor. Comer said evidence gathered by the panel does not implicate Trump.</p><p>\n              Trump's Justice Department has released more than 3 million pages of Epstein-related documents over the past several months to comply with a law passed by Congress.</p><p>\n              The Justice Department sought to draw attention to photos of Bill Clinton, but the documents also have revealed Epstein's ties to a long list of business and political leaders, including Commerce Secretary Howard Lutnick and Tesla CEO Elon Musk.</p><p>\n              Overseas, they have prompted criminal investigations of Britain's Andrew Mountbatten-Windsor, the former Duke of York, and other prominent figures.</p><p></p><p> (Reporting by Richard Cowan and Nolan D. McCaskill; editing by Andy Sullivan and Alistair Bell)</p></div>",
            "link": "https://hk.marketscreener.com/news/hillary-clinton-to-testify-in-congressional-epstein-probe-ce7e5cd8d08ef420",
            "pub_date": "2026-02-26 19:15:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wilmar International Logs Higher Attributable Profit in H2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wilmar-international-logs-higher-attributable-profit-in-h2-ce7e5cd8d08ffe22",
            "pub_date": "2026-02-26 19:15:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UOL's Attributable Profit Surges 21% in H2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uol-s-attributable-profit-surges-21-in-h2-ce7e5cd8d08ffe25",
            "pub_date": "2026-02-26 19:15:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Steel says 2025 net loss at T$4.4 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-steel-says-2025-net-loss-at-t-4-4-bln-ce7e5cd8d08df120",
            "pub_date": "2026-02-26 19:00:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Telefónica Picks Nokia to Launch Edge Node Project in Spain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/telef-nica-picks-nokia-to-launch-edge-node-project-in-spain-ce7e5cd8d08df22d",
            "pub_date": "2026-02-26 18:55:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon refused permission to appeal go-ahead for two UK lawsuits from retailers, consumers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/amazon-refused-permission-to-appeal-go-ahead-for-two-uk-lawsuits-from-retailers-consumers-ce7e5cd8d08df220",
            "pub_date": "2026-02-26 18:55:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nordic countries investigate a threat to the region's energy infrastructure, Sweden's TV4 reports, citing sources",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nordic-countries-investigate-a-threat-to-the-region-s-energy-infrastructure-sweden-s-tv4-reports-c-ce7e5cd8d08df225",
            "pub_date": "2026-02-26 18:55:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deutsche Telekom CEO - We will do whatever we can to avoid giving up any spectrum",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/deutsche-telekom-ceo-we-will-do-whatever-we-can-to-avoid-giving-up-any-spectrum-ce7e5cd8d08df323",
            "pub_date": "2026-02-26 18:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China removes emergency management minister, state media reports",
            "description": "<div class=\"txt-s4 article-text\"><p>BEIJING, Feb 26 (Reuters) - China on Thursday removed Wang Xiangxi from the post of emergency management minister, state media reported, after the country's anti-graft watchdog announced a probe into Wang in January citing suspected \"serious violations of discipline and law.\"</p><p></p><p> (Reporting by Beijing Newsroom)</p></div>",
            "link": "https://hk.marketscreener.com/news/china-removes-emergency-management-minister-state-media-reports-ce7e5cd8d08df52c",
            "pub_date": "2026-02-26 18:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chu Kong Shipping's Chair Steps Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chu-kong-shipping-s-chair-steps-down-ce7e5cd8d08df523",
            "pub_date": "2026-02-26 18:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baidu's Net Income Plummets in Q4 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/baidu-s-net-income-plummets-in-q4-2025-ce7e5cd8d08df524",
            "pub_date": "2026-02-26 18:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong Banks' Capitalization to Remain Strong Despite Extreme Property Sector Shocks, S&P Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hong-kong-banks-capitalization-to-remain-strong-despite-extreme-property-sector-shocks-s-p-says-ce7e5cd8d08af026",
            "pub_date": "2026-02-26 18:50:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mirxes Plans India Cancer Screening Tie-Up With Apollo Health and Lifestyle",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mirxes-plans-india-cancer-screening-tie-up-with-apollo-health-and-lifestyle-ce7e5cd8d08af12d",
            "pub_date": "2026-02-26 18:50:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Beststudy Education Forecasts Up to 77% Higher Profit for 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-beststudy-education-forecasts-up-to-77-higher-profit-for-2025-ce7e5cd8d08af122",
            "pub_date": "2026-02-26 18:50:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CITIC Resources Won't Appeal Indonesian Court Ruling on Seram Block Case",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/citic-resources-won-t-appeal-indonesian-court-ruling-on-seram-block-case-ce7e5cd8d08af120",
            "pub_date": "2026-02-26 18:50:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ab&B Bio-Tech Expects Narrower Loss on Revenue Surge in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ab-b-bio-tech-expects-narrower-loss-on-revenue-surge-in-2025-ce7e5cd8d08af126",
            "pub_date": "2026-02-26 18:50:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How China is masking drone flights in potential Taiwan rehearsal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/how-china-is-masking-drone-flights-in-potential-taiwan-rehearsal-ce7e5cd8d08af32d",
            "pub_date": "2026-02-26 18:50:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AXA 2025 gross written premiums & other revenues at EUR 115.52 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/axa-2025-gross-written-premiums-other-revenues-at-eur-115-52-billion-ce7e5cd8d08af320",
            "pub_date": "2026-02-26 18:50:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-China is shifting crude oil buying in response to price rally: Russell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-china-is-shifting-crude-oil-buying-in-response-to-price-rally-russell-ce7e5cd8d08af427",
            "pub_date": "2026-02-26 18:50:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HSBC Upgrades Cathay Pacific Airways to Buy from Restricted, Price Target is HK$16",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hsbc-upgrades-cathay-pacific-airways-to-buy-from-restricted-price-target-is-hk-16-ce7e5cd8d08af425",
            "pub_date": "2026-02-26 18:50:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ubs Switzerland Country Head Keller-Busse: Biggest Disruption For Financial Centre Will Come From Technology",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ubs-switzerland-country-head-keller-busse-biggest-disruption-for-financial-centre-will-come-from-te-ce7e5cd8d08af625",
            "pub_date": "2026-02-26 18:50:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}