{
    "data": [
        {
            "title": "Odds of early Warsh-led Fed rate cuts slide with bullish outlook",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Federal Reserve chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts in alignment with President Donald Trump's expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</p><p>\n              The International Monetary Fund said on Wednesday that with expected U.S. growth rising to 2.4% this year from 2.2% last year, the unemployment rate likely hovering near 4%, and inflation falling gradually, the Fed would have \"only modest scope to lower the policy rate over the coming year\" through a single quarter-percentage-point cut.</p><!-- Article --><p>\n              A new Conference Board CEO survey, meanwhile, saw a sharp jump in the outlook for both the wider economy and within each leader's industry, with little sense that large rounds of layoffs were in the offing and firms passing through price increases from the Trump administration's import tariffs - a combination that could make it harder to justify rate cuts.</p><p>\n              Investors, meanwhile, have pushed back their bets on the timing of an initial Warsh-led rate cut, to the Fed's July 28-29 meeting from the June 16-17 gathering. Though his nomination has not been formally submitted to the Senate, Warsh is expected to be confirmed in time for the June meeting, with current Fed Chair Jerome Powell's leadership term ending in May.</p><p>\n              The improved outlook may be good for the economy, but it could leave Warsh in the same bind as Powell, with data and his colleagues pulling in one direction and the White House pulling in another.</p><p>\n              \"The Fed's reaction function has shifted slightly more hawkish,\" Natixis CIB economists Christopher Hodge and Selin Aker wrote in a note, concluding the central bank could only make two quarter-percentage-point rate cuts this year, rather than the three they previously expected.</p><p><b>MIRAN SAYS BIG DROP IN RATES STILL POSSIBLE IN 2026</b></p><p>\n              The U.S. central bank's next meeting is scheduled for March 17-18, when its policy-setting Federal Open Market Committee is expected to hold the benchmark interest rate in the 3.50%-3.75% range. New quarterly economic and rate projections also will be released at the end of that meeting.</p><p>\n              In December, the only central bank official with a rate outlook close to the steep cuts Trump wants was Fed Governor Stephen Miran, the former head of the Trump White House's Council of Economic Advisers. Miran saw the Fed's policy rate falling to as low as the 2.00%-2.25% range in 2026. The median expectation among Miran's colleagues, by contrast, saw just one quarter-percentage-point cut as likely appropriate.</p><p>\n              Nearly three months later, and after a strong January employment report, Miran on Thursday told the \"Mornings with Maria\" program on Fox Business that he still feels rates could fall a full percentage point this year through four 25-basis-point cuts, ideally sooner than later.</p><p>\n              His outlook is partly based on his expectation for a \"profoundly disinflationary\" artificial intelligence boost to productivity, a \"supply shock\" that Warsh has also said should allow for lower rates.</p><p>\n              \"I really do not think that we have an inflation problem,\" despite recent inflation readings a point above the central bank's 2% target, said Miran, whose term as a Fed governor has technically expired, but who can continue to fill the job until a replacement is named. Absent some other departure from the Fed's seven-member Board of Governors, Miran's seat would be needed for Warsh to eventually come aboard.</p><p><b>WARSH FACES POSSIBLE DILEMMA</b></p><p>\n              The minutes of the Fed's January 27-28 meeting showed little support yet for relying on AI-optimism to recast monetary policy. Staff presentations suggested a small boost in the economy's potential may be developing - the \"supply shock\" Miran has mentioned, but only in a measured dose - though with demand still strong enough to sustain pressure on prices.</p><p>\n              The minutes also cited unexpected comments that several policymakers were open to the possibility that the next rate move could be a hike. In addition, Fed Governor Christopher Waller, who joined Miran in dissenting in favor of a cut at the meeting in January, said this week that if recent strong job growth is repeated, \"it may be appropriate to hold the FOMC's policy rate at current levels.\"</p><p>\n              The U.S. employment report for February is due to be released on March 6.</p><p>\n              A combination of sticky inflation, a steady unemployment rate, and continued economic growth would in many ways be a comforting outcome for the Fed. Policymakers generally agree that inflation will decline and anticipate the combination of slow job growth and low rates of layoffs will yield a roughly steady unemployment rate. As long as that outlook continues, and absent any sense that public expectations about inflation are starting to shift higher, there would be little motivation to do anything other than wait.</p><p>\n              Such an outcome could present a dilemma for Warsh, who has laid out arguments for why rates should fall and now will have to contend with a strong-willed and publicly demonstrative president who has taken the Fed chief nominee at his word. Trump said earlier this month that he had not asked Warsh to lower rates, but felt it was clear what his nominee would do.</p><p>\n              Trump has clashed with Powell repeatedly over the president's demands for deep rate cuts, but said of Warsh last month: \"I don't want to ask him that question. I think it's inappropriate ... I want to keep it nice and pure. But he certainly wants to cut rates.\"</p><p>\n              The president also told NBC News he had \"not much\" doubt rates would fall. \"We're way high,\" he said. Trump, who has linked his call for lower rates to hopes of financing federal government debt more cheaply and lowering costs for home mortgages, has voiced little concern about inflation that he feels has disappeared.</p><p>\n              However, with the economy currently growing beyond estimates of its potential and inflation showing little recent progress toward the Fed's target, there's no sense of urgency at the central bank to cut rates, particularly not as steeply as Trump or Miran have suggested.</p><p>\n              Trump's State of the Union speech to Congress earlier this week highlighted that paradox, as he trumpeted the good things that he believes have happened and those that are still to come. Many analysts agree a combination of fiscal stimulus in the form of tax cuts, ongoing deregulation, and the loose credit conditions supported by Fed rate cuts last year could spell upside for the economy - and make further reductions in borrowing costs all the less likely.</p><p></p><p>(Reporting by Howard Schneider;Editing by Dan Burns and Paul Simao)</p><p>\n            By Howard Schneider and Ann Saphir</p></div>",
            "link": "https://hk.marketscreener.com/news/odds-of-early-warsh-led-fed-rate-cuts-slide-with-bullish-outlook-ce7e5cd9de8bf521",
            "pub_date": "2026-02-27 04:00:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump tariff turmoil yet to dent emerging countries' growth, EBRD says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-tariff-turmoil-yet-to-dent-emerging-countries-growth-ebrd-says-ce7e5cd9de8bf623",
            "pub_date": "2026-02-27 04:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ocado upbeat on US prospects despite Kroger setback",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ocado-upbeat-on-us-prospects-despite-kroger-setback-ce7e5cd9de8bf626",
            "pub_date": "2026-02-27 04:00:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinjiang Daqo New Energy prelim 2025 net loss at 1.1 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/xinjiang-daqo-new-energy-prelim-2025-net-loss-at-1-1-billion-yuan-ce7e5cd9de8bf624",
            "pub_date": "2026-02-27 04:00:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Saudi Aramco starts production at Jafurah and commences operations at Tanajib gas plant",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/saudi-aramco-starts-production-at-jafurah-and-commences-operations-at-tanajib-gas-plant-ce7e5cd9de88fe2c",
            "pub_date": "2026-02-27 04:00:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSX Raises Quarterly Dividend to $0.14 a Share From $0.13, Payable March 13 to Shareholders of Record as of Feb. 27",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/csx-raises-quarterly-dividend-to-0-14-a-share-from-0-13-payable-march-13-to-shareholders-of-recor-ce7e5cd9de88fe24",
            "pub_date": "2026-02-27 04:00:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google Translate Introduces AI Features",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/google-translate-introduces-ai-features-ce7e5cd9de88ff23",
            "pub_date": "2026-02-27 03:56:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Goolsbee forecasts several more rate cuts this year, but not soon",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Chicago Federal Reserve President Austan Goolsbee said on Thursday his forecast for several interest-rate cuts later this year makes him one of the more \"optimistic\" Fed policymakers, but said he wants the Fed to be \"careful\" in doing so because it could overheat the economy and inflation.   </p><p>\n              \"I have some confidence rates can come down several more times this year in 2026,\" Goolsbee said in an interview on Fox News. \"I just don't want to front load it too much before we actually have the evidence that the inflation is headed\" back down to the Fed's 2% goal. </p><!-- Article --><p></p><p> (Reporting by Ann Saphir; Editing by Chris Reese)</p></div>",
            "link": "https://hk.marketscreener.com/news/fed-s-goolsbee-forecasts-several-more-rate-cuts-this-year-but-not-soon-ce7e5cd9de88ff25",
            "pub_date": "2026-02-27 03:56:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equinix, Canada's CPPIB near deal to buy Nordic data-center operator atNorth, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/equinix-canada-s-cppib-near-deal-to-buy-nordic-data-center-operator-atnorth-bloomberg-news-reports-ce7e5cd9de88f123",
            "pub_date": "2026-02-27 03:56:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell puts some of its Shell Ventures portfolio under review, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shell-puts-some-of-its-shell-ventures-portfolio-under-review-sources-say-ce7e5cd9de88f227",
            "pub_date": "2026-02-27 03:56:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altria Group, Inc. Declares Regular Quarterly Dividend, Payable on April 30, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Altria Group, Inc. declared a regular quarterly dividend of $1.06 per share, payable on April 30, 2026 to shareholders of record as of March 25, 2026. The ex-dividend date is March 25, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/altria-group-inc-declares-regular-quarterly-dividend-payable-on-april-30-2026-ce7e5cd9de88f624",
            "pub_date": "2026-02-27 03:56:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eaton Corporation plc Declares Quarterly Dividend, Payable on March 27, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of Eaton Corporation plc declared a quarterly dividend of $1.10 per ordinary share, an increase of 6% over its last quarterly dividend. The dividend is payable March 27, 2026, to shareholders of record at the close of business on March 10, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/eaton-corporation-plc-declares-quarterly-dividend-payable-on-march-27-2026-ce7e5cd9de88f726",
            "pub_date": "2026-02-27 03:56:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSX Corp. Increases Quarterly Dividend on Common Stock, Payable on March 13, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>CSX Corp. announced on February 26, 2026 that the Company?s Board of Directors approved a $0.14 per share quarterly dividend on the Company?s common stock, payable on March 13, 2026, to shareholders of record at the close of business on February 27, 2026. This reflects 8% increase over the previous dividend payment of $0.13 per share.</p></div>",
            "link": "https://hk.marketscreener.com/news/csx-corp-increases-quarterly-dividend-on-common-stock-payable-on-march-13-2026-ce7e5cd9de88f725",
            "pub_date": "2026-02-27 03:56:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bank of Mexico Raises Forecast for 2026 Economic Growth",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Anthony Harrup </p><br/><p>\n  MEXICO CITY--The Bank of Mexico increased its forecast for economic growth this year following a better-than-expected performance in the fourth quarter of 2025. </p><!-- Article --><p>\n\n  In its quarterly economic report Thursday, the central bank said it expects gross domestic product to expand 1.6% in 2026, up from its previous estimate of 1.1%. The bank left its GDP forecast at 2.0% for 2027. </p><p>\n\n  The central bank said it still sees moderately faster growth, although from a higher base than previously estimated. </p><p>\n\n  In the fourth quarter, Mexico's GDP grew 0.9% seasonally adjusted from the previous quarter, while third-quarter GDP was revised up to a 0.1% expansion from a previously estimated 0.3% contraction. The economy grew 0.6% in 2025. </p><p>\n\n  Private consumption growth is expected to accelerate gradually in 2026, while investment is likely to remain weak, at least until the second half of the year given uncertainty about the trade relationship with the U.S. and the coming review of the U.S.-Mexico Canada Agreement, the Bank of Mexico said. Exports are expected to continue with moderate growth. </p><p>\n\n  The balance of risks for growth remains tilted to the downside, the central bank said. Downside risks include greater trade uncertainty with the U.S., geopolitical conflicts that may hurt global growth and trade, and Mexico's higher tariffs on countries with which it doesn't have a trade agreement. </p><p>\n\n  Upside risks to its forecast include a successful USMCA review, and the 2026 soccer World Cup which Mexico is co-hosting with the U.S. and Canada, and higher-than-expected U.S. economic growth, the central bank said. </p><br/><p>\n  Write to Anthony Harrup at anthony.harrup@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1449ET</p></div>",
            "link": "https://hk.marketscreener.com/news/bank-of-mexico-raises-forecast-for-2026-economic-growth-ce7e5cd9de88f724",
            "pub_date": "2026-02-27 03:56:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros posts 6% fall in quarterly revenue, deal talks in focus",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-posts-6-fall-in-quarterly-revenue-deal-talks-in-focus-ce7e5cd9de89fe2c",
            "pub_date": "2026-02-27 03:56:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Instagram to alert parents on teen suicide searches as UK weighs social media ban",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/instagram-to-alert-parents-on-teen-suicide-searches-as-uk-weighs-social-media-ban-ce7e5cd9de89fe20",
            "pub_date": "2026-02-27 03:56:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berkshire CEO Abel to lay out thinking for a post-Buffett world",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/berkshire-ceo-abel-to-lay-out-thinking-for-a-post-buffett-world-ce7e5cd9de89fe24",
            "pub_date": "2026-02-27 03:56:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nebras Energy announces acquisition of Engie's entire stake in Qatar Power and Ras Girtas Power",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nebras-energy-announces-acquisition-of-engie-s-entire-stake-in-qatar-power-and-ras-girtas-power-ce7e5cd9de89f421",
            "pub_date": "2026-02-27 03:46:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada to Seek Bilateral Talks With Washington on Sectoral Tariffs Alongside Trade-Pact Review",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Paul Vieira </p><br/><p>\n  OTTAWA--The U.S.-led review of the current trilateral North American trade pact will likely incorporate talks on a bilateral deal to ease U.S. tariffs on key industrial sectors, says the Canadian minister in charge of the country's trading relationship with Washington. </p><!-- Article --><p>\n\n  Dominic LeBlanc told a Toronto audience Thursday he expects bilateral talks to unfold alongside a review of the U.S.-Mexico-Canada trade agreement, known as USMCA. LeBlanc cited, for instance, talks last fall between Ottawa and Washington to ease tariffs on key sectors like steel, aluminum and automobiles, which President Trump later terminated due to anger over a Canadian ad that questioned the use of tariffs. </p><p>\n\n  LeBlanc said Canada wants the U.S. to recommit to a trilateral trade pact. Furthermore, he added, \"there have always been bilateral arrangements as between the three countries. That's not new… [And] we need to get a bilateral deal with the United States to take pressure off the sectoral tariffs.\" </p><p>\n\n  The sectoral tariffs, of up to 50%, have squeezed Canada's manufacturing sector. Nonfarm payrolls data issued Thursday indicated that factories shed workers in December, for a year-over-year decline of 2.6%. </p><p>\n\n  LeBlanc said he expects to meet U.S. Trade Representative Jamieson Greer in the coming days. Greer told the Canadian Broadcasting Corp. on Tuesday that Canada will have to live with U.S. tariffs as part of a revised USMCA. </p><p>\n\n  \"If Canada wants to agree that we can have some level of higher tariff on them while they open up their markets to us on things like dairy and other things, then that's a helpful conversation,\" Greer said. </p><p>\n\n  Earlier this week, LeBlanc told Canadian senators he remained optimistic about USMCA's future, noting that the White House provided an exemption to a new U.S. tariff, of up to 15%, so long as the goods entering the U.S. comply with the trilateral pact. The Bank of Canada has labeled the pending review of USMCA as a key risk to the economic outlook. </p><br/><p>\n  Write to Paul Vieira at paul.vieira@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1435ET</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-to-seek-bilateral-talks-with-washington-on-sectoral-tariffs-alongside-trade-pact-review-ce7e5cd9df80f022",
            "pub_date": "2026-02-27 03:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HEDGE FLOW-US software stocks to keep rebounding, says Goldman Sachs prime brokerage note",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hedge-flow-us-software-stocks-to-keep-rebounding-says-goldman-sachs-prime-brokerage-note-ce7e5cd9df80f123",
            "pub_date": "2026-02-27 03:36:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Fields says Van Eck clients hold 5.42% of Gold Fields shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-fields-says-van-eck-clients-hold-5-42-of-gold-fields-shares-ce7e5cd9df80f121",
            "pub_date": "2026-02-27 03:36:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toronto Dominion Bank's quarterly profit rises on higher interest income",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/toronto-dominion-bank-s-quarterly-profit-rises-on-higher-interest-income-ce7e5cd9df80f127",
            "pub_date": "2026-02-27 03:36:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IDC Says Smartphone Market to Fall 12.9% in 2026 Due to Memory Chip Shortage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/idc-says-smartphone-market-to-fall-12-9-in-2026-due-to-memory-chip-shortage-ce7e5cd9df80f126",
            "pub_date": "2026-02-27 03:36:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IDC Says Smartphone Market to Fall 12.9% in 2026 Due to Memory Chip Shortage, Bloomberg Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/idc-says-smartphone-market-to-fall-12-9-in-2026-due-to-memory-chip-shortage-bloomberg-reports-ce7e5cd9df80f222",
            "pub_date": "2026-02-27 03:36:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INDIA BONDS-Indian bonds fall ahead of debt auction, growth data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-bonds-indian-bonds-fall-ahead-of-debt-auction-growth-data-ce7e5cd9df80f221",
            "pub_date": "2026-02-27 03:36:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Trading Lower, Remaining Rangebound Despite Strong Physical Demand",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-trading-lower-remaining-rangebound-despite-strong-physical-demand-ce7e5cd9df80f224",
            "pub_date": "2026-02-27 03:36:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Markets Mostly Fall Intraday as Nvidia Drags Tech Lower",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/equity-markets-mostly-fall-intraday-as-nvidia-drags-tech-lower-ce7e5cd9df80f327",
            "pub_date": "2026-02-27 03:36:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Boehringer Ingelheim Gets FDA Approval for Lung Cancer Treatment",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Katherine Hamilton </p><br/><p>\n  Boehringer Ingelheim received approval from the Food and Drug Administration for Hernexeos as a treatment for lung cancer. </p><!-- Article --><p>\n\n  The newly approved indication was granted under accelerated approval based on objective response rate and duration of response, the biopharmaceutical company said Thursday. </p><p>\n\n   The treatment is for adult patients with advanced non-small cell lung cancer whose tumors have HER2 tyrosine kinase domain activating mutations. </p><p>\n\n  The approval is based on data from a cohort of patients in a Phase 1b trial, which showed an objective response rate of 76%, including 11% of patients with a complete response rate. </p><p>\n\n  Continued approval may be contingent on verification and description of clinical benefit in a confirmatory trial. </p><p>\n\n  Boehringer is currently enrolling patients in a confirmatory Phase 3 trial. </p><br/><p>\n  Write to Katherine Hamilton at katherine.hamilton@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1431ET</p></div>",
            "link": "https://hk.marketscreener.com/news/boehringer-ingelheim-gets-fda-approval-for-lung-cancer-treatment-ce7e5cd9df80f326",
            "pub_date": "2026-02-27 03:36:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran's Araqchi: Soon, in less than a week we will have another round of Iran-U.S. talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-s-araqchi-soon-in-less-than-a-week-we-will-have-another-round-of-iran-u-s-talks-ce7e5cd9df80f325",
            "pub_date": "2026-02-27 03:36:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran foreign minister Araqchi to state TV: It was one of the most serious talks we had with U.S.",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-foreign-minister-araqchi-to-state-tv-it-was-one-of-the-most-serious-talks-we-had-with-u-s-ce7e5cd9df80f42c",
            "pub_date": "2026-02-27 03:36:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YTL Corporation logs qtrly revenue 7.59 bln RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ytl-corporation-logs-qtrly-revenue-7-59-bln-rgt-ce7e5cd9df81fe25",
            "pub_date": "2026-02-27 03:26:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US 7-Year Auction High Yield Falls From Previous Month, Demand Higher",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-7-year-auction-high-yield-falls-from-previous-month-demand-higher-ce7e5cd9df81ff23",
            "pub_date": "2026-02-27 03:26:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Altria Keeps Quarterly Dividend at $1.06 per Share, Payable April 30 to Shareholders of Record on March 25",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/altria-keeps-quarterly-dividend-at-1-06-per-share-payable-april-30-to-shareholders-of-record-on-ma-ce7e5cd9df81ff22",
            "pub_date": "2026-02-27 03:26:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Exchange-Traded Funds Fall as US Equities Drop After Midday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/exchange-traded-funds-fall-as-us-equities-drop-after-midday-ce7e5cd9df81ff21",
            "pub_date": "2026-02-27 03:26:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Head Lower as Chipmakers Slump Following Nvidia's Results",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-head-lower-as-chipmakers-slump-following-nvidia-s-results-ce7e5cd9df81f02d",
            "pub_date": "2026-02-27 03:26:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judge rejects Kenvue bid to dismiss Texas lawsuit over Tylenol's safety",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - A Texas judge on Thursday rejected Kenvue's bid to dismiss a lawsuit by state Attorney General Ken Paxton accusing the company of falsely marketing Tylenol by concealing autism and other risks to children when pregnant women use the popular painkiller.</p><p>\n              Judge LeAnn Rafferty in Panola County, Texas denied Kenvue's request in a one-sentence order. Her reasoning was not immediately available.</p><!-- Article --><p>\n              Kenvue and Paxton's office did not immediately respond to requests for comment.</p><p>\n              Paxton, a Republican, accused Kenvue of violating the state's Deceptive Trade Practices Act by marketing Tylenol as safe for pregnant women.</p><p>\n              His lawsuit repeated the scientifically unproven claim that using Tylenol during pregnancy can cause autism.</p><p>\n              Kenvue argued that the U.S. Food and Drug Administration should determine labeling for acetaminophen products such as Tylenol.</p><p>\n              The Summit, New Jersey-based company also said prohibiting it from marketing Tylenol consistent with \"the current state of the science\" violated its free speech rights under the U.S. Constitution's First Amendment.</p><p>\n               (Reporting by Jonathan Stempel in New York; Additional reporting by Mike Scarcella in Washington, D.C., Editing by Franklin Paul)</p></div>",
            "link": "https://hk.marketscreener.com/news/judge-rejects-kenvue-bid-to-dismiss-texas-lawsuit-over-tylenol-s-safety-ce7e5cd9df81f023",
            "pub_date": "2026-02-27 03:26:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arthur J. Gallagher & Co. acquires Krose GmbH & Co KG",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arthur-j-gallagher-co-acquires-krose-gmbh-co-kg-ce7e5cd9df81f12d",
            "pub_date": "2026-02-27 03:26:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US 7-Year High Yield 3.790% vs 4.018% Previous; Bid/Cover 2.50 vs 2.45 Previous",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-7-year-high-yield-3-790-vs-4-018-previous-bid-cover-2-50-vs-2-45-previous-ce7e5cd9df81f124",
            "pub_date": "2026-02-27 03:21:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toronto Dominion Bank's quarterly profit rises on higher interest income",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/toronto-dominion-bank-s-quarterly-profit-rises-on-higher-interest-income-ce7e5cd9df81f22d",
            "pub_date": "2026-02-27 03:21:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell Offers Additional Financing to Rescue Brazilian JV",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shell-offers-additional-financing-to-rescue-brazilian-jv-ce7e5cd9df81f222",
            "pub_date": "2026-02-27 03:21:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}