{
    "data": [
        {
            "title": "India trade minister: in dialogue with U.S. on trade, is an evolving situation",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-trade-minister-in-dialogue-with-u-s-on-trade-is-an-evolving-situation-ce7e5cdeda89fe2d",
            "pub_date": "2026-02-27 14:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shanghai's most active tin contract rises more than 7%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shanghai-s-most-active-tin-contract-rises-more-than-7-ce7e5cdeda89fe23",
            "pub_date": "2026-02-27 14:50:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re posts 47% rise in 2025 net profit, but life and health weighs",
            "description": "<div class=\"txt-s4 article-text\"><p>FRANKFURT, Feb 27 (Reuters) - Reinsurance company Swiss Re said on Friday its 2025 net profit rose 47%, slightly better than expected, and helped by strength in its property and casualty business.</p><p>\n              The rise came despite a 17% decline in profit at its health and life division, that led it to miss a target for the business. </p><!-- Article --><p>\n              Group net profit of $4.762 billion in the period compares with a profit of $3.238 billion a year earlier. Analysts had expected a profit of $4.724 billion, according to a consensus forecast.</p><p>\n              Swiss Re warned last year that it would miss the full-year profit target in its life and health division after higher-than-expected claims.</p><p>\n              The reinsurer, among the world's largest, had said smaller health portfolios in Australia and elsewhere were underperforming its expectations.</p><p>\n              In October, Swiss Re said it would pause new life and health business in Australia following a sharp rise in claims there after local insurers paid out more in mental health claims and younger people were put on permanent disability.</p><p>\n              Profit in the division was $1.274 billion for 2025, down from $1.532 billion in 2024 and short of a target of about $1.6 billion. </p><p>\n               (Reporting by Tom Sims and Oliver Hirt, Editing by Friederike Heine and Clarence Fernandez)</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-posts-47-rise-in-2025-net-profit-but-life-and-health-weighs-ce7e5cdeda89ff22",
            "pub_date": "2026-02-27 14:50:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF Swings to Net Profit on Accelerated Cost Savings",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Nina Kienle </p><br/><p>\n  Germany's BASF returned to net profit in the fourth quarter, supported by cost savings programs and its streamlining of the organization. </p><!-- Article --><p>\n\n  The German chemical giant on Friday said it swung to a net profit in the fourth quarter of 560 million euros ($660.8 million) from a loss of 786 million euros in the prior-year period. The figure beat analysts' forecast of 285 million euros, according to consensus estimates provided by the company. </p><p>\n\n  Sales for the period declined 5.6% to 14.03 billion euros, compared with analysts' estimated 14.04 billion euros. </p><p>\n\n  The company is undergoing a comprehensive restructuring that involves streamlining its portfolio, selling noncore assets, spinning off its agricultural business and cutting jobs. </p><p>\n\n  BASF also confirmed preliminary figures for 2025. Sales amounted to 59.66 billion euros, down 2.9%. Earnings before interest, taxes, depreciation, amortization and special items fell 9.5% to 6.55 billion euros. </p><p>\n\n  The Ludwigshafen-based company said it accelerated the implementation of its existing cost savings programs. By end-2025 it achieved a total annual cost reduction run rate of around 1.7 billion euros, an increase of 100 million euros compared to its original target. </p><p>\n\n  BASF said it would keep a dividend of 2.25 euros per share. </p><p>\n\n  For 2026, BASF is targeting Ebitda before special items of 6.2 billion euros to 7.0 billion euros, and free cash flow of between 1.5 billion and 2.3 billion euros. </p><br/><p>\n  Write to Nina Kienle at nina.kienle@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0146ET</p></div>",
            "link": "https://hk.marketscreener.com/news/basf-swings-to-net-profit-on-accelerated-cost-savings-ce7e5cdeda89f023",
            "pub_date": "2026-02-27 14:50:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan says output at supergiant oilfield Tengiz nears capacity",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-says-output-at-supergiant-oilfield-tengiz-nears-capacity-ce7e5cdeda89f024",
            "pub_date": "2026-02-27 14:50:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bayer reports results for next generation investigational targeted radionuclide therapy 225ac",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bayer-reports-results-for-next-generation-investigational-targeted-radionuclide-therapy-225ac-ce7e5cdeda89f327",
            "pub_date": "2026-02-27 14:50:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's Politburo Reiterates Pro-Growth Stance",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  China's top leaders reiterated their pro-growth policy stance as they convened a meeting to prepare for March's agenda-setting annual legislative session. </p><p>\n\n  The ruling Communist Party's Politburo, China's highest decision-making body, met Friday to discuss the country's 15th Five-year Plan and a government work report that senior lawmakers are set to review early next month. </p><!-- Article --><p>\n\n  Officials at the gathering reiterated their commitment to a more proactive fiscal policy and a moderately loose monetary policy in 2026. They also pledged to continue expanding domestic demand and optimizing supply. </p><p>\n\n  Friday's meeting came before next week's annual National People's Congress session. Roughly 3,000 representatives, including senior officials, will discuss and approve major economic targets for the world's second-largest economy for 2026 and the next five years. </p><p>\n\n  China is widely expected to set an annual growth target of 4.5%-5.0%, a pragmatic downgrade from its previous \"around 5%\" goal, given that domestic demand remains weak. </p><p>\n\n  Analysts say the tweak to the target, if approved, would make aggressive stimulus measures this year much less likely. </p><p>\n\n  \"Fiscal policy will likely continue to play the leading role, though with a slightly narrower official deficit than in 2025 as trade uncertainty eases and policy makers shift from 'extraordinary' to 'necessary' counter--cyclical support,\" said economists at Standard Chartered in their preview of March's legislature session. </p><p>\n\n  They expect monetary policy to remain measured, focusing on providing ample liquidity rather than large rate cuts. </p><p>\n\n  Write to Singapore editors at singaporeeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0143ET</p></div>",
            "link": "https://hk.marketscreener.com/news/china-s-politburo-reiterates-pro-growth-stance-ce7e5cdeda89f42d",
            "pub_date": "2026-02-27 14:50:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold broadly steady as fall in Treasury yields balances tempered safe-haven bids",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Gold was broadly steady on Friday as a drop in U.S. Treasury yields eased the opportunity cost of holding bullion, while muted safe-haven demand kept prices in check as investors assess U.S-Iran negotiations.</p><p>\n              Spot gold edged up 0.1% at $5,192.19 per ounce by 0543 GMT. The benchmark 10-year yield fell to a three-month low on the day.</p><!-- Article --><p>\n              \"Ten-year U.S. Treasury yields after subtracting inflation, so the real yield, have plummeted and that actually is currently a supporting factor, allowing gold to hold steady regardless of the risk premiums ticking down yesterday after U.S.-Iran talks,\" said Kelvin Wong, a senior market analyst at OANDA.</p><p>\n              Gold was set for its seventh straight month of gains, rising more than 6% in February, a month in which renewed U.S. tariff uncertainty and U.S.-Iran tensions boosted its safe-haven appeal.</p><p>\n              The U.S. and Iran made progress in Geneva on Thursday over Tehran's nuclear programme, mediator Oman said, but hours of negotiation ended without a breakthrough to avert potential U.S. strikes amid a massive military buildup.</p><p>\n              U.S. gold futures for April delivery were up 0.3% at $5,209.20.</p><p>\n              The dollar was set to gain 0.6% for the month, as indications of a more hawkish Federal Reserve made dollar-priced gold more expensive for holders of other currencies. [USD/][US/]</p><p>\n              Fed Chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts, in alignment with President Donald Trump's expectations, could be narrowing amid emerging bullishness about the U.S. economy.</p><p>\n              The number of Americans filing new applications for jobless benefits increased slightly last week, but data showed that the unemployment rate appeared to hold steady in February in a stable labour market.</p><p>\n              Markets currently expect at least three 25-basis-point Fed rate cuts this year, according to CME's FedWatch Tool. [FEDWATCH]</p><p>\n              Spot silver rose 1.6% to $89.73 per ounce, and was headed for a 6.1% gain on the month.</p><p>\n              Spot platinum climbed 5.2% to $2,260.09 per ounce, a four-week high, while palladium gained 2.3% to $1,825.29.</p><p>\n               (Reporting by Ishaan Arora in Bengaluru; Editing by Sumana Nandy, Rashmi Aich and Ronojoy Mazumdar)</p><p>\n            By Ishaan Arora</p></div>",
            "link": "https://hk.marketscreener.com/news/gold-broadly-steady-as-fall-in-treasury-yields-balances-tempered-safe-haven-bids-ce7e5cdeda89f726",
            "pub_date": "2026-02-27 14:50:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EQT Sells Final Shares in Azelis",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Private equity firm EQT has divested its remaining holding of approximately 24 million shares, representing about 10 percent of the capital, in Belgian specialty chemicals company Azelis.\n<br/><br/>\n\nThe sale was completed on February 26.\n<br/><br/>\n\nThe transaction generated a total of around 190 million euros, of which EQT VIII received approximately 173 million euros. This marks the end of more than eight years of ownership in the chemical distributor.\n<br/><br/>\n\nAzelis was listed on the stock exchange in 2021.\n\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/eqt-sells-final-shares-in-azelis-ce7e5cdedb80fe27",
            "pub_date": "2026-02-27 14:50:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ubs Group Ag Announces Changes to Its Board and Committee",
            "description": "<div class=\"txt-s4 article-text\"><p>UBS Group AG announced that William C. Dudley and Jeanette Wong have also decided to step down after seven years on the Board. During this time, Mr. Dudley served on the Corporate Culture and Responsibility Committee, the Risk Committee and the Governance and Nominating Committee. Ms. Wong was a member of the Audit Committee, the Corporate Culture and Responsibility Committee and the Compensation Committee.</p></div>",
            "link": "https://hk.marketscreener.com/news/ubs-group-ag-announces-changes-to-its-board-and-committee-ce7e5cdedb80f32c",
            "pub_date": "2026-02-27 14:41:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CapitaLand Ascendas REIT Acquires Logistics Portfolio in Spain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/capitaland-ascendas-reit-acquires-logistics-portfolio-in-spain-ce7e5cdedb80f624",
            "pub_date": "2026-02-27 14:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EDF Successfully Launches €2.75 Billion Green Bond Issuance",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    EDF has successfully raised €2.75 billion through a four-tranche senior green bond issuance.\n<br/><br/>\n\nThis issuance includes €500 million in bonds with a 2-year maturity and a floating coupon of Euribor 3M + 0.33%, €750 million in bonds with a 5-year maturity and a fixed coupon of 3.0%, €1 billion in bonds with a 12-year maturity and a fixed coupon of 4.0%, and €500 million in bonds with a 20-year maturity and a fixed coupon of 4.5%.\n<br/><br/>\n\nAn amount equal to the net proceeds from the bond issuance will be allocated to the financing and/or refinancing of investments corresponding to the eligible project categories defined in EDF's Green Financing Framework.\n<br/><br/>\n\nThe 2-year and 5-year tranches are dedicated to extending the lifespan of existing nuclear reactors in France, while the 12-year and 20-year tranches will support the construction of the pair of EPR nuclear reactors at Hinkley Point C in the United Kingdom.\n<br/><br/>\n\nWith demand reaching €11 billion, the operation attracted significant investor interest and was oversubscribed by more than four times. This will enable EDF to finance its strategy and contribute to achieving carbon neutrality by 2050.\n<br/><br/>\n\nSettlement and delivery of the bonds is expected to take place on March 4, 2026, at which time the bonds are scheduled to be admitted to trading on the regulated market of Euronext Paris.\n\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/edf-successfully-launches-a-2-75-billion-green-bond-issuance-ce7e5cdedb80f722",
            "pub_date": "2026-02-27 14:41:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Australian shares notch best February since 2019 as earnings outshine rate headwinds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/australian-shares-notch-best-february-since-2019-as-earnings-outshine-rate-headwinds-ce7e5cdedb81f02c",
            "pub_date": "2026-02-27 14:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSL Vacuum Science and Technology Posts 19% Slide in 2025 Profit, Revenue Down 2%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/csl-vacuum-science-and-technology-posts-19-slide-in-2025-profit-revenue-down-2-ce7e5cdedb81f124",
            "pub_date": "2026-02-27 14:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India new issue - Bank of Baroda to issue green infrastructure bonds, bankers say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-new-issue-bank-of-baroda-to-issue-green-infrastructure-bonds-bankers-say-ce7e5cdedb81f223",
            "pub_date": "2026-02-27 14:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re to Initiate $1.5 Billion Share Repurchase Program",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-to-initiate-1-5-billion-share-repurchase-program-ce7e5cdedb81f325",
            "pub_date": "2026-02-27 14:30:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dewa Halts Trading on Dubai Bourse",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dewa-halts-trading-on-dubai-bourse-ce7e5cdedb81f623",
            "pub_date": "2026-02-27 14:30:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re Posts Higher FY25 Net Income; Insurance Revenue Declines",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-posts-higher-fy25-net-income-insurance-revenue-declines-ce7e5cdedb81f723",
            "pub_date": "2026-02-27 14:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC Expects Eni to Sustain Upstream Momentum into FY26; Price Target Up",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rbc-expects-eni-to-sustain-upstream-momentum-into-fy26-price-target-up-ce7e5cdedb81f720",
            "pub_date": "2026-02-27 14:30:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Germany's BASF Posts Higher FY25 Net Income; Sales Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/germany-s-basf-posts-higher-fy25-net-income-sales-down-ce7e5cdedb8efe2d",
            "pub_date": "2026-02-27 14:30:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China needs more proactive and coordinated policies, Politburo says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-needs-more-proactive-and-coordinated-policies-politburo-says-ce7e5cdedb8eff24",
            "pub_date": "2026-02-27 14:30:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UCB SA Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>UCB SA reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was EUR 7,388 million compared to EUR 5,613 million a year ago. Revenue was EUR 7,741 million compared to EUR 6,152 million a year ago.</p><p>Net income was EUR 1,558 million compared to EUR 1,065 million a year ago. Basic earnings per share from continuing operations was EUR 8.2 compared to EUR 5.61 a year ago. Diluted earnings per share from continuing operations was EUR 8.03 compared to EUR 5.48 a year ago.</p><!-- Article --><p>Basic earnings per share was EUR 8.2 compared to EUR 5.61 a year ago. Diluted earnings per share was EUR 8.03 compared to EUR 5.48 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/ucb-sa-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdedb8ef22d",
            "pub_date": "2026-02-27 14:30:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hyundai Motor Group to Invest USD 6.3 Billion in AI Data Centre, Robot Factory in South Korea",
            "description": "<div class=\"txt-s4 article-text\"><p>Hyundai Motor Group and South Korea on February 27, 2026 signed a deal to invest about KRW 9 trillion (USD 6.26 billion) to build an AI data centre, a robot manufacturing factory and other developments in the country's western coastal region. Hyundai Motor Group to invest about KRW 5.8 trillion to build an AI data centre, which will deploy 50,000 graphics processing units. Group will spend KRW 400 billion on a factory to produce robots including wearable ones.</p><p>Group will invest KRW 1 trillion in hydrogen production facilites, another KRW 1.3 trillion in solar generation.</p></div>",
            "link": "https://hk.marketscreener.com/news/hyundai-motor-group-to-invest-usd-6-3-billion-in-ai-data-centre-robot-factory-in-south-korea-ce7e5cdedb8ef225",
            "pub_date": "2026-02-27 14:30:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jeff Bezos' $30 billion AI lab seeks industrial sector deals, FT reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jeff-bezos-30-billion-ai-lab-seeks-industrial-sector-deals-ft-reports-ce7e5cdedb8ef32c",
            "pub_date": "2026-02-27 14:21:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan says Shell will continue development projects",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-says-shell-will-continue-development-projects-ce7e5cdedb8ef322",
            "pub_date": "2026-02-27 14:21:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sunway Healthcare Eyes $4.3 Billion Market Cap in Malaysia's Biggest IPO Since 2017",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Ying Xian Wong </p><br/><p>\n  KUALA LUMPUR, Malaysia--The healthcare arm of Malaysian conglomerate Sunway is eyeing a market capitalization of over $4 billion as its initial public offering gets underway. </p><!-- Article --><p>\n\n  Sunway Healthcare is looking to raise about $736.3 million in what would be Malaysia's biggest IPO in nearly a decade. </p><p>\n\n  The company said in a filing Friday that it is pricing 1.97 billion shares at 1.45 ringgit each, implying a market capitalization of about 16.7 billion ringgit, or $4.30 billion. </p><p>\n\n   That would make it one of the biggest listed healthcare providers in Malaysia. </p><p>\n\n  It plans to issue 575 million new shares and will use the proceeds raised to expand its hospitals, redeem bonds and cover listing expenses. </p><p>\n\n  The Wall Street Journal had previously reported on the healthcare company's plan to go public. </p><p>\n\n  Sunway Healthcare's listing comes amid improving sentiment in Asia markets. </p><p>\n\n  Stock exchanges across the region, including in Japan and South Korea, have been on a run of record highs, and emerging markets are increasingly in favor among investors seeking diversification and cheaper valuations. </p><p>\n\n  Malaysia's benchmark Kuala Lumpur Composite Index is trading at levels not seen since 2019, and its IPO market is gathering steam. </p><p>\n\n  That is helping make businesses more confident about dipping their toes into public markets even as geopolitical uncertainty and volatility persist. </p><p>\n\n   Last year, Malaysia hosted 60 listings--the most in two decades. Momentum has continued this year, with companies in various sectors lining up to go public. </p><p>\n\n  Sunway Healthcare's offering looks set to draw healthy demand. It has secured 20 cornerstone investors, including AHAM Asset Management, AIA, Eastspring Investments and JPMorgan Asset Management (Singapore), which have agreed to subscribe to 97.5% of the allocated shares. </p><p>\n\n  For the company, the IPO is a way to fuel its bid to establish a presence in Southeast Asia, executive chairman Jeffrey Cheah said at a press conference on Friday. </p><p>\n\n  Sunway Healthcare has been expanding its footprint across Malaysia and expects to grow its bed capacity to 3,400 by 2032. It currently has 1,805 licensed beds, said the company's president, Lau Beng Long. </p><p>\n\n  Shares of Sunway Healthcare are set to begin trading on Malaysia's main bourse on March 18. </p><p>\n\n  Maybank Investment Bank and AmInvestment Bank are advising on the offering. </p><br/><p>\n  Write to Ying Xian Wong at yingxian.wong@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0118ET</p></div>",
            "link": "https://hk.marketscreener.com/news/sunway-healthcare-eyes-4-3-billion-market-cap-in-malaysia-s-biggest-ipo-since-2017-ce7e5cdedb8ef320",
            "pub_date": "2026-02-27 14:21:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INDIA RUPEE-India state bank dollar sales anchor rupee, investors await GDP data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-rupee-india-state-bank-dollar-sales-anchor-rupee-investors-await-gdp-data-ce7e5cdedb8ef621",
            "pub_date": "2026-02-27 14:21:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan says Tengiz oil output almost at full capacity",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-says-tengiz-oil-output-almost-at-full-capacity-ce7e5cdedb8ffe24",
            "pub_date": "2026-02-27 14:15:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nio Unit Attracts 2.26 Billion Yuan Investment",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nio-unit-attracts-2-26-billion-yuan-investment-ce7e5cdedb8ff225",
            "pub_date": "2026-02-27 14:16:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poland plans social-media ban for children under 15, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/poland-plans-social-media-ban-for-children-under-15-bloomberg-news-reports-ce7e5cdedb8ff52c",
            "pub_date": "2026-02-27 14:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re FY net income $4.80 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-fy-net-income-4-80-bln-ce7e5cdedb8ff62c",
            "pub_date": "2026-02-27 14:10:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan energy minister says Shell told the ministry it will continue its development in Kazakhstan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-energy-minister-says-shell-told-the-ministry-it-will-continue-its-development-in-kazakhst-ce7e5cdedb8ff622",
            "pub_date": "2026-02-27 14:10:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stellantis Eyes Expansion of JV With Leapmotor to Tap Advanced EV Tech",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/stellantis-eyes-expansion-of-jv-with-leapmotor-to-tap-advanced-ev-tech-ce7e5cdedb8ff626",
            "pub_date": "2026-02-27 14:10:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF says 2026 adjusted profit could slip or gain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-says-2026-adjusted-profit-could-slip-or-gain-ce7e5cdedb8ff727",
            "pub_date": "2026-02-27 14:05:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Galderma says Nemluvio shows long-term control in prurigo nodularis up to 3 years",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/galderma-says-nemluvio-shows-long-term-control-in-prurigo-nodularis-up-to-3-years-ce7e5cdedb8ff726",
            "pub_date": "2026-02-27 14:05:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-Europe policymakers set for make or break decisions on industrial heat: Maguire",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-europe-policymakers-set-for-make-or-break-decisions-on-industrial-heat-maguire-ce7e5cdedb8ff724",
            "pub_date": "2026-02-27 14:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada's Carney visits India to boost trade, mend ties on latest 'middle powers' trip",
            "description": "<div class=\"txt-s4 article-text\"><p>OTTAWA, Feb 27 (Reuters) - Canadian Prime Minister Mark Carney arrives in Mumbai on Friday on his first official visit to India, hoping to reset the sometimes fractious relationship with the world's most populous country as he seeks new global alliances.</p><p>\n              Carney will meet business leaders in Mumbai and start talks on a comprehensive trade agreement, which is expected to be completed by November, his foreign minister told Reuters. He is scheduled to travel on to New Delhi for talks with Prime Minister Narendra Modi.</p><!-- Article --><p>\n              Carney has sought closer ties with China and Middle Eastern countries as well as India, as he tries to reduce Canada's dependence on the United States and forge a new global trading order led by what he calls middle-power countries.</p><p>\n              Relations between Canada and India soured several years ago after explosive allegations by then-Prime Minister Justin Trudeau that the Indian government was linked to the assassination of a Canadian citizen who was also a prominent Sikh separatist. India has repeatedly denied any such links.</p><p>\n              Unlike several previous Canadian leaders, including Trudeau, Carney will not make a stop in India's Punjab region, a major origin of Indian migration to Canada. Sikh separatists have pushed for an independent state in the Punjab and a visit there risks irking Carney's Indian hosts.</p><p>\n              Analysts say the move signals a more pragmatic foreign policy that aims to wean Canada away from the United States, spurred by President Donald Trump's tariff war and annexation threats.</p><p>\n              \"The Prime Minister has a laser-beam focus on attracting capital to Canada, not playing to the Indian diaspora back home,\" said Goldy Hyder, president of the Business Council of Canada.</p><p>\n              \"This is a business trip aimed at growing the economy to give Canadians more economic sovereignty,\" he said, calling the approach a significant shift from the Trudeau era.</p><p>\n              Last month, the European Union and India reached a landmark trade deal to cut tariffs on most goods, raising expectations that India might soon sign a similar deal with Canada. India's high commissioner to Canada told Reuters in January that Carney will likely sign a 10-year, C$2.8 billion ($2.05 billion) uranium supply deal and smaller agreements on oil and gas, the environment, artificial intelligence, quantum computing, education and culture.</p><p><b>NO BHANGRA DANCING</b></p><p>\n              Trudeau was mocked for wearing overly elaborate Indian outfits during a 2018 visit and was publicly criticized by Prime Minister Narendra Modi for allowing \"anti-India activities,\" a reference to vocal Sikh separatists living in Canada.</p><p>\n              \"Carney has a sense of gravitas and is very strategic,\" said Partha Mohanram, a management professor at the University of Toronto. \"He's not going to do a bhangra dance over there.\"</p><p>\n              But Carney's approach to India has drawn criticism from some Sikh groups in Canada.</p><p>\n              \"The Carney government has failed to hold India accountable or to create any meaningful safeguards to ensure that Sikh Canadians are protected from foreign interference and transnational repression,\" the World Sikh Organization of Canada said in a statement on Wednesday.</p><p>\n              Canadian Foreign Minister Anita Anand told Reuters there have been conversations between Canada and India at the highest levels regarding concerns about criminal activity with possible links to India. Anand said there were new measures to track criminal money, digital threats and surveillance of diaspora communities.</p><p>\n              Anand said Carney's foreign policy was driven by the reordering of global trading relationships and that \"no country will ever have a pass in terms of the domestic safety and security of this country.\"</p><p><b>FENDING OFF AMERICAN HEGEMONY</b></p><p>\n              After India, Carney will visit Australia, where he will address parliament and discuss military, trade and defense links. En route back to Ottawa, Carney will meet Japanese Prime Minister Sanae Takaichi and talk about boosting trade in autos, energy and critical minerals.</p><p>\n              Jonathan Kalles, a former adviser to ex-Prime Minister Trudeau, said Carney's agenda was defined by the new geopolitical order he outlined in his Davos speech, where he called for middle powers to adopt a \"principled and pragmatic\" path to fend off American hegemony.</p><p>\n              \"When the world is nice and calm, you can try to change the world and talk about virtues,\" he said. \"But when you're living in uncertain times, the Prime Minister's job is to advance the country's interests and Mark Carney knows very well his job is to diversify our trade and strengthen the economy.\"</p><p>\n              ($1 = 1.3684 Canadian dollars)</p><p></p><p> (Reporting by Maria Cheng; Editing by Caroline Stauffer and Edmund Klamann)</p><p>\n            By Maria Cheng</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-s-carney-visits-india-to-boost-trade-mend-ties-on-latest-middle-powers-trip-ce7e5cdedb8cfe2c",
            "pub_date": "2026-02-27 14:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Under siege from politics, central bankers fight back - at a cost",
            "description": "<div class=\"txt-s4 article-text\"><p>FRANKFURT/WASHINGTON/TOKYO, Feb 27 (Reuters) - Under pressure from politicians, central bankers are fighting back. However, their efforts are exposing a delicate trade-off: defending independence may preserve inflation credibility, but at the cost of appearing political themselves.  </p><p>\n              Mainstream centrist politicians the world over are facing an onslaught from less conventional, often populist rivals who have their own ideas about what central banks should do, and who should run them.  </p><!-- Article --><p>\n              In the United States, the pushback has meant digging in. Federal Reserve Chair Jerome Powell has weathered repeated attacks from U.S. President Donald Trump, who accused him of undermining growth by keeping interest rates too high.</p><p>\n              In Europe, resistance takes a more paradoxical form: stepping down early to deny eurosceptic leaders the chance to influence who runs the central bank.</p><p>\n              Bank of France Governor François Villeroy de Galhau will leave months before elections expected to be won by the far right. Villeroy insisted this was his decision but a source said the move was driven partly by a desire to preserve continuity at the bank.</p><p>\n              European Central Bank President Christine Lagarde, also French, is reportedly considering a similar move. She has said her \"baseline\" is to complete her term but has not excluded the possibility of an early exit.</p><p>\n              The Bank of Japan has repeated its pledge to keep raising rates even after Prime Minister Sanae Takaichi appointed two dovish economists to the BOJ's board, seen as an attempt to stop hikes.</p><p>\n              With sovereign debt at record highs, central bankers fear sound monetary policy will be sacrificed at the altar of cheap borrowing as governments demand lower interest rates.</p><p>\n              At stake is their ability to control inflation -- and the credibility rebuilt since the price shocks of the 1970s. Turkey and Argentina show what can happen when governments force monetary policy into submission: inflation spikes, investors flee, trust evaporates.</p><p>\n              Yet in pushing back, central bankers risk appearing political themselves.</p><p>\n              \"Central bankers are being drawn into a fight between the establishment and populists. They're being drawn into the ring and they should try to do everything they can to stay out of it,\" said Carsten Brzeski, global head of macro at ING.</p><p><b>CRISES PUSH CENTRAL BANKS INTO SPOTLIGHT </b></p><p>\n              The pushback should not come as a surprise. ECB founding president Wim Duisenberg once likened a good central banker to whipped cream: \"the more you whip it, the harder it gets.\"</p><p>\n              His own early resignation in 2003, part of a deal between Germany and France to hand the baton to Jean-Claude Trichet, showed that, even if appointments are political, the job needn't become so.</p><p>\n              Contemporary models of central bank governance assume officials will act independently once in office, regardless of who installed them.</p><p>\n              But the past decade has blurred that line. In Japan, former PM Shinzo Abe installed Haruhiko Kuroda at the BOJ to fuel his stimulus agenda.</p><p>\n              Massive bond-buying across advanced economies -- encouraged by governments during the global financial crisis and the pandemic -- also brought central banks closer to fiscal policy, a precedent France's far-right now cites approvingly.</p><p>\n              Public confidence wobbled after the post-COVID inflation surge. Limited forays into climate policy -- particularly at the ECB and Bank of England -- fed accusations of mission creep.</p><p>\n              Jakob de Haan, a professor of political economy at the University of Groningen, said central banks \"increasingly have moved beyond their mandate\", raising questions about their own independence.</p><p><b>INDEPENDENCE VS PUBLIC ACCOUNTABILITY    </b></p><p>\n              Central banks are insulated from day-to-day politics, often via legal provisions such as the European treaties governing the ECB.</p><p>\n              But they are not shielded from democratic expectations. They answer to Congress in the U.S. and the European Parliament in the euro zone -- and to public perceptions.</p><p>\n              This is where their rearguard action may expose a flank.</p><p>\n              \"I don't see any process fouls here,\" said Nathan Sheets, global chief economist at Citi. \"But it does cause one to reflect on whether we have that balance between independence and accountability right.\"</p><p>\n              Resignations by Villeroy and, potentially, Lagarde in France could be seen as attempts to give President Emmanuel Macron one last say over appointments before voters possibly shift to the Rassemblement National.</p><p>\n              Economists warn this may backfire.</p><p>\n              \"The manoeuvre could slightly compromise the independence of the central bank itself,\" said Marco Valli, chief European economist at UniCredit.</p><p><b>MARKETS MAY HAVE FINAL WORD</b></p><p>\n              Government debt may be the fiercest arena.</p><p>\n              The U.S. government must refinance nearly a third of its $36 trillion debt this year. How the Fed under Trump's appointee Kevin Warsh manages rates and its $6.6 trillion balance sheet will be crucial.</p><p>\n              Europe faces rising defence spending atop already-high debt in Italy and France. French far-right leader Jordan Bardella has called for opening discussions with the ECB over financing.</p><p>\n              \"From a political point of view, the best way to finance it is to be able to count on the central bank's printing press,\" said Enrico Colombatto, a professor emeritus of economics at the University of Turin.</p><p>\n              Markets, though, may have the final word. Central banks can suppress bond yields but not stop investors fleeing -- weakening currencies and pushing up inflation.</p><p>\n              Japan shows fears of market bumps can be central bankers' best allies. </p><p>\n              \"The relentless yen slump taught the administration a lesson on how brutal markets could become if it tried to push back against the BOJ's interest rate hikes,\" former BOJ board member Makoto Sakurai said. \"Market forces helped the BOJ fend off political pressure.\"</p><p></p><p> (Additional reporting by Bill Schomberg in London; Editing by Toby Chopra)</p><p>\n            By Francesco Canepa, Howard Schneider and Leika Kihara</p></div>",
            "link": "https://hk.marketscreener.com/news/under-siege-from-politics-central-bankers-fight-back-at-a-cost-ce7e5cdedb8cfe23",
            "pub_date": "2026-02-27 14:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bedrooms for sale highlight the depths of Europe's housing crisis",
            "description": "<div class=\"txt-s4 article-text\"><p>MADRID/LONDON, Feb 27(Reuters) - A Spanish startup is selling bedrooms in flats shared with strangers, a British developer offers mortgages for friends willing to buy together, while stakes in rental properties help some tenants cover their housing costs.</p><p>\n              Such unconventional arrangements highlight the lengths some young Europeans are ready to go to cope with a housing crisis that has hit them the hardest.</p><!-- Article --><p>\n              Over the past decade, house prices in the European Union grew 10% faster than incomes, according to the European Commission research, and all metrics show that the young feel the squeeze the most. </p><p>\n              And while plans announced by the EU executive in December to make housing more affordable have yet to take shape, some businesses offer novel ways of getting a foothold in the increasingly challenging property market.</p><p>\n              In Spain, where housing shortages in Madrid, Barcelona and other major cities were made worse by a surge in short-term holiday rentals, Habitacion.com offers individual rooms for up to 80,000 euros ($95,200), about a third of what a one-bedroom flat would fetch in similar locations.</p><p>\n              It said it sold 200 rooms last year and has a waiting list of 32,000, with properties in seven cities listed on its website.</p><p><b>OFFER FOR SINGLES ON TIGHT BUDGETS</b></p><p>\n              Founder and CEO Oriol Valls says his firm offers a solution to the squeeze on finances - official data show average Spanish monthly salaries rose 26% over the past decade and property prices 81% - and changing life circumstances. </p><p>\n              \"People no longer get married, or if they do, they get married but don't have children ... or they do it much later,\" he said. \"They require much smaller living spaces that are also much more affordable.\" </p><p>\n              Customers must fill compatibility questionnaires, which cover questions whether they have partners or wash the dishes after meals, to be paired with co-owners or renters. They also need to use personal loans rather than mortgages and have to go through the company if they want to resell.</p><p>\n              Alvarez, a prospective buyer who declined to give his first name, said Habitacion.com offered to help him get a personal 10-year loan from a regional bank at 6% interest, twice the regular mortgage average, but in the end could not find any rooms in Madrid where he lives.</p><p>\n              He also said the scheme, while a good option in general for young people with not enough savings, \"loses all appeal if I can't live with my partner.\"</p><p>\n              Meanwhile, in London, developer Fairview has a \"Buddy Up\" scheme, offering to connect friends with a broker and solicitor and covering up to 2,000 pounds ($2,726) toward legal fees if they decide to buy property together in the capital or its surroundings.</p><p>\n              Banks in Britain, France, Germany and Italy are also reviving low or zero-deposit mortgages that vanished after the 2008 financial crisis. They come with higher costs and typically require applicants to present high, stable income, but while still rare offer an option for those unable to save up for a downpayment but desperate for a home of their own. </p><p>\n              Natalie and Martin Walker from West Yorkshire in northern England say an eviction notice served when their baby was one month old drove them to take up a zero-deposit mortgage last year to buy a house after four years of renting.</p><p>\n              \"The sense of stability that it brings you, that's the biggest delight for me,\" said Natalie.</p><p>\n              Back in Spain, Carlos Sempere, a 36-year-old industrial engineer who rents a flat in central Madrid, where properties are selling for around 1 million euros - far out of his reach - bought a rental property in southern Spain instead via an investment company PropHero. </p><p>\n              \"Either it helps me pay the rent, or I sell it in the future,\" he said.</p><p>\n              For those who cannot afford a whole property, PropHero also offers stakes in rental apartment buildings in Spain and Ireland for as little as 20,000 euros. </p><p>\n              Ultimately, it is the dire market conditions that make prospective first-time buyers look past legal complexities and cost of new schemes, says real estate consultant and head of alternative investments at AIRE Partners Patricio Palomar.</p><p>\n              \"All these housing solutions serve to show how people are getting poorer.\" </p><p></p><p> (Reporting by Corina Pons in Madrid and Iain Withers in London; editing by Charlie Devereux and Tomasz Janowski)</p></div>",
            "link": "https://hk.marketscreener.com/news/bedrooms-for-sale-highlight-the-depths-of-europe-s-housing-crisis-ce7e5cdedb8cfe22",
            "pub_date": "2026-02-27 14:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea says won currency has also become convertible in Japan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-says-won-currency-has-also-become-convertible-in-japan-ce7e5cdedb8cff22",
            "pub_date": "2026-02-27 14:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}