{
    "data": [
        {
            "title": "BASF says 2026 adjusted profit could slip or gain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-says-2026-adjusted-profit-could-slip-or-gain-ce7e5cdedb8ff727",
            "pub_date": "2026-02-27 14:05:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Galderma says Nemluvio shows long-term control in prurigo nodularis up to 3 years",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/galderma-says-nemluvio-shows-long-term-control-in-prurigo-nodularis-up-to-3-years-ce7e5cdedb8ff726",
            "pub_date": "2026-02-27 14:05:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-Europe policymakers set for make or break decisions on industrial heat: Maguire",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-europe-policymakers-set-for-make-or-break-decisions-on-industrial-heat-maguire-ce7e5cdedb8ff724",
            "pub_date": "2026-02-27 14:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada's Carney visits India to boost trade, mend ties on latest 'middle powers' trip",
            "description": "<div class=\"txt-s4 article-text\"><p>OTTAWA, Feb 27 (Reuters) - Canadian Prime Minister Mark Carney arrives in Mumbai on Friday on his first official visit to India, hoping to reset the sometimes fractious relationship with the world's most populous country as he seeks new global alliances.</p><p>\n              Carney will meet business leaders in Mumbai and start talks on a comprehensive trade agreement, which is expected to be completed by November, his foreign minister told Reuters. He is scheduled to travel on to New Delhi for talks with Prime Minister Narendra Modi.</p><!-- Article --><p>\n              Carney has sought closer ties with China and Middle Eastern countries as well as India, as he tries to reduce Canada's dependence on the United States and forge a new global trading order led by what he calls middle-power countries.</p><p>\n              Relations between Canada and India soured several years ago after explosive allegations by then-Prime Minister Justin Trudeau that the Indian government was linked to the assassination of a Canadian citizen who was also a prominent Sikh separatist. India has repeatedly denied any such links.</p><p>\n              Unlike several previous Canadian leaders, including Trudeau, Carney will not make a stop in India's Punjab region, a major origin of Indian migration to Canada. Sikh separatists have pushed for an independent state in the Punjab and a visit there risks irking Carney's Indian hosts.</p><p>\n              Analysts say the move signals a more pragmatic foreign policy that aims to wean Canada away from the United States, spurred by President Donald Trump's tariff war and annexation threats.</p><p>\n              \"The Prime Minister has a laser-beam focus on attracting capital to Canada, not playing to the Indian diaspora back home,\" said Goldy Hyder, president of the Business Council of Canada.</p><p>\n              \"This is a business trip aimed at growing the economy to give Canadians more economic sovereignty,\" he said, calling the approach a significant shift from the Trudeau era.</p><p>\n              Last month, the European Union and India reached a landmark trade deal to cut tariffs on most goods, raising expectations that India might soon sign a similar deal with Canada. India's high commissioner to Canada told Reuters in January that Carney will likely sign a 10-year, C$2.8 billion ($2.05 billion) uranium supply deal and smaller agreements on oil and gas, the environment, artificial intelligence, quantum computing, education and culture.</p><p><b>NO BHANGRA DANCING</b></p><p>\n              Trudeau was mocked for wearing overly elaborate Indian outfits during a 2018 visit and was publicly criticized by Prime Minister Narendra Modi for allowing \"anti-India activities,\" a reference to vocal Sikh separatists living in Canada.</p><p>\n              \"Carney has a sense of gravitas and is very strategic,\" said Partha Mohanram, a management professor at the University of Toronto. \"He's not going to do a bhangra dance over there.\"</p><p>\n              But Carney's approach to India has drawn criticism from some Sikh groups in Canada.</p><p>\n              \"The Carney government has failed to hold India accountable or to create any meaningful safeguards to ensure that Sikh Canadians are protected from foreign interference and transnational repression,\" the World Sikh Organization of Canada said in a statement on Wednesday.</p><p>\n              Canadian Foreign Minister Anita Anand told Reuters there have been conversations between Canada and India at the highest levels regarding concerns about criminal activity with possible links to India. Anand said there were new measures to track criminal money, digital threats and surveillance of diaspora communities.</p><p>\n              Anand said Carney's foreign policy was driven by the reordering of global trading relationships and that \"no country will ever have a pass in terms of the domestic safety and security of this country.\"</p><p><b>FENDING OFF AMERICAN HEGEMONY</b></p><p>\n              After India, Carney will visit Australia, where he will address parliament and discuss military, trade and defense links. En route back to Ottawa, Carney will meet Japanese Prime Minister Sanae Takaichi and talk about boosting trade in autos, energy and critical minerals.</p><p>\n              Jonathan Kalles, a former adviser to ex-Prime Minister Trudeau, said Carney's agenda was defined by the new geopolitical order he outlined in his Davos speech, where he called for middle powers to adopt a \"principled and pragmatic\" path to fend off American hegemony.</p><p>\n              \"When the world is nice and calm, you can try to change the world and talk about virtues,\" he said. \"But when you're living in uncertain times, the Prime Minister's job is to advance the country's interests and Mark Carney knows very well his job is to diversify our trade and strengthen the economy.\"</p><p>\n              ($1 = 1.3684 Canadian dollars)</p><p></p><p> (Reporting by Maria Cheng; Editing by Caroline Stauffer and Edmund Klamann)</p><p>\n            By Maria Cheng</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-s-carney-visits-india-to-boost-trade-mend-ties-on-latest-middle-powers-trip-ce7e5cdedb8cfe2c",
            "pub_date": "2026-02-27 14:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Under siege from politics, central bankers fight back - at a cost",
            "description": "<div class=\"txt-s4 article-text\"><p>FRANKFURT/WASHINGTON/TOKYO, Feb 27 (Reuters) - Under pressure from politicians, central bankers are fighting back. However, their efforts are exposing a delicate trade-off: defending independence may preserve inflation credibility, but at the cost of appearing political themselves.  </p><p>\n              Mainstream centrist politicians the world over are facing an onslaught from less conventional, often populist rivals who have their own ideas about what central banks should do, and who should run them.  </p><!-- Article --><p>\n              In the United States, the pushback has meant digging in. Federal Reserve Chair Jerome Powell has weathered repeated attacks from U.S. President Donald Trump, who accused him of undermining growth by keeping interest rates too high.</p><p>\n              In Europe, resistance takes a more paradoxical form: stepping down early to deny eurosceptic leaders the chance to influence who runs the central bank.</p><p>\n              Bank of France Governor François Villeroy de Galhau will leave months before elections expected to be won by the far right. Villeroy insisted this was his decision but a source said the move was driven partly by a desire to preserve continuity at the bank.</p><p>\n              European Central Bank President Christine Lagarde, also French, is reportedly considering a similar move. She has said her \"baseline\" is to complete her term but has not excluded the possibility of an early exit.</p><p>\n              The Bank of Japan has repeated its pledge to keep raising rates even after Prime Minister Sanae Takaichi appointed two dovish economists to the BOJ's board, seen as an attempt to stop hikes.</p><p>\n              With sovereign debt at record highs, central bankers fear sound monetary policy will be sacrificed at the altar of cheap borrowing as governments demand lower interest rates.</p><p>\n              At stake is their ability to control inflation -- and the credibility rebuilt since the price shocks of the 1970s. Turkey and Argentina show what can happen when governments force monetary policy into submission: inflation spikes, investors flee, trust evaporates.</p><p>\n              Yet in pushing back, central bankers risk appearing political themselves.</p><p>\n              \"Central bankers are being drawn into a fight between the establishment and populists. They're being drawn into the ring and they should try to do everything they can to stay out of it,\" said Carsten Brzeski, global head of macro at ING.</p><p><b>CRISES PUSH CENTRAL BANKS INTO SPOTLIGHT </b></p><p>\n              The pushback should not come as a surprise. ECB founding president Wim Duisenberg once likened a good central banker to whipped cream: \"the more you whip it, the harder it gets.\"</p><p>\n              His own early resignation in 2003, part of a deal between Germany and France to hand the baton to Jean-Claude Trichet, showed that, even if appointments are political, the job needn't become so.</p><p>\n              Contemporary models of central bank governance assume officials will act independently once in office, regardless of who installed them.</p><p>\n              But the past decade has blurred that line. In Japan, former PM Shinzo Abe installed Haruhiko Kuroda at the BOJ to fuel his stimulus agenda.</p><p>\n              Massive bond-buying across advanced economies -- encouraged by governments during the global financial crisis and the pandemic -- also brought central banks closer to fiscal policy, a precedent France's far-right now cites approvingly.</p><p>\n              Public confidence wobbled after the post-COVID inflation surge. Limited forays into climate policy -- particularly at the ECB and Bank of England -- fed accusations of mission creep.</p><p>\n              Jakob de Haan, a professor of political economy at the University of Groningen, said central banks \"increasingly have moved beyond their mandate\", raising questions about their own independence.</p><p><b>INDEPENDENCE VS PUBLIC ACCOUNTABILITY    </b></p><p>\n              Central banks are insulated from day-to-day politics, often via legal provisions such as the European treaties governing the ECB.</p><p>\n              But they are not shielded from democratic expectations. They answer to Congress in the U.S. and the European Parliament in the euro zone -- and to public perceptions.</p><p>\n              This is where their rearguard action may expose a flank.</p><p>\n              \"I don't see any process fouls here,\" said Nathan Sheets, global chief economist at Citi. \"But it does cause one to reflect on whether we have that balance between independence and accountability right.\"</p><p>\n              Resignations by Villeroy and, potentially, Lagarde in France could be seen as attempts to give President Emmanuel Macron one last say over appointments before voters possibly shift to the Rassemblement National.</p><p>\n              Economists warn this may backfire.</p><p>\n              \"The manoeuvre could slightly compromise the independence of the central bank itself,\" said Marco Valli, chief European economist at UniCredit.</p><p><b>MARKETS MAY HAVE FINAL WORD</b></p><p>\n              Government debt may be the fiercest arena.</p><p>\n              The U.S. government must refinance nearly a third of its $36 trillion debt this year. How the Fed under Trump's appointee Kevin Warsh manages rates and its $6.6 trillion balance sheet will be crucial.</p><p>\n              Europe faces rising defence spending atop already-high debt in Italy and France. French far-right leader Jordan Bardella has called for opening discussions with the ECB over financing.</p><p>\n              \"From a political point of view, the best way to finance it is to be able to count on the central bank's printing press,\" said Enrico Colombatto, a professor emeritus of economics at the University of Turin.</p><p>\n              Markets, though, may have the final word. Central banks can suppress bond yields but not stop investors fleeing -- weakening currencies and pushing up inflation.</p><p>\n              Japan shows fears of market bumps can be central bankers' best allies. </p><p>\n              \"The relentless yen slump taught the administration a lesson on how brutal markets could become if it tried to push back against the BOJ's interest rate hikes,\" former BOJ board member Makoto Sakurai said. \"Market forces helped the BOJ fend off political pressure.\"</p><p></p><p> (Additional reporting by Bill Schomberg in London; Editing by Toby Chopra)</p><p>\n            By Francesco Canepa, Howard Schneider and Leika Kihara</p></div>",
            "link": "https://hk.marketscreener.com/news/under-siege-from-politics-central-bankers-fight-back-at-a-cost-ce7e5cdedb8cfe23",
            "pub_date": "2026-02-27 14:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bedrooms for sale highlight the depths of Europe's housing crisis",
            "description": "<div class=\"txt-s4 article-text\"><p>MADRID/LONDON, Feb 27(Reuters) - A Spanish startup is selling bedrooms in flats shared with strangers, a British developer offers mortgages for friends willing to buy together, while stakes in rental properties help some tenants cover their housing costs.</p><p>\n              Such unconventional arrangements highlight the lengths some young Europeans are ready to go to cope with a housing crisis that has hit them the hardest.</p><!-- Article --><p>\n              Over the past decade, house prices in the European Union grew 10% faster than incomes, according to the European Commission research, and all metrics show that the young feel the squeeze the most. </p><p>\n              And while plans announced by the EU executive in December to make housing more affordable have yet to take shape, some businesses offer novel ways of getting a foothold in the increasingly challenging property market.</p><p>\n              In Spain, where housing shortages in Madrid, Barcelona and other major cities were made worse by a surge in short-term holiday rentals, Habitacion.com offers individual rooms for up to 80,000 euros ($95,200), about a third of what a one-bedroom flat would fetch in similar locations.</p><p>\n              It said it sold 200 rooms last year and has a waiting list of 32,000, with properties in seven cities listed on its website.</p><p><b>OFFER FOR SINGLES ON TIGHT BUDGETS</b></p><p>\n              Founder and CEO Oriol Valls says his firm offers a solution to the squeeze on finances - official data show average Spanish monthly salaries rose 26% over the past decade and property prices 81% - and changing life circumstances. </p><p>\n              \"People no longer get married, or if they do, they get married but don't have children ... or they do it much later,\" he said. \"They require much smaller living spaces that are also much more affordable.\" </p><p>\n              Customers must fill compatibility questionnaires, which cover questions whether they have partners or wash the dishes after meals, to be paired with co-owners or renters. They also need to use personal loans rather than mortgages and have to go through the company if they want to resell.</p><p>\n              Alvarez, a prospective buyer who declined to give his first name, said Habitacion.com offered to help him get a personal 10-year loan from a regional bank at 6% interest, twice the regular mortgage average, but in the end could not find any rooms in Madrid where he lives.</p><p>\n              He also said the scheme, while a good option in general for young people with not enough savings, \"loses all appeal if I can't live with my partner.\"</p><p>\n              Meanwhile, in London, developer Fairview has a \"Buddy Up\" scheme, offering to connect friends with a broker and solicitor and covering up to 2,000 pounds ($2,726) toward legal fees if they decide to buy property together in the capital or its surroundings.</p><p>\n              Banks in Britain, France, Germany and Italy are also reviving low or zero-deposit mortgages that vanished after the 2008 financial crisis. They come with higher costs and typically require applicants to present high, stable income, but while still rare offer an option for those unable to save up for a downpayment but desperate for a home of their own. </p><p>\n              Natalie and Martin Walker from West Yorkshire in northern England say an eviction notice served when their baby was one month old drove them to take up a zero-deposit mortgage last year to buy a house after four years of renting.</p><p>\n              \"The sense of stability that it brings you, that's the biggest delight for me,\" said Natalie.</p><p>\n              Back in Spain, Carlos Sempere, a 36-year-old industrial engineer who rents a flat in central Madrid, where properties are selling for around 1 million euros - far out of his reach - bought a rental property in southern Spain instead via an investment company PropHero. </p><p>\n              \"Either it helps me pay the rent, or I sell it in the future,\" he said.</p><p>\n              For those who cannot afford a whole property, PropHero also offers stakes in rental apartment buildings in Spain and Ireland for as little as 20,000 euros. </p><p>\n              Ultimately, it is the dire market conditions that make prospective first-time buyers look past legal complexities and cost of new schemes, says real estate consultant and head of alternative investments at AIRE Partners Patricio Palomar.</p><p>\n              \"All these housing solutions serve to show how people are getting poorer.\" </p><p></p><p> (Reporting by Corina Pons in Madrid and Iain Withers in London; editing by Charlie Devereux and Tomasz Janowski)</p></div>",
            "link": "https://hk.marketscreener.com/news/bedrooms-for-sale-highlight-the-depths-of-europe-s-housing-crisis-ce7e5cdedb8cfe22",
            "pub_date": "2026-02-27 14:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea says won currency has also become convertible in Japan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-says-won-currency-has-also-become-convertible-in-japan-ce7e5cdedb8cff22",
            "pub_date": "2026-02-27 14:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF 2026 outlook: EBITDA before special items of between EUR6.2 billion and EUR7.0 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-2026-outlook-ebitda-before-special-items-of-between-eur6-2-billion-and-eur7-0-billion-ce7e5cdedb8cff21",
            "pub_date": "2026-02-27 14:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF: We do not expect a meaningful market upswing or a significant easing of geopolitical tension in the near term",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-we-do-not-expect-a-meaningful-market-upswing-or-a-significant-easing-of-geopolitical-tension-i-ce7e5cdedb8cff25",
            "pub_date": "2026-02-27 14:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF: Slightly lower 2026 earnings expected at materials and agricultural solutions segments due to currency effects",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-slightly-lower-2026-earnings-expected-at-materials-and-agricultural-solutions-segments-due-to-ce7e5cdedb8cf020",
            "pub_date": "2026-02-27 14:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF: 2026 free cash flow is expected to be between EUR1.5 billion and EUR2.3 billion, up from EUR1.3 billion in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/basf-2026-free-cash-flow-is-expected-to-be-between-eur1-5-billion-and-eur2-3-billion-up-from-eur1-ce7e5cdedb8cf027",
            "pub_date": "2026-02-27 14:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS nominates Agustín Carstens and Luca Maestri as new board members",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ubs-nominates-agust-n-carstens-and-luca-maestri-as-new-board-members-ce7e5cdedb8dff20",
            "pub_date": "2026-02-27 13:56:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSPC Pharmaceutical to Sell 30% Stake in Guoxin Huijin for 230 Million Yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cspc-pharmaceutical-to-sell-30-stake-in-guoxin-huijin-for-230-million-yuan-ce7e5cdedb8dff26",
            "pub_date": "2026-02-27 13:56:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seatrium Completes Wind Turbine Installation Vessel Delivery",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/seatrium-completes-wind-turbine-installation-vessel-delivery-ce7e5cdedb8df22c",
            "pub_date": "2026-02-27 13:50:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EuroEyes International to Acquire Fyeo Europe in HK$1.23 Billion Deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/euroeyes-international-to-acquire-fyeo-europe-in-hk-1-23-billion-deal-ce7e5cdedb8df222",
            "pub_date": "2026-02-27 13:50:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan energy minister says no issues with CPC oil exports - Ifax",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-energy-minister-says-no-issues-with-cpc-oil-exports-ifax-ce7e5cdedb8df221",
            "pub_date": "2026-02-27 13:50:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss stocks - Factors to watch on February 27",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-stocks-factors-to-watch-on-february-27-ce7e5cdedb8df322",
            "pub_date": "2026-02-27 13:50:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CanSino Biologics' Preliminary Figures Show Return to Profit in 2025; Shares Up 6%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cansino-biologics-preliminary-figures-show-return-to-profit-in-2025-shares-up-6-ce7e5cdedb8df321",
            "pub_date": "2026-02-27 13:50:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gaw Capital completes refinancing of all 2025 maturities in Greater China",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gaw-capital-completes-refinancing-of-all-2025-maturities-in-greater-china-ce7e5cdedb8df42c",
            "pub_date": "2026-02-27 13:45:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Net-a-Go Technology Completes HK$70 Million Share Offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/net-a-go-technology-completes-hk-70-million-share-offering-ce7e5cdedb8df420",
            "pub_date": "2026-02-27 13:45:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China says will implement more active macro policies, enhance targeted coordination",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-says-will-implement-more-active-macro-policies-enhance-targeted-coordination-ce7e5cdedb8df425",
            "pub_date": "2026-02-27 13:45:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Holcim Q4 sales hit by strong Swiss franc",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/holcim-q4-sales-hit-by-strong-swiss-franc-ce7e5cdedb8df424",
            "pub_date": "2026-02-27 13:45:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AI woes and 'open war'",
            "description": "<div class=\"txt-s4 article-text\"><p>A look at the day ahead in European and global markets from Rocky Swift</p><p>\n              Concerns about technology company valuations established a risk-off tone that has only gotten worse as it is compounded by geopolitical woes.</p><!-- Article --><p>\n              Artificial intelligence darling Nvidia delivered what looked to be stellar results, but for a sector priced for perfection, they weren't good enough.</p><p>\n              Japan's yen and U.S. Treasuries, traditional haven assets, advanced while crude prices edged up.</p><p>\n              In the shadow of U.S. President Donald Trump's threat of strikes against Iran, an Omani mediator of the nuclear talks between Washington and Tehran gave an optimistic readout over the latest round of negotiations, but the two sides remain far apart.</p><p>\n              In other hotspots, Pakistan's \"cup of patience\" with Afghanistan reached its limit, resulting in overnight bombings of Taliban government targets and declarations of \"open war.\"</p><p>\n              China's military accused the Philippines of \"disrupting\" peace and stability by organising joint patrols with countries outside the region.</p><p>\n              And in the skies over Texas, the U.S. military used lasers to shoot down a drone deployed by the government of ... the United States.</p><p>\n              The day also started off badly for British Prime Minister Keir Starmer, after his Labour Party suffered an electoral defeat in an area of Greater Manchester that it had dominated for almost a century.</p><p>\n              Equity futures pointed to mixed opens in Europe. The pan-region Euro Stoxx 50 futures were up 0.03% at 6,172, German DAX futures were flat at 25,314, FTSE futures were up 0.21% at 10,856.5.</p><p>\n              U.S. stock futures, the S&amp;P 500 e-minis, were down 0.24% at 6,903.3.     </p><p>\n              Key developments that could influence markets on Friday:</p><p>\n              * U.S.: PPI for January, Chicago PMI for February</p><p>\n              * France: consumer spending for January, producer prices for January, CPI for February, Q4 GDP</p><p>\n              * Germany: unemployment for February, import prices for January, CPI for February </p><p>\n              * Bank of England chief economist Huw Pill speaks</p><p>\n              * Canada Q4 GDP</p><p></p><p> (Editing by Jamie Freed)</p></div>",
            "link": "https://hk.marketscreener.com/news/ai-woes-and-open-war-ce7e5cdedb8df523",
            "pub_date": "2026-02-27 13:45:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Holcim proposes dividend of CHF 1.70",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/holcim-proposes-dividend-of-chf-1-70-ce7e5cdedb8df524",
            "pub_date": "2026-02-27 13:45:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil production in Kazakhstan reaches about 99 million T in 2025, Ifax reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/oil-production-in-kazakhstan-reaches-about-99-million-t-in-2025-ifax-reports-ce7e5cdedb8df621",
            "pub_date": "2026-02-27 13:46:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MORNING BID EUROPE-AI woes and 'open war'",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/morning-bid-europe-ai-woes-and-open-war-ce7e5cdedb8df721",
            "pub_date": "2026-02-27 13:46:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Australian Shares Inch Up; Block Posts Higher Q4 2025 Adjusted Earnings, Revenue",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/australian-shares-inch-up-block-posts-higher-q4-2025-adjusted-earnings-revenue-ce7e5cdedb8afe2c",
            "pub_date": "2026-02-27 13:46:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia discusses resumption of oil refinery project in Far East, Kommersant reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russia-discusses-resumption-of-oil-refinery-project-in-far-east-kommersant-reports-ce7e5cdedb8afe26",
            "pub_date": "2026-02-27 13:36:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JGB yields fall on demand for portfolio adjustment",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jgb-yields-fall-on-demand-for-portfolio-adjustment-ce7e5cdedb8afe25",
            "pub_date": "2026-02-27 13:36:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spot palladium rises 3% to $1,837.93/oz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spot-palladium-rises-3-to-1-837-93-oz-ce7e5cdedb8afe24",
            "pub_date": "2026-02-27 13:36:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Politburo: Necessary to Strengthen Construction of the Government Itself, Firmly Establish and Practice the Correct View of Political Performance - Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-necessary-to-strengthen-construction-of-the-government-itself-firmly-establish-and-ce7e5cdedb8af023",
            "pub_date": "2026-02-27 13:36:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Politburo: Will make greater efforts to protect and improve people's livelihood- Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-will-make-greater-efforts-to-protect-and-improve-people-s-livelihood-xinhua-ce7e5cdedb8af020",
            "pub_date": "2026-02-27 13:36:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jinhui Shipping Swings to Loss in Q4",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jinhui-shipping-swings-to-loss-in-q4-ce7e5cdedb8af026",
            "pub_date": "2026-02-27 13:36:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China politburo: accelerate high-level scientific and technological self-reliance and self-improvement - Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-accelerate-high-level-scientific-and-technological-self-reliance-and-self-improveme-ce7e5cdedb8af025",
            "pub_date": "2026-02-27 13:36:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China politburo: necessary to focus on building a strong domestic market, step up the cultivation and expansion of new momentum- Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-necessary-to-focus-on-building-a-strong-domestic-market-step-up-the-cultivation-an-ce7e5cdedb8af12c",
            "pub_date": "2026-02-27 13:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Politburo: Necessary to strengthen the coordination between reform measures and macro policies - Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-necessary-to-strengthen-the-coordination-between-reform-measures-and-macro-policies-ce7e5cdedb8af123",
            "pub_date": "2026-02-27 13:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China politburo: necessary to continue to implement a more active fiscal policy and a moderately loose monetary policy- Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-necessary-to-continue-to-implement-a-more-active-fiscal-policy-and-a-moderately-loo-ce7e5cdedb8af121",
            "pub_date": "2026-02-27 13:36:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Politburo: Focus on stabilizing employment, enterprises, markets, and expectations",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-focus-on-stabilizing-employment-enterprises-markets-and-expectations-ce7e5cdedb8af126",
            "pub_date": "2026-02-27 13:36:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Everbright Water Books 17% Drop in Profit in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-everbright-water-books-17-drop-in-profit-in-2025-ce7e5cdedb8af42c",
            "pub_date": "2026-02-27 13:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Politburo: China's economic strength, scientific and technological strength, and comprehensive national strength have jumped to a new level - Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-politburo-china-s-economic-strength-scientific-and-technological-strength-and-comprehensive-ce7e5cdedb8af423",
            "pub_date": "2026-02-27 13:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}