{
    "data": [
        {
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-on-the-day-ahead-in-canada-ce7e5cdfd88df120",
            "pub_date": "2026-02-27 20:56:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Regeneron, Sanofi's Dupixent Recommended for EU Approval to Treat CSU in Children",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/regeneron-sanofi-s-dupixent-recommended-for-eu-approval-to-treat-csu-in-children-ce7e5cdfd88df526",
            "pub_date": "2026-02-27 20:56:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury 10-year yield falls below 4%, hits lowest since late November, last down 3.4 bps at 3.981%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-10-year-yield-falls-below-4-hits-lowest-since-late-november-last-down-3-4-bps-at-3-98-ce7e5cdfd88df722",
            "pub_date": "2026-02-27 20:50:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Premarket Gainers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-premarket-gainers-ce7e5cdfd88aff25",
            "pub_date": "2026-02-27 20:50:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nam Cheong logs FY revenue 619.7 mln RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nam-cheong-logs-fy-revenue-619-7-mln-rgt-ce7e5cdfd88aff24",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. equity fund inflows cooled ahead of Nvidia's earnings",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-equity-fund-inflows-cooled-ahead-of-nvidia-s-earnings-ce7e5cdfd88af023",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed Mounts Closed-Door Fight Against DOJ Subpoenas",
            "description": "<div class=\"txt-s4 article-text\"><p>\n     Fed Mounts Closed-Door Fight Against DOJ Subpoenas By Vicky Ge Huang </p><p>\n\n     The Federal Reserve is waging a behind-closed-doors legal challenge to a pair of subpoenas issued as part of U.S. Attorney Jeanine Pirro's criminal investigation into Fed Chair Jerome Powell, according to people familiar with the matter. As that legal battle ensues, Fed governor Stephen Miran turned his attention to the central bank's policy stance: he said in a Fox Business interview Thursday that the Fed needs to cut rates by about a percentage point this year. Meanwhile, markets will get their next hint on where prices are headed when wholesale inflation data is released Friday. </p><!-- Article --><p>\n\n     Top News Fed Mounts Closed-Door Fight Against Justice Department Subpoenas </p><p>\n\n     U.S. Attorney Jeanine Pirro, a longtime ally of President Trump, opened a probe into Federal Reserve Chair Jerome Powell to examine whether he gave false testimony to Congress last summer about the central bank's building-renovation project. </p><p>\n\n     The move prompted an unprecedented public response from Powell, who in a Jan. 11 video statement said the investigation was a pretext for President Trump's continuing campaign to pressure the Fed to lower interest rates and end the independence of the central bank. </p><p>\n\n     The Fed, in sealed proceedings, is asking a judge to quash the subpoenas , which could reduce or eliminate its obligation to respond. Its specific legal arguments couldn't immediately be learned. It isn't uncommon, especially in high-profile investigations, for a subpoena recipient to challenge prosecutors' demands as being overly broad or seeking information protected by legal privilege. </p><p>\n\n     Fed's Miran Says Four Cuts Are Appropriate This Year </p><p>\n\n     Federal Reserve governor Stephen Miran said Thursday: \"Four cuts I think are appropriate,\" </p><p>\n\n  adding \"I'd rather get them sooner than later.\" With regard to private credit, Miran said he hasn't seen anything yet that would make him worried from a macroeconomic perspective. He added a lot of the growth in private credit ties back to overregulation in banks. </p><p>\n\n     January's Wholesale Inflation Will Help Flesh Out the Fed's Preferred Price Gauge </p><p>\n\n     The Bureau of Labor Statistics is set to publish the producer price index for total final demand at 8:30 a.m. ET. Economists expected that solid price pressures remained in the pipeline in January, though not as strong as in December. That could signal that the Federal Reserve's preferred inflation gauge will remain sticky, possibly stalling momentum for further interest-rate cuts. Economists surveyed by FactSet expect that wholesale inflation rose 0.3% in January. That's a cooldown from the 0.5% monthly pace in December, but still a relatively firm monthly print. The annual rate is expected to be 2.6%, a pullback from December's 3% increase. (Barron's) </p><p>\n\n     Mortgage Rates Fall Below 6% for the First Time Since 2022 </p><p>\n\n     Mortgage rates fell below 6% this week </p><p>\n\n  for the first time in more than three years, welcome news for waves of house hunters heading into the busy spring home-buying season. </p><p>\n\n     Trump's Push to Make Homes More Affordable Needs the Banks to Play Ball </p><p>\n\n  Key Developments Around the World China Moves to Tame Yuan Rally by Slashing Shorting Costs </p><p>\n\n     China's central bank has started taking steps to check the yuan's recent advance, dusting off an old playbook that would reduce the cost of betting against the currency. The People's Bank of China announced it would slash the risk reserve requirement ratio </p><p>\n\n  for financial institutions conducting foreign-exchange forward trading to zero from 20%, a move that effectively makes purchasing the dollar cheaper. </p><p>\n\n     Tokyo CPI Slows Below BOJ Target But Rate-Hike Path Seems Intact </p><p>\n\n     Inflation in Japan's capital cooled below the central bank's 2% target </p><p>\n\n  for the first time in over a year, but the slowdown is unlikely to derail further interest rate hikes. </p><p>\n\n     U.K. Consumer Mood Darkens Amid Lingering Cost-Of-Living Squeeze </p><p>\n\n     U.K. consumer sentiment fell unexpectedly </p><p>\n\n  in February as cost-of-living pressures continue to weigh on households. </p><p>\n\n     U.K. Prime Minister Starmer Suffers Another Setback With Local Election </p><p>\n\n  OPEC+ Expected to Resume Output Hikes at Sunday Meeting </p><p>\n\n     The Organization of the Petroleum Exporting Countries and its allies meet Sunday with a familiar dilemma : add barrels to the market or continue holding back against a fragile geopolitical backdrop. </p><p>\n\n     Commentary Tech Has Never Caused a Job Apocalypse. Don't Bet on It Now. </p><p>\n\n     It was only a matter of time before the AI apocalypse theory went mainstream, writes Greg Ip for The Wall Street Journal. Last weekend, a sensational report posited a future in which AI unleashes enough disruption and job destruction to bring on a deep recession and financial crisis. In response, the entire stock market sold off. </p><p>\n\n     AI disruption makes news almost daily. On Thursday, payments company Block said it was laying off 4,000 employees, 40% of its workforce, because AI has \"changed what it means to build and run a company,\" founder Jack Dorsey told shareholders. \"Within the next year, I believe the majority of companies will reach the same conclusion.\" </p><p>\n\n     Is this just the beginning? No one should dismiss any scenario, even the most dystopian, with high conviction. Certainly not journalists, whose way of life is in AI's crosshairs. </p><p>\n\n     But I keep stumbling over one small problem with the doomsday vision: It requires a breakdown in how the market economy functions. Nothing like it has happened in the U.S. before, and there is no evidence it is happening now. Read more . </p><p>\n\n     Forward Guidance Friday (all times ET) </p><p>\n\n     8:30 a.m.: PPI </p><p>\n\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p><p>\n\n     3 p.m.: Agricultural Prices </p><p>\n\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p><p>\n\n     Monday </p><p>\n\n     9:45 a.m.: US Manufacturing PMI </p><p>\n\n     10 a.m.: ISM Report On Business Manufacturing PMI </p><p>\n\n     About Us </p><p>\n\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p><p>\n\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0746ET</p></div>",
            "link": "https://hk.marketscreener.com/news/fed-mounts-closed-door-fight-against-doj-subpoenas-ce7e5cdfd88af123",
            "pub_date": "2026-02-27 20:50:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Recommends Shareholders Reject TRC Capital Mini-Tender Offer",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-recommends-shareholders-reject-trc-capital-mini-tender-offer-ce7e5cdfd88af227",
            "pub_date": "2026-02-27 20:50:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell shares jump on forecast it will double AI server revenue",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-shares-jump-on-forecast-it-will-double-ai-server-revenue-ce7e5cdfd88af321",
            "pub_date": "2026-02-27 20:51:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to remove synthetic color from cereals by May end",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-to-remove-synthetic-color-from-cereals-by-may-end-ce7e5cdfd88af424",
            "pub_date": "2026-02-27 20:45:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bank of Ningbo elects chairman, appoints bank president",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bank-of-ningbo-elects-chairman-appoints-bank-president-ce7e5cdfd88af524",
            "pub_date": "2026-02-27 20:45:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Food companies to phase out artificial dyes, sweeteners in health drive",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/food-companies-to-phase-out-artificial-dyes-sweeteners-in-health-drive-ce7e5cdfd88af726",
            "pub_date": "2026-02-27 20:45:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Dollar Mixed Early Friday Ahead of Producer Prices, Chicago Purchasing Managers' Index, Construction Data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-dollar-mixed-early-friday-ahead-of-producer-prices-chicago-purchasing-managers-index-construct-ce7e5cdfd88bf025",
            "pub_date": "2026-02-27 20:45:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Regeneron, Sanofi Get CHMP Backing for Dupixent in Younger Children With CSU",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Colin Kellaher </p><br/><p>\n  Regeneron Pharmaceuticals and Sanofi said a key European regulatory committee has recommended expanded approval of their blockbuster anti-inflammatory drug Dupixent for younger patients with the inflammatory skin condition chronic spontaneous urticaria, or CSU. </p><!-- Article --><p>\n\n  Regeneron and Sanofi on Friday said the recommendation from the European Medicines Agency's Committee for Medicinal Products for Human Use covers Dupixent in children ages 2 to 11 with moderate-to-severe CSU, an inadequate response to histamine-1 antihistamines and who are naive to anti-immunoglobulin E therapy for CSU. </p><p>\n\n  The European Commission, which generally follows CHMP's advice, is expected to make a final decision in the coming months, the companies said. </p><p>\n\n  Regeneron and Sanofi last year won European approval of Dupixent for people 12 and older with CSU. </p><p>\n\n  Tarrytown, N.Y., biotechnology company Regeneron created Dupixent and markets it jointly in the U.S. with France's Sanofi under a 2007 collaboration agreement, while Sanofi markets the drug internationally. Dupixent global net sales reached about $18.5 billion last year. </p><br/><p>\n  Write to Colin Kellaher at colin.kellaher@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0738ET</p></div>",
            "link": "https://hk.marketscreener.com/news/regeneron-sanofi-get-chmp-backing-for-dupixent-in-younger-children-with-csu-ce7e5cdfd88bf024",
            "pub_date": "2026-02-27 20:45:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S envoy Barrack meets Iraq's ex-prime minister Maliki, two sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-envoy-barrack-meets-iraq-s-ex-prime-minister-maliki-two-sources-say-ce7e5cdfd88bf321",
            "pub_date": "2026-02-27 20:45:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SM Prime Holdings, Inc. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>SM Prime Holdings, Inc. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was PHP 83,566.64 million compared to PHP 78,673.92 million a year ago. Revenue was PHP 141,107.02 million compared to PHP 140,390.87 million a year ago.</p><p>Net income was PHP 48,847.73 million compared to PHP 45,631.76 million a year ago. Basic earnings per share from continuing operations was PHP 1.694 compared to PHP 1.581 a year ago. Diluted earnings per share from continuing operations was PHP 1.694 compared to PHP 1.581 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/sm-prime-holdings-inc-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfd88bf320",
            "pub_date": "2026-02-27 20:45:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sanofi, Regeneron Win EU Panel's Positive Opinion for Skin Disease Treatment in Young Children",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sanofi-regeneron-win-eu-panel-s-positive-opinion-for-skin-disease-treatment-in-young-children-ce7e5cdfd88bf326",
            "pub_date": "2026-02-27 20:45:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Silicon Industry Group Co., Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>National Silicon Industry Group Co., Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 3,716.03 million compared to CNY 3,387.61 million a year ago. Net loss was CNY 1,475.75 million compared to CNY 970.54 million a year ago.</p><p>Basic loss per share from continuing operations was CNY 0.528 compared to CNY 0.353 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/national-silicon-industry-group-co-ltd-reports-earnings-results-for-the-full-year-ended-december-ce7e5cdfd88bf423",
            "pub_date": "2026-02-27 20:45:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novartis Receives Positive Chmp Opinion for Remibrutinib in Chronic Spontaneous Urticaria",
            "description": "<div class=\"txt-s4 article-text\"><p>Novartis has announced that the Committee for Medicinal Products for Human Use (CHMP) of the European Medicines Agency (EMA) has adopted a positive opinion recommending marketing authorization for remibrutinib. Remibrutinib is a highly selective oral Bruton?s tyrosine kinase inhibitor (BTKi) intended for the treatment of chronic spontaneous urticaria (CSU) in adult patients who have an inadequate response to H1-antihistamine treatment. The positive opinion is supported by results from the pivotal REMIX-1 and REMIX-2 Phase III trials, which demonstrated improvements in symptoms as early as Week 1, with a favorable safety profile and no liver safety concerns through Week 52.</p><p>This development represents a significant advancement in providing a targeted therapy for CSU, addressing a substantial unmet medical need. The European Commission (EC) is expected to issue a final decision within approximately two months.</p></div>",
            "link": "https://hk.marketscreener.com/news/novartis-receives-positive-chmp-opinion-for-remibrutinib-in-chronic-spontaneous-urticaria-ce7e5cdfd88bf527",
            "pub_date": "2026-02-27 20:45:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's KFA bought about 66,000 tons of corn, traders say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-kfa-bought-about-66-000-tons-of-corn-traders-say-ce7e5cdfd88bf524",
            "pub_date": "2026-02-27 20:45:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks Fall Pre-Bell Ahead of Wholesale Inflation Report",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/stocks-fall-pre-bell-ahead-of-wholesale-inflation-report-ce7e5cdfd88bf627",
            "pub_date": "2026-02-27 20:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visual China Group plans to seek Hong Kong listing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/visual-china-group-plans-to-seek-hong-kong-listing-ce7e5cdfd88bf725",
            "pub_date": "2026-02-27 20:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vw receives preliminary bids for diesel engine unit everllence at around $9.4 billion, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/vw-receives-preliminary-bids-for-diesel-engine-unit-everllence-at-around-9-4-billion-sources-say-ce7e5cdfd888ff24",
            "pub_date": "2026-02-27 20:36:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Druzhba pipeline carried Ukrainian as well as Russian oil before Russian strike, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/druzhba-pipeline-carried-ukrainian-as-well-as-russian-oil-before-russian-strike-sources-say-ce7e5cdfd888f022",
            "pub_date": "2026-02-27 20:36:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. envoy Barrack meets former Iraqi prime minister and Shi'ite alliance PM candidate Nouri al-Maliki - two sources familiar with matter",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-envoy-barrack-meets-former-iraqi-prime-minister-and-shi-ite-alliance-pm-candidate-nouri-al-mali-ce7e5cdfd888f326",
            "pub_date": "2026-02-27 20:36:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eprint Group's CFO to Steps Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eprint-group-s-cfo-to-steps-down-ce7e5cdfd888f325",
            "pub_date": "2026-02-27 20:36:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German ministry plans to end subsidies for small solar power systems",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-ministry-plans-to-end-subsidies-for-small-solar-power-systems-ce7e5cdfd888f523",
            "pub_date": "2026-02-27 20:31:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global equity fund inflows cool to a five-week low on AI concerns",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Global equity fund inflows eased to a\nfive-week low in the seven days to February 25 as investors\nturned cautious amid growing unease over the heavy costs and\npotential disruption linked to artificial intelligence.</p><p>\n              Investors bought a net $19.75 billion worth of global equity\nfunds, marking the smallest weekly inflow since $9.55 billion in\nthe week to Jan. 21, LSEG Lipper data showed.\nNvidia shares dropped 5.46% on Thursday, while the\nNasdaq Composite Index shed 1.2% after Nvidia's earnings\nreport showed that fourth-quarter revenue growth slowed, despite\nbeating analysts' estimates.</p><!-- Article --><p>\n              \"We believe big market moves in recent months should be a\ntrigger to review portfolios,\" said Mark Haefele, chief\ninvestment officer at UBS Global Wealth Management.</p><p>\n              \"Higher-than-expected capital expenditure and rising\ncompetition have raised uncertainty in the AI field, making\nselectivity and diversification more important.\"</p><p>\n              European equity funds saw weekly inflows of $11.69 billion\nafter a net $18.61 billion purchase in the prior week. Asian and\nU.S. funds drew net inflows of $3.22 billion and $2.01 billion,\nrespectively.</p><p>\n              Sectoral funds had a mixed set of data as industrials, and\nmetals and mining secured net inflows of $1.5 billion and $1.02\nbillion, respectively, while financials and tech faced outflows\nof $2.55 billion and $257 million, respectively.</p><p>\n              Inflows into bond funds, meanwhile, cooled to a five-week\nlow of $12.68 billion.</p><p>\n              The short-term bond funds segment received $1.25 billion,\nthe smallest weekly net since January 21. Euro-denominated bond\nfunds and corporate bond funds had inflows of $2.2 billion and\n$1.4 billion, respectively.</p><p>\n              Money market funds saw the largest weekly net purchase in\nthree weeks, at approximately $19.97 billion.</p><p>\n              Gold and precious metals commodity funds saw a surge in\ndemand in the most recent week as these funds drew $5.57 billion\nworth of inflows, the largest amount since October 22.</p><p>\n              In emerging markets, equity funds remained popular for the\n10th straight week as these funds drew net investments of $11.86\nbillion. Investors also pumped $3.13 billion into bond funds,\ndata for a combined 28,718 funds showed.</p><p></p><p>(Reporting by Gaurav Dogra; with additional reporting by\nPatturaja Murugaboopathy in Bengaluru, Editing by Louise\nHeavens)</p></div>",
            "link": "https://hk.marketscreener.com/news/global-equity-fund-inflows-cool-to-a-five-week-low-on-ai-concerns-ce7e5cdfd888f520",
            "pub_date": "2026-02-27 20:31:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO Notes Canada's Labor Pains From Payrolls Data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-notes-canada-s-labor-pains-from-payrolls-data-ce7e5cdfd888f527",
            "pub_date": "2026-02-27 20:31:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Win Hanverky's CEO to Retire; Successor Named",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/win-hanverky-s-ceo-to-retire-successor-named-ce7e5cdfd888f626",
            "pub_date": "2026-02-27 20:31:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Anthropic CEO Refuses to Allow Pentagon Use AI Tech for Mass Surveillance, Autonomous Weapons",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/anthropic-ceo-refuses-to-allow-pentagon-use-ai-tech-for-mass-surveillance-autonomous-weapons-ce7e5cdfd889f027",
            "pub_date": "2026-02-27 20:31:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Leonardo SpA Price Objective, Forecasts Revised as BofA Notes 'Strong' FY25 Execution",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/leonardo-spa-price-objective-forecasts-revised-as-bofa-notes-strong-fy25-execution-ce7e5cdfd889f12c",
            "pub_date": "2026-02-27 20:31:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's January net gold imports via Hong Kong rose 68.7% from December",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-january-net-gold-imports-via-hong-kong-rose-68-7-from-december-ce7e5cdfd889f127",
            "pub_date": "2026-02-27 20:25:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zhongji InnoLight prelim 2025 net profit up 108.8% Y/Y",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/zhongji-innolight-prelim-2025-net-profit-up-108-8-y-y-ce7e5cdfd889f222",
            "pub_date": "2026-02-27 20:25:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prices for March CPC Blend rise as exports become more stable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/prices-for-march-cpc-blend-rise-as-exports-become-more-stable-ce7e5cdfd889f225",
            "pub_date": "2026-02-27 20:25:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Brief: Notes TRC Move To Buy Up to 1M CIBC Common Shares, Near 0.109% of Common Shares Outstanding as at Feb. 18, 2026, At a \"Below-market\" Price of C$126.50 Per Share In Cash",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-brief-notes-trc-move-to-buy-up-to-1m-cibc-common-shares-near-0-109-of-common-shares-outstand-ce7e5cdfd889f32c",
            "pub_date": "2026-02-27 20:25:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Brief: Recommending Shareholders Reject TRC Capital Investment's \"Below-market 'Mini-tender\" Offer For Common Shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-brief-recommending-shareholders-reject-trc-capital-investment-s-below-market-mini-tender-of-ce7e5cdfd889f526",
            "pub_date": "2026-02-27 20:25:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sanofi and DNDi Announces the European Medicines Agency's Committee for Medicinal Products for Human Use Grants Positive Opinion to Acoziborole Winthrop (Acoziborole) as A Single-Dose Oral Treatment",
            "description": "<div class=\"txt-s4 article-text\"><p>Sanofi and DNDi announced that The European Medicines Agency's Committee for Medicinal Products for Human Use (CHMP) has granted a positive opinion to Acoziborole Winthrop (acoziborole) as a single-dose oral treatment for both early and advanced-stage gambiense sleeping sickness in adults as well as in adolescents 12 years and older weighing at least 40 kilograms. Dutch Ministry of Foreign Affairs (DGIS), the Netherlands; European and Developing Countries Clinical Trials Partnership Association (EDCTP2 programme) supported by the European Union; Global Health EDCTP3 and its members; DNDi, Sanofi, and partners developed fexinidazole, which in 2018 became the first all-oral treatment available for gambiense sleeping sickness. This ten-day treatment is now available in all sleeping sickness-endemic countries. AcoziboroleWinthrop can be administered as a single oral dose, potentially without the need of hospitalization or supervision of the treatment at home.</p></div>",
            "link": "https://hk.marketscreener.com/news/sanofi-and-dndi-announces-the-european-medicines-agency-s-committee-for-medicinal-products-for-human-ce7e5cdfd889f524",
            "pub_date": "2026-02-27 20:25:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Senior housing REIT Janus Living moves closer to US IPO with public filing",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Janus Living, a real estate investment trust focused to senior housing, publicly filed paperwork for a U.S. initial public offering on Friday, as corporate issuers line up to tap the March window.</p><p>\n              The U.S. IPO market has grappled with heightened volatility in the past few weeks as concerns around AI-related disruptions grew, forcing several companies to downsize or postpone their stock market flotations.</p><!-- Article --><p>\n              Analysts say AI-resistant themes could drive the IPO market in the near-term, as weak investor sentiment continues to weigh on software and financial stocks facing uncertainty on how AI could reshape their businesses.</p><p>\n              Janus Living parent Healthpeak Properties earlier this year announced it would be carving out its senior housing portfolio into a separate publicly-traded REIT. </p><p>\n              Healthpeak said at the time that public markets struggled to fully value its senior housing portfolio as it was relatively small within the broader company.</p><p>\n              Denver, Colorado-based Janus Living's portfolio consists of 34 senior housing communities, comprising more than 10,000 units. </p><p>\n              The assets are mainly located in major retirement markets across 10 U.S. states, with units in Florida and Texas representing 69% of the total portfolio.</p><p>\n              Janus Living's adjusted FFO, a key performance measure for REITs, was $150.8 million in 2025, compared with $137.5 million a year earlier.</p><p>\n              BofA Securities and J.P. Morgan are the lead book-running managers for the offering. Janus Living will list on the New York Stock Exchange under the symbol \"JAN\". </p><p>\n              Healthpeak will retain a majority interest in Janus Living after the offering.</p><p>\n               (Reporting by Arasu Kannagi Basil in Bengaluru; Editing by Shilpi Majumdar and Devika Syamnath)</p></div>",
            "link": "https://hk.marketscreener.com/news/senior-housing-reit-janus-living-moves-closer-to-us-ipo-with-public-filing-ce7e5cdfd98af723",
            "pub_date": "2026-02-27 20:25:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to Remove Synthetic Colors From Cereals",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-to-remove-synthetic-colors-from-cereals-ce7e5cdfd980fe27",
            "pub_date": "2026-02-27 20:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}