{
    "data": [
        {
            "title": "For the month, the S&P 500 fell 0.9%, the Dow rose 0.2% and the Nasdaq fell 3.4%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/for-the-month-the-s-p-500-fell-0-9-the-dow-rose-0-2-and-the-nasdaq-fell-3-4-ce7e5cdfdf89f021",
            "pub_date": "2026-02-28 05:06:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "For the week, the S&P 500 fell 0.4%, the Dow fell 1.3% and the Nasdaq fell 1.0%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/for-the-week-the-s-p-500-fell-0-4-the-dow-fell-1-3-and-the-nasdaq-fell-1-0-ce7e5cdfdf89f027",
            "pub_date": "2026-02-28 05:06:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow industrials record biggest weekly percentage decline since mid-November",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dow-industrials-record-biggest-weekly-percentage-decline-since-mid-november-ce7e5cdfdf89f126",
            "pub_date": "2026-02-28 05:06:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "S&P 500, Nasdaq Composite register biggest monthly percentage decline since March",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/s-p-500-nasdaq-composite-register-biggest-monthly-percentage-decline-since-march-ce7e5cdfdf89f22d",
            "pub_date": "2026-02-28 05:06:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dow Industrials rise for tenth straight month, longest streak since ten-month run ending January 2018",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dow-industrials-rise-for-tenth-straight-month-longest-streak-since-ten-month-run-ending-january-201-ce7e5cdfdf89f222",
            "pub_date": "2026-02-28 05:06:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall St notches monthly declines on combined AI, tariff, geopolitical uncertainty",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW YORK, Feb 27 (Reuters) - Financial and tech stocks were hit hard by a handful of persistent investor worries on Friday, putting U.S. stocks on track for their largest monthly percentage decline in a year.</p><p>\n              All three major indexes ended decisively lower and posted steep weekly declines, with the blue-chip Dow logging its biggest weekly drop since November. The selloff was driven by uncertainty over costs and disruption related to artificial intelligence, revived tariff uncertainties and simmering geopolitical tensions.</p><!-- Article --><p>\n              \"To wrap up the month of February, we were reminded there are still some cracks out there,\" said Ryan Detrick, chief market strategist at Carson Group in Omaha, Nebraska. \"Adding to the day's weakness was the hotter inflation data, potentially pushing back on the idea of a dovish Fed later this year.\"</p><p>\n              \"It's been a rough go in February, but corporate America is looking at over a 14% gain in earnings in the fourth quarter,\" Detrick added. \"The reality is that earnings drive long-term stock gains and this was a very impressive earnings season.\"</p><p>\n              Financial stocks slid after worries of contagion in the sector after reports that Barclays, Jefferies, Wells Fargo and other banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions Ltd, amid broader concerns about lending standards. Wells Fargo, Jefferies and U.S.-listed shares of Barclays ended sharply lower.</p><p>\n              Tech shares also continued to weigh on the indexes as lingering fears related to AI dragged chips and software lower on the day.</p><p>\n              Defensive sectors such as consumer staples, healthcare and utilities were the session's clear outperformers.</p><p>\n              \"This is a classic risk-off environment where the pure defensive areas are finding some strength while the market is turning its head on some of the more cyclical growth areas that are clearly lagging,\" Detrick said.  </p><p>\n              On the economics front, a hotter-than-expected Producer Price Index reading fortified expectations that the U.S. Federal Reserve is unlikely to cut its key interest rate in the near term.</p><p>\n              According to preliminary data, the S&amp;P 500 lost 30.49 points, or 0.44%, to end at 6,878.91 points, while the Nasdaq Composite lost 204.74 points, or 0.92%, to 22,673.65. The Dow Jones Industrial Average fell 521.69 points, or 1.05%, to 48,977.51.</p><p>\n              Nvidia extended the previous session's drop despite solid earnings, a sign of persistent unease over emergent AI technology.</p><p>\n              Zscaler plunged after the cloud security firm reported a wider net loss in the second quarter. </p><p>\n              Netflix jumped as investors cheered its decision to exit the fight for Warner Bros Discovery, which dropped on the news. Paramount Skydance, WBD's likely buyer, closed sharply higher.</p><p>\n              Block surged after the payments firm said it would axe nearly half its workforce, as part of its effort to embed AI across operations.</p><p>\n              Dell shot up after the PC maker said it expects revenue from its key AI-optimized servers business to double in fiscal year 2027 and promised to return more cash to shareholders.</p><p>\n              (Reporting by Stephen Culp in New York; Additional reporting by Shashwat Chauhan and Ragini Mathur in Bengaluru; Editing by Matthew Lewis)</p><p>\n            By Stephen Culp and Ragini Mathur</p></div>",
            "link": "https://hk.marketscreener.com/news/wall-st-notches-monthly-declines-on-combined-ai-tariff-geopolitical-uncertainty-ce7e5cdfdf89f323",
            "pub_date": "2026-02-28 05:06:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says he is directing federal agencies to cease use of Anthropic technology",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-says-he-is-directing-federal-agencies-to-cease-use-of-anthropic-technology-ce7e5cdfdc80fe27",
            "pub_date": "2026-02-28 04:56:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Holcim AG Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Holcim AG reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CHF 15,724 million compared to CHF 16,201 million a year ago. Net income was CHF 13,179 million compared to CHF 2,926 million a year ago.</p><p>Basic earnings per share from continuing operations was CHF 0.7 compared to CHF 2.6 a year ago. Diluted earnings per share from continuing operations was CHF 0.7 compared to CHF 2.59 a year ago. Basic earnings per share was CHF 23.85 compared to CHF 5.24 a year ago.</p><!-- Article --><p>Diluted earnings per share was CHF 23.79 compared to CHF 5.22 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/holcim-ag-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdc80ff2d",
            "pub_date": "2026-02-28 04:56:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AXIA Energia SA Reports Earnings Results for the Fourth Quarter Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>AXIA Energia SA reported earnings results for the fourth quarter ended December 31, 2025. For the fourth quarter, the company reported sales was BRL 12,227 million. Revenue was BRL 10,666 million.</p><p>Net income was BRL 13,686 million.</p></div>",
            "link": "https://hk.marketscreener.com/news/axia-energia-sa-reports-earnings-results-for-the-fourth-quarter-ended-december-31-2025-ce7e5cdfdc80f023",
            "pub_date": "2026-02-28 04:56:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brazil's Petrobras raises jet fuel prices to distributors by 9.4%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/brazil-s-petrobras-raises-jet-fuel-prices-to-distributors-by-9-4-ce7e5cdfdc80f122",
            "pub_date": "2026-02-28 04:56:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wind River and Vodafone Collaborate to Advance AI-RAN Operations at Scale for Open RAN",
            "description": "<div class=\"txt-s4 article-text\"><p>Wind River and Vodafone are collaborating to operationalize AI-RAN for Open RAN networks. The joint solution will be showcased at MWC Barcelona, March 2-5, in the Wind River booth (Hall 2, Stand 2F25). Open RAN is transforming how networks are built.</p><p>AI-RAN is transforming how networks are build. AI-RAN is transform how networks are built. AI the intelligent edge, traditional operations models are reaching their limits.</p><!-- Article --><p>The volume, velocity, and variability of network data now exceed what human-driven operations can effectively manage. The Wind River-Vodafone collaboration demonstrates how AI-RAN moves intelligence from dashboards into the operational core of the network. Powered by Vodafone's 5G network running on its O-Cloud platform and built from the container infrastructure delivered by Wind River®?</p><p>Cloud Platform with analytics from Wind River Analytics, the solution continuously extends massive telemetry streams across the RAN and cloud layers. AI models learn normal system behavior over time, detect subtle deviations, predict emerging issues, and guide remediation actions before customer experience is affected. Unlike traditional OSS tools that analyze events after they occur, the joint solution continuously learns from live network behavior, enabling operators to shift from reactive troubleshooting to predictive and increasingly autonomous operations -- a central objective of AI-RAN architectures.</p><p>Demonstrations of the solution show the ability to: Reduce anomaly detection time from hours to minutes through multi-layer telemetry correlation; Continuously learn from more than 70TB of network data per week, enabling long-term behavioral modeling across distributed RAN environments; Scale short-term learning and troubleshooting analytics in TBs per hour, supporting real-time operational decisions; Accelerate root-cause identification and remediation workflows, reducing mean time to resolution and limiting service impact; Enable teams to manage larger open RAN footprints without proportional increases in operational cost or staffing. The telecom industry has spent years virtualizing infrastructure and disaggregating the RAN. The next challenge is operational scale.</p><p>AI-RAN enables operators to: Run larger, more distributed networks without linear increases in OpEx; Detect performance degradations before customers notice them; Shorten recovery cycles and improve service reliability; Lay the operational foundation for fully autonomous networks. The joint Wind River-Vodafone work demonstrates that AI-RAN is no longer a future concept -- it is becoming a deployable operational capability. In addition to highlighting AI-RAN solutions with Vodafone, the Wind River exhibit at MWC Barcelona will showcase its portfolio of carrier-grade solutions that accelerate cloud adoption, automate operations, and improve resilience through real-time analytics and orchestration for AI-enabled frameworks.</p><p>Wind River is powering the future of edge AI and intelligent networks across domains including telecom, enterprise, automotive, and industrial.</p></div>",
            "link": "https://hk.marketscreener.com/news/wind-river-and-vodafone-collaborate-to-advance-ai-ran-operations-at-scale-for-open-ran-ce7e5cdfdc80f123",
            "pub_date": "2026-02-28 04:56:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CBOT soybeans reach 20-month high on demand optimism, rising soyoil",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cbot-soybeans-reach-20-month-high-on-demand-optimism-rising-soyoil-ce7e5cdfdc80f221",
            "pub_date": "2026-02-28 04:50:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Speculators cut short position in raw sugar, raise longs in coffee",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/speculators-cut-short-position-in-raw-sugar-raise-longs-in-coffee-ce7e5cdfdc80f32d",
            "pub_date": "2026-02-28 04:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blackstone plans public company for AI data-center buying spree - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/blackstone-plans-public-company-for-ai-data-center-buying-spree-bloomberg-news-ce7e5cdfdc80f321",
            "pub_date": "2026-02-28 04:50:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Havana rides a bicycle boom as US chokes off fuel to Cuba",
            "description": "<div class=\"txt-s4 article-text\"><p>HAVANA, Feb 27 (Reuters) - Havana residents are pulling old bicycles out of storage, patching up threadbare tires, and, in some cases, learning to cycle as fuel becomes increasingly scarce in Cuba following the U.S. takeover of Venezuela's oil exports. </p><p>\n              Venezuela, a key ally to Cuba, had been the main supplier of crude oil and fuel to the communist-run island for more than a quarter century, until the U.S. capture of Venezuelan leader Nicolas Maduro in January.</p><!-- Article --><p>\n              The drying-up of that supply has pushed Cubans into a deeper level of survival mode as they contend with ever-longer blackouts and soaring prices for food and transportation as well as for fuel itself - when it is even available. Fuel shipments to Cuba from Mexico also halted recently, after the U.S. threatened tariffs on countries that supply oil to the island nation.</p><p>\n              Some in Havana are increasingly turning to electric vehicles and scrambling to install solar panels atop their homes and businesses.</p><p>\n              For Gabriela Barbon, 23, the ballooning transportation costs (three times higher than before to get around by car) persuaded her to get on a bike for the first time. </p><p>\n              \"Riding a bike is no longer just a hobby or something I wanted to do at some point in my life; it's a necessity,\" she said during a training session hosted by local organization Citykleta in a city park, alongside other adults finding their balance on two wheels for the first time.</p><p>\n              \"The Learn to Pedal campaign came at the perfect time, just when I needed it,\" she said.</p><p>\n              Citykleta organizer Yasser Gonzalez expected 100 people to sign up, but the program has attracted nearly four times as many people - many seeking alternative ways to get around the Cuban capital.</p><p>\n              \"We have an avalanche of people who want to learn,\" he said, as a fellow organizer helped a first-timer on a bright blue bicycle.</p><p>\n              Yoandris Herrera is not new to cycling. But he has stored his bicycle disassembled under his bed for almost a year, opting to zip around on a motorcycle instead.</p><p>\n              The China-made bicycle, which he bought four years ago, now has a second chance on the streets as Herrera pedals to work and takes his kids to school. </p><p>\n              \"Since fuel is so expensive right now, it's more practical to get around by bicycle,\" he said.</p><p>\n              The fuel crisis has also triggered more business for bicycle repairman Pedro Carrillo, who carefully aligned the spokes of a wheel at a makeshift workshop on a Havana sidewalk, with bicycle tires hanging on the wall behind him.</p><p>\n              \"It's been like an explosion,\" he said. But the biking boom itself has led to a new type of scarcity, too, he said. \"Sometimes I don't have parts to help people. There are things I can't get anywhere.\" </p><p></p><p>(Reporting by Alien Fernandez and Anett Rios in Havana; Writing by Daina Beth Solomon; Editing by Ethan Smith)</p><p>\n            By Alien Fernandez  and Anett Rios</p></div>",
            "link": "https://hk.marketscreener.com/news/havana-rides-a-bicycle-boom-as-us-chokes-off-fuel-to-cuba-ce7e5cdfdc80f423",
            "pub_date": "2026-02-28 04:41:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wheat Futures Higher as Short Covering Keeps Going -- Daily Grain Highlights",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kirk Maltais </p><br/><p>\n  --Wheat for May delivery rose 3% to $5.91 1/2 a bushel on the Chicago Board of Trade on Friday, with a continued push in short-covering coming as some analysts eye weather conditions globally, while futures also took cues from a risk-off macro environment. </p><!-- Article --><p>\n\n  --Corn for May delivery rose 1.1% to $4.48 1/4 a bushel. </p><p>\n\n  --Soybeans for May delivery rose 0.6% to $11.70 a bushel. </p><br/><p>\n  HIGHLIGHTS </p><br/><p>\n  Catching Fire: There are multiple reasons why traders continue to cover their short positions in wheat, Commerzbank said in a note. Part of it has to do with droughts and wildfires in the U.S. Midwest, as well as a deterioration in crop health in France. An attack by Russia on Ukrainian infrastructure in the port city of Odesa, and tensions between the U.S. and Iran that has traders across markets adjusting their positions. </p><p>\n\n  Taking Cues: Corn futures rose to the highest their level this year. The grain received support from higher crude oil futures as U.S.-Iran tensions remain unresolved heading into the weekend. \"The two sides will resume more technical discussions next week in Vienna,\" StoneX's said Arlan Suderman in a note. \"A bulked-up U.S. military presence in the Middle East remains.\" Corn's price is tied to oil due to ethanol, which is a major consumer of commodity that is an ingredient blended into American motor fuel. </p><br/><p>\n  INSIGHT </p><br/><p>\n  Overseas Interest: The USDA reported a flash sale of U.S. corn exports for the second consecutive day, this time in a notice that said 257,000 metric tons were headed to \"unknown destinations\" for delivery in the 2025/26 marketing year. That phrase when included in USDA statements is often--but not always--used in connection with China. Grain traders continue to look for confirmation of China buying more U.S. soybeans. </p><p>\n\n  Sticking Around: The latest U.S. inflation gauge showed price increases are likely to remain above the Federal Reserve's 2% target for a while. January's producer price index unexpectedly accelerated, and other indicators are expected to show inflation remains stubborn. \"The data out this morning actually points to inflation being a nagging frustration for the U.S. economy,\" Comerica's Bill Adams said. The Fed is expected to remain cautious when considering rate cuts in the coming months. Attitudes around inflation and rate cuts tend to affect how commodities trade. </p><br/><p>\n  AHEAD </p><br/><p>\n  --The USDA will release its weekly Grain Export Inspections report at 11 a.m. ET Monday. </p><p>\n\n  --The USDA will release its monthly Grain Crushings report at 3 p.m. ET Monday. </p><p>\n\n  --The EIA will release its Weekly Petroleum Status Update report at 10:30 a.m. ET Wednesday. </p><br/><p>\n  Paulo Trevisani contributed to this article </p><p>\n\n  Write to Kirk Maltais at kirk.maltais@wsj.com </p><p>\n\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1531ET</p></div>",
            "link": "https://hk.marketscreener.com/news/wheat-futures-higher-as-short-covering-keeps-going-daily-grain-highlights-ce7e5cdfdc80f525",
            "pub_date": "2026-02-28 04:36:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US natgas futures edge up on higher global energy prices, near-record LNG exports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-natgas-futures-edge-up-on-higher-global-energy-prices-near-record-lng-exports-ce7e5cdfdc80f623",
            "pub_date": "2026-02-28 04:36:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE Review : Canola Retreats to Pause Rally",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  WINNIPEG, Manitoba--Canola futures on the Intercontinental Exchange were in negative territory on Friday despite rising comparable oils. </p><p>\n\n  Chicago soyoil was up slightly with an analyst saying any time it is between 60 to 65 United States cents per pound was \"a bonus.\" European rapeseed was mostly higher and Malaysian palm oil was up as well. Crude oil gained nearly US$2 per barrel after nuclear talks between the United States and Iran ended today without a resolution. </p><!-- Article --><p>\n\n  China confirmed on Friday it's suspending its tariffs on Canadian agricultural imports, including canola meal, starting March 1. China's duty on Canadian canola seed will be reduced to 15 per cent on the same day. </p><p>\n\n  The Canadian Grain Commission reported 243,600 tonnes were exported during the week ended Feb. 22, down from the 257,100 shipped the previous week. So far this marketing year, canola exports totalled 4.269 million tonnes, compared to 6.021 million one year ago. </p><p>\n\n  At mid-afternoon, the Canadian dollar was up three-tenths of a U.S. cent compared to Thursday's close. </p><p>\n\n  There were 56,485 canola contracts traded on Friday, compared to Thursday when 67,563 contracts changed hands. Spreads accounted for 39,586 contracts in today's trade. </p><p>\n\n  Settlement prices are in Canadian dollars per metric tonne. </p><pre style=\"font-size:14px\">\n\n \n           Price      Change \nMay       687.70     dn 5.30 \nJul       698.50     dn 5.10 \nNov       691.90     dn 6.00 \nJan       698.90     dn 6.20 </pre><p>\n\n  Spread trade prices are in Canadian dollars: </p><pre style=\"font-size:14px\">\n\n \nMonths    Prices                            Volume \nMar/May   5.60 under to 16.50 under          2,491 \nMar/Nov   10.00 under to 21.50 under         2,450 \nMay/Jul   10.40 under to 11.10 under         9,018 \nMay/Nov   3.50 under to 5.30 under             225 \nMay/Jan   11.20 under to 12.10 under            13 \nJul/Nov   7.50 over to 5.50 over             4,948 \nJul/Jan   0.40 under to 1.50 under              53 \nNov/Jan   6.90 under to 7.30 under             503 \nJan/Mar   4.80 under to 5.40 under              50 \nJan/May   7.60 under to 8.50 under               3 \nMar/May   2.70 under to 3.20 under               1 \nMar/Jul   4.00 under to 4.20 under              18 \nJul/Nov   7.20 over to 7.10 over                20 \n </pre><p>\n\n  Source: Commodity News Service Canada, news@marketsfarm.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1530ET</p></div>",
            "link": "https://hk.marketscreener.com/news/ice-review-canola-retreats-to-pause-rally-ce7e5cdfdc80f622",
            "pub_date": "2026-02-28 04:36:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spacex could seek a valuation in the ipo of more than $1.75 trill…",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spacex-could-seek-a-valuation-in-the-ipo-of-more-than-1-75-trilla--ce7e5cdfdc80f626",
            "pub_date": "2026-02-28 04:31:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SpaceX weighs confidential IPO filing as soon as March - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spacex-weighs-confidential-ipo-filing-as-soon-as-march-bloomberg-news-ce7e5cdfdc80f625",
            "pub_date": "2026-02-28 04:31:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Slump Amid Hot Inflation Print, Weakness in Tech Trade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-slump-amid-hot-inflation-print-weakness-in-tech-trade-ce7e5cdfdc80f722",
            "pub_date": "2026-02-28 04:31:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OpenAI Looks to Secure $10 Billion More From Investors",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/openai-looks-to-secure-10-billion-more-from-investors-ce7e5cdfdc80f727",
            "pub_date": "2026-02-28 04:31:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tech Unions Oppose Pentagon Push on AI Guardrails",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tech-unions-oppose-pentagon-push-on-ai-guardrails-ce7e5cdfdc80f724",
            "pub_date": "2026-02-28 04:31:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount Skydance Pays $2.8 Billion Netflix Termination Fee, Bloomberg Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/paramount-skydance-pays-2-8-billion-netflix-termination-fee-bloomberg-reports-ce7e5cdfdc81fe27",
            "pub_date": "2026-02-28 04:25:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix says Paramount Skydance paid $2.8 bln termination fee to co after WBD deal termination",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/netflix-says-paramount-skydance-paid-2-8-bln-termination-fee-to-co-after-wbd-deal-termination-ce7e5cdfdc81ff22",
            "pub_date": "2026-02-28 04:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hegseth says Pentagon to end Ivy League attendance from 2026-27 academic year",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Pentagon chief Pete Hegseth said on Friday that he was ordering a cancellation of all Defense Department attendance at Ivy League institutions starting academic year 2026-2027.</p><p>\n               (Reporting by Ismail Shakil; Editing by Daphne Psaledakis)</p></div>",
            "link": "https://hk.marketscreener.com/news/hegseth-says-pentagon-to-end-ivy-league-attendance-from-2026-27-academic-year-ce7e5cdfdc81ff20",
            "pub_date": "2026-02-28 04:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix Inc - WBD terminates merger agreement with Netflix - SEC filing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/netflix-inc-wbd-terminates-merger-agreement-with-netflix-sec-filing-ce7e5cdfdc81f02c",
            "pub_date": "2026-02-28 04:20:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "American Electric Power Shares Rise After UBS Upgrade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/american-electric-power-shares-rise-after-ubs-upgrade-ce7e5cdfdc81f027",
            "pub_date": "2026-02-28 04:20:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arthur J. Gallagher Shares Rise After Mizuho Upgrade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arthur-j-gallagher-shares-rise-after-mizuho-upgrade-ce7e5cdfdc81f122",
            "pub_date": "2026-02-28 04:20:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Honeywell Shares Rise After Wolfe Research Upgrade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/honeywell-shares-rise-after-wolfe-research-upgrade-ce7e5cdfdc81f126",
            "pub_date": "2026-02-28 04:11:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US says research funding into new farm practices to surpass $1 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-says-research-funding-into-new-farm-practices-to-surpass-1-billion-ce7e5cdfdc81f125",
            "pub_date": "2026-02-28 04:11:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration says investment in research into new farm practices to surpass $1 billion after additional $200 million in funding",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-administration-says-investment-in-research-into-new-farm-practices-to-surpass-1-billion-after-ce7e5cdfdc81f22d",
            "pub_date": "2026-02-28 04:11:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Live Nation Entertainment Shares Rise After Rothschild & Co Redburn Upgrade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/live-nation-entertainment-shares-rise-after-rothschild-co-redburn-upgrade-ce7e5cdfdc81f22c",
            "pub_date": "2026-02-28 04:11:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Newmont Shares Rise After Bernstein Upgrade",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/newmont-shares-rise-after-bernstein-upgrade-ce7e5cdfdc81f323",
            "pub_date": "2026-02-28 04:11:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kinder Morgan's Backlog Supports Long-Term Growth, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kinder-morgan-s-backlog-supports-long-term-growth-rbc-says-ce7e5cdfdc81f321",
            "pub_date": "2026-02-28 04:11:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Marvell Technology's Poised to Benefit from AI ASIC Demand, Oppenheimer Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/marvell-technology-s-poised-to-benefit-from-ai-asic-demand-oppenheimer-says-ce7e5cdfdc81f327",
            "pub_date": "2026-02-28 04:11:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Monster Beverage Has Tools to Handle Cost Pressures, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/monster-beverage-has-tools-to-handle-cost-pressures-rbc-says-ce7e5cdfdc81f42d",
            "pub_date": "2026-02-28 04:11:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury Closing Levels",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-closing-levels-ce7e5cdfdc81f62d",
            "pub_date": "2026-02-28 04:06:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paramount pays $2.8 billion Netflix breakup fee - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/paramount-pays-2-8-billion-netflix-breakup-fee-bloomberg-news-ce7e5cdfdc81f623",
            "pub_date": "2026-02-28 04:06:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CBOT wheat rallies to 1-year high as US-Iran tensions ignite short covering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cbot-wheat-rallies-to-1-year-high-as-us-iran-tensions-ignite-short-covering-ce7e5cdfdc81f722",
            "pub_date": "2026-02-28 04:01:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}