{
    "data": [
        {
            "title": "ICE March raw sugar delivery seen at 808,000 tons, say traders",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ice-march-raw-sugar-delivery-seen-at-808-000-tons-say-traders-ce7e5cdfdc8ff726",
            "pub_date": "2026-02-28 03:11:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Rises to a Month High as U.S. Wholesale Prices Rose Above Expectations in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-rises-to-a-month-high-as-u-s-wholesale-prices-rose-above-expectations-in-january-ce7e5cdfdc8cf023",
            "pub_date": "2026-02-28 03:11:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell's Outlook 'Unexpectedly Strong,' BofA Says as Memory Shortage Lingers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-s-outlook-unexpectedly-strong-bofa-says-as-memory-shortage-lingers-ce7e5cdfdc8cf125",
            "pub_date": "2026-02-28 03:06:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brookfield's new AI unit Radiant valued at $1.3 billion after merger with UK startup, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/brookfield-s-new-ai-unit-radiant-valued-at-1-3-billion-after-merger-with-uk-startup-ori-sources-sa-ce7e5cdfdc8cf222",
            "pub_date": "2026-02-28 03:06:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dorsey's blunt AI warning sharpens debate over jobs and profits",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Jack Dorsey is not the first chief executive to say artificial intelligence will transform work. He may be among the first to act as if it already has - and to say so openly.</p><p>\n              \"Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team using the tools can do more and do it better,\" Block CEO and co-founder said in a statement on Thursday.</p><!-- Article --><p>\n              \"I don't think we're early to this realization. I think most companies are late,\" he added as he laid out plans to cut over 4,000 jobs, nearly half the company's workforce, as part of an overhaul to embed AI across the fintech's operations.</p><p>\n              Block shares rose sharply on Friday, underscoring how markets are increasingly rewarding companies that present AI not as an experiment but as a driver of structural change.</p><p>\n              Dorsey also delivered a blunt warning to peers: most companies are behind the AI curve and will reach the same conclusion within a year.</p><p>\n              \"I'd rather get there honestly and on our own terms than be forced into it reactively.\"</p><p>\n              Until now, most executives have resisted those kinds of sweeping conclusions even as their firms pour billions into the technology.</p><p>\n              The comments are likely to sharpen a growing debate among executives, economists, investors and policymakers: is AI primarily a tool that helps workers do more - or one that enables companies to do the same with far fewer people?</p><p><b>AI JOB CUTS ACCELERATE</b></p><p>\n              AI-linked layoffs have been rising worldwide.</p><p>\n              According to a Reuters tally, companies have announced more than 61,000 job cuts tied to AI, including Amazon, Pinterest and Australia's Wisetech since November.</p><p>\n              But Block is among the highest-profile companies to cite AI explicitly as the primary driver of its reductions, rather than a secondary efficiency gain.</p><p>\n              Some investors argue that automation-related cuts are partly correcting for years of overhiring.</p><p>\n              \"AI is the new scapegoat,\" said Brian Jacobsen, chief economic strategist at Annex Wealth Management, on Friday.</p><p>\n              Still, markets are increasingly uneasy about AI's potential to upend jobs and profits amid an uncertain global economic backdrop.</p><p>\n              A widely circulated report this week by Citrini Research outlined a 2028 scenario in which unemployment rises to 10.2%, driven by rapid displacement of workers in software, logistics and delivery roles.</p><p><b>BUSINESSES HAVE BEEN MORE GUARDED</b></p><p>\n              Evidence is emerging that firms are beginning to see returns on their investment.</p><p>\n              Morgan Stanley analysts said this week there has been a steady rise in the number of companies reporting quantifiable benefits from AI adoption, based on an analysis of more than 10,000 earnings calls and fourth-quarter conference transcripts.</p><p>\n              Some 21% of S&amp;P 500 companies mentioned at least one measurable benefit, up from 15% in the third quarter and 10% in the final quarter of 2024. Greater AI use will boost companies' profit margins by 40 basis points this year, they estimate.</p><p>\n              But until now, most executives and policymakers have been more guarded than Dorsey when talking about AI and jobs.</p><p>\n              \"What we are seeing for the moment is that it's increasing productivity,\" ECB President Christine Lagarde told a committee of the European Parliament on Thursday. </p><p>\n              \"But we are not yet seeing consequences in terms of labour market and waves of redundancies that are feared, and that you know we will be extremely attentive going forward.\"</p><p>\n              At the World Economic Forum last month, JPMorgan Chase CEO Jamie Dimon said jobs would disappear but new ones would emerge. </p><p>\n              On Friday, Bank of America global economists Claudio Irigoyen and Antonio Gabriel said AI could ultimately affect a quarter of all jobs.</p><p>\n              AI shock, they said, will be disruptive for companies that do not survive and for workers who are displaced, but the economy will be better off because it will create new jobs and business opportunities that were previously prohibitive.</p><p>\n              Michael Ashley Schulman, partner and CIO at Running Point Capital Advisors, warned of unintended consequences from drastic steps like Block's.</p><p>\n              \"Dorsey's strategy suggests that less is more and that human capital has lost its competitive edge,\" he said.</p><p>\n              \"The question is whether the company is resetting to its smaller, nimbler startup days or whether it might lose the creativity and human intuition that built its most iconic products in the first place.\"    </p><p></p><p> (Reporting by Utkarsh Shetti and Manya Saini in Bengaluru, Romolo Tosiani and Philippe Leroy Beaulieu in Gdansk and Francesco Canepa in Frankfurt;Writing by Josephine MasonEditing by Louise Heavens)</p><p>\n            By Utkarsh Shetti, Manya Saini and Romolo Tosiani</p></div>",
            "link": "https://hk.marketscreener.com/news/dorsey-s-blunt-ai-warning-sharpens-debate-over-jobs-and-profits-ce7e5cdfdc8cf424",
            "pub_date": "2026-02-28 03:00:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UPDATE 11-Oil prices up about 2% as US and Iran extend talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/update-11-oil-prices-up-about-2-as-us-and-iran-extend-talks-ce7e5cdfdc8cf52d",
            "pub_date": "2026-02-28 03:00:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UniCredit says it has dropped EU court case against ECB over Russia",
            "description": "<div class=\"txt-s4 article-text\"><p>MILAN, Feb 27 (Reuters) - Italy's UniCredit in January withdrew an appeal lodged with the European Union General Court against a European Central Bank request that it exit Russia, a document published on Friday showed.</p><p>\n              The ECB formally warned UniCredit about Russia-related risks in April 2023, following up a year later with demands it cuts its activities in the sanctions-hit country. UniCredit sought a suspension of the ECB's order which the EU court rejected in November 2024.</p><!-- Article --><p>\n              Since then, UniCredit has been shrinking its Russia presence, facing pressure also from Italy's government.</p><p>\n              UniCredit ran a top-15 Russian bank when Moscow invaded Ukraine in February 2022. CEO Andrea Orcel has refused to exit the country at a loss. </p><p>\n              In its 2025 financial report, UniCredit said that continued interaction with the ECB had led the bank to reduce its Russian operations so as to meet the supervisor's demands.</p><p>\n              \"As a consequence, on January 30 UniCredit filed a notice with the European Union General Court withdrawing its appeal,\" it said. </p><p>\n              UniCredit last year halved the loans extended by its Russian unit to 600 million euros, but net profit rose to 814 million euros from 577 million in 2024. </p><p><b>ONGOING LAWSUIT</b></p><p>\n              UniCredit also said in the report that it filed in January its latest appeal in a long-running lawsuit involving its Russian unit. </p><p>\n              In 2023 a Russian energy firm sued UniCredit's local unit in a St. Petersburg court over guarantee claims totalling 444 million euros ($525 million).</p><p>\n              After issuing part of a guarantee package in favour of the Russian company on behalf of a German client, UniCredit failed to meet the Russian firm's payment claims due to sanctions.</p><p>\n              The Italian group's Russian unit AO UniCredit Bank lost in court against the energy firm in June 2024. Further appeals by both the group and AO Bank were rejected in February and August 2025, the latest document showed.</p><p>\n              UniCredit and its Russia unit lodged an appeal with the Supreme Court that was rejected in January this year. It immediately filed a complaint with the Supreme Court's section in charge of economic disputes, it said.</p><p>\n              ($1 = 0.8458 euros)</p><p></p><p>(Reporting by Valentina Za; Editing by Hugh Lawson)</p><p>\n            By Valentina Za</p></div>",
            "link": "https://hk.marketscreener.com/news/unicredit-says-it-has-dropped-eu-court-case-against-ecb-over-russia-ce7e5cdfdc8cf626",
            "pub_date": "2026-02-28 03:00:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cargo Traffic to Los Angeles Port Expected to Fall in Week Ending March 14",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cargo-traffic-to-los-angeles-port-expected-to-fall-in-week-ending-march-14-ce7e5cdfdc8cf726",
            "pub_date": "2026-02-28 02:51:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tariffs Influenced Novartis to Build Over 7 Plants in US, Trump Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tariffs-influenced-novartis-to-build-over-7-plants-in-us-trump-says-ce7e5cdfdc8dfe23",
            "pub_date": "2026-02-28 02:51:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC On The Week Ahead In Canada Economics",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-on-the-week-ahead-in-canada-economics-ce7e5cdfdc8dfe27",
            "pub_date": "2026-02-28 02:51:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global sugar output cut by 2.3 million tons due to India, report says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/global-sugar-output-cut-by-2-3-million-tons-due-to-india-report-says-ce7e5cdfdc8dff23",
            "pub_date": "2026-02-28 02:46:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Treasury official to discuss ways to deepen cooperation with Switzerland to tackle illicit finance threats-spokesperson",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-treasury-official-to-discuss-ways-to-deepen-cooperation-with-switzerland-to-tackle-illicit-fina-ce7e5cdfdc8dff27",
            "pub_date": "2026-02-28 02:46:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tariffs Influenced Novartis to Build Over 7 Plants in US, Trump Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tariffs-influenced-novartis-to-build-over-7-plants-in-us-trump-says-ce7e5cdfdc8dff25",
            "pub_date": "2026-02-28 02:46:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US charges 30 additional people who took part in Minnesota ICE protest at church, Bondi says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-charges-30-additional-people-who-took-part-in-minnesota-ice-protest-at-church-bondi-says-ce7e5cdfdc8df022",
            "pub_date": "2026-02-28 02:46:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Treasury to send senior official to Switzerland March 2-3 to meet with Swiss government and private sector officials on priorities for sanctions and countering illicit finance -Treasury spokesperson",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-treasury-to-send-senior-official-to-switzerland-march-2-3-to-meet-with-swiss-government-and-pri-ce7e5cdfdc8df020",
            "pub_date": "2026-02-28 02:46:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall-ce7e5cdfdc8df22c",
            "pub_date": "2026-02-28 02:46:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says of Iran: Sometimes you have to use force",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-says-of-iran-sometimes-you-have-to-use-force-ce7e5cdfdc88f52c",
            "pub_date": "2026-02-28 02:41:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ag Bondi: DOJ Unsealed Indictment Charging 30 More People Who Took Part in the \"Attack on Cities Church in Minnesota\"",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ag-bondi-doj-unsealed-indictment-charging-30-more-people-who-took-part-in-the-attack-on-cities-chu-ce7e5cdfdc8df520",
            "pub_date": "2026-02-28 02:35:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere gets $370 million 'alternative fuel' tax break from Trump's IRS",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cheniere-gets-370-million-alternative-fuel-tax-break-from-trump-s-irs-ce7e5cdfdc8df72c",
            "pub_date": "2026-02-28 02:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cristian Signoretto Sells 10,000 Eni Shares",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Eni Spa announced on Friday that Cristian Signoretto, director of the Global Gas &amp; LNG Portfolio, has sold 10,000 shares of the company.</p><p></p><!-- Article --><p>\n\n\nThe shares were sold at an average unit price of €19.1107, for a total value of €191,107.</p><p></p><p>\n\n\nEni's stock closed up 1.5% on Friday at €19.66 per share.</p><p></p><p>\n\n\nBy Michele Cirulli, Alliance News Reporter</p><p></p><p>\n\n\nComments and questions to redazione@alliancenews.com</p><p></p><p>\n\n\nCopyright 2026 Alliance News IS Italian Service Ltd. All rights reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/cristian-signoretto-sells-10-000-eni-shares-ce7e5cdfdc8afe2c",
            "pub_date": "2026-02-28 02:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Generate Biomedicines Shares Fall After Nasdaq Debut",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/generate-biomedicines-shares-fall-after-nasdaq-debut-ce7e5cdfdc8afe24",
            "pub_date": "2026-02-28 02:36:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US aims to bring in 4,500 white South Africans per month as refugees, document says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-aims-to-bring-in-4-500-white-south-africans-per-month-as-refugees-document-says-ce7e5cdfdc8af12d",
            "pub_date": "2026-02-28 02:26:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US wheat climbs to one-year peak as US-Iran tensions spook funds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-wheat-climbs-to-one-year-peak-as-us-iran-tensions-spook-funds-ce7e5cdfdc8af322",
            "pub_date": "2026-02-28 02:21:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump raises prospect of 'friendly takeover' of Cuba",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 27 (Reuters) - U.S. President Donald Trump on Friday raised the prospect of a \"friendly takeover\" of Cuba, telling reporters at the White House that Secretary of State Marco Rubio was dealing with the issue at a \"very high level.\"</p><p>\n              \"The Cuban government is talking with us, and they're in a big deal of trouble,\" Trump said as he left the White House for a trip to Texas. \"They have no money. They have no anything right now, but they're talking with us, and maybe we'll have a friendly takeover of Cuba.\"</p><!-- Article --><p></p><p> (Reporting by Steve Holland and Andrea Shalal; Editing by Doina Chiacu)</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-raises-prospect-of-friendly-takeover-of-cuba-ce7e5cdfdc8af525",
            "pub_date": "2026-02-28 02:16:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK to award Leonardo GBP1 billion military helicopter contract",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - The UK government is set to award Italian defence company Leonardo a contract to build a new fleet of military helicopters, a source close to the matter told AFP on Friday.</p><p></p><p>The deal, worth GBP1 billion (USD1.3 billion) for 23 medium-lift support helicopters, will help secure thousands of jobs at Britain's last military helicopter manufacturing site in Yeovil, southwest England.</p><!-- Article --><p></p><p>The future of the site, which employs roughly 3,000 people, was called into question after Leonardo signalled the prospect of closure if the contract did not go ahead.</p><p></p><p>The agreement comes just days before the March 1 deadline for the contract to be awarded.</p><p></p><p>The Unite union said the deal represented a \"tremendous victory\" for workers and the wider sector.</p><p></p><p>Leonardo was the only bidder left in the running for the much-delayed contract, after Airbus and Lockheed Martin both withdrew, according to press reports. </p><p></p><p>\"We cannot subsidise Yeovil forever\" without a government contract, Leonardo CEO Roberto Cingolani told investors on an earnings call in November.  </p><p></p><p>\"It's getting difficult for us to keep this big plant alive without institutional collaboration,\" he added.</p><p></p><p>NATO allies have committed to spending five per cent of their annual output on defence by 2035, as European members also faced pressure from US President Donald Trump to bolster defence spending.</p><p></p><p>UK Prime Minister Keir Starmer said last week that Britain needed to \"go faster\" in increasing military spending.</p><p></p><p>Leonardo's Yeovil site dates back to 1915. </p><p></p><p>The factory was originally built to manufacture aircraft to support the war effort during the First World War.</p><p></p><p>source: AFP</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/uk-to-award-leonardo-gbp1-billion-military-helicopter-contract-ce7e5cdfdc8bff27",
            "pub_date": "2026-02-28 02:10:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Measles cases in South Carolina rise by 6 to 985",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/measles-cases-in-south-carolina-rise-by-6-to-985-ce7e5cdfdc8bff25",
            "pub_date": "2026-02-28 02:10:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Slump as Technology Wobbles Amid Hot Inflation Print",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-slump-as-technology-wobbles-amid-hot-inflation-print-ce7e5cdfdc8bf021",
            "pub_date": "2026-02-28 02:10:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Carolina health department reports 6 new measles cases in Upstate, bringing outbreak total to 985",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-carolina-health-department-reports-6-new-measles-cases-in-upstate-bringing-outbreak-total-to-ce7e5cdfdc8bf123",
            "pub_date": "2026-02-28 02:10:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elliott Management Statement on London Stock Exchange Group plc",
            "description": "<div class=\"txt-s4 article-text\"><p>On February 27, 2026, Elliott Investment Management L.P. announced that it has issued a statement regarding the London Stock Exchange Group plc's announcement of its 2025 Full Year Results and had acknowledged the strong operational performance and initial value-creation measures introduced by the Company, which included a record share buyback program and margin-improvement initiatives. Elliott highlighted that the Company?s positive guidance, enhanced financial disclosures, and improved communication of its AI strategy reflect the robustness of the Company's business and while recognizing these as encouraging first steps, Elliott believes there remains an opportunity for additional value-enhancing actions. Elliott stated that it looks forward to fostering a constructive dialogue with the Company as the Company aims to unlock the full potential of its market-leading assets, narrow the valuation gap with industry peers, and generate long-term value.</p></div>",
            "link": "https://hk.marketscreener.com/news/elliott-management-statement-on-london-stock-exchange-group-plc-ce7e5cdfdc8bf121",
            "pub_date": "2026-02-28 02:10:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US drillers cut oil and gas rigs for first time in six weeks, says Baker Hughes",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-drillers-cut-oil-and-gas-rigs-for-first-time-in-six-weeks-baker-hughes-ce7e5cdfdc8bf320",
            "pub_date": "2026-02-28 02:10:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Billion Group Holdings files to withdraw US IPO",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/billion-group-holdings-files-to-withdraw-us-ipo-ce7e5cdfdc8bf42c",
            "pub_date": "2026-02-28 02:10:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Gainers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-midday-gainers-ce7e5cdfdc8bf422",
            "pub_date": "2026-02-28 02:10:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India and EU lock in WTO guardrails, digital trade rules in draft trade deal",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - The European Union and India plan to grant each other Most Favoured Nation status after their trade deal takes effect, preventing either from offering better tariff terms to other partners for five years, a draft of the text showed on Friday.</p><p>\n              India and the European Union struck a long-delayed deal last month aiming to slash tariffs on most goods and boost two-way trade amid growing global trade tensions elsewhere.</p><!-- Article --><p>\n              The deal, likely to be effective in a year after legislative ratification, is expected to double EU exports to India by 2032 by eliminating or reducing tariffs on 96.6% of traded goods by value, and will lead to savings of 4 billion euros  ($4.7 billion) in duties for European companies, the EU has said.</p><p>\n              India and the EU have said agriculture-related items like soya, beef, sugar, rice and dairy have been left out of the purview of the trade deal.</p><p>\n              Both sides have agreed to lock in commitments not to impose new import or export restrictions beyond World Trade Organization rules and to deepen cooperation on digital trade under a proposed free-trade agreement, a draft text released by India's trade ministry showed.</p><p>\n              To ease trade flows, New Delhi and Brussels will align food safety and plant health measures with WTO standards and streamline certification and audit procedures.</p><p>\n              The text also envisages enhanced customs cooperation and faster clearance of goods, with commitments becoming binding after ratification.</p><p>\n              The two sides will begin exchanging annual import data one year after the pact takes effect to monitor implementation and the use of tariff preferences. They also agreed to ensure non-discriminatory and accessible appeal procedures for customs decisions affecting imports, exports or goods in transit.</p><p>\n              On digital trade, India and the EU committed to curbing unjustified barriers and promoting an open and secure online environment.</p><p>\n              The draft recognises privacy as a fundamental right while preserving both sides' authority over personal data protection and cross-border transfer rules.</p><p>\n              It also promotes paperless trade and legal recognition of electronic contracts, signatures and authentication.</p><p>\n              Separately, the EU will mobilise finance and investment to support India's efforts to cut greenhouse gas emissions under the proposed pact, the draft showed.</p><p>\n              ($1 = 0.8461 euros)</p><p>\n              (Reporting by Manoj Kumar in New Delhi and Kanjyik Ghosh in Barcelona; Editing by Kevin Liffey and Hugh Lawson)</p><p>\n            By Manoj Kumar and Kanjyik Ghosh</p></div>",
            "link": "https://hk.marketscreener.com/news/india-and-eu-lock-in-wto-guardrails-digital-trade-rules-in-draft-trade-deal-ce7e5cdfdc8bf523",
            "pub_date": "2026-02-28 02:11:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss to wind down private bank that US accused of money laundering",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Switzerland's financial regulator FINMA said on Friday it would wind down MBaer Merchant Bank AG after Washington threatened to cut the private bank's access to the U.S. financial system for breaching sanctions against Iran and Russia.</p><p>\n              The U.S. Treasury Department had alleged that Zurich-based MBaer and its employees had facilitated corruption linked to Russian money laundering, as well as money laundering and terrorist financing on behalf of Iran's Islamic Revolutionary Guard Corps and its Quds Force, which are sanctioned by the United States.</p><!-- Article --><p>\n              FINMA said in a statement the bank lacked adequate anti-money-laundering controls, allowing clients to evade asset freezes. A regulatory investigation found that 80% of MBaer's business relationships carried heightened risks, and 98% of incoming assets came from high-risk clients.</p><p>\n              The bank repeatedly ignored its compliance department's recommendations, systematically failed to investigate the background of its business relationships and transactions, did not always fulfil its anti-money laundering obligations and, in several cases, executed transactions on behalf of clients who were on sanctions lists, FINMA said.</p><p>\n              \"The case is extremely serious,\" the regulator said. \"Through its conduct and inadequate organisation, (the bank) exposed itself and the Swiss financial centre to disproportionately high risks.\"</p><p>\n              FINMA said MBaer had almost 700 clients and more than 60 employees, and held client assets totalling 4.9 billion Swiss francs at the end of 2025.</p><p><b>BOARD OF DIRECTORS RESIGNED</b></p><p>\n              MBaer said in a statement on Friday it is now in liquidation and represented solely by the appointed liquidators, Daniel Staehelin and Lukas Bopp of law firm Kellerhals Carrard Basel KlG. The board of directors has resigned, the bank added.</p><p>\n              The bank said it had sufficient assets to satisfy all clients and creditors in full. However, after the U.S. intervention and the revocation of its licence, transaction restrictions mean it can currently make payments only in Swiss francs and up to 100,000 francs ($130,106.69) per client.</p><p>\n              FINMA said it had started enforcement proceedings against MBaer in 2024. These proceedings ended three weeks ago, but due to an MBaer appeal, which the bank withdrew on Friday, FINMA had been unable to implement the wind-down plans.</p><p>\n              A raft of international sanctions have been imposed on Russia since its invasion of Ukraine, and Iran has been heavily sanctioned by the U.S. for years. U.S. Treasury Secretary Scott Bessent said on Thursday that banks should be \"on notice\" that the Treasury will use the \"full force of our authorities\" to protect the integrity of the U.S. financial system.</p><p>\n              ($1 = 0.7686 Swiss francs)</p><p>\n               (Reporting by Linda Pasquini, Dave Graham and John O'Donnell, writing by Elizabeth Howcroft, editing by Thomas Seythal and Louise Heavens)</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-to-wind-down-private-bank-that-us-accused-of-money-laundering-ce7e5cdfda89f62d",
            "pub_date": "2026-02-28 02:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ford Attorney Says First Brands to Sell Factories Making Parts for Automaker",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ford-attorney-says-first-brands-to-sell-factories-making-parts-for-automaker-ce7e5cdfdc88f02d",
            "pub_date": "2026-02-28 02:01:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toronto Stocks Decline, But Remain On Track for Weekly Gains",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Shares on Canada's main exchange retreated Friday, echoing Wall Street's pullback on the last trading day of the month as investors grow increasingly worried about the boom in artificial intelligence. </p><!-- Article --><p>\n\n  In midday trading, the Toronto Stock Exchange's S&amp;P/TSX Composite Index was 0.5% lower at 34341.05. That ate into the prior session's advance but still has the index heading for a 1.5% rise this week and a gain of 7.6% in February. </p><p>\n\n  Technology stocks led the move lower, with Constellation Software leading the losers board with a fall of 2.8%. Heavily-weighted Shopify also dragged on the market, losing 4.7%. </p><p>\n\n  The blue-chip S&amp;P/TSX 60 was down 0.6% at 1974.52. </p><p>\n\n  Data released ahead of the opening bell Friday showed that Canada's economy contracted 0.6% in annual terms in the final quarter of last year, a slightly deeper contraction than expected. Still, the decline was driven largely by a large drawdown in business inventories despite a rise in exports, as well as a rise in both household and government spending. </p><p>\n\n  Economists said the underlying resilience reflected in the data is likely allow the Bank of Canada to remain on the sidelines, having already left its policy interest rate unchanged twice in a row amid heightened trade uncertainty and geopolitical risk. </p><br/><p>\n  Other market movers: </p><p>\n\n  TransAlta's shares climbed 4.4% to C$18.59 after the power-generation company recorded a narrowed loss in the fourth quarter of 2025. </p><p>\n\n  Laurentian Bank was little changed after the lender reported a loss for the first quarter of its fiscal year, contrasting with stronger-than-expected underlying earnings for Canada's biggest banks. </p><p>\n\n  AtkinsRealis was 2.9% lower at C$93.29 despite the engineering and project management company posting a rise in profit and revenue in the fourth quarter, with momentum expected to carry into 2026. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1255ET</p></div>",
            "link": "https://hk.marketscreener.com/news/toronto-stocks-decline-but-remain-on-track-for-weekly-gains-ce7e5cdfdc88f12c",
            "pub_date": "2026-02-28 02:01:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flagship-backed Generate Biomedicines shares fall 6% in Nasdaq debut",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/flagship-backed-generate-biomedicines-shares-fall-6-in-nasdaq-debut-ce7e5cdfdc88f223",
            "pub_date": "2026-02-28 01:56:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Subaru Recalls About 70,000 Vehicles Due to Fire Risk",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kelly Cloonan </p><br/><p>\n  Subaru of America recalled roughly 70,000 vehicles over fire risk due to a faulty seal on the vehicles' fuel tank cap. </p><!-- Article --><p>\n\n  The National Highway Traffic Safety Administration said the recall affects certain 2026 Crosstrek hybrid and 2025 Forester hybrid vehicles. </p><p>\n\n  When the fuel tank in those models is near full capacity, higher temperatures could cause the fuel to expand and spill out of the filler neck due to an insufficient seal on the fuel cap, the NHTSA said. </p><p>\n\n  The NHTSA said dealers will replace the fuel filler cap gasket free of charge. It advises vehicle owners to park outside and away from structures and to limit the fuel level to 50% until replacing the fuel cap. </p><p>\n\n  Owner notification letters are expected to be mailed March 25. </p><br/><p>\n  Write to Kelly Cloonan at kelly.cloonan@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1251ET</p></div>",
            "link": "https://hk.marketscreener.com/news/subaru-recalls-about-70-000-vehicles-due-to-fire-risk-ce7e5cdfdc88f324",
            "pub_date": "2026-02-28 01:56:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF SE Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>BASF SE reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was EUR 59,657 million compared to EUR 61,444 million a year ago. Net income was EUR 1,619 million compared to EUR 1,298 million a year ago.</p><p>Basic earnings per share from continuing operations was EUR 1.63 compared to EUR 1.29 a year ago. Basic earnings per share was EUR 1.82 compared to EUR 1.45 a year ago. Diluted earnings per share was EUR 1.81 compared to EUR 1.45 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/basf-se-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdc88f426",
            "pub_date": "2026-02-28 01:56:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UnitedHealth caps employee pay raises to 2%, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/unitedhealth-caps-employee-pay-raises-to-2-bloomberg-news-reports-ce7e5cdfdc88f425",
            "pub_date": "2026-02-28 01:56:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}