{
    "data": [
        {
            "title": "Public Service Enterprise Group Incorporated Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Public Service Enterprise Group Incorporated reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was USD 12,168 million compared to USD 10,290 million a year ago. Net income was USD 2,111 million compared to USD 1,772 million a year ago.</p><p>Basic earnings per share from continuing operations was USD 4.22 compared to USD 3.54 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/public-service-enterprise-group-incorporated-reports-earnings-results-for-the-full-year-ended-decemb-ce7e5cd9dc8afe21",
            "pub_date": "2026-02-27 01:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Insperity, Inc. and Workday, Inc. Announce General Availability of Insperity Hrscale",
            "description": "<div class=\"txt-s4 article-text\"><p>Insperity, Inc. and Workday, Inc. announced the general availability of the Insperity HRScale?? solution, a comprehensive HR services and technology offering built for small and midsized businesses. Insperity HRScale combines Insperity's professional employer organization (PEO) model and full-service HR support with the powerful Workday Human Capital Management (HCM) suite, creating a dynamic new way for businesses to streamline HR administration, strengthen HR compliance and gain workforce insights - so they can focus on running and growing their businesses.</p><p>Small and midsized businesses continue to play a critical role in driving the nation's economy and creating new jobs. However, many struggle to meet the growing complexity around payroll, benefits, HR compliance, and hiring. Insperity HRScale is built to support these organizations by handling much of the day-to-day HR administrative work, while offering modern technology that brings people and data together in one centralized platform.</p><!-- Article --><p>Built for Simplicity and Future Growth: Insperity HRScale is preconfigured with many HR best practices for a faster deployment and simpler setup. It includes Workday solutions such as Workday HCM, U.S. Payroll, Absence Management and Time Tracking, paired with Insperity's hands-on HR services. Customers are using Insperity HRScale for: Payroll and HR administration, providing end-to-end managed services for payroll processing, tax reporting, and strategic human capital management.</p><p>Employee benefits and leave management, including offering Insperity-sponsored benefits to employees and providing leave administration to support compliance with FMLA, disability, and state leave requirements. HR compliance support, with HR consultants and tools supporting evolving laws and filings. Top talent acquisition and retention, by helping deliver people-first, culture-oriented employee experiences.</p><p>Performance enablement guidance, helping managers engage and develop their teams through employee reviews, goal alignment, and succession planning. Data-driven decisions, through actionable analytics and workforce insights that inform people strategy. Fueled by real-time data in Workday's unified system and powered by Insperity's premium HR services, customers can make faster, more informed decisions about their workforce.</p></div>",
            "link": "https://hk.marketscreener.com/news/insperity-inc-and-workday-inc-announce-general-availability-of-insperity-hrscale-ce7e5cd9dc8af126",
            "pub_date": "2026-02-27 01:10:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Paychex, Inc. Unveils Cutting-Edge AI and Agentic Workforce Management Solutions",
            "description": "<div class=\"txt-s4 article-text\"><p>Paychex, Inc. announced new AI-driven advancements within its Paycor®? and Paychex Flex®? platforms to streamline workforce management and increase efficiency for businesses.</p><p>Major enhancements to the Paycor Smart Scheduler and new automated time and attendance features across both platforms embody the company's commitment to infusing AI technology in its HCM platforms to democratize access to enterprise-grade AI innovations. According to Nucleus Research, modern workforce management automation can deliver measurable business value, returning an average of $12.24 for every dollar invested due to streamlined scheduling, improved staffing alignment, and reduced errors. Additionally, the research and industry analyst firm reports that automated scheduling can reduce scheduling time by up to 50% and meaningfully improve coverage and labor stability, making intelligent scheduling an essential tool for operational efficiency and workforce retention.</p><!-- Article --><p>Key AI-driven enhancements include: Paycor Smart Scheduler: AI-powered scheduling updates designed for human-in-the-loop scheduling, utilizing automated, rules-constrained intelligence that matches shifts to employees based on skills, certifications, availability, and business rules. The Paycor Smart Scheduler improves manager productivity and worker efficiency by providing transparency and insights on schedule recommendations, helping organizations place the right people in the right shifts at the right time, reducing scheduling errors and enhancing labor optimization. Paycor Agentic Timesheet Approvals: Scores each timecard against defined thresholds, such as missed punch, schedule variance, and geo-restrictions, enabling auto-approval.</p><p>Only anomalies and exceptions are flagged for human review, helping streamline the timesheet approval process leading up to running payroll. Paycor Auto-Shifts: Creates optimized shift plans based on pre-set guardrails, including hour limits, rest periods, and fair-workweek rules, resulting in faster schedule builds, fewer errors, and better shift access for employees. Paychex Flex AI-Powered Time-Off: Offers historical insights that help to identify peak PTO periods and individual patterns.</p><p>Intelligent availability introduces AI-assisted recurring availability and min/max hour preferences, simplifying workforce coverage and reducing employee PTO conflicts. (Coming soon) Paychex Flex Time-Off Request Agent: Provides an assistant-guided review process for time-off requests, offering recommendations based on factors including holidays, staffing thresholds, availability, and scheduling conflicts. The outputs highlight potential issues and provide the rationale behind recommendations to help avoid friction during the time-off review process.</p></div>",
            "link": "https://hk.marketscreener.com/news/paychex-inc-unveils-cutting-edge-ai-and-agentic-workforce-management-solutions-ce7e5cd9dc8af125",
            "pub_date": "2026-02-27 01:10:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell puts some of its Shell Ventures portfolio under review, sources say",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 26 (Reuters) - Shell has put under review the investments it holds in some of the companies under its Shell Ventures portfolio, two sources familiar with the matter said. </p><p>\n              The British oil major will retain a majority of its Ventures investments, one of the sources said. The corporate venturing fund has interests in start-ups and other early-stage businesses focused on sectors including power, emissions management and mobility.</p><!-- Article --><p>\n               (Reporting by Stephanie KellyEditing by Ros Russell)</p></div>",
            "link": "https://hk.marketscreener.com/news/shell-puts-some-of-its-shell-ventures-portfolio-under-review-sources-say-ce7e5cd9dc8af623",
            "pub_date": "2026-02-27 01:10:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gains for Rolls-Royce, LSEG offset mining slump",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - The FTSE 100 struck another record high on Thursday with well received earnings from the likes of Howden Joinery, LSEG and Rolls-Royce offsetting hefty falls for miners.</p><p></p><p>\"Three cheers for the UK stock market as it leaves the US in the rear-view mirror in performance terms this year,\" said Dan Coatsworth, head of markets at AJ Bell.</p><!-- Article --><p></p><p>The FTSE 100 index ended up 40.29 points, 0.4%, at 10,846.70, a record close. It had earlier hit a record high of 10,856.80, and is up 9.0% year-to-date. </p><p></p><p>The FTSE 250 ended up 82.11 points, 0.4%, at 23,719.00, but the AIM All-Share closed down 1.56 points, 0.2%, at 815.23.</p><p></p><p>The Cboe UK 100 was up 0.4% at 1,080.54, the Cboe UK 250 was 0.3% higher at 20,946.76, and the Cboe Small Companies Index advanced 0.5% at 18,502.12.</p><p></p><p>AJ Bell's Coatsworth said the \"resilient\" showing from the UK stock market was \"even more striking when looking at the miserable turn from Wall Street.\"</p><p></p><p>\"The Nasdaq got off to a bad start, weighed down by a negative reaction to Nvidia's results and growing discontent around all things AI-related. Tech stocks have had their moment in the sun and investors look ready to move onto another potential source of riches,\" he suggested. </p><p></p><p>Stocks in New York were mostly lower with tech stocks on the back foot. The Dow Jones Industrial Average was up slightly, the S&amp;P 500 index was 0.7% lower, and the Nasdaq Composite declined 1.3%. </p><p></p><p>Nvidia fell 4.1% despite blow-out fourth quarter earnings and guidance as the AI trade continues to be questioned. </p><p></p><p>JPMorgan analyst Harlan Sur said Nvidia is clearly \"firing on all cylinders, both internally and across its vast supply chain,\" but \"even so, the stock response suggests investors were left wanting more.\"</p><p></p><p>Sur thinks this is tied to continued uncertainty around the growth trajectory for Nvidia's Data Center business in financial 2027, given massively expanded capex budgets for key customers.</p><p></p><p>In European equities on Thursday, the CAC 40 in Paris closed up 0.7%, while the DAX 40 in Frankfurt rose 0.5%.</p><p></p><p>The pound was lower at USD1.3513 on Thursday afternoon, from USD1.3537 at the equities close on Wednesday. </p><p></p><p>The euro stood lower at USD1.1792, from USD1.1804. Against the yen, the dollar was trading lower at JPY156.20, compared to JPY156.39.</p><p></p><p>The yield on the US 10-year Treasury narrowed to 4.03% on Thursday from 4.05% on Wednesday. The yield on the US 30-year Treasury trimmed to 4.68% from 4.69%.</p><p></p><p>In London, Howden Joinery and London Stock Exchange Group vied for top billing on the FTSE 100, with Rolls-Royce flying closely behind.</p><p></p><p>Kitchen supplier Howden Joinery leapt 11% as it said it was \"well placed to outperform our competitors\" and reported a profit that beat expectations. </p><p></p><p>Pretax profit climbed 5.1% to GBP344.9 million in the financial year ended December 27, from GBP328.1 million in 2024. It beat the upper end of the company-compiled consensus range of GBP322 million to GBP343 million.</p><p></p><p>Analysts at Stifel said it is \"reassuring to see Howden continuing to outperform a sluggish UK kitchen market. Howden remains a high-quality compounder with decent exposure to UK [repair, maintenance, and improvement] recovery.\"</p><p></p><p>LSEG rose 9.1% as it launched a new GBP3 billion share buyback as profit soared on the back of broad-based income growth. </p><p></p><p>The exchange operator and data provider said pretax profit rose 57% to GBP1.97 billion in 2025 from GBP1.26 billion the year prior.</p><p></p><p>Total income excluding recoveries was up 5.8% to GBP8.99 billion from GBP8.49 billion. Including recoveries, it rose 5.5% to GBP9.35 billion from GBP8.89 billion. </p><p></p><p>For 2026, LSEG forecast organic constant currency growth in total income (excluding recoveries) of 6.5% to 7.5% and constant currency earnings before interest, tax, depreciation margin growth of 80 basis points to 100 bps.</p><p></p><p>In 2025, Ebitda margin improved to 50.3% from 48.8% in 2024.</p><p></p><p>In addition, LSEG targets equity free cash flow of at least GBP2.7 billion, up from GBP2.4 billion in 2025. </p><p></p><p>Meanwhile, Rolls-Royce climbed 3.2% as it set out bullish new mid-term financial targets and launched its first multi-year share buyback programme as it delivered annual results ahead of forecast. </p><p></p><p>In 2025, pretax profit more than trebled to GBP6.94 billion from GBP2.23 billion, with revenue up 12% to GBP21.21 billion from GBP18.91 billion. </p><p></p><p>Looking ahead to 2028, Rolls-Royce set out up upgraded mid-term targets including underlying operating profit of GBP4.9 billion-GBP5.2 billion and free cash flow of GBP5.0 billion-GBP5.3 billion. </p><p></p><p>It had previously guided to underlying operating profit of GBP3.6 billion-GBP3.9 billion and free cash flow of GBP4.2 billion-GBP4.5 billion.</p><p></p><p>In addition, the firm announced its first multi-year buyback programme of GBP7 billion to GBP9 billion for 2026 through to 2028, with a GBP2.5 billion chunk to be completed this year. </p><p></p><p>David Perry at JPMorgan said the buyback was the \"biggest positive.\"</p><p></p><p>\"For many decades investors have hoped that Rolls-Royce could convert its strong technology into a cash generating machine that could deliver strong shareholder returns. That hope is now a reality.\"</p><p></p><p>But it was a gloomy day for investors in Hikma Pharmaceuticals which plummeted 17%.</p><p></p><p>The London-based pharmaceutical maker withdrew mid-term guidance and delivered a softer than hoped outlook for the current financial year. It also shook up its top management team.</p><p></p><p>Panmure Liberum analyst Seb Jantet said: \"What Hikma needed was a reassuring set of results but that isn't what the company delivered this morning. While FY25 was in line with expectations, the guidance for FY26 was disappointing, particularly in Injectables and it likely to trigger circa 5% downgrades to consensus numbers.\"</p><p></p><p>Aside from Hikma, blue-chip fallers were dominated by mining stocks. Fresnillo fell 5.1%, Antofagasta fell 4.4%, Anglo American fell 3.6%, reversing Wednesday's gains. </p><p></p><p>Gold eased to USD5,180.61 an ounce on Thursday from USD5,204.64 on Wednesday. </p><p></p><p>On the FTSE 250, advertising agency WPP enjoyed a wild ride as it unveiled a multi-year strategic overhaul aimed at simplifying the group and restoring organic growth, as it reported a fall in earnings for 2025 and cut its dividend.</p><p></p><p>Shares traded as much as 9.6% lower before closing 4.2% in the green as investors assessed the plans. </p><p></p><p>Chief Executive Officer Cindy Rose, who has led WPP for six months, said its new plan, branded \"Elevate28\", will transition WPP from a holding company structure into a \"single company\" streamlined into four operating units – WPP Media, WPP Creative, WPP Production and WPP Enterprise Solutions.</p><p></p><p>Reflecting her confidence, CEO Rose purchased 50,000 shares in WPP for 269 pence each. </p><p></p><p>Brent oil traded higher at USD72.58 a barrel on Thursday afternoon, from USD70.76 late Wednesday.</p><p></p><p>The biggest risers on the FTSE 100 were Howden Joinery, up 92.00p at 948.00p, London Stock Exchange Group, up 706.00p at 8,500.00p, Relx, up 110.00p at 2,525.00p, Experian, up 116.00p at 2,778.00p and Haleon, up 16.30p at 394.20p.</p><p></p><p>The biggest fallers on the FTSE 100 were Hikma Pharmaceuticals, down 279.00p at 1,373.00p, Fresnillo, down 222.00p at 4,104.00p, Antofagasta, down 195.00p at 4,260.00p, Anglo American, down 136.00p at 3,693.00p and Metlen Energy &amp; Metals, down 1.30p at 36.35p.</p><p></p><p>Friday's global economic calendar has French and German inflation readings, a GDP print in Canada, UK consumer confidence figures and US PPI data. </p><p></p><p>Friday's UK corporate calendar has full-year results from property portal Rightmove, educational materials publisher Pearson, and aerospace firm Melrose. </p><p></p><p>By Jeremy Cutler, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/gains-for-rolls-royce-lseg-offset-mining-slump-ce7e5cd9dc8bfe27",
            "pub_date": "2026-02-27 01:10:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nova Technology says 2025 net profit at T$1.04 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nova-technology-says-2025-net-profit-at-t-1-04-bln-ce7e5cd9dc8bfe25",
            "pub_date": "2026-02-27 01:10:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia's Sberbank sees 2026 corporate lending growth at 10-12%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russia-s-sberbank-sees-2026-corporate-lending-growth-at-10-12-ce7e5cd9dc8bff21",
            "pub_date": "2026-02-27 01:10:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equinix, Canada's CPPIB near deal to buy Nordic data-center operator atNorth, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Equinix and Canada Pension Plan Investment Board are close to reaching a deal to acquire atNorth, a pan-Nordic data-center operator backed by Partners Group, Bloomberg News reported on Thursday, citing people familiar with the matter.</p><p>\n              The deal, which may be announced in the coming days, could value atNorth at about $4 billion including debt, according to the report.</p><!-- Article --><p>\n              CPPIB and Partners Group declined Reuters requests for comment, while Equinix did not immediately respond. </p><p>\n              Data-centre operator Equinix has been expanding aggressively to capture rising demand for digital infrastructure, while pension funds have been increasing exposure to data-center assets.</p><p>\n              Iceland-based atNorth operates data centres across Iceland, Denmark, Sweden and Finland, catering to hyperscale cloud, AI and high-performance computing customers. Private equity firm Partners Group acquired the business in 2022 for an undisclosed amount and has since supported its regional expansion.</p><p></p><p> (Reporting by Kritika Lamba in Bengaluru; Editing by Shailesh Kuber)</p></div>",
            "link": "https://hk.marketscreener.com/news/equinix-canada-s-cppib-near-deal-to-buy-nordic-data-center-operator-atnorth-bloomberg-news-reports-ce7e5cd9dc88fe21",
            "pub_date": "2026-02-27 01:05:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Weary U.S. Farmers Brace for More Uncertainty as Profits Remain Elusive",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kirk Maltais </p><p>\n\n  U.S. farmers are receiving more help from the Trump administration this year, but for many, it's simply not enough. </p><!-- Article --><p>\n\n  Farmers, frustrated by years of thin margins, are bracing for another difficult year as less than half are forecast to turn a profit in 2026. </p><p>\n\n  Steve Turner farms 3,250 acres of corn, soybeans, and other crops in Chandlerville, Ill., alongside his wife and two sons. His sons also operate a small trucking firm, with one of his sons selling seeds on the side. Jobs outside of the farm are common in rural areas, and they've become increasingly important for farmers needing to scrape by in tough times. </p><p>\n\n  \"In these economic times, diversified income becomes a need and necessity,\" said Turner. </p><p>\n\n  For the first time since Covid-19 in 2020, under 50% of producers are expected to be in the black, according to data from the Federal Agricultural Mortgage Corp., otherwise known as Farmer Mac. Fears of another tough year in farm country have lenders cautious ahead of the start of spring planting in April, with farm debt estimated by the Department of Agriculture to rise by 5.2% in 2026 to $625 billion, a new record. </p><p>\n\n  \"We see farmers saying 'yeah, it's getting too hard,'\" said Shelby Bass, author of an outlook published by agricultural lender AgAmerica this month. </p><p>\n\n  That's even with the $44 billion in direct payments coming from the federal government this year - the second-largest swath of federal aid to farmers on record. This is the first week for farmers to file to receive their share of an $11 billion tranche of so-called \"bridge payments,\" according to the USDA. </p><p>\n\n  While farmers welcome the help, the aid comes after years of falling behind financially, meaning that a lot of the money will go directly back to creditors. With costs for necessary inputs such as fertilizer and seeds higher than they were at this time last year, cash-strapped farmers are stuck in a vicious cycle. </p><p>\n\n  \"If you're having to spend a lot of your money on debt payments, you have a lot less cash available,\" said Carrie Litkowski, senior economist with the USDA's Economic Research Service, during a presentation at the USDA's Agricultural Outlook Forum in Arlington, Va. last week. </p><p>\n\n  Amplifying the crunch in working capital is the Supreme Court ruling Friday that global tariffs under the International Emergency Economic Powers Act were illegal. President Trump has said that his tariff campaign will continue using different statutes, instituting a new 10% global tariff using Section 122 of the Trade Act of 1974, and promising even more. </p><p>\n\n  A new round of tariff wars is the last thing farmers like Turner want to hear. \"It adds a lot of market uncertainty out here, and a lot of volatility,\" he said. \"Usually, that doesn't work long-term for our profitability.\" </p><p>\n\n  According to Turner, his budget going into planting season is tight. \"Every input we do to raise a crop is higher than last year,\" said Turner. \"It makes it very hard to set up this year being very profitable.\" </p><p>\n\n  Some 93% of agricultural lenders surveyed by Farmer Mac said that they expect farm debt to grow over the course of this year. A separate study from Purdue University shows that farmers in Indiana will likely lose money for almost any row crop they plant this spring. </p><p>\n\n  Corn planted in average soil with a typical corn-soybean crop rotation is projected to lose nearly $150 an acre, while soybeans planted in a normal rotation are seen losing almost $90 an acre. Planting corn is more expensive due to the amount of fertilizer it requires. </p><p>\n\n  On the other side, prices for corn and soybeans have improved since finding lows last summer. But they remain roughly 80 cents to 90 cents a bushel off from what Purdue forecasts as \"break-even levels\" for farmers working on average productivity soil. </p><p>\n\n  But forecasts are assuming that a major weather event doesn't completely reshape the market, which is not a safe bet. In spring 2019, lackluster farming economics turned around as flooding prevented many farmers from planting crops. While taking many Midwestern farmers out for the year, the flooding pushed corn prices up 20% by that summer. </p><p>\n\n  Absent severe weather disturbances in the Corn Belt, farmers are left in a position where they must once again withstand economic pressure that doesn't appear to be going anywhere. </p><p>\n\n  \"Let's just say this is a continuing cycle,\" said Turner. \"It's going to get very difficult for a lot of guys out here.\" </p><p>\n\n  Write to Kirk Maltais at kirk.maltais@wsj.com </p><br/><p>\n  (MORE TO FOLLOW) Dow Jones Newswires</p><p>\n\n  02-26-26 1155ET</p></div>",
            "link": "https://hk.marketscreener.com/news/weary-u-s-farmers-brace-for-more-uncertainty-as-profits-remain-elusive-ce7e5cd9dc88fe20",
            "pub_date": "2026-02-27 01:05:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold ticks up on safe-haven bids; markets eye US-Iran talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-ticks-up-on-safe-haven-bids-markets-eye-us-iran-talks-ce7e5cd9dc88f126",
            "pub_date": "2026-02-27 01:05:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EBay to cut 6% of its workforce in a new cost-cutting plan",
            "description": "<div class=\"txt-s4 article-text\"><p>eBay said it will make about 800 redundancies, or nearly 6% of its global workforce, as part of a streamlining plan aimed at reinvesting in its strategic priorities. As of December 31, 2025, the group had 12,300 employees, according to its latest annual report. <br/><br/>The cuts, which affect the entire organization, follow a review of its operating model and the removal of duplication. They come as eBay continues to invest in artificial intelligence, rolling out internal tools and integrating AI solutions for buyers and sellers, as well as a partnership with OpenAI around a so-called \"agentic\" browser. <br/><br/>The group also announced the acquisition of Depop for about $1.2bn to strengthen its position amongst under-34s. <br/><br/>In a competitive environment dominated by Amazon, Walmart, Etsy, TikTok Shop, Temu and Shein, eBay is betting on its priority categories, including collectibles and automotive parts, where gross merchandise volume rose by over 16% year-on-year in Q4. <br/><br/>Separately, the company reached a settlement with a Massachusetts couple who were targeted in a harassment campaign led by former employees, two of whom were convicted in 2022.</p></div>",
            "link": "https://hk.marketscreener.com/news/ebay-to-cut-6-of-its-workforce-in-a-new-cost-cutting-plan-ce7e5cd9dc88f124",
            "pub_date": "2026-02-27 01:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Compal Electronics says co acquires AC Advanced Tech, L.P. fund for $85 mln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/compal-electronics-says-co-acquires-ac-advanced-tech-l-p-fund-for-85-mln-ce7e5cd9dc88f227",
            "pub_date": "2026-02-27 01:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HCLTech and IIT Kanpur to advance deep tech innovation for GCCs",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hcltech-and-iit-kanpur-to-advance-deep-tech-innovation-for-gccs-ce7e5cd9dc88f320",
            "pub_date": "2026-02-27 01:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deep Source expects net profit increase by HK$468 million for FY",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/deep-source-expects-net-profit-increase-by-hk-468-million-for-fy-ce7e5cd9dc88f624",
            "pub_date": "2026-02-27 01:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Carrier Introduces AquaEdge®? 30CF Chiller to Enhance Data Center Reliability and Uptime",
            "description": "<div class=\"txt-s4 article-text\"><p>Carrier introduced the AquaEdge®? 30CF air-cooled centrifugal chiller, designed to help data center operators maintain continuous cooling performance and protect uptime under real-world operating conditions. Carrier is a part of Carrier Global Corporation, global leader in intelligent climate and energy solutions.</p><p>As AI, cloud and high-performance computing workloads push data center infrastructure closer to thermal and electrical limits, predictable performance across changing conditions has become as critical as peak cooling capacity. The AquaEdge®? 30CF expands Carrier QuantumLeap??, the company's portfolio of integrated thermal management solutions for the data center market.</p><!-- Article --><p>Designed to address the limitations of traditional air-cooled designs, the AquaEdge®? 30 CF supports operation from -20degF to 140degF, helping maintain cooling continuity during extreme heat, grid events and across diverse site conditions. In the event of a power interruption, the chiller can restore 100% cooling capacity in under three minutes, providing an added layer of protection for mission-critical operations.</p><p>The chiller can deliver more than 3 MW of cooling, depending on ambient conditions.</p></div>",
            "link": "https://hk.marketscreener.com/news/carrier-introduces-aquaedge-30cf-chiller-to-enhance-data-center-reliability-and-uptime-ce7e5cd9dc88f722",
            "pub_date": "2026-02-27 01:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goldlion Holdings expects loss attributable of HK$39.2 million for 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/goldlion-holdings-expects-loss-attributable-of-hk-39-2-million-for-2025-ce7e5cd9dc89fe22",
            "pub_date": "2026-02-27 01:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Standard Chartered bought back 492,000 shares on other exchanges for GBP8.9 million on Feb 25, HKEX says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/standard-chartered-bought-back-492-000-shares-on-other-exchanges-for-gbp8-9-million-on-feb-25-hkex-ce7e5cd9dc89ff2d",
            "pub_date": "2026-02-27 01:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE Midday : Canola, Crude Oil Move Higher",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  WINNIPEG, Manitoba--Canola futures on the Intercontinental Exchange were showing small gains in the middle of Thursday trading, receiving support from comparable oils. </p><p>\n\n  Chicago soyoil and European rapeseed were higher, while Malaysian palm oil was lower. Chicago soybeans and soymeal also turned negative. Crude oil gained more than US$1 per barrel amid growing tensions between the United States and Iran. Both countries met for peace talks in Geneva Thursday. </p><!-- Article --><p>\n\n  The Canadian dollar was steady compared to Wednesday's close. </p><p>\n\n  About 41,600 canola contracts have traded at 10:20 CST. Prices in Canadian dollars per metric tonne: </p><pre style=\"font-size:14px\">\n\n \n           Price      Change \nMay       692.80     up 1.40 \nJul       703.60     up 1.80 \nNov       698.00     up 1.90 \nJan       705.20     up 1.70 \n </pre><p>\n\n  Source: Commodity News Service Canada, news@marketsfarm.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1148ET</p></div>",
            "link": "https://hk.marketscreener.com/news/ice-midday-canola-crude-oil-move-higher-ce7e5cd9dc89ff23",
            "pub_date": "2026-02-27 01:05:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Afghanistan has launched retaliatory attacks on Pakistani border posts, Taliban military unit says",
            "description": "<div class=\"txt-s4 article-text\"><p>KABUL, Feb 26 (Reuters) - Afghanistan has launched offensive operations against Pakistani military positions along the border, the Taliban's spokesperson said on Thursday, in retaliation for recent Pakistani airstrikes. </p><p>\n              \"In response to repeated provocations and violations by Pakistani military circles, large-scale offensive operations have been launched against Pakistani military positions and installations along the Durand Line,\" Zabihullah Mujahid, spoksperson for the Taliban administration, said in a post on X.</p><!-- Article --><p></p><p> (Reporting by Mohammad Yunus Yawar and Sayed Hassib in Kabul; writing by Ariba Shahid; Editing by Hugh Lawson)</p></div>",
            "link": "https://hk.marketscreener.com/news/afghanistan-has-launched-retaliatory-attacks-on-pakistani-border-posts-taliban-military-unit-says-ce7e5cd9dc89f520",
            "pub_date": "2026-02-27 00:50:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "USITC to probe impact of revoking permanent normal trade ties China products",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - The U.S. International Trade Commission said on Thursday it would investigate the economic impact of revoking permanent normal trade relations treatment for all Chinese products over a six-year period.</p><p></p><p> (Reporting by Daphne Psaledakis and Bhargav Acharya;Editing by David Ljunggren)</p></div>",
            "link": "https://hk.marketscreener.com/news/usitc-to-probe-impact-of-revoking-permanent-normal-trade-ties-china-products-ce7e5cd9dd80fe23",
            "pub_date": "2026-02-27 00:45:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore's Wilmar profit rises on feed and industrial products boost",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/singapore-s-wilmar-profit-rises-on-feed-and-industrial-products-boost-ce7e5cd9dd80fe26",
            "pub_date": "2026-02-27 00:45:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Belgium wants more nuclear power production, Engie's CFO says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/belgium-wants-more-nuclear-power-production-engie-s-cfo-says-ce7e5cd9dd80f024",
            "pub_date": "2026-02-27 00:45:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Central U.S. Factory Activity Accelerates -- Kansas City Fed",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Jessica Coacci </p><p>\n\n  Manufacturing activity in the central U.S. rose in February, as most sub indexes were positive month over month except for those tracking employment. </p><!-- Article --><p>\n\n  The Federal Reserve Bank of Kansas City said Thursday that its Tenth District Manufacturing Survey's composite index rose to 5 from 0 in January. The zero-level marks the dividing point between expansion and contraction in the sector. </p><p>\n\n  \"Price growth cooled slightly from last month, but nearly half of firms reported changing prices more often than last year,\" said Cortney Cowley, assistant vice president at the Kansas City Fed. </p><p>\n\n  The production and new orders indexes grew moderately, the survey said. Expectations for future activity ticked up with the composite index increasing to 15 from 7, as expectations for employment edged higher. </p><p>\n\n  In addition, one third of firms reported that they will be able to pass through 0 to 20% of higher costs in the next 12 months. </p><p>\n\n  Prices paid for raw materials eased slightly from last month, the Kansas City Fed added. </p><p>\n\n  The manufacturing survey covers activity in the Tenth District, which includes Colorado, Oklahoma, Wyoming, Nebraska, Kansas, the northern half of New Mexico and the western third of Missouri. </p><p>\n\n  Write to Jessica Coacci at jessica.coacci@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1140ET</p></div>",
            "link": "https://hk.marketscreener.com/news/central-u-s-factory-activity-accelerates-kansas-city-fed-ce7e5cd9dd80f123",
            "pub_date": "2026-02-27 00:45:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canadian Imperial Bank of Commerce Reports Earnings Results for the First Quarter Ended January 31, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Canadian Imperial Bank of Commerce reported earnings results for the first quarter ended January 31, 2026. For the first quarter, the company reported net interest income was CAD 4,308 million compared to CAD 3,801 million a year ago. Net income was CAD 3,093 million compared to CAD 2,163 million a year ago.</p><p>Basic earnings per share from continuing operations was CAD 3.23 compared to CAD 2.2 a year ago. Diluted earnings per share from continuing operations was CAD 3.21 compared to CAD 2.19 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/canadian-imperial-bank-of-commerce-reports-earnings-results-for-the-first-quarter-ended-january-31-ce7e5cd9dd80f32d",
            "pub_date": "2026-02-27 00:46:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS executive says one item remains in migration of Credit Suisse clients",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ubs-executive-says-one-item-remains-in-migration-of-credit-suisse-clients-ce7e5cd9dd80f520",
            "pub_date": "2026-02-27 00:40:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target Offers 'Attractive Upside' Amid Management's Growth Drive, Oppenheimer Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-offers-attractive-upside-amid-management-s-growth-drive-oppenheimer-says-ce7e5cd9dd80f724",
            "pub_date": "2026-02-27 00:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German Union Says Settlement Reached With Tesla, Reuters Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-union-says-settlement-reached-with-tesla-reuters-reports-ce7e5cd9dd81ff20",
            "pub_date": "2026-02-27 00:40:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PayPal Not Currently in Talks to be Acquired by Stripe, Semafor Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/paypal-not-currently-in-talks-to-be-acquired-by-stripe-semafor-reports-ce7e5cd9dd81f023",
            "pub_date": "2026-02-27 00:40:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Forint settles around 2-1/2 year high after rate outlook relief",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/forint-settles-around-2-1-2-year-high-after-rate-outlook-relief-ce7e5cd9dd81f226",
            "pub_date": "2026-02-27 00:40:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PayPal, Stripe Not Currently in Discussions, Semafor Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/paypal-stripe-not-currently-in-discussions-semafor-reports-ce7e5cd9dd81f72d",
            "pub_date": "2026-02-27 00:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shanghai Fosun Pharmaceutical receives regulatory approval for bond issuance",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shanghai-fosun-pharmaceutical-receives-regulatory-approval-for-bond-issuance-ce7e5cd9dd81f721",
            "pub_date": "2026-02-27 00:40:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Salesforce Remains an AI Winner Despite the Selloff for Software, Wedbush Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/salesforce-remains-an-ai-winner-despite-the-selloff-for-software-wedbush-says-ce7e5cd9dd81f720",
            "pub_date": "2026-02-27 00:40:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart to Pay $100 Million to Settle FTC's Delivery Driver Pay Claims",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Katherine Hamilton </p><br/><p>\n  Walmart agreed to pay $100 million to settle allegations from the Federal Trade Commission and 11 states that it deceived delivery drivers about their pay. </p><!-- Article --><p>\n\n  The FTC and states had alleged that Walmart showed drivers in its Spark Driver delivery program inflated base pay and tip amounts, and falsely claimed that 100% of customer tips would go to drivers. </p><p>\n\n  Walmart's Spark service delivers goods to customers via gig workers and the Spark Driver app. Workers view the base pay and tips offered by Walmart when deciding whether to accept a delivery order job. </p><p>\n\n  The FTC said Walmart didn't notify drivers that the payment for the advertised tip amount hadn't been preauthorized, so drivers wouldn't receive that amount if the customer was unable to cover the cost of the tip. </p><p>\n\n  The retailer also didn't inform workers that it would reduce their base pay and tips when orders were removed from jobs including multiple deliveries, and didn't disclose all the conditions drivers had to meet to earn the incentive pay for completing certain tasks, the FTC said. </p><br/><p>\n  Write to Katherine Hamilton at katherine.hamilton@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1128ET</p></div>",
            "link": "https://hk.marketscreener.com/news/walmart-to-pay-100-million-to-settle-ftc-s-delivery-driver-pay-claims-ce7e5cd9dd81f727",
            "pub_date": "2026-02-27 00:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere expects to make a final investment decision on phase 1 of 20 mtpa expansion of Sabine Pass export facility in 2027 - CEO Jack Fusco",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cheniere-expects-to-make-a-final-investment-decision-on-phase-1-of-20-mtpa-expansion-of-sabine-pass-ce7e5cd9dd8eff2d",
            "pub_date": "2026-02-27 00:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Snowflake's Q4 Results Indicate 'Health Demand Environment,' Morgan Stanley Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/snowflake-s-q4-results-indicate-health-demand-environment-morgan-stanley-says-ce7e5cd9dd8eff23",
            "pub_date": "2026-02-27 00:40:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Synopsys is Fundamentally Immune to AI Disruption Fears, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/synopsys-is-fundamentally-immune-to-ai-disruption-fears-bofa-says-ce7e5cd9dd8ff42d",
            "pub_date": "2026-02-27 00:31:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Celsius Tops Fourth-Quarter Views as Sales More Than Double; Shares Soar",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/celsius-tops-fourth-quarter-views-as-sales-more-than-double-shares-soar-ce7e5cd9dd8ff424",
            "pub_date": "2026-02-27 00:31:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kansas City Fed February Regional Manufacturing Index 5 Vs. 2 Estimate; 0 Prior",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kansas-city-fed-february-regional-manufacturing-index-5-vs-2-estimate-0-prior-ce7e5cd9dd8ff521",
            "pub_date": "2026-02-27 00:20:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Diageo Rating, Price Target Maintained as BofA Notes New Strategy",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diageo-rating-price-target-maintained-as-bofa-notes-new-strategy-ce7e5cd9dd8ff723",
            "pub_date": "2026-02-27 00:20:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BofA Keeps Allianz at Buy Amid Stronger-than-expected FY25 Solvency",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bofa-keeps-allianz-at-buy-amid-stronger-than-expected-fy25-solvency-ce7e5cd9dd8ff727",
            "pub_date": "2026-02-27 00:20:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}