{
    "data": [
        {
            "title": "Eni Q4 adj net profit EUR 1.20 bln above company-provided consensus",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eni-q4-adj-net-profit-eur-1-20-bln-above-company-provided-consensus-ce7e5cd9d88bf724",
            "pub_date": "2026-02-26 20:40:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed's Bostic Says People Have Begun to Doubt Fed Independence",
            "description": "<div class=\"txt-s4 article-text\"><p>\n     Fed's Bostic Says People Have Begun to Doubt Fed Independence By Vicky Ge Huang </p><p>\n\n     Atlanta Fed President Raphael Bostic said Wednesday that the rift between the Federal Reserve and the White House has begun to erode trust in the central bank's apolitical standing, one of the most direct warnings yet from a top monetary-policy official about the consequences of President Trump's aggressive stance toward the Fed. Meanwhile, Kansas City Fed President Jeff Schmid, one of the three dissenters in the Fed's December quarter-point rate cut decision, continued to express his concerns about inflation. Elsewhere, Bank of Japan policy board member Hajime Takata said that with deflation now firmly in the rearview mirror, the path is clear for the Japanese central bank to raise interest rates sooner rather than later. And South Korea's central bank held its policy rate on hold for a sixth straight meeting and raised its growth and inflation forecasts for this year, </p><!-- Article --><p>\n\n     Top News Fed's Bostic Says People Have Begun to Doubt Fed Independence </p><p>\n\n     Writing in a farewell essay ahead of his scheduled retirement at the end of February, Atlanta Fed President Raphael Bostic said his colleagues in the Federal Reserve system remain committed to insulating their work from politics. </p><p>\n\n     \"But my travels over the past several months have made clear that the legal and rhetorical battles raging around the central bank right now have caused people across a wide cross-section of our population to begin to doubt the Fed's independence , \" Bostic wrote. \"This is a major concern.\" </p><p>\n\n     Kansas City's Schmid Says Fed Has Work to Do With Inflation </p><p>\n\n     Speaking at the Economic Club of Colorado, Kansas City Fed President Jeff Schmid said \"I think we have work to do on the inflation side of things , \" regarding the Fed's dual mandate of price stability and maximum employment. </p><p>\n\n     \"I think we're in a pretty good place for employment, even though, structurally, some things are changing in the labor market,\" he added. </p><p>\n\n     Bank of Japan's Most Hawkish Member Says Rate Hike Needed Soon </p><p>\n\n     Bank of Japan policy board member Hajime Takata said in a speech Thursday: \"I believe the bank should make a further gear shift, and engage in communication that assumes that the price stability target is almost achieved.\" </p><p>\n\n     He also flagged the risk that an external shock could drive Japan's inflation up more than expected. Takata is seen as the BOJ board's most prominent policy hawk . In January, he was the lone dissenter in an 8-1 decision to hold the policy rate at 0.75%, instead proposing a hike to 1.0%. </p><p>\n\n     Bank of Korea Holds Rates Steady, Lifts Growth Forecast </p><p>\n\n     The Bank of Korea on Thursday left its benchmark seven-day repurchase rate at 2.50% . Twenty-one of 25 analysts polled by The Wall Street Journal had expected the decision. Most expect the bank to hold rates steady this year, with some projecting possible increases in 2027. </p><p>\n\n     Trade Remains 'Challenging' for Eurozone, ECB's Lagarde Says </p><p>\n\n     Eurozone exporters continue to have greater difficulty finding overseas buyers , thanks in part to changeable policy in the U.S., European Central Bank President Christine Lagarde said Thursday. </p><p>\n\n     U.S. Economy The Math Behind Trump's Eye-Catching Economic Ideas </p><p>\n\n     In a record-length State of the Union address, President Trump threw out a string of eye-catching economic ideas. His proposals and promises come as American voters are increasingly frustrated with the economy. About 56% of Americans disapprove of his handling of it, compared with about 40% who approve, according to an average of polls collected by the nonpartisan Cook Political Report. Here's a look at the math </p><p>\n\n  behind some of Trump's economic notions </p><p>\n\n     Americans Are Leaving the U.S. in Record Numbers </p><p>\n\n     Last year the U.S. experienced something that hasn't definitively occurred since the Great Depression: More people moved out than moved in . America's own citizens are leaving in record numbers, replanting themselves and their families in lands they find more affordable and safe. </p><p>\n\n     Greer: 15% Tariff May Only Apply to Some Countries </p><p>\n\n     President Trump may increase his 10% global tariff to 15% </p><p>\n\n  for only some nations, his trade chief said, adding to the confusion over an increase that was announced last weekend but has yet to materialize. </p><p>\n\n     Wall Street Traders Are Pouncing on the Tariff Refund Chaos </p><p>\n\n  Shipping Industry Sends Strong Consumer Demand Signal For 2026 </p><p>\n\n     Major U.S. importers are facing off against the world's largest ocean carriers in an early gut check for trade in 2026. Retailers are expecting favorable deals </p><p>\n\n  as they kick off talks next month for ocean shipping contracts that link factories in Asia to warehouses in America. </p><p>\n\n     U.S. Should Shift Gears on Economic Policy, IMF Says </p><p>\n\n     An alternative policy mix in the U.S. </p><p>\n\n  could achieve the Trump administration's goals while avoiding negative repercussions, the International Monetary Fund says. </p><p>\n\n     Forward Guidance Thursday (all times ET) </p><p>\n\n     8:30 a.m.: Unemployment Insurance Weekly Claims Report - Initial Claims </p><p>\n\n     10 a.m.: Federal Reserve Vice Chair for Supervision Michelle Bowman appears before senate committee hearing </p><p>\n\n     11 a.m.: Federal Reserve Bank of Kansas City Survey of Tenth District Manufacturing </p><p>\n\n     Friday </p><p>\n\n     8:30 a.m.: PPI </p><p>\n\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p><p>\n\n     3 p.m.: Agricultural Prices </p><p>\n\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p><p>\n\n     Research Corporate Bonds Below the Highest Ratings Are in 'Good Shape' </p><p>\n\n     Corporate bonds are generally pricey, but the lower end of investment-grade and the upper tier of high yield still hold value, SanJac Alpha's Andrew Wells tells WSJ. In the high-yield space, BB and B-rated bonds are \"actually in real good shape because anything that looks risky has kind of been pushed out into private credit,\" he says. Debt accumulation to fund AI also raises concerns, so he is avoiding tech exposure. \"It's the ones that have taken on just massive amounts of debt like Oracle,\" he says. \"It certainly shows signs of an overbuild or an oversupply [of bonds] coming.\" - Paulo Trevisani </p><p>\n\n     Basis Points Canadian Prime Minister Mark Carney heads to the Indo-Pacific region </p><p>\n\n  this week, starting with a visit to India where he aims to accelerate efforts to deepen commercial ties with the country after years of diplomatic distress. Confidence among firms in the eurozone slipped in February </p><p>\n\n  amid fresh uncertainties surrounding Europe's political and economic relationship with the U.S. The risk premium demanded by investors to lend to countries in central and eastern Europe has fallen back </p><p>\n\n  to levels last seen before Russia's full scale invasion of Ukraine, easing the war's negative impact on the region's economies, the European Bank for Reconstruction and Development said Thursday. About Us </p><p>\n\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p><p>\n\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0730ET</p></div>",
            "link": "https://hk.marketscreener.com/news/fed-s-bostic-says-people-have-begun-to-doubt-fed-independence-ce7e5cd9d888ff2d",
            "pub_date": "2026-02-26 20:40:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China NPC Standing Committee: Strips Former Inner Mongolia Party Chief Sun Shaocheng of NPC Membership - Xinhua",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-npc-standing-committee-strips-former-inner-mongolia-party-chief-sun-shaocheng-of-npc-membersh-ce7e5cd9d888f027",
            "pub_date": "2026-02-26 20:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Berenberg Trims Diageo Price Target as Fiscal H1 Net Sales Miss Expectations, Dividend Cut",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/berenberg-trims-diageo-price-target-as-fiscal-h1-net-sales-miss-expectations-dividend-cut-ce7e5cd9d888f320",
            "pub_date": "2026-02-26 20:40:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (TD.TO) The Toronto-Dominion Bank Posts Q1 Adjusted EPS C$2.44 per Share, vs. FactSet Est of C$2.26",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-td-to-the-toronto-dominion-bank-posts-q1-adjusted-eps-c-2-44-per-share-vs-factset-ce7e5cd9d888f727",
            "pub_date": "2026-02-26 20:40:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (TD.TO) The Toronto-Dominion Bank Reports Q1 Revenue C$16.59B, vs. FactSet Est of C$14.52B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-td-to-the-toronto-dominion-bank-reports-q1-revenue-c-16-59b-vs-factset-est-of-c-1-ce7e5cd9d888f725",
            "pub_date": "2026-02-26 20:40:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Commerzbank on Overnight News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/commerzbank-on-overnight-news-ce7e5cd9d889ff20",
            "pub_date": "2026-02-26 20:40:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Schneider Electric Q4 organic growth beats expectations; CFO to leave",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/schneider-electric-q4-organic-growth-beats-expectations-cfo-to-leave-ce7e5cd9d889ff25",
            "pub_date": "2026-02-26 20:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veolia outlook 2026 current net income group share growth of minimum +8%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/veolia-outlook-2026-current-net-income-group-share-growth-of-minimum-8-ce7e5cd9d889f022",
            "pub_date": "2026-02-26 20:40:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TD Bank Brief: Q1 PCL $436 Million, a decrease of $85 Million Vs Q1 2024",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/td-bank-brief-q1-pcl-436-million-a-decrease-of-85-million-vs-q1-2024-ce7e5cd9d889f121",
            "pub_date": "2026-02-26 20:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sony Group Corp revises share buyback plan to 1.51% of outstanding shares from previous 0.92%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sony-group-corp-revises-share-buyback-plan-to-1-51-of-outstanding-shares-from-previous-0-92-ce7e5cd9d889f124",
            "pub_date": "2026-02-26 20:40:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (TD) Toronto-Dominion Bank Posts Fiscal Q1 Total Revenue CA$16.59B, vs. FactSet Est of CA$14.52B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-td-toronto-dominion-bank-posts-fiscal-q1-total-revenue-ca-16-59b-vs-factset-est-o-ce7e5cd9d889f526",
            "pub_date": "2026-02-26 20:35:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank of Canada Declares Quarterly Dividends, Payable on or After May 22, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Royal Bank of Canada announced that its board of directors has declared a quarterly common share dividend of $1.64 per share, payable on or after May 22, 2026, to common shareholders of record at the close of business on April 23, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/royal-bank-of-canada-declares-quarterly-dividends-payable-on-or-after-may-22-2026-ce7e5cd9d889f525",
            "pub_date": "2026-02-26 20:35:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target Corporation and Roller Rabbit Debut an Exclusive Spring Getaway Collection",
            "description": "<div class=\"txt-s4 article-text\"><p>Target Corporation announced its exclusive, limited-time collaboration with Roller Rabbit. Launching March 7 with more than 250 items, the collection is curated to give guests fresh, trend-forward pieces at accessible prices, plus unique finds they can't get anywhere else -- including a brand new, first-ever Roller Rabbit print created exclusively for Target. Target's design team worked closely with Roller Rabbit to merge the brand's optimistic, print-driven looks with Target's approachable design sensibility, at a great value: Nearly 80% of the collection is $35 and under, with items starting at just $3. explore the lookbook for the full collection.</p><p>Highlights include: A Target-exclusive Roller Rabbit print: Designed just for this collaboration, the new print is inspired by the spirit of spring adventure and road trips. Roller Rabbit's first-ever expansion into new categories: The assortment includes a full mix-and-match Roller Rabbit universe that spans women's, men's, kids' and baby apparel -- including extended sizing and adaptive styles -- along with home and entertaining essentials, travel gear, beauty and more. It also marks Roller Rabbit's first-ever expand into luggage and outdoor-friendly items, bringing the brand's signature look to even more everyday moments.</p><!-- Article --><p>Playful extras from of-the-moment brands: Limited-edition packaging from Poppi, exclusive nail designs fromlive &amp; June, temporary tattoos from Inked by Dani and a skincare pouch set from Byoma add extra joy and discovery across every part of the assortment. Mix and match items: From a maxi dress that matches a pool floatie to coordinated luggage, swimwear and totes, the collection has something for every adventure. In-store-only mystery boxes and sleepwear set: Discovery is a big part of what makes shopping fun at Target, and this collaboration embraces that spirit -- with a travel-inspired shopping experience filled with bold prints, vibrant displays and unexpected surprise-and-delight touches.</p><p>In-store exclusives include: First-of-its-kind Mystery Boxes with keychains, compact mirrors or a sleep mask/scrunchie set in assorted Roller Rabbit prints. A women's sleepwear set in an exclusive, limited-edition multicolored geo heart pattern -- one of Roller Rabbit's most iconic prints. The limited-time Roller Rabbit x Target collection launches Saturday, March 7 on Target.com and in most Target stores, with same-day fulfillment options like Order Pickup and Drive Up, while supplies last.</p><p>As an early preview, guests in Dallas can experience the collection first at an immersive pop-up on Feb. 28 at the Hickory Street Annex.</p></div>",
            "link": "https://hk.marketscreener.com/news/target-corporation-and-roller-rabbit-debut-an-exclusive-spring-getaway-collection-ce7e5cd9d889f624",
            "pub_date": "2026-02-26 20:35:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeOne Medicines Turns to Q4 2025 Net Income",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/beone-medicines-turns-to-q4-2025-net-income-ce7e5cd9d889f72d",
            "pub_date": "2026-02-26 20:35:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IMF Calls on China to Focus on Consumption-Led Model",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/imf-calls-on-china-to-focus-on-consumption-led-model-ce7e5cd9d889f722",
            "pub_date": "2026-02-26 20:35:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (TD) Toronto-Dominion Bank Posts Fiscal Q1 Adjusted EPS CA$2.44, vs. FactSet Est of CA$2.26",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-td-toronto-dominion-bank-posts-fiscal-q1-adjusted-eps-ca-2-44-vs-factset-est-of-c-ce7e5cd9d980fe20",
            "pub_date": "2026-02-26 20:30:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie shares jump on $14 billion UK power grid deal",
            "description": "<div class=\"txt-s4 article-text\"><p>PARIS, Feb 26 - Shares in French utility Engie hit their highest since September 2009 on Thursday, after the company announced it would buy UK Power Networks from Hong Kong-listed CK Infrastructure Holdings  for 10.5 billion pounds ($14.21 billion).</p><p>\n              Shares were up 7% at 29.49 euros at 0838GMT, and heading for their biggest single-day rise since March 2022.</p><!-- Article --><p>\n              ($1 = 0.7391 pounds)</p><p>\n              (Reporting by America Hernandez in Paris)</p><p>\n            By America Hernandez</p></div>",
            "link": "https://hk.marketscreener.com/news/engie-shares-jump-on-14-billion-uk-power-grid-deal-ce7e5cd9d980f02c",
            "pub_date": "2026-02-26 20:21:24",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Personal Ties Needed to Preserve Economic Relations with China, Mercedes-Benz Spokesperson Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/personal-ties-needed-to-preserve-economic-relations-with-china-mercedes-benz-spokesperson-says-ce7e5cd9d980f124",
            "pub_date": "2026-02-26 20:21:25",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alcon Estimates Tweaked as Bernstein Notes Potential Upside from End-market Recovery; Price Target Up",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/alcon-estimates-tweaked-as-bernstein-notes-potential-upside-from-end-market-recovery-price-target-u-ce7e5cd9d980f32c",
            "pub_date": "2026-02-26 20:21:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC Q1 Adjusted EPS Beats Estimates",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rbc-q1-adjusted-eps-beats-estimates-ce7e5cd9d980f422",
            "pub_date": "2026-02-26 20:21:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nidec Corp - Nagamori resigns as Nidec's chairman emeritus",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nidec-corp-nagamori-resigns-as-nidec-s-chairman-emeritus-ce7e5cd9d980f425",
            "pub_date": "2026-02-26 20:21:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TD Bank Brief: Q1 Adjusted Diluted EPS $2.44, Compared with $2.02",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/td-bank-brief-q1-adjusted-diluted-eps-2-44-compared-with-2-02-ce7e5cd9d980f621",
            "pub_date": "2026-02-26 20:21:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple in talks with banks to start payment service in India, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apple-in-talks-with-banks-to-start-payment-service-in-india-bloomberg-news-reports-ce7e5cd9d980f627",
            "pub_date": "2026-02-26 20:21:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Info Edge (India) approves entering into contribution agreement with B8 Fund I",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/info-edge-india-approves-entering-into-contribution-agreement-with-b8-fund-i-ce7e5cd9d981fe2c",
            "pub_date": "2026-02-26 20:21:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rail Vikas Nigam Bags Order Worth INR5.36 Billion From National Mineral Development",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rail-vikas-nigam-bags-order-worth-inr5-36-billion-from-national-mineral-development-ce7e5cd9d981f023",
            "pub_date": "2026-02-26 20:21:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top alert-Meta- Alerts to roll out to parents who use Instagram’s parental supervision tools in US, UK, Australia, Canada next week",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-alert-meta-alerts-to-roll-out-to-parents-who-use-instagrama-s-parental-supervision-tools-in-us-ce7e5cd9d981f125",
            "pub_date": "2026-02-26 20:21:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia jails former chief of Pertamina unit, two ex-officials in major graft case",
            "description": "<div class=\"txt-s4 article-text\"><p>JAKARTA, Feb 26 (Reuters) - An Indonesian court found a former chief executive and two ex-officials of a unit of state energy company Pertamina guilty on Thursday in a major corruption case involving the firm's subsidiaries, which prosecutors say caused $17 billion in state losses.</p><p>\n              The case, which centres on alleged illegal leasing of a fuel terminal and illegal imports of crude oil, among other offences, is one of the biggest launched under the administration of President Prabowo Subianto, who has vowed to eradicate corruption. </p><!-- Article --><p>\n              There are nine defendants altogether, with six more still to learn their fate.</p><p>\n              In a livestreamed ruling, former Pertamina Patra Niaga chief executive Riva Siahaan was sentenced to nine years of jail time, while the two former officials received prison terms of nine and 10 years respectively. </p><p>\n              The alleged offences took place between 2018 and 2023 and prosecutors had demanded jail sentences ranging from 14 to 18 years for the defendants.</p><p>\n              The six others on trial include Yoki Firnandi, a former chief executive of Pertamina International Shipping, and Muhamad Kerry Adrianto Riza, a beneficial owner of a fuel terminal leased by Pertamina. Both had pleaded not guilty, according to local media. </p><p>\n              Siahaan's lawyer Luhut Pangaribuan said he was \"sad and disappointed\" by Thursday's ruling against his client, who had rejected the graft charges. </p><p></p><p>(Reporting by Fransiska Nangoy, Ananda Teresia; Editing by John Mair, Martin Petty)</p></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-jails-former-chief-of-pertamina-unit-two-ex-officials-in-major-graft-case-ce7e5cd9d981f72c",
            "pub_date": "2026-02-26 20:21:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Instagram to alert parents on teen suicide searches as UK weighs social media ban",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 26 (Reuters) - Instagram said it would notify parents if their teenager repeatedly searches for terms related to suicide or self-harm within a short period, as pressure grows for governments to follow Australia's ban on the use of social media for under 16s.</p><p>\n              Britain said in January it was considering restrictions to protect children online, after Australia's move in December. Spain, Greece, and Slovenia have in recent weeks said they are also looking at limiting access.</p><!-- Article --><p>\n              Instagram, owned by Meta Platforms Inc, said on Thursday it would start alerting parents who are signed up to its optional supervision setting if their children try to access suicide or self-harm content.</p><p>\n              \"These alerts build on our existing work to help protect teens from potentially harmful content on Instagram,\" the platform said in a statement. \"We have strict policies against content that promotes or glorifies suicide or self-harm.\"</p><p>\n              Its existing policy is to block such searches and redirect people to support resources, Instagram said, adding that it would begin the alerts from next week for those signed up in the United States, Britain, Australia and Canada. </p><p>\n              Governments are increasingly seeking to protect children from harm online, particularly after worries over the AI chatbot Grok which has generated non-consensual sexualised images.</p><p>\n              In Britain, measures designed to stop access to pornography sites for children have had implications for adults' privacy, and have led to tension with the U.S. over limits on free speech and regulatory reach.</p><p>\n              Instagram's \"teen accounts\" for under 16s need a parent's permission to change settings, while parents can select an extra layer of monitoring with the agreement of their teenager.</p><p></p><p> (Reporting by Sarah Young, Editing by Paul Sandle)</p></div>",
            "link": "https://hk.marketscreener.com/news/instagram-to-alert-parents-on-teen-suicide-searches-as-uk-weighs-social-media-ban-ce7e5cd9d98eff26",
            "pub_date": "2026-02-26 20:15:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fintech Integration Could Somewhat Boost Rakuten Group's Credit Profile, S&P Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fintech-integration-could-somewhat-boost-rakuten-group-s-credit-profile-s-p-says-ce7e5cd9d98eff25",
            "pub_date": "2026-02-26 20:15:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Europe moves higher after earnings deluge",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Well-received corporate earnings supported European equities on Thursday, though shares in New York are set to open lower despite an Nvidia earnings beat. </p><p></p><p>The FTSE 100 index was up 11.64 points, 0.1%, at 10,818.05. The FTSE 250 added 15.05 points, 0.1%, at 23,651.94, and the AIM all-share climbed just 0.87 of a point, 0.1%, at 817.66.</p><!-- Article --><p></p><p>The Cboe UK 100 was up 0.1% at 1,076.62, the Cboe UK 250 added 0.1% at 20,903.79, and the Cboe small companies added 0.7% at 18,546.29.</p><p></p><p>The CAC 40 in Paris added 0.9% while the DAX 40 in Frankfurt rose 0.4%. </p><p></p><p>The yield on the US 10-year Treasury was steady at 4.05%. The 30-year yield widened to 4.70% from 4.69%.</p><p></p><p>In New York, the Dow Jones Industrial Average, S&amp;P 500 and Nasdaq Composite are all called down 0.1%. Nvidia was 0.8% higher in pre-market dealings, however. </p><p></p><p>Nvidia hailed an \"outstanding\" quarter, and predicted sequential revenue growth throughout 2026 reflecting booming AI demand.</p><p></p><p>Chief Executive Officer Jensen Huang commented: \"Computing demand is growing exponentially - the agentic AI inflection point has arrived.\"</p><p></p><p>The Santa Clara, California-based chip maker reported net income of USD42.96 billion in its fourth quarter ended January 25, up 94% from USD22.09 billion a year ago. Diluted earnings per share was USD1.76, up 98% from USD0.89.</p><p></p><p>Revenue totalled USD68.13 billion, up 73% from USD39.33 billion last year, and ahead of the USD66.21 billion LSEG consensus.</p><p></p><p>Wedbush analysts commented: \"Nvidia had a gold medal performance and physical AI only represents roughly 3% of revenues which speaks to another massive opportunity around autonomous and robotics on the horizon. Watching Nvidia today is like watching Michael Jordan in his first few years for the Chicago Bulls...just the beginning of this transformational superstar narrative playing out for the tech world.\"</p><p></p><p>Swissquote analyst Ipek Ozkardeskaya noted Nvidia impressed, but was unable to markedly lift wider market sentiment. </p><p></p><p>\"So, while Nvidia delivered another blockbuster quarter, it doesn't fully revive global risk appetite. SoftBank rebounded almost 4% in Japan this morning, but Nasdaq futures are pointing lower, trailing major US and European peers. Nvidia can keep its own head above water, but it may not drive global risk appetite alone, anymore,\" the analyst said.</p><p></p><p>Nvidia has had a rip-roaring rise on the stock market. One firm in London which can boast the same feat, albeit with a much smaller market capitalisation, is Rolls-Royce. </p><p></p><p>AJ Bell analyst Dan Coatsworth commented: \"Better than expected results from Rolls-Royce put a new rocket under its share price, taking it to a new all-time high. This is one of the most impressive business turnarounds in decades. Not simply fixing a few broken doors, Rolls-Royce has sorted out its problems and then taken the business to another level. It is rare to pull off such a stunt so smoothly and without bumps in the road.\"</p><p></p><p>Rolls-Royce shares surged 5.5% as it reported stronger annual results, raised its dividend, announced a buyback and lifted its outlook. </p><p></p><p>At the other end of London's large-cap index, Hikma shares slumped 17%. It plummeted as it withdrew mid-term guidance and delivered a softer than hoped outlook for the current financial year. </p><p></p><p>The London-based pharmaceutical maker sees 2026 revenue growth in the 2% to 4% range, slowing from 7% in 2025.</p><p></p><p>It predicts core operating profit in the range of USD720 million to USD770 million, below company compiled consensus of USD784 million.</p><p></p><p>In addition, Hikma said it was withdrawing medium-term group guidance and the Injectables medium-term margin guidance previously set out.</p><p></p><p>This follows a strategic review \"of the plans and projections for the group, and for the Injectables business in particular,\" Hikma said.</p><p></p><p>Ocado shares fell 7.4%. It said it is cutting 1,000 jobs as it scales back research &amp; development investment and simplifies its operating model.</p><p></p><p>\"Following a period of rapid growth and capital investment in our technology, we believe now is the appropriate time to realign and restructure our commercial, support and R&amp;D functions,\" the Hatfield, Hertfordshire-based grocer and warehouse technology firm said in a statement.</p><p></p><p>Elsewhere in London, National Express owner Mobico raced 34% higher as it predicted GBP100 million in savings for 2026.</p><p></p><p>It sees adjusted operating profit coming in at GBP195 million to GBP210 million this year. For 2025, it reported Thursday that adjusted operating profit grew to GBP198.0 million from GBP181.1 million.</p><p></p><p>\"Together with our other initiatives, we expect to deliver GBP100 million of annualised cost savings for the group by the end of 2026,\" Executive Chair Phil White said. </p><p></p><p>The pound traded at USD1.3537, where it stood at the time of the London equities close on Wednesday. The euro was largely flat at USD1.1802 from USD1.1804. Against the yen, the dollar bought JPY156.03, down from JPY156.39.</p><p></p><p>\"Improved sentiment has weighed on the dollar over the past 24 hours, with only the yen taking a worse beating in G10 yesterday (more in the JPY section below). Oil price moderation is also playing a role, with markets seeing no reason to price in geopolitical escalation,\" analysts at ING commented. </p><p></p><p>\"Overall, we could see some stabilisation in the dollar today, though some downside risks remain as the positive spillover from Nvidia's earnings may keep markets tilted away from defensive currencies a little longer.\"</p><p></p><p>Still to come on Thursday is the latest US jobless claims reading at 1330 GMT. </p><p></p><p>By Eric Cunha, Alliance News news editor</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/europe-moves-higher-after-earnings-deluge-ce7e5cd9d98ef02d",
            "pub_date": "2026-02-26 20:15:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU tells Kyrgyzstan to crack down on re-export of sanctioned goods to Russia",
            "description": "<div class=\"txt-s4 article-text\"><p>BISHKEK, Feb 26 (Reuters) - The EU expects Kyrgyzstan to crack down on the re-export of European goods to Russia, a senior EU official said on Thursday during a visit to the tiny Central Asian state that has become a conduit for equipment banned under sanctions against Moscow.</p><p>\n              Since Russia's 2022 full-scale invasion of Ukraine, Kyrgyzstan, a close Russian ally that borders China, has become one of the world's fastest-growing economies, expanding by an average of 9% a year.</p><!-- Article --><p>\n              EU sanctions envoy David O'Sullivan said Brussels was concerned over surging imports to Kyrgyzstan of radio equipment and machine tools destined for re-export to Russia, in violation of sanctions on goods with potential military uses.</p><p>\n              \"We have reason to believe that the trade flows indicate that these goods are being imported into Kyrgyzstan with the sole purpose of being re-exported to Russia in breach of our sanctions,\" he told a press conference.</p><p>\n              \"What is disturbing for us is the fact that there has been a significant and very noticeable percentage, a big increase in the percentages of your imports and re-export of these products compared to the pre-war period.\"</p><p>\n              The Financial Times this month cited an internal European Commission document that said imports of \"common high-priority items\" from the EU to Kyrgyzstan are up 800% since the outbreak of the Ukraine war, with Kyrgyz exports to Russia up 1,200%.</p><p>\n              Several Kyrgyz banks and cryptocurrency firms have already been sanctioned by Western powers for helping Moscow evade sanctions, and the EU is considering more measures. Kyrgyzstan called sanctions on its companies \"one-sided\" and \"interference in the country's internal affairs\".</p><p>\n              O'Sullivan said the EU respects Kyrgyzstan's need for a close economic relationship with Russia, where many of its citizens travel for work.</p><p>\n              \"We are not asking Kyrgyzstan not to have trading relations with Russia,\" he said. \"We only ask that that trading relationship does not involve the deliberate circumvention of our sanctions by the transmission through Kyrgyzstan of sanctioned EU goods to Russia.\"</p><p></p><p> (Reporting by Aigerim Turgunbaeva, Writing by Felix Light; Editing by Mark Trevelyan and Peter Graff)</p><p>\n            By Aigerim Turgunbaeva</p></div>",
            "link": "https://hk.marketscreener.com/news/eu-tells-kyrgyzstan-to-crack-down-on-re-export-of-sanctioned-goods-to-russia-ce7e5cd9d98ef023",
            "pub_date": "2026-02-26 20:15:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DeepSeek Deprives US Chipmakers Access to Latest Model, Sources Say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/deepseek-deprives-us-chipmakers-access-to-latest-model-sources-say-ce7e5cd9d98ef021",
            "pub_date": "2026-02-26 20:15:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeOne Medicines Q4 Adjusted Earnings, Revenue Rise",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/beone-medicines-q4-adjusted-earnings-revenue-rise-ce7e5cd9d98ef027",
            "pub_date": "2026-02-26 20:15:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank of Canada Earnings Lifted by Wealth Management, Personal Banking, Markets Growth",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Royal Bank of Canada's earnings rose in the first quarter of its fiscal year despite an elevated credit-loss provision, as the lender notched growth in its wealth management, personal banking, and capital markets operations. </p><!-- Article --><p>\n\n  The bank--the country's biggest by market value and one of the largest in North America by assets--recorded first-quarter net income of 5.79 billion Canadian dollars (US$4.23 billion), or C$4.03 a share. That was up from C$5.13 billion, or C$3.54, a year earlier. </p><p>\n\n  Excluding certain items, adjusted per-share earnings rose to C$4.08 for the three months to Jan. 31, topping the C$3.85 expected by analysts polled by FactSet. </p><p>\n\n  Total revenue rose 7.3% to C$17.96 billion, where analysts were expecting C$17.5 billion. </p><p>\n\n  The Toronto-based bank's provision for credit losses increased C$40 million on year to C$1.09 billion, and was C$83 million higher than a quarter earlier. The result was above the C$1.06 billion analysts were looking for the bank to set aside against the risk of loan losses. The increase on a year period was thanks mainly to higher provisions in capital markets and personal banking, which the bank said was partly offset by lower provisions in wealth management and commercial banking. </p><p>\n\n  Household spending in Canada has remained relatively resilient despite an elevated unemployment rate and the hit to parts of the economy from the Trump administration's approach to trade policy and use of tariffs. Still, the housing market has softened in recent months and economists have warned of possible stresses on households as homeowners renew mortgages at higher interest rates. Business spending also has been relatively subdued, particularly in industries exposed to the shift toward protectionist trade policies by the U.S., Canada's biggest trading partner. </p><p>\n\n  Royal Bank in a letter to shareholders said it expects economic growth to remain positive across most advanced economies despite heightened international trade uncertainties. Canada's economy has shown signs of improvement in recent months and the jobless rate has edged lower, and the bank forecasts modest growth in the first half of the year after what was likely a flat final quarter of 2025. </p><p>\n\n  The bank, like many of its peers, projects the Bank of Canada will leave its policy interest rate steady through 2026 and it isn't anticipating tariffs imposed by the U.S. on Canadian goods to rise further, though the existing trade pact between Canada, the U.S. and Mexico is up for renegotiation this year. Currently, most Canadian exports to the U.S. are exempt from President Trump's tariffs under the trade deal. </p><p>\n\n  Royal Bank's return on equity, a measure of profitability closely watched by analysts, expanded by 0.8 percentage point on last year to 17.6%. </p><p>\n\n  The lender said its personal-banking businesses were buoyed by strong revenue growth and operating leverage in the quarter, with net interest income and non-interest income both rising. Loan growth in Canada averaged about 2% for the period, and Royal Bank said it had higher fee-based client assets with the rise in markets. </p><p>\n\n  The bank's commercial-banking business was underpinned by volume growth and a lower credit-loss provision, while wealth-management revenue was supported by what the bank said was strong growth in fee-based client assets. Capital markets unit revenue was up about 7% on a year earlier, with higher equity trading income across most regions and a rise in fixed-income trading revenue, though corporate and investment banking revenue was flat. </p><p>\n\n  Royal Bank's capital position strengthened slightly, with a common equity Tier 1 ratio of 13.7%, up 0.5 percentage point from the same quarter last year. That remains well above the at least 11.5% of risk-weighted assets that Canada's banking regulator requires from the big lenders. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0708ET</p></div>",
            "link": "https://hk.marketscreener.com/news/royal-bank-of-canada-earnings-lifted-by-wealth-management-personal-banking-markets-growth-ce7e5cd9d98ef226",
            "pub_date": "2026-02-26 20:15:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC Q1 Adjusted EPS Beats Estimates",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rbc-q1-adjusted-eps-beats-estimates-ce7e5cd9d98ef32c",
            "pub_date": "2026-02-26 20:15:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PLDT Inc. Declares Regular Cash Dividend on Common Stock, Payable on April 16, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>PLDT Inc. at its meeting of the Board of Directors held on February 26, 2026, declared a regular cash dividend of PHP 46.00 per outstanding share of Common Stock of the Company, payable on April 16, 2026 to the holders of record as of March 26, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/pldt-inc-declares-regular-cash-dividend-on-common-stock-payable-on-april-16-2026-ce7e5cd9d98ef323",
            "pub_date": "2026-02-26 20:15:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Time Watch Investments Logs 238% Wider Half-Year Loss",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/time-watch-investments-logs-238-wider-half-year-loss-ce7e5cd9d98ef421",
            "pub_date": "2026-02-26 20:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese EV Manufacturers Raise Prices in Thailand Following End of Subsidies",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chinese-ev-manufacturers-raise-prices-in-thailand-following-end-of-subsidies-ce7e5cd9d98ef420",
            "pub_date": "2026-02-26 20:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Greenheart Forecasts At Least 45% Narrower Loss in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/greenheart-forecasts-at-least-45-narrower-loss-in-2025-ce7e5cd9d98ef426",
            "pub_date": "2026-02-26 20:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}