{
    "data": [
        {
            "title": "Iran enters third round of nuclear talks with 'seriousness and flexibility', spokesperson tells Press TV",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-enters-third-round-of-nuclear-talks-with-seriousness-and-flexibility-spokesperson-tells-pre-ce7e5cd9dd8af52d",
            "pub_date": "2026-02-27 00:00:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tenaga Nasional Berhad Reports Earnings Results for the Fourth Quarter and Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Tenaga Nasional Berhad reported earnings results for the fourth quarter and full year ended December 31, 2025. For the fourth quarter, the company reported sales was MYR 17,599.7 million compared to MYR 14,378.3 million a year ago. Net income was MYR 1,675.1 million compared to MYR 642.3 million a year ago. Basic earnings per share from continuing operations was MYR 0.2876 compared to MYR 0.1107 a year ago. Diluted earnings per share from continuing operations was MYR 0.2876 compared to MYR 0.1105 a year ago.<br/>\rFor the full year, sales was MYR 67,723.1 million compared to MYR 56,737.1 million a year ago. Net income was MYR 4,768.1 million compared to MYR 3,978.2 million a year ago. Basic earnings per share from continuing operations was MYR 0.8186 compared to MYR 0.6858 a year ago. Diluted earnings per share from continuing operations was MYR 0.8186 compared to MYR 0.6843 a year ago.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/tenaga-nasional-berhad-reports-earnings-results-for-the-fourth-quarter-and-full-year-ended-december-ce7e5cd9dd8af523",
            "pub_date": "2026-02-27 00:00:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chang Hwa Commercial Bank says 2025 net profit T$17.77 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chang-hwa-commercial-bank-says-2025-net-profit-t-17-77-bln-ce7e5cd9dd8af521",
            "pub_date": "2026-02-27 00:00:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United Nova Tech prelim 2025 net loss at 574.3 million yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/united-nova-tech-prelim-2025-net-loss-at-574-3-million-yuan-ce7e5cd9dd8af525",
            "pub_date": "2026-02-27 00:00:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed Vice Chair for Supervision Bowman says bank regulators aiming for new Basel bank capital proposal by end of March",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fed-vice-chair-for-supervision-bowman-says-bank-regulators-aiming-for-new-basel-bank-capital-proposa-ce7e5cd9dd8af621",
            "pub_date": "2026-02-27 00:00:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Brings Tough Demands to Iran Nuclear Talks -2-",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  0946 GMT - Zimbabwe's export restrictions on lithium will probably be more successful than the DRC's curbs on cobalt, at least in terms of encouraging local processing, says Freddie Brooks at BMI, a unit of Fitch Solutions. That's because of Zimbabwe's share of global lithium mine production, the commodities analyst says. At approximately 10%, Zimbabwe's share of production is high enough to make it difficult to replace in the lithium value chain, but not so high that export restrictions significantly inflate prices and trigger demand destruction downstream, as in the case of the DRC's 75% share of global cobalt mine production. \"In any case, processing facilities for lithium are already being built in Zimbabwe by Chinese companies, and lithium faces significantly lower substitution risks in the battery market compared to cobalt,\" Brooks says. (fabiana.negrinochoa@wsj.com) </p><p>\n\n  -- </p><!-- Article --><p>\n\n  Eni Had a Strong End to the Year -- Market Talk </p><p>\n\n  0938 GMT - Italian energy major Eni had a strong end to the year as net income beat consensus expectations by 25%, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. Quarterly production is also well ahead of market expectations, they add. While guidance is limited due to its upcoming capital markets day, Eni's capital spending outlook does look lower than anticipated, they say. This reflects the closure of an Indonesian joint venture by the middle of the year. Additionally, production looks set to continue growing, they add. Shares trade up 1.1% to 19.09 euros. (adam.whittaker@wsj.com) </p><p>\n\n  -- </p><p>\n\n  European Gas Holds Around 30 Euros With U.S.-Iran in Focus -- Market Talk </p><p>\n\n  0937 GMT - European natural-gas prices are hovering around 30 euros a megawatt-hour, supported by forecasts for milder weather and ample LNG supply. Still, gas storage across the European Union remains around 30% full--well below the five-year average of 47%--and is set to finish the heating season near or below 2022 levels, analysts say. The benchmark Dutch TTF contract is down 1.1% to 30.58 euros a megawatt hour. Investors are now closely watching U.S.-Iran talks as any escalation could threaten LNG flows through the Strait of Hormuz, though analysts consider this scenario unlikely. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  London's Miners Drop as Metal Prices Slide -- Market Talk </p><p>\n\n  0928 GMT - London's miners trade down as metal prices drop. In morning trade, New York gold futures are down 0.62% to $5,192.20 a troy ounce. Silver futures slide nearly 4.25% to $87.12 an ounce while LME three-month copper futures are down 0.4% to $13,247 a metric ton. While gold slips, it remains up more than 3.5% over the week as uncertainty around U.S. trade policy and geopolitical tensions with Iran remain. Silver and gold miner Fresnillo drops nearly 4%, while Hochschild Mining is down 1.5%. Copper miner Antofagasta trades 2.85% lower. Diversified miner Anglo American is down around 2.5% and Glencore drops 1.8%. (adam.whittaker@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Gold Slips but Remains Above $5,100 as Markets Focus on U.S.-Iran Talks -- Market Talk </p><p>\n\n  0844 GMT - Gold prices slipped in early trading but remain above $5,100 a troy ounce as investors look ahead to U.S.-Iran talks later on Thursday. New York futures fall 0.7% to $5,191.60 an ounce, with gains tempered by concerns that U.S. interest rates could remain on hold for some time. Still, the metal is up more than 3.5% on the week, supported by renewed uncertainty around U.S. trade policy and geopolitical tensions with Iran. \"Any escalation in tensions involving Iran is likely to add further support and reinforce gold's role as a hedge against shocks,\" analysts at ING say. \"At the same time, the structural drivers behind gold's earlier rally remain firmly in place.\" (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Brent Spreads Signal Well-Supplied Market </p><p>\n\n  0857GMT - Price differences between near-term and later Brent crude contracts have weakened recently, suggesting the physical market is becoming increasingly well supplied. Kazakh oil exports through the Caspian Pipeline Consortium terminal are returning to normal after earlier disruptions. Meanwhile, floating storage is shrinking, suggesting that previously stranded, sanctioned barrels are now finding buyers, according to analysts at ING. \"If we are to see de-escalation between the U.S. and Iran, it should allow weaker fundamentals to feed through to a lower flat price-particularly if OPEC+ resumes supply increases from April, which we believe they will agree to this weekend,\" they say. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Oil Inches Higher Ahead of U.S.-Iran Talks </p><p>\n\n  0830 GMT - Oil prices edge higher ahead of a third round of nuclear talks between the U.S. and Iran later on Thursday. In early trade, Brent crude is up 0.3% to $70.94 a barrel, while WTI rises 0.3% to $65.35 a barrel. \"A constructive resolution would likely prompt the market to gradually unwind as much as a $10/bbl risk premium, which we believe is currently priced in,\" analysts at ING say. \"If talks break down, the upside risk remains, but the market may hold off on a full reaction until the scale of potential U.S. action against Iran becomes clearer.\" Meanwhile, the latest EIA data showed U.S. crude oil inventories rose by 16 million barrels last week, the largest weekly build since February 2023. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Comex Gold Futures' Bullish Technical Setup Remains Intact, Chart Shows -- Market Talk </p><p>\n\n  0621 GMT - Comex gold futures' bullish technical setup remains intact, RHB Retail Research's Joseph Chai says in a research report. The fresh bullish candlestick pattern on the daily chart suggests selling pressure has tapered, the analyst says. Since gold \"bulls have returned to the driver's seat,\" the precious metal could resume the bullish trajectory toward resistance at $5,500/oz, Chai says. A bullish breakout above this level would extend its uptrend toward $6,000/oz. Also, 20- and 50-day simple moving averages continue moving upward, lending support for bullish technical setup, the analyst adds. Spot gold is 0.6% higher at $5,196.37/oz. (ronnie.harui@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Copper Edges Lower Amid Profit-Taking -- Market Talk </p><p>\n\n  0238 GMT - Copper edges lower in early Asian trading, with the three-month LME copper contract 0.15% lower at $13302.00 a ton. Investors appear to be taking profit after the metal's price reached a two-month high. Buying in China has remained slow after the Lunar New Year holiday, as some investors have hesitated due to high prices, ANZ Research analysts say. Investors are closely watching the developments related to U.S. tariffs. (tracy.qu@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Iron Ore Rises on Improved Sentiment From Policy Support -- Market Talk </p><p>\n\n  0235 GMT - Iron ore rises in early Asian trade as sentiment improves on reports of new Chinese policy support, ANZ Research analysts say in a note. China's National Development and Reform Commission will reportedly receive new funding for urban renewal projects nationwide. Supply side are also supporting prices, as steelmakers in Northern China have been required to cut blast furnace output by 30% during the annual plenary sessions of the National People's Congress, which begin next Wednesday. \"This lifted steel prices, supporting higher margins for steel mills,\" ANZ adds. The most-traded contract on the Dalian Commodity Exchange is up 0.2% at CNY750.00 a ton.(jason.chau@wsj.com) </p><br/><p>\n  Write to Barcelona Editors at barcelonaeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1047ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-brings-tough-demands-to-iran-nuclear-talks-2-ce7e5cd9dd8af723",
            "pub_date": "2026-02-27 00:00:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Brings Tough Demands to Iran Nuclear Talks -- Commodities Roundup",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  MARKET MOVEMENTS: </p><p>\n\n  --Brent crude oil is down 0.1% to $70.59 a barrel. </p><!-- Article --><p>\n\n  --European benchmark gas is down 0.6% at 30.75 euros a megawatt hour. </p><p>\n\n  --Gold futures are down 0.8% to $5,183.90 a troy ounce. </p><p>\n\n  --LME three-month copper futures are down 0.6% to $13,275 a metric ton. </p><br/><p>\n  TOP STORY: </p><p>\n\n  U.S. Brings Tough Demands to Iran Nuclear Talks </p><p>\n\n  GENEVA-U.S. envoys Steve Witkoff and Jared Kushner are entering a crucial round of talks over Iran's nuclear program Thursday with tough demands, under pressure from hawks in the administration and Republicans in Congress not to agree to a deal that could be criticized as soft. </p><p>\n\n  In the talks, now under way in Geneva, the U.S. negotiators were expected to make clear Iran must dismantle its three main nuclear sites-at Fordow, Natanz and Isfahan-and deliver all of its remaining enriched uranium to the U.S., officials said. </p><br/><p>\n  OTHER STORIES: </p><p>\n\n  Big Oil Is Urging Trump to Stop Battle on Offshore Wind </p><p>\n\n  Big Oil has an unusual ask for President Trump : Please stop your battle against offshore wind. </p><p>\n\n  Oil lobbyists have made the case to Trump officials in recent weeks that his attacks on wind farms off the U.S. coast risk derailing congressional efforts to speed up permits for energy projects, according to people familiar with the matter. The oil-and-gas industry fears missing out on a huge opportunity to ship more of its products to markets via new pipelines. </p><p>\n\n  -- </p><p>\n\n  Canadian Utilities Swings to 4Q Loss on Noncash Impairments, Write-Offs </p><p>\n\n  Canadian Utilities swung to a loss in the fourth quarter as noncash impairments and write-offs related to its Alberta Renewables portfolio dragged performance. </p><p>\n\n  The diversified energy and utilities company on Thursday logged a net loss of 328 million Canadian dollars ($239.8 million), or C$1.28 a share, compared with a profit of C$164 million, or C$0.53 a share, in the comparable quarter a year ago. </p><p>\n\n  -- </p><p>\n\n  EDP Posts Higher Net Profit on Renewables Recovery </p><p>\n\n  Portugal's EDP reported a jump in 2025 net profit, aided by higher earnings from its renewables arm and a recovery of its wind and solar businesses. </p><p>\n\n  The energy company said it made a full-year net profit of 1.15 billion euros ($1.36 billion), up 44% compared with 2024. The company said the increase reflected a bigger contribution from separately listed EDP Renovaveis. </p><p>\n\n  -- </p><p>\n\n  How to Build the World's Most Expensive Nuclear Power Plant </p><p>\n\n  \"We are now entering a new phase in the golden age of nuclear,\" declared Michael Shanks, a U.K. energy minister, as he recently talked up the country's plans to attract private investment in new reactors. </p><p>\n\n  His parade was swiftly dampened. Last week, Britain's first new nuclear plant in three decades cemented its status as the most expensive on record anywhere. The risk is that the U.K.'s contribution to the golden age is a cautionary tale about the cost of these megaprojects as the U.S. advances its own nuclear buildout. </p><p>\n\n  -- </p><p>\n\n  Eni Earnings Rise on Higher Production </p><p>\n\n  Italian energy major Eni reported a rise in fourth-quarter earnings despite lower oil prices as it benefited from higher production and cost efficiencies. </p><p>\n\n  The integrated oil-and-gas company said Thursday that adjusted net profit--the company's preferred metric--jumped 35% to 1.2 billion euros ($1.42 billion) compared with the same period a year earlier. This came ahead of the 960 million euros analysts had expected according to a company-compiled consensus. </p><p>\n\n  -- </p><p>\n\n  Karoon Prefers to Be Operator of South Santos Basin Drill Campaign </p><p>\n\n  SYDNEY--Karoon Energy prefers to be the operator of a mooted exploration campaign in the deepwater Santos Basin of Brazil, but is prepared to hand on that responsibility if it finds a strong partner with the right skillset. </p><p>\n\n  That is the view of Chief Executive Carri Lockhart after Karoon recently began an effort to test the interest of companies in taking equity in licenses that it wholly owns in the southern area of the basin where the ocean is nearly a mile deep. </p><p>\n\n  -- </p><p>\n\n  Cold Is Winning the Coffee Wars at Starbucks </p><p>\n\n  Starbucks's business is going cold. Around two-thirds of the chain's U.S. orders are now iced, up from 37% in 2013. </p><p>\n\n  The trend extends beyond the U.S., with 60% of the chain's global sales represented by cold espressos, fruity Refreshers, iced matcha and chilled tea lattes. </p><p>\n\n  -- </p><p>\n\n  BlueScope Says $11 Billion Steel Dynamics, SGH Takeover Offer Insufficient; Open to Talks </p><p>\n\n  BlueScope Steel said a revised takeover offer from U.S. steelmaker Steel Dynamics and Australian conglomerate SGH isn't sufficient for directors to recommend a deal to shareholders, but that it is open to talks if the companies are able to address some of its concerns. </p><p>\n\n  Last week, Steel Dynamics and SGH submitted a sweetened offer for Australia's BlueScope that values its equity at roughly US$11 billion, and said they wouldn't raise it again unless a rival bidder emerges. </p><br/><p>\n  MARKET TALKS: </p><p>\n\n  Soybean Futures Higher But Brazilian Harvest Eyed -- Market Talk </p><p>\n\n  0919 ET - Soybean futures on the CBOT are up premarket, but analysts keeping a close eye on how the Brazilian harvest is progressing. With a record amount of soybeans expected from Brazil, gains seen in futures may be hitting a short-term ceiling. \"It would be unusual for the biggest soybean harvest the world has ever seen (Brazil) to not slow down price gains in the beans at some point,\" says Doug Bergman of RCM Alternatives in a note. Bergman adds that soybean futures have likely priced in optimism surrounding demand from renewable fuels. Soybeans are up 0.5%, while corn rises 0.5% and wheat climbs 0.2%. (kirk.maltais@wsj.com) </p><p>\n\n  -- </p><p>\n\n  U.S. Natural Gas Futures Fall Ahead of Inventory Data -- Market Talk </p><p>\n\n  0911 ET - U.S. natural gas futures are lower awaiting weekly storage data due at 10:30 a.m. ET, while weather forecasts point to warmer weather for the first half of March. The milder outlook is pressuring futures prices through the summer \"as we are more likely to exit winter with above-normal amounts of gas in storage,\" Tradition Energy's Gary Cunningham says in a note. \"Domestic gas production is back to firing on all cylinders and imports from Canada are returning to normal,\" he adds. Nymex gas is down 3% at $2.782/mmBtu as the April contract debuts at the front of the curve.(anthony.harrup@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Oil Futures Move Lower As U.S.-Iran Talks Held </p><p>\n\n  0901 ET - Oil futures lose ground as U.S. and Iranian officials hold talks in Geneva on Iran's nuclear program. \"Geo-risk will continue to rise and fall in response to latest U.S./Iran headlines, but global oil supplies are increasing appreciably as floating shadow inventories are moving into more transparent regions of the world,\" Ritterbusch and Associates says in a note. The energy complex is also losing support from diesel futures \"as the heating season winds down amid a broad-based warming trend across the U.S. during the next couple of weeks,\" the firm adds. WTI is down 1.7% at $64.28 a barrel and Brent is off 1.4% at $69.84 a barrel. (anthony.harrup@wsj.com) </p><p>\n\n  -- </p><p>\n\n  EU's Buy-European Push Could Direct Public Funding to non-European Low-Carbon Steel, Lobby Group Says -- Market Talk </p><p>\n\n  1215 GMT - Europe's steel lobby group says that the bloc's current plan to boost public backing for European companies will leave the local steel sector behind. A leaked draft of the European Commission's Industrial Accelerator Act--set to be presented on March 4--requires a share of at least 25% of steel in public procurement to be low-carbon, but it is not clear whether low-carbon steel will count as a strategic product that must be produced in Europe, Eurofer says. \"In today's turbulent geopolitical context, it seems unthinkable that the steel industry is not being defined as strategic in the package,\" the group's director general, Axel Eggert, says. \"This goes hand in hand with strengthening Europe's autonomy, which means applying robust \"Made in Europe\" requirements,\" he says. (edith.hancock@wsj.com) </p><p>\n\n  -- </p><p>\n\n  European Gas Prices Vulnerable to Oil Rally and Gulf Risks -- Market Talk </p><p>\n\n  1017 GMT - Geopolitical risks that push oil prices higher also create upside for gas, as some long-term LNG and pipeline supplies to Europe are linked to crude, Rabobank analysts say. Key triggers include a sharp crude rally boosting oil-indexed LNG or Iranian attacks on Gulf energy infrastructure-particularly Qatari LNG. A partial disruption through the Strait of Hormuz could lift TTF toward 50 euros a megawatt hour,while full impairment of key infrastructure could send it above 100 euros, though such extreme scenarios are seen as low probability. A more limited Middle East flare-up could instead add 5 euros-10 euros a megawatt hour to TTF. Rabobank's base-case outlook remains 26 euros for 2Q and 29 euros for 2026 as a whole, but any escalation affecting oil-linked contracts could push prices into the 40s through spring and summer. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Palm Oil Ends Lower Amid Weak Demand -- Market Talk </p><p>\n\n  1012 GMT - Palm oil ended lower amid weak demand. Malaysia's palm oil exports during the Feb. 1-25 period are estimated to be 16% lower on month at 922,649 metric tons, cargo surveyor AmSpec Agri Malaysia said Wednesday. However, expectations of a sharper drop in Malaysian production this month could help tighten supplies and ease elevated inventories, Kenanga Futures says in a research note. Several Malaysian palm plantations reported earnings this week, with KL Kepong expecting CPO prices to range between 4,000-4,300 ringgit/ton over January-March. The Bursa Malaysia Derivatives contract for May delivery ended 48 ringgit lower at 4,005 ringgit a ton. (sherry.qin@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Zimbabwe Lithium Export Curbs Won't Hit the Same as DRC's on Cobalt -- Market Talk </p><p>\n\n  (MORE TO FOLLOW) Dow Jones Newswires</p><p>\n\n  02-26-26 1047ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-brings-tough-demands-to-iran-nuclear-talks-commodities-roundup-ce7e5cd9dd8af727",
            "pub_date": "2026-02-27 00:00:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple in Talks With Banks to Launch Apple Pay in India",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apple-in-talks-with-banks-to-launch-apple-pay-in-india-ce7e5cd9dd8bfe20",
            "pub_date": "2026-02-27 00:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly reports additional data on weight-loss pill from diabetes trial",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Eli Lilly on Thursday released new data from a head-to-head trial of its experimental weight-loss pill, orforglipron, and rival Novo Nordisk's oral semaglutide in diabetes patients, giving a more detailed picture of the side effects.</p>    * About 58% of patients who were on a 36-milligram dose ofLilly's drug in the study reported mild-to-moderate sideeffects, including nausea, diarrhea and vomiting, compared with45% of those treated with the 14 mg dose of oral semaglutide    * Novo sells oral semaglutide under the brand name Rybelsusfor patients with type 2 diabetes to control blood sugar    * About 10% of patients who received 36 mg orforgliprondiscontinued treatment due to side effects, compared with 5% ofthose treated with 14 mg Rybelsus           * Those who received orforglipron also reported an averageincrease in pulse rate    * Initial results announced in September showed 36 mgorforglipron lowered average blood glucose levels in patients by2.2%, compared with 1.4% on 14 mg Rybelsus    * Patients who took 36 mg orforglipron lost an average of8.9 kg (19.7 lb), or 9.2%, of their weight, compared with 5 kg(11 lb), or 5.3%, on 14 mg Rybelsus    * \"We think that the totality of the profile here is atrade-off that patients will be very happy to make because theyare getting better glycemic control and better weight loss aswell as no restriction on dosing with food and water,\" saidKenneth Custer, president of Lilly Cardiometabolic Health    * Lilly's orforglipron, like Rybelsus, mimics theappetite-suppressing GLP-1 hormone targeted by the company'sblockbuster injection tirzepatide, sold as Mounjaro andZepbound <p></p><p>\n               (Reporting by Mariam Sunny in Bengaluru; Editing by Anil D'Silva)</p></div>",
            "link": "https://hk.marketscreener.com/news/eli-lilly-reports-additional-data-on-weight-loss-pill-from-diabetes-trial-ce7e5cd9dd8bfe27",
            "pub_date": "2026-02-27 00:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China stocks end lower as traders hold off before key policy meeting",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-stocks-end-lower-as-traders-hold-off-before-key-policy-meeting-ce7e5cd9dd8bff22",
            "pub_date": "2026-02-27 00:00:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HKEX Sees Diverse IPOs Amid AI Bubble Risk",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"HZ4qjydM0xp\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        HKEX chief executive Bonnie Chan says the Hong Kong exchange has attracted a diverse range of IPO applicants, from different sectors and geographies. She tells Bloomberg's Stephen Engle that this will help the exchange weather uncertainty around the AI sector.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52534285');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/hkex-sees-diverse-ipos-amid-ai-bubble-risk-ce7e5cd9dd8bff21",
            "pub_date": "2026-02-27 00:00:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PepsiCo Launches in the UK",
            "description": "<div class=\"txt-s4 article-text\"><p>PepsiCo announced that it has officially landed in the UK. Born online and backed by pop culture, poppi is shaking up the soft drinks aisle with bold fruity flavours, vibrant design and main character energy in every sip. poppi delivers full flavour fizz that's made with ingredients you can love; low in sugar, low in calories and high in fibre - it's pure feel good-fizz that tastes as good as it looks.</p><p>poppi is launching with five delicious flavours including Strawberry Lemon, Raspberry Rose, Lemon Lime, Wild Berry and Orange. Founded in 2016 by husband-and-wife duo Allison and Stephen Ellsworth, Allison wanted to ditch soda, but not the taste, so she started mixing fruit juice, apple cider vinegar, and sparkling water in her Texas kitchen to create a better kind of soda. Fast-forward to 2026, and poppi is here to shake up the UK and revolutionise soda for the next generation.</p></div>",
            "link": "https://hk.marketscreener.com/news/pepsico-launches-in-the-uk-ce7e5cd9dd8bf220",
            "pub_date": "2026-02-26 23:45:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Power Corporation of Canada announces an Equity Buyback for 20,000,000 shares, representing 3.45% of its issued share capital.",
            "description": "<div class=\"txt-s4 article-text\"><p>Power Corporation of Canada (TSX:POW) announces a share repurchase program. Under the normal course issuer bid, the company will repurchase up to 20,000,000 subordinate voting shares, representing 3.45% of its issued shares. Any of the shares repurchased by the company pursuant to the bid will be cancelled.</p><p>The bid will be funded using company's existing cash resources. The bid will expire on the earlier of February 28, 2027, and the completion of purchases under the bid. As of February 16, 2026, the company had 579,249,434 subordinate voting shares issued and outstanding.</p></div>",
            "link": "https://hk.marketscreener.com/news/power-corporation-of-canada-announces-an-equity-buyback-for-20-000-000-shares-representing-3-45-of-ce7e5cd9dd8bf325",
            "pub_date": "2026-02-26 23:45:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sempra Provides Earnings Guidance for the Full-Year of 2027 and 2030",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Sempra provided earnings guidance for the full-year of 2027 and 2030. For full-year 2027, the company expects EPS to be in the range of $5.10 to $5.70.<br/><br/>\n\nFor full-year 2030, the company expects EPS to be in the range of $6.70 to $7.50.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/sempra-provides-earnings-guidance-for-the-full-year-of-2027-and-2030-ce7e5cd9dd8bf324",
            "pub_date": "2026-02-26 23:45:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rolls-Royce talking to multiple parties over narrow body partnership, CEO says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rolls-royce-talking-to-multiple-parties-over-narrow-body-partnership-ceo-says-ce7e5cd9dd8bf427",
            "pub_date": "2026-02-26 23:45:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Natural Gas Stocks Post Larger Than Expected Decline in Week Ended Feb. 20",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-natural-gas-stocks-post-larger-than-expected-decline-in-week-ended-feb-20-ce7e5cd9dd8bf426",
            "pub_date": "2026-02-26 23:45:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ElevenLabs Partners with Google Cloud for Cloud Services and the Latest NVIDIA Blackwell GPUs",
            "description": "<div class=\"txt-s4 article-text\"><p>ElevenLabs and Google Cloud announced a multi-year extension of their strategic collaboration to make high-quality, artificial intelligence voice tools more accessible to businesses worldwide. This agreement deepens the work between both companies to enable ElevenLabs' products--which can power real-time voice agents and localize content into more than 70 languages--using Google Cloud's global AI infrastructure and NVIDIA AI infrastructure. ElevenLabs will utilize Google Cloud'sG4 virtual machines (VMs), powered by NVIDIA RTX PRO 6000 Blackwell GPUs, to train and serve its voice models.</p><p>This latest agreement provides access to a significantly larger cluster of NVIDIA Blackwell GPUs, enabling ElevenLabs to reliably support even larger deployments for enterprise customers and ensure its research teams have access to highly optimized AI compute. Enterprises use ElevenLabs to deploy AI agents that respond instantly and naturally in almost any language. Today, ElevenLabs' technology powers critical use cases across industries, including financial services, retail, telecommunications, and more.</p><!-- Article --><p>Customers also use solutions from ElevenLabs to localize large libraries of content into more than 70 languages, generate consistent brand voices, and produce high-quality multimedia assets for advertising, training, internal enablement, and customer education. Through this partnership, ElevenLabs has also launched its solutions on Google Cloud Marketplace, allowing customers to scale conversational agents for customer support, internal training, and inbound sales, with simplified billing and compliance frameworks. Ultimately, ElevenLabs' deepening partnership with Google Cloud will allow the company to bring AI voice and conversational agent solutions to more global customers, including large enterprises.</p><p>ElevenLabs is also integrating Gemini models directly into its Agents Platform to unlock reasoning and multi-step planning for its voice assistants. Furthermore, ElevenLabs is incorporating Google's Veo model into its Creative Platform, enabling teams to produce multimedia content--including video and audio--in less time.</p></div>",
            "link": "https://hk.marketscreener.com/news/elevenlabs-partners-with-google-cloud-for-cloud-services-and-the-latest-nvidia-blackwell-gpus-ce7e5cd9dd8bf425",
            "pub_date": "2026-02-26 23:45:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly Says Orforglipron Outperforms Oral Semaglutide in Phase 3 Trial",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eli-lilly-says-orforglipron-outperforms-oral-semaglutide-in-phase-3-trial-ce7e5cd9dd8bf524",
            "pub_date": "2026-02-26 23:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart Agrees to $100 Million Settlement Over Alleged Deceptive Earnings Charges, US FTC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/walmart-agrees-to-100-million-settlement-over-alleged-deceptive-earnings-charges-us-ftc-says-ce7e5cd9dd8bf623",
            "pub_date": "2026-02-26 23:40:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia no longer surprises, but remains a key catalyst for sector",
            "description": "<div class=\"txt-s4 article-text article-text--clear\"><p>The chipmaker posted results above expectations, notably \"thanks to strong Blackwell shipments, which enabled it to set an April-quarter forecast well above estimates ($78bn, vs. $75bn expected) and demand visibility that now extends into 2027,\" said William Beavington, a sector analyst at Jefferies. <br/><br/>One point, however, is echoed by several observers: the market reaction reflects ever-higher expectations, in an environment where the artificial intelligence sector is evolving under strain. For Harlan Sur, an analyst at J.P. Morgan, \"the persistent uncertainty around the 2027 growth trajectory of NVDA's Data Center business\" would partly explain that level of demandingness. Nvidia, a company under constant analyst scrutiny, is now struggling to generate a genuine surprise effect. By way of example, Harlan Sur had already anticipated a possible upward revision in revenue to $78bn for next quarter. <br/><br/>Regarding sector momentum, Dan Ives, analyst at Wedbush, is significantly more upbeat. \"Nvidia's results and guidance, along with Jensen's bullish comments, should energize tech stocks and confirm the drivers and breadth of global demand tied to the AI revolution,\" he wrote in his note. He then concluded with a striking comparison: \"Watching Nvidia today is like following Michael Jordan in his early days with the Chicago Bulls: the start of a meteoric rise that is transforming the tech world.\"</p></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-no-longer-surprises-but-remains-a-key-catalyst-for-sector-ce7e5cd9dd8bf720",
            "pub_date": "2026-02-26 23:40:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CrowdStrike FalconID Extends Risk-Aware Identity Security to Multi-Factor Authentication",
            "description": "<div class=\"txt-s4 article-text\"><p>CrowdStrike announced the general availability of FalconID, extending the Falcon®? platform with zero-friction, phishing-resistant MFA. Identity is the front line of modern attacks, and this release advances CrowdStrike's Next-Gen Identity Security leadership with real-time, risk-aware protection against AI-accelerated phishing attacks and credential abuse at the point of authentication.</p><p>With an intelligent security fabric spanning the identity lifecycle, CrowdStrike eliminates friction, increases productivity, and stops breaches. As adversaries weaponize AI, the risk, scale, and impact of social engineering and credential abuse increase dramatically. Highly convincing campaigns can be launched by nearly anyone, with attackers routinely bypassing traditional MFA through AI-enhanced phishing, MFA fatigue, and session hijacking.</p><!-- Article --><p>At the same time, friction-heavy MFA slows users to the point organizations often disable it entirely. The future of secure access requires protection that's informed by real-time risk, adapts as conditions change, and doesn't slow productivity. Traditional IAM and PAM were designed to manage access, not stop breaches.</p><p>Even with MFA, they function as isolated, point-in-time controls - adding friction while lacking the real-time security context to stop AI-accelerated phished attacks. FalconID reimagines authentication as a seamless, risk-informed experience built directly into the Falcon sensor and delivered through the Falcon for Mobile app. Using real-time Falcon platform risk signals, it determines when access is safe and when it's not, without forcing users through unnecessary steps.</p><p>FalconID eliminates friction without compromising security, transforming identity and access management at the speed of AI. Falcon®? Next-Gen Identity Security already secures the full hybrid identity lifecycle across human, non-human, and AI agent identities - spanning initial access, privileged access, identity threat detection and response (ITDR), and SaaS identity security.</p><p>With the acquisitions of SGNL and Seraphic, CrowdStrike eliminates standing privileges and continuously secures interactions from the endpoint, through browser sessions, and into the cloud - starting at the point of authentication with FalconID. Key features and benefits include: Security-First Authentication: FalconID continuously evaluates Falcon platform risk signals across identity, endpoint, device, and behavior to determine when access is safe - and when it's not. When certainty is high, users authenticate transparently.</p><p>When risk changes, access adapts automatically. Zero-Friction, Device-Bound Verification: Eliminates passwords, push notifications, and one-time codes through FIDO2-based biometric authentication that requires verified physical proximity between the MFA device (mobile) and authentication device (laptop, workstation) to approve access. Unified Architecture: Delivered through the Falcon for Mobile app, FalconID verifies the user and device in real time - without redirects, third-party integrations, or bolt-on controls that create protection gaps and slow users down.</p><p>Next-Gen Identity Security Transformation: As the browser becomes the new endpoint, FalconID delivers passwordless browser authentication through Seraphic, extended by SGNL's Continuous Access Evaluation Protocol (CAEP)-driven enforcement integrated into Falcon®? Fusion SOAR. This continuously adapts access, eliminates standing privileges, protects users and interactions from first authentication through execution, and secures downstream systems as risk changes - without slowing users down.</p></div>",
            "link": "https://hk.marketscreener.com/news/crowdstrike-falconid-extends-risk-aware-identity-security-to-multi-factor-authentication-ce7e5cd9dd88f027",
            "pub_date": "2026-02-26 23:40:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IPG Photonics Secures $10 Million Lockheed Martin Order for Laser Defense Systems",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ipg-photonics-secures-10-million-lockheed-martin-order-for-laser-defense-systems-ce7e5cd9dd88f123",
            "pub_date": "2026-02-26 23:40:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cuba vows to defend itself against 'terrorist, mercenary aggression'",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Cuban President Miguel Diaz-Canel said on Thursday the Caribbean country will defend itself against any \"terrorist and mercenary aggression that seeks to undermine its sovereignty and national stability.\"</p><p>\n              His remarks on social media came after Havana said on Wednesday it had killed four exiles and wounded six others who sailed into Cuban waters aboard a Florida-registered speedboat on Wednesday and opened fire on a Cuban patrol.</p><!-- Article --><p>\n              The Cuban government said the group was comprised of anti-government Cubans, some of whom were previously wanted for plotting attacks.</p><p>\n              \"Cuba does not attack nor threaten,\" Diaz-Canel wrote on X. \"We have stated this on repeated occasions and reaffirm it today: Cuba will defend itself with determination and firmness.\"</p><p>\n              The incident took place at a time of heightened tensions with the United States, which has blocked oil shipments to the island in a bid to pressure the Communist-run government. </p><p>\n              The fuel shortages have hit transport and worsened power cuts on the Caribbean's largest island, where the electricity grid relies on imported oil. The U.N. has warned of a humanitarian crisis if Cuba's energy needs are not met.</p><p>\n               (Reporting by Anett Rios; Writing by Gabriel Araujo; Editing by Sarah Morland)</p></div>",
            "link": "https://hk.marketscreener.com/news/cuba-vows-to-defend-itself-against-terrorist-mercenary-aggression-ce7e5cd9dd88f32c",
            "pub_date": "2026-02-26 23:40:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Natural Gas Stocks Fall by 52 Bln Cubic Feet in Week Ended Feb. 20 Vs. Expected 50 Bln Decrease; Prior Decline of 144 Bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-natural-gas-stocks-fall-by-52-bln-cubic-feet-in-week-ended-feb-20-vs-expected-50-bln-decrease-ce7e5cd9dd88f324",
            "pub_date": "2026-02-26 23:41:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mideast-Asia crude tanker daily cost exceeds $200,000, first time since 2020, data shows",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mideast-asia-crude-tanker-daily-cost-exceeds-200-000-first-time-since-2020-data-shows-ce7e5cd9dd88f726",
            "pub_date": "2026-02-26 23:35:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asian physical rubber prices - February 26",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asian-physical-rubber-prices-february-26-ce7e5cd9dd89fe22",
            "pub_date": "2026-02-26 23:35:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ttet Union Corporation says 2025 net profit at T$1.32 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ttet-union-corporation-says-2025-net-profit-at-t-1-32-bln-ce7e5cd9dd89ff22",
            "pub_date": "2026-02-26 23:35:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Greece's OTE quarterly earnings rise 2.3% on mobile and home fiber broadband growth",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/greece-s-ote-quarterly-earnings-rise-2-3-on-mobile-and-home-fiber-broadband-growth-ce7e5cd9dd89f025",
            "pub_date": "2026-02-26 23:35:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Vistra expects initial energization on the Amazon site in Q4 2027 and full ramp up by Q4 2032-conf call",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/vistra-expects-initial-energization-on-the-amazon-site-in-q4-2027-and-full-ramp-up-by-q4-2032-conf-c-ce7e5cd9dd89f323",
            "pub_date": "2026-02-26 23:35:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ford Motor to Recall Almost 4.4 Million Vehicles Due to Lighting System Glitch",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ford-motor-to-recall-almost-4-4-million-vehicles-due-to-lighting-system-glitch-ce7e5cd9dd89f42c",
            "pub_date": "2026-02-26 23:35:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JD.com, DHL Partner to Support German Firms' Expansion in China, Europe",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jd-com-dhl-partner-to-support-german-firms-expansion-in-china-europe-ce7e5cd9dd89f422",
            "pub_date": "2026-02-26 23:35:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Broadcom Expects to Sell at Least 1 Million 3D Stacked Chips by 2027",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/broadcom-expects-to-sell-at-least-1-million-3d-stacked-chips-by-2027-ce7e5cd9dd89f62c",
            "pub_date": "2026-02-26 23:35:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asia prices of LPG, naphtha jump after Saudi terminal outage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asia-prices-of-lpg-naphtha-jump-after-saudi-terminal-outage-ce7e5cd9dd89f622",
            "pub_date": "2026-02-26 23:35:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US commerce secretary, Indian trade minister met in Delhi, US envoy says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-commerce-secretary-indian-trade-minister-met-in-delhi-us-envoy-says-ce7e5cd9dd89f626",
            "pub_date": "2026-02-26 23:35:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "S.Korea to sell $13.30 billion worth of T-bonds in March",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/s-korea-to-sell-13-30-billion-worth-of-t-bonds-in-march-ce7e5cd9dd89f727",
            "pub_date": "2026-02-26 23:35:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Costco, FedEx, Goodyear Among Companies Seeking Tariff Refunds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/costco-fedex-goodyear-among-companies-seeking-tariff-refunds-ce7e5cd9da80ff20",
            "pub_date": "2026-02-26 23:26:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BofA: Ferrovial Set for FY26 EBITDA Growth; Rating, Price Target Reaffirmed",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bofa-ferrovial-set-for-fy26-ebitda-growth-rating-price-target-reaffirmed-ce7e5cd9da81f522",
            "pub_date": "2026-02-26 23:10:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nepal election promises fail to stop youth exodus",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: Ahead of Nepal's election, leading political parties are vowing to create over a million jobs.</p><p>\n              That's because many young people, including Rahul Pariyar, are eyeing opportunities overseas.</p><!-- Article --><p>\n              At a training center in Kathmandu, Pariyar practices using a harness - learning the basic skills he will need for painting walls, cleaning high rises and other construction work in the United Arab Emirates.</p><p>\n              He said wages there are four times higher than in Nepal.</p><p>\n              \"In Nepal, one doesn't get proper employment, meaning one doesn't earn enough money, even if one has to migrate for the sake of raising children.\"</p><p>\n              He added that he is not interested in the upcoming election.</p><p>\n              \"It does not pay my wages,\" he says.</p><p>\n              The Himalayan nation, which grapples with a youth unemployment rate of 20.6%, will hold an election on March 5.</p><p>\n              :: File</p><p>\n              It was triggered by historic youth-led protests fueled by the lack of jobs and endemic corruption that forced the previous prime minister to resign. </p><p>\n              At least three million Nepalis currently work overseas, mainly in the Middle East, according to industry officials.</p><p>\n              Around 1,500 young people leave the country every day for foreign employment, according to data from the RSMN, a national federation of labor unions.</p><p>\n              At Kathmandu's main international airport, Parak Singh, another young person departing for the Gulf laments the lack of options at home.</p><p>\n              \"Nepal is like this, there is unemployment. There is a compulsion to leave. Rather than stay in Nepal, it feels necessary to go to the Gulf.\"</p><p>\n              The exodus has left many villages without most of their working-age men and women.</p><p>\n              Some political parties have promised to create over 1 million jobs ahead of the election, but skepticism remains over whether those plans can be delivered.</p><p>\n              Many youth blame Nepal's political parties for decades of instability through a merry-go-round of coalitions and elections.</p></div>",
            "link": "https://hk.marketscreener.com/news/nepal-election-promises-fail-to-stop-youth-exodus-ce7e5cd9da80f127",
            "pub_date": "2026-02-26 23:26:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO Says There's Still Uncertainty Around Canada's Current Account Balance Despite Narrowing Deficit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-says-there-s-still-uncertainty-around-canada-s-current-account-balance-despite-narrowing-deficit-ce7e5cd9da80f327",
            "pub_date": "2026-02-26 23:26:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASIA COFFEE-Vietnam domestic prices pick up post-holiday, Indonesia premiums fall",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asia-coffee-vietnam-domestic-prices-pick-up-post-holiday-indonesia-premiums-fall-ce7e5cd9da80f623",
            "pub_date": "2026-02-26 23:26:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}