{
    "data": [
        {
            "title": "Trump to tout economy, energy in Texas ahead of Republican primaries",
            "description": "<div class=\"txt-s4 article-text\"><p>CORPUS CHRISTI, Texas, Feb 27 (Reuters) - U.S. President Donald Trump will travel to southern Texas on Friday to tout his economic and fossil fuel agenda, just days before Republicans face competitive primary elections in the state.</p><p>\n              Trump has so far stayed out of his party's high-profile battle over a U.S. Senate seat, but his visit to Corpus Christi places him near several contested U.S. House of Representatives districts where Hispanic voters, an important constituency for Republicans nationally, could determine the outcome in November's midterm elections.</p><!-- Article --><p>\n              The trip follows a warning from a Texas Republican who said her recent loss in a state legislature race, despite Trump's endorsement, was a \"wake-up call\" for the party. </p><p>\n              The president's economy-focused event springboards off his State of the Union address, which sought to draw sharp contrasts with Democrats on affordability and immigration enforcement as they aim to gain control of Congress later this year.</p><p>\n              White House press secretary Karoline Leavitt said in a statement Trump will tout his \"drill baby drill\" agenda in Texas. The Corpus Christi area is the top exporter of liquefied natural gas in the U.S., with 42% of the product nationwide passing through its port.</p><p>\n              Midterm elections are historically seen as a check on the sitting president, and Trump has warned his agenda will be derailed if his party loses power. But first, Republicans in the deeply conservative state must settle on who they want to represent them in November's general election. </p><p>\n              Public opinion polls show Senator John Cornyn, in office since 2002, trailing two challengers - Texas Attorney General Ken Paxton and U.S. Representative Wesley Hunt - in Texas' most cutthroat contest.</p><p>\n              Unlike in Louisiana, where Trump encouraged a challenge to the incumbent Republican senator, the president has let the Texans duke it out in a contest made personal with accusations of sexual affairs and political ineffectiveness.</p><p>\n              Republican candidates in the Senate and some House races are expected to attend Trump's event on Friday.</p><p><b>CAN FORCED REDISTRICTING RESCUE REPUBLICANS?</b></p><p>\n              At the president's urging last year, Texas Republicans launched a redistricting fight aimed at improving the party's prospects in U.S. House races. With the new map in effect, Republicans could gain up to five more seats across the state. </p><p>\n              Hispanic voters in south Texas are key to the party's electoral success, said Corpus Christi's state Senator Adam Hinojosa, the first Republican to represent the Rio Grande Valley in the Texas Senate since 1874.</p><p>\n              \"We need the job opportunities, we need to make sure that our families are taken care of, we need to be able to afford all of the groceries and things to have a decent lifestyle,\" Hinojosa said in an interview.</p><p>\n              Crediting Trump's border policy and pro-oil agenda, Hinojosa said he thought the president's visit would help energize the Republican base.</p><p>\n              Trump has prioritized maximizing U.S. fossil fuel production by rolling back environmental regulations and streamlining permitting for energy projects, benefiting places like southern Texas.</p><p>\n              Even so, a recent Reuters/Ipsos poll found that 36% of people nationwide approved of Trump's handling of the economy while 56% disapproved. </p><p>\n              \"It's hard to know if he is perceptive to economic concerns,\" Tiffany Ritchie, 50, a self-declared independent in Corpus Christi, said in an interview, noting she voted for Trump for the first time in the 2024 presidential election. \"I would like to think he is, however, he is the kind of character who will just kind of throw anything against the wall and see if it sticks.\"</p><p>\n              Republicans are targeting two Democratic-held border districts: the Brownsville-area seat represented by Vicente Gonzalez since 2016, and the Laredo-area seat held by 11-term Representative Henry Cuellar.</p><p>\n              In December, Trump pardoned Cuellar and his wife, but has since backed local Republican judge Tano Tijerina, accusing Cuellar of an \"act of disloyalty\" for seeking re-election as a Democrat.</p><p>\n              \"If Donald Trump wants to remind South Texans how terrible the economy is, he can be our guest,\" Madison Andrus, spokesperson for the Democrats' campaign arm, said in a statement. </p><p></p><p> (Reporting by Bo Erickson, Jarrett Renshaw and Nolan McCaskill; Editing by Colleen Jenkins and Chris Reese)</p><p>\n            By Bo Erickson</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-to-tout-economy-energy-in-texas-ahead-of-republican-primaries-ce7e5cded081f326",
            "pub_date": "2026-02-27 19:05:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Restaurants emerge as bright spot for US job growth as consumers seek treats",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW YORK, Feb 27 (Reuters) - On paper, American consumers spent last year tightening their belts, and even retail heavyweights stumbled. But sit-down restaurants and some drive-through chains buzzed with patrons seeking a special treat or cheap comfort food.</p><p>\n              Their upbeat sales made the U.S. restaurant industry a rare bright spot for jobs, with restaurant payrolls ticking up 1% last year, adding about 108,000 jobs, according to the Bureau of Labor Statistics. </p><!-- Article --><p>\n              In contrast, the overall U.S. economy added 181,000 non-farm jobs in 2025, marking the weakest annual payroll growth in 20 years outside a recession year.</p><p>\n              Success among restaurants was not evenly spread, though.</p><p>\n              Corporate filings show that eateries such as Brinker's Chili's, Yum Brands' Taco Bell and fast-growing coffee chain Dutch Bros lured customers by aggressively marketing bundled deals, leaning into digital innovation and limited-time offers, and focusing on high-margin, Instagrammable food. </p><p>\n              But previous darlings like Chipotle and Cava were hurt by what analysts call the \"slop-bowl fatigue\" -  growing weariness among younger consumers with high-priced, customizable grain or salad bowls. </p><p>\n              Tempe, Arizona-based Dutch Bros and its franchisees added roughly 8,000 employees in the last two years, a 33% increase, the company said. </p><p>\n              \"We have a healthy pipeline of growth,\" CEO Christine Barone told Reuters after the company's earnings in February. The brand, which serves customizable beverages, is a hit with younger consumers, Barone said.  </p><p>\n              A similar story is playing out at another chain that, like Dutch Bros, sells more treats than meals.</p><p>\n              Ice cream chain Whit's Frozen Custard has grown its payroll by up to 40% a year for the past two years, said owner Bill Aseere, to keep up with rapid growth. It now has stores in 93 locations across 10 states and some 15 to 20 employees per store. </p><p>\n              Amanda Wang, co-founder of fast-growing Chinese beverage chain Ningji Lemon Tea - part of a tidal wave of Chinese tea brands coming to the U.S. - said her chain's new restaurants in the U.S. were buoyed by demand among price-weary consumers for affordable indulgences. </p><p>\n              Tea \"offers that little bit of happiness,\" she said.</p><p>\n              As a whole, the restaurant industry grew payrolls even as it weathers depressed traffic and rising labor costs, analysts say, thanks in part to menu price increases. Menu prices at restaurants grew 4.1% in 2025 compared to grocery inflation of 2.3%, according to the Federal Reserve Bank of St. Louis. </p><p><b>DIVERGING FORTUNES</b></p><p>\n              A deeper look at 2025 payroll data shows the difference in fortunes between types of restaurants: staff headcount at snack and non-alcoholic beverage restaurants grew 3.6% in 2025 and those at sit-down restaurants rose 1%. But fast-food payrolls grew only 0.4%, while cafeterias and buffet payrolls shrank 3.9%. </p><p>\n              \"At the end of the day, people want go out to eat and celebrate those big occasions,\" said Chad Moutray, an economist at the National Restaurant Association, referring to resilient spending at sit-down restaurants. </p><p>\n              \"Consumers might be pulling back from vacations, but they still prioritize eating out.\"</p><p>\n              The payroll data and Moutray's comments underscore what the industry calls the \"lipstick effect\" - consumers tightened their budgets, canceling expensive trips and postponing big-ticket purchases, but treated themselves to an indulgent meal, coffee or dessert.</p><p>\n              Brinker's reported 23% growth in its hourly restaurant staff between fiscal years 2024 and 2025, according to SEC filings, though it indicated that a growing share of its employees were part-time. </p><p>\n              Darden, the parent company of sit-down restaurants like Olive Garden and LongHorn Steakhouse, increased staff for fiscal 2025 by about 3.8%.</p><p>\n              Most national restaurant chains are franchised and do not report total employment figures among franchisees, but Chipotle and Starbucks, which operate the majority of their own stores, reported slight declines in total headcount for fiscal year 2025. </p><p>\n              While cascades of tariff announcements have forced other industries to raise prices and reroute sourcing, restaurant owners have only faced the tariffs impacting narrow categories like cup packaging and Chinese Sichuan peppers. </p><p></p><p> (Reporting by Waylon Cunningham; Editing by Sayantani Ghosh and Nick Zieminski)</p><p>\n            By Waylon Cunningham</p></div>",
            "link": "https://hk.marketscreener.com/news/restaurants-emerge-as-bright-spot-for-us-job-growth-as-consumers-seek-treats-ce7e5cded081f522",
            "pub_date": "2026-02-27 19:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chevron-led Kazakhstan Oil Field Nears Full Production Capacity, Minister Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chevron-led-kazakhstan-oil-field-nears-full-production-capacity-minister-says-ce7e5cded081f620",
            "pub_date": "2026-02-27 19:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's third-quarter GDP growth estimated at 7.8% following data revamp",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - India's economy grew 7.8% in October-December from the same period a year earlier, after posting 8.4% growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data.</p><p>\n              For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6%, the National Statistics Office said. It had been forecast to grow by 7.4% under the old data series.</p><!-- Article --><p><b>COMMENTARY:</b></p><p><b>MADHAVI ARORA, CHIEF ECONOMIST, EMKAY GLOBAL FINANCIAL SERVICES, MUMBAI:</b></p><p>\n              \"The revised GDP series, featuring improved sectoral representation, reduced deflator-related distortions, and a more comprehensive capture of economic activity, has led to a recalibration of historical data. </p><p>\n              The FY26 Second Advance Estimate now projects real GDP growth at 7.6%, up from the 7.4% in the First Advance Estimate. This follows a stronger FY25 print of 7.1% (revised up from 6.5% under the earlier base).\"</p><p><b>RADHIKA RAO, SENIOR ECONOMIST, DBS BANK, SINGAPORE:</b></p><p>\n              \"At first glance, the momentum in the rebased growth numbers appears to be marginally stronger than the previous trend, with methodological changes expected to have captured updated production structures, wider coverage of segments, new ratios, and improved government data sets, including those that capture activity in the informal sector. </p><p>\n              Service sector performance signals a strong lift, besides double-digit growth in manufacturing. The October-December quarter also benefited from indirect tax rationalisation and festive demand, in addition to a better faring rural farm sector. The rebased numbers are close to our forecast of 7.7% YoY for FY26.\"</p><p>\n               (Reporting by Kashish Tandon, Meenakshi Maidas in Bengaluru; compiled by Abinaya Vijayaraghavan; Editing by Sonia Cheema)</p></div>",
            "link": "https://hk.marketscreener.com/news/instant-view-india-s-third-quarter-gdp-growth-estimated-at-7-8-following-data-revamp-ce7e5cded08efe20",
            "pub_date": "2026-02-27 19:05:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SocGen's Overnight Economic News Summary",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/socgen-s-overnight-economic-news-summary-ce7e5cded08efe26",
            "pub_date": "2026-02-27 19:05:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moore Threads Technology says prelim 2025 net loss narrows to 1 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/moore-threads-technology-says-prelim-2025-net-loss-narrows-to-1-billion-yuan-ce7e5cded08efe25",
            "pub_date": "2026-02-27 19:06:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "WuXi XDC Licenses Cancer Tech to AI Biotech Firm Earendil in Deal Potentially Valued at $885 Million",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Jason Chau </p><br/><p>\n  Chinese pharmaceutical company WuXi XDC is partnering with U.S. biotech startup Earendil Labs in a deal it says could be worth up to $885 million. </p><!-- Article --><p>\n\n  Under the agreement, Hong Kong-listed WuXi will grant Earendil, which uses artificial-intelligence for drug discovery, exclusive global license to its proprietary cancer therapy technology. </p><p>\n\n  Earendil will use the technology to conjugate antibodies discovered through its AI intelligence platform to develop candidates for cancer treatment, WuXi said in a statement Friday. </p><p>\n\n  Including upfront and milestone payments, WuXi said the deal could have a potential value of about $885 million. It will also be eligible to receive tiered royalties on sales of any products. </p><p>\n\n  WuXi will support the chemical, manufacturing and controls stage of drug development, while Earendil will focus on commercialization. </p><p>\n\n  Earendil specializes in using machine learning to research and produce innovative drugs targeting conditions including autoimmune diseases. </p><br/><p>\n  Write to Jason Chau at jason.chau@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0559ET</p></div>",
            "link": "https://hk.marketscreener.com/news/wuxi-xdc-licenses-cancer-tech-to-ai-biotech-firm-earendil-in-deal-potentially-valued-at-885-million-ce7e5cded08eff2d",
            "pub_date": "2026-02-27 19:00:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia tightens rules for Airbnb-style rentals",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-tightens-rules-for-airbnb-style-rentals-ce7e5cded08eff2c",
            "pub_date": "2026-02-27 19:00:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dated alert on Sandmartin International Holdings withdrawn",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dated-alert-on-sandmartin-international-holdings-withdrawn-ce7e5cded08eff26",
            "pub_date": "2026-02-27 19:00:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aurobindo Pharma says completion of US FDA inspection at unit I of Eugia Pharma Specialities",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/aurobindo-pharma-says-completion-of-us-fda-inspection-at-unit-i-of-eugia-pharma-specialities-ce7e5cded08ef02d",
            "pub_date": "2026-02-27 19:00:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coupang Logs High Earnings Amid 2.19 Billion Won Fine On Marketing Breaches",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coupang-logs-high-earnings-amid-2-19-billion-won-fine-on-marketing-breaches-ce7e5cded08ef025",
            "pub_date": "2026-02-27 19:00:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EU Commission probes Romania's revised plan for CE Oltenia restructuring",
            "description": "<div class=\"txt-s4 article-text\"><p>BRUSSELS, Feb 27 (Reuters) - The European Commission said on Friday it had opened an in-depth investigation into Romania's amended restructuring plan for state-owned lignite power holding company CE Oltenia.</p><p>\n              The Commission will assess whether the revised restructuring plan complies with EU State aid rules, it said in a statement.</p><!-- Article --><p></p><p> (Reporting by Gianluca Lo Nostro; Editing by Sudip Kar-Gupta)</p></div>",
            "link": "https://hk.marketscreener.com/news/eu-commission-probes-romania-s-revised-plan-for-ce-oltenia-restructuring-ce7e5cded08ef126",
            "pub_date": "2026-02-27 19:00:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trina Solar's shareholder to sell 2% stake in co",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trina-solar-s-shareholder-to-sell-2-stake-in-co-ce7e5cded08ef223",
            "pub_date": "2026-02-27 19:00:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Fiscal Q4 Adjusted Earnings, Revenue Rise; Guidance Beats -- Shares Up Pre-Bell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-fiscal-q4-adjusted-earnings-revenue-rise-guidance-beats-shares-up-pre-bell-ce7e5cded08ef222",
            "pub_date": "2026-02-27 19:01:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSI Solar prelim 2025 net profit down 54.6% Y/Y",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/csi-solar-prelim-2025-net-profit-down-54-6-y-y-ce7e5cded08ef221",
            "pub_date": "2026-02-27 19:01:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MetaX Integrated Circuits prelim 2025 net loss at 781.5 million yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/metax-integrated-circuits-prelim-2025-net-loss-at-781-5-million-yuan-ce7e5cded08ef226",
            "pub_date": "2026-02-27 19:01:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's MFG buys around 135,000 tons corn, traders say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-mfg-buys-around-135-000-tons-corn-traders-say-ce7e5cded08ef321",
            "pub_date": "2026-02-27 19:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's April-January fiscal deficit at 63% of 2025/26 target",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW DELHI, Feb 27 (Reuters) - India's fiscal deficit in April-January was 9.8 trillion rupees ($107.69 billion) or 63% of the estimate for the financial year ending March 31, government data showed on Friday.</p><p>\n              ($1 = 91.0010 Indian rupees)</p><!-- Article --><p></p><p> (Reporting by Shivangi  Acharya; Editing by Mrigank Dhaniwala)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-s-april-january-fiscal-deficit-at-63-of-2025-26-target-ce7e5cded08ff02d",
            "pub_date": "2026-02-27 18:51:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India's GDP growth estimated at 7.8% in Oct-Dec following data revamp",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW DELHI, Feb 27 (Reuters) - India's economy grew 7.8% in October-December from the same period a year earlier, after posting 8.4% growth in the previous quarter, the government said on Friday, as it unveiled a revised series of national output data.</p><p>\n              For the full fiscal year ending in March, the government expects the South Asian economy to have grown by 7.6%, the National Statistics Office said. It had been forecast to grow by 7.4% under the old data series.</p><!-- Article --><p>\n              Prime Minister Narendra Modi's government has undertaken to revamp economic data, including for inflation and gross domestic product, by expanding the sources of information and updating the base year to 2022-23, among other changes. The adjustments aim to address criticism of outdated data practices and enhance accuracy. </p><p></p><p> (Reporting by Nikunj Ohri and Shubham Batra in New DelhiEditing by Gareth Jones)</p></div>",
            "link": "https://hk.marketscreener.com/news/india-s-gdp-growth-estimated-at-7-8-in-oct-dec-following-data-revamp-ce7e5cded08ff021",
            "pub_date": "2026-02-27 18:51:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gulf Development announces establishment of Gulf Edge Technology Company Limited",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gulf-development-announces-establishment-of-gulf-edge-technology-company-limited-ce7e5cded08ff027",
            "pub_date": "2026-02-27 18:51:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IOI Properties posts qtrly profit attributable of 708.8 mln rgt",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ioi-properties-posts-qtrly-profit-attributable-of-708-8-mln-rgt-ce7e5cded08ff025",
            "pub_date": "2026-02-27 18:51:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VEGOILS-Palm rises, but posts monthly drop",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/vegoils-palm-rises-but-posts-monthly-drop-ce7e5cded08ff12d",
            "pub_date": "2026-02-27 18:51:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Crude Oil Prices Surge as U.S., Iran Extend Nuclear Talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/crude-oil-prices-surge-as-u-s-iran-extend-nuclear-talks-ce7e5cded08ff123",
            "pub_date": "2026-02-27 18:51:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's Retail Sales Up 4.4% in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-retail-sales-up-4-4-in-january-ce7e5cded08ff120",
            "pub_date": "2026-02-27 18:51:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German government spokesperson: Germany assumes future U.S. tariffs on EU products will not exceed tariff agreement struck in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-government-spokesperson-germany-assumes-future-u-s-tariffs-on-eu-products-will-not-exceed-t-ce7e5cded08ff22c",
            "pub_date": "2026-02-27 18:51:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German government spokesperson: Germany wants to preserve U.S.-EU tariff deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-government-spokesperson-germany-wants-to-preserve-u-s-eu-tariff-deal-ce7e5cded08ff223",
            "pub_date": "2026-02-27 18:51:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dewa Resumes Trading on Dubai Bourse",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dewa-resumes-trading-on-dubai-bourse-ce7e5cded08ff220",
            "pub_date": "2026-02-27 18:51:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF is looking into legal claims by U.S. unit for tariff reimbursement",
            "description": "<div class=\"txt-s4 article-text\"><p>LUDWIGSHAFEN, Germany, Feb 27 (Reuters) - BASF's CEO said if the chemical group finds its U.S. subsidiary has a legal claim, it will sue for import tariff reimbursement after the U.S. Supreme Court quashed many of President Donald Trump's tariffs. </p><p>\n              \"If this change in regulations does indeed result in a legal title for BASF Corporation, we of course have a fiduciary duty to pursue this claim,\" CEO Markus Kamieth said during a press conference after releasing quarterly results.</p><!-- Article --><p>\n              He added the internal assessment was ongoing and the outcome unclear. Finance Chief Dirk Elvermann said that most products sold in the United States were made there, strongly limiting any direct impact from import duties.</p><p></p><p> (Reporting by Patricia WeissWriting by Ludwig , editing by Kirsti Knolle)</p></div>",
            "link": "https://hk.marketscreener.com/news/basf-is-looking-into-legal-claims-by-u-s-unit-for-tariff-reimbursement-ce7e5cded08ff224",
            "pub_date": "2026-02-27 18:51:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Montage technology prelim 2025 net profit up 58.4% y/y",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/montage-technology-prelim-2025-net-profit-up-58-4-y-y-ce7e5cded08ff42c",
            "pub_date": "2026-02-27 18:46:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Allied Group says Edwin Lo King Yau will retire as an executive director",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/allied-group-says-edwin-lo-king-yau-will-retire-as-an-executive-director-ce7e5cded08ff425",
            "pub_date": "2026-02-27 18:46:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Q4 Adjusted Earnings, Revenue Rise; Plans to Reduce Workforce by Over 40%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-q4-adjusted-earnings-revenue-rise-plans-to-reduce-workforce-by-over-40-ce7e5cded08ff524",
            "pub_date": "2026-02-27 18:46:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Solar posts FY profit attributable RMB844.5 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-solar-posts-fy-profit-attributable-rmb844-5-million-ce7e5cded08ff621",
            "pub_date": "2026-02-27 18:46:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jinko Solar prelim 2025 net loss at 6.8 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jinko-solar-prelim-2025-net-loss-at-6-8-billion-yuan-ce7e5cded08ff721",
            "pub_date": "2026-02-27 18:46:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google Summoned by Italian Communications Authority Over Use of Newspaper Content by AI-Powered Search Engine",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/google-summoned-by-italian-communications-authority-over-use-of-newspaper-content-by-ai-powered-sear-ce7e5cded08ff725",
            "pub_date": "2026-02-27 18:46:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German government spokesperson reiterates Europeans will take coordinated action in tariffs dispute with US",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-government-spokesperson-reiterates-europeans-will-take-coordinated-action-in-tariffs-dispute-ce7e5cded08cfe23",
            "pub_date": "2026-02-27 18:46:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German government spokesperson: Germany's Merz, Trump will discuss bilateral relations, security, trade issues during meeting in Washington Tuesday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-government-spokesperson-germany-s-merz-trump-will-discuss-bilateral-relations-security-tr-ce7e5cded08cfe21",
            "pub_date": "2026-02-27 18:40:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rheinmetall Unit Bags Order for Field Hospitals in Denmark",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rheinmetall-unit-bags-order-for-field-hospitals-in-denmark-ce7e5cded08cff20",
            "pub_date": "2026-02-27 18:40:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dyson settles Malaysian workers' UK lawsuit",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 27 (Reuters) - Two dozen migrant workers who alleged they were subjected to forced labour at a Malaysian factory while making parts for British vacuum cleaner manufacturer Dyson have settled their London lawsuit, their lawyers said on Friday.</p><p>\n              The 24 workers from Nepal and Bangladesh, one of whom has died and whose estate brought the case, sued Dyson Technology Ltd, Dyson Ltd and a Malaysian subsidiary in 2022.</p><!-- Article --><p>\n              The claimants were workers for Malaysian firm ATA Industrial or its sister company and made components for Dyson products. </p><p>\n              Their lawyers previously said the workers had money unlawfully deducted from their wages and were sometimes beaten for not meeting onerous targets, alleging the Dyson companies were ultimately responsible.</p><p>\n              Dyson, whose Malaysian subsidiary cancelled its contract with ATA in 2021, denied the claimants' allegations.</p><p>\n              The lawsuit at London's High Court was settled, the claimants' law firm Leigh Day said in a statement, with no admission of liability by the defendants.</p><p>\n              \"This resolution was reached in recognition of the expenses of litigation and the benefits of settlement,\" a statement on Leigh Day's website said.</p><p>\n              \"The defendants deny and have always denied all liability in respect of the claimants, who were employed by a third-party supplier, at factories in Malaysia which were owned and operated by ATA Industrial (M) Sdn Bhd and its related entities.\"</p><p>\n               (Reporting by Sam Tobin, Editing by Paul Sandle)</p></div>",
            "link": "https://hk.marketscreener.com/news/dyson-settles-malaysian-workers-uk-lawsuit-ce7e5cded08cf122",
            "pub_date": "2026-02-27 18:41:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Constelli Signals Private Limited announced that it has received INR 180 million in funding from General Catalyst Group Management, LLC, 360 One Wam Limited, Pravega Ventures Partners LLP",
            "description": "<div class=\"txt-s4 article-text\"><p>Constelli Signals Private Limited announced that it has raised ?180 crores in a round of funding led by new investor General Catalyst Group Management, LLC on February 27, 2026. The transaction included participation from returning investor Pravega Ventures Partners LLP and new investor 360 One Wam Limited. The company has issued convertible preferred stock in the transaction.</p></div>",
            "link": "https://hk.marketscreener.com/news/constelli-signals-private-limited-announced-that-it-has-received-inr-180-million-in-funding-from-gen-ce7e5cded08cf227",
            "pub_date": "2026-02-27 18:41:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cambricon Technologies says prelim 2025 net profit at 2.1 billion yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cambricon-technologies-says-prelim-2025-net-profit-at-2-1-billion-yuan-ce7e5cded08cf32d",
            "pub_date": "2026-02-27 18:41:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}