{
    "data": [
        {
            "title": "CBOT wheat rallies to 1-year high as US-Iran tensions ignite short covering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cbot-wheat-rallies-to-1-year-high-as-us-iran-tensions-ignite-short-covering-ce7e5cdfdc81f722",
            "pub_date": "2026-02-28 04:01:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "QIA, Visa and ADIA set to anchor SoftBank's PayPay IPO, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/qia-visa-and-adia-set-to-anchor-softbank-s-paypay-ipo-sources-say-ce7e5cdfdc81f721",
            "pub_date": "2026-02-28 04:01:23",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SoftBank's PayPay set for Nasdaq listing with QIA, Visa, ADIA backing: sources",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/softbank-s-paypay-set-for-nasdaq-listing-with-qia-visa-adia-backing-sources-ce7e5cdfdc81f726",
            "pub_date": "2026-02-28 04:01:23",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goldman bucks private credit redemption trend as AI disruption fears mount",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/goldman-bucks-private-credit-redemption-trend-as-ai-disruption-fears-mount-ce7e5cdfdc81f724",
            "pub_date": "2026-02-28 04:01:24",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "OPEC+ Seen Resuming Output Hikes After 3-Month Pause, Analysts Say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/opec-seen-resuming-output-hikes-after-3-month-pause-analysts-say-ce7e5cdfdc8ef121",
            "pub_date": "2026-02-28 03:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Autodesk Making Case as AI Beneficiary, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/autodesk-making-case-as-ai-beneficiary-rbc-says-ce7e5cdfdc8ef220",
            "pub_date": "2026-02-28 03:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix surges as investors cheer exit from Warner Bros race",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: Shares of Netflix jumped as much as eleven-and-a-half percent on Friday, as investors applauded its decision to exit the race for Warner Bros Discovery after a months-long bidding war with Paramount Skydance.</p><p>\n              Shares of David Ellison's Paramount, meanwhile, soared more than 20%, as a merger with Warner Bros would allow it to tap into some of Hollywood's most prized assets across film, TV and streaming.</p><!-- Article --><p>\n              Netflix declined to match Paramount's latest $31 per share bid, or raise its offer of nearly $28 a share, saying the deal was, quote, \"no longer financially attractive.\"</p><p>\n              \"We were supporting Paramount because we believe in David Ellison...\"</p><p>\n              Tim Richards, founder and chief executive of privately held cinema operator Vue International, said he supported Paramount's bid of Warner Bros because he viewed it as more likely to prioritize theatrical releases than streaming giant Netflix.</p><p>\n              \"I'm hoping that Netflix now having really gone in and seen and learned more about how important it is to get a theatrical release, how we are that engine that drives all the ancillary revenue streams, and it's not something to fear, it's something to embrace, and I'm hoping that some good will come out of that, because we would love to show some of Netflix's amazing movies.\"</p><p>\n              As for Paramount's streaming unit, a combination with HBO Max and Discovery+ would reshape its position in a streaming era long dominated by Netflix.</p><p>\n              Still, one analyst told Reuters that given Warner Bros' debt load, Paramount's acquisition was, quote, \"more about Ellison taking over Hollywood and ego than it is about good business sense.\"</p></div>",
            "link": "https://hk.marketscreener.com/news/netflix-surges-as-investors-cheer-exit-from-warner-bros-race-ce7e5cdfdc8ef227",
            "pub_date": "2026-02-28 03:55:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fortress Value Acquisition Corp. V Closes $250 Million IPO",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fortress-value-acquisition-corp-v-closes-250-million-ipo-ce7e5cdfdc8ef225",
            "pub_date": "2026-02-28 03:55:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Goldman Sachs Says Fund's Software Exposure Near Bottom of Peer Range",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/goldman-sachs-says-fund-s-software-exposure-near-bottom-of-peer-range-ce7e5cdfdc8ef32d",
            "pub_date": "2026-02-28 03:55:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canadian dollar hits 11-day high as investors shake off GDP data",
            "description": "<div class=\"txt-s4 article-text\"><p>TORONTO, Feb 27 (Reuters) - The Canadian dollar clawed back most of its monthly losses against the U.S. dollar on Friday as broad-based declines for the greenback offset domestic data that showed the economy contracting in the fourth quarter.</p><p>\n              The loonie was trading 0.4% higher at 1.3630 per U.S. dollar, or 73.37 U.S. cents, after touching its strongest level since February 16 at 1.3626. Among the Group of 10 currencies, only the safe-haven Swiss franc posted stronger gains.</p><!-- Article --><p>\n              Another safe-haven is gold. It rose to nearly a one-month high, supported by geopolitical tensions after the U.S. and Iran extended nuclear talks.</p><p>\n              \"With gold rallying, the USD has come under pressure and that has helped to propel USD-CAD lower,\" said George Davis, chief technical strategist at RBC Capital Markets, adding that month-end flows could also have helped support the loonie, which was down 0.1% in February.</p><p>\n              The U.S. dollar edged lower against a basket of major currencies, while the price of oil rose 2.7% to $66.99 a barrel as traders remained on alert for potential supply disruptions. Oil is one of Canada's major exports.</p><p>\n              Canadian Prime Minister Mark Carney will meet business leaders in Mumbai and start talks on a comprehensive trade agreement, which is expected to be completed by November, Canada's foreign minister told Reuters.</p><p>\n              Canada's gross domestic product fell at an annualized pace of 0.6% in the October-December quarter as manufacturers dipped heavily into inventories to meet demand, closing out the slowest year of growth for the country since 2020. Economists and the Bank of Canada had expected a flat reading.</p><p>\n              \"The Canadian economy continues to struggle and track somewhat weaker than the Bank of Canada's latest MPR (Monetary Policy Report) projections, although some of the underlying detail in today's report was admittedly stronger than the headline figure,\" Andrew Grantham, a senior economist at CIBC Capital Markets, said in a note.</p><p>\n              Canadian government bond yields eased across the curve, tracking moves in U.S. Treasuries. The 10-year was down 3.6 basis points at 3.139%, marking its lowest level since November 28.</p><p></p><p>(Reporting by Fergal Smith; Editing by Paul Simao)</p><p>\n            By Fergal Smith</p></div>",
            "link": "https://hk.marketscreener.com/news/canadian-dollar-hits-11-day-high-as-investors-shake-off-gdp-data-ce7e5cdfdc8ef327",
            "pub_date": "2026-02-28 03:46:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CANADA FX DEBT-Canadian dollar hits 11-day high as investors shake off GDP data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/canada-fx-debt-canadian-dollar-hits-11-day-high-as-investors-shake-off-gdp-data-ce7e5cdfdc8ef52c",
            "pub_date": "2026-02-28 03:41:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US oil output fell in December to lowest since June 2025, EIA says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-oil-output-fell-in-december-to-lowest-since-june-2025-eia-says-ce7e5cdfdc8ef526",
            "pub_date": "2026-02-28 03:41:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall St on course for monthly declines on AI worries, renewed tariff angst, geopolitical strife",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW YORK, Feb 27 (Reuters) - Wall Street extended its selloff on Friday, as weakness in tech and financial shares helped put the S&amp;P 500 and the Nasdaq on track for their largest monthly percentage losses since March 2025, capping a February marked by worries over costs and disruption related to artificial intelligence, revived tariff uncertainties and simmering geopolitical tensions.</p><p>\n              All three major indexes were decisively lower, and poised to show steep weekly declines, with the blue-chip Dow on the verge of logging its biggest weekly drop since November.</p><!-- Article --><p>\n              \"February was a terrible month for the Nasdaq, and we saw a rotation into old-economy stocks,\" said Peter Cardillo, chief market economist at Spartan Capital Securities in New York. \"That rotation helped the broader market a little bit.\"</p><p>\n              Financial stocks slid after worries of contagion in the sector after reports that Barclays, Jefferies, Wells Fargo and other banks face potential losses related to the collapse of UK mortgage provider Market Financial Solutions Ltd, amid broader concerns about lending standards. Wells Fargo, Jefferies and U.S.-listed shares of Barclays dropped between 4.2% and 10.8%.</p><p>\n              Tech shares also continued to weigh on the indexes as lingering fears related to AI dragged chips and software down 2.0% and 1.9%, respectively.</p><p>\n              Defensive sectors such as consumer staples, healthcare and utilities were the session's clear outperformers.</p><p>\n              \"Credit fears are weighing on the banking sector today,\" Cardillo added. \"And of course this continuing AI selloff and the PPI report, which was very ugly. So today we're seeing a flight to safety.\"  </p><p>\n              On the economics front, a hotter-than-expected Producer Price Index reading fortified expectations that the U.S. Federal Reserve is unlikely to cut its key interest rate in the near term.</p><p>\n              Financial markets are currently pricing in a 96.1% probability that the central bank will leave the Fed funds target rate in the 3.50% to 3.75% range at its upcoming monetary policy meeting in March, according to CME's FedWatch tool.</p><p>\n              The Dow Jones Industrial Average fell 654.72 points, or 1.32%, to 48,844.48, the S&amp;P 500 lost 53.45 points, or 0.77%, to 6,855.41 and the Nasdaq Composite lost 277.68 points, or 1.21%, to 22,600.70. </p><p>\n              Of the 11 major sectors in the S&amp;P 500, energy led the gainers with a boost from rising crude prices, while financial and technology stocks suffered the steepest percentage losses.</p><p>\n              Nvidia slid 3.4%, extending the previous session's 5.5% drop despite solid earnings, a sign that risk sentiment for all things AI remained shaky.</p><p>\n              Zscaler plunged 12.6% after the cloud security firm reported a wider net loss in the second quarter. </p><p>\n              Netflix jumped 13.0% as investors cheered its decision to exit the fight for Warner Bros Discovery, which dropped 2.0%. Paramount Skydance, WBD's likely buyer, soared by 23.2%.</p><p>\n              Block surged 14.5% after the payments firm said it would axe nearly half its workforce, as part of its effort to embed AI across operations.</p><p>\n              Dell shot up 21.8% after the PC maker said it expects revenue from its key AI-optimized servers business to double in fiscal year 2027 and promised to return more cash to shareholders.</p><p>\n              Declining issues outnumbered advancers by a 1.56-to-1 ratio on the NYSE. There were 450 new highs and 92 new lows on the NYSE.</p><p>\n              On the Nasdaq, 1,434 stocks rose and 3,226 fell as declining issues outnumbered advancers by a 2.25-to-1 ratio. </p><p>\n              The S&amp;P 500 posted 45 new 52-week highs and 2 new lows while the Nasdaq Composite recorded 65 new highs and 104 new lows.</p><p>\n              (Reporting by Stephen Culp in New York; Additional reporting by Shashwat Chauhan and Ragini Mathur in Bengaluru; Editing by Matthew Lewis)</p><p>\n            By Stephen Culp and Ragini Mathur</p></div>",
            "link": "https://hk.marketscreener.com/news/wall-st-on-course-for-monthly-declines-on-ai-worries-renewed-tariff-angst-geopolitical-strife-ce7e5cdfdc8fff23",
            "pub_date": "2026-02-28 03:36:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IAEA: Local ceasefire will help restore power backup to Ukraine's Zaporizhzhia nuclear plant",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iaea-local-ceasefire-will-help-restore-power-backup-to-ukraine-s-zaporizhzhia-nuclear-plant-ce7e5cdfdc8ff12c",
            "pub_date": "2026-02-28 03:25:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target Needs Structural Improvement to Sustain Momentum, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-needs-structural-improvement-to-sustain-momentum-rbc-says-ce7e5cdfdc8ff123",
            "pub_date": "2026-02-28 03:25:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "New Era and adidas Expand NCAA Partnership, Providing On-Field Caps for More Baseball Programs in 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>New Era and adidas are building on their successful NCAA baseball partnership and will now equip all adidas partner schools in the Power Four conferences with premium New Era on-field caps. This now-expanded collaboration brings together two leading performance brands to meet the headwear needs of 10 of the nation's leading baseball programs. Initially launched in Spring 2025 with the Texas A&amp;M Aggies, Miami Hurricanes, and Arizona State Sun Devils, the partnership grows this season to also include the following programs: University of Louisville Cardinals, NC State University Wolfpack, University of Kansas Jayhawks, Texas Tech University Red Oakland, Indiana University Hoosiers, University of Nebraska-Lincoln Cornhuskers, Mississippi State University Bulldogs. As the on-field cap for each of these NCAA baseball teams, New Era will produce headwear for both athletes and fans, crafting designs in collaboration with adidas.</p><p>The players first took the field wearing their New Era caps on February 13. Each athlete will have the option to wear either the 59FIFTY or the Low-Profile 59FIFTY on field, while fans can show their team pride with a range of options, including the on-field caps, 9SEVENTY Stretch-Snap, 39THIRTY M-Crown, 9FORTY M-Crown, and 9TWENTY. Each cap is made in the official colorways of the teams, featuring each team's logo on the front of the crown.</p><!-- Article --><p>All on-field caps are complete with the New Era flag and team-specified design elements. The headwear available will feature both the New Era flag and adidas' three stripes.</p></div>",
            "link": "https://hk.marketscreener.com/news/new-era-and-adidas-expand-ncaa-partnership-providing-on-field-caps-for-more-baseball-programs-in-20-ce7e5cdfdc8ff221",
            "pub_date": "2026-02-28 03:25:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Uber's Autonomous Vehicle API Strengthens Moat Beyond Partnerships, RBC Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uber-s-autonomous-vehicle-api-strengthens-moat-beyond-partnerships-rbc-says-ce7e5cdfdc8ff225",
            "pub_date": "2026-02-28 03:25:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Employment Report and Retail Sales on the Docket -- Data Week Ahead",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  The following are median forecasts for next week's U.S. data from a survey compiled by The Wall Street Journal. </p><pre style=\"font-size:14px\">\n\n \nDATE      TIME  RELEASE                       PERIOD     CONSENSUS    PREVIOUS \nMonday    0945  S&amp;P Global U.S. Mfg PMI        Feb        NA           51.2* \n          1000  ISM Mfg PMI                    Feb        52.0   (11)  52.6 \nWednesday 0815  ADP Jobs                       Feb       +50K    (5)   +22K \n          0945  S&amp;P Global U.S. Svcs PMI       Feb        NA           52.3* \n          1000  ISM Non-Mfg PMI                Feb        53.5   (9)   53.8 \nThursday  0830  Jobless Claims                 Feb 28     215K   (8)   212K \n          0830  Import Prices                  Jan       +0.4%   (4)  +0.1% \n          0830  Productivity (Prelim)          4Q        +1.8%   (10) +4.9%** \n          0830  Unit Labor Costs (Prelim)      4Q        +2.0%   (9)  -1.9%** \nFriday    0830  Nonfarm Payrolls               Feb       +54K    (12) +130K \n          0830  Unemployment Rate              Feb        4.3%   (12)  4.3% \n          0830  Avg. Hourly Wages M/M***       Feb       +0.3%   (11) +0.41% \n          0830  Avg. Hourly Wages Y/Y***       Feb       +3.7%   (4)  +3.71% \n          0830  Retail Sales                   Jan       -0.4%   (10) +0.0% \n          0830    -- ex autos                  Jan       -0.1%   (9)  +0.0% \n          1000  Business Inventories           Dec       +0.1%   (3)  +0.1% \n          1500  Consumer Credit                Jan      +$10.0B  (5) +$24.0B \n \n*Feb Flash Reading \n**3Q Final Reading \n***All private-sector workers \n \n \n(Figures in parentheses refer to number of economists surveyed.) \n \nWrite to Donna Huneke at dataweekahead@wsj.com </pre><p>\n\n  (END) Dow Jones Newswires</p><!-- Article --><p>\n\n  02-27-26 1414ET</p></div>",
            "link": "https://hk.marketscreener.com/news/employment-report-and-retail-sales-on-the-docket-data-week-ahead-ce7e5cdfdc8ff521",
            "pub_date": "2026-02-28 03:16:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JPMorgan, Barclays, Fifth Third Sued by Tricolor Note Holders",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jpmorgan-barclays-fifth-third-sued-by-tricolor-note-holders-ce7e5cdfdc8ff620",
            "pub_date": "2026-02-28 03:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equity Markets Fall Intraday After Producer Prices Report; Oil Rises",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/equity-markets-fall-intraday-after-producer-prices-report-oil-rises-ce7e5cdfdc8ff722",
            "pub_date": "2026-02-28 03:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CANADA ECONOMICS FEATURE: CIBC's Avery Shenfeld Asks, Is the BoC Standing On Guard For Thee?",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/canada-economics-feature-cibc-s-avery-shenfeld-asks-is-the-boc-standing-on-guard-for-thee-ce7e5cdfdc8ff721",
            "pub_date": "2026-02-28 03:16:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE March raw sugar delivery seen at 808,000 tons, say traders",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ice-march-raw-sugar-delivery-seen-at-808-000-tons-say-traders-ce7e5cdfdc8ff726",
            "pub_date": "2026-02-28 03:11:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold Rises to a Month High as U.S. Wholesale Prices Rose Above Expectations in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-rises-to-a-month-high-as-u-s-wholesale-prices-rose-above-expectations-in-january-ce7e5cdfdc8cf023",
            "pub_date": "2026-02-28 03:11:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell's Outlook 'Unexpectedly Strong,' BofA Says as Memory Shortage Lingers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-s-outlook-unexpectedly-strong-bofa-says-as-memory-shortage-lingers-ce7e5cdfdc8cf125",
            "pub_date": "2026-02-28 03:06:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Brookfield's new AI unit Radiant valued at $1.3 billion after merger with UK startup, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/brookfield-s-new-ai-unit-radiant-valued-at-1-3-billion-after-merger-with-uk-startup-ori-sources-sa-ce7e5cdfdc8cf222",
            "pub_date": "2026-02-28 03:06:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dorsey's blunt AI warning sharpens debate over jobs and profits",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Jack Dorsey is not the first chief executive to say artificial intelligence will transform work. He may be among the first to act as if it already has - and to say so openly.</p><p>\n              \"Intelligence tools have changed what it means to build and run a company. We're already seeing it internally. A significantly smaller team using the tools can do more and do it better,\" Block CEO and co-founder said in a statement on Thursday.</p><!-- Article --><p>\n              \"I don't think we're early to this realization. I think most companies are late,\" he added as he laid out plans to cut over 4,000 jobs, nearly half the company's workforce, as part of an overhaul to embed AI across the fintech's operations.</p><p>\n              Block shares rose sharply on Friday, underscoring how markets are increasingly rewarding companies that present AI not as an experiment but as a driver of structural change.</p><p>\n              Dorsey also delivered a blunt warning to peers: most companies are behind the AI curve and will reach the same conclusion within a year.</p><p>\n              \"I'd rather get there honestly and on our own terms than be forced into it reactively.\"</p><p>\n              Until now, most executives have resisted those kinds of sweeping conclusions even as their firms pour billions into the technology.</p><p>\n              The comments are likely to sharpen a growing debate among executives, economists, investors and policymakers: is AI primarily a tool that helps workers do more - or one that enables companies to do the same with far fewer people?</p><p><b>AI JOB CUTS ACCELERATE</b></p><p>\n              AI-linked layoffs have been rising worldwide.</p><p>\n              According to a Reuters tally, companies have announced more than 61,000 job cuts tied to AI, including Amazon, Pinterest and Australia's Wisetech since November.</p><p>\n              But Block is among the highest-profile companies to cite AI explicitly as the primary driver of its reductions, rather than a secondary efficiency gain.</p><p>\n              Some investors argue that automation-related cuts are partly correcting for years of overhiring.</p><p>\n              \"AI is the new scapegoat,\" said Brian Jacobsen, chief economic strategist at Annex Wealth Management, on Friday.</p><p>\n              Still, markets are increasingly uneasy about AI's potential to upend jobs and profits amid an uncertain global economic backdrop.</p><p>\n              A widely circulated report this week by Citrini Research outlined a 2028 scenario in which unemployment rises to 10.2%, driven by rapid displacement of workers in software, logistics and delivery roles.</p><p><b>BUSINESSES HAVE BEEN MORE GUARDED</b></p><p>\n              Evidence is emerging that firms are beginning to see returns on their investment.</p><p>\n              Morgan Stanley analysts said this week there has been a steady rise in the number of companies reporting quantifiable benefits from AI adoption, based on an analysis of more than 10,000 earnings calls and fourth-quarter conference transcripts.</p><p>\n              Some 21% of S&amp;P 500 companies mentioned at least one measurable benefit, up from 15% in the third quarter and 10% in the final quarter of 2024. Greater AI use will boost companies' profit margins by 40 basis points this year, they estimate.</p><p>\n              But until now, most executives and policymakers have been more guarded than Dorsey when talking about AI and jobs.</p><p>\n              \"What we are seeing for the moment is that it's increasing productivity,\" ECB President Christine Lagarde told a committee of the European Parliament on Thursday. </p><p>\n              \"But we are not yet seeing consequences in terms of labour market and waves of redundancies that are feared, and that you know we will be extremely attentive going forward.\"</p><p>\n              At the World Economic Forum last month, JPMorgan Chase CEO Jamie Dimon said jobs would disappear but new ones would emerge. </p><p>\n              On Friday, Bank of America global economists Claudio Irigoyen and Antonio Gabriel said AI could ultimately affect a quarter of all jobs.</p><p>\n              AI shock, they said, will be disruptive for companies that do not survive and for workers who are displaced, but the economy will be better off because it will create new jobs and business opportunities that were previously prohibitive.</p><p>\n              Michael Ashley Schulman, partner and CIO at Running Point Capital Advisors, warned of unintended consequences from drastic steps like Block's.</p><p>\n              \"Dorsey's strategy suggests that less is more and that human capital has lost its competitive edge,\" he said.</p><p>\n              \"The question is whether the company is resetting to its smaller, nimbler startup days or whether it might lose the creativity and human intuition that built its most iconic products in the first place.\"    </p><p></p><p> (Reporting by Utkarsh Shetti and Manya Saini in Bengaluru, Romolo Tosiani and Philippe Leroy Beaulieu in Gdansk and Francesco Canepa in Frankfurt;Writing by Josephine MasonEditing by Louise Heavens)</p><p>\n            By Utkarsh Shetti, Manya Saini and Romolo Tosiani</p></div>",
            "link": "https://hk.marketscreener.com/news/dorsey-s-blunt-ai-warning-sharpens-debate-over-jobs-and-profits-ce7e5cdfdc8cf424",
            "pub_date": "2026-02-28 03:00:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UPDATE 11-Oil prices up about 2% as US and Iran extend talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/update-11-oil-prices-up-about-2-as-us-and-iran-extend-talks-ce7e5cdfdc8cf52d",
            "pub_date": "2026-02-28 03:00:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UniCredit says it has dropped EU court case against ECB over Russia",
            "description": "<div class=\"txt-s4 article-text\"><p>MILAN, Feb 27 (Reuters) - Italy's UniCredit in January withdrew an appeal lodged with the European Union General Court against a European Central Bank request that it exit Russia, a document published on Friday showed.</p><p>\n              The ECB formally warned UniCredit about Russia-related risks in April 2023, following up a year later with demands it cuts its activities in the sanctions-hit country. UniCredit sought a suspension of the ECB's order which the EU court rejected in November 2024.</p><!-- Article --><p>\n              Since then, UniCredit has been shrinking its Russia presence, facing pressure also from Italy's government.</p><p>\n              UniCredit ran a top-15 Russian bank when Moscow invaded Ukraine in February 2022. CEO Andrea Orcel has refused to exit the country at a loss. </p><p>\n              In its 2025 financial report, UniCredit said that continued interaction with the ECB had led the bank to reduce its Russian operations so as to meet the supervisor's demands.</p><p>\n              \"As a consequence, on January 30 UniCredit filed a notice with the European Union General Court withdrawing its appeal,\" it said. </p><p>\n              UniCredit last year halved the loans extended by its Russian unit to 600 million euros, but net profit rose to 814 million euros from 577 million in 2024. </p><p><b>ONGOING LAWSUIT</b></p><p>\n              UniCredit also said in the report that it filed in January its latest appeal in a long-running lawsuit involving its Russian unit. </p><p>\n              In 2023 a Russian energy firm sued UniCredit's local unit in a St. Petersburg court over guarantee claims totalling 444 million euros ($525 million).</p><p>\n              After issuing part of a guarantee package in favour of the Russian company on behalf of a German client, UniCredit failed to meet the Russian firm's payment claims due to sanctions.</p><p>\n              The Italian group's Russian unit AO UniCredit Bank lost in court against the energy firm in June 2024. Further appeals by both the group and AO Bank were rejected in February and August 2025, the latest document showed.</p><p>\n              UniCredit and its Russia unit lodged an appeal with the Supreme Court that was rejected in January this year. It immediately filed a complaint with the Supreme Court's section in charge of economic disputes, it said.</p><p>\n              ($1 = 0.8458 euros)</p><p></p><p>(Reporting by Valentina Za; Editing by Hugh Lawson)</p><p>\n            By Valentina Za</p></div>",
            "link": "https://hk.marketscreener.com/news/unicredit-says-it-has-dropped-eu-court-case-against-ecb-over-russia-ce7e5cdfdc8cf626",
            "pub_date": "2026-02-28 03:00:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cargo Traffic to Los Angeles Port Expected to Fall in Week Ending March 14",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cargo-traffic-to-los-angeles-port-expected-to-fall-in-week-ending-march-14-ce7e5cdfdc8cf726",
            "pub_date": "2026-02-28 02:51:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tariffs Influenced Novartis to Build Over 7 Plants in US, Trump Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tariffs-influenced-novartis-to-build-over-7-plants-in-us-trump-says-ce7e5cdfdc8dfe23",
            "pub_date": "2026-02-28 02:51:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC On The Week Ahead In Canada Economics",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-on-the-week-ahead-in-canada-economics-ce7e5cdfdc8dfe27",
            "pub_date": "2026-02-28 02:51:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global sugar output cut by 2.3 million tons due to India, report says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/global-sugar-output-cut-by-2-3-million-tons-due-to-india-report-says-ce7e5cdfdc8dff23",
            "pub_date": "2026-02-28 02:46:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Treasury official to discuss ways to deepen cooperation with Switzerland to tackle illicit finance threats-spokesperson",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-treasury-official-to-discuss-ways-to-deepen-cooperation-with-switzerland-to-tackle-illicit-fina-ce7e5cdfdc8dff27",
            "pub_date": "2026-02-28 02:46:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tariffs Influenced Novartis to Build Over 7 Plants in US, Trump Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tariffs-influenced-novartis-to-build-over-7-plants-in-us-trump-says-ce7e5cdfdc8dff25",
            "pub_date": "2026-02-28 02:46:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US charges 30 additional people who took part in Minnesota ICE protest at church, Bondi says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-charges-30-additional-people-who-took-part-in-minnesota-ice-protest-at-church-bondi-says-ce7e5cdfdc8df022",
            "pub_date": "2026-02-28 02:46:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Treasury to send senior official to Switzerland March 2-3 to meet with Swiss government and private sector officials on priorities for sanctions and countering illicit finance -Treasury spokesperson",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-treasury-to-send-senior-official-to-switzerland-march-2-3-to-meet-with-swiss-government-and-pri-ce7e5cdfdc8df020",
            "pub_date": "2026-02-28 02:46:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall-ce7e5cdfdc8df22c",
            "pub_date": "2026-02-28 02:46:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says of Iran: Sometimes you have to use force",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-says-of-iran-sometimes-you-have-to-use-force-ce7e5cdfdc88f52c",
            "pub_date": "2026-02-28 02:41:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ag Bondi: DOJ Unsealed Indictment Charging 30 More People Who Took Part in the \"Attack on Cities Church in Minnesota\"",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ag-bondi-doj-unsealed-indictment-charging-30-more-people-who-took-part-in-the-attack-on-cities-chu-ce7e5cdfdc8df520",
            "pub_date": "2026-02-28 02:35:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cheniere gets $370 million 'alternative fuel' tax break from Trump's IRS",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cheniere-gets-370-million-alternative-fuel-tax-break-from-trump-s-irs-ce7e5cdfdc8df72c",
            "pub_date": "2026-02-28 02:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}