{
    "data": [
        {
            "title": "Broadcom expects to sell 1 million 3D stacked chips by 2027",
            "description": "<div class=\"txt-s4 article-text\"><p>SAN JOSE, California, Feb 26 (Reuters) - Artificial intelligence chip designer Broadcom said that it expects to sell at least 1 million chips by 2027 based on its stacked design tech, an executive told Reuters on Wednesday.</p><p>\n              The forecast, which Reuters is the first to report, marks a new product and sales target for Broadcom that could represent a revenue stream potentially worth billions of dollars.</p><!-- Article --><p>\n              Harish Bharadwaj, vice president of product marketing, said the 1 million chips the company projects it will sell are based on an approach Broadcom developed that stacks two chips on top of one another, allowing the distinct pieces of silicon to be tightly bound to improve the speed at which data can flow from one chip to another.</p><p>\n              The company has refined the technology over five years to the point where its first customer, Fujitsu, is making engineering samples to test the design. Fujitsu plans to produce the stacked, or 3D, chips later this year. </p><p>\n              The million-chip figure includes several additional designs beyond the Fujitsu chip.</p><p>\n              The company's stacking approach gives its customers the ability to build chips that have more horsepower and use less energy to tackle the rapidly growing computing requirements AI software presents, Bharadwaj said. </p><p>\n              \"Now, pretty much all of our customers are adopting this technology,\" he said.</p><p>\n              Broadcom does not typically design entire AI chips itself. It works with companies such as Google for its tensor processing units (TPUs) and ChatGPT maker OpenAI for its in-house custom processors. The Broadcom engineers help translate an early design into the physical layout of a chip that can be fabricated by manufacturers such as TSMC.</p><p>\n              The company's chip business has grown significantly because of the custom deals with companies such as Google. Broadcom projected that its AI chip revenue would double year-over-year to $8.2 billion in its first fiscal quarter. </p><p>\n              As a result, Broadcom has emerged as one of the most significant competitors to Nvidia and Advanced Micro Devices, as it races to produce silicon that competes with the chip giants.</p><p>\n              Fujitsu is using the new tech for a data center chip. Taiwan Semiconductor Manufacturing Co is fabricating the chip using its cutting-edge 2-nanometer process and fusing it with a 5-nanometer chip.</p><p>\n              Companies can mix and match which manufacturing process TSMC uses with the Broadcom technology. TSMC fuses the top and bottom chip during the fabrication process. </p><p>\n              Broadcom has several more designs in the works and expects to ship two more products based on the stacking tech in the second half of this year and to sample an additional three in 2027.</p><p>\n              The company spent roughly five years developing the groundwork for the stacked chip tech and testing various designs to come up with a commercial product. Engineers are working to make chips that have as many as eight stacks of two chips each.</p><p></p><p> (Reporting by Max A. Cherney in San Jose; Editing by Lisa Shumaker)</p><p>\n            By Max A. Cherney</p></div>",
            "link": "https://hk.marketscreener.com/news/broadcom-expects-to-sell-1-million-3d-stacked-chips-by-2027-ce7e5cd9db81f02c",
            "pub_date": "2026-02-26 22:10:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "(SRE) Sempra Expects 2026 Adjusted EPS Range $4.80 to $5.30, vs. FactSet Est of $5.11",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sre-sempra-expects-2026-adjusted-eps-range-4-80-to-5-30-vs-factset-est-of-5-11-ce7e5cd9db81f52c",
            "pub_date": "2026-02-26 22:10:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's Rolls-Royce lifts returns as profit soars",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-s-rolls-royce-lifts-returns-as-profit-soars-ce7e5cd9db81f622",
            "pub_date": "2026-02-26 22:10:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (SRE) Sempra Posts Q4 Total Revenue $3.75B, vs. FactSet Est of $4.05B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-sre-sempra-posts-q4-total-revenue-3-75b-vs-factset-est-of-4-05b-ce7e5cd9db81f625",
            "pub_date": "2026-02-26 22:10:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Futures Little Changed as Investors Analyze Earnings Ahead of Key Employment Data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-futures-little-changed-as-investors-analyze-earnings-ahead-of-key-employment-data-ce7e5cd9db81f722",
            "pub_date": "2026-02-26 22:10:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (SRE) Sempra Posts Q4 Adjusted EPS $1.28, vs. FactSet Est of $1.24",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-sre-sempra-posts-q4-adjusted-eps-1-28-vs-factset-est-of-1-24-ce7e5cd9db8efe24",
            "pub_date": "2026-02-26 22:05:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "GSK says Linerixibat accepted for Priority Review in China",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gsk-says-linerixibat-accepted-for-priority-review-in-china-ce7e5cd9db8ef02d",
            "pub_date": "2026-02-26 22:05:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Broadcom expects to sell at least 1 million 3D stacked chips by 2027, executive says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/broadcom-expects-to-sell-at-least-1-million-3d-stacked-chips-by-2027-executive-says-ce7e5cd9db8ef22d",
            "pub_date": "2026-02-26 22:05:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dubai Aerospace Enterprise Ltd agreed to acquire Macquarie AirFinance Ltd. for an enterprise value of $7 billion.",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Dubai Aerospace Enterprise (DAE) Ltd agreed to acquire Macquarie AirFinance Ltd. for an enterprise value of $7 billion on February 26, 2026. A cash consideration will be paid by Dubai Aerospace Enterprise (DAE) Ltd. The transaction will be prudently funded with a combination of debt and equity to support our current investment grade credit ratings and our objective of being upgraded following the doubling of the franchise over the last 18 months.<br/><br/>\r\n\r\nThe transaction is subject to approval by regulatory board / committee. The deal has been approved by the board of directors of Dubai Aerospace Enterprise (DAE) Ltd. The expected completion of the transaction is second half of 2026.<br/><br/>\r\n\r\nAllen Overy Shearman Sterling LLP acted as legal advisor for Dubai Aerospace Enterprise Ltd. J.P. Morgan Securities LLC acted as financial advisor for Macquarie AirFinance Ltd. Macquarie Capital Limited acted as financial advisor for Macquarie AirFinance Ltd.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/dubai-aerospace-enterprise-ltd-agreed-to-acquire-macquarie-airfinance-ltd-for-an-enterprise-value-o-ce7e5cd9db8ef22c",
            "pub_date": "2026-02-26 22:05:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russian Foreign Ministry: EU proposal for a permanent ban on Russian oil imports is madness",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russian-foreign-ministry-eu-proposal-for-a-permanent-ban-on-russian-oil-imports-is-madness-ce7e5cd9db8ef222",
            "pub_date": "2026-02-26 22:05:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Jobless Claims Rose Last Week",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Jessica Coacci </p><p>\n\n  U.S. jobless claims rose last week but still showed no alarming signs for layoffs. </p><!-- Article --><p>\n\n  The number of people who filed for unemployment benefits rose to 212,000 in the week through Feb. 21, up from 208,000 a week earlier, the Labor Department said Thursday. Economists surveyed by The Wall Street Journal were expecting to see 215,000 new claims. </p><p>\n\n  Continuing claims, which scale with the total size of the unemployed population, fell to 1.83 million in the week through Feb. 14, from 1.86 million a week earlier. The data on continuing claims lag the initial-claims data by a week.</p><p>\n\n  A recent consumer confidence survey from The Conference Board Tuesday showed perceptions of employment conditions improving slightly. The labor market differential, which measures the share of consumers saying jobs are \"plentiful\" minus the share saying jobs are \"hard to get\" ticked up from the last reading. Economists watch this labor-market differential to gauge how tight labor conditions are for households. </p><p>\n\n  Write to Jessica Coacci at jessica.coacci@wsj.com </p><p>\n\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0858ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-jobless-claims-rose-last-week-ce7e5cd9db8ef723",
            "pub_date": "2026-02-26 22:05:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros posts 6% fall in quarterly revenue, deal talks in focus",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Warner Bros Discovery, at the center of a high-stakes bidding war, reported a 6% drop in quarterly revenue, hurt by declines for its traditional TV and film businesses though its HBO Max streaming service gained subscribers with buzzy series like \"Heated Rivalry\".</p><p>\n              The company in its earnings statement on Thursday did not address its discussions with Paramount Skydance , whose latest offer threatens to upend an existing deal with Netflix. Paramount enticed Warner Bros' board back to the bargaining table last week by raising the possibility of an improved cash offer.</p><!-- Article --><p>\n              Warner Bros' overall revenue came in at nearly $9.5 billion, in line with an LSEG consensus estimate.</p><p>\n              On the bright side, HBO Max continued to grow, helped by series like \"Heated Rivalry\" and \"It: Welcome to Derry\". </p><p>\n              Warner Bros added 3.5 million streaming subscribers in the quarter, bringing its total number worldwide to 131.6 million.</p><p>\n              The streaming group's revenue rose 5% to nearly $2.8 billion, but adjusted earnings fell 4% to $393 million due to the end of an unspecified distribution deal.</p><p>\n              Warner Bros' traditional businesses, however, were hurting, with adjusted income for its film and TV studio group tumbling 23% to $728 million.</p><p>\n              The film studio, which released nine movies that opened at the top of the box office in 2025, had no major theatrical releases in the holiday quarter. The television studio, meanwhile, was hit by the timing of content renewals with its revenue sliding 18%.</p><p>\n              Warner Bros' television network group, Discovery Linear Networks, saw a continued erosion of its business amid an industry-wide loss of pay TV subscribers.</p><p>\n              The television unit's revenue fell to $4.2 billion, down 12% from a year earlier, and adjusted income dropped to $1.4 billion, a 27% plunge from the same quarter a year earlier.</p><p>\n              Investor attention is likely to be focused on any clues that may be gained about the deal discussions.</p><p>\n              Warner Bros' board has said it has not determined whether the revised Paramount proposal is superior to the merger with Netflix, but that directors will engage further. Should a superior deal emerge, Netflix has four business days to revise its offer.</p><p></p><p> (Reporting by Dawn Chmielewski in Los Angeles and Harshita Mary Varghese in Bengaluru; Editing by Edwina Gibbs)</p></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-posts-6-fall-in-quarterly-revenue-deal-talks-in-focus-ce7e5cd9db8ffe20",
            "pub_date": "2026-02-26 22:05:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMCOR Q4 Non-GAAP Earnings, Revenue Increase; 2026 Guidance Issued",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/emcor-q4-non-gaap-earnings-revenue-increase-2026-guidance-issued-ce7e5cd9db8ffe25",
            "pub_date": "2026-02-26 22:05:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jbic governor Hayashi: believe 3 investment projects under US package are bankable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jbic-governor-hayashi-believe-3-investment-projects-under-us-package-are-bankable-ce7e5cd9db8fff2d",
            "pub_date": "2026-02-26 22:05:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chang Hwa Commercial Bank, Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Chang Hwa Commercial Bank, Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported net interest income was TWD 27,106.35 million compared to TWD 22,964.58 million a year ago. Net income was TWD 17,774.87 million compared to TWD 14,945.37 million a year ago.</p><p>Basic earnings per share from continuing operations was TWD 1.51 compared to TWD 1.27 a year ago. Diluted earnings per share from continuing operations was TWD 1.5 compared to TWD 1.26 a year ago. Basic earnings per share was TWD 1.51 compared to TWD 1.27 a year ago.</p><!-- Article --><p>Diluted earnings per share was TWD 1.5 compared to TWD 1.26 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/chang-hwa-commercial-bank-ltd-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9db8fff23",
            "pub_date": "2026-02-26 22:05:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Schneider beats profit expectations as data center demand offsets weak dollar",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/schneider-beats-profit-expectations-as-data-center-demand-offsets-weak-dollar-ce7e5cd9db8fff25",
            "pub_date": "2026-02-26 22:05:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LSEG plans $4.1 billion buyback amid investor pressure",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: London Stock Exchange Group said on Thursday it would buy back a further $4.1 billion of shares over the next year.</p><p>\n              It's under pressure from activist investor Elliott Management and worries AI could squeeze its business.</p><!-- Article --><p>\n              LSEG executives said the buyback was not a response to New York-based Elliott, which has recently emerged as a shareholder. </p><p>\n              A source told Reuters it is pressing CEO David Schwimmer to review LSEG's portfolio, lift margins that trail rivals, and better communicate its resilience to AI threats.</p><p>\n              Shares in LSEG rose more than 6% by mid-morning trade.</p><p>\n              Analysts welcomed the buyback, new guidance for 2027 to 2029.</p><p>\n              And slightly better-than-expected forecasts for this year.</p><p>\n              LSEG shares had lost around 30% of their value in the past year.</p><p>\n              As the data and exchanges group was dragged into concerns that AI will hit its business and those of its peers.</p><p>\n              Schwimmer has dismissed the risk that AI models will replace its data business.</p><p>\n              It has already struck deals with OpenAI and Anthropic that allow their users to access and interrogate its data.</p></div>",
            "link": "https://hk.marketscreener.com/news/lseg-plans-4-billion-buyback-amid-investor-pressure-ce7e5cd8dc88f12c",
            "pub_date": "2026-02-26 21:56:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-on-the-day-ahead-in-canada-ce7e5cd9db8dfe25",
            "pub_date": "2026-02-26 21:45:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China c.bank: supports domestic banks to carry out yuan cross-border interbank financing business in accordance with principles of legal compliance and risk controllability - statement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-c-bank-supports-domestic-banks-to-carry-out-yuan-cross-border-interbank-financing-business-in-ce7e5cd9db8dff2d",
            "pub_date": "2026-02-26 21:45:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fitch Affirms Engie's Rating Over UK Power Networks Deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fitch-affirms-engie-s-rating-over-uk-power-networks-deal-ce7e5cd9db8df122",
            "pub_date": "2026-02-26 21:45:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "RBC and Canada's other biggest lenders beat profit estimates as economy resists tariff impact",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Canada's six biggest banks all exceeded profit forecasts this week in results boosted by wealth management and fee-based income, underlining the resilience of the country's economy to the impact of U.S. tariffs and broader policy uncertainty.</p><p>\n              On Thursday, Royal Bank of Canada &lt;&gt;, TD Bank &lt;&gt; and CIBC &lt;&gt;  beat analysts' profit estimates, as did BMO Financial and National Bank on Wednesday and Bank of Nova Scotia that delivered their results earlier this week. </p><!-- Article --><p>\n              Prime Minister Mark Carney's diversification of trade ties has helped the economy to perform better than expected in the November-January quarter, in turn giving the banks a boost. </p><p>\n              \"There's still some uncertainty in the market, but what we're seeing is that consumers are continuing to show resilience and they are feeling a little bit better,\" TD's CFO Kelvin Tran told Reuters in an interview. </p><p><b>MARKETS ARE ADJUSTING TO UNCERTAINTIES </b></p><p>\n              Canada's banks have a large U.S. exposure, with some referring to the country as a second home market as it has provided opportunities to expand their retail network and build their capital market business.</p><p>\n              TD is among the banks to have invested heavily in U.S. retail banking, until an anti-money laundering investigation into the bank paused the expansion. It pleaded guilty to violating a federal law in 2024.</p><p>\n              In recent months, tension between the U.S. and Canada has increased, primarily over trade. The United States-Mexico-Canada Agreement, a continental trade pact that has shielded much of Canada's exports from U.S. tariffs, is set for review by a July 1 deadline.</p><p>\n              \"(Those uncertainties) are something that the market is adjusting and adapting to,\" Tran said. </p><p><b>STRONG FEE INCOME OFFSETS UNCERTAINTY</b></p><p>\n              Canadian lenders have relied more on fee-based, higher-margin wealth businesses and expanding their advisory network to capture clients relatively sheltered from weakened business and consumer confidence.</p><p>\n              At RBC, Canada's biggest bank by market capitalisation, higher fees boosted earnings at its advisory unit by 32%.</p><p>\n              The upbeat earnings that have resulted put the banks on track to reach their targets for mid-term return on equity, a profit metric that demonstrates how effectively a bank generates profits from its shareholders' investments. </p><p>\n              RBC's adjusted ROE of 17.8% met its target of 17% or higher. </p><p>\n              Meanwhile, RBC, TD and CIBC all reported growth at domestic retail banking segments of 17%, 12% and 25% respectively, largely benefiting from higher net interest income, or earnings on loans minus deposit costs. </p><p>\n              Net income in RBC's capital markets segment increased 3%, at CIBC it rose 42%. TD Bank's wholesale banking segment recorded a 65% rise in adjusted net income.  </p><p>\n              RBC's earnings of C$4.08 per share surpassed analysts' average estimates of C$3.85, according to LSEG data. TD recorded earnings of C$2.44 per share, beating the estimate of C$2.26. CIBC's EPS of C$2.76 was well above the estimate of C$2.40. </p><p>\n              ($1 = 1.3676 Canadian dollars)</p><p></p><p>(Reporting by Utkarsh Shetti, Ateev Bhandari and Arasu Kannagi Basil in Bengaluru, Nivedita Balu in Toronto; Editing by Shilpi Majumdar and Barbara Lewis)</p><p>\n            By Nivedita Balu and Utkarsh Shetti</p></div>",
            "link": "https://hk.marketscreener.com/news/rbc-and-canada-s-other-biggest-lenders-beat-profit-estimates-as-economy-resists-tariff-impact-ce7e5cd9db8df225",
            "pub_date": "2026-02-26 21:45:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Dollar Rises Early Thursday Ahead of Jobless Claims, Natural Gas Stocks, Kansas City Fed Manufacturing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-dollar-rises-early-thursday-ahead-of-jobless-claims-natural-gas-stocks-kansas-city-fed-manufact-ce7e5cd9db8df327",
            "pub_date": "2026-02-26 21:45:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia eyes higher Urals oil exports to China amid Indian cutbacks, traders say",
            "description": "<div class=\"txt-s4 article-text\"><p>MOSCOW, Feb 26 (Reuters) - Russia will aim to keep its Urals crude oil exports steady in March by boosting shipments to China as India, a key buyer, cuts purchases following a trade deal with the U.S.    </p><p>\n              Export options for seaborne Urals cargoes are set to narrow next month, with India expected to sharply reduce intake. Suppliers are turning to China, the world's top crude importer, as Turkey - the third-largest Urals buyer - lacks the capacity to process more Russian barrels.</p><!-- Article --><p>\n              In the current market, Russia has two main choices: increase discounts or curb production. Both would add pressure to Kremlin budget revenues, one trader said.    </p><p>\n              Market participants anticipate discounts for Urals in China could widen by $2-$5 per barrel from the current $10-$12 on a delivered-to-port basis, with some expecting deeper cuts in the months ahead.</p><p>\n              \"There haven't been any fresh Urals deals in China yet, but traders are preparing for negotiations to start at around minus $15 per barrel on a DES (delivered ex ship) basis,\" a trading source told Reuters.</p><p>\n              Russian oil imports to China could rise for a third consecutive month in February, potentially reaching a record 2.1 million barrels per day as independent refiners take advantage of discounted cargoes following India's reduced buying.</p><p>\n              Even so, some market participants warn that Chinese demand for Russian oil may be nearing its peak. </p><p>\n              \"April could be a critical month for shipments. The Chinese 'teapots' (small refiners) will have bought up supplies, demand may drop, and Russia could be forced to cut production. But the situation remains fluid,\" said a source at a major Western oil company.</p><p>\n              Further discounting may help sustain high import volumes in China over the coming months, sources added.</p><p>\n              India is expected to sharply reduce Urals imports from March, with volumes in April projected to fall to about 400,000 bpd. Nayara refinery will likely be the only remaining importer, market sources said.    </p><p>\n              India's imports of Russian oil fell 12% in January from December, and the downward trend is expected to continue this month. </p><p></p><p> (Reporting by Reuters. Editing by Mark Potter)</p></div>",
            "link": "https://hk.marketscreener.com/news/russia-eyes-higher-urals-oil-exports-to-china-amid-indian-cutbacks-traders-say-ce7e5cd9db8df423",
            "pub_date": "2026-02-26 21:45:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dae to buy Macquarie AirFinance for enterprise value of $7 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dae-to-buy-macquarie-airfinance-for-enterprise-value-of-7-billion-ce7e5cd9db8df723",
            "pub_date": "2026-02-26 21:40:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia shares open firmer in Frankfurt on higher earnings forecast",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-shares-open-firmer-in-frankfurt-on-higher-earnings-forecast-ce7e5cd9db8afe22",
            "pub_date": "2026-02-26 21:40:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EMCOR Group, Inc. Provides Earnings Guidance for Full Year 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>EMCOR Group, Inc. provided earnings guidance for the full year 2026. For the period, the company expects revenues of $17.75 billion ? $18.50 billion, Operating Margin of 9.0% ?</p><p>9.4% and Diluted EPS of $27.25 ? $29.25.</p></div>",
            "link": "https://hk.marketscreener.com/news/emcor-group-inc-provides-earnings-guidance-for-full-year-2026-ce7e5cd9db8aff27",
            "pub_date": "2026-02-26 21:40:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. dollar index little changed after data, last up 0.03% at 97.64",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-dollar-index-little-changed-after-data-last-up-0-03-at-97-64-ce7e5cd9db8af125",
            "pub_date": "2026-02-26 21:40:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Euro up 0.01% at $1.1812",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/euro-up-0-01-at-1-1812-ce7e5cd9db8af223",
            "pub_date": "2026-02-26 21:40:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dollar/yen down 0.19% at 156.03",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dollar-yen-down-0-19-at-156-03-ce7e5cd9db8af224",
            "pub_date": "2026-02-26 21:40:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "A peculiar behavior that's worth calling out",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/a-peculiar-behavior-that-s-worth-calling-out-ce7e5cd9db8af52d",
            "pub_date": "2026-02-26 21:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Arabian Gulf Steel Industries Secures Green Facility from Emirates NBD",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/arabian-gulf-steel-industries-secures-green-facility-from-emirates-nbd-ce7e5cd9db8bfe2d",
            "pub_date": "2026-02-26 21:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (LNG) Cheniere Energy Posts Q4 Total Revenue $5.45B, vs. FactSet Est of $5.63B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-lng-cheniere-energy-posts-q4-total-revenue-5-45b-vs-factset-est-of-5-63b-ce7e5cd9db8bf124",
            "pub_date": "2026-02-26 21:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (LNG) Cheniere Energy Posts Q4 EPS $10.68",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-lng-cheniere-energy-posts-q4-eps-10-68-ce7e5cd9db88fe22",
            "pub_date": "2026-02-26 21:35:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DHL, JD.com sign MoU to help German brands enter China",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dhl-jd-com-sign-mou-to-help-german-brands-enter-china-ce7e5cd9db88ff27",
            "pub_date": "2026-02-26 21:35:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Italy's Eni posts 35% adjusted net profit rise on strong upstream business",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/italy-s-eni-posts-35-adjusted-net-profit-rise-on-strong-upstream-business-ce7e5cd9db88ff26",
            "pub_date": "2026-02-26 21:35:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EBay is laying off about 800 workers, 6% of global workforce - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ebay-is-laying-off-about-800-workers-6-of-global-workforce-bloomberg-news-ce7e5cd9db88f02d",
            "pub_date": "2026-02-26 21:36:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell Reportedly Mulls Offloading Some Shell Ventures Investments",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shell-reportedly-mulls-offloading-some-shell-ventures-investments-ce7e5cd9db88f021",
            "pub_date": "2026-02-26 21:36:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (EME) EMCOR Group, Inc. Reports Q4 Revenue $4.51B, vs. FactSet Est of $4.28B",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-eme-emcor-group-inc-reports-q4-revenue-4-51b-vs-factset-est-of-4-28b-ce7e5cd9db88f120",
            "pub_date": "2026-02-26 21:36:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Earnings Flash (EME) EMCOR Group, Inc. Posts Q4 Adjusted EPS $7.19 per Share, vs. FactSet Est of $6.68",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/earnings-flash-eme-emcor-group-inc-posts-q4-adjusted-eps-7-19-per-share-vs-factset-est-of-6-ce7e5cd9db88f22d",
            "pub_date": "2026-02-26 21:36:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Norway's wealth fund using AI to screen for ESG risks",
            "description": "<div class=\"txt-s4 article-text\"><p>OSLO, Feb 26 (Reuters) - Norway's $2.2 trillion sovereign wealth fund, the world's largest, is using AI to screen companies for risks such as potential links to forced labour and corruption, and help avoid financial losses as a result, it said on Thursday.</p><p>\n              One of the world's largest investors, the fund holds stakes in around 7,200 companies globally, owning about 1.5% of all listed stocks. It has often set the pace on environmental, social and governance issues. </p><!-- Article --><p>\n              The fund's investments are measured against a benchmark index set by the finance ministry, with equities tracked against the FTSE Global All Cap index.</p><p>\n              Each time that index includes new companies, the fund's operator, Norges Bank Investment Management (NBIM), must screen them before they enter the portfolio.</p><p>\n              Since 2025, NBIM has used large language models to screen all companies on the day they enter the equity portfolio, rapidly scanning for public information that data vendors typically do not provide.</p><p>\n              \"Within 24 hours of our investment, the AI tools flag new companies in the fund's equity portfolio with potential links to, for example, forced labour, corruption or fraud,\" NBIM said in its annual responsible investment report, published on Thursday.</p><p>\n              \"In multiple instances, we identified and sold these investments before the broader market reacted to the risks, avoiding potential losses.\"</p><p>\n              AI is especially useful for researching smaller companies in emerging markets, NBIM said, noting that data vendors often offer limited coverage and international media may not report on them.</p><p>\n              \"News may be limited to small media outlets in local languages, and controversies suggesting systemic failures in risk management may go unreported in international media,\" it said. </p><p></p><p> (Reporting by Gwladys Fouche in Oslo. Editing by Mark Potter)</p></div>",
            "link": "https://hk.marketscreener.com/news/norway-s-wealth-fund-using-ai-to-screen-for-esg-risks-ce7e5cd9db88f320",
            "pub_date": "2026-02-26 21:36:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}