{
    "data": [
        {
            "title": "CK Hutchison's subsidiary decries Panama's \"invasion\" of property",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ck-hutchison-s-subsidiary-decries-panama-s-invasion-of-property-ce7e5cdfdd8ef523",
            "pub_date": "2026-02-28 01:16:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada's Economy Contracts in Fourth Quarter, Capping a Soft Year -- 2nd Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  OTTAWA--Canada's economy shrank as it closed out 2025, yet still managed to show resilience against the U.S. administration's protectionist shift. </p><!-- Article --><p>\n\n  Gross domestic product declined at an annualized rate of 0.6% in the October-to-December period to 2.502 trillion Canadian dollars, the equivalent of US$1.829 trillion, Statistics Canada said Friday. </p><p>\n\n  The contraction was slightly steeper than the 0.2% economists expected following a recovery in the prior quarter. But the weakness was largely thanks to a big withdrawal from business inventories that offset growth in exports, and increases in both household and government spending. </p><p>\n\n  Industry-level activity strengthened in the final month of the year, though advance data indicates a shaky start to this year and no growth as activity was likely held back by snowstorms and severe cold temperatures. </p><p>\n\n  Canada was broadsided last year by President Trump's tariffs, particularly the country's trade exposed industries and sectors singled out by the White House's sectoral levies on steel, aluminum, lumber and other goods that enter the U.S. in large volumes. </p><p>\n\n  Over 2025, Canadian real GDP grew 1.7%, the slowest pace since a drop in 2020 during the global pandemic, largely due to a decline in exports to the U.S. </p><p>\n\n  Yet data for the final quarter of last year highlights continued strength at home and a recovery in exports, helped by efforts to direct shipments to markets beyond the U.S. </p><p>\n\n  Final domestic demand, a gauge of spending by all sectors of the economy, grew 2.4% on an annualized basis in the fourth quarter after falling 0.5% the previous quarter. Household spending rose 0.4% on a nonannualized basis after weakening slightly in the prior quarter, leaving household consumption for the year up 2.3% and in line with the 2.2% pace in each of the previous two years. </p><p>\n\n  Added to that was a second consecutive quarter of increased government spending and a massive increase in defense spending. Investment by Canadian businesses dipped slightly for the quarter, though there was a sharp increase in spending on machinery and equipment, primarily computers. Overall, capital investment was up in 2025 with the jump in spending on weapons systems and a slight increase in residential construction. </p><p>\n\n  The relatively positive composition of GDP data for the quarter is expected to allow the Bank of Canada to remain on the sidelines after keeping its policy interest rate steady twice in a row, economists said. That is despite the central bank projecting a flat fourth quarter, and the possibility the first quarter of 2026 will undershoot the 1.8% growth it most recently forecast. </p><p>\n\n  Dominique Lapointe, director of macroeconomic strategy at Manulife Investment Management, said that while the fourth quarter surprised to the downside there was a revision to the contraction seen in the second quarter to just 0.9% annualized from a prior estimate of 1.8%. \"From the Bank of Canada's perspective, this leaves the output gap largely unchanged, albeit negative, and doesn't open the door to additional rate cuts,\" he said. </p><p>\n\n  The biggest drag on GDP came from the drawdown in inventories, </p><p>\n\n  an often volatile metric, after businesses boosted stocks the previous two quarters. For the year, non-farm inventories fell for the first year since 2020, even as farm stocks rose for the first time in three years with strong crop production. </p><p>\n\n  The country's exports, meanwhile, were up 1.5% for the final quarter, driven by shipments of unwrought gold and of aluminum. Yet despite the recovery in the second half of 2025, exports for 2025 were down 1.7% as trade with the U.S. failed to fully recover. Imports nudged up 0.3% in the final quarter, but were down 0.4% for the year after a steep decline in the third quarter. </p><p>\n\n  Prime Minister Mark Carney, elected last April as a counter to President Trump, has pledged to strengthen the resilience of Canada's economy and decouple it from a dependence on its biggest trading partner. The push includes efforts by the former central banker to bring financial relief to sectors hit hardest by tariffs while pushing for a doubling of non-U.S. exports over the next decade. There are indications these efforts are bearing fruit: the U.S. has gone from being the destination for roughly 70% of Canadian exports to about 64% at the latest count. </p><p>\n\n  Economists expect soft momentum in 2026 and the central bank has forecast growth will average about 1.1% for the year. A new federal groceries and essentials benefit is expected to offer a boost at mid-year with other fiscal measures, and the recovery in exports should support stronger growth in the second half, though that hinges on trade talks between with the U.S., said Michael Davenport, senior Canada economist at Oxford Economics. </p><p>\n\n  The national data agency said industry-level GDP in December was up 0.2% from the month before, the strongest growth since September as manufacturing increased after contracting two months running. Still, the advance estimate indicates GDP was essentially unchanged in January, as increases in mining, oil and gas extraction, and finance and insurance, were offset by renewed weakness in manufacturing and real estate weakness. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1211ET</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-s-economy-contracts-in-fourth-quarter-capping-a-soft-year-2nd-update-ce7e5cdfdd8ef525",
            "pub_date": "2026-02-28 01:16:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Corning Gets Strong Read Through From Nvidia Results, UBS Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/corning-gets-strong-read-through-from-nvidia-results-ubs-says-ce7e5cdfdd8ef622",
            "pub_date": "2026-02-28 01:16:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Positive Economic Growth Buoys Swiss Market Index",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/positive-economic-growth-buoys-swiss-market-index-ce7e5cdfdd8ef624",
            "pub_date": "2026-02-28 01:16:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 Ends Week in Green; Barclays Shares Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-s-ftse-100-ends-week-in-green-barclays-shares-down-ce7e5cdfdd8ef723",
            "pub_date": "2026-02-28 01:16:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Blue Owl turmoil adds to strain in $2 trillion US private credit sector",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/blue-owl-turmoil-adds-to-strain-in-2-trillion-us-private-credit-sector-ce7e5cdfdd8ffe22",
            "pub_date": "2026-02-28 01:16:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlas SP says it proactively put two warehouses into default last week \"and is pursuing all legal avenues to maximize recoveries\" following a breach of contractual terms by Market Financial Solutions",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/atlas-sp-says-it-proactively-put-two-warehouses-into-default-last-week-and-is-pursuing-all-legal-av-ce7e5cdfdd8ffe27",
            "pub_date": "2026-02-28 01:10:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "The Week in Oil : U.S.-Iran Tensions Keep Risk Premium High",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Giulia Petroni </p><br/><p>\n  Here's a look at what happened in oil markets in the week of Feb. 23-27 and what the focus will be in the days to come. </p><!-- Article --><br/><p>\n  OVERVIEW: Oil prices jumped on Friday, driven by concerns over potential U.S. action against Iran after talks in Geneva ended without a breakthrough. Crude benchmarks are at their highest level in about seven months, with Brent crude above $72 a barrel and West Texas Intermediate at $66 a barrel. </p><br/><p>\n  MACRO: Markets are still betting that the Federal Reserve will lower interest rates further this year, though the pace of potential cuts remains uncertain. </p><p>\n\n  The latest U.S. producer price index data showed that wholesale inflation unexpectedly accelerated in January. The PPI is closely watched because several of its components feed into the calculation of the personal consumption expenditures price index, the Fed's preferred inflation gauge. </p><p>\n\n  At the same time, uncertainty surrounding U.S. tariff policy and the future of existing trade agreements following a recent Supreme Court ruling continues to weigh on market sentiment. </p><br/><p>\n  GEOPOLITICAL RISKS: The U.S. and Iran are set to resume discussions next week after the latest round of talks concluded on Thursday without reaching an agreement. Further negotiations \"at a technical level\" will take place in Vienna, Oman's Foreign Minister Badr bin Hamad al-Busaidi said in a post on X. </p><p>\n\n  Markets remain cautious, however, as any escalation in tensions could threaten energy flows, particularly after Washington increased its military presence in the Middle East. The impact of potential U.S. military action on oil prices would largely depend on whether it disrupts global supply and shipping traffic through the Strait of Hormuz. </p><br/><p>\n  SUPPLY AND DEMAND: The broader outlook remains bearish, as global oil supply is still expected to exceed demand this year. Under normal circumstances, such a surplus would put significant downward pressure on prices. Instead, crude futures have held up, supported by persistent geopolitical tensions that continue to sustain a sizeable risk premium in the market. </p><p>\n\n  At the same time, U.S. crude inventories surged by 16 million barrels last week to 435.8 million barrels--far above expectations and marking the largest weekly increase since February 2023, the EIA said. </p><br/><p>\n  NEXT WEEK: Heightened uncertainty over developments in the Middle East is expected to keep a significant risk premium embedded in oil prices, as markets weigh the possibility of supply disruption. </p><p>\n\n  \"President Trump's deadline for an agreement expires in a week at the latest,\" analysts at Commerzbank said. \"The continuing risk of a U.S. military strike is therefore likely to remain the dominant issue on the oil market, which suggests that oil prices will remain well supported.\" </p><p>\n\n  Traders are also focused on the upcoming OPEC+ meeting on Sunday for guidance on future production policy, with the group now widely expected to resume output increases, beginning with a modest 137,000 barrel-a-day rise. </p><p>\n\n  On the economic front, investors will be watching some remarks from Federal Reserve speakers, manufacturing PMI, ADP employment figures and weekly jobless claims for fresh clues on the strength of the economy and interest-rate outlook. </p><br/><p>\n  Write to Giulia Petroni at giulia.petroni@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1207ET</p></div>",
            "link": "https://hk.marketscreener.com/news/the-week-in-oil-u-s-iran-tensions-keep-risk-premium-high-ce7e5cdfdd8ff127",
            "pub_date": "2026-02-28 01:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India and EU to give each other Most Favoured Nation status for 5 years, draft trade deal shows",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-and-eu-to-give-each-other-most-favoured-nation-status-for-5-years-draft-trade-deal-shows-ce7e5cdfdd8ff322",
            "pub_date": "2026-02-28 01:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re AG announces an Equity Buyback for 1,500,000 shares, for $500 million.",
            "description": "<div class=\"txt-s4 article-text\"><p>Swiss Re AG (SWX:SREN) announces a share repurchase program. Under the program, the company will repurchase up to 1,500,000 shares for $500 million. The program is subject to legal and regulatory approvals.</p><p>The program will be valid till December 31, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-ag-announces-an-equity-buyback-for-1-500-000-shares-for-500-million-ce7e5cdfdd8ff520",
            "pub_date": "2026-02-28 01:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico after call with Ukraine's Zelenskiy: Ukrainian president has refused inspection activity of pipeline",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-after-call-with-ukraine-s-zelenskiy-ukrainian-president-has-refused-inspection-activ-ce7e5cdfdd8ff527",
            "pub_date": "2026-02-28 01:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re AG authorizes a Buyback Plan.",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of Swiss Re AG has authorized a buyback plan on February 27, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-ag-authorizes-a-buyback-plan-ce7e5cdfdd8ff525",
            "pub_date": "2026-02-28 01:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico: I Have Feeling Ukrainian Side Not Interested In Resuming Oil Transit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-i-have-feeling-ukrainian-side-not-interested-in-resuming-oil-transit-ce7e5cdfdd8ff62c",
            "pub_date": "2026-02-28 01:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSI Solar Co., Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>CSI Solar Co., Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 40,255.71 million compared to CNY 46,165.01 million a year ago. Net income was CNY 1,021.26 million compared to CNY 2,247.35 million a year ago.</p><p>Basic earnings per share from continuing operations was CNY 0.28 compared to CNY 0.61 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/csi-solar-co-ltd-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdd8ff621",
            "pub_date": "2026-02-28 01:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Diary - U.S. earnings week ahead",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diary-u-s-earnings-week-ahead-ce7e5cdfdd8cf322",
            "pub_date": "2026-02-28 01:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TREASURIES-Safe-haven demand drives bond rally; 10-year yield slides below 4%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/treasuries-safe-haven-demand-drives-bond-rally-10-year-yield-slides-below-4-ce7e5cdfdd8cf324",
            "pub_date": "2026-02-28 01:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ICE Midday : Canola declines, crude oil surges",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  WINNIPEG, Manitoba -- Canola futures on the Intercontinental Exchange were negative in the middle of Friday trading with the Chicago soy complex pulling back. </p><p>\n\n  Although Chicago soyoil was down slightly, an analyst said any time its value is between 60 to 65 U.S. cents per pound is \"a bonus.\" European rapeseed was mixed and Malaysian palm oil was higher. Crude oil rose by more than US$1 per barrel amid tensions between the U.S. and Iran, as the two countries ended their nuclear talks ahead of the weekend without a deal. </p><!-- Article --><p>\n\n  China announced on Friday it will suspend tariffs on some Canadian goods, including those for Canadian canola meal, beginning March 1. China's duty on Canadian canola will be reduced to 15 per cent as well that day. </p><p>\n\n  The Canadian Grain Commission reported 243,600 tonnes were exported during the week ended Feb. 22, down from the 257,100 shipped the previous week. So far this marketing year, canola exports totalled 4.269 million tonnes, compared to 6.021 million one year ago. </p><p>\n\n  About 33,700 canola contracts have traded at 10:11 CST. Prices in Canadian dollars per metric tonne: </p><pre style=\"font-size:14px\">\n\n \nPrice Change \n \nMay 688.80 dn 4.20 \n \nJul 699.40 dn 4.20 \n \nNov 694.00 dn 3.90 \n \nJan 701.50 dn 3.60 \n </pre><p>\n\n  Source: MarketsFarm (Adam Peleshaty, news@marketsfarm.com, 204-414-9084) </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1200ET</p></div>",
            "link": "https://hk.marketscreener.com/news/ice-midday-canola-declines-crude-oil-surges-ce7e5cdfdd8cf42d",
            "pub_date": "2026-02-28 01:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico after call with Ukraine's Zelenskiy: Ukrainian president conveyed that Druzhba oil pipeline will take time",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-after-call-with-ukraine-s-zelenskiy-ukrainian-president-conveyed-that-druzhba-oil-pi-ce7e5cdfdd8dfe2d",
            "pub_date": "2026-02-28 01:01:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Midday Stories: Netflix Ends Bid for Warner Bros.; Amazon to Invest $50 Billion in OpenAI as Part of New Partnership",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-midday-stories-netflix-ends-bid-for-warner-bros-amazon-to-invest-50-billion-in-openai-as-par-ce7e5cdfdd8dfe2c",
            "pub_date": "2026-02-28 01:01:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Galderma's Nemluvio Shows Long-term Efficacy in Extension Study for Prurigo Nodularis",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/galderma-s-nemluvio-shows-long-term-efficacy-in-extension-study-for-prurigo-nodularis-ce7e5cdfdd8dfe22",
            "pub_date": "2026-02-28 01:01:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave Shares Fall After Q4 Loss Widens, Q1 Revenue Guidance Miss",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-shares-fall-after-q4-loss-widens-q1-revenue-guidance-miss-ce7e5cdfdd8df025",
            "pub_date": "2026-02-28 01:01:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bmw launches fresh recall over potential cable issue",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmw-launches-fresh-recall-over-potential-cable-issue-ce7e5cdfdd8df127",
            "pub_date": "2026-02-28 01:01:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM Fico after call with Ukraine's Zelenskiy: Informed him stop in oil transit is causing logistical difficulties, economic damage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-fico-after-call-with-ukraine-s-zelenskiy-informed-him-stop-in-oil-transit-is-causing-logi-ce7e5cdfdd8df124",
            "pub_date": "2026-02-28 01:01:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Simon Property Has Potential for Price Upside With Healthy Mall Fundamentals, BofA Securities Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/simon-property-has-potential-for-price-upside-with-healthy-mall-fundamentals-bofa-securities-says-ce7e5cdfdd8df423",
            "pub_date": "2026-02-28 00:56:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie launches capital increase of about EUR3 bln for UK Power Networks acquisition",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-launches-capital-increase-of-about-eur3-bln-for-uk-power-networks-acquisition-ce7e5cdfdd8df422",
            "pub_date": "2026-02-28 00:56:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Delaware court upholds recent corporate law overhaul",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-delaware-court-upholds-recent-corporate-law-overhaul-ce7e5cdfdd8df424",
            "pub_date": "2026-02-28 00:56:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bill Clinton says he had no idea of Epstein's crimes",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bill-clinton-says-he-had-no-idea-of-epstein-s-crimes-ce7e5cdfdd8df523",
            "pub_date": "2026-02-28 00:56:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block's AI-Driven Efficiency Push Strengthens 2026 Outlook, UBS Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-s-ai-driven-efficiency-push-strengthens-2026-outlook-ubs-says-ce7e5cdfdd8df724",
            "pub_date": "2026-02-28 00:56:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target's EPS Recovery Likely to Remain Slow, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-s-eps-recovery-likely-to-remain-slow-bofa-says-ce7e5cdfdd8aff20",
            "pub_date": "2026-02-28 00:51:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kansas City Fed Services Activity Index Rises in February",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Colin Kellaher </p><br/><p>\n  Services activity in the middle of the U.S. rose again in February, and expectations for future activity stayed positive, according to a monthly survey by the Federal Reserve Bank of Kansas City released Friday. </p><!-- Article --><p>\n\n  The Tenth District Services Survey's composite index, a weighted average of indexes covering revenue/sales, employment and inventory, came in at 6 in February following readings of 2 in January and 1 in December. Readings above zero indicate expansion, while those below zero indicate contraction. </p><p>\n\n  The Kansas City Fed said regional services activity continued to rise this month, as revenue growth reached its highest reading since June 2023. </p><p>\n\n  The bank said its index of expectations for future services activity slipped to 13 in February from 15 in January. </p><p>\n\n  The Kansas City Fed's survey includes participants from such service industries as retail and wholesale trade, automobile dealers, real estate and restaurants. The survey provides information on current services activity in the Tenth District, which includes Colorado, Oklahoma, Wyoming, Nebraska, Kansas, the northern half of New Mexico and the western third of Missouri. </p><p>\n\n  The bank's monthly manufacturing survey, released Thursday, showed that activity at factories in the central U.S. rose in February. </p><br/><p>\n  Write to Colin Kellaher at colin.kellaher@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1148ET</p></div>",
            "link": "https://hk.marketscreener.com/news/kansas-city-fed-services-activity-index-rises-in-february-ce7e5cdfdd8af022",
            "pub_date": "2026-02-28 00:51:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "TSA officers get fractional pay as government shutdown drags",
            "description": "<div class=\"txt-s4 article-text\"><p>NEW YORK, Feb 27 (Reuters) - Airport security screeners across the U.S. received a fraction of their usual pay on Friday as the partial government shutdown drags on, increasing the risk that more officers will call in sick to take second jobs, or even quit.</p><p>\n              Funding for the U.S. Department of Homeland Security lapsed on February 13 after Congress failed to reach a deal on immigration enforcement reforms demanded by Democrats. That halted funding for the operation of several government agencies, including the Transportation Security Administration.</p><!-- Article --><p>\n              This shutdown is more limited than the record 43-day October-November event that closed numerous departments of government. But with TSA agents facing the possibility of losing even more pay if this one drags on further, the ripple effects could emerge again: absences, departures, and bottlenecked security lines at the nation's airports.</p><p>\n              \"People are going to get discouraged a lot quicker this time,\" said Philip Glover, national vice president of District 3 of the American Federation of Government Employees, who represents TSA workers at 19 airports in Delaware and Pennsylvania.</p><p><b>EXPECTING MORE RESIGNATIONS</b></p><p>\n              Local AFGE officials said they are expecting TSA resignations to rise, while other TSA workers, some of whom are still repaying debts from the last shutdown, again tighten their finances.  </p><p>\n              Ha Nguyen McNeill, the top official at the TSA, told Congress this month that around 1,110 transportation security officers (TSOs) left the TSA in October and November 2025, a more than 25% increase from the same time period in 2024.</p><p>\n              \"We heard reports of officers sleeping in their cars at airports to save money on gas, selling their blood and plasma and taking on second jobs to make ends meet,\" McNeill said of last year's shutdown, adding that the TSA is working to surge staffing in March, April, and May to be prepared for spring break, summer, and World Cup travel.</p><p>\n              A TSA officer at Harry Reid International Airport in Las Vegas who asked to remain anonymous told Reuters the back-to-back shutdowns are making her reconsider the future of her nine-year career at the agency. \"I want to keep this job at least for the medical benefits, but sometimes I think I would be better off to abandon ship to reinvest myself elsewhere,\" the 34-year-old said.</p><p>\n              Workers for a second time in four months have to find a way to make ends meet without pay as the agency's management is pressing workers more on absences, as some call in sick to take on odd jobs to pay bills and fill their gas tanks, local AFGE officials said. </p><p>\n              \"Officers are looking at other alternatives just to maintain some kind of stability,\" said Darrell English, president of AFGE Local 777, which represents TSA workers in Illinois and Wisconsin. \"That's the backlash that's coming down the line from these continuous shutdowns.\"</p><p>\n              Neal Gosman, treasurer of the AFGE Local 899 in Minnesota, said that several of his colleagues with high seniority decided to retire shortly after this shutdown started.</p><p>\n              \"Maybe it's just coincidence and these are older people who've been there a while, but somehow they decided to pull the trigger this week,\" he said.</p><p></p><p>(Reporting by Doyinsola Oladipo in New York; additional reporting by David Shepardson in Washington)</p><p>\n            By Doyinsola Oladipo and David Shepardson</p></div>",
            "link": "https://hk.marketscreener.com/news/tsa-officers-get-fractional-pay-as-government-shutdown-drags-ce7e5cdfdd8af222",
            "pub_date": "2026-02-28 00:51:12",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bill Clinton: I would not have flown on Jeffrey Epstein's plane if I had any inkling of what he was doing -x post",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bill-clinton-i-would-not-have-flown-on-jeffrey-epstein-s-plane-if-i-had-any-inkling-of-what-he-was-ce7e5cdfdd8af32c",
            "pub_date": "2026-02-28 00:51:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "First Brands nears bankruptcy settlement, tees up business unit sales",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/first-brands-nears-bankruptcy-settlement-tees-up-business-unit-sales-ce7e5cdfdd8af324",
            "pub_date": "2026-02-28 00:51:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Week Ahead for FX, Bonds : U.S. Jobs Data in Focus -2-",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  The Philippines and Thailand will release February inflation data in the week. Headline inflation in the Philippines is expected to be driven by higher rice prices, said Barclays economists. </p><p>\n\n  The latest data would help set the central bank's future rate path trajectory, after it lowered its key interest rate at its last meeting in February, while noting it will be guided by incoming data. </p><!-- Article --><p>\n\n  In Thailand, markets will be watching if consumer prices fall further. According to the median estimate forecast by five economists polled by The Wall Street Journal, consumer prices are expected to have fallen 0.49% on year in February. </p><p>\n\n  This was likely due to lower domestic petrol and diesel prices, as well as softer pork prices, said Eugene Tan of Moody's Analytics. The latest data comes amid expectations of weak growth and subdued inflation. </p><br/><p>\n  Taiwan </p><br/><p>\n  Taiwan will release February inflation data on Friday. </p><p>\n\n  Economists expect the island's consumer prices to have risen temporarily due to base effects and strong Lunar New Year demand. Estimates range from 1.3% to 1.76%, up from January's 0.69%, the lowest in five years. </p><br/><p>\n  Hong Kong </p><br/><p>\n  Hong Kong will release its January retail sales data on Wednesday. </p><p>\n\n  The city's latest budget briefing pointed to a broadening recovery. Its economy grew 3.5% in 2025, supported by stronger consumption, investment and housing. Gross domestic product is projected to grow 2.5%-3.5% this year. </p><br/><p>\n  Any references to days are in local times. </p><br/><p>\n  Write to Jessica Fleetham at jessica.fleetham@wsj.com and Jihye Lee at jihye.lee@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1144ET</p></div>",
            "link": "https://hk.marketscreener.com/news/week-ahead-for-fx-bonds-u-s-jobs-data-in-focus-2-ce7e5cdfdd8af52c",
            "pub_date": "2026-02-28 00:46:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Week Ahead for FX, Bonds : U.S. Jobs Data in Focus",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Dow Jones Newswires staff </p><br/><p>\n  Below are the most important global events likely to affect FX and bond markets in the week starting March 2. </p><!-- Article --><p>\n\n  U.S. jobs data will mark the highlight of the coming week as investors remain uncertain about when the Federal Reserve is next likely to cut interest rates. </p><p>\n\n  In Europe, attention will center on eurozone inflation data and the spring statement by the U.K.'s treasury chief. In Asia, the Bank of Japan's policy outlook, Australia's growth figures and China's annual parliamentary sessions are in focus. </p><br/><p>\n  U.S. </p><br/><p>\n  U.S. jobs data are back in focus in the coming week, with monthly nonfarm payrolls data for February due on Friday. </p><p>\n\n  Investors will be looking to see whether January's surprisingly strong payrolls numbers were a one-off. This comes amid uncertainty over whether the U.S. Federal Reserve will cut interest rates in the coming months, although analysts say it would likely take a particularly weak number to move the dial much on rate expectations. </p><p>\n\n  \"Our view is that it would take quite a lot to get the Fed thinking about an imminent rate cut,\" ING economists said in a note. </p><p>\n\n  U.S. money markets aren't pricing in a rate cut until July at the earliest, LSEG data show. ING doesn't expect another reduction until June. </p><p>\n\n  Ahead of Friday's key data, ADP private payrolls figures for February will be released Wednesday, followed by weekly jobless claims Thursday. </p><p>\n\n  The latest ISM surveys for February for manufacturing and services activity will be released on Monday and Wednesday, respectively. These will be keenly watched for indications of the overall performance of the U.S. economy, particularly amid uncertainty over U.S. tariff policy and tensions between the U.S. and Iran. U.S. January retail sales data are also released Friday. </p><br/><p>\n  Eurozone </p><br/><p>\n  The eurozone data calendar thins out after the usual end-of-month avalanche. </p><p>\n\n  Spanish, Italian, French, German and eurozone manufacturing and services PMI data are due on Monday and Wednesday, respectively. </p><p>\n\n  Italy will release yearly GDP data on Monday and flash estimate CPI data for February on Tuesday, when the same data is also scheduled from the eurozone as a whole. </p><p>\n\n  Eurozone unemployment figures for January are scheduled for Wednesday and retail sales data for the same month on Thursday. Germany will publish manufacturing orders data for January on Friday. </p><p>\n\n  Final fourth-quarter GDP and employment data from the eurozone are due on Friday. </p><p>\n\n  \"For now, the economy still looks to be 'in a good place', albeit one that the European Central Bank thinks requires vigilance and agility,\" Investec analyst Sandra Horsfield says in a note. </p><p>\n\n  The Netherlands will launch a new 10-year bond via a Dutch Direct Auction on Tuesday, aiming to issue between 6 billion euros and 7 billion euros. Germany will auction April 2031 bonds on Tuesday and a February 2033 green Bund on Wednesday. Spain and France will hold bond auctions on Thursday. Italy will issue a new series of retail-only BTP Valore, with subscriptions running between Monday and Friday. </p><br/><p>\n  U.K. </p><br/><p>\n  Focus in the U.K. will be on Tuesday's spring statement, a twice-yearly report on U.K. public finances which Treasury chief Rachel Reeves will present before lawmakers. This will be followed by an announcement on gilt issuance by the Debt Management Office. </p><p>\n\n  Markets expect Reeves to announce an improved fiscal position, including solid fiscal headroom. Gilt investors also expect government debt issuance to fall in the fiscal year to April 2027. Analysts said this could help push yields on U.K. government bonds lower. </p><p>\n\n  Economic data include final purchasing managers' data for February on manufacturing on Monday, then on services Wednesday. Data on consumer credit and mortgage lending for January are released on Monday, as well as the latest Nationwide house price index for February. The BRC's shop price index for February is released Tuesday. </p><br/><p>\n  Poland </p><br/><p>\n  Poland's central bank announces an interest-rate decision on Wednesday, where it could announce a 25 basis-point reduction in its key policy rate to 3.75%. </p><p>\n\n  HSBC economists expect a rate cut due to evidence of declining inflation. </p><p>\n\n  \"We continue to expect that during the March meeting the rate-setters will have a new inflation forecast that will show a downward revision to the Polish central bank's 2026 inflation forecast, to or even below the 2.5% target,\" they said in a note. This should be enough to warrant a rate cut, they said. </p><br/><p>\n  Japan </p><br/><p>\n  Investors will look for clues on the timing of the Bank of Japan's next rate increase in speeches by BOJ officials. Deputy Gov. Ryozo Himino will meet local leaders in Wakayama, Japan, on Monday. Governor Kazuo Ueda is scheduled to appear at the  \"FIN/SUM 2026\" event in Tokyo on Tuesday. </p><p>\n\n  Japan's Ministry of Finance will auction about 2.6 trillion yen of 10-year government bonds on Tuesday and around 700 billion yen of 30-year bonds on Thursday. The 30-year sale may draw strong demand from pension funds and insurers seeking higher yields. </p><p>\n\n  Auto sales figures for February are also scheduled for release on Monday. </p><br/><p>\n  Australia </p><br/><p>\n  Bond traders will focus on Australia's fourth-quarter 2025 growth data due Wednesday. </p><p>\n\n  The economy is expected to have grown 2.1% in calendar 2025 while operating near full capacity, adding to inflation pressures. </p><p>\n\n  The week will therefore be dominated once again by a discussion about a decade of weak productivity growth, excessive government spending and the potential for the Reserve Bank of Australia to raise interest rates in the coming months, perhaps as early as mid-March. </p><p>\n\n  The release on Thursday of the household spending indicator for January will also be closely watched by the central bank, given that strong consumer spending will add to the case for higher interest rates. </p><p>\n\n  RBA Governor Michele Bullock will deliver a speech on Tuesday. Bullock has been indicating that the central bank is closely monitoring data, including quarterly inflation numbers in late April that are likely to be critical in setting the scene for an interest rate increase in May. </p><p>\n\n  For the RBA, the data will point to whether aggregate capacity constraints are more or less worrisome than before. January's household spending data should show consumer activity starting 2026 at a subdued pace, while house price data is likely to confirm another strong monthly increase. </p><br/><p>\n  China </p><br/><p>\n  China returns from the Lunar New Year holiday to a busy week of data and policy announcements, including the annual meetings of its top legislature and advisory body. </p><p>\n\n  The National People's Congress, part of the \"Two Sessions,\" will open on Thursday. Beijing is expected to announce key economic targets for 2026, including GDP growth. </p><p>\n\n  ING economists forecast the growth target will be lowered to \"above 4.5%\" from \"around 5.0%\" in recent years. Fiscal targets, including the deficit-to-GDP ratio and bond issuance, are also expected. </p><p>\n\n  A reduced growth target would mark the first in four years. Citi economists said such a move would signal measured stimulus. They anticipate 1 trillion yuan in fiscal support, a possible 10-basis-point rate cut and a 50-basis-point reserve requirement ratio cut this year. </p><p>\n\n  Further measures could focus on stabilizing the labor market, boosting household income and domestic demand as well as advancing AI adoption. </p><p>\n\n  Official PMIs due Wednesday are likely to reflect disruption from February's extended holidays. ANZ economist Krystal Tan expects the manufacturing PMI to fall to 49.0 from 49.3, and the non-manufacturing PMI to edge down to 49.3 from 49.4. Small and midsize firms may show particular weakness, with tourism gains offset by softness in construction and finance. </p><p>\n\n  Private PMIs compiled by RatingDog are also due Wednesday. Foreign-exchange reserves data will be released Saturday. </p><br/><p>\n  Asian PMIs </p><br/><p>\n  Monday brings February manufacturing PMIs for Taiwan, Japan, India, Vietnam and other economies. </p><p>\n\n  Investors will look for signs that renewed U.S. tariff uncertainty has affected business sentiment, especially after The Supreme Court struck down Trump's global tariffs as illegal. </p><p>\n\n  The ruling may offer temporary relief for some exporters, but trade policy remains uncertain. Momentum is likely to remain supported by a strong tech-led export cycle, which remains largely insulated from the tariff shifts, ANZ added. </p><br/><p>\n  Malaysia </p><br/><p>\n  Malaysia's central bank will announce its rate decision Thursday afternoon. </p><p>\n\n  With inflation contained and labor-cost growth moderate, Citi expects Bank Negara to keep its policy rate unchanged at 2.75% through 2026. Policymakers are likely to favor a gradual appreciation of the ringgit to tighten monetary conditions. </p><br/><p>\n  South Korea </p><br/><p>\n  South Korea is expected to report solid February exports on Mar. 1, driven by robust semiconductor demand despite fewer working days in the month. </p><p>\n\n  A Wall Street Journal poll of nine economists forecast exports rose 25.6% from a year earlier, after a revised 33.8% increase in January. Early February trade data suggest chip exports are on track for a monthly record. Imports likely rose 13.6%, resulting in a $10.10 billion trade surplus--wider than January's revised $8.72 billion surplus. </p><p>\n\n  February inflation data are due Friday. Headline inflation is expected to remain near the central bank's 2% target after easing to a five-month low of 2.0% in January from 2.3% in December. </p><br/><p>\n  Indonesia </p><br/><p>\n  Indonesia will release January trade and February inflation data Monday afternoon. </p><p>\n\n  Headline inflation likely rose in February due to base effects and stronger demand during Ramadan, Kenanga Investment Bank said. </p><p>\n\n  January export growth may moderate as base effects fade after a temporary rise in late 2025, RHB said in a note. However, exports should maintain moderate growth over 2026, driven by ongoing efforts to diversify markets, RHB added. </p><br/><p>\n  Philippines, Thailand </p><br/><p>\n  (MORE TO FOLLOW) Dow Jones Newswires</p><p>\n\n  02-27-26 1144ET</p></div>",
            "link": "https://hk.marketscreener.com/news/week-ahead-for-fx-bonds-u-s-jobs-data-in-focus-ce7e5cdfdd8af523",
            "pub_date": "2026-02-28 00:46:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart's Sales and Profit Growth Should Boost EPS and Valuation, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/walmart-s-sales-and-profit-growth-should-boost-eps-and-valuation-bofa-says-ce7e5cdfdd8af520",
            "pub_date": "2026-02-28 00:46:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck Says Keytruda Plus Padcev Decreases Risk of Death in Bladder Cancer Trial",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/merck-says-keytruda-plus-padcev-decreases-risk-of-death-in-bladder-cancer-trial-ce7e5cdfdd8bfe24",
            "pub_date": "2026-02-28 00:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Costco's Executive Membership Growth a 'Healthy' Sign, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/costco-s-executive-membership-growth-a-healthy-sign-bofa-says-ce7e5cdfdd8bff22",
            "pub_date": "2026-02-28 00:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Equipmake soars amid narrowed interim loss, Caterpillar investment",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Equipmake Holdings PLC shares soared on Friday as the company announced further backing by Caterpillar Inc, and a narrowing of its half-year loss, despite a weaker top line. </p><p></p><p>Equipmake shares were up 47% at 1.25 pence each on Friday afternoon on the Aquis Exchange in London.</p><!-- Article --><p></p><p>The Norfolk, England-based maker of electric motors, inverters, and drivetrains, said it has secured GBP3 million in senior secured convertible loans by Caterpillar Venture Capital Inc, entered on the same terms of the previous GBP5 million backing dating back to March 2025.</p><p></p><p>Caterpillar Venture Capital is a wholly owned subsidiary of Irving, Texas-based heavy machinery maker, Caterpillar. </p><p></p><p>The loan will mature at the end of March 2029, and pays 10% interest per year, with the option for Caterpillar to demand repayment or acquire Equipmake's shares.</p><p></p><p>Equipmake said that in the six months to the end of November, its pretax loss narrowed to GBP2.8 million from GBP4.3 million a year prior. Revenue however fell 26% to GBP1.4 million from GBP1.9 million, with the narrowed loss tied to cost reductions, namely in administrative expenses. </p><p></p><p>Administrative expenses fell 31% to GBP3.0 million from GBP4.3 million, with Equipmake attributing this to cost reduction measures. </p><p></p><p>Equipmake said it currently has a live order book of about GBP10.7 million</p><p></p><p>Chief Executive Officer Ian Foley said: \"Following the decisive restructuring and refocusing in the prior financial year, the first half of the financial year 2026 marked a turning point...A strengthened balance sheet and growing commercial traction, we are now executing against a clear strategy focused on scalable, higher-margin opportunities.\"</p><p></p><p>He added: \"Having the backing of Caterpillar has helped position Equipmake as a credible partner to both customers and suppliers, as well as providing a natural route to market for our solutions. We are seeing strong demand for our world-class solutions across a variety of sectors and these funds will help Equipmake accelerate its mission of transforming transportation through sustainable technology, creating substantial value for our investors, partners and customers.\"</p><p></p><p>By Martin Miraglia, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/equipmake-soars-amid-narrowed-interim-loss-caterpillar-investment-ce7e5cdfdd8bf625",
            "pub_date": "2026-02-28 00:35:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon Leads OpenAI's $110 Billion Funding Round; Nvidia Commits $30 Billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/amazon-leads-openai-s-110-billion-funding-round-nvidia-commits-30-billion-ce7e5cdfdd88f025",
            "pub_date": "2026-02-28 00:30:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}