{
    "data": [
        {
            "title": "RUBBER-Japan futures retreat from seven-day rally despite tight supply outlook",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rubber-japan-futures-retreat-from-seven-day-rally-despite-tight-supply-outlook-ce7e5cded88ef320",
            "pub_date": "2026-02-27 10:56:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indian rupee may retest 91 level again; flows, weak risk test RBI's resolve",
            "description": "<div class=\"txt-s4 article-text\"><p>MUMBAI, Feb 27 (Reuters) - The Indian rupee is set for another run at 91 per dollar on Friday, pressured by risk-off flows and modest dollar strength, putting the central bank's defence of that level under scrutiny.</p><p>\n              The one-month non-deliverable forward indicated the rupee will open in the 90.98-91.02 range versus the U.S. dollar, having settled at 90.9050 on Thursday.</p><!-- Article --><p>\n              The currency has faced sustained pressure this week from dollar demand tied to NDF maturities and routine corporate flows, while a cautious near-term outlook has prompted importers to add hedges. Weakness in domestic equities has compounded the strain on the rupee.</p><p>\n              According to bankers, absent central bank intervention, the rupee may have already broken decisively beyond 91. Its inability to capitalise on rallies in other Asian currencies underscores the persistent underlying weakness.</p><p>\n              The dollar/rupee's repeated moves toward the 91 figure have the impact of keeping dollar long positions \"interested,\" more so since there are no major dips when RBI intervenes, a currency trader at a bank said.</p><p>\n              He added that the RBI has been offering dollars at various levels to cap the upside rather than actively driving the pair lower, a strategy that does not materially hurt existing long-dollar positions.</p><p><b>RISK OFF WEIGHS ON ASIA FX    </b></p><p>\n              Asian currencies were mostly weaker on Friday amid fragile risk appetite, after U.S. equities fell overnight and futures signalled further losses. Asian shares largely tracked Wall Street lower.</p><p>\n              Investor sentiment was dented by concerns about overstretched technology valuations, while persistent tensions in the Middle East kept oil markets jittery, adding to the cautious tone.</p><p>\n              That risk aversion was evident in U.S. Treasuries, which drew safe-haven demand and pushed yields lower despite better-than-expected U.S. jobless claims data.</p><p></p><p>(Reporting by Nimesh Vora; Editing by Rashmi Aich)</p><p>\n            By Nimesh  Vora</p></div>",
            "link": "https://hk.marketscreener.com/news/indian-rupee-may-retest-91-level-again-flows-weak-risk-test-rbi-s-resolve-ce7e5cded88ef62d",
            "pub_date": "2026-02-27 10:50:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Qingdao TGOOD Electric Files For Hong Kong IPO",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/qingdao-tgood-electric-files-for-hong-kong-ipo-ce7e5cded88ef627",
            "pub_date": "2026-02-27 10:50:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "INDIA RUPEE-Indian rupee may retest 91 level again; flows, weak risk test RBI's resolve",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-rupee-indian-rupee-may-retest-91-level-again-flows-weak-risk-test-rbi-s-resolve-ce7e5cded88ef625",
            "pub_date": "2026-02-27 10:50:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's yuan halts rally after PBOC cuts dollar-buying costs",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-yuan-halts-rally-after-pboc-cuts-dollar-buying-costs-ce7e5cded88ffe25",
            "pub_date": "2026-02-27 10:45:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASX Midday Sector Update: Communication Services Stocks Jump, Consumer Staples Struggle",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asx-midday-sector-update-communication-services-stocks-jump-consumer-staples-struggle-ce7e5cded88ffe24",
            "pub_date": "2026-02-27 10:36:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pakistan strikes Afghanistan targets as clashes intensify",
            "description": "<div class=\"txt-s4 article-text\"><p>KABUL, Feb 27 (Reuters) - Pakistan struck targets inside Afghanistan's major cities  overnight, Pakistani and Taliban officials said on Friday, as cross-border fighting intensified following months of tensions and skirmishes between the two countries. </p><p>\n              Security sources in Pakistan said the strikes involved air and ground strikes against Taliban posts, headquarters and ammunition depots in multiple sectors along the border.</p><!-- Article --><p>\n              Both sides reported heavy losses, issuing sharply differing figures that Reuters could not independently verify. </p><p>\n              The strikes mark the most serious escalation between the neighbours in months, threatening a fragile ceasefire along the 2,600-km (1,615-mile) frontier and deepening a long-running dispute over Islamabad's accusation that Kabul harbours Tehreek-e-Taliban Pakistan (TTP) militants, a charge the Taliban deny.</p><p>\n              Taliban spokesperson Zabihullah Mujahid said Pakistani forces carried out airstrikes in parts of Kabul, Kandahar and Paktia.</p><p>\n              \"Pakistani counterstrikes against targets in Afghanistan continue,\" a Pakistani government spokesperson, Mosharraf Zaidi, said in a post on X, describing the action as a response to \"unprovoked Afghan attacks.\"</p><p>\n              A Reuters witness in Kabul said many ambulance sirens could be heard following loud blasts. </p><p>\n              Video shared by Pakistani security officials showed flashes of light in the night from firing along the border and the sound of heavy artillery. Another video showed a building on fire, which the officials said was a Taliban headquarters in Paktia. </p><p>\n              Zaidi said 133 Afghan Taliban fighters were killed and more than 200 wounded, with 27 posts destroyed and nine captured. </p><p>\n              Mujahid said 55 Pakistani soldiers were killed and 19 posts seized, while eight Taliban fighters were killed, 11 wounded and 13 civilians injured in Nangarhar.</p><p>\n              The latest fighting follows Pakistani airstrikes earlier this week that Islamabad said targeted camps of TTP and Islamic State militants in eastern Afghanistan. Kabul denies allowing militants to operate from its territory and had warned it would respond.</p><p>\n              Clashes erupted along the frontier on Thursday night after the Taliban launched what it described as retaliatory attacks on Pakistani military installations. Both sides had claimed to destroy border posts in that fighting.</p><p></p><p> (Reporting by Mohammad Yunus Yawar and Sayed Hassib in Kabul, and Ariba Shahid in Karachi; Editing by Stephen Coates)</p></div>",
            "link": "https://hk.marketscreener.com/news/pakistan-strikes-afghanistan-targets-as-clashes-intensify-ce7e5cded88ff02d",
            "pub_date": "2026-02-27 10:36:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Moves to Tame Yuan Rally by Slashing Shorting Costs",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  China's central bank has started taking steps to check the yuan's recent advance, dusting off an old playbook that would reduce the cost of betting against the currency. </p><p>\n\n  On Friday, the People's Bank of China announced it would slash the risk reserve requirement ratio for financial institutions conducting foreign-exchange forward trading to zero from 20%, a move that effectively makes purchasing the dollar cheaper. </p><!-- Article --><p>\n\n  The PBOC said in a statement that it would aim to keep yuan's exchange rate stable at a reasonable and balanced level and the change will take effect March 2. </p><p>\n\n  Currently, Chinese banks have to set aside a 20% risk reserve on forward currency trades. This \"speed bump\" was implemented in September 2022 when the yuan faced renewed downward pressure amid a surging dollar and a slowing Chinese economy. </p><p>\n\n  Friday's move came as the Chinese currency hit a nearly three-year-high against a weakening greenback in recent days. This strong performance also buoyed regional currencies from China's close trading partners such as South Korea, Malaysia and Thailand amid trade uncertainties. </p><p>\n\n  While Beijing has recently signaled more tolerance for a stronger yuan, Chinese officials have also frequently warned against bumpy currency fluctuations that could hurt exporters. </p><p>\n\n  Over the past decade, the PBOC has adjusted the requirement ratio on foreign-exchange forward trading several times to manage the yuan. The ratio could be re-imposed if concerns about the Chinese currency's appreciation abate. </p><br/><p>\n  Write to Singapore Editors at singaporeeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 2130ET</p></div>",
            "link": "https://hk.marketscreener.com/news/china-moves-to-tame-yuan-rally-by-slashing-shorting-costs-ce7e5cded88ff12c",
            "pub_date": "2026-02-27 10:36:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CapitaLand Ascendas REIT Management buys logistics assets in Spain for S$185.4m",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/capitaland-ascendas-reit-management-buys-logistics-assets-in-spain-for-s-185-4m-ce7e5cded88ff122",
            "pub_date": "2026-02-27 10:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "City Developments declares final ordinary dividend of 25.0 SG cents per share",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/city-developments-declares-final-ordinary-dividend-of-25-0-sg-cents-per-share-ce7e5cded88ff224",
            "pub_date": "2026-02-27 10:30:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold steady as investors weigh progress in US-Iran talks",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Gold prices held broadly steady on Friday, with investors digesting the previous day's U.S.-Iran nuclear talks, while the dollar, hovering near three-week highs, pressured the yellow metal.</p><p><b>FUNDAMENTALS</b></p><!-- Article --><p>\n              * Spot gold was steady at $5,187.39 per ounce by 0146 GMT. Bullion hit a more than three-week high on Tuesday.</p><p>\n              * U.S. gold futures for April delivery were up 0.2% at $5,204.10.</p><p>\n              * The dollar held steady to hover near three-week highs, making dollar-denominated gold more expensive for holders of other currencies. [USD/]</p><p>\n              * The number of Americans filing new applications for jobless benefits increased slightly last week, and the unemployment rate appeared to hold steady in February amid a stable labor market.</p><p>\n              * Meanwhile, Federal Reserve chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts in alignment with President Donald Trump's expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</p><p>\n              * Markets currently expect three 25-basis-point rate cuts from the Federal Reserve this year, according to CME's FedWatch Tool. [FEDWATCH]</p><p>\n              * Gold looks neutral in a range of $5,158 to $5,201 per ounce, and an escape could suggest a direction, Reuters technical analyst Wang Tao said, adding that the bias might be toward the upside, it is supposed to travel to $5,243 or a much higher level. [TECH/C]</p><p>\n              * In Geneva, the U.S. and Iran made progress in talks over Tehran's nuclear program on Thursday, mediator Oman said, but hours of negotiation ended with no sign of a breakthrough that could avert potential U.S. strikes amid a massive military buildup.</p><p>\n              * Spot silver rose 0.6% to $88.81 per ounce, after climbing to a three-week high on Wednesday.</p><p>\n              * Spot platinum added 0.6% to $2,286.53 per ounce, while palladium gained 0.5% to $1,794.13.</p><p><b>           DATA/EVENTS (GMT)          </b></p><p>\n                         0745  France GDP QQ Final Q4          </p><p>\n                         0745  France CPI (EU Norm) Prelim MM, YY Feb          </p><p>\n                         0745  France CPI Prelim YY, MM NSA Feb          </p><p>\n                         0745  France Producer Prices YY Jan          </p><p>\n                         0855  Germany Unemployment Chg, Rate SA Feb          </p><p>\n                         1100  France Unemp Class-A SA Jan          </p><p>\n                         1300  Germany CPI Prelim YY Feb          </p><p><b>                           </b></p><p>\n                         1300  Germany HICP Prelim YY Feb          </p><p>\n                         1330  US PPI Machine Manuf'ing Jan          </p><p></p><p>(Reporting by Ishaan Arora in Bengaluru; Editing by Rashmi Aich)</p></div>",
            "link": "https://hk.marketscreener.com/news/gold-steady-as-investors-weigh-progress-in-us-iran-talks-ce7e5cded88ff327",
            "pub_date": "2026-02-27 10:30:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seatrium announces delivery of next-generation wind turbine installation vessel",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/seatrium-announces-delivery-of-next-generation-wind-turbine-installation-vessel-ce7e5cded88ff42d",
            "pub_date": "2026-02-27 10:30:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Eminent Healthcare to acquire Top Eminent II",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-eminent-healthcare-to-acquire-top-eminent-ii-ce7e5cded88ff422",
            "pub_date": "2026-02-27 10:25:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shenzhen Zhaowei Machinery & Electronics announces global offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shenzhen-zhaowei-machinery-electronics-announces-global-offering-ce7e5cded88ff426",
            "pub_date": "2026-02-27 10:25:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan imports of rare earths from China down 5.7% y/y in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/japan-imports-of-rare-earths-from-china-down-5-7-y-y-in-january-ce7e5cded88ff425",
            "pub_date": "2026-02-27 10:25:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "VeriSilicon Microelectronics Shanghai Narrows 2025 Loss as Revenue Grows 36%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/verisilicon-microelectronics-shanghai-narrows-2025-loss-as-revenue-grows-36-ce7e5cded88ff52d",
            "pub_date": "2026-02-27 10:25:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hyundai Motor Group to invest $6.3 billion in AI data centre, robot factory in South Korea",
            "description": "<div class=\"txt-s4 article-text\"><p>SEOUL, Feb 27 (Reuters) - Hyundai Motor Group and South Korea on Friday signed a deal to invest about 9 trillion won ($6.26 billion) to build an AI data centre, a robot manufacturing factory and other developments in the country's western coastal region, the land ministry said. </p><p></p><p> (Reporting by Hyunjoo JinEditing by Ed Davies)</p></div>",
            "link": "https://hk.marketscreener.com/news/hyundai-motor-group-to-invest-6-3-billion-in-ai-data-centre-robot-factory-in-south-korea-ce7e5cded88ff522",
            "pub_date": "2026-02-27 10:25:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Alsco Pooling Service launches global offering",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/alsco-pooling-service-launches-global-offering-ce7e5cded88ff524",
            "pub_date": "2026-02-27 10:25:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thai baht/US dollar stronger on Friday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/thai-baht-us-dollar-stronger-on-friday-ce7e5cded88ff72c",
            "pub_date": "2026-02-27 10:20:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UI Boustead REIT launches Singapore IPO to raise up to S$1.02 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ui-boustead-reit-launches-singapore-ipo-to-raise-up-to-s-1-02-billion-ce7e5cded88ff721",
            "pub_date": "2026-02-27 10:20:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google, OpenAI workers push for military AI limits - Axios",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/google-openai-workers-push-for-military-ai-limits-axios-ce7e5cded88cff24",
            "pub_date": "2026-02-27 10:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Eminent Healthcare to Acquire Health & Wellness E-commerce Firm for HK$100 Million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-eminent-healthcare-to-acquire-health-wellness-e-commerce-firm-for-hk-100-million-ce7e5cded88cf12d",
            "pub_date": "2026-02-27 10:20:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold miners lift Australian shares after early dip; Coles slump caps gains",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/gold-miners-lift-australian-shares-after-early-dip-coles-slump-caps-gains-ce7e5cded88cf121",
            "pub_date": "2026-02-27 10:20:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nextera Energy announces sale of equity units",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nextera-energy-announces-sale-of-equity-units-ce7e5cded88cf22d",
            "pub_date": "2026-02-27 10:20:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Soybeans ease on profit taking, wheat inches higher",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/soybeans-ease-on-profit-taking-wheat-inches-higher-ce7e5cded88cf222",
            "pub_date": "2026-02-27 10:20:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASX Biggest Gainers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asx-biggest-gainers-ce7e5cded88cf221",
            "pub_date": "2026-02-27 10:20:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MeiG Smart Technology Launches Up to HK$1 Billion Hong Kong IPO",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/meig-smart-technology-launches-up-to-hk-1-billion-hong-kong-ipo-ce7e5cded88cf224",
            "pub_date": "2026-02-27 10:11:24",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Spot platinum rises over 3% to $2,352.40/oz",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spot-platinum-rises-over-3-to-2-352-40-oz-ce7e5cded88cf32d",
            "pub_date": "2026-02-27 10:11:25",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Estun Automation Launches Hong Kong IPO to Raise Up to HK$1.65 Billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/estun-automation-launches-hong-kong-ipo-to-raise-up-to-hk-1-65-billion-ce7e5cded88cf324",
            "pub_date": "2026-02-27 10:11:25",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Zhaowei Machinery & Electronics Launches Hong Kong IPO to Raise Nearly HK$2 Billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/zhaowei-machinery-electronics-launches-hong-kong-ipo-to-raise-nearly-hk-2-billion-ce7e5cded88cf525",
            "pub_date": "2026-02-27 10:11:26",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aussie jumps, yen slumps as rates play dominates in February",
            "description": "<div class=\"txt-s4 article-text\"><p>SINGAPORE, Feb 27 (Reuters) - The Australian dollar was poised for another sharp monthly gain on Friday as expectations grow for a more hawkish central bank, while the yen was headed for a loss as the Bank of Japan contends with an emboldened reflationist prime minister. </p><p>\n              Investors have had to grapple this month with geopolitical tensions, a pivotal U.S. Supreme Court ruling over Trump's tariffs and fickleness over the artificial intelligence trade, among other developments.</p><!-- Article --><p>\n              But while the broader markets remained volatile, moves in the currencies for the month were driven primarily by shifting rate expectations.</p><p>\n              \"The rates are reflecting the changing macro situation,\" said Sim Moh Siong, a currency strategist at OCBC.</p><p>\n              \"Last year was about which central banks will cut rates and by how much. This year, the focus has shifted towards which central banks will lead in terms of hiking rates.\"</p><p>\n              The Australian dollar, which was steady at $0.7106 on Friday, was on track for a monthly gain of roughly 2%.</p><p>\n              Up more than 6% for the year thus far, the Antipodean currency is the best-performing G10 currency to date, as a domestic economy in rude health continues to fuel expectations for a more hawkish Reserve Bank of Australia.</p><p>\n              \"It is conceivable that the Aussie dollar can put on one or two more (U.S.) cents from here,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia.</p><p>\n              \"We are still of the view that there will be just one more 25-basis-point rate hike from the RBA this year.\"</p><p>\n              Also on the hiking path is the Bank of Japan, though that has done little to help the yen as domestic politics complicates the rate outlook, even as BOJ Governor Kazuo Ueda signalled openness to a near-term hike.</p><p>\n              While the yen was up 0.2% at 155.78 in Asia, it has fallen 0.4% for the week and 0.6% for the month thus far.</p><p>\n              This week, Japan's government nominated two academics seen by markets as strong advocates of economic stimulus to join the BOJ's board. The surprise move sends a not-so-subtle message about Prime Minister Sanae Takaichi's distaste for higher interest rates, casting doubt on how much further policy can be tightened.</p><p>\n              \"Ueda flagging a possible March/April hike did little to support the yen because the guidance remains conditional on incoming data, and the political optics around appointments make markets question the pace and conviction of policy normalisation,\" said Saxo's chief investment strategist Charu Chanana.</p><p><b>ASSESSING THE RATE OUTLOOKS</b></p><p>\n              Sterling was steady at $1.3484, set to snap three straight months of gains with a 1.5% fall in February.</p><p>\n              The British pound has been undermined by a dovish tilt from the Bank of England, with traders now pricing in an 83% chance of a rate cut in March.</p><p>\n              Elsewhere, the dollar was set to gain 0.6% for the month, helped by a slightly more hawkish Federal Reserve after \"several\" policymakers signalled at January's policy meeting their openness to rate hikes if inflation remains elevated.</p><p>\n              Nonetheless, investors continue to price in two more Fed cuts this year.</p><p>\n              \"I think because there's still lingering concerns about what the Fed would be like under new Fed Chair Kevin Warsh,\" said OCBC's Sim.</p><p>\n              The U.S. Supreme Court's decision to strike down Trump's tariffs also reinforced checks and balances on presidential power, which provided some support to the dollar, said analysts.</p><p>\n              \"It suggests that the long-term prospects for the U.S. dollar might not be as grim as previously imagined,\" said Macquarie Group's FX and rates strategist Gareth Berry.    </p><p>\n              Moves in the euro were more muted, with the common currency little changed at $1.1796 on Friday and headed for a monthly loss of just over 0.4%.</p><p>\n              Expectations are for the European Central Bank to keep rates steady for months to come.</p><p>\n              In China, the country's central bank said on Friday it will scrap foreign exchange risk reserves for some forwards contracts, a move that would reduce the cost of dollar buying.</p><p>\n              The decision comes after the yuan climbed 4.4% against the dollar in 2025, its biggest annual gain since 2020, with the upward momentum continuing into the new year.</p><p>\n              The offshore yuan was last down 0.2% at 6.8585 per dollar, ahead of the onshore trade open.</p><p></p><p> (Reporting by Rae Wee; Editing by Edwina Gibbs)</p><p>\n            By Rae Wee</p></div>",
            "link": "https://hk.marketscreener.com/news/aussie-jumps-yen-slumps-as-rates-play-dominates-in-february-ce7e5cded88cf727",
            "pub_date": "2026-02-27 10:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASX Biggest Losers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asx-biggest-losers-ce7e5cded88cf725",
            "pub_date": "2026-02-27 10:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Qian Xun Technology Bondholders Swap Debt for Equity",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/qian-xun-technology-bondholders-swap-debt-for-equity-ce7e5cded88dfe2c",
            "pub_date": "2026-02-27 10:05:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hd Hyundai Heavy Industries Co Ltd wins 372.4 billion won order",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hd-hyundai-heavy-industries-co-ltd-wins-372-4-billion-won-order-ce7e5cded88dfe22",
            "pub_date": "2026-02-27 10:05:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeOne Medicines Returns to Profit in 2025 on 40% Revenue Jump",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/beone-medicines-returns-to-profit-in-2025-on-40-revenue-jump-ce7e5cded88dff2d",
            "pub_date": "2026-02-27 10:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Netflix backs out of bid for Warner Bros after Paramount's new offer",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: Netflix said on Thursday that it was backing out of its bid to buy Warner Bros Discovery's streaming and studio assets.</p><p>\n              It comes shortly after Warner Bros said a revised $31-per-share offer from Paramount Skydance was superior to its existing deal with Netflix.</p><!-- Article --><p>\n              In a statement, Netflix said (quote) \"at the price required to match Paramount Skydance's latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid.\" </p><p>\n              Netflix, which wanted to buy the Warner Bros streaming and studio businesses, agreed in December to pay $27.75 a share, saying the offer, along with a planned spinoff of Warner Bros' cable assets, would deliver a greater shareholder value.</p><p>\n              Paramount, meanwhile, has argued it has a clearer path to U.S. regulatory approval.</p><p>\n              On Thursday, Paramount said it welcomed Warner Bros board's unanimous reaffirmation that its bid represents the stronger offer.</p></div>",
            "link": "https://hk.marketscreener.com/news/netflix-backs-out-of-bid-for-warner-bros-after-paramount-s-new-offer-ce7e5cded88dff25",
            "pub_date": "2026-02-27 10:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASX Most Active Stocks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asx-most-active-stocks-ce7e5cded88dff24",
            "pub_date": "2026-02-27 10:05:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Oil prices edge lower after US, Iran extend talks",
            "description": "<div class=\"txt-s4 article-text\"><p> (Corrects to add keywords for media subscribers)</p><p>\n              \n              Feb 26 (Reuters) - Oil prices fell on Friday and were on track for a weekly decline after the United States and Iran extended talks over the OPEC member's nuclear programme, easing concerns about potential hostilities that could disrupt supply.</p><!-- Article --><p>\n              Brent crude futures lost 28 cents, or 0.4%, to $70.47 a barrel. WTI futures fell 29 cents, or 0.44%, to $64.92.</p><p>\n              For the week, Brent was heading for a 1.8% decline, while WTI was set to fall around 2.2%, reversing some of the previous week's gains. </p><p>\n              The United States and Iran held indirect talks in Geneva on Thursday over their long-running nuclear dispute to avert a conflict after U.S. President Donald Trump ordered a military build-up in the region.</p><p>\n              During the talks, oil prices gained more than a dollar a barrel after media reports indicated the discussions had stalled over U.S. insistence on zero enrichment of uranium by Iran, as well as a demand for the delivery of all 60% enriched uranium to the United States.</p><p>\n              However, prices eased after the Omani mediator said the two sides had made progress in their talks.</p><p>\n              They plan to resume negotiations with technical-level discussions scheduled to take place next week in Vienna, Omani Foreign Minister Sayyid Badr Albusaidi said in a post on X after the meetings in Geneva.</p><p>\n              \"While this initially allayed concerns of imminent U.S. military action, it leaves little time to reach a deal before President Trump's deadline of 1-6 March,\" said Daniel Hynes, an analyst at ANZ.</p><p>\n               (Reporting by Nicole Jao in New York; Editing by Sonali Paul)</p><p>\n            By Nicole Jao</p></div>",
            "link": "https://hk.marketscreener.com/news/oil-prices-edge-lower-after-us-iran-extend-talks-ce7e5cded88df126",
            "pub_date": "2026-02-27 10:00:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Estun Automation announces global offering of 96.8 million H shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/estun-automation-announces-global-offering-of-96-8-million-h-shares-ce7e5cded88df221",
            "pub_date": "2026-02-27 10:00:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HD Korea Shipbuilding Secures KRW372 Billion Order for Six Container Ships",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hd-korea-shipbuilding-secures-krw372-billion-order-for-six-container-ships-ce7e5cded88df32d",
            "pub_date": "2026-02-27 10:00:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}