{
    "data": [
        {
            "title": "Kansas City Fed February Regional Manufacturing Index 5 Vs. 2 Estimate; 0 Prior",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kansas-city-fed-february-regional-manufacturing-index-5-vs-2-estimate-0-prior-ce7e5cd9dd8ff521",
            "pub_date": "2026-02-27 00:20:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Diageo Rating, Price Target Maintained as BofA Notes New Strategy",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diageo-rating-price-target-maintained-as-bofa-notes-new-strategy-ce7e5cd9dd8ff723",
            "pub_date": "2026-02-27 00:20:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BofA Keeps Allianz at Buy Amid Stronger-than-expected FY25 Solvency",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bofa-keeps-allianz-at-buy-amid-stronger-than-expected-fy25-solvency-ce7e5cd9dd8ff727",
            "pub_date": "2026-02-27 00:20:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "'Pressure is for Tyres' LSEG CEO Says After Elliott Takes Stake",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"76usAyvtU52\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        The London Stock Exchange Group has announced plans to buy back lb3 billion of its own shares, as it reported full year results less than a month after it emerged that Elliott Investment Management had taken a stake. The company also hiked its final dividend 15.7% to 103 pence a share and set new guidance for the next two years.  LSEG CEO David Schwimmer Spoke to Caroline Hepker and Stephen Carroll on Bloomberg Radio. Bloomberg LP, the parent company of Bloomberg News, competes with LSEG to provide financial news, data and information.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52534597');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/pressure-is-for-tyres-lseg-ceo-says-after-elliott-takes-stake-ce7e5cd9dd8cfe23",
            "pub_date": "2026-02-27 00:15:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Poland is loyal ally of US, but can't be a \"sucker,\" Polish minister says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/poland-is-loyal-ally-of-us-but-can-t-be-a-sucker-polish-minister-says-ce7e5cd9dd8cfe21",
            "pub_date": "2026-02-27 00:15:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's Baidu tops quarterly revenue estimates",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-baidu-tops-quarterly-revenue-estimates-ce7e5cd9dd8cff22",
            "pub_date": "2026-02-27 00:15:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Rpt: Paypal and Stripe not currently in talks - Semafor reporter on X",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/rpt-paypal-and-stripe-not-currently-in-talks-semafor-reporter-on-x-ce7e5cd9dd8cf022",
            "pub_date": "2026-02-27 00:15:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yen reclaims some ground after BOJ leaves door open for near-term rate hikes",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/yen-reclaims-some-ground-after-boj-leaves-door-open-for-near-term-rate-hikes-ce7e5cd9dd8cf42d",
            "pub_date": "2026-02-27 00:15:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo, BNP Paribas near deal on European private credit tie-up - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apollo-bnp-paribas-near-deal-on-european-private-credit-tie-up-bloomberg-news-ce7e5cd9dd8cf423",
            "pub_date": "2026-02-27 00:10:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie shares jump on $14 billion UK power grid deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-shares-jump-on-14-billion-uk-power-grid-deal-ce7e5cd9dd8cf426",
            "pub_date": "2026-02-27 00:10:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mideast-Asia oil tanker cost exceeds $200,000 per day for first time since 2020",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mideast-asia-oil-tanker-cost-exceeds-200-000-per-day-for-first-time-since-2020-ce7e5cd9dd8cf520",
            "pub_date": "2026-02-27 00:10:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "YTL Corporation Berhad Reports Earnings Results for the Second Quarter and Six Months Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    YTL Corporation Berhad reported earnings results for the second quarter and six months ended December 31, 2025. For the second quarter, the company reported sales was MYR 7,586.62 million compared to MYR 8,058.89 million a year ago. Net income was MYR 438.03 million compared to MYR 580.01 million a year ago. Basic earnings per share from continuing operations was MYR 0.0386 compared to MYR 0.0526 a year ago. Diluted earnings per share from continuing operations was MYR 0.0362 compared to MYR 0.0517 a year ago.<br/>\rFor the six months, sales was MYR 15,228.09 million compared to MYR 15,832.83 million a year ago. Net income was MYR 784.51 million compared to MYR 913.72 million a year ago. Basic earnings per share from continuing operations was MYR 0.068 compared to MYR 0.0829 a year ago. Diluted earnings per share from continuing operations was MYR 0.0636 compared to MYR 0.0815 a year ago.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/ytl-corporation-berhad-reports-earnings-results-for-the-second-quarter-and-six-months-ended-december-ce7e5cd9dd8cf722",
            "pub_date": "2026-02-27 00:10:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Judge rejects Kenvue bid to dismiss Texas Attorney General's lawsuit over marketing of Tylenol, court order shows",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/judge-rejects-kenvue-bid-to-dismiss-texas-attorney-general-s-lawsuit-over-marketing-of-tylenol-cour-ce7e5cd9dd8cf726",
            "pub_date": "2026-02-27 00:10:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Press Metal Aluminium Holdings Berhad Reports Earnings Results for the Fourth Quarter Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Press Metal Aluminium Holdings Berhad reported earnings results for the fourth quarter ended December 31, 2025. For the fourth quarter, the company reported sales was MYR 4,037.1 million compared to MYR 3,560.01 million a year ago. Net income was MYR 592.14 million compared to MYR 449.53 million a year ago.</p><p>Basic earnings per share from continuing operations was MYR 0.0719 compared to MYR 0.0546 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/press-metal-aluminium-holdings-berhad-reports-earnings-results-for-the-fourth-quarter-ended-december-ce7e5cd9dd8dfe2c",
            "pub_date": "2026-02-27 00:10:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank 1Q Earnings Lifted by Personal Banking, Markets Growth -- Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Royal Bank of Canada's earnings rose in the first quarter as the lender saw growth in its retail banking business and capital markets operations. </p><!-- Article --><p>\n\n  The bank, the country's biggest by market value and one of the largest in North America by assets, joined its peers in Canada in turning in a stronger-than-expected profit with gains across most business segments. This came despite elevated loan-loss provisions and continued economic uncertainty with trade tensions still high globally. </p><p>\n\n  Royal Bank's net income rose to 5.79 billion Canadian dollars (US$4.23 billion), or C$4.03 a share, for the three months to Jan. 31, from C$5.13 billion, or C$3.54, a year earlier. Excluding certain items, adjusted per-share earnings rose to C$4.08 in the first quarter, topping the C$3.85 expected by analysts polled by FactSet. </p><p>\n\n  Total revenue rose 7.3% to C$17.96 billion, while analysts were expecting C$17.5 billion. The result was buoyed by record capital markets revenue for the quarter, asset growth in its wealth management arm, and revenue growth of 9% for personal banking and roughly 4% for commercial banking. </p><p>\n\n  The Toronto-based lender's return on equity, a measure of profitability closely watched by analysts, expanded by 0.8 percentage point on last year to 17.6%. </p><p>\n\n  Household spending in Canada has remained relatively resilient despite an elevated unemployment rate and the hit to parts of the economy from the Trump administration's approach to trade policy and use of tariffs. Still, the housing market has softened in recent months and economists have warned of possible stresses on households as homeowners renew mortgages at higher interest rates. Business spending also has been relatively subdued, particularly in industries exposed to the shift toward protectionist trade policies by the U.S., even as equity markets in both Canada and the U.S. notched record highs. </p><p>\n\n  Royal Bank in a letter to shareholders said it expects economic growth to remain positive across most advanced economies despite trade uncertainties. Canada's economy has shown signs of improvement in recent months and the jobless rate has edged lower, and the bank forecasts modest growth in the first half of the year after what was likely a flat final quarter of 2025. </p><p>\n\n  The bank, like many of its peers, projects the Bank of Canada will leave its policy interest rate steady through 2026 and it isn't anticipating tariffs imposed by the U.S. on Canadian goods to rise further, though the existing trade pact between Canada, the U.S. and Mexico is up for renegotiation this year. That backdrop, executives said, is expected to mean mortgage growth in Canada is modest this year given affordability challenges, economic uncertainty, and a pullback Canadian immigration. </p><p>\n\n  Royal Bank's allowance for credit losses on performing loans was steady on the prior quarter, but the allowance on performing loans was increased. </p><p>\n\n  Its provision for credit losses increased C$40 million year-over-year to C$1.09 billion, and was C$83 million higher than a quarter earlier. The result was above the C$1.06 billion analysts were looking for the bank to set aside against the risk of loan losses. </p><p>\n\n  Stephen Boland, an analyst at Raymond James in Toronto, said it was a solid quarter for Royal Bank that was again supported by markets-facing operations. He said there was a notable rise in gross impaired loans for the three months after trending lower in recent quarters, but said it wasn't overly concerning. Gross impaired loans as a percentage of loans and acceptances widened to 0.86% in the latest quarter, from 0.8% a quarter earlier and 0.78% in the first quarter of fiscal 2025. </p><p>\n\n  The bank's shares fell in early trading, underperforming the broader market in Canada, declining 1.9% to narrow the gain over the last three months to just over 8%. </p><p>\n\n  Like each of Canada's other big banks, Royal Bank sits on a strong capital position that has allowed it to continue buying back shares and a quarter earlier supported a lift in its dividend. </p><p>\n\n  Royal Bank's common equity Tier 1 ratio stood at 13.7% at the end of January, up 0.5 percentage point from the same quarter last year. That remains well above the at least 11.5% of risk-weighted assets that Canada's banking regulator requires from the big lenders. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1103ET</p></div>",
            "link": "https://hk.marketscreener.com/news/royal-bank-1q-earnings-lifted-by-personal-banking-markets-growth-update-ce7e5cd9dd8df02d",
            "pub_date": "2026-02-27 00:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Google rolls out Nano Banana 2 after viral success of AI image generation tool",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Google on Thursday unveiled a successor to its viral Nano Banana image generation model, touting faster performance as the search-engine behemoth pushes to attract more users to its AI tools.</p><p>\n              The model, called Nano Banana 2, is being rolled out across products, including the Gemini app, AI Mode and Lens features on Search, and Flow, its AI-powered video tool, the Alphabet-owned company said.</p><!-- Article --><p>\n              The launch is Google's latest in a series of moves that have propelled the company to the forefront of the AI race, helping it better compete with OpenAI's ChatGPT after suffering a string of embarrassments initially. The success has fueled a 47% surge in its stock in the past six months.</p><p>\n              Google rolled out the Nano Banana AI image editor in August, which quickly became a viral sensation, attracting 13 million first-time users to the Gemini app in just four days in September. By mid-October, it had generated more than 5 billion images. </p><p>\n              The tech giant followed that with the release of the upgraded Nano Banana Pro in November. </p><p>\n              Nano Banana 2 leans on Gemini's faster and cheaper models known as Flash, which allows quicker image generation and editing, Google said, adding that it also has better instruction-following capabilities and delivers sharper details. </p><p>\n              In November, Google released its Gemini 3 AI model, whose success prompted rival OpenAI to issue an internal \"code red\" to push teams to accelerate development.</p><p>\n              Gemini 3 has significantly boosted user engagement, helping the Gemini app capture more than 750 million monthly active users at the end of December. </p><p></p><p> (Reporting by Deborah Sophia in Bengaluru; Editing by Leroy Leo)</p></div>",
            "link": "https://hk.marketscreener.com/news/google-rolls-out-nano-banana-2-after-viral-success-of-ai-image-generation-tool-ce7e5cd9dd8df020",
            "pub_date": "2026-02-27 00:10:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Power Corporation of Canada authorizes a Buyback Plan.",
            "description": "<div class=\"txt-s4 article-text\"><p>The Board of Directors of Power Corporation of Canada has authorized a buyback plan on February 26, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/power-corporation-of-canada-authorizes-a-buyback-plan-ce7e5cd9dd8df123",
            "pub_date": "2026-02-27 00:10:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ebay slashes 6% of workforce as e-commerce firm realigns operations",
            "description": "<div class=\"txt-s4 article-text\"><p>Ebay said on Thursday it is cutting about 800 jobs, or roughly 6% of its full-time workforce, as the e-commerce company moves to streamline operations and align staffing with its strategic priorities.</p><p>\n              \"We are taking steps to reinvest across our business and align our structure with our strategic priorities, which will affect certain roles across our workforce,\" the company said.         Here are some details:</p><!-- Article -->\n             \n                                                        * EBay will cut about 800 jobs, or 6% of its full-timeworkforce, as part of a restructuring aimed at aligning staffingwith long-term strategic priorities.    * The layoffs follow eBay's $1.2 billion acquisition ofDepop, announced last week, as the firm doubles down onsecondhand fashion and Gen Z-focused platforms.    * This is the third round of layoffs since 2023. The companycut about 1,000 roles (9%) in early 2024, citing labor costsoutpacing growth, and about 500 roles (4%) in early 2023, due toa slowdown in consumer spending post pandemic.<p></p><p>\n              (Reporting by Kritika Lamba; Editing by Leroy Leo)</p></div>",
            "link": "https://hk.marketscreener.com/news/ebay-slashes-6-of-workforce-as-e-commerce-firm-realigns-operations-ce7e5cd9dd8df122",
            "pub_date": "2026-02-27 00:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "LSEG CEO says no intentions to conduct disposals at this point - media call",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lseg-ceo-says-no-intentions-to-conduct-disposals-at-this-point-media-call-ce7e5cd9dd8df124",
            "pub_date": "2026-02-27 00:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Powerchip Semiconductor Manufacturing Corp. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Powerchip Semiconductor Manufacturing Corp. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was TWD 46,730.11 million compared to TWD 44,725.71 million a year ago.</p><p>Net loss was TWD 7,812.66 million compared to TWD 6,777.3 million a year ago. Basic loss per share from continuing operations was TWD 1.86 compared to TWD 1.64 a year ago. Diluted loss per share from continuing operations was TWD 1.86 compared to TWD 1.64 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/powerchip-semiconductor-manufacturing-corp-reports-earnings-results-for-the-full-year-ended-decembe-ce7e5cd9dd8df72c",
            "pub_date": "2026-02-27 00:05:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Germany's Merz says challenges remain as he concludes inaugural China trip",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/germany-s-merz-says-challenges-remain-as-he-concludes-inaugural-china-trip-ce7e5cd9dd8df721",
            "pub_date": "2026-02-27 00:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Greece's OTE quarterly earnings rise 2.3% on mobile and home fibre broadband growth",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/greece-s-ote-quarterly-earnings-rise-2-3-on-mobile-and-home-fibre-broadband-growth-ce7e5cd9dd8df724",
            "pub_date": "2026-02-27 00:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BeOne Medicines AG Provides Earnings Guidance for the Year 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>BeOne Medicines AG provided earnings guidance for the year 2026. For the year, the company expects total revenue of $6.2 billion - $6.4 billion, and GAAP operating income of $700 million - $800 million.</p></div>",
            "link": "https://hk.marketscreener.com/news/beone-medicines-ag-provides-earnings-guidance-for-the-year-2026-ce7e5cd9dd8aff26",
            "pub_date": "2026-02-27 00:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asia's ethanol targets and recent developments",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asia-s-ethanol-targets-and-recent-developments-ce7e5cd9dd8af02d",
            "pub_date": "2026-02-27 00:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kotex®? Launches New Pad and Liner Portfolio",
            "description": "<div class=\"txt-s4 article-text\"><p>Kotex®? unveiled a completely reimagined lineup of pads and liners to address the staggering fact that 82% of women regularly feel frustrated by today's period products. This complete portfolio overhaul is bringing innovation to the category to support women's bodies, lifestyles, and evolving needs.</p><p>Each new Kotex pad is powered by Gravity?? Core technology, which rapidly pulls blood to the bottom of the pad, to help women feel clean, dry, and protected. Gravity??</p><!-- Article --><p>Core is a part of the brand's unique 5X System with LeakShield??, which delivers breathability, odor control, dryness, fit, and reliable leak protection. The new portfolio includes: BioCare Ultra Thin Pads - Features a proprietary pH Proactive system that helps optimize pH levels in the pad and help defend against odor and irritants. Available in Regular, Heavy and Night Defense??</p><p>Ultra Thin pads. Bamboo Ultra Thin Pads - Features an ultra-soft, viscose top layer made from organically grown bamboo that delivers gentle comfort while maintaining powerful protection. Kotex Bamboo is dermatologist tested, made without fragrance and free of synthetic pesticides.</p><p>Available in Regular, Heavy, and Night Defense?? Ultra thin pads. Ultra Thin Pads - Featuring new Gravity??</p><p>Core technology and designed for women who want powerful protection that helps them feel fresh, dry and protected. Available in Regular, Heavy the Extra Heavy and Night Defense??Ultra Thin pads. Teen Ultra Thin Pads - Designed and sized specifically for teens to help create a secure fit by eliminating gaps to prevent leaks Available in Heavy and Night Defense??</p><p>ultra Thin pads. Night Defense?? - New Kotex Extra Heavy Overnight pads are now designed with revolutionary side guards and a raised back bumper to help prevent back and side leaks.</p><p>Available in Ultra Thin Pads. Liners: Kotex is expanding to new varieties including BioCare and Bamboo. In addition to the new products, Kotex is introducing a bold new brand identity.</p><p>The brand redesign brings Kotex to the forefront as a nod to the brand's heritage and leverages its iconic U as a te Telegraphic beacon of product benefits. The bold, modern, and unapologetic design was inspired by the beauty aisle, with confident visuals that make period care look as powerful as it should feel. The new Kotex pads and liners are now available beginning at Target.com, Walmart.com and Amazon.com, and on shelf at retailers nationwide in the Spring.</p></div>",
            "link": "https://hk.marketscreener.com/news/kotex-launches-new-pad-and-liner-portfolio-ce7e5cd9dd8af32c",
            "pub_date": "2026-02-27 00:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie shares jump on $14 billion UK power grid deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-shares-jump-on-14-billion-uk-power-grid-deal-ce7e5cd9dd8af323",
            "pub_date": "2026-02-27 00:05:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinjiang Daqo New Energy Co.,Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Xinjiang Daqo New Energy Co.,Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 4,838.53 million compared to CNY 7,410.52 million a year ago. Net loss was CNY 1,129.17 million compared to CNY 2,718.13 million a year ago.</p><p>Basic loss per share from continuing operations was CNY 0.53 compared to CNY 1.27 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/xinjiang-daqo-new-energy-co-ltd-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9dd8af422",
            "pub_date": "2026-02-27 00:05:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Prysmian ready for large acquisitions, sees perimeter change before 2028, CEO says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/prysmian-ready-for-large-acquisitions-sees-perimeter-change-before-2028-ceo-says-ce7e5cd9dd8af427",
            "pub_date": "2026-02-27 00:05:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Iran enters third round of nuclear talks with 'seriousness and flexibility', spokesperson tells Press TV",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iran-enters-third-round-of-nuclear-talks-with-seriousness-and-flexibility-spokesperson-tells-pre-ce7e5cd9dd8af52d",
            "pub_date": "2026-02-27 00:00:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tenaga Nasional Berhad Reports Earnings Results for the Fourth Quarter and Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Tenaga Nasional Berhad reported earnings results for the fourth quarter and full year ended December 31, 2025. For the fourth quarter, the company reported sales was MYR 17,599.7 million compared to MYR 14,378.3 million a year ago. Net income was MYR 1,675.1 million compared to MYR 642.3 million a year ago. Basic earnings per share from continuing operations was MYR 0.2876 compared to MYR 0.1107 a year ago. Diluted earnings per share from continuing operations was MYR 0.2876 compared to MYR 0.1105 a year ago.<br/>\rFor the full year, sales was MYR 67,723.1 million compared to MYR 56,737.1 million a year ago. Net income was MYR 4,768.1 million compared to MYR 3,978.2 million a year ago. Basic earnings per share from continuing operations was MYR 0.8186 compared to MYR 0.6858 a year ago. Diluted earnings per share from continuing operations was MYR 0.8186 compared to MYR 0.6843 a year ago.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/tenaga-nasional-berhad-reports-earnings-results-for-the-fourth-quarter-and-full-year-ended-december-ce7e5cd9dd8af523",
            "pub_date": "2026-02-27 00:00:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chang Hwa Commercial Bank says 2025 net profit T$17.77 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chang-hwa-commercial-bank-says-2025-net-profit-t-17-77-bln-ce7e5cd9dd8af521",
            "pub_date": "2026-02-27 00:00:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "United Nova Tech prelim 2025 net loss at 574.3 million yuan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/united-nova-tech-prelim-2025-net-loss-at-574-3-million-yuan-ce7e5cd9dd8af525",
            "pub_date": "2026-02-27 00:00:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed Vice Chair for Supervision Bowman says bank regulators aiming for new Basel bank capital proposal by end of March",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/fed-vice-chair-for-supervision-bowman-says-bank-regulators-aiming-for-new-basel-bank-capital-proposa-ce7e5cd9dd8af621",
            "pub_date": "2026-02-27 00:00:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Brings Tough Demands to Iran Nuclear Talks -2-",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  0946 GMT - Zimbabwe's export restrictions on lithium will probably be more successful than the DRC's curbs on cobalt, at least in terms of encouraging local processing, says Freddie Brooks at BMI, a unit of Fitch Solutions. That's because of Zimbabwe's share of global lithium mine production, the commodities analyst says. At approximately 10%, Zimbabwe's share of production is high enough to make it difficult to replace in the lithium value chain, but not so high that export restrictions significantly inflate prices and trigger demand destruction downstream, as in the case of the DRC's 75% share of global cobalt mine production. \"In any case, processing facilities for lithium are already being built in Zimbabwe by Chinese companies, and lithium faces significantly lower substitution risks in the battery market compared to cobalt,\" Brooks says. (fabiana.negrinochoa@wsj.com) </p><p>\n\n  -- </p><!-- Article --><p>\n\n  Eni Had a Strong End to the Year -- Market Talk </p><p>\n\n  0938 GMT - Italian energy major Eni had a strong end to the year as net income beat consensus expectations by 25%, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. Quarterly production is also well ahead of market expectations, they add. While guidance is limited due to its upcoming capital markets day, Eni's capital spending outlook does look lower than anticipated, they say. This reflects the closure of an Indonesian joint venture by the middle of the year. Additionally, production looks set to continue growing, they add. Shares trade up 1.1% to 19.09 euros. (adam.whittaker@wsj.com) </p><p>\n\n  -- </p><p>\n\n  European Gas Holds Around 30 Euros With U.S.-Iran in Focus -- Market Talk </p><p>\n\n  0937 GMT - European natural-gas prices are hovering around 30 euros a megawatt-hour, supported by forecasts for milder weather and ample LNG supply. Still, gas storage across the European Union remains around 30% full--well below the five-year average of 47%--and is set to finish the heating season near or below 2022 levels, analysts say. The benchmark Dutch TTF contract is down 1.1% to 30.58 euros a megawatt hour. Investors are now closely watching U.S.-Iran talks as any escalation could threaten LNG flows through the Strait of Hormuz, though analysts consider this scenario unlikely. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  London's Miners Drop as Metal Prices Slide -- Market Talk </p><p>\n\n  0928 GMT - London's miners trade down as metal prices drop. In morning trade, New York gold futures are down 0.62% to $5,192.20 a troy ounce. Silver futures slide nearly 4.25% to $87.12 an ounce while LME three-month copper futures are down 0.4% to $13,247 a metric ton. While gold slips, it remains up more than 3.5% over the week as uncertainty around U.S. trade policy and geopolitical tensions with Iran remain. Silver and gold miner Fresnillo drops nearly 4%, while Hochschild Mining is down 1.5%. Copper miner Antofagasta trades 2.85% lower. Diversified miner Anglo American is down around 2.5% and Glencore drops 1.8%. (adam.whittaker@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Gold Slips but Remains Above $5,100 as Markets Focus on U.S.-Iran Talks -- Market Talk </p><p>\n\n  0844 GMT - Gold prices slipped in early trading but remain above $5,100 a troy ounce as investors look ahead to U.S.-Iran talks later on Thursday. New York futures fall 0.7% to $5,191.60 an ounce, with gains tempered by concerns that U.S. interest rates could remain on hold for some time. Still, the metal is up more than 3.5% on the week, supported by renewed uncertainty around U.S. trade policy and geopolitical tensions with Iran. \"Any escalation in tensions involving Iran is likely to add further support and reinforce gold's role as a hedge against shocks,\" analysts at ING say. \"At the same time, the structural drivers behind gold's earlier rally remain firmly in place.\" (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Brent Spreads Signal Well-Supplied Market </p><p>\n\n  0857GMT - Price differences between near-term and later Brent crude contracts have weakened recently, suggesting the physical market is becoming increasingly well supplied. Kazakh oil exports through the Caspian Pipeline Consortium terminal are returning to normal after earlier disruptions. Meanwhile, floating storage is shrinking, suggesting that previously stranded, sanctioned barrels are now finding buyers, according to analysts at ING. \"If we are to see de-escalation between the U.S. and Iran, it should allow weaker fundamentals to feed through to a lower flat price-particularly if OPEC+ resumes supply increases from April, which we believe they will agree to this weekend,\" they say. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Oil Inches Higher Ahead of U.S.-Iran Talks </p><p>\n\n  0830 GMT - Oil prices edge higher ahead of a third round of nuclear talks between the U.S. and Iran later on Thursday. In early trade, Brent crude is up 0.3% to $70.94 a barrel, while WTI rises 0.3% to $65.35 a barrel. \"A constructive resolution would likely prompt the market to gradually unwind as much as a $10/bbl risk premium, which we believe is currently priced in,\" analysts at ING say. \"If talks break down, the upside risk remains, but the market may hold off on a full reaction until the scale of potential U.S. action against Iran becomes clearer.\" Meanwhile, the latest EIA data showed U.S. crude oil inventories rose by 16 million barrels last week, the largest weekly build since February 2023. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Comex Gold Futures' Bullish Technical Setup Remains Intact, Chart Shows -- Market Talk </p><p>\n\n  0621 GMT - Comex gold futures' bullish technical setup remains intact, RHB Retail Research's Joseph Chai says in a research report. The fresh bullish candlestick pattern on the daily chart suggests selling pressure has tapered, the analyst says. Since gold \"bulls have returned to the driver's seat,\" the precious metal could resume the bullish trajectory toward resistance at $5,500/oz, Chai says. A bullish breakout above this level would extend its uptrend toward $6,000/oz. Also, 20- and 50-day simple moving averages continue moving upward, lending support for bullish technical setup, the analyst adds. Spot gold is 0.6% higher at $5,196.37/oz. (ronnie.harui@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Copper Edges Lower Amid Profit-Taking -- Market Talk </p><p>\n\n  0238 GMT - Copper edges lower in early Asian trading, with the three-month LME copper contract 0.15% lower at $13302.00 a ton. Investors appear to be taking profit after the metal's price reached a two-month high. Buying in China has remained slow after the Lunar New Year holiday, as some investors have hesitated due to high prices, ANZ Research analysts say. Investors are closely watching the developments related to U.S. tariffs. (tracy.qu@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Iron Ore Rises on Improved Sentiment From Policy Support -- Market Talk </p><p>\n\n  0235 GMT - Iron ore rises in early Asian trade as sentiment improves on reports of new Chinese policy support, ANZ Research analysts say in a note. China's National Development and Reform Commission will reportedly receive new funding for urban renewal projects nationwide. Supply side are also supporting prices, as steelmakers in Northern China have been required to cut blast furnace output by 30% during the annual plenary sessions of the National People's Congress, which begin next Wednesday. \"This lifted steel prices, supporting higher margins for steel mills,\" ANZ adds. The most-traded contract on the Dalian Commodity Exchange is up 0.2% at CNY750.00 a ton.(jason.chau@wsj.com) </p><br/><p>\n  Write to Barcelona Editors at barcelonaeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1047ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-brings-tough-demands-to-iran-nuclear-talks-2-ce7e5cd9dd8af723",
            "pub_date": "2026-02-27 00:00:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. Brings Tough Demands to Iran Nuclear Talks -- Commodities Roundup",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  MARKET MOVEMENTS: </p><p>\n\n  --Brent crude oil is down 0.1% to $70.59 a barrel. </p><!-- Article --><p>\n\n  --European benchmark gas is down 0.6% at 30.75 euros a megawatt hour. </p><p>\n\n  --Gold futures are down 0.8% to $5,183.90 a troy ounce. </p><p>\n\n  --LME three-month copper futures are down 0.6% to $13,275 a metric ton. </p><br/><p>\n  TOP STORY: </p><p>\n\n  U.S. Brings Tough Demands to Iran Nuclear Talks </p><p>\n\n  GENEVA-U.S. envoys Steve Witkoff and Jared Kushner are entering a crucial round of talks over Iran's nuclear program Thursday with tough demands, under pressure from hawks in the administration and Republicans in Congress not to agree to a deal that could be criticized as soft. </p><p>\n\n  In the talks, now under way in Geneva, the U.S. negotiators were expected to make clear Iran must dismantle its three main nuclear sites-at Fordow, Natanz and Isfahan-and deliver all of its remaining enriched uranium to the U.S., officials said. </p><br/><p>\n  OTHER STORIES: </p><p>\n\n  Big Oil Is Urging Trump to Stop Battle on Offshore Wind </p><p>\n\n  Big Oil has an unusual ask for President Trump : Please stop your battle against offshore wind. </p><p>\n\n  Oil lobbyists have made the case to Trump officials in recent weeks that his attacks on wind farms off the U.S. coast risk derailing congressional efforts to speed up permits for energy projects, according to people familiar with the matter. The oil-and-gas industry fears missing out on a huge opportunity to ship more of its products to markets via new pipelines. </p><p>\n\n  -- </p><p>\n\n  Canadian Utilities Swings to 4Q Loss on Noncash Impairments, Write-Offs </p><p>\n\n  Canadian Utilities swung to a loss in the fourth quarter as noncash impairments and write-offs related to its Alberta Renewables portfolio dragged performance. </p><p>\n\n  The diversified energy and utilities company on Thursday logged a net loss of 328 million Canadian dollars ($239.8 million), or C$1.28 a share, compared with a profit of C$164 million, or C$0.53 a share, in the comparable quarter a year ago. </p><p>\n\n  -- </p><p>\n\n  EDP Posts Higher Net Profit on Renewables Recovery </p><p>\n\n  Portugal's EDP reported a jump in 2025 net profit, aided by higher earnings from its renewables arm and a recovery of its wind and solar businesses. </p><p>\n\n  The energy company said it made a full-year net profit of 1.15 billion euros ($1.36 billion), up 44% compared with 2024. The company said the increase reflected a bigger contribution from separately listed EDP Renovaveis. </p><p>\n\n  -- </p><p>\n\n  How to Build the World's Most Expensive Nuclear Power Plant </p><p>\n\n  \"We are now entering a new phase in the golden age of nuclear,\" declared Michael Shanks, a U.K. energy minister, as he recently talked up the country's plans to attract private investment in new reactors. </p><p>\n\n  His parade was swiftly dampened. Last week, Britain's first new nuclear plant in three decades cemented its status as the most expensive on record anywhere. The risk is that the U.K.'s contribution to the golden age is a cautionary tale about the cost of these megaprojects as the U.S. advances its own nuclear buildout. </p><p>\n\n  -- </p><p>\n\n  Eni Earnings Rise on Higher Production </p><p>\n\n  Italian energy major Eni reported a rise in fourth-quarter earnings despite lower oil prices as it benefited from higher production and cost efficiencies. </p><p>\n\n  The integrated oil-and-gas company said Thursday that adjusted net profit--the company's preferred metric--jumped 35% to 1.2 billion euros ($1.42 billion) compared with the same period a year earlier. This came ahead of the 960 million euros analysts had expected according to a company-compiled consensus. </p><p>\n\n  -- </p><p>\n\n  Karoon Prefers to Be Operator of South Santos Basin Drill Campaign </p><p>\n\n  SYDNEY--Karoon Energy prefers to be the operator of a mooted exploration campaign in the deepwater Santos Basin of Brazil, but is prepared to hand on that responsibility if it finds a strong partner with the right skillset. </p><p>\n\n  That is the view of Chief Executive Carri Lockhart after Karoon recently began an effort to test the interest of companies in taking equity in licenses that it wholly owns in the southern area of the basin where the ocean is nearly a mile deep. </p><p>\n\n  -- </p><p>\n\n  Cold Is Winning the Coffee Wars at Starbucks </p><p>\n\n  Starbucks's business is going cold. Around two-thirds of the chain's U.S. orders are now iced, up from 37% in 2013. </p><p>\n\n  The trend extends beyond the U.S., with 60% of the chain's global sales represented by cold espressos, fruity Refreshers, iced matcha and chilled tea lattes. </p><p>\n\n  -- </p><p>\n\n  BlueScope Says $11 Billion Steel Dynamics, SGH Takeover Offer Insufficient; Open to Talks </p><p>\n\n  BlueScope Steel said a revised takeover offer from U.S. steelmaker Steel Dynamics and Australian conglomerate SGH isn't sufficient for directors to recommend a deal to shareholders, but that it is open to talks if the companies are able to address some of its concerns. </p><p>\n\n  Last week, Steel Dynamics and SGH submitted a sweetened offer for Australia's BlueScope that values its equity at roughly US$11 billion, and said they wouldn't raise it again unless a rival bidder emerges. </p><br/><p>\n  MARKET TALKS: </p><p>\n\n  Soybean Futures Higher But Brazilian Harvest Eyed -- Market Talk </p><p>\n\n  0919 ET - Soybean futures on the CBOT are up premarket, but analysts keeping a close eye on how the Brazilian harvest is progressing. With a record amount of soybeans expected from Brazil, gains seen in futures may be hitting a short-term ceiling. \"It would be unusual for the biggest soybean harvest the world has ever seen (Brazil) to not slow down price gains in the beans at some point,\" says Doug Bergman of RCM Alternatives in a note. Bergman adds that soybean futures have likely priced in optimism surrounding demand from renewable fuels. Soybeans are up 0.5%, while corn rises 0.5% and wheat climbs 0.2%. (kirk.maltais@wsj.com) </p><p>\n\n  -- </p><p>\n\n  U.S. Natural Gas Futures Fall Ahead of Inventory Data -- Market Talk </p><p>\n\n  0911 ET - U.S. natural gas futures are lower awaiting weekly storage data due at 10:30 a.m. ET, while weather forecasts point to warmer weather for the first half of March. The milder outlook is pressuring futures prices through the summer \"as we are more likely to exit winter with above-normal amounts of gas in storage,\" Tradition Energy's Gary Cunningham says in a note. \"Domestic gas production is back to firing on all cylinders and imports from Canada are returning to normal,\" he adds. Nymex gas is down 3% at $2.782/mmBtu as the April contract debuts at the front of the curve.(anthony.harrup@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Oil Futures Move Lower As U.S.-Iran Talks Held </p><p>\n\n  0901 ET - Oil futures lose ground as U.S. and Iranian officials hold talks in Geneva on Iran's nuclear program. \"Geo-risk will continue to rise and fall in response to latest U.S./Iran headlines, but global oil supplies are increasing appreciably as floating shadow inventories are moving into more transparent regions of the world,\" Ritterbusch and Associates says in a note. The energy complex is also losing support from diesel futures \"as the heating season winds down amid a broad-based warming trend across the U.S. during the next couple of weeks,\" the firm adds. WTI is down 1.7% at $64.28 a barrel and Brent is off 1.4% at $69.84 a barrel. (anthony.harrup@wsj.com) </p><p>\n\n  -- </p><p>\n\n  EU's Buy-European Push Could Direct Public Funding to non-European Low-Carbon Steel, Lobby Group Says -- Market Talk </p><p>\n\n  1215 GMT - Europe's steel lobby group says that the bloc's current plan to boost public backing for European companies will leave the local steel sector behind. A leaked draft of the European Commission's Industrial Accelerator Act--set to be presented on March 4--requires a share of at least 25% of steel in public procurement to be low-carbon, but it is not clear whether low-carbon steel will count as a strategic product that must be produced in Europe, Eurofer says. \"In today's turbulent geopolitical context, it seems unthinkable that the steel industry is not being defined as strategic in the package,\" the group's director general, Axel Eggert, says. \"This goes hand in hand with strengthening Europe's autonomy, which means applying robust \"Made in Europe\" requirements,\" he says. (edith.hancock@wsj.com) </p><p>\n\n  -- </p><p>\n\n  European Gas Prices Vulnerable to Oil Rally and Gulf Risks -- Market Talk </p><p>\n\n  1017 GMT - Geopolitical risks that push oil prices higher also create upside for gas, as some long-term LNG and pipeline supplies to Europe are linked to crude, Rabobank analysts say. Key triggers include a sharp crude rally boosting oil-indexed LNG or Iranian attacks on Gulf energy infrastructure-particularly Qatari LNG. A partial disruption through the Strait of Hormuz could lift TTF toward 50 euros a megawatt hour,while full impairment of key infrastructure could send it above 100 euros, though such extreme scenarios are seen as low probability. A more limited Middle East flare-up could instead add 5 euros-10 euros a megawatt hour to TTF. Rabobank's base-case outlook remains 26 euros for 2Q and 29 euros for 2026 as a whole, but any escalation affecting oil-linked contracts could push prices into the 40s through spring and summer. (giulia.petroni@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Palm Oil Ends Lower Amid Weak Demand -- Market Talk </p><p>\n\n  1012 GMT - Palm oil ended lower amid weak demand. Malaysia's palm oil exports during the Feb. 1-25 period are estimated to be 16% lower on month at 922,649 metric tons, cargo surveyor AmSpec Agri Malaysia said Wednesday. However, expectations of a sharper drop in Malaysian production this month could help tighten supplies and ease elevated inventories, Kenanga Futures says in a research note. Several Malaysian palm plantations reported earnings this week, with KL Kepong expecting CPO prices to range between 4,000-4,300 ringgit/ton over January-March. The Bursa Malaysia Derivatives contract for May delivery ended 48 ringgit lower at 4,005 ringgit a ton. (sherry.qin@wsj.com) </p><p>\n\n  -- </p><p>\n\n  Zimbabwe Lithium Export Curbs Won't Hit the Same as DRC's on Cobalt -- Market Talk </p><p>\n\n  (MORE TO FOLLOW) Dow Jones Newswires</p><p>\n\n  02-26-26 1047ET</p></div>",
            "link": "https://hk.marketscreener.com/news/u-s-brings-tough-demands-to-iran-nuclear-talks-commodities-roundup-ce7e5cd9dd8af727",
            "pub_date": "2026-02-27 00:00:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apple in Talks With Banks to Launch Apple Pay in India",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apple-in-talks-with-banks-to-launch-apple-pay-in-india-ce7e5cd9dd8bfe20",
            "pub_date": "2026-02-27 00:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly reports additional data on weight-loss pill from diabetes trial",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Eli Lilly on Thursday released new data from a head-to-head trial of its experimental weight-loss pill, orforglipron, and rival Novo Nordisk's oral semaglutide in diabetes patients, giving a more detailed picture of the side effects.</p>    * About 58% of patients who were on a 36-milligram dose ofLilly's drug in the study reported mild-to-moderate sideeffects, including nausea, diarrhea and vomiting, compared with45% of those treated with the 14 mg dose of oral semaglutide    * Novo sells oral semaglutide under the brand name Rybelsusfor patients with type 2 diabetes to control blood sugar    * About 10% of patients who received 36 mg orforgliprondiscontinued treatment due to side effects, compared with 5% ofthose treated with 14 mg Rybelsus           * Those who received orforglipron also reported an averageincrease in pulse rate    * Initial results announced in September showed 36 mgorforglipron lowered average blood glucose levels in patients by2.2%, compared with 1.4% on 14 mg Rybelsus    * Patients who took 36 mg orforglipron lost an average of8.9 kg (19.7 lb), or 9.2%, of their weight, compared with 5 kg(11 lb), or 5.3%, on 14 mg Rybelsus    * \"We think that the totality of the profile here is atrade-off that patients will be very happy to make because theyare getting better glycemic control and better weight loss aswell as no restriction on dosing with food and water,\" saidKenneth Custer, president of Lilly Cardiometabolic Health    * Lilly's orforglipron, like Rybelsus, mimics theappetite-suppressing GLP-1 hormone targeted by the company'sblockbuster injection tirzepatide, sold as Mounjaro andZepbound <p></p><p>\n               (Reporting by Mariam Sunny in Bengaluru; Editing by Anil D'Silva)</p></div>",
            "link": "https://hk.marketscreener.com/news/eli-lilly-reports-additional-data-on-weight-loss-pill-from-diabetes-trial-ce7e5cd9dd8bfe27",
            "pub_date": "2026-02-27 00:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China stocks end lower as traders hold off before key policy meeting",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-stocks-end-lower-as-traders-hold-off-before-key-policy-meeting-ce7e5cd9dd8bff22",
            "pub_date": "2026-02-27 00:00:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HKEX Sees Diverse IPOs Amid AI Bubble Risk",
            "description": "<div class=\"txt-s4 article-text\"><div id=\"Zonebourse_Article_Video\"><div class=\"vsly-player\" data-template=\"PVaRF_MsC2XGj\" id=\"HZ4qjydM0xp\" style=\"background:#ddd;padding-top:calc(56.25% + 24px);font-size:0;position:relative;overflow:hidden;width:100%;\"></div></div>\n                        HKEX chief executive Bonnie Chan says the Hong Kong exchange has attracted a diverse range of IPO applicants, from different sectors and geographies. She tells Bloomberg's Stephen Engle that this will help the exchange weather uncertainty around the AI sector.<p><span class=\"js-l-obf link link--blue\" data-lobf=\"v4fox4ar=NTQyQxJmBMKwpP7nl8C=BbKwgTpvkfAwLuu\" data-tobf=\"blank\" onclick=\"gaEvent('Out', 'mtnewswires', '52534285');\">Bloomberg videos</span>, provided by MT Newswires</p></div>",
            "link": "https://hk.marketscreener.com/news/hkex-sees-diverse-ipos-amid-ai-bubble-risk-ce7e5cd9dd8bff21",
            "pub_date": "2026-02-27 00:00:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PepsiCo Launches in the UK",
            "description": "<div class=\"txt-s4 article-text\"><p>PepsiCo announced that it has officially landed in the UK. Born online and backed by pop culture, poppi is shaking up the soft drinks aisle with bold fruity flavours, vibrant design and main character energy in every sip. poppi delivers full flavour fizz that's made with ingredients you can love; low in sugar, low in calories and high in fibre - it's pure feel good-fizz that tastes as good as it looks.</p><p>poppi is launching with five delicious flavours including Strawberry Lemon, Raspberry Rose, Lemon Lime, Wild Berry and Orange. Founded in 2016 by husband-and-wife duo Allison and Stephen Ellsworth, Allison wanted to ditch soda, but not the taste, so she started mixing fruit juice, apple cider vinegar, and sparkling water in her Texas kitchen to create a better kind of soda. Fast-forward to 2026, and poppi is here to shake up the UK and revolutionise soda for the next generation.</p></div>",
            "link": "https://hk.marketscreener.com/news/pepsico-launches-in-the-uk-ce7e5cd9dd8bf220",
            "pub_date": "2026-02-26 23:45:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}