{
    "data": [
        {
            "title": "Danske Commodities signs 10-year deal for British battery storage",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/danske-commodities-signs-10-year-deal-for-british-battery-storage-ce7e5cdeda8df42d",
            "pub_date": "2026-02-27 15:15:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan Shares End Week in Green Amid Upbeat Output Data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/japan-shares-end-week-in-green-amid-upbeat-output-data-ce7e5cdeda8df422",
            "pub_date": "2026-02-27 15:15:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Thailand records current account surplus of $724 million in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/thailand-records-current-account-surplus-of-724-million-in-january-ce7e5cdeda8df522",
            "pub_date": "2026-02-27 15:15:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "B.Duck Semk Enters Strategic Cooperation with Haers Vacuum Containers; Shares Slip 3%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/b-duck-semk-enters-strategic-cooperation-with-haers-vacuum-containers-shares-slip-3-ce7e5cdeda8afe2d",
            "pub_date": "2026-02-27 15:15:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India focused on getting best trade deal with US, Indian trade minister says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-focused-on-getting-best-trade-deal-with-us-indian-trade-minister-says-ce7e5cdeda8afe22",
            "pub_date": "2026-02-27 15:15:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eimund Nygaard Proposed as New DNB Chairman",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    DNB's nomination committee has proposed Eimund Nygaard as the new chairman of the bank's board.\n<br/><br/>\n\nIf shareholders support the committee's recommendation, the appointment will be voted on at the annual general meeting on April 21.\n<br/><br/>\n\nThe current chair, Olaug Svarva, is stepping down after eight years in the role. Nygaard, who served as CEO of Lyse for 27 years, is being highlighted for his extensive experience leading a complex and regulated company.\n\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/eimund-nygaard-proposed-as-new-dnb-chairman-ce7e5cdeda8af122",
            "pub_date": "2026-02-27 15:15:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Singapore's Export, Import Price Indices Fall in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/singapore-s-export-import-price-indices-fall-in-january-ce7e5cdeda8af327",
            "pub_date": "2026-02-27 15:10:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ono Pharmaceutical Co Ltd - Announcement concerning transfer of distribution sales and termination of co-promotion for SGLT2 inhibitor Forxiga 5 mg 10 mg in Japan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ono-pharmaceutical-co-ltd-announcement-concerning-transfer-of-distribution-sales-and-termination-o-ce7e5cdeda8af627",
            "pub_date": "2026-02-27 15:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sony Rides Japan's Precision-Built Wave",
            "description": "<div class=\"txt-s4 article-text article-text--clear\"><p>Japan’s electronics market reached 111.2 billion US dollars in 2023, rose to USD 116.2bn in 2024, and is projected to hit USD 162.7bn by 2032 at a 4.3% CAGR. This steady climb feels like a testament to a nation that has long married precision engineering with craftsmanship, a reputation that turns heads across shelves of consumer electronics.</p><p>\nThe industry’s spectrum, from smartphones and wearables to home appliances, audio-visual devices, and smart-home ecosystems, leans on that cultural insistence on meticulous design and innovation.</p><!-- Article --><p>\nToday’s trends deliver momentum while narrating smart devices, IoT integration, robotics, and next-generation audiovisual experiences that reshape daily life. Semiconductors dominate as the beating heart of automation, mobility, and industrial systems, yet consumer segments race ahead because of rising demand for connected living.</p><p>\nJapan’s strengths in advanced manufacturing, R&amp;D intensity, and cross-industry collaboration keep leaders such as Sony, Panasonic, Sharp, and Toshiba relevant, their names synonymous with quality and technological leadership.</p><p>\nLooking forward, domestic demand, AI-enabled devices, and Society 5.0 policies suggest the sector is expanding into smarter, integrated ecosystems. The country’s tradition of craftsmanship remains a competitive moat, reinforcing trust and premium positioning, while innovation and policy support ensure Japan stays a guiding light in the global consumer electronics story.</p><p>\nAmidst this evolving backdrop, Sony, founded in 1946, weaves entertainment, technology, and finance into a single narrative. Its Games &amp; Network Services craft worlds for PlayStation players, while Music and Movies orchestrate global hits. Electronics Products &amp; Solutions combine TVs, audio, cameras, and smartphones with Internet services, while Imaging &amp; Sensing Sensors power innovation. Finance and other ventures, from insurance to disc manufacturing, round out the story.</p><h2>\nPixels to profits</h2><p>\nAdding numbers to the tale: Across 9M 25, the group recorded revenue of JPY 9.4tn, which represented a decent 2.3% y/y uptick. Imaging &amp; Sensing Solutions provided momentum with stronger mobile image sensor shipments alongside favorable mix, while Music rode the continued swell of streaming, live events, and merchandising, and Game &amp; Network Services benefited from higher digital software and network services sales.</p><p>\nRiding this wave, operating income surged 21% y/y to JPY 1.3tn, lifting the operating margin by 210bp to 13.6%. The ripple effects reached net income, which climbed 13.1% y/y to JPY 961.7bn, and EPS, which rose to JPY 158.3 from JPY 139.2 a year earlier.</p><p>\nBuoyed by the sustained run, management refreshed its FY 25 outlook, projecting revenue of JPY 12.3tn, a 2.2% y/y rise, operating income of JPY 1.5tn, up 20.6% y/y, and net income of JPY 1.1tn, representing 5.9% y/y growth. Analysts will be watching whether this momentum can persist into later quarters.</p><h2>\nUptrend, upbeat</h2><p>\nInvestors are now watching a steady rally in the company's share price, which dropped 10.5%, nudging the market capitalization to JPY 19.6tn (USD 125.5bn). The firm is trading at a forward P/E of 17.4x, using 2026 earnings, in-line with the three-year average of 17.4x.</p><p>\nMarket watchers remain upbeat, tallying 20 'Buy' ratings and two 'Hold' calls, driving the average target price up to JPY 4,969.1, which implies a 50.9% upside from today's levels.</p><h2>\nBalancing act</h2><p>\nSony’s narrative remains compelling, with its diverse entertainment, sensing, and electronics businesses reinforcing the broader story of Japan’s precision-built comeback.</p><p>\nYet even as momentum hums, the plot thickens: shifting consumer tastes could temper demand for high-end gadgets, semiconductor bottlenecks may test supply discipline, and intense global competition pressures margins. Streaming and gaming also hinge on subscription sentiment, while regulatory scrutiny and geopolitical tensions continue to shadow cross-border operations.</p><p>\nThe tale of Sony’s resurgence will thus depend not only on its ability to stay creative and capital-efficient but also on navigating these quieter risks that could unsettle an otherwise steady climb.</p></div>",
            "link": "https://hk.marketscreener.com/news/sony-rides-japan-s-precision-built-wave-ce7e5cdeda8af721",
            "pub_date": "2026-02-27 15:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re Profit Slips on Lower Revenue",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Elena Vardon </p><br/><p>\n  Swiss Re reported an expected decline in fourth-quarter net profit on a softer top line. </p><!-- Article --><p>\n\n  The Zurich-based reinsurer said it made $717 million in net profit for the three months through Dec. 31, beating a $687 million company-compiled estimate but a fall from $1.05 billion reported in the comparable quarter the year prior. </p><p>\n\n  Insurance revenue for the quarter came in at $11.14 billion, down from $11.89 billion a year prior, and consensus of $11.24 billion. The group's investment result fell to $966 million from $1.10 billion, while analysts had penciled in $1.08 billion. </p><p>\n\n  The group maintained the $4.5 billion net profit target for 2026 it set out at the end of last year, adding that its life-and-health segment would contribute $1.7 billion. This compares with a $4.8 billion result for 2025, which it described on Friday as a record high  and said reflects disciplined underwriting, strong investment returns and low large loss activity beyond the first quarter. </p><p>\n\n  \"Having completed the comprehensive review of underperforming portfolios in L&amp;H Re, all three of our business units are positioned to deliver consistent results,\" Chief Executive Officer Andreas Berger said. Swiss Re has a large property-and-casualty business and a smaller corporate-solutions unit. </p><p>\n\n  The group intends to pay out a dividend of $8 a share for 2025--up around 9% on year--and buy back $1.5 billion of its own shares over the course of 2026. </p><br/><p>\n  Write to Elena Vardon at elena.vardon@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0159ET</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-profit-slips-on-lower-revenue-ce7e5cdeda8bf522",
            "pub_date": "2026-02-27 15:05:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India trade minister: India-U.S. joint statement says that should circumstances change, deal will be rebalanced",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-trade-minister-india-u-s-joint-statement-says-that-should-circumstances-change-deal-will-be-ce7e5cdeda8bf62d",
            "pub_date": "2026-02-27 15:05:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India trade minister: sanctity of the U.S. deal is both ways",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-trade-minister-sanctity-of-the-u-s-deal-is-both-ways-ce7e5cdeda88fe27",
            "pub_date": "2026-02-27 15:00:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UBS downgrades weighting on US equities to neutral",
            "description": "<div class=\"txt-s4 article-text\"><p>SINGAPORE, Feb 27 (Reuters) - UBS said on Friday it has cut its recommended allocation to U.S. equities to neutral, as the world's biggest stock market risks lagging behind while growth accelerates elsewhere.</p><p>\n              In a note, strategists Andrew Garthwaite and Marc el Koussa cited reasons such as the relatively lower sensitivity of U.S. corporate earnings to global growth, high valuations, the trend of funds diversifying outside of the United States and downside risks to the dollar, among other things.</p><!-- Article --><p>\n              \"The U.S. has the lowest operational leverage of any major region and thus historically underperforms if global growth accelerates to be above 3.5%,\" they said.</p><p>\n              UBS forecasts global GDP to come in at 3.4% in 2026.</p><p>\n              Global investors have been pulling money from the world's largest stock market, as waning Big Tech returns and chaos over domestic policymaking leaves them searching for alternatives.</p><p>\n              Weakness in the dollar - which last year clocked its worst annual performance since 2017 - has been another push factor.</p><p>\n              \"From our marketing in North America, it seems unambiguous that funds will go global,\" said the strategists.</p><p>\n              \"ETF flows show diversification is happening.\"</p><p>\n              Still the U.S. market is so large that even a benchmark allocation would remain a hefty one, with U.S. stocks comprising more than 70% of the MSCI World Index of global stocks.</p><p>\n              (Reporting by Rae Wee; Editing by Jacqueline Wong and Stephen Coates)</p></div>",
            "link": "https://hk.marketscreener.com/news/ubs-downgrades-weighting-on-us-equities-to-neutral-ce7e5cdeda88ff2d",
            "pub_date": "2026-02-27 15:00:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CCS Expands Beyond Traditional Telecom Services",
            "description": "<div class=\"txt-s4 article-text article-text--clear\"><p>CCS is redefining its role as a nationwide digital infrastructure enabler, strengthening its position within China’s rapidly evolving ICT landscape amid shifting telecom investment cycles and intensifying demands for intelligent, low-carbon, and resilient network solutions. As operators moderate capex, CCS continues to broaden its strategic focus into digital infrastructure, AI-enabled services, and smart-city ecosystems, areas now central to China’s next phase of economic modernization.</p><p>\nCCS is undergoing a pivotal transformation as it balances its legacy identity as a telecom construction and maintenance specialist with the industry’s shift toward cloud-network integration, smart operations, and computing-power infrastructure. As a key pillar in China’s digital-economy buildout, CCS remains deeply linked to national informatization priorities, working closely with government bodies, state-owned enterprises, and major telecom operators to support projects spanning broadband expansion, data-center development, emergency-management systems, and digital-government platforms.</p><!-- Article --><p>\nCCS’s business model is anchored in three complementary revenue pillars: Telecommunications Infrastructure Services (TIS), Business Process Outsourcing (BPO), and Applications, Content &amp; Other (ACO) services. This diversified structure provides resilience amid fluctuating operator investment cycles while enabling CCS to scale higher-value digital solutions such as system integration, software development, cloud-network engineering, and AI-driven smart-operations platforms.</p><p>\nPositioning itself as a “New Generation Integrated Smart Service Provider,” CCS is deepening investments in technological innovation, cultivating capabilities in computing-power networks, low-carbon energy systems, and advanced digital-operations technologies. Its strategic trajectory aligns closely with China’s long-term initiatives, including East-to-West computing, smart-city modernization, and carbon-reduction infrastructure, supported by a disciplined governance framework and a commitment to steady, high-quality growth.</p><h2>\nSteady growth</h2><p>\nCCS delivered steady revenue growth in H1 25, generating RMB 76.9bn, a 3.4% y/y increase, supported by the expansion of digital infrastructure, AI-enabled services, and rising demand from non-operator and overseas markets. All three core segments—TIS, BPO, and ACO—grew during the period, with ACO leading at 11.7% growth, driven by smart-city development, green-energy initiatives, and broader digital-transformation projects.</p><p>\nProfitability remained stable, with net profit reaching RMB 2.1bn, a 0.2% y/y increase, while operating profit rose 8.4%, reflecting improved execution despite continued margin pressure from labor intensity and project-delivery costs. Gross profit and margins softened slightly due to the higher share of construction-related work but remained within a resilient operating range.</p><p>\nOperational momentum was supported by strong performance across strategic emerging businesses, with digital infrastructure, green and low-carbon solutions, AI-centric offerings, and smart-city services contributing over 40% of new contracts. CCS also strengthened its revenue mix, as domestic non-operator and overseas markets collectively exceeded 50% of total revenue for the first time, underscoring successful diversification and growing international demand across Asia Pacific, the Middle East, and Africa.</p><h2>\nAttractive yields</h2><p>\nCCS shares have declined roughly 13.3% over the past year, reducing the group’s market capitalization to about HKD 26.9bn (USD 3.9bn). At present, the stock trades on an FY 26 P/E multiple of 7.1x, well above its five-year average of 6.6x.</p><p>\nAnalyst sentiment remains broadly constructive. The consensus target price of CNY 4.6 suggests potential upside of around 19.3% from current trading levels, while the most optimistic forecast of CNY 5.0 with upside of nearly 29.9%. Among the six analysts covering the stock, three maintain a “Buy” rating, reflecting continued confidence in CCS’s medium-term growth outlook.</p><p>\nIn FY 24, CCS paid a dividend of CNY 0.22 per share, delivering a yield of approximately 5.1%. Looking ahead, forecasts indicate an average dividend yield of about 5.9% over the coming three fiscal years.</p><h2>\nRisk metrics</h2><p>\nCCS drives growth through expanding digital infrastructure, AI enabled services, smart city solutions, diversified revenue streams, and strengthening non operator and overseas markets to reinforce its position as an integrated smart service provider.</p><p>\nCCS faces key risks including margin pressure from labor-intensive delivery, rising project-execution costs, and softer demand from domestic telecom operators amid reduced capex. Exposure to higher working-capital needs and negative free cash flow adds financial strain, while overseas expansion brings FX volatility and operational-model risks. In addition, reliance on large-scale digital-infrastructure, smart-city, and green-energy projects introduces execution and governance challenges that may influence profitability, resilience, and long-term strategic delivery.</p></div>",
            "link": "https://hk.marketscreener.com/news/ccs-expands-beyond-traditional-telecom-services-ce7e5cdeda88ff22",
            "pub_date": "2026-02-27 15:00:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTSE 100 to rise after gains in Asia",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Stocks in London are set to open higher on Friday, shaking off mixed trade in New York, while in Europe, eyes will be on inflation readings from France and Germany. </p><p></p><p>IG says futures indicate the FTSE 100 to open 32.3 points higher, 0.3%, at 10,879 on Friday. The index of London large-caps closed up 40.29 points, 0.3% at 10,846.70 on Thursday. It is up 1.5% so far this week. </p><!-- Article --><p></p><p>In New York on Thursday, the Dow Jones Industrial Average ended slightly higher, the S&amp;P 500 shed 0.5% and the Nasdaq Composite declined 1.2%. Nvidia shares weakened, slumping 5.5%, despite blockbuster earnings. </p><p></p><p>The yield on the US 10-year Treasury ebbed to 4.0% early Friday, from 4.03% at the time of the London equities close on Thursday. The 30-year yield slimmed to 4.65% from 4.68%. </p><p></p><p>Pepperstone analyst Michael Brown commented: \"Treasuries saw gains across the curve, with the benchmark 10-year yield briefly falling as low as 4.01%, printing its lowest level since late-November last year. That said, we do remain, just about, within the longer-run range here.\"</p><p></p><p>In Tokyo, the Nikkei 225 ended slightly higher. In China, the Shanghai Composite was 0.4% higher, while the Hang Seng Index in Hong Kong was 1.0% higher. In Sydney, the S&amp;P/ASX 200 added 0.3%. </p><p></p><p>The pound fell to USD1.3475 on Friday from USD1.3513 late Thursday, The euro rose to USD1.1805 from USD1.1792. Against the yen, the dollar faded to JPY155.84 from JPY156.20. </p><p></p><p>The Green Party has won its first ever parliamentary by-election in Gorton &amp; Denton, dealing a bitter blow to UK Prime Minister Keir Starmer.</p><p></p><p>Labour's defeat, trailing in third behind Zack Polanski's Greens and Nigel Farage's Reform UK in the previously rock-solid Greater Manchester constituency, will pile pressure on the prime minister.</p><p></p><p>Hannah Spencer, a councillor and plumber, emerged victorious for the Greens, with 14,980 votes and a majority of 4,402 votes.</p><p></p><p>Reform UK's candidate Matt Goodwin got 10,578 votes, with Labour's Angeliki Stogia trailing on 9,364, down from 18,555 in the 2024 general election, when the turnout was similarly high.</p><p></p><p>UK consumer confidence worsened in February, with survey respondents expressing concern for their financial situation going forward amid rising unemployment and weak wage growth, survey results showed Friday.</p><p></p><p>The overall score for the GfK consumer confidence index fell to minus 19 in February from minus 16 in January, below the FXStreet-cited consensus forecast of negative 15.</p><p></p><p>Neil Bellamy, consumer insights director at GfK, commented: \"After a modest improvement in recent months, consumer confidence is down three points in February, returning to the level seen in November 2025. This decline is mainly driven by weaker perceptions of personal finances — both looking back a year and ahead.\"</p><p></p><p>The measure for personal financial situation over the last 12 months fell to minus seven from minus three, while the measure for personal financial situation over next 12 months declined to plus 2 from plus 6.</p><p></p><p>A barrel of Brent fell to USD71.25 early Friday from USD72.58 late Thursday. Gold rose to USD5,192.25 an ounce from USD5,180.61.</p><p></p><p>Iran and the US made \"significant progress\" in talks in Switzerland on Thursday, mediators said, after the latest round of negotiations to avert a war between the longtime foes, and agreed to further discussions next week in Austria.</p><p></p><p>The Oman-mediated negotiations follow repeated threats from US President Donald Trump to strike Iran, with the president last Thursday giving Tehran 15 days to reach a deal.</p><p></p><p>While Iran has insisted the discussions focus solely on its nuclear programme, the US wants Tehran's missile programme and its support for militant groups in the region curtailed.</p><p></p><p>Friday's global economic calendar has a German inflation reading at 1300 GMT and US producer price data at 1330 GMT.</p><p></p><p>Friday's UK corporate calendar has full-year results from property portal Rightmove, educational materials publisher Pearson, and aerospace firm Melrose. British Airways parent IAG releases annual results. </p><p></p><p>By Eric Cunha, Alliance News news editor</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/ftse-100-to-rise-after-gains-in-asia-ce7e5cdeda88ff20",
            "pub_date": "2026-02-27 15:00:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo: Shareholders including DeNA, Bank of Kyoto, Resona to sell shares",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nintendo-shareholders-including-dena-bank-of-kyoto-resona-to-sell-shares-ce7e5cdeda88f122",
            "pub_date": "2026-02-27 15:00:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "One power line being repaired at Zaporizhzhia nuclear power plant - RIA",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/one-power-line-being-repaired-at-zaporizhzhia-nuclear-power-plant-ria-ce7e5cdeda88f126",
            "pub_date": "2026-02-27 15:00:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MECOM Power and Construction Enters FX Hedging Contract",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mecom-power-and-construction-enters-fx-hedging-contract-ce7e5cdeda88f42d",
            "pub_date": "2026-02-27 14:55:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo plans to buy back, retire up to 1.2% own shares worth 100 billion yen, filing shows",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nintendo-plans-to-buy-back-retire-up-to-1-2-own-shares-worth-100-billion-yen-filing-shows-ce7e5cdeda88f42c",
            "pub_date": "2026-02-27 14:55:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nintendo: shareholders to sell 32.7 million shares excluding overallotment",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nintendo-shareholders-to-sell-32-7-million-shares-excluding-overallotment-ce7e5cdeda88f523",
            "pub_date": "2026-02-27 14:55:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "MPS Approves 2030 Plan, Targets EUR700 Million in Synergies with Mediobanca",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Banca Monte dei Paschi di Siena Spa announced on Friday the approval of its 20262030 Industrial Plan, titled \"From deep roots to new frontiers, a leading competitive force in banking.\" The plan follows the successful public exchange and tender offer for Mediobanca, which saw an 86.3% acceptance rate, and foresees the merger by incorporation of Mediobanca into MPS, with full-run synergies amounting to EUR700 million.</p><p></p><!-- Article --><p>\n\n\nThe new group aims to become the third-largest banking player in Italy, with over 7 million customers and a significant contribution from high-fee activities, including Asset Gathering &amp; Wealth Management, Corporate &amp; Investment Banking, and Private Banking, representing approximately 44% of total pro-forma revenues.</p><p></p><p>\n\n\nOn the financial front, the plan projects a net interest and fee margin of EUR9.5 billion in 2030, compared to EUR7.6 billion in 2025, an adjusted net profit of EUR3.7 billion versus EUR2.4 billion, and a cost/income ratio reduced to 38% from 46%.</p><p></p><p>\n\n\nThe CET1 ratio is expected to remain around 16% throughout the plan's horizon, with a 100% payout and cumulative distributions estimated at about EUR16 billion.</p><p></p><p>\n\n\nBreaking down the divisions, Retail &amp; Commercial Banking is expected to increase its net interest and fee margin to about EUR2.6 billion in 2030 from around EUR2.1 billion in 2025, with loans rising to approximately EUR82 billion from EUR66 billion.</p><p></p><p>\n\n\nConsumer Finance, through Compass, targets revenues of around EUR1.7 billion in 2030 from about EUR1.3 billion, and loans of about EUR21 billion from EUR17 billion, with the cost/income ratio declining to 27% from 31%.</p><p></p><p>\n\n\nAsset Gathering &amp; Wealth Management aims for revenues of about EUR2.0 billion from EUR1.5 billion, and total assets increasing to around EUR185 billion from EUR142 billion.</p><p></p><p>\n\n\nIn Private Banking, revenues are expected to reach EUR900 million from EUR600 million.</p><p></p><p>\n\n\nCorporate &amp; Investment Banking is projected to achieve a net interest and fee margin of about EUR1.3 billion, while Principal Investing, also supported by a roughly 13% stake in Assicurazioni Generali, expects revenues to grow to about EUR800 million from EUR600 million.</p><p></p><p>\n\n\nBy Antonio Di Giorgio, Alliance News reporter</p><p></p><p>\n\n\nComments and questions to redazione@alliancenews.com</p><p></p><p>\n\n\nCopyright 2026 Alliance News IS Italian Service Ltd. All rights reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/mps-approves-2030-plan-targets-eur700-million-in-synergies-with-mediobanca-ce7e5cdeda88f626",
            "pub_date": "2026-02-27 14:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India trade minister on U.S. tariffs: will wait and watch and ensure India's best interests are protected",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-trade-minister-on-u-s-tariffs-will-wait-and-watch-and-ensure-india-s-best-interests-are-prot-ce7e5cdeda88f725",
            "pub_date": "2026-02-27 14:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India trade minister: in dialogue with U.S. on trade, is an evolving situation",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-trade-minister-in-dialogue-with-u-s-on-trade-is-an-evolving-situation-ce7e5cdeda89fe2d",
            "pub_date": "2026-02-27 14:50:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shanghai's most active tin contract rises more than 7%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shanghai-s-most-active-tin-contract-rises-more-than-7-ce7e5cdeda89fe23",
            "pub_date": "2026-02-27 14:50:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re posts 47% rise in 2025 net profit, but life and health weighs",
            "description": "<div class=\"txt-s4 article-text\"><p>FRANKFURT, Feb 27 (Reuters) - Reinsurance company Swiss Re said on Friday its 2025 net profit rose 47%, slightly better than expected, and helped by strength in its property and casualty business.</p><p>\n              The rise came despite a 17% decline in profit at its health and life division, that led it to miss a target for the business. </p><!-- Article --><p>\n              Group net profit of $4.762 billion in the period compares with a profit of $3.238 billion a year earlier. Analysts had expected a profit of $4.724 billion, according to a consensus forecast.</p><p>\n              Swiss Re warned last year that it would miss the full-year profit target in its life and health division after higher-than-expected claims.</p><p>\n              The reinsurer, among the world's largest, had said smaller health portfolios in Australia and elsewhere were underperforming its expectations.</p><p>\n              In October, Swiss Re said it would pause new life and health business in Australia following a sharp rise in claims there after local insurers paid out more in mental health claims and younger people were put on permanent disability.</p><p>\n              Profit in the division was $1.274 billion for 2025, down from $1.532 billion in 2024 and short of a target of about $1.6 billion. </p><p>\n               (Reporting by Tom Sims and Oliver Hirt, Editing by Friederike Heine and Clarence Fernandez)</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-posts-47-rise-in-2025-net-profit-but-life-and-health-weighs-ce7e5cdeda89ff22",
            "pub_date": "2026-02-27 14:50:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF Swings to Net Profit on Accelerated Cost Savings",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Nina Kienle </p><br/><p>\n  Germany's BASF returned to net profit in the fourth quarter, supported by cost savings programs and its streamlining of the organization. </p><!-- Article --><p>\n\n  The German chemical giant on Friday said it swung to a net profit in the fourth quarter of 560 million euros ($660.8 million) from a loss of 786 million euros in the prior-year period. The figure beat analysts' forecast of 285 million euros, according to consensus estimates provided by the company. </p><p>\n\n  Sales for the period declined 5.6% to 14.03 billion euros, compared with analysts' estimated 14.04 billion euros. </p><p>\n\n  The company is undergoing a comprehensive restructuring that involves streamlining its portfolio, selling noncore assets, spinning off its agricultural business and cutting jobs. </p><p>\n\n  BASF also confirmed preliminary figures for 2025. Sales amounted to 59.66 billion euros, down 2.9%. Earnings before interest, taxes, depreciation, amortization and special items fell 9.5% to 6.55 billion euros. </p><p>\n\n  The Ludwigshafen-based company said it accelerated the implementation of its existing cost savings programs. By end-2025 it achieved a total annual cost reduction run rate of around 1.7 billion euros, an increase of 100 million euros compared to its original target. </p><p>\n\n  BASF said it would keep a dividend of 2.25 euros per share. </p><p>\n\n  For 2026, BASF is targeting Ebitda before special items of 6.2 billion euros to 7.0 billion euros, and free cash flow of between 1.5 billion and 2.3 billion euros. </p><br/><p>\n  Write to Nina Kienle at nina.kienle@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0146ET</p></div>",
            "link": "https://hk.marketscreener.com/news/basf-swings-to-net-profit-on-accelerated-cost-savings-ce7e5cdeda89f023",
            "pub_date": "2026-02-27 14:50:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Kazakhstan says output at supergiant oilfield Tengiz nears capacity",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/kazakhstan-says-output-at-supergiant-oilfield-tengiz-nears-capacity-ce7e5cdeda89f024",
            "pub_date": "2026-02-27 14:50:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bayer reports results for next generation investigational targeted radionuclide therapy 225ac",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bayer-reports-results-for-next-generation-investigational-targeted-radionuclide-therapy-225ac-ce7e5cdeda89f327",
            "pub_date": "2026-02-27 14:50:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's Politburo Reiterates Pro-Growth Stance",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  China's top leaders reiterated their pro-growth policy stance as they convened a meeting to prepare for March's agenda-setting annual legislative session. </p><p>\n\n  The ruling Communist Party's Politburo, China's highest decision-making body, met Friday to discuss the country's 15th Five-year Plan and a government work report that senior lawmakers are set to review early next month. </p><!-- Article --><p>\n\n  Officials at the gathering reiterated their commitment to a more proactive fiscal policy and a moderately loose monetary policy in 2026. They also pledged to continue expanding domestic demand and optimizing supply. </p><p>\n\n  Friday's meeting came before next week's annual National People's Congress session. Roughly 3,000 representatives, including senior officials, will discuss and approve major economic targets for the world's second-largest economy for 2026 and the next five years. </p><p>\n\n  China is widely expected to set an annual growth target of 4.5%-5.0%, a pragmatic downgrade from its previous \"around 5%\" goal, given that domestic demand remains weak. </p><p>\n\n  Analysts say the tweak to the target, if approved, would make aggressive stimulus measures this year much less likely. </p><p>\n\n  \"Fiscal policy will likely continue to play the leading role, though with a slightly narrower official deficit than in 2025 as trade uncertainty eases and policy makers shift from 'extraordinary' to 'necessary' counter--cyclical support,\" said economists at Standard Chartered in their preview of March's legislature session. </p><p>\n\n  They expect monetary policy to remain measured, focusing on providing ample liquidity rather than large rate cuts. </p><p>\n\n  Write to Singapore editors at singaporeeditors@dowjones.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0143ET</p></div>",
            "link": "https://hk.marketscreener.com/news/china-s-politburo-reiterates-pro-growth-stance-ce7e5cdeda89f42d",
            "pub_date": "2026-02-27 14:50:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gold broadly steady as fall in Treasury yields balances tempered safe-haven bids",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Gold was broadly steady on Friday as a drop in U.S. Treasury yields eased the opportunity cost of holding bullion, while muted safe-haven demand kept prices in check as investors assess U.S-Iran negotiations.</p><p>\n              Spot gold edged up 0.1% at $5,192.19 per ounce by 0543 GMT. The benchmark 10-year yield fell to a three-month low on the day.</p><!-- Article --><p>\n              \"Ten-year U.S. Treasury yields after subtracting inflation, so the real yield, have plummeted and that actually is currently a supporting factor, allowing gold to hold steady regardless of the risk premiums ticking down yesterday after U.S.-Iran talks,\" said Kelvin Wong, a senior market analyst at OANDA.</p><p>\n              Gold was set for its seventh straight month of gains, rising more than 6% in February, a month in which renewed U.S. tariff uncertainty and U.S.-Iran tensions boosted its safe-haven appeal.</p><p>\n              The U.S. and Iran made progress in Geneva on Thursday over Tehran's nuclear programme, mediator Oman said, but hours of negotiation ended without a breakthrough to avert potential U.S. strikes amid a massive military buildup.</p><p>\n              U.S. gold futures for April delivery were up 0.3% at $5,209.20.</p><p>\n              The dollar was set to gain 0.6% for the month, as indications of a more hawkish Federal Reserve made dollar-priced gold more expensive for holders of other currencies. [USD/][US/]</p><p>\n              Fed Chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts, in alignment with President Donald Trump's expectations, could be narrowing amid emerging bullishness about the U.S. economy.</p><p>\n              The number of Americans filing new applications for jobless benefits increased slightly last week, but data showed that the unemployment rate appeared to hold steady in February in a stable labour market.</p><p>\n              Markets currently expect at least three 25-basis-point Fed rate cuts this year, according to CME's FedWatch Tool. [FEDWATCH]</p><p>\n              Spot silver rose 1.6% to $89.73 per ounce, and was headed for a 6.1% gain on the month.</p><p>\n              Spot platinum climbed 5.2% to $2,260.09 per ounce, a four-week high, while palladium gained 2.3% to $1,825.29.</p><p>\n               (Reporting by Ishaan Arora in Bengaluru; Editing by Sumana Nandy, Rashmi Aich and Ronojoy Mazumdar)</p><p>\n            By Ishaan Arora</p></div>",
            "link": "https://hk.marketscreener.com/news/gold-broadly-steady-as-fall-in-treasury-yields-balances-tempered-safe-haven-bids-ce7e5cdeda89f726",
            "pub_date": "2026-02-27 14:50:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EQT Sells Final Shares in Azelis",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Private equity firm EQT has divested its remaining holding of approximately 24 million shares, representing about 10 percent of the capital, in Belgian specialty chemicals company Azelis.\n<br/><br/>\n\nThe sale was completed on February 26.\n<br/><br/>\n\nThe transaction generated a total of around 190 million euros, of which EQT VIII received approximately 173 million euros. This marks the end of more than eight years of ownership in the chemical distributor.\n<br/><br/>\n\nAzelis was listed on the stock exchange in 2021.\n\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/eqt-sells-final-shares-in-azelis-ce7e5cdedb80fe27",
            "pub_date": "2026-02-27 14:50:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ubs Group Ag Announces Changes to Its Board and Committee",
            "description": "<div class=\"txt-s4 article-text\"><p>UBS Group AG announced that William C. Dudley and Jeanette Wong have also decided to step down after seven years on the Board. During this time, Mr. Dudley served on the Corporate Culture and Responsibility Committee, the Risk Committee and the Governance and Nominating Committee. Ms. Wong was a member of the Audit Committee, the Corporate Culture and Responsibility Committee and the Compensation Committee.</p></div>",
            "link": "https://hk.marketscreener.com/news/ubs-group-ag-announces-changes-to-its-board-and-committee-ce7e5cdedb80f32c",
            "pub_date": "2026-02-27 14:41:27",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CapitaLand Ascendas REIT Acquires Logistics Portfolio in Spain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/capitaland-ascendas-reit-acquires-logistics-portfolio-in-spain-ce7e5cdedb80f624",
            "pub_date": "2026-02-27 14:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "EDF Successfully Launches €2.75 Billion Green Bond Issuance",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    EDF has successfully raised €2.75 billion through a four-tranche senior green bond issuance.\n<br/><br/>\n\nThis issuance includes €500 million in bonds with a 2-year maturity and a floating coupon of Euribor 3M + 0.33%, €750 million in bonds with a 5-year maturity and a fixed coupon of 3.0%, €1 billion in bonds with a 12-year maturity and a fixed coupon of 4.0%, and €500 million in bonds with a 20-year maturity and a fixed coupon of 4.5%.\n<br/><br/>\n\nAn amount equal to the net proceeds from the bond issuance will be allocated to the financing and/or refinancing of investments corresponding to the eligible project categories defined in EDF's Green Financing Framework.\n<br/><br/>\n\nThe 2-year and 5-year tranches are dedicated to extending the lifespan of existing nuclear reactors in France, while the 12-year and 20-year tranches will support the construction of the pair of EPR nuclear reactors at Hinkley Point C in the United Kingdom.\n<br/><br/>\n\nWith demand reaching €11 billion, the operation attracted significant investor interest and was oversubscribed by more than four times. This will enable EDF to finance its strategy and contribute to achieving carbon neutrality by 2050.\n<br/><br/>\n\nSettlement and delivery of the bonds is expected to take place on March 4, 2026, at which time the bonds are scheduled to be admitted to trading on the regulated market of Euronext Paris.\n\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/edf-successfully-launches-a-2-75-billion-green-bond-issuance-ce7e5cdedb80f722",
            "pub_date": "2026-02-27 14:41:28",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Australian shares notch best February since 2019 as earnings outshine rate headwinds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/australian-shares-notch-best-february-since-2019-as-earnings-outshine-rate-headwinds-ce7e5cdedb81f02c",
            "pub_date": "2026-02-27 14:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CSL Vacuum Science and Technology Posts 19% Slide in 2025 Profit, Revenue Down 2%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/csl-vacuum-science-and-technology-posts-19-slide-in-2025-profit-revenue-down-2-ce7e5cdedb81f124",
            "pub_date": "2026-02-27 14:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India new issue - Bank of Baroda to issue green infrastructure bonds, bankers say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-new-issue-bank-of-baroda-to-issue-green-infrastructure-bonds-bankers-say-ce7e5cdedb81f223",
            "pub_date": "2026-02-27 14:35:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re to Initiate $1.5 Billion Share Repurchase Program",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-to-initiate-1-5-billion-share-repurchase-program-ce7e5cdedb81f325",
            "pub_date": "2026-02-27 14:30:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dewa Halts Trading on Dubai Bourse",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dewa-halts-trading-on-dubai-bourse-ce7e5cdedb81f623",
            "pub_date": "2026-02-27 14:30:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Swiss Re Posts Higher FY25 Net Income; Insurance Revenue Declines",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/swiss-re-posts-higher-fy25-net-income-insurance-revenue-declines-ce7e5cdedb81f723",
            "pub_date": "2026-02-27 14:30:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}