{
    "data": [
        {
            "title": "Shenzhen Investment's Daily Toll Revenue Jumps in January",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shenzhen-investment-s-daily-toll-revenue-jumps-in-january-ce7e5cdfd88eff20",
            "pub_date": "2026-02-27 21:16:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Feiyu Technology International Forecasts Turnaround to 2025 Profit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/feiyu-technology-international-forecasts-turnaround-to-2025-profit-ce7e5cdfd88eff27",
            "pub_date": "2026-02-27 21:16:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Solar's Profit Slips 16% in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-solar-s-profit-slips-16-in-2025-ce7e5cdfd88ef02d",
            "pub_date": "2026-02-27 21:16:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SPT Energy Forecasts Narrower Loss in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/spt-energy-forecasts-narrower-loss-in-2025-ce7e5cdfd88ef023",
            "pub_date": "2026-02-27 21:16:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omani foreign minister to meet Vance in Washington, source familiar says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/omani-foreign-minister-to-meet-vance-in-washington-source-familiar-says-ce7e5cdfd88ef427",
            "pub_date": "2026-02-27 21:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia sets March crude palm oil reference price at $938.87 per ton",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-sets-march-crude-palm-oil-reference-price-at-938-87-per-ton-ce7e5cdfd88ef621",
            "pub_date": "2026-02-27 21:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration taps far-right official for key Brazil post",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 27 (Reuters) - The Trump administration has appointed a hard-right critic of Brazil's current government to a position shaping U.S. policy toward the South American nation, a move that suggests relations between the Western Hemisphere's two largest democracies remain delicate despite a recent rapprochement. </p><p>\n              Darren Beattie, who is also the acting assistant secretary of state for educational and cultural affairs, was tapped recently for a senior advisory role overseeing Brazil, said three sources familiar with the matter, all of whom requested anonymity to discuss non-public personnel moves.</p><!-- Article --><p>\n              The move was confirmed by a senior State Department official, who said Beattie \"currently serves as a Senior Advisor for Brazil Policy.\" </p><p>\n              Brazil's Foreign Ministry did not respond immediately to a request for comment.</p><p>\n              In August, Beattie, who was fired as a White House speechwriter in 2018 for addressing an event frequented by white nationalists, provoked a diplomatic incident after describing Brazilian Supreme Court Justice Alexandre de Moraes in an X post as \"the key architect of the censorship and persecution complex directed against (former Brazilian President Jair) Bolsonaro.\"</p><p>\n              Brazil's Foreign Ministry summoned the top U.S. diplomat in Brasilia to explain the comments.</p><p>\n              Moraes, the judge Beattie criticized, presided over the criminal case against Bolsonaro, an ally of U.S. President Donald Trump. Bolsonaro was convicted of plotting a coup to overturn Brazil's 2022 presidential election and is now serving a 27-year jail sentence. </p><p>\n              The U.S. had sanctioned Moraes in July, with Trump officials accusing him of authorizing arbitrary pre-trial detentions and suppressing freedom of expression as he presided over cases related to the 2022 coup plot.</p><p>\n              After the sanctions against Moraes were announced, Eduardo Bolsonaro, one of the ex-president's sons and a prominent right-wing politician in Brazil, thanked Beattie for his efforts in an X post. Another son of Bolsonaro, Flavio, is a leading contender in Brazil's next presidential election in October.</p><p><b>UP-AND-DOWN RELATIONSHIP</b></p><p>\n              While Beattie worked last year to counter what the Trump administration considers undue censorship in foreign countries, his new appointment signals a focus on Brazil going forward. </p><p>\n              It also suggests that Washington has not jettisoned its free speech concerns in Brazil, nor has it totally made peace with the leftist government of President Luiz Inacio Lula da Silva.</p><p>\n              Two Brazilian government officials said they were not yet aware of Beattie's appointment, adding that his impact on bilateral relations would depend on how much power he was given internally. The officials said they were wary given Beattie's public statements.</p><p>\n              Washington's relationship with Brasilia turned chilly after Trump returned to office last year. In addition to hitting Brazilian officials with sanctions, the U.S. slapped tariffs on Brazilian goods, due in part to what Trump called unjust persecution of Bolsonaro.</p><p>\n              But ties improved after Lula and Trump met briefly at the U.N. General Assembly in New York in September, where the U.S. president said they had an instant rapport. Late last year, the Trump administration lowered tariffs on some Brazilian goods and lifted sanctions on Moraes.</p><p><b>LULA COMES TO WASHINGTON</b></p><p>\n              The next big test in the Trump-Lula relationship may come in the next few weeks, as Lula said he plans to visit Washington in March. </p><p>\n              Lula has emerged as a leading critic of the U.S. operation to capture former Venezuelan leader Nicolas Maduro last month, as well as its efforts to cut off oil flows to Cuba.</p><p>\n              In addition to Beattie's new Brazil position and his work as the acting head of the State Department's educational and cultural affairs bureau, he is the president of the U.S. Institute of Peace, a national institute funded by Congress that is tasked with global conflict resolution. </p><p>\n              In December, the Trump administration renamed it the \"Donald J. Trump Institute of Peace,\" though the administration may not have legal authority to change its name.    </p><p>\n              During the 2024 presidential campaign, Beattie suggested the U.S. intelligence community could be behind attempts to kill Trump. He also drew accusations of racism and sexism for saying on social media that \"competent white men must be in charge if you want things to work\".</p><p>\n              In 2021, he tweeted: \"Imagine having respect for the State Department.\"</p><p></p><p> (Reporting by Gram Slattery and Humeyra Pamuk in Washington and Lisandra Paraguassu in BrasiliaEditing by Brad Haynes and Peter Graff)</p><p>\n            By Gram Slattery, Humeyra Pamuk and Lisandra Paraguassu</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-administration-taps-far-right-official-for-key-brazil-post-ce7e5cdfd88ef721",
            "pub_date": "2026-02-27 21:10:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Orix Corporation Announces Management Changes, Effective March 1, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>ORIX Corporation announced regarding management changes. Name: Reiko Okubo; Present Position: Executive Officer Corporate Strategy and Management Unit Responsible for CEO?s Office and New Business; New Position: Executive Officer Corporate Strategy and Management Unit Responsible for CEO?s Office. Effective as of March 1, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/orix-corporation-announces-management-changes-effective-march-1-2026-ce7e5cdfd88ef727",
            "pub_date": "2026-02-27 21:11:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to Remove Artificial Dyes From Cereal Aisle -- Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Connor Hart </p><br/><p>\n  Target said it will only carry cereals made without certified synthetic colors at its stores, citing sales data and customer research showing a shift toward foods made without artificial additives. </p><!-- Article --><p>\n\n  The retailer said Friday it has worked closely with national brands and owned-brand partners to reformulate products where necessary. It plans to implement the change by the end of May. </p><p>\n\n  The shift comes as food makers face renewed scrutiny over additives. Health and Human Services Secretary Robert F. Kennedy Jr. has pushed to strip artificial food dyes from Americans' diets as part of the Trump administration's \"Make America Healthy Again\" movement, which argues synthetic colors and other ingredients contribute to chronic health problems. </p><p>\n\n  Large manufacturers have already begun adjusting their portfolios. Kraft Heinz has said it plans to remove dyes from its U.S. products by the end of 2027. Conagra Brands is similarly working to discontinue certain color additives by the end of next year, while Nestle USA has said it aims to eliminate certified food, drug and cosmetic colors from its U.S. food and beverage portfolio by mid-2026. </p><p>\n\n  Retailers are taking part too. Walmart said last fall it would remove synthetic dyes from its store-brand foods and phase out roughly 30 other ingredients, including certain artificial sweeteners and preservatives. </p><p>\n\n  Target has previously sought to position its food assortment around cleaner labels. The retailer in 2019 launched its largest private-label brand, Good &amp; Gather, without synthetic colors, artificial sweeteners and flavors. </p><p>\n\n  The cereal shift is part of a broader effort by Target to sharpen its merchandise assortment and rebuild momentum after several uneven years marked by weaker discretionary spending and operational challenges in stores. The company is investing billions in store remodels, improved inventory systems and e-commerce capabilities as it works to regain shoppers' confidence. </p><p>\n\n  \"We know consumers are increasingly prioritizing healthier lifestyles, and we're moving quickly to evolve our offerings to meet their needs,\" Chief Merchandising Officer Cara Sylvester said. </p><br/><p>\n  Write to Connor Hart at connor.hart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0808ET</p></div>",
            "link": "https://hk.marketscreener.com/news/target-to-remove-artificial-dyes-from-cereal-aisle-update-ce7e5cdfd88ef724",
            "pub_date": "2026-02-27 21:11:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China's January net gold imports via Hong Kong rose almost 69% from December",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-s-january-net-gold-imports-via-hong-kong-rose-almost-69-from-december-ce7e5cdfd88fff2d",
            "pub_date": "2026-02-27 21:11:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bel declares dividend of 1.95 rupees per share",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bel-declares-dividend-of-1-95-rupees-per-share-ce7e5cdfd88fff26",
            "pub_date": "2026-02-27 21:11:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Pakistan bonds slip, Egypt and Jordan also fall",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/pakistan-bonds-slip-egypt-and-jordan-also-fall-ce7e5cdfd88ff023",
            "pub_date": "2026-02-27 21:11:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omani foreign minister to meet with U.S. vice president Vance in Washington on Friday -source familiar",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/omani-foreign-minister-to-meet-with-u-s-vice-president-vance-in-washington-on-friday-source-famili-ce7e5cdfd88ff025",
            "pub_date": "2026-02-27 21:11:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Stock Futures Lower Ahead of Key Inflation Report Amid Tech Volatility",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-lower-ahead-of-key-inflation-report-amid-tech-volatility-ce7e5cdfd88ff426",
            "pub_date": "2026-02-27 21:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ISO trims 2025/26 global sugar surplus forecast",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/iso-trims-2025-26-global-sugar-surplus-forecast-ce7e5cdfd88ff620",
            "pub_date": "2026-02-27 21:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novartis Says EMA Panel Recommends Remibrutinib for Chronic Spontaneous Urticaria",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/novartis-says-ema-panel-recommends-remibrutinib-for-chronic-spontaneous-urticaria-ce7e5cdfd88dfe2c",
            "pub_date": "2026-02-27 21:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures fall on AI concerns, Nasdaq set for steep monthly loss",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - U.S. stock index futures slid on Friday as growing AI unease dragged on tech stocks, with the Nasdaq on track for its steepest monthly drop since March 2025, and investors awaited key inflation data later in the day.</p><p>\n              Technology stocks saw immense turbulence this month due to AI concerns, even as investors fretted about the payoff from massive planning spending on artificial-intelligence technology.</p><!-- Article --><p>\n              Brewing tariff uncertainty also stoked volatility after the U.S. Supreme Court last week voided most of the duties U.S. President Donald Trump imposed last year. In response, Trump announced a temporary global tariff of 10% that came into effect on Tuesday. </p><p>\n              Nvidia shares inched 0.1% lower in premarket trading after sliding more than 5% in the previous session despite strong earnings, a sign that risk sentiment for all things AI remained shaky.</p><p>\n              \"It's easy to feel anxious when the tech darlings that carried the market stumble,\"  said Brian Jacobsen, chief economic strategist at Annex Wealth Management.  </p><p>\n              \"We are witnessing a true market rotation, where opportunities are broadening out beyond a handful of megacap tech stocks and flowing into value stocks, small-caps and industrial sectors.\" </p><p>\n              Zscaler lost 10.5% after the cloud security firm reported a wider net loss in the second quarter, while Intuit dipped 3.1% after the financial software company forecast third-quarter profit below estimates. </p><p>\n              Software shares were rocked earlier this year on fears of industrywide AI-led disruptions. Financial brokerages, data analytics and legal services, real estate services and trucking are also hit hard by brewing AI concerns. </p><p>\n              The S&amp;P 500 and the Nasdaq clocked losses in the last session, with the Nasdaq closing below its 50-day moving average for the 17th straight session. The closely followed moving average is seen as a proxy for the intermediate-term trend. </p><p>\n              However, the Dow Jones Industrial Average was set to log 10 straight months of gains. </p><p>\n              In economic data, a January producer prices reading due before the bell could offer insights into the U.S. Federal Reserve's interest rate path. </p><p>\n              At 07:31 a.m. ET, Dow E-minis lost 294 points, or 0.59%, S&amp;P 500 E-minis fell 27.75 points, or 0.4%, and Nasdaq 100 E-minis shed 98.25 points, or 0.39%. </p><p>\n              Most megacap and growth stocks inched lower. Chip stocks including AMD and Broadcom also declined. </p><p>\n              Netflix added 8.1% as investors cheered its decision to exit the fight for Warner Bros Discovery, which fell 1.4%. Paramount Skydance rose 7.5% after winning the race for some of the world's most prized TV and film assets. </p><p>\n              Block surged 20% after the payments firm said it would cut over 4,000 jobs, nearly half its workforce, as part of an overhaul to embed artificial intelligence across its operation. </p><p>\n              Dell climbed 12.1% after the PC-maker said it expects revenue from its key AI-optimized servers business to double in fiscal year 2027 and promised to return more cash to shareholders.</p><p>\n              Duolingo dropped 24.2% after the language-learning app forecast first-quarter and 2026 bookings below expectations.</p><p></p><p> (Reporting by Shashwat Chauhan and Ragini Mathur in Bengaluru; Editing by Pooja Desai)</p><p>\n            By Shashwat Chauhan and Ragini Mathur</p></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-fall-on-ai-concerns-nasdaq-set-for-steep-monthly-loss-ce7e5cdfd88df020",
            "pub_date": "2026-02-27 21:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese embassy in Israel: asks nationals to strengthen security precautions and emergency preparedness - statement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chinese-embassy-in-israel-asks-nationals-to-strengthen-security-precautions-and-emergency-preparedn-ce7e5cdfd88df024",
            "pub_date": "2026-02-27 21:05:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BMO on The Day Ahead in Canada",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bmo-on-the-day-ahead-in-canada-ce7e5cdfd88df120",
            "pub_date": "2026-02-27 20:56:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Regeneron, Sanofi's Dupixent Recommended for EU Approval to Treat CSU in Children",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/regeneron-sanofi-s-dupixent-recommended-for-eu-approval-to-treat-csu-in-children-ce7e5cdfd88df526",
            "pub_date": "2026-02-27 20:56:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Treasury 10-year yield falls below 4%, hits lowest since late November, last down 3.4 bps at 3.981%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-treasury-10-year-yield-falls-below-4-hits-lowest-since-late-november-last-down-3-4-bps-at-3-98-ce7e5cdfd88df722",
            "pub_date": "2026-02-27 20:50:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Top Premarket Gainers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/top-premarket-gainers-ce7e5cdfd88aff25",
            "pub_date": "2026-02-27 20:50:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nam Cheong logs FY revenue 619.7 mln RGT",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nam-cheong-logs-fy-revenue-619-7-mln-rgt-ce7e5cdfd88aff24",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. equity fund inflows cooled ahead of Nvidia's earnings",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-equity-fund-inflows-cooled-ahead-of-nvidia-s-earnings-ce7e5cdfd88af023",
            "pub_date": "2026-02-27 20:50:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Fed Mounts Closed-Door Fight Against DOJ Subpoenas",
            "description": "<div class=\"txt-s4 article-text\"><p>\n     Fed Mounts Closed-Door Fight Against DOJ Subpoenas By Vicky Ge Huang </p><p>\n\n     The Federal Reserve is waging a behind-closed-doors legal challenge to a pair of subpoenas issued as part of U.S. Attorney Jeanine Pirro's criminal investigation into Fed Chair Jerome Powell, according to people familiar with the matter. As that legal battle ensues, Fed governor Stephen Miran turned his attention to the central bank's policy stance: he said in a Fox Business interview Thursday that the Fed needs to cut rates by about a percentage point this year. Meanwhile, markets will get their next hint on where prices are headed when wholesale inflation data is released Friday. </p><!-- Article --><p>\n\n     Top News Fed Mounts Closed-Door Fight Against Justice Department Subpoenas </p><p>\n\n     U.S. Attorney Jeanine Pirro, a longtime ally of President Trump, opened a probe into Federal Reserve Chair Jerome Powell to examine whether he gave false testimony to Congress last summer about the central bank's building-renovation project. </p><p>\n\n     The move prompted an unprecedented public response from Powell, who in a Jan. 11 video statement said the investigation was a pretext for President Trump's continuing campaign to pressure the Fed to lower interest rates and end the independence of the central bank. </p><p>\n\n     The Fed, in sealed proceedings, is asking a judge to quash the subpoenas , which could reduce or eliminate its obligation to respond. Its specific legal arguments couldn't immediately be learned. It isn't uncommon, especially in high-profile investigations, for a subpoena recipient to challenge prosecutors' demands as being overly broad or seeking information protected by legal privilege. </p><p>\n\n     Fed's Miran Says Four Cuts Are Appropriate This Year </p><p>\n\n     Federal Reserve governor Stephen Miran said Thursday: \"Four cuts I think are appropriate,\" </p><p>\n\n  adding \"I'd rather get them sooner than later.\" With regard to private credit, Miran said he hasn't seen anything yet that would make him worried from a macroeconomic perspective. He added a lot of the growth in private credit ties back to overregulation in banks. </p><p>\n\n     January's Wholesale Inflation Will Help Flesh Out the Fed's Preferred Price Gauge </p><p>\n\n     The Bureau of Labor Statistics is set to publish the producer price index for total final demand at 8:30 a.m. ET. Economists expected that solid price pressures remained in the pipeline in January, though not as strong as in December. That could signal that the Federal Reserve's preferred inflation gauge will remain sticky, possibly stalling momentum for further interest-rate cuts. Economists surveyed by FactSet expect that wholesale inflation rose 0.3% in January. That's a cooldown from the 0.5% monthly pace in December, but still a relatively firm monthly print. The annual rate is expected to be 2.6%, a pullback from December's 3% increase. (Barron's) </p><p>\n\n     Mortgage Rates Fall Below 6% for the First Time Since 2022 </p><p>\n\n     Mortgage rates fell below 6% this week </p><p>\n\n  for the first time in more than three years, welcome news for waves of house hunters heading into the busy spring home-buying season. </p><p>\n\n     Trump's Push to Make Homes More Affordable Needs the Banks to Play Ball </p><p>\n\n  Key Developments Around the World China Moves to Tame Yuan Rally by Slashing Shorting Costs </p><p>\n\n     China's central bank has started taking steps to check the yuan's recent advance, dusting off an old playbook that would reduce the cost of betting against the currency. The People's Bank of China announced it would slash the risk reserve requirement ratio </p><p>\n\n  for financial institutions conducting foreign-exchange forward trading to zero from 20%, a move that effectively makes purchasing the dollar cheaper. </p><p>\n\n     Tokyo CPI Slows Below BOJ Target But Rate-Hike Path Seems Intact </p><p>\n\n     Inflation in Japan's capital cooled below the central bank's 2% target </p><p>\n\n  for the first time in over a year, but the slowdown is unlikely to derail further interest rate hikes. </p><p>\n\n     U.K. Consumer Mood Darkens Amid Lingering Cost-Of-Living Squeeze </p><p>\n\n     U.K. consumer sentiment fell unexpectedly </p><p>\n\n  in February as cost-of-living pressures continue to weigh on households. </p><p>\n\n     U.K. Prime Minister Starmer Suffers Another Setback With Local Election </p><p>\n\n  OPEC+ Expected to Resume Output Hikes at Sunday Meeting </p><p>\n\n     The Organization of the Petroleum Exporting Countries and its allies meet Sunday with a familiar dilemma : add barrels to the market or continue holding back against a fragile geopolitical backdrop. </p><p>\n\n     Commentary Tech Has Never Caused a Job Apocalypse. Don't Bet on It Now. </p><p>\n\n     It was only a matter of time before the AI apocalypse theory went mainstream, writes Greg Ip for The Wall Street Journal. Last weekend, a sensational report posited a future in which AI unleashes enough disruption and job destruction to bring on a deep recession and financial crisis. In response, the entire stock market sold off. </p><p>\n\n     AI disruption makes news almost daily. On Thursday, payments company Block said it was laying off 4,000 employees, 40% of its workforce, because AI has \"changed what it means to build and run a company,\" founder Jack Dorsey told shareholders. \"Within the next year, I believe the majority of companies will reach the same conclusion.\" </p><p>\n\n     Is this just the beginning? No one should dismiss any scenario, even the most dystopian, with high conviction. Certainly not journalists, whose way of life is in AI's crosshairs. </p><p>\n\n     But I keep stumbling over one small problem with the doomsday vision: It requires a breakdown in how the market economy functions. Nothing like it has happened in the U.S. before, and there is no evidence it is happening now. Read more . </p><p>\n\n     Forward Guidance Friday (all times ET) </p><p>\n\n     8:30 a.m.: PPI </p><p>\n\n     9:45 a.m.: Chicago Business Barometer - ISM-Chicago Business Survey - Chicago PMI </p><p>\n\n     3 p.m.: Agricultural Prices </p><p>\n\n     3:30 p.m.: U.S. President Donald Trump delivers remarks at The Port of Corpus Christi </p><p>\n\n     Monday </p><p>\n\n     9:45 a.m.: US Manufacturing PMI </p><p>\n\n     10 a.m.: ISM Report On Business Manufacturing PMI </p><p>\n\n     About Us </p><p>\n\n     WSJ Pro Central Banking brings you central banking news, analysis and insights from WSJ's global team of reporters and editors. This newsletter was compiled by markets reporter Vicky Ge Huang  in New York. Send your tips, suggestions and feedback to [vicky.huang@wsj.com]. </p><p>\n\n     This article is a text version of a Wall Street Journal newsletter published earlier today. </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0746ET</p></div>",
            "link": "https://hk.marketscreener.com/news/fed-mounts-closed-door-fight-against-doj-subpoenas-ce7e5cdfd88af123",
            "pub_date": "2026-02-27 20:50:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Recommends Shareholders Reject TRC Capital Mini-Tender Offer",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cibc-recommends-shareholders-reject-trc-capital-mini-tender-offer-ce7e5cdfd88af227",
            "pub_date": "2026-02-27 20:50:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell shares jump on forecast it will double AI server revenue",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-shares-jump-on-forecast-it-will-double-ai-server-revenue-ce7e5cdfd88af321",
            "pub_date": "2026-02-27 20:51:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Target to remove synthetic color from cereals by May end",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/target-to-remove-synthetic-color-from-cereals-by-may-end-ce7e5cdfd88af424",
            "pub_date": "2026-02-27 20:45:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Bank of Ningbo elects chairman, appoints bank president",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/bank-of-ningbo-elects-chairman-appoints-bank-president-ce7e5cdfd88af524",
            "pub_date": "2026-02-27 20:45:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Food companies to phase out artificial dyes, sweeteners in health drive",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/food-companies-to-phase-out-artificial-dyes-sweeteners-in-health-drive-ce7e5cdfd88af726",
            "pub_date": "2026-02-27 20:45:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Dollar Mixed Early Friday Ahead of Producer Prices, Chicago Purchasing Managers' Index, Construction Data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-dollar-mixed-early-friday-ahead-of-producer-prices-chicago-purchasing-managers-index-construct-ce7e5cdfd88bf025",
            "pub_date": "2026-02-27 20:45:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Regeneron, Sanofi Get CHMP Backing for Dupixent in Younger Children With CSU",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Colin Kellaher </p><br/><p>\n  Regeneron Pharmaceuticals and Sanofi said a key European regulatory committee has recommended expanded approval of their blockbuster anti-inflammatory drug Dupixent for younger patients with the inflammatory skin condition chronic spontaneous urticaria, or CSU. </p><!-- Article --><p>\n\n  Regeneron and Sanofi on Friday said the recommendation from the European Medicines Agency's Committee for Medicinal Products for Human Use covers Dupixent in children ages 2 to 11 with moderate-to-severe CSU, an inadequate response to histamine-1 antihistamines and who are naive to anti-immunoglobulin E therapy for CSU. </p><p>\n\n  The European Commission, which generally follows CHMP's advice, is expected to make a final decision in the coming months, the companies said. </p><p>\n\n  Regeneron and Sanofi last year won European approval of Dupixent for people 12 and older with CSU. </p><p>\n\n  Tarrytown, N.Y., biotechnology company Regeneron created Dupixent and markets it jointly in the U.S. with France's Sanofi under a 2007 collaboration agreement, while Sanofi markets the drug internationally. Dupixent global net sales reached about $18.5 billion last year. </p><br/><p>\n  Write to Colin Kellaher at colin.kellaher@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 0738ET</p></div>",
            "link": "https://hk.marketscreener.com/news/regeneron-sanofi-get-chmp-backing-for-dupixent-in-younger-children-with-csu-ce7e5cdfd88bf024",
            "pub_date": "2026-02-27 20:45:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S envoy Barrack meets Iraq's ex-prime minister Maliki, two sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-envoy-barrack-meets-iraq-s-ex-prime-minister-maliki-two-sources-say-ce7e5cdfd88bf321",
            "pub_date": "2026-02-27 20:45:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "SM Prime Holdings, Inc. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>SM Prime Holdings, Inc. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was PHP 83,566.64 million compared to PHP 78,673.92 million a year ago. Revenue was PHP 141,107.02 million compared to PHP 140,390.87 million a year ago.</p><p>Net income was PHP 48,847.73 million compared to PHP 45,631.76 million a year ago. Basic earnings per share from continuing operations was PHP 1.694 compared to PHP 1.581 a year ago. Diluted earnings per share from continuing operations was PHP 1.694 compared to PHP 1.581 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/sm-prime-holdings-inc-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfd88bf320",
            "pub_date": "2026-02-27 20:45:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sanofi, Regeneron Win EU Panel's Positive Opinion for Skin Disease Treatment in Young Children",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sanofi-regeneron-win-eu-panel-s-positive-opinion-for-skin-disease-treatment-in-young-children-ce7e5cdfd88bf326",
            "pub_date": "2026-02-27 20:45:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "National Silicon Industry Group Co., Ltd. Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>National Silicon Industry Group Co., Ltd. reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 3,716.03 million compared to CNY 3,387.61 million a year ago. Net loss was CNY 1,475.75 million compared to CNY 970.54 million a year ago.</p><p>Basic loss per share from continuing operations was CNY 0.528 compared to CNY 0.353 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/national-silicon-industry-group-co-ltd-reports-earnings-results-for-the-full-year-ended-december-ce7e5cdfd88bf423",
            "pub_date": "2026-02-27 20:45:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Novartis Receives Positive Chmp Opinion for Remibrutinib in Chronic Spontaneous Urticaria",
            "description": "<div class=\"txt-s4 article-text\"><p>Novartis has announced that the Committee for Medicinal Products for Human Use (CHMP) of the European Medicines Agency (EMA) has adopted a positive opinion recommending marketing authorization for remibrutinib. Remibrutinib is a highly selective oral Bruton?s tyrosine kinase inhibitor (BTKi) intended for the treatment of chronic spontaneous urticaria (CSU) in adult patients who have an inadequate response to H1-antihistamine treatment. The positive opinion is supported by results from the pivotal REMIX-1 and REMIX-2 Phase III trials, which demonstrated improvements in symptoms as early as Week 1, with a favorable safety profile and no liver safety concerns through Week 52.</p><p>This development represents a significant advancement in providing a targeted therapy for CSU, addressing a substantial unmet medical need. The European Commission (EC) is expected to issue a final decision within approximately two months.</p></div>",
            "link": "https://hk.marketscreener.com/news/novartis-receives-positive-chmp-opinion-for-remibrutinib-in-chronic-spontaneous-urticaria-ce7e5cdfd88bf527",
            "pub_date": "2026-02-27 20:45:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's KFA bought about 66,000 tons of corn, traders say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-kfa-bought-about-66-000-tons-of-corn-traders-say-ce7e5cdfd88bf524",
            "pub_date": "2026-02-27 20:45:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Stocks Fall Pre-Bell Ahead of Wholesale Inflation Report",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/stocks-fall-pre-bell-ahead-of-wholesale-inflation-report-ce7e5cdfd88bf627",
            "pub_date": "2026-02-27 20:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visual China Group plans to seek Hong Kong listing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/visual-china-group-plans-to-seek-hong-kong-listing-ce7e5cdfd88bf725",
            "pub_date": "2026-02-27 20:36:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}