{
    "data": [
        {
            "title": "Economists Paint Optimistic Picture of Singapore's 2026 Growth Outlook",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/economists-paint-optimistic-picture-of-singapore-s-2026-growth-outlook-ce7e5cd8d08ef024",
            "pub_date": "2026-02-26 19:15:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Moody's Affirms Engie's Ratings, Outlook Amid GBP10.5 Billion Purchase of UKPN",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/moody-s-affirms-engie-s-ratings-outlook-amid-gbp10-5-billion-purchase-of-ukpn-ce7e5cd8d08ef123",
            "pub_date": "2026-02-26 19:15:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese influence operation targets Japan elections, Trump, other countries, US foundation says",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - In the days surrounding Japanese Prime Minister Sanae Takaichi's February election win, several dozen X accounts linked to a Chinese misinformation campaign attacked her deeply conservative views and hawkish approach to China, said a U.S. research institute focused on national security and foreign policy. </p><p>\n              The 35 accounts, along with nine channels on the microblogging site Tumblr, pushed corruption allegations and portrayed Takaichi as illegitimate and militaristic. The accounts suggest the prime minister is a reckless \"cult-backed\" leader driving Japan toward war, said Maria Riofrio, a researcher with the Foundation for Defense of Democracy's Center on Cyber and Technology Innovation. </p><!-- Article --><p>\n              The accounts, part of a network of at least 327 X and other social media accounts, have since December or earlier attacked adversaries of Beijing or pushed pro-China policy positions, and targeted human rights organizations and sought to influence domestic politics in Japan, the United States, the Philippines and Latin America, according to a new analysis by Riofrio.    </p><p>\n              A spokesperson for Takaichi said her office is aware of suspicious foreign social media accounts that have posted content related to Japan's elections. </p><p>\n              \"We consider this to be a national security threat that undermines the very foundations of democracy, including the fairness of elections and freedom of the press. We believe that countermeasures must be urgently prioritized.\" </p><p>\n              Spokesperson Liu Pengyu for the Chinese Embassy in Washington said the \"analysis\" by the FDD was \"groundless.\"</p><p>\n              \"The Chinese government consistently opposes and combats the use of fake accounts and other tactics to manipulate public opinion or spread disinformation,\" Liu said in a statement to Reuters. </p><p>\n              \"We urge the relevant parties to stop making unfounded accusations and smearing others based on speculation.\"</p><p>\n              Riofrio identified the most recent campaign as a distinct cluster based on its pro-China narratives that has coordinated on messaging content containing overlapping hashtags and other similarities. The cluster is likely part of long-running Chinese information operations that internet security analysts have dubbed Spamouflage or Dragonbridge, she said. </p><p>\n              Although engagement with the material is low, users do see the content in social media feeds and the operators work algorithms to boost the content. One tweet that accused Takaichi of being in a cult, for example, received only two likes but was viewed more than 1,000 times. </p><p>\n              The activity demonstrates \"China has the political will to interfere in Japanese elections and internal affairs,\" Riofrio said, noting that the overall cluster has similar operations targeting other countries, including the United States. </p><p>\n              The FDD is a Washington-based nonprofit focused on \"strengthening U.S. national security and reducing or eliminating threats posed by adversaries and enemies of the United States and other free nations,\" according to its website. </p><p><b>ATTACKS ON TRUMP, ASIA-PACIFIC NATIONS</b></p><p>\n              The Nikkei newspaper reported earlier this week on another set of suspected foreign-backed online operations attacking the Japanese elections. </p><p>\n              Riofrio said nearly half of the 327 accounts attacked U.S. President Donald Trump, pushing the narrative that his drug and border policies have worsened America's fentanyl crisis, reversing gains made during the Biden era, while also deflecting blame from China, according to the FDD analysis. </p><p>\n              In a coordinated sequence of messaging in early February on Trump and fentanyl, six accounts, despite having fewer than 10 followers each, attracted hundreds of likes, retweets and replies and nearly 18,000 views as of February 12, Riofrio said.</p><p>\n              One account in the network, FentanylFreeA, created in December 2025, Riofrio said, seemingly seeks to emulate the U.S. Drug Enforcement Agency's Fentanyl Free America campaign, using a similar name and identical imagery. The account attacks both the U.S. and India, which it blames as the source of fentanyl precursor drugs. </p><p>\n              Neither the White House or the DEA responded to a request for comment. </p><p>\n              The operations known as Spamouflage or Dragonbridge have been active since at least 2017 and have repeatedly targeted audiences around the world over the years, according to experts. </p><p>\n              A spokesperson for Google's Threat Intelligence Group said Dragonbridge is the most prolific pro-PRC information operations operator that it tracks as of early 2026 based on \"its massive scale and assertive narrative agenda.\" </p><p>\n              Dragonbridge, while maintaining a foundational focus on targeting the U.S., overseas dissidents, government critics and international NGOs, has become notably more assertive in the Asia-Pacific, the Google spokesperson said, including by targeting the political leadership of Japan, Japan-Taiwan relations, Vietnam over its South China Sea activities, India and the Philippine administration. </p><p>\n              OpenAI on Wednesday reported that it had disrupted attempts in mid-October by a Chinese law enforcement official to help plan a multi-stage information attack on Takaichi. </p><p></p><p> (Reporting by AJ Vicens in Detroit; Additional reporting by Kentaro Sugiyama and Hina Suzuki in Tokyo; Editing by Chris Sanders and Tom Hogue)</p><p>\n            By AJ Vicens, Hina Suzuki and Kentaro Sugiyama</p></div>",
            "link": "https://hk.marketscreener.com/news/chinese-influence-operation-targets-japan-elections-trump-other-countries-us-foundation-says-ce7e5cd8d08ef227",
            "pub_date": "2026-02-26 19:15:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie Price Target, Estimates Raised as Barclays Notes \"Major Strategic Milestone\" With UK Power Networks Deal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-price-target-estimates-raised-as-barclays-notes-major-strategic-milestone-with-uk-power-net-ce7e5cd8d08ef323",
            "pub_date": "2026-02-26 19:15:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CRISIL Upgrades Rating on Solarworld Energy Solutions' Bank Facilities to A-; Outlook Stable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/crisil-upgrades-rating-on-solarworld-energy-solutions-bank-facilities-to-a-outlook-stable-ce7e5cd8d08ef321",
            "pub_date": "2026-02-26 19:15:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIBC Quarterly Profit Boosted by Revenue Growth Across Business Segments",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Canadian Imperial Bank of Commerce notched a jump in first-quarter earnings on the back of record revenue across each of its business units and a strengthened return on equity. </p><!-- Article --><p>\n\n  CIBC, one of the country's largest lenders, recorded net income of 3.10 billion Canadian dollars ($2.27 billion), or C$3.21 a share, for the three months ended Jan. 31, against C$2.17 billion, or C$2.19, a year earlier. On an adjusted basis, per-share earnings came in at C$2.76, above the C$2.40 mean estimate of analysts polled by FactSet. </p><p>\n\n  Total revenue climbed 15% to C$8.4 billion, beating the C$7.7 billion analysts anticipated. </p><p>\n\n  Return on equity, a measure of profitability and efficiency, widened to 17.4% on an adjusted basis from 15.3% in the same period last year. </p><p>\n\n  CIBC's provision for credit losses was C$568 million in the latest quarter, down C$37 million on the quarter before and C$5 million below a year earlier. Analysts were expecting C$562 million analysts expected to be put aside against the risk of defaults. </p><p>\n\n  The provision for credit losses on performing loans fell on a the same period last year thanks to a more favorable economic outlook, while the provision on impaired loans was up mainly due to higher provisions in Canadian commercial banking and wealth management, and Canadian personal and business banking, CIBC said. </p><p>\n\n  Excluding provisions and tax, earnings for the second quarter were 19% higher than a year earlier at C$4.08 billion, CIBC said. </p><p>\n\n  The bank's Canadian personal and business banking segment recorded a 25% rise in net income as revenue was driven by a higher net interest margin and loan growth. Commercial banking and wealth management income in Canada was up about 9% year-over-year, thanks to higher fee-based revenue in its wealth business and a lift in commissions with increased client activity. </p><p>\n\n  CIBC's U.S. commercial banking and wealth unit logged a 19% increase in net income, as a rise in commercial revenue due to higher volumes, net interest margin and increased advisory fees offset a drop in wealth management revenue with lower annual performance-based mutual fund fees. </p><p>\n\n  The bank's common equity Tier 1 capital ratio stood at 13.4% for the three-month period, slightly wider than the 13.3% at the end of the prior quarter. </p><p>\n\n  Canada's banking regulator requires the big banks to hold a capital ratio of no less than 11.5% of risk-weighted assets. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 0610ET</p></div>",
            "link": "https://hk.marketscreener.com/news/cibc-quarterly-profit-boosted-by-revenue-growth-across-business-segments-ce7e5cd8d08ef324",
            "pub_date": "2026-02-26 19:15:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Most Americans back Trump's deportation goals but not his tactics, Reuters/Ipsos poll finds",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Most Americans share President Donald Trump's view that immigrants living illegally in the U.S. should be deported, but generally disapprove of his hard-line tactics, including masked agents in tactical gear who have clashed with U.S. citizens, a new Reuters/Ipsos poll found.</p><p>\n              The six-day poll, concluded on Monday, illustrates both the broad appeal of Trump's focus on immigration enforcement and the widespread disapproval of his tactics that could weigh on his Republican Party in November 3 congressional midterm elections.</p><!-- Article --><p>\n              Some 61% of respondents - including 92% of Republicans and 35% of Democrats - said they \"support deporting unauthorized immigrants.\" Trump's stand on the issue helped him win the 2024 presidential election as he accused Democratic politicians of favoring \"open borders.\"</p><p>\n              Sixty-three percent of Democrats said they do not support deporting unauthorized immigrants, compared with 7% of Republicans.</p><p>\n              During Tuesday's State of the Union address, Trump tried to reclaim the narrative on immigration, which had been among his greatest political strengths before a wave of street clashes involving ICE agents. These have included separation of families and fatal shootings of two U.S. citizens. Trump on Tuesday said his focus was on criminals, noting, \"We're getting them the hell out of here fast.\"</p><p><b>ICE GONE TOO FAR, SURVEY FINDS</b></p><p>\n              Some 60% of Americans - including a fifth of Republicans and nine in 10 Democrats - think immigration agents have gone too far, the Reuters/Ipsos poll found. Among people who do not identify with either party, 65% think authorities have gone too far. These independent voters could be a critical swing group in November when Republicans will try to maintain their thin majorities in the U.S. House of Representatives and U.S. Senate.</p><p>\n              Disapproval of Trump's tactics is particularly high among Black and Hispanic Americans, two slices of the electorate that Trump made progress with in the 2024 election.</p><p>\n              Seventy-four percent of Black respondents and 72% of Hispanics said they did not like how the administration was handling deportations, compared with 51% of white respondents.</p><p>\n              Since February 2025, Trump's overall approval rating among Hispanic Americans has dropped by 7 percentage points to 29% in the latest survey. Among Black Americans it has ticked 2 percentage points lower to 14%. Among white Americans it is down 4 points to 49%.</p><p>\n              Significant internal divisions have opened in both political parties over immigration enforcement. Among Republicans who support deportations, 23% said they were uncomfortable with the current tactics employed by immigration officers. Democrats, besides being divided on whether unauthorized immigrants should be deported at all, also disagree on whether to disband the Immigration and Customs Enforcement branch of the Department of Homeland Security, known as ICE, a central enforcement body. </p><p><b>RISING DEMOCRATIC OPPOSITION</b></p><p>\n              Some 63% of Democrats said ICE should be abolished, while 30% disagreed. The share in favor was a significant increase from a 2018 Reuters/Ipsos survey that showed 44% of Democrats supporting the idea. The latest survey showed only a third of independents back getting rid of ICE, little changed from 2018.</p><p>\n              Only a handful of Democratic congressional candidates this year have called for abolishing the agency, with centrist organizations such as Third Way warning that embracing the idea could hurt Democrats at the polls in November.</p><p>\n              The latest Reuters/Ipsos survey, which was conducted online, gathered responses from 4,638 U.S. adults nationwide and had a margin of error of two percentage points.</p><p></p><p> (Reporting by Jason Lange in Washington; editing by Scott Malone and David Gregorio)</p><p>\n            By Jason Lange</p></div>",
            "link": "https://hk.marketscreener.com/news/most-americans-back-trump-s-deportation-goals-but-not-his-tactics-reuters-ipsos-poll-finds-ce7e5cd8d08ef42d",
            "pub_date": "2026-02-26 19:15:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CARE Keeps BBB+ Long-Term Rating on POCL Enterprises' Bank Facilities; Outlook Stable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/care-keeps-bbb-long-term-rating-on-pocl-enterprises-bank-facilities-outlook-stable-ce7e5cd8d08ef42c",
            "pub_date": "2026-02-26 19:15:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hillary Clinton to testify in congressional Epstein probe",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Former U.S. Secretary of State Hillary Clinton is due to testify behind closed doors on Thursday to a congressional committee investigating the late sex offender Jeffrey Epstein, though it is not clear how much new information will come to light.</p><p>\n              Clinton, the 2016 Democratic presidential nominee, has said she has little information to provide and has accused the Republican-led panel of trying to shift focus away from President Donald Trump's ties to Epstein, who died by suicide in jail in 2019 while awaiting trial on federal sex-trafficking charges.</p><!-- Article --><p>\n              She and her husband, Democratic former President Bill Clinton, initially refused to testify before the House of Representatives Oversight Committee, but relented when lawmakers moved to hold them in contempt of Congress. </p><p>\n              Hillary Clinton is due to deliver a closed-door deposition to the committee at 11 a.m. ET (1600 GMT) in Chappaqua, New York, near their main residence. Bill Clinton is scheduled to testify at the same time on Friday. </p><p>\n              A spokesperson for the Clintons did not respond to a request for comment.</p><p>\n              Committee chairman James Comer of Kentucky, a Republican, has said transcripts of their interviews will be made public.</p><p>\n              Hillary Clinton's ties to Epstein are unclear. </p><p>\n              Bill Clinton flew on Epstein's plane several times in the early 2000s after he left office. He has denied wrongdoing and expressed regret for his association.</p><p>\n              According to Comer, Epstein visited the White House 17 times while Clinton was in office. </p><p>\n              Trump also socialized extensively with Epstein in the 1990s and 2000s, before his 2008 conviction for soliciting prostitution from a minor. Comer said evidence gathered by the panel does not implicate Trump.</p><p>\n              Trump's Justice Department has released more than 3 million pages of Epstein-related documents over the past several months to comply with a law passed by Congress.</p><p>\n              The Justice Department sought to draw attention to photos of Bill Clinton, but the documents also have revealed Epstein's ties to a long list of business and political leaders, including Commerce Secretary Howard Lutnick and Tesla CEO Elon Musk.</p><p>\n              Overseas, they have prompted criminal investigations of Britain's Andrew Mountbatten-Windsor, the former Duke of York, and other prominent figures.</p><p></p><p> (Reporting by Richard Cowan and Nolan D. McCaskill; editing by Andy Sullivan and Alistair Bell)</p></div>",
            "link": "https://hk.marketscreener.com/news/hillary-clinton-to-testify-in-congressional-epstein-probe-ce7e5cd8d08ef420",
            "pub_date": "2026-02-26 19:15:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wilmar International Logs Higher Attributable Profit in H2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wilmar-international-logs-higher-attributable-profit-in-h2-ce7e5cd8d08ffe22",
            "pub_date": "2026-02-26 19:15:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UOL's Attributable Profit Surges 21% in H2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uol-s-attributable-profit-surges-21-in-h2-ce7e5cd8d08ffe25",
            "pub_date": "2026-02-26 19:15:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Steel says 2025 net loss at T$4.4 bln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-steel-says-2025-net-loss-at-t-4-4-bln-ce7e5cd8d08df120",
            "pub_date": "2026-02-26 19:00:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Telefónica Picks Nokia to Launch Edge Node Project in Spain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/telef-nica-picks-nokia-to-launch-edge-node-project-in-spain-ce7e5cd8d08df22d",
            "pub_date": "2026-02-26 18:55:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon refused permission to appeal go-ahead for two UK lawsuits from retailers, consumers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/amazon-refused-permission-to-appeal-go-ahead-for-two-uk-lawsuits-from-retailers-consumers-ce7e5cd8d08df220",
            "pub_date": "2026-02-26 18:55:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nordic countries investigate a threat to the region's energy infrastructure, Sweden's TV4 reports, citing sources",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nordic-countries-investigate-a-threat-to-the-region-s-energy-infrastructure-sweden-s-tv4-reports-c-ce7e5cd8d08df225",
            "pub_date": "2026-02-26 18:55:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Deutsche Telekom CEO - We will do whatever we can to avoid giving up any spectrum",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/deutsche-telekom-ceo-we-will-do-whatever-we-can-to-avoid-giving-up-any-spectrum-ce7e5cd8d08df323",
            "pub_date": "2026-02-26 18:55:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China removes emergency management minister, state media reports",
            "description": "<div class=\"txt-s4 article-text\"><p>BEIJING, Feb 26 (Reuters) - China on Thursday removed Wang Xiangxi from the post of emergency management minister, state media reported, after the country's anti-graft watchdog announced a probe into Wang in January citing suspected \"serious violations of discipline and law.\"</p><p></p><p> (Reporting by Beijing Newsroom)</p></div>",
            "link": "https://hk.marketscreener.com/news/china-removes-emergency-management-minister-state-media-reports-ce7e5cd8d08df52c",
            "pub_date": "2026-02-26 18:55:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chu Kong Shipping's Chair Steps Down",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chu-kong-shipping-s-chair-steps-down-ce7e5cd8d08df523",
            "pub_date": "2026-02-26 18:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Baidu's Net Income Plummets in Q4 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/baidu-s-net-income-plummets-in-q4-2025-ce7e5cd8d08df524",
            "pub_date": "2026-02-26 18:55:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hong Kong Banks' Capitalization to Remain Strong Despite Extreme Property Sector Shocks, S&P Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hong-kong-banks-capitalization-to-remain-strong-despite-extreme-property-sector-shocks-s-p-says-ce7e5cd8d08af026",
            "pub_date": "2026-02-26 18:50:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mirxes Plans India Cancer Screening Tie-Up With Apollo Health and Lifestyle",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mirxes-plans-india-cancer-screening-tie-up-with-apollo-health-and-lifestyle-ce7e5cd8d08af12d",
            "pub_date": "2026-02-26 18:50:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China Beststudy Education Forecasts Up to 77% Higher Profit for 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-beststudy-education-forecasts-up-to-77-higher-profit-for-2025-ce7e5cd8d08af122",
            "pub_date": "2026-02-26 18:50:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CITIC Resources Won't Appeal Indonesian Court Ruling on Seram Block Case",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/citic-resources-won-t-appeal-indonesian-court-ruling-on-seram-block-case-ce7e5cd8d08af120",
            "pub_date": "2026-02-26 18:50:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ab&B Bio-Tech Expects Narrower Loss on Revenue Surge in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ab-b-bio-tech-expects-narrower-loss-on-revenue-surge-in-2025-ce7e5cd8d08af126",
            "pub_date": "2026-02-26 18:50:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "How China is masking drone flights in potential Taiwan rehearsal",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/how-china-is-masking-drone-flights-in-potential-taiwan-rehearsal-ce7e5cd8d08af32d",
            "pub_date": "2026-02-26 18:50:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "AXA 2025 gross written premiums & other revenues at EUR 115.52 billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/axa-2025-gross-written-premiums-other-revenues-at-eur-115-52-billion-ce7e5cd8d08af320",
            "pub_date": "2026-02-26 18:50:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ROI-China is shifting crude oil buying in response to price rally: Russell",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/roi-china-is-shifting-crude-oil-buying-in-response-to-price-rally-russell-ce7e5cd8d08af427",
            "pub_date": "2026-02-26 18:50:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "HSBC Upgrades Cathay Pacific Airways to Buy from Restricted, Price Target is HK$16",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hsbc-upgrades-cathay-pacific-airways-to-buy-from-restricted-price-target-is-hk-16-ce7e5cd8d08af425",
            "pub_date": "2026-02-26 18:50:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ubs Switzerland Country Head Keller-Busse: Biggest Disruption For Financial Centre Will Come From Technology",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ubs-switzerland-country-head-keller-busse-biggest-disruption-for-financial-centre-will-come-from-te-ce7e5cd8d08af625",
            "pub_date": "2026-02-26 18:50:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Engie Lifts Midterm Guidance on Planned GBP10.5 Billion Takeover of UK Power Networks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/engie-lifts-midterm-guidance-on-planned-gbp10-5-billion-takeover-of-uk-power-networks-ce7e5cd8d08bfe26",
            "pub_date": "2026-02-26 18:50:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "King Yuan Electronics Buys Machinery Equipment for NT$1.65 Billion",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/king-yuan-electronics-buys-machinery-equipment-for-nt-1-65-billion-ce7e5cd8d08bf323",
            "pub_date": "2026-02-26 18:41:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shell Reportedly in Talks for Sale of Minority Stake in Western Australian LNG Export Plant",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/shell-reportedly-in-talks-for-sale-of-minority-stake-in-western-australian-lng-export-plant-ce7e5cd8d08bf326",
            "pub_date": "2026-02-26 18:41:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Chinese Drug Regulator Accepts Guojian Pharmaceutical's New Drug Application for Atopic Dermatitis Drug",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/chinese-drug-regulator-accepts-guojian-pharmaceutical-s-new-drug-application-for-atopic-dermatitis-d-ce7e5cd8d08bf420",
            "pub_date": "2026-02-26 18:41:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Lite-On Technology to Absorb Unit; Shares Drop 10%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/lite-on-technology-to-absorb-unit-shares-drop-10-ce7e5cd8d08bf52d",
            "pub_date": "2026-02-26 18:41:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jinpan Smart Technology 2025 Profit Up 15%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jinpan-smart-technology-2025-profit-up-15-ce7e5cd8d08bf62c",
            "pub_date": "2026-02-26 18:41:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Gsk plc Has Announces That Japan's Ministry of Health, Labour and Welfare Has Accepted the New Drug Application for Bepirovirsen",
            "description": "<div class=\"txt-s4 article-text\"><p>GSK PLC has announced that Japan's Ministry of Health, Labour and Welfare (MHLW) has accepted the new drug application (NDA) for bepirovirsen, an investigational antisense oligonucleotide (ASO), for the treatment of adults with chronic hepatitis B (CHB). This acceptance marks the first regulatory filing globally for bepirovirsen, which has been granted SENKU designation in Japan, enabling expedited review. The submission is supported by positive results from the B-Well 1 and B-Well 2 Phase III trials, demonstrating statistically significant and clinically meaningful functional cure rates.</p><p>Bepirovirsen aims to address the high unmet medical need for chronic hepatitis B treatment, which affects nearly one million people in Japan and is a leading cause of liver cancer. The SENKU designation reflects the innovation and potential of bepirovirsen to facilitate early patient access through an expedited regulatory review process.</p></div>",
            "link": "https://hk.marketscreener.com/news/gsk-plc-has-announces-that-japan-s-ministry-of-health-labour-and-welfare-has-accepted-the-new-drug-ce7e5cd8d08bf72d",
            "pub_date": "2026-02-26 18:41:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veolia Reinforces Its Presence in India by Securing Strategic Contracts of Unprecedented Scale",
            "description": "<div class=\"txt-s4 article-text\"><p>Veolia has reinforced its presence in India by securing strategic contracts of unprecedented scale -the largest contracts ever signed by a French company in the municipal water sector- for two of Mumbai's largest Water Treatment Plants (WTPs), supporting the city's water security and sustainability goals. The company has been appointed as the technology provider and awarded 15-year operations and maintenance contracts for Mumbai's upcoming 2,000 million liters per day Bhandup and 910 million liters per day Panjrapur Water Treatment Plants. Developed by Welspun Enterprises Ltd, both facilities are scheduled to be fully operational by 2030 and are expected to meet over 60% of the city's water requirements.</p><p>Equipped with Veolia's advanced technologies, the plants will deliver high-quality, reliable water while optimizing footprint, reducing energy consumption, and enhancing operational efficiency--making them ideally suited to dense urban environments. To win these contracts, Veolia drew on 25 years of experience in India, and in particular its most significant achievement to date; the operation of the innovative Nagpur water supply project, which includes five water treatment plants with a total capacity of approximately 786 million liters per day. Thanks to digital innovations such as Hubgrade®?, Veolia was able to improve the performance of the water distribution system in the city, reducing Non-Revenue Water (NRW) from around 70% to below 30%, while delivering continuous, pressurised water to over 3.5 million residents.</p><!-- Article --><p>The company also maintains a strong operational presence in Delhi through Nangloi Water Services providing water to nearly 1 million inhabitants in the Nangloi area and across multiple cities in Karnataka, delivering integrated municipal water solutions at scale. Beyond Municipal Water, Expanding Tailored Solutions in Waste and Energy In India, Veolia plays a key role in hazardous waste treatment, one of the boosters of its strategic GreenUp program. The company operates strategic infrastructure across India's industrial hubs, including Gujarat's first Zero Liquid Discharge (ZLD) facility in Ankleshwar, a landmark project enabling responsible wastewater management for industrial clusters.</p><p>Veolia is developing a landfill facility in Magnad, set to become India's largest industrial hazardous waste landfill, with a capacity of 15 million metric tons and an operational lifespan of 30 years. The company is working with nearby local communities to produce green fuel for on-site use, reducing the carbon footprint of hazardous waste treatment. Veolia is also advancing expansion plans across Maharashtra, including projects near Mumbai, to further strengthen regional hazardous waste management capabilities in alignment with the evolving needs of local industries.</p><p>pioneering industrial decarbonisation, Veolia operates India's first 5-tonnes-per-day (TPD) carbon capture plant for Tata Steel in Jamshedpur, capturing CO2 directly from blast furnace gas for reuse and positioning the company at the forefront of the nation's net-zero ambitions.</p></div>",
            "link": "https://hk.marketscreener.com/news/veolia-reinforces-its-presence-in-india-by-securing-strategic-contracts-of-unprecedented-scale-ce7e5cd8d08bf725",
            "pub_date": "2026-02-26 18:41:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hysan Development Books Higher Profit in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hysan-development-books-higher-profit-in-2025-ce7e5cd8d088fe2d",
            "pub_date": "2026-02-26 18:41:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eni's Board Declares Third Tranche of FY25 Dividend",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eni-s-board-declares-third-tranche-of-fy25-dividend-ce7e5cd8d088fe22",
            "pub_date": "2026-02-26 18:41:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ferrovial's FY25 Net Profit Plummets; Revenue Up",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ferrovial-s-fy25-net-profit-plummets-revenue-up-ce7e5cd8d088fe25",
            "pub_date": "2026-02-26 18:36:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}