{
    "data": [
        {
            "title": "S&P 500, Nasdaq fall as Nvidia results fail to impress, stalling tech rally",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/s-p-500-nasdaq-fall-as-nvidia-results-fail-to-impress-stalling-tech-rally-ce7e5cd9d089f625",
            "pub_date": "2026-02-27 06:20:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CDC vaccine advisors to consider COVID-19 vaccine injuries, long COVID",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cdc-vaccine-advisors-to-consider-covid-19-vaccine-injuries-long-covid-ce7e5cd9d089f624",
            "pub_date": "2026-02-27 06:20:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tata Steel buys shares of T Steel Holdings worth $264 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tata-steel-buys-shares-of-t-steel-holdings-worth-264-million-ce7e5cd9d089f72d",
            "pub_date": "2026-02-27 06:20:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eni can now receive oil from Venezuela as payment for gas, CEO says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/eni-can-now-receive-oil-from-venezuela-as-payment-for-gas-ceo-says-ce7e5cd9d089f725",
            "pub_date": "2026-02-27 06:20:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CNBC to unify digital, TV news operations and lay off nearly a dozen employees, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cnbc-to-unify-digital-tv-news-operations-and-lay-off-nearly-a-dozen-employees-sources-say-ce7e5cd9d089f724",
            "pub_date": "2026-02-27 06:20:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CEO says co to bring Nvidia's new Rubin GPU platform to market in the second-half of 2026",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-ceo-says-co-to-bring-nvidia-s-new-rubin-gpu-platform-to-market-in-the-second-half-of-2026-ce7e5cd9d180fe24",
            "pub_date": "2026-02-27 06:20:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies COO: NAND spot cost up nearly 4 times in last 6 months to $0.20/GB",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-coo-nand-spot-cost-up-nearly-4-times-in-last-6-months-to-0-20-gb-ce7e5cd9d180ff2c",
            "pub_date": "2026-02-27 06:20:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CEO: We have now delivered more than 50,000 Grace Blackwells to the impacted customer",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-ceo-we-have-now-delivered-more-than-50-000-grace-blackwells-to-the-impacted-customer-ce7e5cd9d180ff23",
            "pub_date": "2026-02-27 06:20:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CEO: We quickly cleared the delays discussed in our third quarter",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-ceo-we-quickly-cleared-the-delays-discussed-in-our-third-quarter-ce7e5cd9d180ff22",
            "pub_date": "2026-02-27 06:20:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies COO: DRAM spot market up nearly 5.5 times in last 6 months to $2.39 a gigabit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-coo-dram-spot-market-up-nearly-5-5-times-in-last-6-months-to-2-39-a-gigabit-ce7e5cd9d180ff26",
            "pub_date": "2026-02-27 06:20:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CEO: We contracted close to two gigawatts of additional power in 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-ceo-we-contracted-close-to-two-gigawatts-of-additional-power-in-2025-ce7e5cd9d180ff24",
            "pub_date": "2026-02-27 06:20:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Yen strengthens after Bank of Japan signals data-driven rate hikes",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/yen-strengthens-after-bank-of-japan-signals-data-driven-rate-hikes-ce7e5cd9d180f22d",
            "pub_date": "2026-02-27 06:16:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russian rouble seen falling sharply this year as oil sales fall and deficit rises",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russian-rouble-seen-falling-sharply-this-year-as-oil-sales-fall-and-deficit-rises-ce7e5cd9d180f223",
            "pub_date": "2026-02-27 06:16:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US proposes severing Swiss bank from financial system over alleged Iran, Russia, Venezuela links",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-proposes-severing-swiss-bank-from-financial-system-over-alleged-iran-russia-venezuela-links-ce7e5cd9d180f226",
            "pub_date": "2026-02-27 06:16:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Veolia Environnement SA Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Veolia Environnement SA reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was EUR 44,396 million compared to EUR 44,692 million a year ago. Net income was EUR 1,217 million compared to EUR 1,098 million a year ago.</p><p>Basic earnings per share from continuing operations was EUR 1.71 compared to EUR 1.59 a year ago. Diluted earnings per share from continuing operations was EUR 1.7 compared to EUR 1.54 a year ago. Basic earnings per share was EUR 1.55 compared to EUR 1.45 a year ago.</p><!-- Article --><p>Diluted earnings per share was EUR 1.54 compared to EUR 1.4 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/veolia-environnement-sa-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9d180f224",
            "pub_date": "2026-02-27 06:16:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JS Global Lifestyle expects net loss of no more than $22.5 million for FY",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/js-global-lifestyle-expects-net-loss-of-no-more-than-22-5-million-for-fy-ce7e5cd9d180f423",
            "pub_date": "2026-02-27 06:16:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Co expects Vera Rubin to ship in 2H FY27",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-co-expects-vera-rubin-to-ship-in-2h-fy27-ce7e5cd9d180f422",
            "pub_date": "2026-02-27 06:16:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Co expects smoother transition with Vera Rubin than Grace, Blackwell Nvidia chips",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-co-expects-smoother-transition-with-vera-rubin-than-grace-blackwell-nvidia-ce7e5cd9d180f52c",
            "pub_date": "2026-02-27 06:16:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CEO says co grew number of customers committed to spending at least $1 million on CoreWeave Cloud by nearly 150% in 2025 - conf call",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-ceo-says-co-grew-number-of-customers-committed-to-spending-at-least-1-million-on-coreweav-ce7e5cd9d180f520",
            "pub_date": "2026-02-27 06:16:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trading Day: Nvidia swings and misses",
            "description": "<div class=\"txt-s4 article-text\"><p>ORLANDO, Florida, Feb 26 (Reuters) - A heavy selloff in tech stocks pushed the S&amp;P 500 and Nasdaq lower on Thursday after investors' initial positive reaction to AI chipmaker Nvidia's results was replaced by doubt and pessimism, while safe-haven assets gold and Treasuries rose. </p><p>\n              More on that below. In my column today I look at the blistering rally in emerging market equities this year, led by South Korea's astonishing 50% surge, and ponder when the pause or correction comes. There's no way it can continue at this pace, can it?</p><!-- Article --><p>\n              If you have more time to read, here are a few articles I recommend to help you make sense of what happened in markets today.</p>                                1.         Nvidia's CEO prepares investors for a renewed battlewith Intel, AMD     2.         IMF calls for U.S. fiscal consolidation to bring down\"too big\" current account deficit          3.         To win Europe's embrace, China needs to uncap the yuan:Mike Dolan          4.         Rare earth shortages worsen in U.S. aerospace, chipsdespite trade truce, sources say          5.         Japan's Takaichi gets her doves in a row with BOJ boardappointees <p>Today's Key Market Moves</p>                                *         STOCKS: Nasdaq -1.3%, S&amp;P 500 -0.5%. Dow and Russell2000 in the green. New highs overnight for Japan, Taiwan, SouthKorea, UK, and MSCI EM and Asia ex-Japan benchmark indices.     *         SECTORS/SHARES: Seven of S&amp;P 500's 11 sectors fall, tech-1.8%. Philadelphia semiconductor index -3%, Nvidia -5.5%.Financials +1.3%, Paramount Skydance +10%.    *         FX: Dollar index ends flat. Sterling biggest G10decliner, most EM FX falls. Big exception is China's yuan -onshore and offshore CNY highest in nearly three years, onshoreCNY on longest winning streak since 2010.    *         BONDS: U.S. yields fall 3-4 bps, 7-year auction is ok.30-year U.S. mortgage rates below 6% for first time sinceSeptember 2022. UK 10-yr gilt yield lowest since Dec 2024.        *         COMMODITIES/METALS: Oil and gold slip a bit, with alleyes on U.S.-Iran talks, Comex copper has 3-week closing high. <p>Today's Talking Points </p><p>\n              * Tech's sentiment seesaw in full swing</p><p>\n              Nvidia shares spiked 4% in after-hours trade on Wednesday immediately after Q4 results showed a solid sales beat and forecast-busting outlook. But that's evidently not enough, and shares sank 5.5% on Thursday, the biggest fall since April and wiping $260 billion off the company's value. </p><p>\n              The last 24 hours show how skittish the market is around AI and whether its disruptive force will be for good or ill. More pressing, will AI deliver the returns investors expect from the huge capex underway across the sector? Views on that seem to change from day to day.</p><p>\n              * Summer Fed cut hopes fade</p><p>\n              As debate swirls around Fed Chair nominee Kevin Warsh's dovish or hawkish tendencies, recent moves in interest rate futures markets bear watching - the next fully-priced quarter percentage point rate cut is being pushed back to September.</p><p>\n              Presuming Warsh is confirmed by lawmakers and succeeds Jerome Powell in May as planned, that implies the Fed won't be easing until his third policy meeting as Chair. With core PCE inflation at 3%, this pause seems reasonable. President Donald Trump, looking to November's potentially tricky midterm elections, might not be so understanding. </p><p>\n              * U.S. mortgage \"relief\" </p><p>\n              Any frustration Trump may feel about sticky interest rates could be offset by more encouraging signals from the housing market - average 30-year mortgage rates are now below 6% for the first time since September 2022.</p><p>\n              Psychologically, the break into 5% territory could be significant for would-be homeowners, and if sustained, could help ease the affordability crisis ahead of the midterm elections. That said, borrowing to buy a house is still expensive - some 70% of all existing mortgages are at rates below 5%. </p><p>\n              What could move markets tomorrow?</p>                                * Japan Tokyo CPI inflation (February)    * Japan industrial production (January, prelim)    * India GDP (Q3)    * Germany unemployment (February)    * Germany CPI inflation (February)    * Bank of England chief economist Huw Pill speaks    * Canada GDP (Q4)    * U.S. producer price inflation (January)    * U.S. Chicago PMI (February)<p>Want to receive Trading Day in your inbox every weekday morning? Sign up for my newsletter here. </p><p>\n              Opinions expressed are those of the author. They do not reflect the views of Reuters News, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.</p><p></p><p> (Reporting by Jamie McGeever; Editing by Nia Williams)</p><p>\n            By Jamie McGeever</p></div>",
            "link": "https://hk.marketscreener.com/news/trading-day-nvidia-swings-and-misses-ce7e5cd9d181fe2c",
            "pub_date": "2026-02-27 06:16:22",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "ASML says next-gen EUV tools ready to mass-produce chips, marking key shift for AI chip production",
            "description": "<div class=\"txt-s4 article-text\"><p>SAN JOSE, California, Feb 26 (Reuters) - ASML Holding's next-generation chipmaking machine is ready for manufacturers to start bringing it into use for production at high volumes, a senior executive told Reuters, a big step for the chip industry.</p><p>\n              The Dutch company produces the world's only commercial extreme ultraviolet lithography (EUV) tools, which are a critical piece of equipment for chipmakers. This new tool will help chipmakers such as Taiwan Semiconductor Manufacturing  and Intel produce more powerful and efficient chips, by eliminating several costly and complex steps from the chip-manufacturing process, data from ASML shows.</p><!-- Article --><p>\n              ASML plans to release this data, which represents a key milestone, at a technical conference in San Jose on Thursday, the company's chief technology officer, Marco Pieters, told Reuters on Wednesday.</p><p>\n              It has taken ASML years to develop the costly, next-generation tools as chipmakers have attempted to determine at what point it makes economic sense to begin to use them for mass production.</p><p>\n              But given that the current generation of EUV tools is approaching the technical limit of their ability to make complex AI chips, the next-generation machines - called High-NA EUV tools - are key for the AI industry to improve chatbots like OpenAI's ChatGPT and help chipmakers deliver their AI chip roadmaps on time to meet surging demand.</p><p>\n              The new tools cost roughly $400 million, twice the cost of the original EUV machines.</p><p>\n              The High-NA EUV tools now experience limited downtime, have produced 500,000 dinner-plate-sized silicon wafers and can draw sufficiently precise patterns that make up the circuits on the chip, the ASML data shows, Pieters said. In combination, the three data points indicate the tools are ready for manufacturers.</p><p>\n              \"I think that it's at a critical point to look at the amount of learning cycles that have happened,\" he said, referring to the number of tests that have been conducted on the machines by customers.</p><p>\n              Despite their technical readiness, it will take two to three years for companies to conduct enough testing and development to integrate them into manufacturing.</p><p>\n              \"(Chipmakers) have all the knowledge to qualify these tools,\" Pieters said.</p><p>\n              Pieters also said the company has achieved roughly 80% uptime at the moment and plans to achieve 90% by the end of the year. The imaging data ASML plans to release is enough to convince customers to replace multiple steps with the older-generation tools with a single High-NA step, Pieters said. The 500,000 wafers the machines have processed have allowed the company to work out many of the kinks.</p><p></p><p>(Reporting by Max A. Cherney in San Francisco;  Editing by Sayantani Ghosh and Matthew Lewis)</p></div>",
            "link": "https://hk.marketscreener.com/news/asml-says-next-gen-euv-tools-ready-to-mass-produce-chips-marking-key-shift-for-ai-chip-production--ce7e5cd9d181fe26",
            "pub_date": "2026-02-27 06:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "British Columbia Investment Submits a Shareholder Proposal to Suncor Energy",
            "description": "<div class=\"txt-s4 article-text\"><p>On February 26, 2026, Suncor Energy Inc. filed a management proxy circular soliciting proxies and urged the shareholders to vote against a shareholder proposal, requesting that the Board of Directors of the Corporation prepare a report detailing the Company?s governance and oversight of its climate-related risks. The report should align with the climate-related governance indicators of internationally recognized standards such as the International Financial Reporting Standards (IFRS) S2 or the Canadian Sustainability Disclosure Standard (CSDS 2) building on the widely accepted recommendations of the Task Force on Climate related Financial Disclosures (TCFD). The proposal was submitted by British Columbia Investment Management Corporation, as primary filer, as well as Addenda Capital and the University Pension Plan Ontario, as co-filers, for consideration at the Company?s annual general meeting of shareholders scheduled to be held on May 5, 2026.</p></div>",
            "link": "https://hk.marketscreener.com/news/british-columbia-investment-submits-a-shareholder-proposal-to-suncor-energy-ce7e5cd9d181f327",
            "pub_date": "2026-02-27 06:10:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Johnson & Johnson Announces Preliminary Results From Phase 1b Study Of Pasritamig In Combination With Docetaxel In Advanced Prostate Cancer",
            "description": "<div class=\"txt-s4 article-text\"><p>Johnson &amp; Johnson announced preliminary results from a Phase 1b study evaluating pasritamig (JNJ-78278343), a first-in-class bispecific T-cell engaging antibody, in combination with docetaxel in patients with metastatic castration-resistant prostate cancer. The combination demonstrated a safety profile consistent with docetaxel alone, with no new or unexpected safety signals observed. The regimen also showed clinically meaningful efficacy, including high rates of prostate-specific antigen (PSA) responses and sustained PSA reductions, supporting continued development and advancement into Phase 3 studies.</p><p>Pasritamig is designed to engage the immune system through a novel mechanism of action, binding CD3 on T cells and human kallikrein 2 (KLK2). KLK2 is a novel, highly specific prostate cancer target with minimal expression outside prostate tissue. By both activating and directing T cells to KLK2-expressing tumor cells, pasritamig enables targeted immune engagement.</p><!-- Article --><p>This differentiated, prostate-specific approach was intentionally built to focus immune activity on prostate cancer cells, which may help limit effects on healthy tissue, and supports administration in a doctor's office rather than hospital setting. In the study, pasritamig was evaluated in combination with docetaxel in an outpatient setting in patients with metastatic castration-resistant prostate cancer whose disease had progressed following androgen receptor pathway inhibitor therapy. Approximately half of the patients (45%) had received at least one prior taxane-based regimen.</p><p>The primary endpoint was safety and identification of the recommended regimen for further development in Phase 2/3 studies, with secondary and exploratory endpoints assessing clinical activity, including PSA response rates. As of December 9, 2025, 51 patients had received pasritamig plus docetaxel, including patients who were pretreated with a median of three prior therapies (range, 1-9). Reductions of 50% or greater in PSA levels were achieved in 64.7% of patients overall and in 75.0% of taxane-naïve patients.</p><p>Reductions of 90% or greater in PSA levels were achieved in 39.2% of patients overall and 53.6% of taxane-naïve patients. Among taxane-naïve patients with bone-only disease, confirmed PSA reductions of 50% or greater and 90% or greater were observed in 88.2% and 76.5% of patients, respectively. Patients were able to continue pasritamig beyond docetaxel discontinuation.</p><p>Those patients received a median of six docetaxel doses every three weeks and eight pasritamig doses every six weeks, supporting the potential for sustained disease control over time. The safety profile of pasritamig plus docetaxel was consistent with the known safety profile of docetaxel in metastatic castration-resistant prostate cancer. The most common treatment-related adverse events (TRAEs) occurring in at least 20% of patients included fatigue (60.8%), alopecia (41.2%), diarrhea and nausea (31.4% each), peripheral edema (27.5%), peripheral sensory neuropathy (25.5%) and dysgeusia (23.5%).</p><p>Pasritamig-related adverse events occurring in at least 10% of patients were fatigue (33.3%) and non-chronic diarrhea (11.8%). Grade 3 or higher TRAEs attributed to docetaxel were observed in 29.4% of patients, compared with only two percent attributed to pasritamig. No patients experienced cytokine release syndrome of any grade or treatment-related deaths.</p><p>Two ongoing Phase 3 studies are evaluating pasritamig in the metastatic castration-resistant prostate cancer setting. KLK2-comPAS (NCT07164443) is evaluating pasritamig as monotherapy, and KLK2-PASenger (NCT07225946) is evaluating pasritamig in combination with docetaxel. Beyond these Phase 3 studies, pasritamig is also being evaluated in earlier-phase combination studies.</p><p>Pasritamig monotherapy has received Breakthrough Therapy Designation in China and Fast Track designation from the U.S. Food and Drug Administration, supporting its continued clinical development. The Phase 1b study (NCT05818683) is an open-label trial evaluating the safety and clinical activity of pasritamig in combination with docetaxel in patients with metastatic castration-resistant prostate cancer (mCRPC) whose disease has progressed following treatment with an androgen receptor pathway inhibitor. The primary objective is to determine the recommended regimen for further development based on safety, with secondary and exploratory endpoints assessing clinical activity.</p><p>Pasritamig was administered intravenously every six weeks, with initial step-up doses given during the first treatment cycle, in combination with docetaxel administered intravenously every three weeks. Treatment was delivered in an outpatient setting. Corticosteroids were used only as standard premedication for docetaxel, and hematopoietic growth factor support was permitted as needed.</p><p>Pasritamig (JNJ-78278343) is an investigational T-cell-redirecting bispecific antibody (bsAb) targeting human kallikrein 2 (KLK2) on prostate cancer cells and CD3 receptor complexes on T cells, leveraging the body's immune system to selectively target and eliminate cancer cells. This innovative approach is being evaluated in pretreated patients with metastatic castration-resistant prostate cancer (mCRPC), a patient population with limited treatment options.</p></div>",
            "link": "https://hk.marketscreener.com/news/johnson-johnson-announces-preliminary-results-from-phase-1b-study-of-pasritamig-in-combination-wit-ce7e5cd9d181f527",
            "pub_date": "2026-02-27 06:10:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Elevance Health, Inc. Announces Transition of Peter D. Haytaian as Executive Vice President and President of Carelon, Effective May 4, 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Elevance Health, Inc. announced Peter D. Haytaian has announced that he will transition from his role as Executive Vice President and President of Carelon effective May 4, 2026, in order to devote more time to family commitments. Haytaian will serve the Company as Special Advisor through December 31, 2026, to support an orderly leadership transition and ensure continuity across Carelon?s operations and client and partner relationships.</p></div>",
            "link": "https://hk.marketscreener.com/news/elevance-health-inc-announces-transition-of-peter-d-haytaian-as-executive-vice-president-and-pres-ce7e5cd9d181f62d",
            "pub_date": "2026-02-27 06:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Autodesk, Inc. Provides Earnings Guidance for the First Quarter Ending April 30, 2026 and Full-Year Fiscal Ending January 31, 2027",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Autodesk, Inc. provided earnings guidance for the first quarter ending April 30, 2026 and full-year fiscal ending January 31, 2027. For the quarter, the company expected revenue of $1,885 million to $1,900 million; EPS GAAP of $1.68 to $1.83.<br/><br/>\n\nFor the full year, the company expected revenue of $8,100 million to $8,170 million; GAAP operating margin of 26% to 28%; EPS GAAP of $7.76 to $8.39.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/autodesk-inc-provides-earnings-guidance-for-the-first-quarter-ending-april-30-2026-and-full-year-ce7e5cd9d18efe2d",
            "pub_date": "2026-02-27 06:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UOL Group Limited Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>UOL Group Limited reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was SGD 3,234.09 million compared to SGD 2,794.76 million a year ago. Net income was SGD 481.73 million compared to SGD 358.19 million a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/uol-group-limited-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cd9d18efe21",
            "pub_date": "2026-02-27 06:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Co deliberately delayed CSG price increases until January 6th, prioritizing market share growth - conf call",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-co-deliberately-delayed-csg-price-increases-until-january-6th-prioritizing-ce7e5cd9d18eff27",
            "pub_date": "2026-02-27 06:05:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Asml data shows next-generation chipmaking tools ready for manufacturers to bring to high volume production, cto says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/asml-data-shows-next-generation-chipmaking-tools-ready-for-manufacturers-to-bring-to-high-volume-pro-ce7e5cd9d18ef02c",
            "pub_date": "2026-02-27 06:05:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block's fourth-quarter profit rises, announces over 4,000 job cuts",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - Block reported a rise in fourth-quarter profit on Thursday, driven by strong demand for its payments products and services and said it will cut over 4,000 jobs.</p><p>\n              The company posted adjusted profit of 65 cents per share in the three months ended December 31. That compares with 47 cents, a year ago. </p><!-- Article --><p>\n              Block expects to incur roughly $450 million to $500 million in restructuring charges. </p><p></p><p> (Reporting by Manya Saini in Bengaluru; Editing by Tasim Zahid)</p></div>",
            "link": "https://hk.marketscreener.com/news/block-s-fourth-quarter-profit-rises-announces-over-4-000-job-cuts-ce7e5cd9d18ef32c",
            "pub_date": "2026-02-27 06:05:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ck Hutchison Holdings says Panama state takes control of PPC terminals",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ck-hutchison-holdings-says-panama-state-takes-control-of-ppc-terminals-ce7e5cd9d18ef420",
            "pub_date": "2026-02-27 06:05:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US slows Lukoil asset sale due to Ukraine peace talks, sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-slows-lukoil-asset-sale-due-to-ukraine-peace-talks-sources-say-ce7e5cd9d18ef72d",
            "pub_date": "2026-02-27 06:05:46",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Mecom Power and Construction says unit enters FX hedging contracts with bank for HK$100 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/mecom-power-and-construction-says-unit-enters-fx-hedging-contracts-with-bank-for-hk-100-million-ce7e5cd9d18ef72c",
            "pub_date": "2026-02-27 06:05:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Justice Department sues five more states over voter registration lists",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - The U.S. Department of Justice said on Thursday it had sued five more states over what it described as a failure to produce their full voter registration lists.</p><p>\n              The move against Utah, Oklahoma, Kentucky, West Virginia, and New Jersey brings the number of states the department has sued to 29, as well as the District of Columbia.</p><!-- Article --><p>\n              \"Accurate, well-maintained voter rolls are a requisite for the election integrity that the American people deserve,\" Attorney General Pamela Bondi said in a statement.</p><p>\n              Elections in the United States, including for federal offices, are administered by state and local officials.</p><p>\n              President Donald Trump has long raised doubts about the electoral system and continues to falsely assert that his 2020 loss to Democratic President Joe Biden was due to fraud.</p><p>\n              Trump said this month he would seek to impose voter identification requirements for the November midterm elections whether Congress approves them or not.</p><p></p><p>(Reporting by David Ljunggren; editing by Edward Tobin)</p></div>",
            "link": "https://hk.marketscreener.com/news/us-justice-department-sues-five-more-states-over-voter-registration-lists-ce7e5cd9d18fff22",
            "pub_date": "2026-02-27 06:05:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave beats fourth-quarter revenue estimates",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - CoreWeave beat Wall Street estimates for  quarterly revenue on Thursday, benefiting from the artificial intelligence boom that has driven companies to its platform for the massive computing power needed to train and deploy advanced AI models.</p><p>\n              The company reported a revenue of $1.57 billion for the fourth quarter, compared with analysts' average estimate of $1.55 billion, according to data compiled by LSEG.</p><!-- Article --><p></p><p> (Reporting by Anhata Rooprai in Bengaluru and Juby Babu in Mexico City; Editing by Maju Samuel)</p></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-beats-fourth-quarter-revenue-estimates-ce7e5cd9d18fff24",
            "pub_date": "2026-02-27 06:05:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US weekly jobless claims increase slightly as labor market steadies",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-weekly-jobless-claims-increase-slightly-as-labor-market-steadies-ce7e5cd9d18ff124",
            "pub_date": "2026-02-27 05:56:29",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Seazen Group proposes issuance of $355 million 11.8% guaranteed senior notes due 2029 by unit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/seazen-group-proposes-issuance-of-355-million-11-8-guaranteed-senior-notes-due-2029-by-unit-ce7e5cd9d18ff223",
            "pub_date": "2026-02-27 05:56:30",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nvidia shares fall as upbeat forecasts fail to excite investors",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nvidia-shares-fall-as-upbeat-forecasts-fail-to-excite-investors-ce7e5cd9d18ff32c",
            "pub_date": "2026-02-27 05:56:31",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Q4 Adjusted Earnings, Revenue Rise; Plans to Reduce Workforce by Over 40%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-q4-adjusted-earnings-revenue-rise-plans-to-reduce-workforce-by-over-40-ce7e5cd9d18ff42c",
            "pub_date": "2026-02-27 05:56:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US court won't block Trump from ending union bargaining for federal workers",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - A U.S. appeals court on Thursday rejected a bid by unions to block President Donald Trump's administration from stripping hundreds of thousands of federal employees of the ability to engage in union bargaining with U.S. agencies, reversing a lower court's ruling.</p><p>\n              A three-judge panel of the 9th U.S. Circuit Court of Appeals in San Francisco said Trump's 2025 order eliminating collective bargaining rights for wide swaths of government workers was legitimately grounded in national security concerns.</p><!-- Article --><p>\n              The unions had argued that Trump issued the order to retaliate against them for challenging other administration policies, in violation of their free-speech rights. But the 9th Circuit said Trump would have taken the same action whether or not he intended to punish unions. </p><p>\n              Trump's order \"expresses that the President's primary - if not only - concern with union activity was its interference with national security,\" Circuit Judge Daniel Bress, a Trump appointee, wrote for the court. </p><p>\n              Eliminating collective bargaining would allow agencies to alter working conditions and fire or discipline workers more easily, and it could prevent unions from challenging Trump administration initiatives in court.</p><p>\n              The panel reversed a ruling issued last year by U.S. District Judge James Donato in San Francisco that had temporarily blocked Trump's order. The 9th Circuit had paused Donato's ruling in August pending the outcome of the appeal. A federal appeals court in Washington, D.C., had in May paused a similar ruling that had also blocked Trump's order.</p><p>\n              The White House and the unions involved in the case did not immediately respond to requests for comment.</p><p>\n              Trump's order exempted more than a dozen federal agencies from obligations to bargain with unions. They include the Departments of Justice, State, Defense, Treasury, and Health and Human Services.</p><p>\n              Trump's executive order exempted agencies that he said \"have as a primary function intelligence, counterintelligence, investigative, or national security work\" from collective bargaining obligations, significantly expanding an existing exception for workers with duties implicating national security.</p><p></p><p>(Reporting by Daniel Wiessner in Albany, New York; editing by David Gaffen)</p><p>\n            By Daniel Wiessner</p></div>",
            "link": "https://hk.marketscreener.com/news/us-court-won-t-block-trump-from-ending-union-bargaining-for-federal-workers-ce7e5cd9d18ff420",
            "pub_date": "2026-02-27 05:56:32",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration cannot force states to supply food stamp data, US judge rules",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - A federal judge on Thursday blocked President Donald Trump's administration from cutting off funding for 22 Democratic-led states to administer food stamp benefits unless they turned over data on millions of people who received the aid.</p><p>\n              U.S. District Judge Maxine Chesney in San Francisco issued a preliminary injunction barring the U.S. Department of Agriculture from halting funding based on demands it made in recent months for the states to supply data on recipients of Supplemental Nutrition Assistance Program benefits.</p><!-- Article --><p>\n              State attorneys general had asked the judge to block USDA from doing so, saying it was threatening to cut off administrative funding for the program despite an earlier ruling by Chesney preventing it from stripping them of funding for SNAP.</p><p>\n              The USDA in letters sent to the states in November and December had renewed its demands for information including the names, addresses and immigration status of individuals in those states who sought aid through the government's food aid program for low-income people.</p><p>\n              About 42 million people receive benefits from SNAP, which is largely funded by the federal government and administered by states. Immigrants who are in the United States illegally are not eligible for SNAP.</p><p>\n              The agency said it needed the data to fulfill the administration's goal of eliminating waste, fraud and abuse in government assistance programs and had established new protocols to secure the data.</p><p>\n              But Chesney, an appointee of Democratic President Bill Clinton, said the USDA's demands for data and threats to cut off funding appeared contrary to the law governing SNAP, and that the agency's protocols would allow it to improperly share data with unauthorized entities.</p><p>\n              USDA did not respond to a request for comment.</p><p>\n              Twenty-eight states, largely led by Republicans, have so far submitted the data the USDA sought, according to a November letter from the agency.</p><p>\n              Among the states that challenged the USDA's demand were California, New York and Arizona. </p><p>\n              New York Attorney General Letitia James in a social media post said Thursday's ruling would protect SNAP data \"for millions of vulnerable people and our immigrant communities.\"</p><p></p><p> (Reporting by Nate Raymond in Boston; Editing by Bill Berkrot)</p><p>\n            By Nate Raymond</p></div>",
            "link": "https://hk.marketscreener.com/news/trump-administration-cannot-force-states-to-supply-food-stamp-data-us-judge-rules-ce7e5cd9d18ff426",
            "pub_date": "2026-02-27 05:56:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}