{
    "data": [
        {
            "title": "Germany's Merz says challenges remain as he concludes inaugural China trip",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/germany-s-merz-says-challenges-remain-as-he-concludes-inaugural-china-trip-ce7e5cd9df81f524",
            "pub_date": "2026-02-27 03:16:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India new issue-Bajaj Housing Finance to reissue January 2029 bonds, bankers say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-new-issue-bajaj-housing-finance-to-reissue-january-2029-bonds-bankers-say-ce7e5cd9df81f62c",
            "pub_date": "2026-02-27 03:16:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Smartphone market set for biggest-ever decline in 2026 on memory price surge, IDC says",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - The global smartphone market is poised to suffer its biggest decline ever in 2026, sinking to a more than decade low in shipments, as surging memory chip prices drive up device costs, the International Data Corporation said on Thursday. </p><p>\n              Smartphone shipments are expected to drop 12.9% to 1.12 billion units, the research firm said in a report.  </p><!-- Article --><p>\n              The decline will hit low-end Android manufacturers the hardest, while Apple and Samsung are positioned to gain market share as smaller rivals struggle or exit the market entirely, the report said.</p><p>\n              \"What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain,\" said Francisco Jeronimo, vice president for Worldwide Client Devices at IDC.</p><p>\n              Analysts have said rising component costs will erode margins at smartphone companies focused on budget devices, forcing them to pass on the expenses to consumers at a time when demand at higher price points is weakening. </p><p>\n              Apple and Samsung, with stronger balance sheets and premium positioning, are better equipped to weather the crisis, IDC said.</p><p>\n              The average selling price of smartphones is projected to surge 14% to a record $523 this year, as manufacturers shift toward higher-margin models to offset ballooning costs.</p><p>\n              IDC expects a modest 2% recovery in 2027 as the crisis eases, followed by a 5.2% rebound in 2028, though it said that the market was unlikely to return to previous norms.</p><p>\n              \"The memory crisis will cause more than a temporary decline; it marks a structural reset of the entire market,\" said Nabila Popal, senior research director at IDC's Mobile Phone Tracker. </p><p>\n              She warned that the sub-$100 smartphone segment, representing 171 million devices, will become \"permanently uneconomical\" even after memory prices stabilize by mid-2027.</p><p></p><p> (Reporting by Kritika Lamba in Bengaluru; Editing by Shinjini Ganguli)</p></div>",
            "link": "https://hk.marketscreener.com/news/smartphone-market-set-for-biggest-ever-decline-in-2026-on-memory-price-surge-idc-says-ce7e5cd9df81f72c",
            "pub_date": "2026-02-27 03:16:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russian rouble seen falling sharply this year as oil sales fall and deficit rises",
            "description": "<div class=\"txt-s4 article-text\"><p>MOSCOW, Feb 26 (Reuters) - The rouble is set to tumble by nearly a quarter this year after the government, faced with falling energy revenues, announced plans to save more money in a yuan-denominated fiscal reserve fund, a top Russian banker and analysts said on Thursday.</p><p>\n              However, a weaker rouble, which has long been seen as overvalued, will bolster the state budget's revenues from oil sales, helping the government to deal with a growing deficit. It will also prop up revenues of exporting companies, a potential boost to Russia's flagging economic growth.</p><!-- Article --><p>\n              Russia's deteriorating finances, caused by Western pressure on its oil sales, may add some urgency to slow-moving, U.S.-mediated peace talks with Ukraine, in which Washington is offering major economic incentives to both sides.</p><p>\n              German Gref, the powerful CEO of Sberbank, Russia's largest bank, said the rouble has no chance to remain as strong as in 2025, when it rallied by 45% against the dollar. He said the currency could tumble by 23% from its current level of 77 to the dollar, to end the year around 100.</p><p>\n              \"This year, I don't see any chance of having such a strong rouble. It is counterproductive by all conceivable and inconceivable measures. It's counterintuitive, and everything else you can think of,\" Gref told a conference call after Sberbank's 2025 results announcement.</p><p>\n              Finance Minister Anton Siluanov said on Wednesday the government would divert more money into the fiscal reserve fund to prevent its depletion. That implies reduced foreign currency sales by the state, a factor that has supported the rouble.</p><p>\n              Operations by the government and the central bank currently account for over one-tenth of Russia's thin foreign currency market. The government and the central bank have been criticised for propping up the rouble.</p><p>\n              \"This means that the volumes of currency sales from the National Wealth Fund may decrease in the future, which in turn means that the support for the rouble from the budgetary mechanism will weaken,\" Alfa Bank analysts said. At the start of February, analysts in a Reuters poll saw the rouble at 88 to the dollar in 12 months.  </p><p><b>'ROUTINE DIFFICULTIES'</b></p><p>\n              Siluanov's announcement came a day after a late-night, hours-long meeting between President Vladimir Putin and top government and central bank officials on how to deal with the budget deficit and a sanctions-related fall in energy revenues.</p><p>\n              The Kremlin said on Thursday the sharp fall in these revenues, which were down by 24% in 2025 and halved in February in year-on-year terms, as well as the growing budget deficit, were \"routine difficulties\" that could be fixed thanks to overall macroeconomic stability.</p><p>\n              Sberbank released an optimistic economic outlook for 2026, projecting growth between 1% and 1.5%, above the International Monetary Fund's (IMF) estimate of 0.8%, with Gref arguing that a weaker rouble would prove an important factor.</p><p>\n              \"It is not possible to definitively assess the dynamics of economic growth for the full year in February. It will depend on a number of factors, including the dynamics of the rouble exchange rate,\" Gref said.</p><p>\n              Russia's economic growth slowed sharply in 2025 due to prohibitive interest rates, which stalled investment. Gref said investment and growth would resume when the central bank's key interest rate falls to 12% from the current 15.5%.</p><p>\n              The rallying rouble and the high key rate have helped the central bank bring inflation down.</p><p>\n              Some central bank board members at a rate-setting meeting on February 13 warned that a weaker rouble and falling oil revenues created inflationary risks, according to the minutes, published on Thursday.</p><p>\n               (Writing by Gleb Bryanski; Editing by Mark Trevelyan and Gareth Jones)</p><p>\n            By Elena Fabrichnaya and Gleb Bryanski</p></div>",
            "link": "https://hk.marketscreener.com/news/russian-rouble-seen-falling-sharply-this-year-as-oil-sales-fall-and-deficit-rises-ce7e5cd9df81f723",
            "pub_date": "2026-02-27 03:16:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Global steel output falls 6.5% yr/yr in January - WorldSteel",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/global-steel-output-falls-6-5-yr-yr-in-january-worldsteel-ce7e5cd9df8efe25",
            "pub_date": "2026-02-27 03:11:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Motiva Enterprises buys cargo of Venezuelan Boscan heavy crude for March delivery - sources",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/motiva-enterprises-buys-cargo-of-venezuelan-boscan-heavy-crude-for-march-delivery-sources-ce7e5cd9df8eff23",
            "pub_date": "2026-02-27 03:11:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Purapharm Corp to issue convertible bonds with principal amount of HK$20 mln",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/purapharm-corp-to-issue-convertible-bonds-with-principal-amount-of-hk-20-mln-ce7e5cd9df8ef32d",
            "pub_date": "2026-02-27 03:11:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Barclays, Apollo's Atlas Among Firms With Exposure to Collapsed UK Lender MFS",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/barclays-apollo-s-atlas-among-firms-with-exposure-to-collapsed-uk-lender-mfs-ce7e5cd9df8ef320",
            "pub_date": "2026-02-27 03:05:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Daily Roundup of Key US Economic Data for Feb. 26",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/daily-roundup-of-key-us-economic-data-for-feb-26-ce7e5cd9df8ef326",
            "pub_date": "2026-02-27 03:05:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Russia's Sberbank says it plans to pay 2025 dividend of 50% of net profit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/russia-s-sberbank-says-it-plans-to-pay-2025-dividend-of-50-of-net-profit-ce7e5cd9df8ef42d",
            "pub_date": "2026-02-27 03:05:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "PayPal Not Currently in Talks to be Acquired by Stripe",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/paypal-not-currently-in-talks-to-be-acquired-by-stripe-ce7e5cd9df8ef421",
            "pub_date": "2026-02-27 03:05:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Costco, FedEx, Goodyear Among Companies Seeking Tariff Refunds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/costco-fedex-goodyear-among-companies-seeking-tariff-refunds-ce7e5cd9df8ef427",
            "pub_date": "2026-02-27 03:05:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank of Canada's profit rises on capital markets, personal banking strength",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/royal-bank-of-canada-s-profit-rises-on-capital-markets-personal-banking-strength-ce7e5cd9df8ef426",
            "pub_date": "2026-02-27 03:05:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Indonesia raises $4.54 billion in yuan and euro bonds auction",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/indonesia-raises-4-54-billion-in-yuan-and-euro-bonds-auction-ce7e5cd9df8ef620",
            "pub_date": "2026-02-27 03:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "India new issue-NABARD to issue over 3-year bonds, bankers say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/india-new-issue-nabard-to-issue-over-3-year-bonds-bankers-say-ce7e5cd9df8ef627",
            "pub_date": "2026-02-27 03:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Founder technology's shareholder plans to unload stake",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/founder-technology-s-shareholder-plans-to-unload-stake-ce7e5cd9df8ef721",
            "pub_date": "2026-02-27 03:01:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Euro zone yields hold near multi-month lows; inflation data awaited",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/euro-zone-yields-hold-near-multi-month-lows-inflation-data-awaited-ce7e5cd9df8ef724",
            "pub_date": "2026-02-27 03:01:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US mortgage rates dip below 6%, but supply remains key",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - The average rate on the popular U.S. 30-year fixed-rate mortgage fell below 6% this week for the first time in 3-1/2 years, but economists said the improvement was likely temporary and on its own insufficient to boost housing demand unless supply increased.</p><p>\n              The 30-year fixed mortgage rate averaged 5.98%, the lowest level since September 2022, from 6.01% last week, mortgage finance agency Freddie Mac said on Thursday. It averaged 6.76% during the same period a year ago. </p><!-- Article --><p>\n              The drop followed a decline in the benchmark 10-year U.S. Treasury yield after the U.S. Supreme Court on Friday struck down President Donald Trump's sweeping tariffs, which he had pursued under a law meant for use in national emergencies. </p><p>\n              Trump swiftly imposed a 10% global tariff for 150 days to replace some of the emergency duties, before raising the rate to 15% over the weekend. The 30-year fixed-rate mortgage tracks the 10-year Treasury yield.</p><p>\n              \"This legal tug-of-war has triggered a flight to safety among investors, pushing bond prices higher and yields lower, helping mortgage rates settle around 6%,\" said Jiayi Xu, an economist at Realtor.com. \"However, as this week's decline stems from market volatility rather than fundamental economic data, more supportive economic data is needed to establish a consistent trend.\"</p><p>\n              Trump ordered the Federal Housing Finance Agency - which oversees Freddie Mac and another mortgage finance giant Fannie Mae - to purchase $200 billion of bonds issued by the two companies to help lower the cost of home loans. </p><p>\n              But the average rate on the 15-year fixed-rate mortgage increased to 5.44% this week from 5.35% in the prior week. It averaged 5.94% during the same period a year ago. </p><p><b>SUPPLY IS KEY FOR THE HOUSING MARKET</b></p><p>\n              Economists are skeptical that mortgage purchases will significantly improve housing affordability.</p><p>\n              Minutes of the Federal Reserve's January 27-28 policy meeting published last week, describing a briefing by a New York Fed official responsible for implementing monetary policy, noted that plans by the administration to buy mortgage bonds had caused \"a notable decline in mortgage-backed securities yields relative to those on comparable-maturity Treasury yields.\"</p><p>\n              Despite that move in the market, the official \"observed that the decline was unlikely to result in a material increase in mortgage refinancing because current mortgage rates are well above the weighted average rate of outstanding mortgages,\" the minutes said.</p><p>\n              Trump is under pressure to bring down costs, including for housing, as he and his fellow Republicans face a tough battle to retain control of the U.S. Congress in this year's mid-term elections. Economists and policymakers say a dearth of properties for sale, especially starter homes, was weighing on the housing market. </p><p>\n              The inventory of previously owned houses is well below its pre-pandemic level. Many homeowners hold mortgages with rates below 5%, creating what has been called a rate-lock. </p><p>\n              Though supply improved last year, progress has stalled. There have been reports of homeowners pulling their houses off the market because of lower prices. House prices increased 1.8% in the 12 months through December after climbing 2.1% in November, the Federal Housing Finance Agency said on Tuesday. </p><p>\n              Economists and trade groups say the Trump administration's trade and immigration policies, which have raised prices for building materials and appliances and undercut labor supply, were constraining builders' ability to break ground on new single-family housing projects. Building lots are also scarce amid state and local government regulations.</p><p>\n              Still, the slowdown in the 30-year fixed mortgage rate could encourage some potential sellers to list their homes, and draw prospective home buyers into the market.</p><p>\n              \"While buying power has already increased $30,000 from last year, mortgage rates below 6% could be an important psychological threshold,\" said Kara Ng, senior economist at Zillow. \"Round numbers matter, and that headline alone could prompt many sidelined buyers to take another peek at the housing market.\" </p><p></p><p>(Reporting by Lucia Mutikani, additional reporting by Michael S. Derby and Saeed Azhar; Editing by Chizu Nomiyama and Mark Porter)</p><p>\n            By Lucia Mutikani</p></div>",
            "link": "https://hk.marketscreener.com/news/us-mortgage-rates-dip-below-6-but-supply-remains-key-ce7e5cd9df8fff23",
            "pub_date": "2026-02-27 03:01:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German union says settlement reached in dispute with Tesla",
            "description": "<div class=\"txt-s4 article-text\"><p>BERLIN, Feb 26 (Reuters) - Tesla and German union IG Metall reached agreement on Thursday to settle a dispute over a meeting of the works council at the carmaker's plant outside Berlin earlier this month, the union said in a statement.</p><p></p><p> (Reporting by Rachel MoreEditing by Madeline Chambers)</p></div>",
            "link": "https://hk.marketscreener.com/news/german-union-says-settlement-reached-in-dispute-with-tesla-ce7e5cd9df8ff023",
            "pub_date": "2026-02-27 03:01:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Woman suing Meta, YouTube over social media addiction expected to take stand at trial",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - A California woman is expected to testify in court on Thursday about how using Meta Platforms' Instagram and Google's YouTube as a child harmed her mental health, as her landmark trial in Los Angeles continues.</p><p>\n              The plaintiff, known as Kaley G.M. in court, began using Instagram at age 9 and YouTube at age 6 and says the platforms contributed to her depression and body dysmorphia. The companies sought to profit by hooking young children on their services despite knowing social media could harm their mental health, her lawyers say.</p><!-- Article --><p>\n              Kaley G.M.'s testimony comes a day after her former psychotherapist said adolescent social media usage was a \"contributing factor\" to her mental health issues.</p><p>\n              The case is part of a broader global backlash against social media companies over alleged harms to children and teens. Australia has banned under-16s from such platforms, and other countries are considering similar restrictions.</p><p>\n              YouTube and Meta have denied the allegations and said evidence in the case does not support the woman's claims.</p><p>\n              The therapist was called by lawyers for the plaintiff to set the stage for the next phase of the trial, exploring whether and how Kaley's engagement with social media as a child affected her well-being.</p><p>\n              The beginning of the trial focused on what the companies knew about how social media affects children, and their business strategies related to younger users. Meta CEO Mark Zuckerberg testified the company discussed but never launched products for children.</p><p>\n              To win the case, Kaley's lawyers must show that the way the companies designed or operated the platforms was a substantial factor in causing or worsening her mental health issues.</p><p></p><p>(Reporting by Courtney Rozen in Washington, Jody Godoy in New York and Steve Gorman in Los AngelesEditing by Rod Nickel)</p></div>",
            "link": "https://hk.marketscreener.com/news/woman-suing-meta-youtube-over-social-media-addiction-expected-to-take-stand-at-trial-ce7e5cd9df8ff020",
            "pub_date": "2026-02-27 03:01:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Danske Bank to reduce 420 positions",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/danske-bank-to-reduce-420-positions-ce7e5cd9df8ff226",
            "pub_date": "2026-02-27 03:01:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Amazon refused permission to appeal go-ahead for UK lawsuits from retailers, consumers",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/amazon-refused-permission-to-appeal-go-ahead-for-uk-lawsuits-from-retailers-consumers-ce7e5cd9df8ff323",
            "pub_date": "2026-02-27 03:01:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US, Brent crude futures turn negative after Oman foreign minister posts about significant progress in US, Iran talks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-brent-crude-futures-turn-negative-after-oman-foreign-minister-posts-about-significant-progress-i-ce7e5cd9df8ff325",
            "pub_date": "2026-02-27 03:01:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Synthekine Inc. Announces Clinical Trial Collaboration with Merck to Evaluate STK-012 in Combination with Keytruda (Pembrolizumab) and Chemotherapy in Ongoing Randomized Phase 2 Trial in First-Line, PD-L1 Negative Nonsquamous Non-Small Cell Lung Cancer",
            "description": "<div class=\"txt-s4 article-text\"><p>Synthekine Inc. announced that it has entered into a clinical trial collaboration and supply agreement with Merck (known as MSD outside of the United States and Canada). STK-012, a first-in-class a/b-IL-2 receptor unbiased partial agonist, will be evaluated in combination with standard of care chemotherapy and Keytruda®? (pembrolizumab), Merck's anti-PD-1 (programmed cell death receptor-1) therapy, in the ongoing SYNERGY-101 randomized Phase 2 study in first-line, PD-L1 negative nonsquamous (NSQ) non-small cell lung cancer (NSCLC).</p><p>Under the terms of the agreement, Merck will provide its anti-PD-1 therapy, Keytruda, to be used in combination with STK-012 and standard of care chemotherapy in the SYNERGY-101 trial. SYNERGY-101 is a global, randomized Phase 2 study that has already begun enrollment, with the first patient dosed in November 2025. This study will investigate the safety and efficacy of STK-012 in combination with standard dose pembrolizumab and chemotherapy vs.</p><!-- Article --><p>the safety and efficacy of standard dose pembrolIZumab and chemotherapy in patients with first-line, PD- L1 negative NSQ NSCLC. Synthekine and Merck will each retain all commercial rights to their respective compounds for use as monotherapies or in combination regimens.</p></div>",
            "link": "https://hk.marketscreener.com/news/synthekine-inc-announces-clinical-trial-collaboration-with-merck-to-evaluate-stk-012-in-combination-ce7e5cd9df8ff423",
            "pub_date": "2026-02-27 03:01:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Canada says private government conversations on USMCA pact are not discouraging",
            "description": "<div class=\"txt-s4 article-text\"><p>OTTAWA, Feb 26 (Reuters) - The Canadian minister responsible for Canada-United States trade said on Thursday that private government-to-government conversations between the United States, Mexico and Canada on a forthcoming review of the USMCA trade pact were not discouraging.</p><p>\n              Canada is preparing to start formal trade talks with the U.S. as part of the scheduled review of the deal which needs to be completed by July 1, 2026.</p><!-- Article --><p>\n              President Donald Trump has said the United States could leave the USMCA and strike separate deals with Canada and Mexico instead.</p><p>\n              \"There is a public prosecution of the argument, the political argument in the United States. And there are the private government to government to government conversations which are not discouraging,\" federal minister Dominic LeBlanc told a Toronto business audience.</p><p>\n               (Reporting by Promit Mukherjee; Editing by David Ljunggren and Nia Williams)</p></div>",
            "link": "https://hk.marketscreener.com/news/canada-says-private-government-conversations-on-usmca-pact-are-not-discouraging-ce7e5cd9df8ff725",
            "pub_date": "2026-02-27 02:51:43",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US stock futures waver as Nvidia's blockbuster results draw muted response",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-stock-futures-waver-as-nvidia-s-blockbuster-results-draw-muted-response-ce7e5cd9df8cfe26",
            "pub_date": "2026-02-27 02:51:44",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Norway's wealth fund using AI to screen for ESG risks",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/norway-s-wealth-fund-using-ai-to-screen-for-esg-risks-ce7e5cd9df8cff27",
            "pub_date": "2026-02-27 02:51:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Hindalco says U.S. government shutdown impacts CFIUS review process",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/hindalco-says-u-s-government-shutdown-impacts-cfius-review-process-ce7e5cd9df8cf02d",
            "pub_date": "2026-02-27 02:51:45",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Aws commits $100 million to expand education access with cloud and ai technology",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/aws-commits-100-million-to-expand-education-access-with-cloud-and-ai-technology-ce7e5cd9df8cf023",
            "pub_date": "2026-02-27 02:51:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Royal Bank of Canada's first-quarter profit rises",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/royal-bank-of-canada-s-first-quarter-profit-rises-ce7e5cd9df8cf021",
            "pub_date": "2026-02-27 02:51:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Omani foreign minister says we have finished the day after significant progress in the negotiation between the United States and Iran",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/omani-foreign-minister-says-we-have-finished-the-day-after-significant-progress-in-the-negotiation-b-ce7e5cd9df8cf327",
            "pub_date": "2026-02-27 02:45:47",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK's FTSE 100 scales new peak on Rolls-Royce boost; tech in focus on Nvidia beat",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-s-ftse-100-scales-new-peak-on-rolls-royce-boost-tech-in-focus-on-nvidia-beat-ce7e5cd9df8cf724",
            "pub_date": "2026-02-27 02:41:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Accenture and Mistral AI accelerate enterprise reinvention with scalable AI",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/accenture-and-mistral-ai-accelerate-enterprise-reinvention-with-scalable-ai-ce7e5cd9df8dff23",
            "pub_date": "2026-02-27 02:41:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nordic countries investigate threat to energy infrastructure, Sweden's TV4 reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nordic-countries-investigate-threat-to-energy-infrastructure-sweden-s-tv4-reports-ce7e5cd9df8dff25",
            "pub_date": "2026-02-27 02:41:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Northeastern University, SoftBank Corp., Keysight, and zTouch Networks Demonstrate LTM-Powered Autonomous Agentic AI-RAN at MWC Barcelona 2026",
            "description": "<div class=\"txt-s4 article-text\"><p>Northeastern University's Institute for Intelligent Networked Systems (INSI), SoftBank Corp. (SoftBank), Keysight Technologies, and zTouch Networks are demonstrating Autonomous Agentic AI-RAN (AgentRAN) at Mobile World Congress (MWC) Barcelona 2026. AgentRAN is a first-of-its-kind system that coordinates a hierarchy of AI agents to translate high-level operator intents into real-time, autonomous 5G and 6G network configurations and services.</p><p>The demonstration is the latest milestone in a collaboration anchored at Northeastern University, where INSI has served as a nexus for industry-ac academic partnerships at the frontier of intelligent wireless networks. Over the past few years, Northeastern has built deep research ties with SoftBank on AI-native architectures, leading to multiple publications, AI-RAN Alliance demonstrations, and innovation in next-generation wireless. INSI collaborate with Keysight on AI-RAN testing and spun off zTouch Networks to commercialize technology on open, GPU-accelerated RAN infrastructure.</p><!-- Article --><p>This demo brings those threads together for the first time around a shared vision: truly autonomous, AI-driven radio access networks. At the heart of the demo is AgentRAN, developed at Northeastern's Open6G AI-RAN Alliance Lab. Operators express goals in natural language - such as \"maximize throughput while prioritizing emergency traffic\" - and the AgentRAN Manager decomposes these intents into actions for specialized agents operating across the RAN stack.</p><p>The agents are powered by the SoftBank's Large Telecom Model (LTM), a purpose-built foundation model trained on telecom-specific KPIs, configurations, and domain data--f further optimized with high-fidelity training data generated using Keysight's RF digital twin channel emulation solutions with real world accurate 3D ray tracing capabilities (RaySIM, PROPSIM) for more accurate decisions than generic cloud models can deliver. The Northeastern Open6G AI-Ran lab, using Keysight's PROPSIM, demonstrates multiple agentic scenarios, deployed on an end-to-end programmable private 5G AI-RAN infrastructure, managed and orchestrated by zTouch Networks' zTouch.OS. Using Keysight's AI-RAN performance scoring solution, the system shows clear performance gains linked to the use of SoftBank's LTM, high fidelity training datasets generated by Keysight RF digital twin solutions, and zTouch Networks' zTouch\".OS.</p></div>",
            "link": "https://hk.marketscreener.com/news/northeastern-university-softbank-corp-keysight-and-ztouch-networks-demonstrate-ltm-powered-auton-ce7e5cd9df8df022",
            "pub_date": "2026-02-27 02:41:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Carlyle-backed Quest Global plans India IPO next year, CEO says",
            "description": "<div class=\"txt-s4 article-text\"><p>Mumbai, Feb 27 (Reuters) - Singapore-headquartered engineering services firm Quest Global is looking to go public in India in the next 12 to 18 months, betting on rising demand from energy and defence clients to fuel growth, its co-founder and CEO told Reuters.</p><p>\n              The Carlyle-backed firm is seeking to ride a global move towards more complex hardware-embedded software services as traditional IT slows.</p><!-- Article --><p>\n              The planned listing reflects investor appetite for India's Engineering, Research &amp; Development segment, which offers technology support to global hardware-oriented industries such as data centres and self-driving tech. The segment accounts for around one-fifth of India's $315 billion IT industry.</p><p>\n              \"The energy sector is going to grow quite a bit because all the data centres have to be powered by energy,\" CEO Ajit Prabhu said on the sidelines of the Nasscom Technology and Leadership Forum in Mumbai this week.</p><p>\n              This marks the first time Quest Global has publicly disclosed its IPO plans. Prabhu said the firm hasn't decided whether the offering would involve a sale by existing investors, a fresh issue of shares, or a mix.</p><p>\n              Quest Global expects revenue to rise to $2.5 billion over the next five years from $1.1 billion last year -- an average annual growth rate of about 20%. It is also in the process of shifting its headquarters back to India through a reverse flip.</p><p>\n              Prabhu said engineering R&amp;D firms would outpace traditional IT services companies.</p><p>\n              \"(The) next five to ten years, in my opinion, are like a time for engineering renaissance,\" Prabhu said. \"It is a massive opportunity to bring together all of these technologies (including) chips, telecom, internet and AI.\"</p><p>\n              ER&amp;D has been growing quicker than the wider sector; industry body Nasscom estimates a 6.8% growth to $63 billion in fiscal 2026, outstripping the core IT services sector's 4.2% growth.</p><p></p><p> (Reporting by Sai Ishwarbharath B; Editing by Dhanya Skariachan and Sahal Muhammed)</p></div>",
            "link": "https://hk.marketscreener.com/news/carlyle-backed-quest-global-plans-india-ipo-next-year-ceo-says-ce7e5cd9df8df323",
            "pub_date": "2026-02-27 02:35:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "IN CASE YOU MISSED IT-Schedule of Reuters features from this week",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/in-case-you-missed-it-schedule-of-reuters-features-from-this-week-ce7e5cd9df8df324",
            "pub_date": "2026-02-27 02:35:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Most Americans back Trump's deportation goals but not his tactics, Reuters/Ipsos poll finds",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/most-americans-back-trump-s-deportation-goals-but-not-his-tactics-reuters-ipsos-poll-finds-ce7e5cd9df8df423",
            "pub_date": "2026-02-27 02:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "DIARY-Federal Reserve Events",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/diary-federal-reserve-events-ce7e5cd9df8df425",
            "pub_date": "2026-02-27 02:35:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Musk touts California robotaxis but Tesla does nothing to get permits",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/musk-touts-california-robotaxis-but-tesla-does-nothing-to-get-permits-ce7e5cd9df8df52c",
            "pub_date": "2026-02-27 02:35:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}