{
    "data": [
        {
            "title": "China c.bank: to reduce foreign exchange risk reserve ratio for foreign exchange sales to 0% from 20% effective March 2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-c-bank-to-reduce-foreign-exchange-risk-reserve-ratio-for-foreign-exchange-sales-to-0-from-20-ce7e5cded98cf62d",
            "pub_date": "2026-02-27 08:41:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "China PBOC expected to set yuan mid-point at 6.8428 per dollar - Reuters estimate",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/china-pboc-expected-to-set-yuan-mid-point-at-6-8428-per-dollar-reuters-estimate-ce7e5cded98df72c",
            "pub_date": "2026-02-27 08:31:33",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's Lee to visit Singapore and the Philippines from March 1 to 4",
            "description": "<div class=\"txt-s4 article-text\"><p>SEOUL, Feb 27 (Reuters) - South Korean President Lee Jae Myung will make state visits to Singapore and the Philippines in early March, according to his office on Friday. </p><p>\n              Lee will hold a summit with Singaporean Prime Minister Lawrence Wong in Singapore during his visit between March 1 to 3.</p><!-- Article --><p>\n              He will then visit the Philippines and meet with President Ferdinand Marcos Jr between March 3 to 4, the presidential Blue House said in a statement.</p><p></p><p> (Reporting by Kyu-seok ShimEditing by Ed Davies)</p></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-lee-to-visit-singapore-and-the-philippines-from-march-1-to-4-ce7e5cded98af123",
            "pub_date": "2026-02-27 08:25:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Intuit Logs Higher 2Q Profit, Gives Soft 3Q Outlook -- Update",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kelly Cloonan </p><br/><p>\n  Intuit logged higher profit and sales in its latest quarter as its QuickBooks platform continues to attract demand. </p><!-- Article --><p>\n\n  However, the financial technology company's profit guidance for the fiscal third quarter--which overlaps with peak tax season--came in short of Wall Street's expectations. </p><p>\n\n  The stock fell 5.4% to $373 in after-hours trading on Thursday. Through the market close shares have declined 37% in the past year. </p><p>\n\n  The company behind TurboTax and Credit Karma said its margins in the current quarter would be dented in part by a shift in marketing costs from the fiscal second quarter. </p><p>\n\n  For the fiscal third quarter, which falls during peak tax season, Intuit expects revenue to grow about 10%, earnings per share of $10.56 to $10.62 and adjusted earnings per-share of $12.45 to $12.51. </p><p>\n\n  Analysts polled by FactSet forecast revenue growth of about 9.9%, earnings per share of $11.13 and adjusted earnings per share of $12.97. </p><p>\n\n  Chief Financial Officer Sandeep Aujla said he remains confident in Intuit's guidance for the fiscal year, which ends July 31. </p><p>\n\n  \"We operate to delivering margins for the full year. I feel super confident in our guide for the full year,\" Aujla said during a call with analysts. </p><p>\n\n  The company's fiscal-year outlook calls for revenue of about $21 billion to $21.19 billion, earnings per share of $15.49 to $15.69 and adjusted earnings per share between $22.98 to $23.18. </p><p>\n\n  For the fiscal second quarter, Intuit posted a profit of $693 million, or $2.48 a share, for the quarter ended Jan. 31, compared with $471 million, or $1.67 a share, a year earlier. </p><p>\n\n  Adjusted earnings per share were $4.15, compared with estimates of $3.68 a share according to analysts polled by FactSet. </p><p>\n\n  Revenue climbed 17% to $4.65 billion, compared with analyst estimates of $4.53 billion. </p><p>\n\n  By segment, revenue from Intuit's global business solutions group increased 18%, to $3.2 billion, helped in part by growth for its QuickBooks online accounting business. Consumer revenue rose 15% to $1.5 billion due to higher Credit Karma and TurboTax revenue. </p><br/><p>\n  Write to Kelly Cloonan at kelly.cloonan@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-26-26 1917ET</p></div>",
            "link": "https://hk.marketscreener.com/news/intuit-logs-higher-2q-profit-gives-soft-3q-outlook-update-ce7e5cded98af720",
            "pub_date": "2026-02-27 08:21:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve mounts challenge to Justice Department subpoenas, WSJ says",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 26 (Reuters) - The U.S. Federal Reserve is waging a behind-closed-doors legal challenge to two subpoenas issued in U.S. Attorney Jeanine Pirro's criminal investigation of Chair Jerome Powell, the Wall Street Journal said on Thursday.</p><p>\n              Reuters could not immediately confirm the report. </p><!-- Article --><p></p><p> (Reporting by Gnaneshwar Rajan in Bengaluru; Editing by Clarence Fernandez)</p></div>",
            "link": "https://hk.marketscreener.com/news/federal-reserve-mounts-challenge-to-justice-department-subpoenas-wsj-says-ce7e5cded98bf122",
            "pub_date": "2026-02-27 08:21:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warmer winters leave Pakistan festival on thin ice",
            "description": "<div class=\"txt-s4 article-text\"><p>HUNZA VALLEY, Pakistan, Feb 27 (Reuters) - Every winter for decades, the pool in front of Aleena Gul's house in Pakistan's Hunza Valley has transformed into an ice rink, framed by jagged Himalayan peaks and the stone walls of Altit Fort.</p><p>\n              This year, it did not.</p><!-- Article --><p>\n              Gul can see the swimming pool that doubles as a hockey arena from her bedroom.</p><p>\n              For years, she would wake up at dawn, lace her skates and step straight from her front door onto solid ice.</p><p>\n              After four years away at university, she returned eager to play again, but has found herself waiting for winter to arrive.</p><p>\n              \"There's a big difference between 2018 and now,\" said Gul, 21, captain of her team and among the first women in Hunza to take up the sport. \"Winter used to begin in November and everything would freeze. It's January now and the ice still hasn't frozen properly.\"</p><p>\n              Across Pakistan's northern mountains, winters are arriving later and behaving unpredictably. Cold spells are shorter, freeze-thaw cycles unstable. In the wider Hindu Kush-Himalayan region, scientists report fewer extreme cold events and shorter snow seasons; what locals call a \"snow drought,\" when snowfall fails to settle.</p><p>\n              The change is visible in Hunza. Data compiled by WeatherWalay, a climate analytics platform, shows average winter precipitation has fallen about 30% since the late 2010s, recording four consecutive years below normal. Some recent winters have also been 2-3°C milder, so there is less snow to sustain the ice. </p><p>\n              Unlike European resorts with artificial snow, Hunza's tournament depends entirely on natural ice.</p><p>\n              In a valley heavily dependent on tourism, winter sport now hinges on weather that no longer follows old rhythms.</p><p><b>ICE UNDER PRESSURE </b></p><p>\n              For eight seasons, Altit's pool has hosted the Karakoram Interlude, a community-run tournament that draws teams from across northern Pakistan and extends the tourist season beyond summer.</p><p>\n              On good years, the rink glows under floodlights, spectators leaning over stone parapets tea cups in hand, their breath rising in white clouds.</p><p>\n              This year, organisers prepared the rink as always, pouring water at night and smoothing the surface by hand to allow temperatures of below -20°C to set the layers.</p><p>\n              \"We stayed up until 3 a.m. trying to help it freeze,\" Gul said. \"We're doing everything we can.\"</p><p>\n              In 2024, \"we started seeing a sudden change in weather patterns like snowfall, freezing levels and overall temperatures,\" said Sadiq Saleem, 31, president of the Altit Town Management Society and a founding member of the youth organisation SCARF, which pioneered ice hockey in the valley.</p><p>\n              Thin puddles formed where blades scratched the ice. Hairline cracks spread beneath the surface. Organisers pressed their palms to the ice, checking for flex and listening for cracks.</p><p>\n              \"We worked on this arena for a week,\" said Naseer Uddin, 34, co-founder of SCARF. \"But when the sun came out strongly, it ruined everything.\"</p><p>\n              The opening ceremony went ahead under floodlights, but organisers warned the rink was too fragile to support entire teams.</p><p>\n              Only captains stepped forward to unveil jerseys beside sponsors, wary of the thinning ice.</p><p>\n              The traditional opening night friendly match was cancelled.</p><p><b>CHASING COLD </b></p><p>\n              There was little time to argue with the weather.</p><p>\n              Within hours, organisers moved through Altit's lanes, calling players and knocking on doors. The tournament was moved nearly two hours north to Sost, one of the last towns in Pakistan before the Chinese border, where colder air offered better odds of sufficient ice. </p><p>\n              They had done this before.</p><p>\n              Two winters ago, when the pool in Altit also failed to freeze, the ice in Sost, about 2,800 metres (9,186 feet) above sea level -- roughly 300 to 400 metres higher than Altit -- held firm.</p><p>\n              This year, that solution faltered too.</p><p>\n              For Gul, it felt like chasing a season that kept retreating.</p><p>\n              In Sost, the rink lay on an exposed stretch of valley floor near the Khunjerab Pass, beneath steep, wind-cut ridges funnelling cold air down from even higher elevations.</p><p>\n              And while the surface was firmer than Altit's pool, some parts were thin. Players tested it cautiously before committing their weight.</p><p>\n              Three matches were scheduled that first day. Only one went ahead.</p><p>\n              \"When we reached the rink the ice wasn't in good condition,\" Gul said. \"Teams still played, but it was very difficult. We've never experienced this before.\"</p><p>\n              Skaters stumbled where the ice had cracked and softened, blades catching unexpectedly. </p><p>\n              Each evening, organisers poured water across the rink, hoping the overnight temperatures would help it freeze.</p><p>\n              \"Our event depends entirely on natural ice,\" said Saliha Ibrahim, 21, part of the organising team. \"If we can't improve the surface, we may have to consider changing the venue again.\"</p><p><b>WINTER CAN'T PAY THE BILLS</b></p><p>\n              It is not only the players who feel the strain.</p><p>\n              Unpredictable winters ripple through cafés, guesthouses and transport operators. Smaller guesthouses without heating struggle as pipes freeze, cutting off water, then thaw and refreeze unpredictably, raising the risk of bursts and costly repairs. </p><p>\n              Globally, fewer regions can reliably host winter sports as temperatures rise.</p><p>\n              In Hunza, a district of fewer than 100,000 people, residents are confronting that reality without artificial snow or refrigeration systems -- and without certainty. </p><p>\n              Winter has long been quieter than summer in Hunza, but residents say erratic snowfall, floods and impassable roads deter visitors who come for snow-covered peaks and frozen lakes, just as the Karakoram Interlude had begun drawing travellers from across Pakistan and beyond.</p><p>\n              Naseera Khatoon runs Murku Café overlooking the pool in Altit. Her daughter, Arifa, plays ice hockey. In previous years, tournament week meant steady customers, with families lingering long after matches ended over meals of traditional soup and dumplings.</p><p>\n              This year, despite the ceremony, her café remained quiet.</p><p>\n              \"Usually we earn income during the tournament,\" she said. \"This time, there was very little.\"</p><p>\n              She remembers winters when snowfall was heavy enough to close schools for months and families stored food in advance of long, cold spells.</p><p>\n              \"We used to dry vegetables and store groceries because roads would close [in winter],\" she said. \"Now food is available year-round, but the snow and ice are disappearing.\"</p><p>\n              Kareem ul Hayat, who oversees the restored 900-year-old Altit Fort, said winter tourism had grown as events like ice hockey drew visitors. In recent winters, he said, numbers had waned.</p><p>\n              \"In the past, the mountains stayed white,\" he said. \"Now the snow disappears quickly.\"</p><p><b>TITLE ON THIN ICE</b></p><p>\n              Back in Sost, the tournament continued.</p><p>\n              Players adjusted their game to the more challenging conditions. Spectators tightened their scarves against the wind.</p><p>\n              Yahya Karim, 20, a player from Altit, said the surface was unlike anything the team had trained on.</p><p>\n              \"I expected better ice conditions, but when I saw the rink I felt a bit sad,\" he said. \"Many of our players fell. The surface had too many bumps and wasn't strong.\"</p><p>\n              They had chased winter north. But even there, the cold remained elusive.</p><p>\n              On a scarred, uneven rink, Gul's team emerged victorious, a title claimed on fragile ice far from home.</p><p></p><p>(Reporting by Ariba Shahid and Salah Uddin in Hunza Valley, Pakistan; Editing by Saad Sayeed, Lucy Craymer and Kate Mayberry)</p></div>",
            "link": "https://hk.marketscreener.com/news/warmer-winters-leave-pakistan-festival-on-thin-ice-ce7e5cded98bf325",
            "pub_date": "2026-02-27 08:16:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wall St ends lower as AI fervor wanes after Nvidia results",
            "description": "<div class=\"txt-s4 article-text\"><p>STORY: U.S. stocks closed mostly lower on Thursday, with the Dow ending essentially flat, the S&amp;P 500 shedding more than half a percent and the Nasdaq falling more than one percent.</p><p>\n              Nvidia's fourth-quarter results, posted after Wednesday's closing bell, were better than analysts expected, but the world's richest company by market cap wrestled with increasingly difficult year-over-year comparisons as its revenue growth decelerates. Its shares ended 5.49% lower.</p><!-- Article --><p>\n              Eric Diton is president and managing director of The Wealth Alliance.</p><p>\n              \"Let's be clear. This is a $5 trillion company. When you get big, you're supposed to slow down. You can't keep growing that fast, right - the law of big numbers. They continue to crush it. Data center revenue up 75%. Gross margin expanded, went up to 75%, revenues up 73% sequentially, up 20%. These are numbers that are virtually unheard of. And yes, the (Nvidia) stock is down over 5%. What is going on? Is this as good as it gets? That's what the market is asking.\"</p><p>\n              Among other movers, shares of Jack Dorsey's Block soared more than 25% in extended trading after the payments firm said it will cut over 4,000 jobs, nearly half its workforce, as advances in AI reshape how it builds and runs its business.</p><p>\n              Outside of tech, shares of J.M. Smucker surged nearly 9% on the packaged food company's solid quarterly profit and sales estimates.</p></div>",
            "link": "https://hk.marketscreener.com/news/wall-st-ends-lower-as-ai-fervor-wanes-after-nvidia-results-ce7e5cded98bf42c",
            "pub_date": "2026-02-27 08:16:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "U.S. attorney Jeanine Pirro is investigating testimony chair Jerome Powell provided last summer around building renovations- WSJ",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/u-s-attorney-jeanine-pirro-is-investigating-testimony-chair-jerome-powell-provided-last-summer-arou-ce7e5cded98bf62c",
            "pub_date": "2026-02-27 08:10:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Federal Reserve mounts closed-door fight against Justice Department subpoenas - WSJ",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/federal-reserve-mounts-closed-door-fight-against-justice-department-subpoenas-wsj-ce7e5cded98bf622",
            "pub_date": "2026-02-27 08:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK activists plan protests over climate, social impacts of AI data centres",
            "description": "<div class=\"txt-s4 article-text\"><p>LONDON, Feb 27 (Reuters) - Activists are set to take to British streets on Friday for two days of protests against the expansion of data centres to serve booming demand for artificial intelligence, and the impact of the facilities on communities and the environment.</p><p>\n              The protests, coordinated by environmental charity Global Action Plan, are part of a growing international backlash against the power- and water-hungry sites needed to meet surging demand for AI computing power.</p><!-- Article --><p>\n              \"Big Tech's unchecked construction of hyperscale AI data centres is putting the UK's climate targets at risk,\" said Oliver Hayes, Head of Campaigns at Global Action Plan, in a statement.</p><p>\n              Among the biggest is set to be the 'March Against The Machines' event starting outside the offices of OpenAI on Saturday at midday.</p><p>\n              While there is no formal definition of what a data centre is in Britain or how many there are, a techUK report from November 2024 put the number at around 450. </p><p>\n              The British energy regulator said 140 data centres had signalled they wanted to plug into the grid and could require 50 gigawatts of power. By comparison, it said peak British electricity demand on February 11 was 45 GW.</p><p>\n              OpenAI said in January it would create a community plan for each of the sites in its Stargate operation, a $500 billion initiative to build AI data centres for training and inference.</p><p>\n              Tech companies are investing directly in power infrastructure as energy access becomes a critical constraint on AI expansion, with the push for larger and more numerous data centres driving electricity demand higher.</p><p>\n              In Havering, east London, Ian Pirie, Coordinator Friends of the Earth Havering, said plans to build locally were \"completely inappropriate in a semi-rural Green Belt area\", citing what he called its power and water needs and the destruction of farmland.</p><p>\n              Leigh Tugwood, Co-chair of Iver Heath Residents Association, protesting against a build in Buckinghamshire, said he was concerned that datacentre development was being fast-tracked at the expense of local communities.</p><p>\n              \"We are, therefore, in support of a moratorium on all future hyperscale data centre development unless and until there is informed debate, a public inquiry and a meaningful community-designed engagement framework that ensures ownership of the process by those most likely to be impacted,\" he said.</p><p></p><p> (Reporting by Simon Jessop, Editing by William Maclean)</p><p>\n            By Simon Jessop</p></div>",
            "link": "https://hk.marketscreener.com/news/uk-activists-plan-protests-over-climate-social-impacts-of-ai-data-centres-ce7e5cded988ff2c",
            "pub_date": "2026-02-27 08:10:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's Lee to visit Singapore and Philippines from March 1-4 - media",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-lee-to-visit-singapore-and-philippines-from-march-1-4-media-ce7e5cded988f126",
            "pub_date": "2026-02-27 08:10:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Tokyo Core CPI Rises 1.8% In February",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/tokyo-core-cpi-rises-1-8-in-february-ce7e5cded989f621",
            "pub_date": "2026-02-27 08:01:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Activist investor Ancora Holdings on Netflix's decision to not raise bid says \"This is a win-win for WBD shareholders and the industry\" - statement",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/activist-investor-ancora-holdings-on-netflix-s-decision-to-not-raise-bid-says-this-is-a-win-win-for-ce7e5cded989f624",
            "pub_date": "2026-02-27 08:01:34",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ancora on Warner Bros: \"Thrilled to have shined a light on need for WBD board to pursue a larger, more certain deal with Paramount\"",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ancora-on-warner-bros-thrilled-to-have-shined-a-light-on-need-for-wbd-board-to-pursue-a-larger-mo-ce7e5cded989f72d",
            "pub_date": "2026-02-27 08:01:35",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Warner Bros Discovery Inc: \"Once our board votes to adopt the Paramount merger agreement, it will create tremendous value for our shareholders\"",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/warner-bros-discovery-inc-once-our-board-votes-to-adopt-the-paramount-merger-agreement-it-will-cr-ce7e5cded989f723",
            "pub_date": "2026-02-27 08:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Cuts Over 4,000 Jobs; Shares Rise 28%",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-cuts-over-4-000-jobs-shares-rise-28-ce7e5cded989f727",
            "pub_date": "2026-02-27 08:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Suntory To Trim Scotch Output In UK As US Sales Weaken",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/suntory-to-trim-scotch-output-in-uk-as-us-sales-weaken-ce7e5cd9d080fe2d",
            "pub_date": "2026-02-27 08:01:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venezuela suspends 19 oil, gas production-sharing contracts signed under Maduro government, sources say",
            "description": "<div class=\"txt-s4 article-text\"><p>HOUSTON, Feb 26 (Reuters) - Venezuela's oil ministry has suspended 19 oil production-sharing contracts with private companies signed under the administration of President Nicolas Maduro, four sources with knowledge of the move told Reuters.</p><p>\n              The suspension has had no impact on the country's oil and gas output so far, the sources said. State oil giant PDVSA is selling the crude produced under the contracts while they are suspended, they added.</p><!-- Article --><p>\n              Caracas and Washington would review the contracts and may recommend revoking some of them, the sources said. The Venezuelan and U.S. governments are reviewing the credentials of the companies that signed them, the sources added. Some of the companies are little-known and the deals were signed while Venezuela was under U.S. sanctions.</p><p>\n              The United States captured Maduro in January and took control of Venezuela's oil exports and sales. Since then, the U.S. Treasury Department has issued licenses that allow some companies to trade Venezuela's oil and to operate in the country's oil and gas sectors. </p><p>\n              Venezuela's National Assembly passed a reform to the country's hydrocarbon law in late January to facilitate foreign investment in the dilapidated oil industry. Under the reformed law, the government has six months to review existing contracts. </p><p>\n              Venezuela's oil ministry and the White House did not immediately reply to a request for comment. </p><p></p><p> (Reporting by Marianna Parraga in Houston, Erin Banco in New York and Reuters staff; Editing by Simon Webb and Nia Williams)</p><p>\n            By Marianna Parraga</p></div>",
            "link": "https://hk.marketscreener.com/news/venezuela-suspends-19-oil-gas-production-sharing-contracts-signed-under-maduro-government-sources-ce7e5cd9d080fe21",
            "pub_date": "2026-02-27 08:01:38",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Core inflation in Japan's capital slows, falling below central bank's 2% target",
            "description": "<div class=\"txt-s4 article-text\"><p>TOKYO, Feb 27 (Reuters) - Annual core inflation in Japan's capital slowed in February as food price hikes run their course, data showed on Friday, offering consumers some relief but complicating the central bank's communication in justifying further rate hikes.</p><p>\n              The data is in line with the Bank of Japan's projection that consumer inflation will temporarily slow due to the impact of fuel subsidies and the base effect of last year's spike, before reaccelerating on steady wage gains.</p><!-- Article --><p>\n              The Tokyo core consumer price index, which excludes volatile costs of fresh food, rose 1.8% in the year to February after a 2.0% gain in January, data showed, falling below the central bank's 2% target for the first time since October 2024. It compared with a median market forecast for a 1.7% gain.</p><p>\n              An index stripping away the effect of fresh food and fuel, which is seen as a better gauge of trend inflation, rose 2.5% in February from a year earlier after a 2.4% gain in January.</p><p>\n              The BOJ raised interest rates to a 30-year high of 0.75% in December, taking another landmark step in ending decades of huge monetary support in a sign of its conviction that Japan is progressing toward durably hitting its 2% inflation target.</p><p>\n              The central bank has signalled its readiness to continue raising interest rates if its economic and price forecasts materialise.</p><p></p><p> (Reporting by Leika Kihara and Makiko Yamazaki; Editing by Jamie Freed)</p></div>",
            "link": "https://hk.marketscreener.com/news/core-inflation-in-japan-s-capital-slows-falling-below-central-bank-s-2-target-ce7e5cd9d080fe25",
            "pub_date": "2026-02-27 08:01:39",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan Taps Two Dovish Economists for BOJ Board",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/japan-taps-two-dovish-economists-for-boj-board-ce7e5cd9d080ff2d",
            "pub_date": "2026-02-27 08:01:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Japan Aircraft Output Exceeds 2 Trillion Yen In 2025",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/japan-aircraft-output-exceeds-2-trillion-yen-in-2025-ce7e5cd9d080f023",
            "pub_date": "2026-02-27 08:01:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Venezuela, U.S. to revise oil production-sharing contracts signed under Maduro administration, may revoke some deals, industry sources say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/venezuela-u-s-to-revise-oil-production-sharing-contracts-signed-under-maduro-administration-may-r-ce7e5cd9d080f125",
            "pub_date": "2026-02-27 08:01:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Maduro moves to dismiss US criminal case, citing dispute over legal fees",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - Ousted Venezuelan President Nicolas Maduro asked a judge on Thursday to throw out his U.S. drug trafficking case, alleging the U.S. government is interfering with his defense by blocking the Venezuelan government from paying his legal fees.</p><p></p><p> (Reporting by Andrew Goudsward; Editing by Chris Reese)</p></div>",
            "link": "https://hk.marketscreener.com/news/maduro-moves-to-dismiss-us-criminal-case-citing-dispute-over-legal-fees-ce7e5cd9d08cf726",
            "pub_date": "2026-02-27 07:06:23",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nicolas Maduro files motion to dismiss US criminal case, citing due process violations - filing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nicolas-maduro-files-motion-to-dismiss-us-criminal-case-citing-due-process-violations-filing-ce7e5cd9d08df12c",
            "pub_date": "2026-02-27 07:01:00",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Sysco Keeps Quarterly Dividend at $0.54 per Share, Payable April 24 to Holders of Record on April 2",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/sysco-keeps-quarterly-dividend-at-0-54-per-share-payable-april-24-to-holders-of-record-on-april-2-ce7e5cd9d08df122",
            "pub_date": "2026-02-27 07:01:01",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CFO says substantially all of 2026 capex is tied to already signed customer contract",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-cfo-says-substantially-all-of-2026-capex-is-tied-to-already-signed-customer-contract-ce7e5cd9d08cf62c",
            "pub_date": "2026-02-27 07:15:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Democrat questions use of USAID funds for Trump budget chief's security",
            "description": "<div class=\"txt-s4 article-text\"><p>WASHINGTON, Feb 26 (Reuters) - A Democratic lawmaker is questioning the use of funds from the former U.S. foreign aid agency to pay for White House budget chief Russell Vought's security, calling it \"a gross abuse of power\" and a deviation from their congressionally approved purpose.</p><p>\n              Reuters reported on February 13 that the Office of Management and Budget has allocated more than $15 million from U.S. Agency for International Development operating expenses to cover the cost of Vought's protection by the U.S. Marshals Service this year.</p><!-- Article --><p>\n              Referring to the Reuters report, Representative Raja Krishnamoorthi wrote in a letter to Vought on Wednesday that using the funds for his security detail \"deviates sharply from Congress's intent and undermines the agency's core purpose.\"</p><p>\n              \"The misuse of funds is fundamentally wrong and a gross abuse of power,\" Krishnamoorthi said.</p><p>\n              Vought's office did not immediately respond to a request for comment.</p><p>\n              Trump last year ordered USAID's closure, claiming without offering proof that it was rife with corruption. Thousands of personnel and contractors were fired and programs closed, throwing U.S.-funded global aid programs into turmoil.</p><p>\n              A skeleton crew is closing out USAID's remaining contracts and is due to shut the 64-year-old agency for good by September.</p><p>\n              Krishnamoorthi asked Vought to disclose details of the USAID funds being used to pay for his security, including their \"original congressional intent\" and whether the budget chief had notified Congress that they had been reallocated.</p><p>\n              Krishnamoorthi also asked whether other White House funding sources were considered and who authorized the USAID funds to be used to cover the costs of his protection. </p><p></p><p>(Reporting by Jonathan Landay and Douglas Gillison; Editing by Don Durfee, Rod Nickel)</p></div>",
            "link": "https://hk.marketscreener.com/news/democrat-questions-use-of-usaid-funds-for-trump-budget-chief-s-security-ce7e5cd9d08df125",
            "pub_date": "2026-02-27 07:01:02",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "German union says settlement reached in dispute with Tesla",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/german-union-says-settlement-reached-in-dispute-with-tesla-ce7e5cd9d08df22c",
            "pub_date": "2026-02-27 07:01:03",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump administration moves to nix Biden-era limits on independent contractors",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-administration-moves-to-nix-biden-era-limits-on-independent-contractors-ce7e5cd9d08df227",
            "pub_date": "2026-02-27 07:01:04",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "South Korea's MFG tenders for up to 210,000 tons of corn, traders say",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/south-korea-s-mfg-tenders-for-up-to-210-000-tons-of-corn-traders-say-ce7e5cd9d08df224",
            "pub_date": "2026-02-27 07:01:05",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Walmart agrees to pay $100 million to settle deceptive earnings charges, FTC says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/walmart-agrees-to-pay-100-million-to-settle-deceptive-earnings-charges-ftc-says-ce7e5cd9d08df320",
            "pub_date": "2026-02-27 07:01:06",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coupang: Will continue to see muted trends in growth and profitability over the next few months due to data incident",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coupang-will-continue-to-see-muted-trends-in-growth-and-profitability-over-the-next-few-months-due-ce7e5cd9d08cf622",
            "pub_date": "2026-02-27 07:15:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Wabtec Settles Antitrust Lawsuit With Caterpillar Unit",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/wabtec-settles-antitrust-lawsuit-with-caterpillar-unit-ce7e5cd9d08df423",
            "pub_date": "2026-02-27 07:01:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US natgas futures hit five-month low on milder weather forecasts, low storage draw",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-natgas-futures-hit-five-month-low-on-milder-weather-forecasts-low-storage-draw-ce7e5cd9d08df421",
            "pub_date": "2026-02-27 07:01:08",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Price increases in PCs are causing some customers to pull purchases forward, likely draining IT budgets in the near term to some degree",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-price-increases-in-pcs-are-causing-some-customers-to-pull-purchases-forward-ce7e5cd9d08df620",
            "pub_date": "2026-02-27 06:55:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CoreWeave CFO says company expects Q1 adjusted operating income between zero and $40 million",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-cfo-says-company-expects-q1-adjusted-operating-income-between-zero-and-40-million-ce7e5cd9d08df626",
            "pub_date": "2026-02-27 06:55:56",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Recent strategy of delaying price increases in CSG was a deliberate move to aggressively regain market share",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-recent-strategy-of-delaying-price-increases-in-csg-was-a-deliberate-move-to-ce7e5cd9d08df72c",
            "pub_date": "2026-02-27 06:55:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nicolas Maduro intends to file motion to dismiss US criminal case, citing due process violations - filing",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/nicolas-maduro-intends-to-file-motion-to-dismiss-us-criminal-case-citing-due-process-violations-f-ce7e5cd9d08df721",
            "pub_date": "2026-02-27 06:55:57",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coreweave CFO: We remain confident in our ability to achieve 25 to 30% margins over the long term",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coreweave-cfo-we-remain-confident-in-our-ability-to-achieve-25-to-30-margins-over-the-long-term-ce7e5cd9d08df720",
            "pub_date": "2026-02-27 06:55:58",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies exec: Co had lost market share in the PC segment for the past three years",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-exec-co-had-lost-market-share-in-the-pc-segment-for-the-past-three-years-ce7e5cd9d08df727",
            "pub_date": "2026-02-27 06:55:59",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}