{
    "data": [
        {
            "title": "Swiss to wind down private bank that US accused of money laundering",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Switzerland's financial regulator FINMA said on Friday it would wind down MBaer Merchant Bank AG after Washington threatened to cut the private bank's access to the U.S. financial system for breaching sanctions against Iran and Russia.</p><p>\n              The U.S. Treasury Department had alleged that Zurich-based MBaer and its employees had facilitated corruption linked to Russian money laundering, as well as money laundering and terrorist financing on behalf of Iran's Islamic Revolutionary Guard Corps and its Quds Force, which are sanctioned by the United States.</p><!-- Article --><p>\n              FINMA said in a statement the bank lacked adequate anti-money-laundering controls, allowing clients to evade asset freezes. A regulatory investigation found that 80% of MBaer's business relationships carried heightened risks, and 98% of incoming assets came from high-risk clients.</p><p>\n              The bank repeatedly ignored its compliance department's recommendations, systematically failed to investigate the background of its business relationships and transactions, did not always fulfil its anti-money laundering obligations and, in several cases, executed transactions on behalf of clients who were on sanctions lists, FINMA said.</p><p>\n              \"The case is extremely serious,\" the regulator said. \"Through its conduct and inadequate organisation, (the bank) exposed itself and the Swiss financial centre to disproportionately high risks.\"</p><p>\n              FINMA said MBaer had almost 700 clients and more than 60 employees, and held client assets totalling 4.9 billion Swiss francs at the end of 2025.</p><p><b>BOARD OF DIRECTORS RESIGNED</b></p><p>\n              MBaer said in a statement on Friday it is now in liquidation and represented solely by the appointed liquidators, Daniel Staehelin and Lukas Bopp of law firm Kellerhals Carrard Basel KlG. The board of directors has resigned, the bank added.</p><p>\n              The bank said it had sufficient assets to satisfy all clients and creditors in full. However, after the U.S. intervention and the revocation of its licence, transaction restrictions mean it can currently make payments only in Swiss francs and up to 100,000 francs ($130,106.69) per client.</p><p>\n              FINMA said it had started enforcement proceedings against MBaer in 2024. These proceedings ended three weeks ago, but due to an MBaer appeal, which the bank withdrew on Friday, FINMA had been unable to implement the wind-down plans.</p><p>\n              A raft of international sanctions have been imposed on Russia since its invasion of Ukraine, and Iran has been heavily sanctioned by the U.S. for years. U.S. Treasury Secretary Scott Bessent said on Thursday that banks should be \"on notice\" that the Treasury will use the \"full force of our authorities\" to protect the integrity of the U.S. financial system.</p><p>\n              ($1 = 0.7686 Swiss francs)</p><p>\n               (Reporting by Linda Pasquini, Dave Graham and John O'Donnell, writing by Elizabeth Howcroft, editing by Thomas Seythal and Louise Heavens)</p></div>",
            "link": "https://hk.marketscreener.com/news/swiss-to-wind-down-private-bank-that-us-accused-of-money-laundering-ce7e5cdfda89f62d",
            "pub_date": "2026-02-28 02:01:36",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ford Attorney Says First Brands to Sell Factories Making Parts for Automaker",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ford-attorney-says-first-brands-to-sell-factories-making-parts-for-automaker-ce7e5cdfdc88f02d",
            "pub_date": "2026-02-28 02:01:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Toronto Stocks Decline, But Remain On Track for Weekly Gains",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Robb M. Stewart </p><br/><p>\n  Shares on Canada's main exchange retreated Friday, echoing Wall Street's pullback on the last trading day of the month as investors grow increasingly worried about the boom in artificial intelligence. </p><!-- Article --><p>\n\n  In midday trading, the Toronto Stock Exchange's S&amp;P/TSX Composite Index was 0.5% lower at 34341.05. That ate into the prior session's advance but still has the index heading for a 1.5% rise this week and a gain of 7.6% in February. </p><p>\n\n  Technology stocks led the move lower, with Constellation Software leading the losers board with a fall of 2.8%. Heavily-weighted Shopify also dragged on the market, losing 4.7%. </p><p>\n\n  The blue-chip S&amp;P/TSX 60 was down 0.6% at 1974.52. </p><p>\n\n  Data released ahead of the opening bell Friday showed that Canada's economy contracted 0.6% in annual terms in the final quarter of last year, a slightly deeper contraction than expected. Still, the decline was driven largely by a large drawdown in business inventories despite a rise in exports, as well as a rise in both household and government spending. </p><p>\n\n  Economists said the underlying resilience reflected in the data is likely allow the Bank of Canada to remain on the sidelines, having already left its policy interest rate unchanged twice in a row amid heightened trade uncertainty and geopolitical risk. </p><br/><p>\n  Other market movers: </p><p>\n\n  TransAlta's shares climbed 4.4% to C$18.59 after the power-generation company recorded a narrowed loss in the fourth quarter of 2025. </p><p>\n\n  Laurentian Bank was little changed after the lender reported a loss for the first quarter of its fiscal year, contrasting with stronger-than-expected underlying earnings for Canada's biggest banks. </p><p>\n\n  AtkinsRealis was 2.9% lower at C$93.29 despite the engineering and project management company posting a rise in profit and revenue in the fourth quarter, with momentum expected to carry into 2026. </p><br/><p>\n  Write to Robb M. Stewart at robb.stewart@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1255ET</p></div>",
            "link": "https://hk.marketscreener.com/news/toronto-stocks-decline-but-remain-on-track-for-weekly-gains-ce7e5cdfdc88f12c",
            "pub_date": "2026-02-28 02:01:37",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Flagship-backed Generate Biomedicines shares fall 6% in Nasdaq debut",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/flagship-backed-generate-biomedicines-shares-fall-6-in-nasdaq-debut-ce7e5cdfdc88f223",
            "pub_date": "2026-02-28 01:56:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Subaru Recalls About 70,000 Vehicles Due to Fire Risk",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  By Kelly Cloonan </p><br/><p>\n  Subaru of America recalled roughly 70,000 vehicles over fire risk due to a faulty seal on the vehicles' fuel tank cap. </p><!-- Article --><p>\n\n  The National Highway Traffic Safety Administration said the recall affects certain 2026 Crosstrek hybrid and 2025 Forester hybrid vehicles. </p><p>\n\n  When the fuel tank in those models is near full capacity, higher temperatures could cause the fuel to expand and spill out of the filler neck due to an insufficient seal on the fuel cap, the NHTSA said. </p><p>\n\n  The NHTSA said dealers will replace the fuel filler cap gasket free of charge. It advises vehicle owners to park outside and away from structures and to limit the fuel level to 50% until replacing the fuel cap. </p><p>\n\n  Owner notification letters are expected to be mailed March 25. </p><br/><p>\n  Write to Kelly Cloonan at kelly.cloonan@wsj.com </p><br/><p>\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1251ET</p></div>",
            "link": "https://hk.marketscreener.com/news/subaru-recalls-about-70-000-vehicles-due-to-fire-risk-ce7e5cdfdc88f324",
            "pub_date": "2026-02-28 01:56:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "BASF SE Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>BASF SE reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was EUR 59,657 million compared to EUR 61,444 million a year ago. Net income was EUR 1,619 million compared to EUR 1,298 million a year ago.</p><p>Basic earnings per share from continuing operations was EUR 1.63 compared to EUR 1.29 a year ago. Basic earnings per share was EUR 1.82 compared to EUR 1.45 a year ago. Diluted earnings per share was EUR 1.81 compared to EUR 1.45 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/basf-se-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdc88f426",
            "pub_date": "2026-02-28 01:56:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UnitedHealth caps employee pay raises to 2%, Bloomberg News reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/unitedhealth-caps-employee-pay-raises-to-2-bloomberg-news-reports-ce7e5cdfdc88f425",
            "pub_date": "2026-02-28 01:56:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says more Iran talks expected on Friday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-says-more-iran-talks-expected-on-friday-ce7e5cdfdc88f52c",
            "pub_date": "2026-02-28 01:56:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Shimano, Inc. Opposes Shareholder Proposal from LONGCHAMP SICAV Regarding Treasury Stock Acquisition",
            "description": "<div class=\"txt-s4 article-text\"><p>On February 27, 2026, Shimano, Inc., received a shareholder proposal from LONGCHAMP SICAV regarding the acquisition of treasury stock. The Board of Directors opposed this proposal, stating that implementing a large-scale treasury stock acquisition of 200 billion yen within a short period would narrow the room for necessary growth investments, impair their ability to respond to significant transformations in their business, and disrupt the entire supply chain. The Board emphasized their commitment to maintaining stable dividends and executing treasury stock acquisitions as part of their shareholder return strategy, while also ensuring financial soundness to support growth investments and respond to unforeseen risks.</p></div>",
            "link": "https://hk.marketscreener.com/news/shimano-inc-opposes-shareholder-proposal-from-longchamp-sicav-regarding-treasury-stock-acquisition-ce7e5cdfdc88f522",
            "pub_date": "2026-02-28 01:56:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Eli Lilly and Company's Olumiant Recommends by CHMP for Approval of Expanded Use in the European Union for Adolescents with Severe Alopecia Areata",
            "description": "<div class=\"txt-s4 article-text\"><p>Eli Lilly and Company and Incyte announced that the European Medicines Agency's (EMA) Committee for Medicinal Products for Human Use (CHMP) has issued a positive opinion for Olumiant (baricitinib) for the treatment of adolescents (ages 12 to 1). Olumiant is a once-daily, oral JAK inhibitor discovered by Incyte and licensed to Lilly. In 2022, the European Commission (EC) and U.S. Food and Drug Administration (FDA) approved Olumiant for adult patients with severe AA, making it the first JAK inhibitor approved in these geographies for severe disease.</p><p>This positive opinion marks the next step toward European regulatory approval of Olumiant for adolescents ages 12 to under 18 with severe AA, and it is now referred to the European Commission for final action. The European Commission's decision is expected in the next one to two months. The primary endpoint of this study was a SALT score 20 (i.e., 80% or more scalp hair coverage) at Week 36.</p><!-- Article --><p>The second cohort of 166 adolescents were randomized 1:1 to Olumiant 4 mg or Olumiant 2 mg to further accumulate safety data. The third cohort consists of children ages 6 to under 12 years and will be randomized in a 1:1:1 ratio to receive once-daily placebo, Olumiant high dose or Olumiant low dose. About Olumiant, a once-daily, oralJAK inhibitor, was discovered by Incyte and license to Lilly.</p><p>Baricitinib is approved in the U.S. and moreth an 75 countries as a treatment for adults with moderately to severely active rheumatoid arthritis, in more than 40 countries outside the U.S. for the treatment of patients down to the age of two with moderate-to-severe atopic dermatitis who are candidates for systemic therapy and in the U.S., Europe and Japan for adult patients with severe AA. Marketing authorization for the treatment of hospitalized patients with COVID-19 has been granted for baricitinib in multiple countries. The U.S. FDA-approved labeling for Olumiant includes a Boxed Warning for Serious Infections, Mortality, Malignancy, Major Adverse Cardiovascular Events, and Thrombosis.</p><p>In December 2009, Lilly and Incyte announced an exclusive worldwide license and collaboration agreement for the development and commercialization of Olumiant and certain follow-on compounds for patients with inflammatory and autoimmune diseases. Olumiant®? (O-loo-me-ant) is a Janus kinase (JAK) inhibitor used to treat: adults with severe alopecia areata.</p><p>adults with severe alopecIA areata. adults with moderately to severely active Rheumatoid arthritis after treatment with 1 or more medicines called tumor necrosis factor (TNF) blockers have been used, and did not work well enough or could not be tolerated. Warnings - Olumiant may cause serious side effects, including: Warnings - Olumiant can cause serious side effects, including; and: Warnings - Olumiant may causes serious side effects, including: Warnings - OlUMiant may cause serious side effects.</p></div>",
            "link": "https://hk.marketscreener.com/news/eli-lilly-and-company-s-olumiant-recommends-by-chmp-for-approval-of-expanded-use-in-the-european-uni-ce7e5cdfdc88f521",
            "pub_date": "2026-02-28 01:56:21",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Block Well-Positioned to Absorb Risks From Layoff Bet, Morgan Stanley Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/block-well-positioned-to-absorb-risks-from-layoff-bet-morgan-stanley-says-ce7e5cdfdc88f527",
            "pub_date": "2026-02-28 01:51:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Ford Attorney Says First Brands to Sell Factories Making Parts for Automaker, Bloomberg Reports",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/ford-attorney-says-first-brands-to-sell-factories-making-parts-for-automaker-bloomberg-reports-ce7e5cdfdc88f622",
            "pub_date": "2026-02-28 01:51:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Unitedhealth limits employees' raises to 2% this year - Bloomberg News",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/unitedhealth-limits-employees-raises-to-2-this-year-bloomberg-news-ce7e5cdfdc89ff27",
            "pub_date": "2026-02-28 01:46:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Central bank gold holdings, as per IMF data",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/central-bank-gold-holdings-as-per-imf-data-ce7e5cdfdc89f024",
            "pub_date": "2026-02-28 01:46:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Nymex Overview : Oil Futures Climb on Continued Tensions Between the US and Iran -- OPIS",
            "description": "<div class=\"txt-s4 article-text\"><p>\n  Crude oil contracts were up at midday Friday on renewed concerns over U.S.-Iran tensions and as the front-month Brent, RBOB, and ULSD are set to expire at the end of the day. </p><p>\n\n  The NYMEX April West Texas Intermediate contract was up $1.27 at $66.48/bbl at about 11:45 a.m. ET. The May WTI contract was $1.29 higher at $66.40/bbl. The ICE April Brent crude contract was up $1.64 to $72.39/bbl and May Brent added $1.45 to $72.29/bbl. </p><!-- Article --><p>\n\n  Refined product futures were also higher. The March RBOB contract was up 3.13cts to $2.0636/gal and the April contract was 2.25cts higher at $2.2762/gal. The March ULSD contract was up 6.41cts to $2.6766/gal and April ULSD was 6.01cts higher at $2.5859/gal. </p><p>\n\n  Oil prices rose after U.S. and Iranian negotiators met Thursday over U.S. demands that the country halt its nuclear enrichment program. Oman's foreign minister said the talks made \"significant progress,\" though no deal was reached. Markets are concerned that that prolonged negotiations could test U.S. patience. The Trump administration has deployed a sizable military presence near Iran and the State Department has directed nonessential personnel and their families to leave Israel. </p><p>\n\n  Traders are also waiting to see whether OPEC+'s eight producing countries approve a modest output increase starting in April. Analysts has said capacity constraints in some member countries could limit the impact of any production hike. </p><br/><p>\n  This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal. </p><br/><p>\n  Reporting by Allegra Fradkin, afradkin@opisnet.com; Editing by Jeffrey Barber, jbarber@opisnet.com </p><p>\n\n  (END) Dow Jones Newswires</p><p>\n\n  02-27-26 1242ET</p></div>",
            "link": "https://hk.marketscreener.com/news/nymex-overview-oil-futures-climb-on-continued-tensions-between-the-us-and-iran-opis-ce7e5cdfdc89f121",
            "pub_date": "2026-02-28 01:46:16",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "UK appoints Barclays executive as top Bank of England regulator",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/uk-appoints-barclays-executive-as-top-bank-of-england-regulator-ce7e5cdfdc89f225",
            "pub_date": "2026-02-28 01:46:17",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump's Fed chief nominee faces hurdles as clock ticks on Powell's term",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-s-fed-chief-nominee-faces-hurdles-as-clock-ticks-on-powell-s-term-ce7e5cdfdc89f32d",
            "pub_date": "2026-02-28 01:46:18",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump says more talks expected with Iran on Friday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-says-more-talks-expected-with-iran-on-friday-ce7e5cdfdc89f326",
            "pub_date": "2026-02-28 01:46:19",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump, asked about using military force in Iran: don't want to, but sometimes you have to",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-asked-about-using-military-force-in-iran-don-t-want-to-but-sometimes-you-have-to-ce7e5cdfdc89f42d",
            "pub_date": "2026-02-28 01:46:20",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Visa Inc. (NYSE:V) completed the acquisition of Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P.",
            "description": "<div class=\"txt-s4 article-text\">\n        \n                    Visa Inc. (NYSE:V) entered into a definitive agreement to acquire Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P. on February 19, 2026. Payway S.A.U. is not part of this transaction and will remain owned by funds managed by Advent International, continuing to operate independently as a merchant acquirer.<br/><br/>\r\n \r\nThe transaction is subject to the satisfaction of closing conditions and is expected to close in first quarter of 2026.<br/><br/>\r\n\r\nVanina Caniza, Francisco Fernández Rostello Geraldine Mirelman, Esteban Rópolo, and Matías Herrero of Baker &amp; Mckenzie Sociedad Civil acted as legal advisor for Advent International, L.P.  Todd Crider, Juan Naveira, Borja Marcos, Caroline Geiger and Lori Lesser, Russell Light, Peter Guryan, Daniel Owsley, Tristan Brown, Andrew  Kofskyof, David Caldwell, and Steven DeLott of Simpson Thacher &amp; Bartlett LLP acted as legal advisor for Advent International, L.P. Morgan Stanley acted as exclusive financial advisor for Advent International, L.P. on the sale of both Prisma Medios and Newpay.<br/><br/>\r\n\nVisa Inc. (NYSE:V) completed the acquisition of Prisma Medios de Pago S.A. and Newpay S.A.U. from Advent International, L.P. on February 27, 2026. The transaction is subject to review by the Argentine competition authority.\n    \n    </div>",
            "link": "https://hk.marketscreener.com/news/visa-inc-nyse-v-completed-the-acquisition-of-prisma-medios-de-pago-s-a-and-newpay-s-a-u-from-ad-ce7e5cdfdc89f626",
            "pub_date": "2026-02-28 01:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump say he wants to make a deal with Iran",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-say-he-wants-to-make-a-deal-with-iran-ce7e5cdfdc89f624",
            "pub_date": "2026-02-28 01:40:48",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck to lay off 154 employees",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/merck-to-lay-off-154-employees-ce7e5cdfdd80ff2c",
            "pub_date": "2026-02-28 01:40:49",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Creative director Demna presents first Gucci show as Kering pushes turnaround",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/creative-director-demna-presents-first-gucci-show-as-kering-pushes-turnaround-ce7e5cdfdd80f02d",
            "pub_date": "2026-02-28 01:40:50",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Apollo Global Management Backs Manhattan Office Tower Conversion With $420 Million Loan",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/apollo-global-management-backs-manhattan-office-tower-conversion-with-420-million-loan-ce7e5cdfdd80f02c",
            "pub_date": "2026-02-28 01:40:51",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump: Not happy with Iran but more talks expected Friday",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-not-happy-with-iran-but-more-talks-expected-friday-ce7e5cdfdd80f125",
            "pub_date": "2026-02-28 01:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Trump: Iran cannot have nuclear weapons",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/trump-iran-cannot-have-nuclear-weapons-ce7e5cdfdd80f224",
            "pub_date": "2026-02-28 01:40:52",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Jardine Matheson investee PT Astra reports \"resilient\" earnings",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - Jardine Matheson Holdings Ltd on Friday noted the release of annual results, which included lower revenue and profit, from PT Astra International TBK.</p><p></p><p>Jardine Matheson is a Hong Kong-based holding company with interests in retail, property, hotels and motor dealerships. Its 85.5%-owned subsidiary, Jardine Cycle &amp; Carriage Ltd, holds 50.1% of PT Astra. The Indonesian firm has businesses across various sectors, including coal, gold, mining services and motor vehicles. </p><!-- Article --><p></p><p>PT Astra reported net income of IDR32.769 trillion in 2025, around GBP1.44 billion, down 3% from IDR33.901 trillion in 2024. Net revenue decreased 2% to IDR323.392 trillion from IDR328.480 trillion. </p><p></p><p>The firm also declared a final dividend of IDR292 per share for the year, down from IDR308 per share. </p><p></p><p>Net earnings per share decreased 3% to IDR810 from IDR837. NAV per share, however, rose 8% to IDR5,692 at December 31, from IDR5,278 one year prior. </p><p></p><p>\"In 2025, the group's earnings declined mainly due to lower coal prices and a weak new car market,\" commented PT Astra's President Director Djony Tjondro. \"However, the group's business performance remained resilient, supported by good contribution from its other businesses.</p><p></p><p>\"Looking ahead, while the operating environment of some of our businesses may remain challenging, we expect overall consumer sentiment to improve. Astra will remain focused on operational excellence and disciplined capital allocation, leveraging our strong balance sheet to support sustainable value creation for our stakeholders.\"</p><p></p><p>PT Astra also said it has completed a \"second tranche share buyback programme\", worth IDR685 billion in total, and that its strategic review is in progress. It expects to announce the review's findings in \"the latter part of the first half of 2026.\"</p><p></p><p>PT Astra previously completed an IDR2 trillion share buyback in January. </p><p></p><p>Jardine Matheson shares were flat at USD58.38 in London on Friday.</p><p></p><p>By Emma Curzon, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/jardine-matheson-investee-pt-astra-reports-resilient-earnings-ce7e5cdfdd80f32c",
            "pub_date": "2026-02-28 01:40:53",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Cipla announces launch of generic Saxenda for weight management therapy",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/cipla-announces-launch-of-generic-saxenda-for-weight-management-therapy-ce7e5cdfdd80f52c",
            "pub_date": "2026-02-28 01:40:54",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Merck to lay off around 150 employees at US site amid slump in Gardasil sales",
            "description": "<div class=\"txt-s4 article-text\"><p>Feb 27 (Reuters) - Merck will lay off about 150 employees across its facility in North Carolina that manufactures its human papillomavirus vaccine, Gardasil, according to a notice filed in the state's database this week.</p><p>\n              Shares of Merck were up 3% in afternoon trading.</p><!-- Article --><p>\n              Gardasil has been one of Merck's top growth drivers after blockbuster cancer immunotherapy Keytruda, and much of its international growth has come from China. But the company halted shipments of the vaccine to China last year due to weak demand, driving a 39% slump in the shot's global sales in 2025.</p><p>\n              The vaccine protects against HPV infections that can lead to cervical, vulvar, vaginal and anal cancers.</p><p>\n              The U.S. also overhauled its long-standing childhood immunization schedule last month to recommend a single HPV vaccine dose instead of the approved two- or three-shot regimen. Gardasil is the only HPV vaccine licensed in the country.</p><p>\n              Merck's management last month said Gardasil was no longer a key growth driver for the company.</p><p>\n              \"We continuously assess our operations and evolving business needs and adjust as needed to ensure the effectiveness of our manufacturing network in delivering reliable, compliant supply of our medicines and vaccines,\" a company spokesperson told Reuters on Friday.</p><p>\n              The layoffs will be effective in May, according to the notice.</p><p>\n              As of December 31, 2025, the company had about 30,000 employees in the U.S., including Puerto Rico, according to a regulatory filing.  </p><p></p><p>(Reporting by Mariam Sunny in Bengaluru; Editing by Leroy Leo)</p></div>",
            "link": "https://hk.marketscreener.com/news/merck-to-lay-off-around-150-employees-at-us-site-amid-slump-in-gardasil-sales-ce7e5cdfdd80f523",
            "pub_date": "2026-02-28 01:40:55",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Coinbase Global aware of performance issues on lend, borrow, and dex",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/coinbase-global-aware-of-performance-issues-on-lend-borrow-and-dex-ce7e5cdfdd80f624",
            "pub_date": "2026-02-28 01:31:40",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Atlanta Fed US Q1 GDP Nowcast Estimate 3% Up Vs Previous 3.1% Gain",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/atlanta-fed-us-q1-gdp-nowcast-estimate-3-up-vs-previous-3-1-gain-ce7e5cdfdd81fe21",
            "pub_date": "2026-02-28 01:31:41",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US SEC adopts final rules for holding foreign insiders accountable",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-sec-adopts-final-rules-for-holding-foreign-insiders-accountable-ce7e5cdfdd81ff2c",
            "pub_date": "2026-02-28 01:31:42",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "JPMorgan, Barclays, Fifth Third sued by investors for missing 'giant red flags' at Tricolor",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/jpmorgan-barclays-fifth-third-sued-by-investors-for-missing-giant-red-flags-at-tricolor-ce7e5cdfdd81f026",
            "pub_date": "2026-02-28 01:26:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "US Equity Indexes Drop Following Hot Wholesale Inflation Print",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/us-equity-indexes-drop-following-hot-wholesale-inflation-print-ce7e5cdfdd81f127",
            "pub_date": "2026-02-28 01:26:07",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Slovak PM has \"clear impression\" Ukraine does not want oil transit to resume",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/slovak-pm-has-clear-impression-ukraine-does-not-want-oil-transit-to-resume-ce7e5cdfdd81f221",
            "pub_date": "2026-02-28 01:26:09",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dubai Electricity and Water Authority Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Dubai Electricity and Water Authority (PJSC) reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was AED 32,841.82 million compared to AED 30,977.35 million a year ago. Net income was AED 8,346.89 million compared to AED 7,012.66 million a year ago.</p><p>Basic earnings per share from continuing operations was AED 0.167 compared to AED 0.14 a year ago. Diluted earnings per share from continuing operations was AED 0.167 compared to AED 0.14 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/dubai-electricity-and-water-authority-reports-earnings-results-for-the-full-year-ended-december-31-ce7e5cdfdd81f323",
            "pub_date": "2026-02-28 01:26:11",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "CIMB Reportedly Among Banks Bidding for HSBC Indonesia Assets",
            "description": "<div class=\"txt-s4 article-text\"><p>CIMB Group Holdings Berhad (KLSE:CIMB) is one of the banks that are seeking to purchase assets of HSBC Indonesia (PT Bank HSBC Indonesia). The move comes as lenders seek to strengthen their presence in Southeast Asia's biggest economy. Potential bidders include Singapore's DBS Group Holdings Ltd. (SGX:D05), Oversea-Chinese Banking Corporation Limited (SGX:O39) and United Overseas Bank Limited (SGX:U11), along with Malaysia's CIMB Group Holdings Bhd and Sumitomo Mitsui Financial Group, Inc. (TSE:8316).</p><p>HSBC Holdings plc (LSE:HSBA) is looking to sell its consumer banking operations in Indonesia. The assets could be valued at more than USD 200 million.</p></div>",
            "link": "https://hk.marketscreener.com/news/cimb-reportedly-among-banks-bidding-for-hsbc-indonesia-assets-ce7e5cdfdd81f322",
            "pub_date": "2026-02-28 01:26:13",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Xinyi Glass Holdings Limited Reports Earnings Results for the Full Year Ended December 31, 2025",
            "description": "<div class=\"txt-s4 article-text\"><p>Xinyi Glass Holdings Limited reported earnings results for the full year ended December 31, 2025. For the full year, the company reported sales was CNY 20,829.01 million compared to CNY 22,323.57 million a year ago. Net income was CNY 2,729 million compared to CNY 3,369.17 million a year ago.</p><p>Basic earnings per share from continuing operations was CNY 0.6231 compared to CNY 0.7923 a year ago. Diluted earnings per share from continuing operations was CNY 0.6231 compared to CNY 0.7923 a year ago.</p></div>",
            "link": "https://hk.marketscreener.com/news/xinyi-glass-holdings-limited-reports-earnings-results-for-the-full-year-ended-december-31-2025-ce7e5cdfdd81f422",
            "pub_date": "2026-02-28 01:21:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "FTSE 100 hits high; oil jumps on US-Iran tension",
            "description": "<div class=\"txt-s4 article-text\"><p>(Alliance News) - The FTSE 100 outperformed European and US peers on Friday, ending a record-breaking week at another new high.</p><p></p><p>\"Two months in, it looks like 2026 could be a second bumper year in a row for investors putting their faith in UK stocks if current performance trends continue,\" said Russ Mould, investment director at AJ Bell.</p><!-- Article --><p></p><p>The FTSE 100 index ended up 63.85 points, 0.6%, at 10,910.55, a record close. It had earlier hit a record intra-day high of 10,934.94, and is up 9.6% year-to-date.</p><p></p><p>The FTSE 250 ended up 38.15 points, 0.2%, at 23,757.15, and the AIM All-Share closed up 4.30 points, 0.5%, at 819.53.</p><p></p><p>For the week, the FTSE 100 rose 1.1%, the FTSE 250 was slightly higher, and the AIM All-Share climbed 0.9%.</p><p></p><p>The Cboe UK 100 was up 0.5% at 1,086.35, the Cboe UK 250 was 0.2% higher at 20,980.03, and the Cboe Small Companies Index advanced slightly to 18,507.60.</p><p></p><p>London's gains came despite renewed losses on Wall Street as investors weighed stronger-than-forecast wholesale inflation data, and assessed rising tension between the US and Iran.</p><p></p><p>The Dow Jones Industrial Average was down 1.0%, the S&amp;P 500 index was 0.6% lower, and the Nasdaq Composite declined 0.9%. </p><p></p><p>According to the US Bureau of Labor Statistics the producer price index rose 0.5% in January on-month, the same pace of growth as reported December.</p><p></p><p>The annual rate of growth cooled to 2.9% from 3.0%.</p><p></p><p>FXStreet consensus had forecast headline growth of 0.3% on-month and annual growth of 2.6%.</p><p></p><p>Excluding food and energy, PPI rose 0.8% on-month in January, surprisingly picking up pace from 0.7% in December. The annual rate of growth sped up to 3.8% from 3.3%.</p><p></p><p>FXStreet consensus forecast core PPI would rise 0.3% on-month giving an annual increase of 3.0%.</p><p></p><p>After folding in January CPI and PPI figures, Barclays estimates that core PCE inflation - the Federal Reserve's favoured inflation gauge - rose 0.4% on-month and 3.1% on-year in January.</p><p></p><p>Oil prices jumped as Iran said that in order to reach a deal, the US will have to drop its \"excessive demands\", tempering the optimism expressed after recent talks which had been seen as a last-ditch bid to avert war.</p><p></p><p>The Oman-mediated talks followed repeated threats from President Donald Trump to strike Iran, and with the US conducting its biggest military build-up in the region in decades.</p><p></p><p>Trump on February 19 gave Iran 15 days to reach a deal, and while Iran has insisted the discussions focus solely on its nuclear programme, the US wants Tehran's missile programme, its ballistic missile capabilities, and its support for militant groups curtailed.</p><p></p><p>The Wall Street Journal reported on Thursday that Trump's negotiating team would demand that Iran dismantle its three main nuclear sites and hand over all its remaining enriched uranium to the US.</p><p></p><p>On Friday, the US authorised the departure of non-emergency embassy staff from Israel, while growing fears of conflict spurred China to join other countries in warning its citizens to leave Iran \"as soon as possible\". The UK too withdrew its embassy staff from Iran.</p><p></p><p>Brent oil traded higher at USD72.71 a barrel on Friday afternoon, up from USD72.58 at same time on Thursday, and sharply higher from USD70.00 at the time of the equity close in New York. </p><p></p><p>The oil price strength supported BP, up  0.7%, and Shell, up 1.6%.</p><p></p><p>The geopolitical uncertainty gave a lift to the gold price, supporting Fresnillo, up 3.4%, and Endeavour Mining, up 2.3%. </p><p></p><p>But the US-Iran worries and the rising oil price put airlines under pressure. British Airways owner IAG was down 7.4%,despite strong annual results, and budget airline easyJet was down 2.6%.</p><p></p><p>Gold firmed to USD5,235.52 an ounce on Friday from USD5,180.61 on Thursday. </p><p></p><p>In European equities on Friday, the CAC 40 in Paris closed down 0.5%, while the DAX 40 in Frankfurt ended slightly lower.</p><p></p><p>The pound was lower at USD1.3458 on Friday afternoon, from USD1.3513 at the equities close on Thursday. </p><p></p><p>The euro stood higher at USD1.1818, from USD1.1792. Against the yen, the dollar was trading lower at JPY156.05, compared to JPY156.20.</p><p></p><p>The yield on the US 10-year Treasury narrowed to 3.98% on Friday from 4.03% on Thursday. The yield on the US 30-year Treasury trimmed to 4.64% from 4.68%.</p><p></p><p>London Stock Exchange Group rose 4.2%, and led blue-chip risers, on further reflection of Thursday's results. </p><p></p><p>Bank of America played fears of AI disruption to LSEG's business. </p><p></p><p>\"The market fails to differentiate between software and data providers like LSEG, where it is partnering with AI agents,\" BofA said.</p><p></p><p>Rightmove advanced 4.3% as it announced a total dividend for 2025 that was higher than expected, alongside a share buyback programme as it highlighted it entered 2026 \"with confidence.\"</p><p></p><p>The Milton Keynes, England-based online property portal said pretax profit climbed 12% to GBP290.0 million in 2025 from GBP258.4 million in 2024.</p><p></p><p>\"The shares have been weighed down by broader AI concerns, but we see no evidence of any impact. We expect another solid year of growth, supported by further product development that should strengthen its market position,\" analysts at Peel Hunt said.</p><p></p><p>But Melrose plummeted 12% after its annual earnings. </p><p></p><p>Citi analyst Charles Armitage said the share price fall was an \"over-reaction and mainly due to the increase in factoring from GBP338 million to GBP396 million.\"</p><p></p><p>Melrose bears argued that as a result of the rise in factoring, the aerospace firm \"actually\" produced GBP67 million of free cash flow last year, rather than the GBP125 million reported, and hence missed the GBP100 million plus guidance.</p><p></p><p>But Armitage explained that factoring \"was in the GBP100 million [plus] guidance - this is not a miss.\"</p><p></p><p>On the FTSE 250, Senior leapt 20% after it confirmed receipt of two cash bids, higher than offers the firm had previously turned down this year. </p><p></p><p>Boston, Massachusetts-based private equity investor Advent International subsequently confirmed it was one of the interested parties. </p><p></p><p>But it was another tough day for investors in Hays, which fell 9.6%. </p><p></p><p>The recruiter, which has seen its share price plummet 43% in the last 12 months, reported a decline in first-half earnings and said it has kicked off a search for a new boss, after Dirk Hahn's immediate resignation as chief executive officer. </p><p></p><p>Finally, Wizz Air nosedived 8.7%, after Indigo Partners LLC reported the sale of a GBP125 million chunk of the low-cost carrier.</p><p></p><p>The biggest risers on the FTSE 100 were Diageo, up 76.50p at 1,662.50p, Rightmove, up 18.60p at 447.40p, BT, up 8.90p at 216.80p, London Stock Exchange Group, up 360.00p at 8,860.00p, and Fresnillo, up 136.00p at 4,240.00p.</p><p></p><p>The biggest fallers on the FTSE 100 were Melrose Industries, down 74.20p at 565.80p, IAG, down 33.60p at 423.70p, Hikma Pharmaceuticals, down 59.00p at 1,314.00p, Barclays, down 19.80p at 452.85p, and Intercontinental Hotels Group, down 4.25p at 137.50p. </p><p></p><p>Monday's global economic calendar has a slew of manufacturing PMI reports plus UK mortgage approvals data.</p><p></p><p>Monday's UK corporate calendar has full-year results from lender Bank of Ireland, distribution and services company Bunzl and medical technology firm Smith &amp; Nephew.</p><p></p><p>By Jeremy Cutler, Alliance News reporter</p><p></p><p>Comments and questions to newsroom@alliancenews.com</p><p></p><p>Copyright 2026 Alliance News Ltd. All Rights Reserved.</p></div>",
            "link": "https://hk.marketscreener.com/news/ftse-100-hits-high-oil-jumps-on-us-iran-tension-ce7e5cdfdd81f625",
            "pub_date": "2026-02-28 01:21:14",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        },
        {
            "title": "Dell Technologies Surprises With Strong 2027 Guide Despite Commodity Headwinds, BofA Says",
            "description": "<div class=\"txt-s4 article-text\"></div>",
            "link": "https://hk.marketscreener.com/news/dell-technologies-surprises-with-strong-2027-guide-despite-commodity-headwinds-bofa-says-ce7e5cdfdd81f624",
            "pub_date": "2026-02-28 01:21:15",
            "source": "marketscreener",
            "kind": 1,
            "language": "en"
        }
    ]
}