{
    "data": [
        {
            "id": "urn:summary_document_transcript:quartr.com:2938624:0",
            "title": "ACO.X: 8% earnings growth and record modular housing demand drive robust results and outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Earnings grew 8% year-over-year in 2025, driven by strong performance across all segments, record modular housing demand, and major contract wins. Cash flow and dividend growth remain robust, with continued expansion in modular construction and favorable market tailwinds.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938624:0-aco-x-8-earnings-growth-and-record-modular-housing-demand-drive-robust-results-and-outlook/",
            "pub_date": "2026-02-27 02:07:51",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938626:0",
            "title": "CG: Record results and ambitious 2028 targets driven by diversification and AI-enabled growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The firm delivered record financial results, set ambitious 2028 growth targets, and emphasized its diversified, client-centric model. Key growth drivers include global wealth, credit, AlpInvest, and sector strengths in aerospace/defense, all underpinned by early AI adoption and robust capital allocation. </span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938626:0-cg-record-results-and-ambitious-2028-targets-driven-by-diversification-and-ai-enabled-growth/",
            "pub_date": "2026-02-27 02:07:55",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012941:0",
            "title": "Trade Desk Is Maintained at Outperform by BMO Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:08 GMT) </span></strong><span>Trade Desk Price Target Cut to $55.00/Share From $98.00 by BMO Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012941:0/",
            "pub_date": "2026-02-27 02:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012937_20260226012943:0",
            "title": "International Bancshares 2025 EPS $6.62 >IBOC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012937_20260226012943:0/",
            "pub_date": "2026-02-27 02:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012937:0",
            "title": "IBC Reports Strong Earnings in 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LAREDO, Texas--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>International Bancshares Corporation </span><span>, one of the largest independent bank holding companies in Texas, today reported annual net income for 2025 of approximately $412.3 million or $6.62 diluted earnings per common share ($6.63 per share basic) compared to approximately $409.2 million or $6.57 diluted earnings per common share ($6.58 per share basic), which represents an increase of approximately 0.8 percent in diluted earnings per share and 0.8 percent increase in net income over the corresponding period in 2024. Net income for the three months ended December 31, 2025 was approximately $106.9 million or $1.71 diluted earnings per common share ($1.72 per share basic), compared to approximately $115.1 million or $1.85 diluted earnings per common share ($1.85 per share basic) for the same period in 2024, representing a decrease of approximately 7.1 percent in net income and a 7.6 percent decrease in diluted earnings per share.</span></p><p class=\"\"><span>Net income for 2025 continued to be positively impacted by an increase in interest income earned on our investment and loan portfolios driven primarily by both an increase in the size of our investment and loan portfolios and the current rate environment. Net interest income has been negatively impacted by an increase in interest expense, primarily driven by increases in rates paid on deposits. We continue to closely monitor and adjust rates paid on deposits to remain competitive to grow and retain deposits.</span></p><p class=\"\"><span>\"We are extremely pleased and proud to continue our industry-leading financial results in 2025, which has kept us at the top of the rankings compared to other publicly held bank holding companies in America. As we move into 2026, we will remain focused and vigilant on delivering superior customer service, continued execution of our long-standing practices of balance sheet, asset, liability, and liquidity management, strong cost controls, and evaluating processes for efficiencies across our organization using new AI initiatives. We believe that with continued focus on these established practices we will continue to deliver industry-leading financial results,\" said Dennis E. Nixon, president and CEO.</span></p><p class=\"\"><span>Total assets at Dec. 31, 2025 were approximately $16.6 billion compared to approximately $15.7 billion at Dec. 31, 2024. Total net loans were approximately $9.3 billion at Dec. 31, 2025 compared to approximately $8.7 billion at Dec. 31, 2024. Deposits were approximately $12.4 billion at Dec. 31, 2025 compared to approximately $12.1 billion at Dec. 31, 2024.</span></p><p class=\"\"><span>IBC is a multi-bank financial holding company headquartered in Laredo, Texas, with 165 facilities and 247 ATMs serving 75 communities in Texas and Oklahoma.</span></p><p class=\"\"><span>\"Safe Harbor\" statement under the Private Securities Litigation Reform Act of 1995: The statements contained in this release which are not historical facts contain forward looking information with respect to plans, projections or future performance of IBC and its subsidiaries, the occurrence of which involve certain risks and uncertainties detailed in IBC's filings with the Securities and Exchange Commission.</span></p><p class=\"\"><span>Copies of IBC's SEC filings and Annual Report (as an exhibit to the 10-K) may be downloaded from the SEC filings site located at http://www.sec.gov/edgar.shtml.</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260226195775/en/</span></p><p class=\"\"><span>CONTACT:    Judith I. Wawroski,</span></p><p class=\"\"><span>Treasurer and Chief Financial Officer</span></p><p class=\"\"><span>International Bancshares Corporation</span></p><p class=\"\"><span>(956) 722-7611</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012937:0/",
            "pub_date": "2026-02-27 02:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012938:0",
            "title": "Canada Steadfast in Avoiding Travel to U.S., Buying More Domestic Goods: Central Bank Research",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Paul Vieira</span></p><p class=\"\"><span>OTTAWA--Anger over President Trump's trade policy has fueled a notable increase in Canadian spending on domestic products and local tourism, according to research from the Bank of Canada.</span></p><p class=\"\"><span>The central bank's analysis, published Thursday, also suggests that momentum behind buying Canadian remains solid with no sign of ebbing.</span></p><p class=\"\"><span>\"Should Canadian consumers continue to prefer domestic products over U.S. goods and services, this spending shift could not only affect the composition of Canada's gross domestic product but also have an impact on inflationary pressures,\" the report said. The research was conducted by the central bank's analysts and produced independently from the Bank of Canada's governing council, which decides on rate policy.</span></p><p class=\"\"><span>Trump's protectionist trade policy, along with musings from Trump about using economic force to annex Canada as a 51st state, triggered a Buy Canadian movement in the country. People vowed not to travel to the U.S., and Statistics Canada data bear this out. Grocers continue to prominently mark certain products in aisles as made-in-Canada.</span></p><p class=\"\"><span>Overall, trade-policy uncertainty has cast a pall over the Canadian economy, as companies curb investment plans and hiring until the future of the U.S.-Mexico-Canada trade treaty, or USMCA, is settled. Senior Bank of Canada officials have called the pending U.S.-led review of USMCA later this year as an important risk to the economic outlook.</span></p><p class=\"\"><span>Statistics Canada data earlier this week indicated trips by Canadians to the U.S. fell by 25% in 2025 — or the largest year-over-year decline ever recorded excluding the Covid-19 pandemic period. The Bank of Canada report indicates that Canadians, instead, took 4% more trips domestically between the first and third quarters of last year, and spent 10% more on travel and tourism during that same timeframe.</span></p><p class=\"\"><span>As for the purchasing of goods, the Bank of Canada analysts used detailed, transaction-level data from NielsenIQ. The data indicate that since March, 2025, households have shifted food spending away from U.S. products and toward Canadian ones. \"The shift is modest but clearly visible,\" the report said. The central bank said the shift was more pronounced in categories such as coffee and fruit juice.</span></p><p class=\"\"><span>\"Outside of food, where Canadian substitutes are often harder to find, we see no comparable shift in spending patterns,\" the central bank research said. The report added that retaliatory tariffs imposed by Canada on certain goods might have also prompted a shift away from U.S. products — although Prime Minister Mark Carney dropped most of those duties in late August.</span></p><p class=\"\"><span>Most Canadian exports arriving in the U.S. are free of tariffs, because they comply with the terms under USMCA. The White House also provided an exemption for Canada and Mexico from Trump's new global tariff of 15%, revealed about a week ago after the U.S. Supreme Court ruling invalidating his original levies. It's unclear whether that exemption will remain as part of the U.S. review of USMCA.</span></p><p class=\"\"><span>Write to Paul Vieira at paul.vieira@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012938:0-canada-steadfast-in-avoiding-travel-to-u-s-buying-more-domestic-goods-central-bank-research/",
            "pub_date": "2026-02-27 02:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2GR:0",
            "title": "Portugal's EDP moves to supply data centre boom in Iberia, CEO says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Sergio Goncalves</span></p><p class=\"\"><span>    Portugal's largest utility EDP </span><span> is moving to supply the boom in data centre projects in Iberia, attracted by electricity prices that are set to remain low compared with much of Europe,  CEO Miguel Stilwell de Andrade said on Thursday.</span></p><p class=\"\"><span>He said over 18 gigawatts of data centre projects in development or in the pipeline in Portugal and Spain \"will support the strong electricity demand already in Iberia,\" driven by structural, not temporary, factors.</span></p><p class=\"\"><span>\"EDP is obviously engaging with many of these projects,\" the CEO said at a conference with analysts.    </span></p><p class=\"\"><span>\"Iberia has a distinctive advantage, which we expect to benefit from - structurally affordable power prices,\" he said, adding that this is crucial for these projects.</span></p><p class=\"\"><span>On Wednesday, EDP signed a partnership to supply renewable power to the 1.2-GW data centre that Start Campus — a consortium of Britain's Pioneer Point Partners and U.S. fund Davidson Kempner - is developing in Sines, 150 kilometres (93 miles) south of Lisbon. </span></p><p class=\"\"><span>Electricity demand rose 3.6% in Portugal and 2.8% in Spain in 2025, outperforming most EU markets, where average growth was just 0.4%, Stilwell de Andrade said. </span></p><p class=\"\"><span>EDP is projecting 2% annual growth in Iberian demand through 2030, supported by \"electrification of transport, industry, beyond data centres,\" Stilwell de Andrade said.</span></p><p class=\"\"><span>Due to the large deployment of wind and solar parks in Iberia, the EDP CEO said electricity prices for industrial customers in the region are around 17% below the EU average.</span></p><p class=\"\"><span>Portugal and Spain have \"several structural factors that will help keep electricity prices low\", he said, including the full repayment by 2028 of the electricity systems tariff debt, which has weighed on consumer bills.</span></p><p class=\"\"><span>\"That means there will be significant cost reductions in the tariff structure going forward,\" he said.</span></p><p class=\"\"><span>New regulatory frameworks guarantee pre-tax returns of 6.7% on electricity network investments in Portugal through 2029, and 6.58% in Spain through 2031, \"giving EDP clarity and stability for the next investment cycle,\" Stilwell de Andrade said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2GR:0-portugal-s-edp-moves-to-supply-data-centre-boom-in-iberia-ceo-says/",
            "pub_date": "2026-02-27 02:08:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012949:0",
            "title": "eHealth Cut to Hold From Buy by Craig-Hallum",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012949:0/",
            "pub_date": "2026-02-27 02:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012937_20260226012945:0",
            "title": "International Bancshares 2025 Net $412.3M >IBOC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012937_20260226012945:0/",
            "pub_date": "2026-02-27 02:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2UD:0",
            "title": "Wolverine World Wide Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wolverine World Wide Inc </span><span> reported quarterly adjusted earnings of 45 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 42 cents.  The mean expectation of eight analysts for the quarter was for earnings of 44 cents per share. Wall Street expected results to range from 41 cents to 45 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 4.6% to $517.50 million from a year ago; analysts expected $510.72 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wolverine World Wide Inc's reported EPS for the quarter was 38 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $31.8 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wolverine World Wide Inc shares had fallen by 0.6% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had fallen by about 0.6% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the footwear peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Wolverine World Wide Inc is $23.00, about 21.6% above its last closing price of $18.04</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 06:09 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>0.44</span></p></td><td><p class=\"\"><span>0.45</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.33</span></p></td><td><p class=\"\"><span>0.35</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.23</span></p></td><td><p class=\"\"><span>0.35</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>0.18</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2UD:0-wolverine-world-wide-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 02:09:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2UE:0",
            "title": "Middleby Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Middleby Corp </span><span> reported quarterly adjusted earnings of $2.37​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $2.88.  The mean expectation of nine analysts for the quarter was for earnings of $2.27 per share. Wall Street expected results to range from $2.08  to $2.40 per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 3.1% to $866.43 million from a year ago; analysts expected $985.97 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Middleby Corp's reported EPS for the quarter was 74 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $36.94 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Middleby Corp shares had risen by 6.1% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 9.9% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, eight analysts negatively revised earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 7 \"strong buy\" or \"buy,\" 3 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the industrial machinery &amp; equipment peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Middleby Corp is $175.00, about 9.8% above its last closing price of $157.78</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 06:09 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>2.27</span></p></td><td><p class=\"\"><span>2.42</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>2.07</span></p></td><td><p class=\"\"><span>2.37</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>2.23</span></p></td><td><p class=\"\"><span>2.35</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>1.96</span></p></td><td><p class=\"\"><span>2.08</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2UE:0-middleby-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 02:10:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2UF:0",
            "title": "LSB Industries Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LSB Industries Inc </span><span> reported quarterly adjusted earnings of 29 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 19 cents.  The mean expectation of four analysts for the quarter was for earnings of 20 cents per share. Wall Street expected results to range from 7 cents to 21 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 22.3% to $165.05 million from a year ago; analysts expected $147.36 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LSB Industries Inc's reported EPS for the quarter was 22 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $16.13 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LSB Industries Inc shares had risen by 17.9% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 77.3% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, three analysts negatively revised earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the diversified chemicals peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for LSB Industries Inc is $10.38, about 3.4% above its last closing price of $10.02</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 06:10 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>0.29</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>0.15</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.17</span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.08</span></p></td><td><p class=\"\"><span>0.04</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2UF:0-lsb-industries-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 02:10:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2UG:0",
            "title": "Phathom Pharmaceuticals Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phathom Pharmaceuticals Inc </span><span> reported a quarterly adjusted loss of 29 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $-1.05.  The mean expectation of nine analysts for the quarter was for a loss of 38 cents per share. Wall Street expected results to range from -47 cents to -24 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 94.1% to $57.57 million from a year ago; analysts expected $57.05 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phathom Pharmaceuticals Inc's reported EPS for the quarter was a loss of 29 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $21.15 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phathom Pharmaceuticals Inc shares had fallen by 25.7% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 2.2% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 9 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the pharmaceuticals peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Phathom Pharmaceuticals Inc is $24.00, about 48.7% above its last closing price of $12.32</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 06:10 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.38</span></p></td><td><p class=\"\"><span>-0.29</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.54</span></p></td><td><p class=\"\"><span>-0.41</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-1.04</span></p></td><td><p class=\"\"><span>-1.05</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>-1.15</span></p></td><td><p class=\"\"><span>-1.31</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2UG:0-phathom-pharmaceuticals-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 02:10:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938582:0",
            "title": "DTE: 2025 delivered strong growth, record fiber build, and robust shareholder returns, with positive 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong 2025 results with growth in all segments, record fiber expansion, and robust shareholder returns. 2026 guidance targets further EBITDA and free cash flow growth, with AI and digital transformation driving efficiencies. German and European segments remain focused on network leadership and customer growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938582:0-dte-2025-delivered-strong-growth-record-fiber-build-and-robust-shareholder-returns-with-positive-2026-outlook/",
            "pub_date": "2026-02-27 01:59:24",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM13Q:0",
            "title": "World shares ease on concerns about tech valuations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Nvidia reports strong results, but shares fall</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Wall Street stocks trade lower; European shares ease</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>World shares index eases after hitting record high</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Oil prices rise in volatile trading</span></li></ul></span></div><span><p class=\"\"><span>By Chibuike Oguh</span></p><p class=\"\"><span>    An index of global equity markets eased after hitting a fresh record high on Thursday as concerns about lofty valuations of leading technology companies weighed on markets after artificial intelligence chipmaker Nvidia </span><span> reported strong quarterly results.</span></p><p class=\"\"><span>Shares on Wall Street and in Europe traded down as investors digested another blowout quarter from Nvidia, the world's most valuable company, but worried about its market value even as it forecast that first-quarter revenue would be a whopping $78 billion. </span></p><p class=\"\"><span>On Wall Street, technology and communication services were the biggest losers, with Nvidia's shares down 4.4%. The Dow Jones Industrial Average </span><span> fell 0.41%, the S&amp;P 500 </span><span> lost 1%, and the Nasdaq Composite </span><span> fell 1.7%.</span></p><p class=\"\"><span>LOFTY VALUATIONS RAISE CONCERNS</span></p><p class=\"\"><span>\"People are getting concerned about lofty valuations even though when you look at a company like Nvidia, the estimates, cash flow, and everything else are dramatically higher,\" said Thomas Plumb, chief executive and portfolio manager at Plumb Funds in Madison, Wisconsin.</span></p><p class=\"\"><span>\"But I think the sentiment will eventually match up with the realities,\" said Plumb, who has Nvidia as his largest investment holding. </span></p><p class=\"\"><span>In Europe, the broad STOXX 600 </span><span> index edged lower by 0.05% after touching a new record high. MSCI's All Country World Index </span><span>EURONEXT:IACWI</span><span> was down 0.62% after rising to a record high of 1,063.86.</span></p><p class=\"\"><span>\"It's an increasingly cloudy future for AI,\" said James St. Aubin, chief investment officer at Ocean Park Asset Management in Santa Monica, California. \"It's not that AI isn't going to work out. It's about who's going to be the winners? How do these firms keep competitive advantages? There's a lot of upstream and downstream impact that the market is really having trouble sorting out.\"</span></p><p class=\"\"><span>Several heavyweight technology companies traded lower on Wall Street. Alphabet </span><span> was down 2.5%, Apple </span><span> fell 1%, Amazon </span><span> lost 2%, Oracle </span><span> shed 0.3% and Tesla </span><span> traded lower by 3%.</span></p><p class=\"\"><span>\"I always go back to the curse of high expectations, where with Nvidia, everything has to be perfect in order for it continue to thrive and to appreciate. And I think right now they maybe didn't reassure investors enough that the line of sight was clear,\" St. Aubin said.</span></p><p class=\"\"><span>Salesforce </span><span>, which reported quarterly revenue higher than analyst estimates after markets closed on Wednesday, was up 2.2%.</span></p><p class=\"\"><span>London Stock Exchange Group's shares </span><span> jumped 9% in London after it announced a $4.1 billion buyback under pressure from activist investor Elliott Management, which recently built a stake in the data provider.</span></p><p class=\"\"><span>NUCLEAR TALKS</span></p><p class=\"\"><span>Investors are eyeing indirect talks between the United States and Iran over their long-running nuclear dispute. Oil prices rose in a volatile session as markets awaited the outcome of the talks.</span></p><p class=\"\"><span>Brent crude futures </span><span> were up 2%, at $72.27 a barrel. U.S. crude futures </span><span> rose 1.7% to $66.53.</span></p><p class=\"\"><span>Treasury bond prices in the U.S. and Europe edged higher on the back of safe-haven bids as investors grew nervous about tensions involving Iran.</span></p><p class=\"\"><span>The yield on benchmark U.S. 10-year notes </span><span> fell 2.3 basis points to 4.025%. The 2-year note (US2YT=RR) yield fell 1.8 basis points to 3.453%.</span></p><p class=\"\"><span>     In Europe, the yield on the benchmark German 10-year Bunds (DE10YT=RR) lost 0.4 basis point to 2.694%.</span></p><p class=\"\"><span>     Safe-haven gold rose, with spot gold </span><span> adding 0.17% to $5,179.23 an ounce.</span></p><p class=\"\"><span>     In currency markets, the dollar rose against major currencies, including the euro and Swiss franc.</span></p><p class=\"\"><span>     The euro </span><span> was down 0.25% at $1.178 against the dollar.  The dollar was up 0.27% to 0.774 against the Swiss franc </span><span>.</span></p><p class=\"\"><span>The Japanese yen </span><span> was flat at 156.375 against the greenback days after the government of Prime Minister Sanae Takaichi nominated two pro-stimulus academics to the board of the Bank of Japan.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM13Q:0-world-shares-ease-on-concerns-about-tech-valuations/",
            "pub_date": "2026-02-27 01:59:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5838Ua:0",
            "title": "REG - FTSE Russell Westminster Group - Westminster Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5838U  FTSE Russell  26 February 2026    </span><p class=\"\"><span>Suspended Company Notice - Deletion</span></p><p class=\"\"><span>26 February 2026</span></p><p class=\"\"></p><p class=\"\"><span>Further to the notice released on 29 January 2026 the following company has been suspended 40 business days without indication of resumption. In accordance with the Suspension of Dealing rule, it will be removed from the FTSE Russell indexes for the open of 3 March 2026 at nominal value (0.0001).</span></p><p class=\"\"><span>·      Westminster Group (B1XLC22, FTSE AIM All-Share Index)</span></p><p class=\"\"></p><p class=\"\"><span>For further information please contact FTSE Russell Client Services at info@ftserussell.com or call:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Australia</span></p></td><td><p class=\"\"><span>+61 (0) 2 7228 5659</span></p></td></tr><tr><td><p class=\"\"><span>Hong Kong</span></p></td><td><p class=\"\"><span>+852 2164 3333</span></p></td></tr><tr><td><p class=\"\"><span>Japan</span></p></td><td><p class=\"\"><span>+81 3 6441 1430</span></p></td></tr><tr><td><p class=\"\"><span>London</span></p></td><td><p class=\"\"><span>+44 (0) 20 7866 1810</span></p></td></tr><tr><td><p class=\"\"><span>New York</span></p></td><td><p class=\"\"><span>+1877 503 6437</span></p></td></tr></tbody></table></div><p class=\"\"><span>Alternatively, please visit our website at lseg.com/ftse-russell</span></p><p class=\"\"><span> Terms of Use | Copyright © 2026 FTSE Russell</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  FTSEALAKAAPKEFA</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5838Ua:0-reg-ftse-russell-westminster-group-westminster-group/",
            "pub_date": "2026-02-27 02:00:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5688Ua:0",
            "title": "REG - FTSE Russell Walker Crips Group - Walker Crips Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5688U  FTSE Russell  26 February 2026   </span><p class=\"\"><span>Walker Crips Group (UK): Constituent Deletion</span></p><p class=\"\"><span>Changes in FTSE UK Index Series</span></p><p class=\"\"><span>26 February 2026</span></p><p class=\"\"></p><p class=\"\"><span>Subject to court sanctioning the scheme of arrangement related to the cash acquisition of Walker Crips Group (UK, constituent), please see details of affected indexes and effective dates below:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><td><p class=\"\"><span>Index</span></p></td><td><p class=\"\"><span>Effective From</span></p><p class=\"\"><span>Start of Trading</span></p></td></tr></thead><tbody><tr><td><p class=\"\"><span>FTSE Fledgling Index</span></p></td><td><p class=\"\"><span>03 March 2026</span></p></td></tr><tr><td><p class=\"\"><span>FTSE All-Small Index</span></p></td><td><p class=\"\"><span>03 March 2026</span></p></td></tr></tbody></table></div><p class=\"\"></p><p class=\"\"><span>For further information please contact FTSE Russell Client Services at info@ftserussell.com or call:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Australia</span></p></td><td><p class=\"\"><span>+61 (0) 2 7228 5659</span></p></td></tr><tr><td><p class=\"\"><span>Hong Kong</span></p></td><td><p class=\"\"><span>+852 2164 3333</span></p></td></tr><tr><td><p class=\"\"><span>Japan</span></p></td><td><p class=\"\"><span>+81 3 6441 1430</span></p></td></tr><tr><td><p class=\"\"><span>London</span></p></td><td><p class=\"\"><span>+44 (0) 20 7866 1810</span></p></td></tr><tr><td><p class=\"\"><span>New York</span></p></td><td><p class=\"\"><span>+1877 503 6437</span></p></td></tr></tbody></table></div><p class=\"\"><span>Alternatively, please visit our website at lseg.com/ftse-russell</span></p><p class=\"\"><span> Terms of Use | Copyright © 2026 FTSE Russell</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  FTSTFMBTMTATBMF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5688Ua:0-reg-ftse-russell-walker-crips-group-walker-crips-group/",
            "pub_date": "2026-02-27 02:00:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012894:0",
            "title": "MP Materials Earnings Could Mark a Turning Point for the Rare Earth Producer — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Al Root</span></p><p class=\"\"><span>The rare earth industry is never dull. After endless reports of government deals, shortages, and capacity additions, investors can get back to some fundamento l data on Thursday afternoon.</span></p><p class=\"\"><span>MP Materials, the largest rare earth producer in the Western Hemisphere, will report fourth-quarter numbers after the close Thursday.</span></p><p class=\"\"><span>Wall Street is looking for earnings before interest, taxes, depreciation, and amortization, or Ebitda, of about $34 million from sales of $68 million. A year ago, MP reported an Ebitda loss of $10.7 million from sales of $61 million.</span></p><p class=\"\"><span>Ebitda is expected to improve significantly with limited sales growth because MP is shifting from selling intermediate product to higher-value rare earth materials. In the fourth quarter of 2024, it sold 7,802 metric tons of rare earth oxide and 468 metric tons of Neodymium-Praseodymium, or NdPr, alloy. In the third quarter of 2025, it sold no rare earth oxide and 525 metric tons of NdPr.</span></p><p class=\"\"><span>NdPr realized pricing in the third quarter was $59 per kilogram, up from $51 in the fourth quarter of 2024.</span></p><p class=\"\"><span>NdPr prices are now above $110 per kilogram, according to Canaccord analyst George Gianarikas. That price is key. It's the floor price referenced in the Defense Department's blockbuster July agreement with MP that included a price floor, equity, and offtake agreements.</span></p><p class=\"\"><span>The price rally \"indicates that China's long-standing, administratively managed pricing regime despite strong demand from electrification and robotics, may be starting to ease.\"</span></p><p class=\"\"><span>Along with production and pricing, investors will be looking for industry updates from the company, which has emerged as a key domestic supplier of critical minerals. Since the July MP deal, the federal government has continued to invest in critical minerals and sign deals with other countries for mineral access. There have also been threats of Chinese exports restrictions, rare earth shortages, and companies announcing plans to enter the newly hot space.</span></p><p class=\"\"><span>MP has made news too. Early on Thursday, it announced that Northlake, Texas, would be the location for its next magnet-making facility. The site is less than 10 miles from MP's existing magnet facility in Fort Worth.</span></p><p class=\"\"><span>The Fort Worth facility, called Independence, began metal production in 2024 and magnet production in 2025. The Northlake facility will cost about $1.25 billion and is on track for commissioning in 2028. When completed, MP should produce about 10,000 metric tons of rare-earth magnets annually.</span></p><p class=\"\"><span>A lot is going on, and that volatility has shown up in the stock. MP shares have ranged from $18.64 to $100.25 over the past 12 months. At just under $60 a share in midday trading, MP stock was up about 150% over the past 12 months.</span></p><p class=\"\"><span>MP stock was up 2.2% in midday trading at $59.98 while the S&amp;P 500 was down 0.6% and the Dow Jones Industrial Average was up 0.2%.</span></p><p class=\"\"><span>Write to Al Root at allen.root@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012894:0/",
            "pub_date": "2026-02-27 02:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:232b4826fe015:0",
            "title": "Flat publishes the annual report for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Annual Report for 2025 has been published today on February 26, 2026, and is now available on our websitewww.flatcapital.comand as an attached document.</span></p><p class=\"\"><span>You can also read all financial reports on the following link:https://www.flatcapital.com/en/investor-relations/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, please contact:</span></strong></p><p class=\"\"><span>Antono Melani, CFO,</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:hw@flatcapital.com\" rel=\"nofollow\" target=\"_blank\">am@flatcapital.com</a><span>, +46 (0) 722 21 81 32</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Certified Adviser:</span></strong></p><p class=\"\"><span>Augment Partners AB,</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:info@augment.se\" rel=\"nofollow\" target=\"_blank\">info@augment.se</a><span>, +46 (0) 8 604 22 55</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Flat Capital:</span></strong></p><p class=\"\"><span>Flat Capital is a long-term investment company that invests in prominent entrepreneurs and companies through a global network. The company has a long-term and significant ownership stake in Klarna, is the majority owner of Defensor Group, and also invests in several leading global tech companies such as OpenAI, SpaceX, and Cerebras Systems. Flat Capital was founded in 2013 by Nina and Sebastian Siemiatkowski, the entrepreneurs behind Klarna and Milkywire. Sebastian is Flat's chairman and largest shareholder. More information is available atwww.flatcapital.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/9e12b3ae-d144-409a-a529-8d9ebe6f938c/flat-capital-annual-report-2025.pdf\" rel=\"nofollow\" target=\"_blank\">Flat Capital Annual Report 2025</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:232b4826fe015:0-flat-publishes-the-annual-report-for-2025/",
            "pub_date": "2026-02-27 02:00:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012898:0",
            "title": "Altria Declares Regular Quarterly Dividend of $1.06 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>RICHMOND, Va.--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>Altria Group, Inc. </span><span> today announced that our Board of Directors declared a regular quarterly dividend of $1.06 per share, payable on April 30, 2026 to shareholders of record as of March 25, 2026. The ex-dividend date is March 25, 2026.</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260225648687/en/</span></p><p class=\"\"><span>CONTACT:    Altria Client Services</span></p><p class=\"\"><span>Investor Relations</span></p><p class=\"\"><span>804-484-8222</span></p><p class=\"\"><span>Altria Client Services</span></p><p class=\"\"><span>Media Relations</span></p><p class=\"\"><span>804-484-8897</span></p><p class=\"\"><span>www.altria.com/contact-us/media</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012898:0/",
            "pub_date": "2026-02-27 02:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSLdGT3a:0",
            "title": "Living Security Signals Human Risk Management Inflection Point as AI-Driven Threats Redefine Enterprise Cybersecurity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Launches HRM Purchasing Toolkit to Accelerate Adoption of Measurable Human Risk Governance</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AUSTIN, TX / ACCESS Newswire / February 26, 2026 /</span></strong><span> Living Security, the global leader in Human Risk Management (HRM), today announced the launch of its comprehensive HRM Purchasing Toolkit, as accelerating AI-driven threats push human risk governance to the forefront of enterprise cybersecurity strategy.</span></p><p class=\"\"><span>As AI-generated phishing, deepfake impersonation, and automated social engineering campaigns surge, organizations are confronting a compressed threat lifecycle, where compromise, credential abuse, and lateral movement can unfold in hours instead of weeks. Research from the Cyentia Institute's 2025 </span><em><span>State of Human Cyber Risk Report</span></em><span> reveals that organizations relying solely on traditional security awareness training (SAT) maintain visibility into just 12% of human risk activity.</span></p><p class=\"\"><span>Security leaders increasingly recognize that periodic, compliance-driven training programs cannot keep pace with AI-augmented attackers. Managing human risk is no longer a training initiative, it is a governance mandate.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A Structural Visibility Gap, and a Market Shift</span></strong></p><p class=\"\"><span>The Cyentia research further finds that 10% of users account for 73% of all risky behavior within their organizations, reinforcing the need for continuous behavioral visibility and targeted intervention rather than broad, one-size-fits-all campaigns.</span></p><p class=\"\"><span>Mature Human Risk Management programs deliver significantly greater behavioral visibility and risk prioritization, enabling organizations to identify and reduce exposure among high-risk cohorts before incidents occur.</span></p><p class=\"\"><span>\"These findings validate what enterprise security teams are seeing in real time,\" said Ashley Rose, CEO and Co-Founder of Living Security. \"AI has industrialized social engineering. Without continuous human risk intelligence, organizations are operating reactively. HRM brings measurable governance to the human layer of cybersecurity.\"</span></p><p class=\"\"><span>Industry analysts have formally recognized Human Risk Management as a distinct cybersecurity category. In </span><span>The Forrester Wave™: Human Risk Management Solutions, Q3 2024, Living Security was named a Leader, reflecting growing enterprise demand for telemetry-driven behavioral modeling and automated intervention.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI Acceleration Expands the Workforce Risk Surface</span></strong></p><p class=\"\"><span>As generative AI becomes embedded in daily workflows, the workforce increasingly includes both human employees and AI agents operating with delegated access. This expands the risk surface beyond phishing clicks to identity misuse, data exposure, and automated systems acting on behalf of users.</span></p><p class=\"\"><span>Recent 2026 cybersecurity forecasts, including industry predictions from security advisor Matthew Rosenquist, emphasize that organizations must evolve beyond awareness metrics to manage AI-assisted and autonomous risk. Workforce risk measurement and governance are expected to become core components of enterprise security strategy in the coming year.</span></p><p class=\"\"><span>Living Security's AI-native HRM platform correlates behavioral, identity, and threat signals to dynamically score risk and trigger automated, context-aware interventions. In enterprise deployments, organizations have demonstrated measurable reductions in high-risk user concentration and exposure duration within the first 90 days.</span></p><p class=\"\"><span>Adoption momentum is accelerating across highly regulated and innovation-driven sectors, where measurable workforce risk governance is becoming a board-level priority. The shift reflects a broader evolution in enterprise security strategy: moving from measuring participation to measuring exposure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Introducing the HRM Purchasing Toolkit</span></strong></p><p class=\"\"><span>To help organizations operationalize this shift, Living Security developed the Human Risk Management Purchasing Toolkit, a structured framework for CISOs, GRC leaders, and security teams evaluating HRM strategies.</span></p><p class=\"\"><span>The toolkit includes:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic HRM Framework</span></strong><span>, including maturity model and readiness assessment</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Executive Business Case Pack</span></strong><span> with CFO-aligned ROI modeling guidance</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>RFP &amp; Vendor Evaluation Kit</span></strong><span> for structured HRM platform comparison</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>90-Day Deployment Playbook</span></strong><span> for phased rollout and measurable risk reduction</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>GDPR &amp; Works Council Consultation Template (EU)</span></strong><span> for privacy-aligned deployment</span></p></li></ul><p class=\"\"><span>\"As boards and regulators demand demonstrable workforce risk reduction, HRM is becoming foundational cybersecurity infrastructure,\" Rose added.</span></p><p class=\"\"><span>The HRM Purchasing Toolkit is available at:</span></p><p class=\"\"><span>https://www.livingsecurity.com/hrm-purchasing-toolkit</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Living Security</span></strong></p><p class=\"\"><span>Living Security is the global leader in Human Risk Management, helping organizations measure and reduce workforce cyber risk through continuous behavioral intelligence and governance-driven security strategy. Named a Leader in </span><span>The Forrester Wave™: Human Risk Management Solutions, Q3 2024, Living Security enables enterprises to move from awareness-based metrics to measurable risk reduction in an AI-accelerated threat landscape.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact:</span></strong></p><p class=\"\"><span>media@livingsecurity.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Living Security</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSLdGT3a:0/",
            "pub_date": "2026-02-27 02:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:b2ae092c4094b:0",
            "title": "Dogecoin Price Gets New Bull Case As RWA Tokenization Plan Emerges",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Dogecoin has a new utility pitch, and this one is aimed squarely at one of crypto’s most discussed institutional themes.</span></p><p class=\"\"><span>In a X post on February 26, Dogecoin Foundation director Timothy Stebbing said he has spent the last 12 months working toward a plan to make Dogecoin “an asset-backed currency” within two to three years by pushing real-world asset tokenization through a Dogecoin-denominated rules engine called Fractal Engine, with a longer-term goal of eventually moving that activity onto Dogecoin’s base layer through protocol upgrades.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dogecoin Price May Get Major Utility Boost</span></strong></p><p class=\"\"><span>Stebbing’s argument is not that Dogecoin should merely host tokenized assets somewhere in its orbit. It is that DOGE itself should become the trading currency for them. “Make Dogecoin an asset-backed currency in the next 2-3 years by shifting the market for Real World Asset tokenisation to Fractal Engine,” he wrote. “Then once proven, work to migrate RWA tokenization from the sidechain to L1 via protocol upgrades. This would see Dogecoin become the premiere platform for asset tokenisation, denominated in Dogecoin.”</span></p><p class=\"\"><span>Stebbing is effectively sketching a path where demand for DOGE would come not only from speculation or meme-cycle reflexivity, but from its use as the medium of exchange for tokenized assets. He framed the opportunity in deliberately broad terms, arguing that tokenization should cover “real assets, Hotels, Businesses, Minerals, Oil &amp; Gas etc.” and adding, “if you want to trade, you do it with Dogecoin.” The proposed rollout is phased: start on a sidechain, prove the model there, then seek eventual migration to L1.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Timothy Stebbing</div><div class=\"username-n2KCMK3i\">@tjstebbing</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>The plan I’ve been working toward for the last 12 months: Make Dogecoin an asset-backed currency in the next 2-3 years by shifting the market for Real World Asset tokenisation to Fractal Engine, AKA: the bespoke dogecoin-denominated RWA rules engine.</span></p><p class=\"\"><span>Then once proven, work to…</span></p></div><span class=\"date-n2KCMK3i\">Feb 26, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/tjstebbing/status/2026860071553208532\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>The broader backdrop for Stebbing’s pitch is that tokenization is no longer being framed as a crypto niche. In his 2025 chairman’s letter, BlackRock CEO Larry Fink argued that “every stock, every bond, every fund—every asset—can be tokenized,” presenting tokenization as a potential redesign of market plumbing rather than a speculative side narrative.</span></p><p class=\"\"><span>Fink said that if markets move in that direction, transactions that now take days could clear in seconds, while capital currently locked up by settlement frictions could be recycled back into the economy more quickly. He also wrote that tokenized funds could one day become as familiar to investors as ETFs, provided digital identity infrastructure catches up.</span></p><p class=\"\"><span>BlackRock has echoed that view at the firm level. In its 2026 investment-products outlook, it said tokenization is helping “bridge the gap” between traditional finance and DeFi, and that it expects the trend to continue making investing faster, cheaper and more accessible while more assets move on-chain at scale.</span></p><p class=\"\"><span>That makes Stebbing’s proposal easier to understand in market terms: the bull case is not simply that Dogecoin gains another narrative, but that it tries to attach itself to a theme one of the world’s largest asset managers already treats as a serious part of finance’s next phase.</span></p><p class=\"\"><span>At press time, DOGE traded at $0.09937.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:588.28125px;max-width:1200px;aspect-ratio:2.039840637450199\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:b2ae092c4094b-b7340d5e0e9de9e51c426f9cbf7f51f6-resized.webp\" type=\"image/webp\"/><img alt=\"Dogecoin price chart\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:b2ae092c4094b-b7340d5e0e9de9e51c426f9cbf7f51f6-resized.webp\" style=\"background-color:#f2f3f5\"/></picture></div></button></figure></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:b2ae092c4094b:0-dogecoin-price-gets-new-bull-case-as-rwa-tokenization-plan-emerges/",
            "pub_date": "2026-02-27 02:00:05",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1JG:0",
            "title": "Coinbase Global Aware That Some Users May Be Experiencing Delayed Sends, Receives For Sui",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Coinbase Global Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COINBASE GLOBAL: AWARE THAT SOME USERS MAY BE EXPERIENCING DELAYED SENDS, RECEIVES FOR SUI; BUYS, SELLS,FIAT WITHDRAWALS/DEPOSITS REMAIN UNAFFECTED</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1JG:0-coinbase-global-aware-that-some-users-may-be-experiencing-delayed-sends-receives-for-sui/",
            "pub_date": "2026-02-27 02:00:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_AQN2LNWR3:0",
            "title": "U.S. commercial paper market grows in week-Fed",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NEW YORK, Feb 26 (Reuters) - The amount of U.S. commercial paper grew in the week ended Feb 25 Federal Reserve data showed on Thursday.    U.S. seasonally adjusted commercial paper outstanding rose $2.5 billion to $1.407 trillion in the latest week.    Non-seasonally adjusted commercial paper outstanding - which some analysts consider a more reliable reading than the seasonally adjusted one since it has been distorted by the financial crisis - rose $25.3 billion to $1.437 trillion.    U.S. non-seasonally adjusted foreign financial commercial paper outstanding rose $1.3 billion to $396.1 billion.</span></p><p class=\"\"><span>((New York Treasury Desk +1-646-223-6300))</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_AQN2LNWR3:0-u-s-commercial-paper-market-grows-in-week-fed/",
            "pub_date": "2026-02-27 02:00:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSvjcLha:0",
            "title": "Feed the Children teams up with FOX's Next Level Chef to Put Child Hunger to Bed(TM) Nonprofit Invites Nation to Participate in #PJsInPublic Social Media Challenge to Raise Critical Funds and Awareness",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>OKLAHOMA CITY, OK / ACCESS Newswire / February 26, 2026 / Feed the Children is teaming up with the culinary competition series </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> and FOX to fight childhood hunger through Put Child Hunger to Bed</span><strong class=\"root-Tkn6WL2y\"><span>™</span></strong><span> Feed the Children's year-round campaign to rally the public alongside donors, volunteers, and partners to provide kids with the food and resources they need to rise and thrive every day.</span></p><p class=\"\"><span>Hunger continues to be a critical issue throughout many communities across the U.S. and around the world. Food insecurity affects millions of Americans, with one in five children uncertain about where they will get their next meal. Feed the Children, a global movement committed to ending childhood hunger, is responding with </span><strong class=\"root-Tkn6WL2y\"><span>Put ChildHunger to Bed</span></strong><span> - an initiative rooted in the organization's vision to create a world where no child goes to bed hungry, so children everywhere can reach their potential.</span></p><p class=\"\"><span>Feed the Children's Put Child Hunger to Bed campaign encourages the public to raise awareness by wearing pajamas in unusual places, posting a photo or video on Instagram with </span><strong class=\"root-Tkn6WL2y\"><span>#PutChildHungerToBed</span></strong><span> and tagging @FeedtheChildrenorg. Participants can nominate others to join the PJ social media challenge within 24 hours or donate instead.</span></p><p class=\"\"><span>The campaign message will be presented by </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> mentors Gordon Ramsay, Nyesha Arrington, and Richard Blais in a public service announcement that will air on FOX during the new season, and it will also be promoted on social media platforms. </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> fans are also encouraged to share their favorite bedtime snacks and recipes as part of the campaign by using the hashtag #PutChildHungerToBed and tagging @FoodClubFOX and @FeedTheChildren to keep the momentum going. View PSA Here</span></p><p class=\"\"><span>FOX also made a significant contribution in support of Feed the Children's Put Child Hunger to Bed initiative.</span></p><p class=\"\"><span>\"At FOX, we believe entertainment can be a powerful force for good,\" said Emily King, executive vice president, marketing strategy, digital and media, FOX Entertainment. \"By partnering </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> with Feed the Children, we're helping shine a light on the urgent issue of childhood hunger through Gordon Ramsay's massive global reach and passionate fanbase. With Gordon, Nyesha Arrington, and Richard Blais lending their voices, we're proud to support a campaign that turns awareness into meaningful action.\"</span></p><p class=\"\"><span>\"When we feed children, we do more than fill empty stomachs-we nurture their strength, spark their imagination, and unlock their potential,\" said Emily Callahan, president and CEO of Feed the Children. \"Feed the Children is thankful for the support from </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> and FOX; together we can build a future where no child goes to bed hungry.\"</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> Season Five features 24 chefs from across the U.S., divided into professional, social media, and home categories. Mentors Gordon Ramsay, Nyesha Arrington, and Richard Blais oversee competitions where chefs showcase creativity, consistency, and strategy to advance. The show airs Thursdays at 8 p.m. ET/PT on FOX and is available next day on Hulu.</span></p><p class=\"\"><span>Join Feed the Children to end child hunger and help kids dream of more than just their next meal. Together we can fill plates and feed dreams. Let's Put Child Hunger to Bed and make the future brighter for children everywhere. Learn how you can support the Put Child Hunger to Bed campaign.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Social Media</span></strong></p><p class=\"\"><span>@Feedthechildrenorg, @FOXTV, @FoodClubFOX and @NextLevelChef</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Feed the Children</span></strong></p><p class=\"\"><span>Feed the Children is a global movement committed to ending childhood hunger. The organization believes that no child should go to bed hungry, and so it provides children and families in the U.S. and around the world with the food and essentials kids need to grow and thrive. Through its programs and partnerships, the organization feeds children today while helping their families and communities build resilient futures. In addition to food, Feed the Children distributes household and personal care items across the United States to help parents and caregivers maintain stable, food-secure households. Internationally, it expands access to nutritious meals, safe water, improved hygiene, and training in sustainable living. As responsible stewards of its resources, Feed the Children is driven to pursue innovative, holistic, and child-focused solutions to the complex challenges of hunger, food insecurity, and poverty. For children everywhere, the organization believes that having enough to eat is a fundamental right. Learn how you can help create a world without childhood hunger at feedthechildren.org.</span></p><p class=\"\"><span>Feed the Children | Create a world where no child goes to bed hungry</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> is a high stakes cooking competition that reimagines the genre with a dramatic, three-story culinary gauntlet where each level features vastly different kitchens and ingredients, testing chefs at every extreme. Designed by Gordon Ramsay, the series brings together an eclectic mix of talent from professional line cooks and home chefs to food truck owners and social media stars all competing on a level playing field to become the food world's next superstar. Ramsay is joined by acclaimed chefs Nyesha Arrington and Richard Blais, who serve as mentors, each guiding a team and pushing them to reach their full potential. The </span><em><strong class=\"root-Tkn6WL2y\"><span>Next Level Chef</span></strong></em><span> competition rewards creativity, resilience, and adaptability, with only one chef earning the title of \"Next Level Chef,\" a $250,000 grand prize, and a year-long mentorship from the three culinary leaders.</span></p><p class=\"\"><span>###</span></p><p class=\"\"><span>For more information, please contact:</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Feed the Children</span></strong></p><p class=\"\"><span>Richard Presser richard.presser@feedthechildren.org</span></p><p class=\"\"><span>Angela De Paul (PR Agency) angela@ltcstrategiesgroup.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FOX</span></strong></p><p class=\"\"><span>Aly Sands - aly.sands@fox.com</span></p><p class=\"\"><span>Jacob Pickar Jacob.pickar@fox.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Feed the Children</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSvjcLha:0/",
            "pub_date": "2026-02-27 02:00:42",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:2857db76a094b:0",
            "title": "What Triggered The Massive Crash In GMGI Stock Today?",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Post split, the company’s outstanding shares will be reduced to roughly 12.6 million from around 151.7 million.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The stock will begin trading on a post-split basis on March 3, 2026, under the ‘MRDN’ ticker.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The company had previously guided FY2025 revenue between $186 million and $187 million.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Golden Matrix Group (GMGI) tumbled more than 10% on Thursday, after the company’s board approved a 1-for-12 reverse stock split and a corporate name change to Meridian Holdings Inc.</span></p><p class=\"\"><span>The move is aimed at boosting the company’s share price to meet Nasdaq’s minimum bid requirement of $1, with the reverse share split and name change expected to take effect on March 3, 2026.</span></p><p class=\"\"><span>The stock will begin trading on a post-split basis on the same day on the Nasdaq Capital Market under the new ticker symbol “MRDN.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Outstanding Shares To Be Reduced To 12.6 Million</span></strong></strong></p><p class=\"\"><span>Following the split, each 12 existing shares will convert into one new share, reducing the company’s outstanding shares to roughly 12.6 million from around 151.7 million and authorized shares to 25 million from 300 million.</span></p><p class=\"\"><span>The company received a notice from Nasdaq on Dec. 31, 2025, for failing to meet the $1 minimum bid price rule after its shares traded below that level for 30 consecutive business days. The company was given until June 30, 2026, to regain compliance by maintaining a $1 closing price for 10 consecutive sessions.</span></p><p class=\"\"><span>Golden Matrix Group, which is expected to report its full-year 2025 results on March 2, previously guided for annual revenue of $186 million to $187 million, representing 23% to 24% growth over 2024. It also expects fourth-quarter revenue of $52.7 million to $53.7 million, marking a 15% to 17% increase year over year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></strong></p><p class=\"\"><span>Retail sentiment for </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/GMGI\" rel=\"nofollow\" target=\"_blank\">GMGI</a><span> on Stocktwits flipped to ‘bullish’ from ‘bearish’ a day earlier.</span></p><p class=\"\"><span>One user said that the reverse share split addresses a lot of issues that have been making this a “shorters dream.”</span></p><p class=\"\"><span>https://stocktwits.com/Larybaby1/message/645991492</span></p><p class=\"\"><span>GMGI shares have declined more than 37% so far in 2026.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:2857db76a094b:0/",
            "pub_date": "2026-02-27 02:00:45",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938554:0",
            "title": "ERAS: Lead RAS-targeted therapies show strong early data, with major trial updates expected in 2024",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The company is advancing two lead RAS-targeted programs, ERAS-0015 and ERAS-4001, with promising early clinical data showing high potency and favorable safety. Rapidly enrolling trials will provide key updates in 2024, and future combination strategies are planned.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938554:0-eras-lead-ras-targeted-therapies-show-strong-early-data-with-major-trial-updates-expected-in-2024/",
            "pub_date": "2026-02-27 01:53:47",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938555:0",
            "title": "ELPE: Strong EBITDA and net income, record investments, and robust marketing drive resilient growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delivered a fourth year of strong results with EUR 1.1 billion EBITDA and EUR 0.5 billion net income, driven by robust refining and marketing, record investments, and expansion in renewables and power. Outlook for 2026 includes lower refinery volumes due to scheduled shutdowns and continued dividend growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938555:0-elpe-strong-ebitda-and-net-income-record-investments-and-robust-marketing-drive-resilient-growth/",
            "pub_date": "2026-02-27 01:53:50",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938556:0",
            "title": "Rede D'Or São Luiz: Record revenue, EBITDA, and cash flow in 2025, with strong growth across all segments",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 results with 27% net revenue growth, strong EBITDA, and robust cash generation. Hospitals and SulAmérica segments saw high demand, improved efficiency, and disciplined capital allocation, with positive outlook for 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938556:0-rede-d-or-s-o-luiz-record-revenue-ebitda-and-cash-flow-in-2025-with-strong-growth-across-all-segments/",
            "pub_date": "2026-02-27 01:53:52",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012857:0",
            "title": "Nymex Overview: Oil, Products Up in Choppy Trade on Uncertain US-Iran Talks — OPIS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Petroleum contracts were trading higher by midday Wednesday as the complex erased early losses on market jitters amid tense nuclear talks between U.S. and Iranian officials.</span></p><p class=\"\"><span>At 12:05 p.m. ET, April NYMEX West Texas Intermediate crude futures were up 85cts to about $66.25/bbl and May WTI was 80cts higher to $66.15/bbl.</span></p><p class=\"\"><span>London-based April ICE Brent was up by around $1.20 to $72.05/bbl and May Brent increased $1.15 to $71.85/bbl. Refined product contracts largely tracked crude's gains. The more-active April NYMEX RBOB was 2.5cts higher to about $2.2705/gal and March RBOB was up by 3.05cts to $2.022/gal. April ULSD was around 4.35cts higher to $2.5745/gal and March ULSD rose 3.75cts to $2.7115/gal.</span></p><p class=\"\"><span>On Thursday, U.S. envoys Steve Witkoff and Jared Kushner are holding a crucial round of talks in Geneva over Iran's nuclear program. According to the Wall Street Journal, citing unnamed sources, the U.S. negotiators are expected to make clear Iran must dismantle its three main nuclear sites and deliver all of its remaining enriched uranium to the U.S. Those demands could be tough for Tehran to accept, however.</span></p><p class=\"\"><span>President Trump has in the last several weeks massed a heavy military presence in the Persian Gulf and threatened to strike Iran if a deal is not reached. A possible war in the region could easily choke off key crude oil supply routes and disrupt crude oil from the Middle East to the rest of the world.</span></p><p class=\"\"><span>In the spot market, U.S. Gulf Coast CBOB and RBOB rose around 19cts and San Francisco CARBOB also jumped 9cts in midday trade, as physical barrels in both markets switched to the costlier summer RVP specifications following shipping cycle changes overnight. Other cash products largely mirrored changes in NYMEX futures.</span></p><p class=\"\"><span>- -</span></p><p class=\"\"><span>This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal.</span></p><p class=\"\"><span>Reporting by Frank Tang, ftang@opisnet.com; Editing by Michael Kelly, mkelly@opisnet.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012857:0-nymex-overview-oil-products-up-in-choppy-trade-on-uncertain-us-iran-talks-opis/",
            "pub_date": "2026-02-27 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}