{
    "data": [
        {
            "id": "DJN_DN20250205002731:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0655 GMT - Chinese AI company DeepSeek's breakthrough is unlikely to hurt demand in the short-term, although the market will likely cut multiples to price on uncertainties in the longer term, according to Julius Baer analysts in an emailed commentary. The market is debating on the long-term impact, as optimists argue that a lower entry barrier would attract new players, which should boost semiconductor demand, they write. \"We do not expect much weakness in the near-term demand,\" the analysts note. They add that long-term demand will be determined by changes in AI-driven computing needs, such as inference, noting that such demand could offset the possibly lower computing demand in training. DeepSeek's development marks a major evolution, though not entirely a revolution, in artificial intelligence, they say. (tracy.qu@wsj.com)</p><p class=\"\">0337 GMT - Inari Amertron's FY 2025-FY 2026 earnings my be pressured by weaker radio frequency revenue as handset sales slow down, CGS International analysts Shafiq Kadir and Dharmini Thuraisingam say in a note. Margin dilution from new packaging ventures could add pressure on earnings, they write, as CGS cuts its forecast for Inari's FY 2025-FY 2026 EPS by 19%-20%. However, margins may recover by FY 2026-FY 2027 with new businesses scaling up production, they add. CGS International lowers Inari's target price to MYR2.60 from MYR2.90, while maintaining a hold rating, citing near-term risks from a subdued automotive market and policy uncertainties under the Trump administration. Shares are 0.4% lower at MYR2.44. (yingxian.wong@wsj.com)</p><p class=\"\">1045 GMT - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002731:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002729:0",
            "title": "Health Care Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Health Care sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0847 GMT - Novo Nordisk's 2025 outlook is reassuring, says Sheena Berry at Quilter Cheviot. The Danish pharmaceutical company expects a robust 16%-24% sales growth for the year, Berry says. Fourth-quarter sales rose 30%, outpacing expectations, although this was partly driven by insulin rebate adjustments, she notes. The performance of key growth drivers, Ozempic and Wegovy, remains strong, with Ozempic meeting expectations and Wegovy slightly underperforming. Novo Nordisk is set to initiate a new CagriSema Phase 3 trial in 2025 and plans to file with regulators in the first quarter of 2026, a slight delay to ensure a secure supply chain. Shares trade 4.5% higher at 619 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0838 GMT - Novo Nordisk's initial 2025 outlook is just ahead of Jefferies's expectations. But given a higher starting point and stronger currency effects it suggests up to 6% sales and 10% EBIT consensus upgrades, analysts at the bank write. Novo Nordisk's fourth-quarter sales beat expectations by 5%, mostly on positive U.S. gross-to-net adjustments--the discount offered between the list price and the actual net sales price--for its insulins. Sales of Wegovy were shy of expectations while Ozempic and Rybelsus were in line. A better gross margin, higher research and development costs but less selling and distribution spend helped EBIT beat by 9% and EPS by 6%. The stock will likely tick higher initially but could then fade, Jefferies says. Shares trade 4.2% higher at 617.20 Danish kroner. (dominic.chopping@wsj.com)</p><p class=\"\">0837 GMT - GSK needs to convince investors of a sustainable vaccine outlook after it cut the 2025 sales target of its jabs, Shore Capital analyst Sean Conroy says. The British pharma company now guides for a low single-digit decrease in vaccine sales for this year after a slowdown in the U.S., notably for its RSV shot Arexvy that missed consensus estimates by 18%, the analyst says. \"Some tangible evidence the transient challenges facing Shingrix [shingles vaccine] and Arexvy can be navigated will likely be needed to reinstill the conviction in management's longer-term expectations for these,\" he says in a note. Shares are up 5.7% at 1,458.50 pence. (helena.smolak@wsj.com)</p><p class=\"\">0830 GMT - Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002729:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002737:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0748 GMT - Santander posted a strong set of fourth-quarter results alongside guidance for 2025 and plans for capital returns to shareholders that are better than expected, Barclays's Cecilia Romero Reyes and Paola Sabbione say in a research note. The Spanish bank reported quarterly net profit and revenue that exceeded consensus forecasts, with results in Spain, Mexico, Brazil and the U.S. that were better than anticipated, Barclays says. The group's 2025 target for return on tangible equity--a profitability measure--of more than 17% is at the high end of previous guidance. Moreover, its intention to return 10 billion euros through buybacks is ahead of consensus expectations of 6 billion euros, according to Barclays. (adria.calatayud@wsj.com)</p><p class=\"\">0649 GMT - Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p><p class=\"\">0439 GMT - Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0356 GMT - Insurance broker and underwriter Steadfast gets upgraded to buy from hold at Goldman Sachs, where analysts think that the Australian company looks cheap compared with global peers. They think that Steadfast will maintain its annual guidance despite moderation in commercial rates for small and medium enterprises. They see limited risk from strata reviews and reckon that Steadfast was tracking well through the first fiscal quarter, albeit performance looked to be acquisition led. Steadfast is trading at less than 18 times one-year forward earnings, which they write in a note is below mid-cycle multiples. GS keeps a A$6.50 target price on the stock. Shares are up 1.7% at A$5.795. (stuart.condie@wsj.com)</p><p class=\"\">0257 GMT - Stronger-than-expected labor cash earnings growth in Japan and an expansionary services PMI reading continues to support BOJ policy normalization, ING's Min Joo Kang says. Data released earlier showed solid on-year labor cash earnings growth in December, with base earnings rising steadily for a second month, while January's services PMI marked its highest level since September 2024. \"Strong wage growth is likely to lead to consumption growth and keep inflation above 2%,\" the economist says. The market is pricing in another BOJ rate hike in July, but ING forecasts a move in May is possible, especially if this year's Shunto wage talk results are as strong as last year's. ING now sees BOJ's terminal rate at 1.25% versus 1.0% previously, tipping hikes in May and October of 2025, followed by another in 2026. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">2225 GMT - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">2318 GMT - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1632 GMT - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1616 GMT - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1530 GMT - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1619 GMT - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1508 GMT - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002737:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002730:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0919 GMT - TotalEnergies' integrated LNG division meant its fourth-quarter adjusted earnings beat consensus expectations, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani write. The French oil-and-gas company's other divisions were all broadly in line with expectations, they add. Given TotalEnergies hosted its capital markets day in October, is isn't surprising that it didn't outline any major changes to guidance, the analysts write. TotalEnergies shares rise 1% to 57.56 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0450 GMT - Perusahaan Gas Negara's earnings performance is likely to be solid and steady, Maybank Sekuritas Indonesia analysts say in a research report. The brokerage likes the Indonesian natural-gas distributor for its strong free cash flow generation, which offers flexibility for reinvestment, debt repayment and high dividends. The company serves industries such as power, food and chemicals, and is expanding to include households, the analysts note. The brokerage anticipates the company to deliver stable revenue of $2.9 billion per year for 2025-2026. It initiates coverage of the stock with a buy rating and a target price of IDR2,000.00. Shares are 1.6% higher at IDR1,610.00. (ronnie.harui@wsj.com)</p><p class=\"\">1917 GMT - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1336 GMT - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">1310 GMT - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002730:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002738:0",
            "title": "China Mulls Probe Into Apple's App Store, Bloomberg Reports, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">China's State Administration for Market Regulation is examining Apple's policies, which include taking a cut of as much as 30% on in-app spending and barring external payment services and stores, Bloomberg reported, citing multiple sources.</li><li class=\"listItem-bmN0_SHH\">Antitrust watchdog officials have spoken with Apple executives and app developers since last year, Bloomberg reported.</li><li class=\"listItem-bmN0_SHH\">Chinese regulators believe Apple may be charging local developers unreasonably high fees, and may launch a formal investigation if Apple resists making changes, Bloomberg reported.</li><li class=\"listItem-bmN0_SHH\">Bloomberg said an Apple spokesperson didn't respond to a request for comment, while the regulator didn't respond to a faxed request for comment.</li></ul><p class=\"\">Full story: https://www.bloomberg.com/news/articles/2025-02-05/china-weighs-investigating-apple-over-app-store-policies-fees-including-30-cut</p><p class=\"\">Write to Jiahui Huang at jiahui.huang@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002738:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002732:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0700 GMT - Comex gold futures are approaching $2,900/oz on strong bullish momentum, based on daily charts, RHB Retail Research's Joseph Chai says in a research report. Futures saw fresh positive price movements on Tuesday, while they remain on track to test resistance at $2,900/oz, the analyst says. If the commodity rises beyond that mark, it will likely extend gains toward the $3,000/oz level, the analyst says. The 20-day simple moving average is also trending upward, offering extra support for the bullish technical setup, the analyst adds.Spot gold is 0.7% higher at $2,861.48/oz. (ronnie.harui@wsj.com)</p><p class=\"\">2331 GMT - Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2328 GMT - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1824 GMT - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">1245 GMT - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002732:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002733:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0812 GMT - Great Wall Motor's February sales volume will likely stay flat on month, but may recover somewhat in March, Citi analysts write in a note, citing company management. The automaker's January exports dropped on month due to the New Year holiday outside China, and it expects overseas sales growth in February and March due to postholiday promotional events. Meanwhile, the carmaker's new Tank 500 model, released this year, has secured 2,000 new orders since Jan. 2, Citi notes. Great Wall Motor will be a beneficiary of growth in the EV sector and EVs' higher market share in China, the bank says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0740 GMT - Investors could be concerned about Nissan's future as its board is planning to reject Honda's merger terms, Morningstar analyst Vincent Sun says. Nissan would face pressure surviving amid stiff competition in the U.S. and China, especially as it has a larger risk exposure to U.S. tariffs on Mexico than Honda and Toyota, the analyst says. However, even if the merger goes through, that wouldn't solve the challenges the two companies face. Both carmakers lack compelling EV offerings, and the combined entity would need to build a new EV model pipeline, he says. The two could benefit from larger scale and cost synergy, but that would take time to realize, Sun says. In any case, Nissan would find it difficult to \"play a smaller role in the new entity rather than standing on an equal footing with Honda,\" he adds. (sherry.qin@wsj.com)</p><p class=\"\">0657 GMT - Grab's growth drivers are intact, and its adjusted Ebita will likely surge in 2025, driven by margin expansion, HSBC analysts write in a note. Grab is likely to strengthen its leadership position in ride-hailing and deliveries, as it invests into products to help expand its total addressable market with affordable products, they say. However, as the priority will be on new product initiatives, cross-selling and lending products, HSBC trims earlier margin estimates and reduces its adjusted Ebitda projection by 2%-5% for 2025-2026. HSBC lowers its target price to $5.45 from $5.50 but upgrades its stock rating to buy from hold as the stock offers 20% upside, and valuations have become attractive after the recent price correction. (kimberley.kao@wsj.com)</p><p class=\"\">1733 GMT - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p><p class=\"\">1716 GMT - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1441 GMT - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1437 GMT - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">1340 GMT - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">1008 GMT - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">1001 GMT - TomTom's 2025 guidance is disappointing, ING analyst Marc Hesselink writes in a note. The location technology specialist's outlook remains very uncertain, with no free cash flow expected in the near term, he adds. However, \"the guidance provides significant room for error to reflect the uncertain automotive market,\" he adds. In the fourth quarter, the main negative was its free cash flow--5 million euros outflow--due to unfavorable working capital timing, Hesselink says. Shares are down 14% at 4.28 euros. (najat.kantouar@wsj.com)</p><p class=\"\">1000 GMT - A potential merger between Grab and GoTo would improve margins, Citi Research analyst Alicia Yap writes in a note. Bloomberg reported Tuesday that talks between the ride-hailing companies over a possible combination have recently intensified. They would likely save costs on competing user subsidies, as well as see faster new user acquisition with broader product offerings and better reach to lower-tier cities, Yap says. There could also be better user targeting, cross-selling of financial services and increased advertising revenue on both platforms, Yap adds. Both brands would likely continue running independently, but there could be back-end integration of systems and more collaboration regarding merchant management and sharing their rider and vehicle pool, Yap adds. Citi retains a buy rating on Grab with a target of $5.90. Shares last closed at $4.54. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002733:0/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFNbP4DFN:0",
            "title": "Analyst Group: Analyst Group Comment on Eevia Health’s Divestment of the Eye-Health Candidate Retinari™",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On February 4thth, Eevia Health Plc (publ) (“Eevia”) announced that the Company has agreed to sell IP related to the leading eye-health compound, Retinari™, to Havu Health Oy for EUR 800k, equivalent to approx. SEK 9.2m. Retinari™ is a promising compound in fighting Age-related Macular Degeneration (AMD), the primary cause of blindness.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">In summary, </strong>we view the divestment as a pivotal step in the Company’s ongoing restructuring plan, reinforcing the underlying value that the transformational strategy aims to unlock. Moving forward, Havu Health Oy’s ability to secure the necessary funding will be a key factor to monitor, as successful financing could unlock significant upside potential and accelerate the commercialization of Retinari™.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read Analyst Group’s comment here</strong></p><p class=\"\">About Analyst Group: One of Sweden's leading equity research boutiques with focus on small and medium-sized listed companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read more about Analyst Group</strong></p><p class=\"\"><em> </em></p><p class=\"\">This is a press release from Analyst Group regarding the publication of a comment on Eevia Health. Readers may assume that Analyst Group has received compensation for making the comment. The Company has not been given an opportunity to influence the parts where Analyst Group has had opinions about the Company, future valuation or anything else that could be considered a subjective assessment.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFNbP4DFN:0-analyst-group-analyst-group-comment-on-eevia-health-s-divestment-of-the-eye-health-candidate-retinari/",
            "pub_date": "2025-02-05 17:20:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463911:0",
            "title": "Aptitude Software Group CFO Plans Exit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aptitude Software Group  Chief Financial Officer Mike Johns intends to step down, according to a Wednesday release. </p><p class=\"\">Johns will remain in the financial software company to oversee the 2024 results, which it will publish on March 26, and ensure a smooth transition. </p><p class=\"\">The company has started looking for a new CFO.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463911:0/",
            "pub_date": "2025-02-05 17:20:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463902:0",
            "title": "Zyxel Group Logs NT$508 Million Profit in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zyxel Group  booked net income attributable to the parent company of NT$507.9 million, or NT$1.26 per share for the fourth quarter of 2024. </p><p class=\"\">Operating revenue of the networking solutions provider for the three months stood at NT$7.5 billion, according to a Wednesday Taiwan Exchange filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463902:0/",
            "pub_date": "2025-02-05 17:20:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446717:0",
            "title": "Italy Retail Sales Rebound, Beat Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The value of retail sales in Italy grew by 0.6% month-over-month in December 2024, rebounding from a 0.4% drop in the previous month and surpassing market expectations of a 0.1% rise.</p><p class=\"\">Sales recovered for both food (0.6% vs -0.1% in November) and non-food (0.8% vs -0.7%) products.</p><p class=\"\">On a yearly basis, retail sales increased by 0.6% in December, slowing from a 1.1% growth in November.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446717:0-italy-retail-sales-rebound-beat-forecasts/",
            "pub_date": "2025-02-05 17:20:49",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463912:0",
            "title": "Eurozone Private Sector Output Returns to Growth in January, Final PMI Shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The eurozone's private sector saw output growth at the start of 2025, marking the first expansion since August 2024, Hamburg Commercial Bank and S&amp;P Global's final data showed Wednesday. </p><p class=\"\">The HCOB Eurozone Composite PMI Output Index rose to a five-month high of 50.2 in January 2025 from 49.6 in December 2024, in line with the flash estimate. </p><p class=\"\">Meanwhile, the HCOB Eurozone Services PMI Business Activity Index hit a two-month low of 51.3, down from the prior month's 51.6 and the initial reading of 51.4.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463912:0/",
            "pub_date": "2025-02-05 17:20:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463907:0",
            "title": "SMMT: Britain's New Car Sales Down 2.5% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UK's new car registrations fell 2.5% year over year to 139,345 units in January, according to data from the Society of Motor Manufacturers and Traders published Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463907:0/",
            "pub_date": "2025-02-05 17:20:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002669:0",
            "title": "FTSE 100 Could Rally to New All-Time High if BOE Signals More Rate Cuts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. FTSE 100 index could rise to a new all-time high if the Bank of England signals additional future interest-rate cuts during Thursday's rate decision, Capital.com's Daniela Sabin Hathorn says in a note. \"A BOE rate cut could renew investor interest in U.K. stocks,\" she says. The FTSE 100 reached a new high of 8692.84 on Jan. 31. Any hints of more interest-rate cuts could reignite a U.K. equities rally, Hathorn says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002669:0/",
            "pub_date": "2025-02-05 17:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463903:0",
            "title": "Nokia to Upgrade Orange's 5G Infrastructure Under Extended Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nokia  secured a four-year contract extension from French telecoms company Orange  to upgrade the latter's 5G radio infrastructure. </p><p class=\"\">The Finnish telecommunications group will deliver its portfolio of AirScale products and artificial intelligence-based MantaRay network management system to boost customer experience and performance of Orange's network in Southeastern and Western France, according to a Wednesday release. </p><p class=\"\">The deal also covers a trial of Nokia's 5G Cloud RAN solutions by Orange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463903:0/",
            "pub_date": "2025-02-05 17:12:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446713:0",
            "title": "Eurozone Services Output Rises Slightly in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Eurozone Services PMI stood at 51.3 in January 2025, little changed from the preliminary estimate of 51.4 and marginally down from December’s 51.6.</p><p class=\"\">The latest reading signaled a modest expansion in services output, supported by a second consecutive month of rising new orders, driven by domestic demand.</p><p class=\"\">Employment growth accelerated compared to late 2024, while backlogs of work declined at a faster pace.</p><p class=\"\">On the pricing front, input costs saw their sharpest rise in nine months, while selling price inflation remained steady at its highest level since May 2024.</p><p class=\"\">Meanwhile, business sentiment remained positive, though it softened slightly from the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446713:0-eurozone-services-output-rises-slightly-in-january/",
            "pub_date": "2025-02-05 17:13:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463899:0",
            "title": "UPM-Kymmene to Initiate EUR160 Million Share Repurchase Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UPM-Kymmene  said Wednesday that it will launch a share buyback program to repurchase up to 160 million euros of its shares on Feb. 10. </p><p class=\"\">The Finnish forest and paper products company will buy back and cancel a maximum of 6 million shares. The program, which will be done to reduce capital, will end on May 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463899:0/",
            "pub_date": "2025-02-05 17:13:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446714:0",
            "title": "France Services PMI Shrinks More Than Initial Estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB France Services PMI fell to 48.2 in January 2025, revising lower than the initial estimates of 48.9 and compared to 49.3 in December 2024.</p><p class=\"\">This marked the fifth consecutive month of contraction, primarily due to weaker client demand and political uncertainty.</p><p class=\"\">New business volumes contracted, though the decline was modest and the mildest since last September.</p><p class=\"\">Furthermore, employment levels fell, with services firms cutting jobs at the fastest pace in over four years, driven by the non-replacement of voluntary leavers and the expiration of temporary contracts.</p><p class=\"\">On the pricing front, cost pressures intensified, with input prices rising at their fastest rate in five months, attributed to higher salary expenses and increased supplier charges.</p><p class=\"\">However, service providers reduced their charges for the first time since April 2021.</p><p class=\"\">Looking ahead, business confidence remained at its lowest point since May 2020, as uncertainty surrounding the domestic political climate persists.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446714:0-france-services-pmi-shrinks-more-than-initial-estimates/",
            "pub_date": "2025-02-05 17:13:53",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0OS:0",
            "title": "Japan may see LNG demand up if renewables are slow; Canada there to deliver, officials say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Japan may see LNG demand up to 74 mln t by 2040 if renewable energy rollout is slow</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Japan's power demand is seen growing on data centres expansion</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Canada looks for alternative energy markets as Trump threatens tariffs</li></ul></span></div><span><p class=\"\">    Japan's demand for liquefied natural gas (LNG) may grow by more than 10% to some 74 million metric tons by 2040 under a government scenario where the renewable energy rollout goes slower than expected, a senior industry ministry official said.</p><p class=\"\">Japan's domestic LNG demand continued to fall last year, dropping by 0.4% to 66 million tons due to a weaker economy, a growing share of renewable energy, and nuclear power plant restarts.</p><p class=\"\">Yuya Hasegawa, a division director at Japan's Ministry of Economy, Trade and Industry (METI), told a conference in Tokyo that there is an expectation that power demand will expand due to the growth of data centres in the country.</p><p class=\"\">\"If we do not have a huge expansion of renewable energy, or if we cannot reduce the cost of hydrogen, ammonia, CCUS (carbon capture, utilization and storage), our gas demand will increase,\" he said.</p><p class=\"\">According to Hasegawa, under an alternative energy strategy scenario being prepared by METI, Japan's LNG demand will rise to 74 million tons in 2040, or by almost 10%, if renewable energy expansion is not there as other METI scenarios assume.</p><p class=\"\">Australia, Malaysia and the United States are the biggest LNG suppliers to Japan, but Canada is preparing to start exports to Japan later this year from the LNG Canada project where Mitsubishi  is a shareholder.</p><p class=\"\">With U.S. President Donald Trump still threatening steep tariffs on Canada, including on energy imports, Canada is turning its attention to other potential markets, including Japan, the world's second biggest LNG buyer after China. </p><p class=\"\">Trump has also promised to increase oil and gas production in the U.S., already the world's biggest, increasing competition among sellers for top buyers, including for Japan. </p><p class=\"\">Canada's province of Alberta, a source of gas for the yet-to-be-launched LNG Canada export project, wants to double production for supplies elsewhere, including to Asia and Japan, Rebecca Schulz, minister of environment and protected areas at the Government of Alberta, told the same conference in Tokyo.</p><p class=\"\">\"Just the shipping time, half of the time coming from the U.S. Gulf Coast, it makes us a perfect partner (for Japan),\" she said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0OS:0-japan-may-see-lng-demand-up-if-renewables-are-slow-canada-there-to-deliver-officials-say/",
            "pub_date": "2025-02-05 17:14:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TT:0",
            "title": "Street View: AMD's AI story awaits new chip boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Advanced Micro Devices  failed to impress investors waiting for the chipmaker to gain ground against AI heavyweight Nvidia , even as its Q4 results and revenue outlook exceeded analysts' estimates on Tuesday</p><p class=\"\">** Chip company's shares down 9% to $108.72 premarket </p><p class=\"\">POWERING PROGRESS, CHIP BY CHIP</p><p class=\"\">** HSBC Global Research (\"reduce\", PT: $90) sees AMD's growth slowing in non-AI segments like datacentre or client segment, with market focus shifting to AI GPU momentum</p><p class=\"\">** Piper Sandler (\"overweight\", PT: $140) says AMD's growth in MI GPUs has slowed but is expected to pick up again when MI350 is commercially available in H2 of 2025</p><p class=\"\">** J.P. Morgan (\"neutral\", PT: $130) sees AMD's datacenter GPU rev growing significantly in 2025, driven by strong customer engagement and earlier production of MI350 series</p><p class=\"\">** Evercore ISI (\"outperform\", PT: $147) sees AMD's MI350 GPU, launching mid-2025, enhancing training functionality and broadening AI workload capabilities</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TT:0-street-view-amd-s-ai-story-awaits-new-chip-boost/",
            "pub_date": "2025-02-05 17:14:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205002698:0",
            "title": "Santander Chair: Progress Toward 2025 Targets Is Well Ahead of Plan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205002698:0/",
            "pub_date": "2025-02-05 17:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002691:0",
            "title": "News Highlights: Top Energy News of the Day - Wednesday at 4 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. benchmark oil prices end lower as China trade dispute fuels demand concerns</strong></p><p class=\"\">U.S. oil prices on Tuesday gave back most of their gains from a day earlier after the U.S. implemented an additional 10% tariff on Chinese imports and Beijing retaliated with measures of its own, raising concerns over the prospects for demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on natural gas and oil prices, OMV and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002691:0-news-highlights-top-energy-news-of-the-day-wednesday-at-4-am-et/",
            "pub_date": "2025-02-05 17:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002697:0",
            "title": "Kuala Lumpur Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  TWL Holdings                   92,617,600        0.025         unch         unch <br/>  Harvest Miracle Capital        69,625,000        0.195         unch         unch <br/>  Oriental Kopi Holdings         50,475,600        0.895       -0.005        -0.56 <br/>  Gamuda                         48,375,400        4.380       +0.200        +4.78 <br/>  My E.G. Services               46,306,900        0.970       +0.010        +1.04 <br/>  Nationgate Holdings            43,183,700        1.960       +0.110        +5.95 <br/>  YTL                            41,276,100        1.950       +0.070        +3.72 <br/>  AuMas Resources                36,970,500        0.955       +0.065        +7.30 <br/>  YTL Power International        29,972,700        3.170       +0.130        +4.28 <br/>  CBH Engineering Holding        29,516,200        0.335       +0.005        +1.52 <br/>  JAKS Resources                 28,860,800        0.120         unch         unch <br/>  Sime Darby Property            27,826,400        1.520       +0.080        +5.56 <br/>  Velesto Energy                 21,804,000        0.190       +0.010        +5.56 <br/>  Vanzo Holdings                 19,495,200        0.175       -0.010        -5.41 <br/>  Tanco Holdings                 19,446,400        1.860       -0.070        -3.63 <br/>  Public Bank                    18,796,200        4.440       +0.040        +0.91 <br/>  Supermax Corp Bhd              17,534,600        1.190       +0.010        +0.85 <br/>  Reservoir Link Energy          17,016,200        0.355         unch         unch <br/>  IJM                            16,147,300        2.430       -0.010        -0.41 <br/>  Bintai Kinden                  16,049,700        0.105       +0.005        +5.00 <br/>  Swift Energy Technology        15,712,600        0.340         unch         unch <br/>  Salutica                       15,669,900        0.280       +0.030       +12.00 <br/>  Key Alliance Group             15,254,400        0.005         unch         unch <br/>  Top Glove                      14,818,500        1.210       -0.020        -1.63 <br/>  Ekovest                        14,635,700        0.340       +0.005        +1.49 <br/>  Asia Poly Holdings             14,400,500        0.095       +0.015       +18.75 <br/>  KPJ Healthcare                 14,128,600        2.370       +0.020        +0.85 <br/>  Borneo Oil                     12,557,600        0.010         unch         unch <br/>  Mah Sing Group                 12,325,700        1.460       +0.060        +4.29 <br/>  Kinergy Advancement            12,202,000        0.320         unch         unch <br/>  Vinvest Capital Holdings       11,866,400        0.080       +0.015       +23.08 <br/>  Advance Synergy                11,554,500        0.085       -0.010       -10.53 <br/>  Inari Amertron                 10,479,300        2.470       +0.020        +0.82 <br/>  Silver Ridge Holdings          10,312,400        0.485       -0.110       -18.49 <br/>  JCY International              10,300,100        0.455       +0.005        +1.11 <br/>  Topvision Eye Specialist       10,278,100        0.280       +0.030       +12.00 <br/>  Yew Lee Pacific Group           9,986,500        0.575         unch         unch <br/>  Solar District Cooling          9,719,000        0.555         unch         unch <br/>  SNS Network Technology          9,629,900        0.550       +0.020        +3.77 <br/>  YBS International               9,550,300        0.790       +0.005        +0.64 <br/>  Eco World Devt Grp              9,536,500        1.900       +0.140        +7.95 <br/>  UEM Sunrise                     9,243,800        0.955       +0.025        +2.69 <br/>  Datasonic Group                 9,104,500        0.395       +0.005        +1.28 <br/>  Genetec Technology              8,572,900        1.560       +0.060        +4.00 <br/>  Dialog Group                    8,488,700        1.910       +0.010        +0.53 <br/>  Johor Plantations Group         8,368,100        1.210       +0.040        +3.42 <br/>  Bumi Armada                     8,275,900        0.675       +0.020        +3.05 <br/>  Cape EMS                        8,005,800        0.330         unch         unch <br/>  CIMB Group Holdings             7,907,300        8.170       -0.020        -0.24 <br/>  NetX Holdings                   7,819,100        0.075       +0.005        +7.14 <br/>Prices in Ringgit <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002697:0/",
            "pub_date": "2025-02-05 17:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002612:0",
            "title": "Fincantieri Gets Large Norwegian Order for Four Cruise Ships",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Cristina Gallardo</p><p class=\"\">Fincantieri said it received a large order for four cruise ships from a Norwegian customer.</p><p class=\"\">The Italian state-owned shipbuilder said Wednesday that the value of the order, placed by Norwegian Cruise Line Holdings Ltd., is \"very important\" but didn't provide any figures.</p><p class=\"\">The cruise ships will be able to accommodate more than 8,300 people including the crew, and will be built at the Fincantieri Monfalcone shipyard, near the Italian city of Trieste.</p><p class=\"\">They will be delivered in 2030, 2032, 2034 and 2036, the group said.</p><p class=\"\">Write to Cristina Gallardo at cristina.gallardo@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002612:0/",
            "pub_date": "2025-02-05 17:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN8sjLXl:0",
            "title": "4C Strategies signs framework agreement in the defense sector worth up to 275 MSEK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">4C Strategies, 4C Group AB (publ), a leading provider of solutions for training, readiness, and capability development, has signed a significant framework agreement with a defense customer in North America. The agreement covers the development of AI-supported exercise evaluation and includes a combination of licenses, software development, and services.</p><p class=\"\">The initial order amounts to approximately 90 million SEK over four years, with a total framework agreement value of up to 275 million SEK. Deliveries will begin during the first quarter of 2025 and continue until 2028.</p><p class=\"\">In addition to strengthening 4C Strategies' role in military training and exercises in the market, the project is also expected to contribute to the company's continued development of AI-based solutions.</p><p class=\"\">\"This is a very exciting project for us, one that we have worked hard to secure. Gaining this trust in this market and being part of building the latest technology together with our existing platform demonstrates that we are on the right track in North America,\" says Jonas Jonsson, Group CEO of 4C Strategies.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN8sjLXl:0-4c-strategies-signs-framework-agreement-in-the-defense-sector-worth-up-to-275-msek/",
            "pub_date": "2025-02-05 17:15:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0VM:0",
            "title": "China mulling probe into Apple's app store fees, practices, Bloomberg News reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    China's antitrust regulator is preparing for a possible investigation into Apple's  policies and app store fees, Bloomberg News reported on Wednesday, citing people familiar with the matter.</p><p class=\"\">The development comes a day after China announced a wide range of measures targeting U.S. businesses including Google , farm equipment makers and the owner of fashion brand Calvin Klein, minutes after new U.S. tariffs on Chinese goods took effect.</p><p class=\"\">The country's State Administration for Market Regulation is reviewing Apple's policies, including its up to 30% commission on in-app purchases and restrictions on external payment services and app stores, the report said. </p><p class=\"\">Chinese regulators have been in discussions with Apple executives and app developers since last year, as per the report.</p><p class=\"\">Apple and China's antitrust watchdog did not immediately respond to Reuters' request for comment.</p><p class=\"\">China's State Administration for Market Regulation on Tuesday said Google was suspected of violating the country's anti-monopoly law and that an investigation was initiated in accordance with the law.</p><p class=\"\">Separately, China's Commerce Ministry said it had put PVH Corp , the holding company for brands including Calvin Klein and Tommy Hilfiger, and U.S. biotechnology firm Illumina  on its \"unreliable entity\" list.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0VM:0-china-mulling-probe-into-apple-s-app-store-fees-practices-bloomberg-news-reports/",
            "pub_date": "2025-02-05 17:15:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0EI:0",
            "title": "TotalEnergies CEO says Europe should negotiate with US for free trade of LNG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    TotalEnergies  CEO Patrick Pouyanne said on Wednesday that European countries should negotiate to obtain a free trade guarantee on liquefied natural gas (LNG) from the United States.</p><p class=\"\">The comments come as U.S. President Donald Trump imposed sweeping tariffs on Chinese imports, which led to Beijing imposing a 15% levy on U.S. LNG and 10% on U.S. crude oil in retaliation on Tuesday.</p><p class=\"\">Speaking to reporters after the company announced fourth quarter earnings, Pouyanne added that LNG export capacity in the United States should practically double in coming years.</p><p class=\"\">\"But what happens if all of a sudden the U.S. decides they must export less than they've done historically? ... We must not pass from a so-called over-dependence on Russia to an over-dependence on another country, even if it's an ally,\" Pouyanne said.</p><p class=\"\">\"There are two types of countries: those with free trade agreements that the Americans have signed and under which they cannot suspend exports, and then countries without free-trade agreements, like Europe.\"</p><p class=\"\">\"I think it would be good for Europeans to ask the Americans in the negotiations that are to come, for a sort of free-trade guarantee on LNG,\" he said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0EI:0-totalenergies-ceo-says-europe-should-negotiate-with-us-for-free-trade-of-lng/",
            "pub_date": "2025-02-05 17:08:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446709:0",
            "title": "German Services Sector Growth Unrevised at 6-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Germany Services PMI rose to 52.5 in January 2025, up from 51.2 in December, matching the preliminary estimate.</p><p class=\"\">This indicated an acceleration in business activity to its fastest pace in six months, just below the long-term average, despite a marginal drop in new orders.</p><p class=\"\">However, price pressures intensified, with inflation rates for both input costs and output charges accelerating to their fastest pace since early 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446709:0-german-services-sector-growth-unrevised-at-6-month-high/",
            "pub_date": "2025-02-05 17:08:02",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446710:0",
            "title": "German Private Sector Activity Grows for 1st Time in 7 Months",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Germany Composite PMI was revised up to 50.5 in January 2025 from a preliminary reading of 50.1 and 48.0 in December, marking its first expansion in seven months as services expanded (PMI at 52.5) and manufacturing declined at a slower pace (PMI at 45).</p><p class=\"\">The increase was mainly driven by businesses completing outstanding orders, while new demand continued to fall, though at a slower rate than in previous months.</p><p class=\"\">Employment declines also eased, with job creation returning in the service sector.</p><p class=\"\">Business confidence improved across both industries.</p><p class=\"\">However, inflationary pressures strengthened.</p><p class=\"\">Costs for businesses rose at the fastest pace in nearly two years, driven by higher expenses in services and stabilizing manufacturing input costs.</p><p class=\"\">As a result, companies raised their selling prices at the steepest rate since February 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446710:0-german-private-sector-activity-grows-for-1st-time-in-7-months/",
            "pub_date": "2025-02-05 17:08:05",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463898:0",
            "title": "ITMAX System Bags Government Deal For Smart Parking Operation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ITMAX System  unit Southmax won a deal from the Majlis Perbandaran Pontian to operate the latter's outdoor parking spaces, according to a Wednesday Malaysian bourse filing. </p><p class=\"\">The deal has a term of 15 years, from Feb. 1, 2025, until Jan. 31, 2040.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463898:0/",
            "pub_date": "2025-02-05 17:08:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}