{
    "data": [
        {
            "id": "te_news:446665:0",
            "title": "Indonesia Economy Expands 0.53% QoQ in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy grew 0.53% qoq in Q4 of 2024, compared with market consensus of 0.56% and after a 1.5% expansion in Q3.</p><p class=\"\">It was the third quarterly rise but the softest in the sequence.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446665:0-indonesia-economy-expands-0-53-qoq-in-q4/",
            "pub_date": "2025-02-05 12:10:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014589:0",
            "title": "India's Sensex Flat as Financial, Tech Stocks Gains — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India's Sensex is flat at 78582.41 as gains in financial and tech stocks help offset losses in consumer stocks. IndusInd Bank is up 1.8% and Zomato is 1.5% higher, while Nestle India is down 2.8% and Hindustan Unilever is 0.8% lower. Investors are focusing on U.S. trade talks as well as domestic earnings. Reliance Power and Zydus Lifesciences are set to announce their quarterly results later in the day. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014589:0/",
            "pub_date": "2025-02-05 12:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463532:0",
            "title": "Mwb Research Keeps Infineon on Hold After Fiscal Q1 Beat as Geopolitical Risks Persist",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mwb research on Tuesday noted the stellar fiscal first-quarter performance of Infineon Technologies  but cautioned on the geopolitical risks that the European chipmaker is facing. </p><p class=\"\">As such, the research firm kept the German stock on hold and raised its price target to 35 euros from 33 euros. </p><p class=\"\">\"Despite Infineon's solid Q1 beat and slight order backlog growth, industry prospects remain tough and uncertain in the short-term due to ongoing inventory correction and soft demand across key end-markets,\" the note said. \"On top of that, Trump tariffs add an additional layer of uncertainty, particularly for the automotive segment, where slowing EV adoption in key regions, cost pressures, and geopolitical risks could disrupt supply chains and dampen expected recovery.\"</p><p class=\"\">Analysts at mwb also revised upwards their estimates for Infineon's sales, EBIT and EPS for 2025 to 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463532:0/",
            "pub_date": "2025-02-05 12:11:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463675:0",
            "title": "Titan Company's Consolidated Profit Remains Flat in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Titan Company's  consolidated attributable profit was largely flat at 10.5 billion Indian rupees in the fiscal third quarter ended Dec. 31, 2024 from the year-ago level. </p><p class=\"\">Earnings per share contracted to 11.80 rupees compared with 11.90 rupees a year ago, according to a Tuesday filing to the Indian stock exchanges by the watches and accessories manufacturer. The EPS was lower than the 12.03 rupees estimated by the analysts polled by Visible Alpha. </p><p class=\"\">Revenue from operations in fiscal Q3, however, increased to 175.5 billion rupees from 139.6 billion rupees a year earlier. This was higher than Visible Alpha's estimate of 170.96 billion rupees.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463675:0/",
            "pub_date": "2025-02-05 12:12:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463676:0",
            "title": "Vection Technologies Gets AU$4 Million Defense Contract Extension, Shares Down 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vection Technologies  received AU$4 million defense contract extension for its artificial intelligence software, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">The value of the contract will be recognized in its earnings results for the fiscal year ending June 30, the filing said. </p><p class=\"\">Shares were down 6% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463676:0/",
            "pub_date": "2025-02-05 12:13:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204015027:0",
            "title": "Nissan reportedly balks at Honda's terms, putting their merger in doubt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mike Murphy</p><p class=\"\">Shares of Nissan Motor Co. and Honda Motor Co. rose overnight following reports that the automakers' proposed merger may be scrapped.</p><p class=\"\">The Japanese newspaper Asahi Shimbun and the Wall Street Journal reported the two companies' boards would meet as soon as Wednesday to discuss possibly terminating the talks, after Nissan reportedly balked at a new proposal where it would become a subsidiary of Honda, rather than both being subsidiaries of a single holding company.</p><p class=\"\">Nissan's stock (JP:7201) rose nearly 2% in Tokyo trading early Wednesday. Honda's Japanese shares (JP:7267) were up about 3%, after its U.S.-traded shares (HMC) rose 2.4% on Tuesday.</p><p class=\"\">Merger talks to combine the companies and create one of the world's largest automakers were announced in December.</p><p class=\"\">Both Honda and Nissan saw sharp drops in global sales in 2024, especially in China and Southeast Asia, and they have been forced to cut production capacity as demand has dipped. Nissan has been particularly hard-hit, and announced 9,000 layoffs in November.</p><p class=\"\">When the deal was first announced, analysts said it was a sign of much-needed consolidation in the auto industry, as high prices have hurt sales amid competition from cheaper Chinese electric vehicles.</p><p class=\"\">Mitsubishi (JP:7211), a strategic partner of Nissan's, was invited to join the Honda-Nissan merger, but has not yet made a decision.</p><p class=\"\">-Mike Murphy</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204015027:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014597:0",
            "title": "New Zealand Shares Slip 0.5% as Tariff Worries Weigh — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's NZX-50 closed 0.5% lower at 12844.59, staying firmly on course for a fifth weekly decline in six weeks. The benchmark index fell at the open and stayed in the red all through Wednesday's session. Medical-device maker Fisher &amp; Paykel lost 3.7% amid continued worries over the impact of global tariffs. The stock is down 8.0% this week and is 9.9% lower so far in 2025. The NZX-50 benchmark index is down 2.0% year to date. Auckland International Airport fell 1.1% Wednesday. Aged-care providers Summerset and Ryman shed 0.8% and 1.6%, respectively. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014597:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575:0",
            "title": "Indonesia's Economy Sustained Steady Pace Growth in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +5.02% On Year; Mkt Expected +4.89%<br/><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +0.53% On Quarter<br/><strong class=\"root-Tkn6WL2y\">(04:09 GMT) </strong>*Indonesia 2024 GDP +5.03%<br/><strong class=\"root-Tkn6WL2y\">(04:14 GMT) </strong>Indonesia's Economy Sustained Steady Pace Growth in 2024</p><p class=\"\">By Ying Xian Wong</p><p class=\"\">Indonesia's economy grew at a steady pace in 2024 as momentum picked up in the final quarter of the year.</p><p class=\"\">Annual growth of 5.03% compared with the 5.05% expansion seen in 2023, the statistics agency said Wednesday. Economists at HSBC and DBS had expected a reading of 5.0%.</p><p class=\"\">That continues a years-long run of growth at a roughly 5% clip, with Southeast Asia's largest economy having expanding at the same pace since about 2016, barring the Covid shock over 2020 and 2021.</p><p class=\"\">Indonesia's resource-rich economy grew 5.02% from a year earlier in the fourth quarter of 2024, compared with a 4.95% expansion in the third quarter. That exceeded economists' expectations, with a Wall Street Journal poll tipping growth at 4.89%.</p><p class=\"\">Gross domestic product expanded 0.53% in the fourth quarter compared with the previous quarter.</p><p class=\"\">The data comes as President Prabowo Subianto looks to boost growth throughout his five-year term.</p><p class=\"\">Current indicators suggest that economic growth will likely remain around 5% this year, ANZ economists Arindam Chakraborty and Sanjay Mathur said in a recent note. While the Indonesian government's focus on welfare-driven spending could help support consumption, the 2025 budget looks conservative, they added.</p><p class=\"\">Write to Ying Xian Wong at yingxian.wong@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446666:0",
            "title": "Indonesia Enonomy Grows 5.03% in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy expanded by 5.02% yoy in Q4 2024, compared with market estimates of 4.98% and after a 4.95% growth in Q3, which was the softest growth in a year.</p><p class=\"\">For the full year, the economy grew by 5.03%, the lowest level in three years, after expanding by 5.05% in 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446666:0-indonesia-enonomy-grows-5-03-in-2024/",
            "pub_date": "2025-02-05 12:14:51",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014600_20250204014600:0",
            "title": "Nissin Foods Holdings 9-Mos Net Y43.58B Vs Net Y49.05B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014600_20250204014600:0/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014602:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014602:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014603:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</strong></p><p class=\"\">The Japanese automakers had announced a plan to combine in December.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chipotle Shares Fall as Chain Tempers Sales Growth Hopes</strong></p><p class=\"\">Chipotle reduced its financial outlook for same-store sales this year to an increase in the low to mid-single digits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</strong></p><p class=\"\">Novo's Wegovy and Ozempic are among the most closely watched new medications in recent history, but face serious competition from Eli Lilly's Zepbound and Mounjaro.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LG CNS Makes Weak Debut in South Korea After IPO</strong></p><p class=\"\">The information-technology services affiliate of conglomerate LG Group raised around $826 million in South Korea's biggest listing in three years.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mattel Relying on Supply Chain, Potential Price Increases to Offset Tariff Impacts</strong></p><p class=\"\">Chief Executive Ynon Kreiz said the company has spent years building out a supply chain that isn't overly reliant upon any one country. It will also consider increasing its prices, he said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014603:0-news-highlights-top-company-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DN:0",
            "title": "Indian shares open steady as energy stocks offset consumer drop",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's equity benchmarks were steady at the open on Wednesday, as positive momentum in energy stocks, driven by ONGC and oil marketing companies on an improved earnings outlook, countered losses in consumer stocks.</p><p class=\"\">The Nifty 50  was up 0.16% at 23,777.43 points, as of 9:28 a.m. IST, while the BSE Sensex  traded flat at 78,605.23.</p><p class=\"\">Eleven of the 13 major sectors posted early gains. Energy  and state-owned firms  climbed about 1.4% each, with ONGC  leading the charge following an improved production outlook, which also resulted in a rating upgrade by Macquarie.</p><p class=\"\">Oil marketing companies BPCL  and HPCL  rose 3.3% each after Goldman Sachs upgraded them to \"buy\" from \"neutral\", citing improved earnings outlook for the companies.</p><p class=\"\">Shares of Asian Paints  lost 4.3% after the paint maker missed the September-quarter profit view on Tuesday.   </p><p class=\"\">Consumer stocks  shed 0.6% to top the list of sectoral losers. </p><p class=\"\">Both blue-chip indexes - NSE Nifty 50  and BSE Sensex  - climbed 1.6% and 1.8%, respectively, on Tuesday, logging their best session in a month and pushing them into positive territory for 2025.</p><p class=\"\">($1 = 87.1530 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DN:0-indian-shares-open-steady-as-energy-stocks-offset-consumer-drop/",
            "pub_date": "2025-02-05 12:15:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014570:0",
            "title": "U.S. Tariffs Likely to Have Limited Impact on Chinese Home-Appliance Makers — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.S.'s additional 10% tariff on all Chinese goods is expected to have a limited impact on China's home-appliance makers, Morningstar analyst Jeff Zhang says in a research note. The U.S. accounted for only 5%-15% of Chinese exports of these products in 2024, he says. Home-appliance companies in China are also shifting their focus to developing countries with the potential for faster sales expansion, the analyst says. Midea Group and Haier Smart Home have a 5%-6% revenue exposure to the U.S., according to Morningstar estimates. The two companies could raise selling prices modestly and ramp up production in the U.S. to offset the tariff impact, Zhang adds. He expects the tariff hike to have a mid-single-digit impact on Midea's and Haier's earnings this year. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014570:0/",
            "pub_date": "2025-02-05 12:06:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014575:0",
            "title": "Indonesia 4Q GDP +5.02% On Year; Mkt Expected +4.89%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014575:0/",
            "pub_date": "2025-02-05 12:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014577:0",
            "title": "Indonesia 4Q GDP +0.53% On Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014577:0/",
            "pub_date": "2025-02-05 12:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575_20250204014578:0",
            "title": "Indonesia 2024 GDP +5.03%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575_20250204014578:0/",
            "pub_date": "2025-02-05 12:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0EU:0",
            "title": "BlackRock plans to hire 1,200 people in India, Bloomberg News reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blackrock  plans to hire nearly 1,200 people to expand two support hubs in India and build out its artificial intelligence (AI) capabilities in the country, Bloomberg News reported on Tuesday citing people familiar with the matter. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0EU:0-blackrock-plans-to-hire-1-200-people-in-india-bloomberg-news-reports/",
            "pub_date": "2025-02-05 12:09:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446663:0",
            "title": "China's 10-Year Bond Yield Stabilizes Post-Holiday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's 10-year government bond yield stabilized around 1.63% as the bond markets reopened following the Lunar New Year holidays.</p><p class=\"\">During the break, US President Donald Trump enacted a 10% tariff on all Chinese imports, effective February 4, 2025.</p><p class=\"\">In retaliation, China introduced additional tariffs of 15% on coal and LNG imports from the US and 10% on crude oil, farm equipment, and certain cars, starting February 10.</p><p class=\"\">Furthermore, China launched an anti-trust investigation into Google, escalating the trade conflict between the world's two largest economies.</p><p class=\"\">Investors are closely monitoring these developments, hoping for a swift strike of a trade agreement.</p><p class=\"\">On the economic front, a private survey revealed that China's composite PMI edged down to 51.1 in January 2025, from 51.4 in December 2024, marking its lowest reading since September.</p><p class=\"\">The slowdown was largely attributed to weaker growth in the services sector, even as manufacturing activity showed signs of strength.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446663:0-china-s-10-year-bond-yield-stabilizes-post-holiday/",
            "pub_date": "2025-02-05 12:09:20",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446664:0",
            "title": "Australia's 10-Year Bond Yield Falls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australia’s 10-year government bond yield dropped to around 4.41% amid growing expectations that the Reserve Bank of Australia will begin cutting interest rates later this month.</p><p class=\"\">Market pricing implies a 95% chance that the central bank will lower its 4.35% cash rate by 25bps when it meets on February 18.</p><p class=\"\">On the economic data front, final figures showed that Australia’s private sector activity continued to rise in January, with services activity growth reaching a five-month high and the manufacturing sector returning to expansion.</p><p class=\"\">Investors now await December's trade figures, due on Thursday, to gauge the health of the nation’s export-driven economy.</p><p class=\"\">Meanwhile, markets remain focused on developments in U.S.-China trade war.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446664:0-australia-s-10-year-bond-yield-falls/",
            "pub_date": "2025-02-05 12:10:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3NI03V:0",
            "title": "BOJ will keep raising rates if prices move as forecast, c.bank official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of Japan will continue to raise interest rates if underlying inflation accelerates toward its 2% target as projected, a senior central bank official said on Wednesday.</p><p class=\"\">\"Underlying inflation is heading toward 2% but still remains below that level now. As such, we must support economic activity with loose monetary policy,\" Kazuhiro Masaki, director-general of the BOJ's monetary affairs department, told parliament.</p><p class=\"\">\"Having said that, we will continue to raise interest rates and adjust the degree of monetary support, if underlying inflation accelerates toward 2% as we project,\" he said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3NI03V:0-boj-will-keep-raising-rates-if-prices-move-as-forecast-c-bank-official-says/",
            "pub_date": "2025-02-05 11:54:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463672:0",
            "title": "TA Corp. Appoints CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TA Corp.  appointed Chiang Yi Shin as chief financial officer, effective April 1, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">Shin will initially serve as the chief financial officer designate before assuming the role on a permanent basis following the resignation of Tam Siew Kheong who will relinquish the role effective April 1, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463672:0/",
            "pub_date": "2025-02-05 12:01:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0E9:0",
            "title": "Distressed-debt investors hold tense talks over KKR-owned car parts maker Marelli- FT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/3ptraj5f</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0E9:0-distressed-debt-investors-hold-tense-talks-over-kkr-owned-car-parts-maker-marelli-ft/",
            "pub_date": "2025-02-05 12:01:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014567:0",
            "title": "Singapore Dollar Steady Amid Caution Over U.S., China Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore dollar is steady against its U.S. counterpart in the Asian session amid caution over the latest tariffs from the U.S. and China. \"We are only at the beginning of the tariff saga,\" Maybank analysts say in an FX Research &amp; Treasury report. \"It would be wise to be slightly more cautious as there is a likely limit to how much the USD can weaken,\" the analysts say. USD/SGD is little changed at 1.3524. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014567:0/",
            "pub_date": "2025-02-05 12:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3NQ00A:0",
            "title": "Thailand to roll out next phase of digital wallet scheme in Q2, official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thailand's government will implement the third phase of its \"digital wallet\" handout scheme in the second quarter of the year, and will also discuss more stimulus measure this month, Deputy Finance Minister Julapun Amornvivat said on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3NQ00A:0-thailand-to-roll-out-next-phase-of-digital-wallet-scheme-in-q2-official-says/",
            "pub_date": "2025-02-05 11:54:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014542:0",
            "title": "New Steadfast Bull Sees Value Relative to Global Peers — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Insurance broker and underwriter Steadfast gets upgraded to buy from hold at Goldman Sachs, where analysts think that the Australian company looks cheap compared with global peers. They think that Steadfast will maintain its annual guidance despite moderation in commercial rates for small and medium enterprises. They see limited risk from strata reviews and reckon that Steadfast was tracking well through the first fiscal quarter, albeit performance looked to be acquisition led. Steadfast is trading at less than 18 times one-year forward earnings, which they write in a note is below mid-cycle multiples. GS keeps a A$6.50 target price on the stock. Shares are up 1.7% at A$5.795. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014542:0/",
            "pub_date": "2025-02-05 11:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014543:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0356 GMT - Insurance broker and underwriter Steadfast gets upgraded to buy from hold at Goldman Sachs, where analysts think that the Australian company looks cheap compared with global peers. They think that Steadfast will maintain its annual guidance despite moderation in commercial rates for small and medium enterprises. They see limited risk from strata reviews and reckon that Steadfast was tracking well through the first fiscal quarter, albeit performance looked to be acquisition led. Steadfast is trading at less than 18 times one-year forward earnings, which they write in a note is below mid-cycle multiples. GS keeps a A$6.50 target price on the stock. Shares are up 1.7% at A$5.795. (stuart.condie@wsj.com)</p><p class=\"\">0337 GMT - Inari Amertron's FY 2025-FY 2026 earnings my be pressured by weaker radio frequency revenue as handset sales slow down, CGS International analysts Shafiq Kadir and Dharmini Thuraisingam say in a note. Margin dilution from new packaging ventures could add pressure on earnings, they write, as CGS cuts its forecast for Inari's FY 2025-FY 2026 EPS by 19%-20%. However, margins may recover by FY 2026-FY 2027 with new businesses scaling up production, they add. CGS International lowers Inari's target price to MYR2.60 from MYR2.90, while maintaining a hold rating, citing near-term risks from a subdued automotive market and policy uncertainties under the Trump administration. Shares are 0.4% lower at MYR2.44. (yingxian.wong@wsj.com)</p><p class=\"\">0329 GMT - Pro Medicus's bulls at Goldman Sachs lift their earnings forecasts for the next two full fiscal years following the Australian imaging-tech provider's latest contract wins. The GS analysts make no change to their forecast of 38% earnings growth in the current 2025 fiscal year, but lift expectations by 2% for fiscal 2026 and by 4% for fiscal 2027. They tell clients in a note that they don't anticipate any guidance to be provided with the company's first-half result announcement, but do expect positive commentary on the strength of its contract pipeline. GS lifts its target price by 8.9% to A$310.00 and keeps a buy rating on the stock. Shares are up 1.25% at A$287.48. (stuart.condie@wsj.com)</p><p class=\"\">0318 GMT - Supermarket operator Woolworths is taking a step toward improved efficiency with its choice of bosses to lead its Australian and New Zealand retail units, Goldman Sachs analysts say in a note. They flag the Australia-listed company's belief that Annette Karantoni's knowledge of supply chains can deliver improvements in both organizational and operational efficiency at its domestic food business. They also think that Sally Copland looks well qualified to drive transformation initiatives in New Zealand due to her omni-channel and Australian experience. They add that the appointments provide investors with certainty on the shape of CEO Amanda Bardwell's leadership team. GS has a buy rating and A$36.10 target price on the stock, which is up 0.1% at A$29.79. (stuart.condie@wsj.com)</p><p class=\"\">0313 GMT - Sime Darby's turnaround in its China motors operations and potential divestment of noncore assets could accelerate its goal of achieving an 11% ROE over the next five years, CIMB Securities says in a note. That is higher than its ROE of 7.2% in FY 2024. Analyst Mohd Shanaz Noor Azam says the Malaysian conglomerate could optimize working capital, streamline its portfolio and improve cost efficiencies to help it reach the target. Its industrial division is well-positioned to benefit from the global energy transition and steady demand for rental and after-sales services, contributing to long-term growth, he adds. The stock remains attractive, with projected dividend yields of 6.9% in 2025 and 7.3% in 2026. CIMB maintains a buy rating and a target price of MYR3.00 on Sime Darby. Shares are 1.8% higher at MYR2.22. (yingxian.wong@wsj.com)</p><p class=\"\">0202 GMT - The Malaysian government's proposal for lower pension fund contributions for foreign workers appears positive for the plantation sector, RHB IB analyst Hoe Lee Leng and team say in a note. The government recently proposed a fixed 2% mandatory employees provident fund contribution, down from the initial 12% proposed last year, though the implementation date has yet to be set, they note. This should be a relief for planters, especially following the higher minimum wage policy introduced in February, they say. While these moves may have a slight negative impact on earnings amid higher costs, it is expected to be minimal, they add. RHB maintains an overweight rating on the Southeast Asian plantation sector, pegging Johor Plantations, Sarawak Oil Palms, Bumitama Agri, London Sumatra Indonesia and SD Guthrie as top picks. (yingxian.wong@wsj.com)</p><p class=\"\">0154 GMT - Hong Kong's Hang Seng Index falls 1.1% to 20553.22, weighed by consumer and auto stocks. Markets are keeping an eye on the influence of AI developments as well as developments relating to U.S. tariffs, given that Trump's policies have triggered market uncertainty, analysts at Nanhua Futures write in a note. Nongfu Spring falls 4.8%, Haidilao International loses 4.0% and Geely Automobile is 3.5% lower. Among advancers, Lenovo Group gains 3.4%, Orient Overseas (International) gains 2.0% and WH Group is 0.8% higher. (kimberley.kao@wsj.com)</p><p class=\"\">0152 GMT - Chinese shares are mixed in early trade, with the Shanghai Composite Index dropping 0.3% to 3240.74. The Shenzhen Composite Index is 0.35% higher and the ChiNext Price Index gains 0.4%. Investors are closely watching the latest tariff developments after China's retaliatory measures following President Trump's tariff hike. Technology companies are leading the gains with sentiment still positive about China's DeepSeek low-cost AI model. Beijing Kingsoft Office Software surges 16% and iFlytek is 8.3% higher. Decliners include Midea, which is down 2.5% and Yonghui Superstores, which is 4.2% lower. (tracy.qu@wsj.com)</p><p class=\"\">0141 GMT - Singapore's FTSE Straits Times Index could trend sideways in the near term, say DBS Group Research analysts in a note. The market's focus is on the domestic corporate results season and U.S. President Trump's next policy actions, they write. The upcoming Singapore budget later this month is unlikely to \"move the needle significantly\" for stocks on the benchmark index, the analysts say. Singapore's equity market performance also isn't expected to be influenced by the city-state's general election due later this year, they add. DBS maintains its STI year-end target of 3950. The STI is flat at 3824.04. (amanda.lee@wsj.com)</p><p class=\"\">0108 GMT - Singapore's FTSE Straits Times Index edges 0.2% higher to 3829.30, tracking Wall Street gains. The main theme overnight was relief in the markets after Trump's decision to pause tariffs on Canada and Mexico for 30 days, and China's cautious response to the tariffs, the Commerzbank research team writes in a note. This helped support sentiment and eased market concerns about an all-out tit-for-tat trade war, Commerzbank adds. Wilmar International rises 1.9%, Singapore Exchange adds 1.3% and Hongkong Land gains 1.3%. Meanwhile, Genting Singapore falls 1.3%, Venture Corp. sheds 0.8% and Seatrium loses 0.5%. (kimberley.kao@wsj.com)</p><p class=\"\">0107 GMT - Malaysia's benchmark Kuala Lumpur Composite Index is 0.1% higher at 1565.68. The local bourse may trade rangebound this week amid a lack of fresh catalysts and continued foreign fund outflows, Apex Securities says in a note. While global sentiment improved after the U.S. tariff pause for Mexico and Canada, volatility may remain high, keeping investors cautious, the brokerage reckons. Bargain hunting may support the construction sector, while hospital operators and REITs could attract defensive interest amid market uncertainty, it adds. Among gainers, YTL Corp. adds 1.1% and Tenaga Nasional is up 0.9%. Meanwhile, Telekom Malaysia and Sunway Bhd. are each 0.9% lower. (yingxian.wong@wsj.com)</p><p class=\"\">0059 GMT - Malaysian planters may post strong 4Q 2024 results, driven by higher upstream earnings from improved palm product prices, though downstream performance may remain weak, especially in refining, Hong Leong IB analyst Chye Wen Fei says in a note. Planters with greater upstream exposure in Indonesia should fare better due to better production, she reckons. Chye maintains her 2025-2026 CPO price assumptions at MYR4,000/ton and MYR3,800/ton, respectively, expecting elevated prices through 1Q amid weak output. Hong Leong maintains a neutral rating on Malaysian plantation sector as high CPO prices may not hold beyond 1Q. It has Johor Plantations, Hap Seng Plantations and IOI Corp. as its top picks. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014543:0/",
            "pub_date": "2025-02-05 11:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463673:0",
            "title": "Cyprium Metals Upgrades Western Australia Copper-Cobalt Project Resource Estimate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cyprium Metals  upgraded the mineral resource estimate for its wholly-owned Maroochydore copper-cobalt project in Western Australia, according to a Wednesday Australian bourse filing. </p><p class=\"\">The updated estimate includes inferred resources of 370.8 million tonnes at 0.4% grade of copper and 227 parts-per-million (ppm) grade of cobalt for 1.6 million tonnes contained copper and 84,000 tonnes contained cobalt. </p><p class=\"\">A higher-grade zone contained within the inferred resource contains 106.3 million tonnes at about 0.7% grade of copper and 308 ppm grade of cobalt for 712,000 tonnes contained copper and 33,000 tonnes contained cobalt. </p><p class=\"\">The mineral resource estimate is based on 1,299 drill holes for 110,379 meters of drilling information.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463673:0/",
            "pub_date": "2025-02-05 11:56:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX5qjxrg:0",
            "title": "Huachen AI Parking Management Technology Holding Co., Ltd Announces Pricing of Initial Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jiaxing, CHINA, Feb.  04, 2025  (GLOBE NEWSWIRE) — Huachen AI Parking Management Technology Holding Co., Ltd (the \"Company\") (Nasdaq: HCAI), a comprehensive smart parking solutions and equipment structural parts provider with all operations through the operating subsidiaries in China, today announced the pricing of its initial public offering (the \"Offering\") of 1,500,000 ordinary shares, par value $0.00000125 (the \"Ordinary Shares\") at a public offering price of $4.00 per share for total gross proceeds of $6 million before deducting underwriting discounts and offering expenses. The Ordinary Shares have been approved for listing on The Nasdaq Capital Market and are expected to commence trading on February 5, 2025, under the ticker symbol \"HCAI.\" The Offering is expected to close on or about February 6, 2025, subject to the satisfaction of customary closing conditions.</p><p class=\"\">The Company has granted the underwriters an option, exercisable within 45 days from the closing of the Offering, to purchase up to an additional 225,000 Ordinary Shares at the public offering price, less underwriting discounts and commissions, to cover over-allotment, if any, representing 15% of the Ordinary Shares sold in the Offering.</p><p class=\"\">The Company intends to use the proceeds from this Offering primarily for (i) contracting the managerial and operational rights of a new parking lot, (ii) product research and development, (iii) recruitment of specialized technical and operational personnel, and (iv) Working capital and general corporate matters.</p><p class=\"\">The Offering is being conducted on a firm commitment basis. Benjamin Securities, Inc. and D. Boral Capital LLC are acting as underwriters for the Offering (the “Underwriters”). Ortoli Rosenstadt LLP is acting as U.S. securities counsel to the Company. Sichenzia Ross Ference Carmel LLP is acting as legal counsel to the Underwriters in connection with the Offering.</p><p class=\"\">The Offering is being conducted pursuant to the Company’s registration statement on Form F-1 (File No. 333-281543), as amended, in connection with the Offering (the “Registration Statement”) previously filed with the Securities and Exchange Commission (\"SEC\") and subsequently declared effective by the SEC on February 4, 2025. The Offering is being made only by means of a prospectus. You may get these documents for free by visiting EDGAR on the SEC Web site at www.sec.gov. Alternatively, copies of the prospectus relating to the Offering may be obtained, when available, from Benjamin Securities, Inc. by email at info@benjaminsecurities.com, by standard mail to 3 West Garden Street, Suite 407, Pensacola, FL 32502, or by telephone at +1 (516) 931-1090; or from D. Boral Capital LLC by standard mail to D. Boral Capital LLC, 590 Madison Ave 39th Floor, New York, NY 10022, or by email at info@dboralcapital.com, or by telephone at +1(212)-970-5150.</p><p class=\"\">Before you invest, you should read the prospectus and other documents the Company has filed or will file with the SEC for more information about the Company and the Offering. This press release shall not constitute an offer to sell or the solicitation of an offer to buy the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</p><p class=\"\">About Huachen AI Parking Management Technology Holding Co., Ltd</p><p class=\"\">Huachen AI Parking Management Technology Holding Co., Ltd is a Cayman Islands holding company with no operation on its own. The Company consolidates the financial results of its subsidiaries. We are a comprehensive smart parking solutions and equipment structural parts provider and conduct all our operations through our operating subsidiaries in China. The operating subsidiaries provide customized parking solutions to optimize efficiency in limited parking spaces, covering smart cubic parking garage design, cubic parking equipment manufacturing, sales, installation, and maintenance. To cater the customers’different parking needs, we manufacture and offer various cubic parking garage products by employing various working principles, such as lifting and shifting, convenient lifting, vertical circulation, vertical lifting, plane moving, alley stacking, multi-layer cycle, horizontal cycle, and car lift. Moreover, the operating subsidiaries offer design, repair, and maintenance services to ensure the continued functionality of our parking solutions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statement</strong></p><p class=\"\">This press release contains forward-looking statements. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements that are other than statements of historical facts. When the Company uses words such as \"may,” \"will,” \"intend,\" \"should,\" \"believe,\" \"expect,\" \"anticipate,\" \"project,\" \"estimate,\" “continue” or similar expressions that do not relate solely to historical matters, it is making forward-looking statements. These forward-looking statements include, without limitation, the Company's statements regarding the expected trading of its Ordinary Shares on the Nasdaq Capital Market and the closing of the Offering. Forward-looking statements are not guarantees of future performance and involve risks and uncertainties that may cause the actual results to differ materially from the Company's expectations discussed in the forward-looking statements. These statements are subject to uncertainties and risks including, but not limited to, the uncertainties related to market conditions and the completion of the initial public offering on the anticipated terms or at all, and other factors discussed in the “Risk Factors” section of the Registration Statement filed with the SEC. For these reasons, among others, investors are cautioned not to place undue reliance upon any forward-looking statements in this press release. Additional factors are discussed in the Company's filings with the SEC, which are available for review at www.sec.gov. The Company undertakes no obligation to publicly revise these forward-looking statements to reflect events or circumstances that arise after the date hereof.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company Info:</strong></p><p class=\"\">Huachen AI Parking Management Technology Holding Co., Ltd</p><p class=\"\">Alan Li</p><p class=\"\">Email: ir@huachenai.com</p><p class=\"\">Mobile: +852-95791074</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX5qjxrg:0-huachen-ai-parking-management-technology-holding-co-ltd-announces-pricing-of-initial-public-offering/",
            "pub_date": "2025-02-05 11:57:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW054:0",
            "title": "Asian currencies subdued as US-China trade war dents sentiment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Chinese yuan trades 0.6% lower after week-long holiday</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Malaysian equities post biggest intraday gain since Jan 24</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Taiwan stocks up 1.7%</li></ul></span></div><span><p class=\"\">    Most currencies in Asian emerging markets were subdued on Wednesday, as escalating trade tensions between the U.S. and China kept investors cautious about risk in developing nations.</p><p class=\"\">The Singapore dollar  and Thai baht  were both trading unchanged against the greenback, while the South Korean won  edged 0.2% higher.</p><p class=\"\">A brief period of market calm, supported by the reprieve of tariffs on Canada and Mexico, was promptly disrupted as traders were jolted by China's announcement of retaliatory tariffs against the U.S. on Tuesday, signalling the first shots in the global trade war.  </p><p class=\"\">\"I think investors should remain nimble and keep cash on the sidelines,\" said Jessica Amir, market strategist at trading platform Moomoo Australia.</p><p class=\"\">Amir anticipates more threats and tariff changes ahead, expecting higher market volatility this year, which she views as a potential buying opportunity for certain assets.</p><p class=\"\">The Chinese onshore yuan  began trading on Wednesday after a week-long holiday, and was the top loser in the region with a 0.6% drop. </p><p class=\"\">The Philippines posted an annual inflation rate of 2.9% in January, above the median Reuters poll forecast of 2.7%, driven by higher prices of food and energy drinks.</p><p class=\"\">\"Bangko Sentral ng Pilipinas (BSP) will cut policy rates further as inflation may stay within its target of 2%-4%,\" said Jeff Ng, head of Asia macro strategy, Sumitomo Mitsui Banking Corporation. </p><p class=\"\">The peso  dropped 0.2% as the country braces for a potential 25-basis-point rate cut following the central bank's Feb. 13 policy meeting.</p><p class=\"\">Stock markets in emerging Asia were mostly trading in black, with shares in Manila  adding nearly 2% and set for a third consecutive day of gains. The Philippine's benchmark index has gained about 5.6% so far this week. </p><p class=\"\">Equities in Kuala Lumpur  gained 0.7%, marking their biggest intraday gain since Jan. 24, driven by strong performance from construction giant Gamuda .</p><p class=\"\">     Malaysia's index has \"shown a strong recovery in the construction sector, but caution remains as the rebound could be a false breakout following the recent sharp correction,\" Maybank analysts said.</p><p class=\"\">Shares in Taipei <!-- -->TWSE:TAIEX<!-- --> and Seoul  added 1.7% and 1.1%, respectively.</p><p class=\"\">South Korean shares rallied as e-commerce firms gained on hopes around artificial intelligence. </p><p class=\"\">     The country's consumer inflation accelerated to a six-month high in January, surpassing market expectations due to pressure from a weakened local currency.     </p><p class=\"\">HIGHLIGHTS:    </p><p class=\"\">** South Korea inflation accelerates to six-month high</p><p class=\"\">** Philippine annual inflation at 2.9% in Jan</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Asian stocks and currencies as of 0255 GMT</p></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">COUNTRY</p></td><td><p class=\"\">FX RIC</p></td><td><p class=\"\">FX DAILY %</p></td><td><p class=\"\">FX YTD %</p></td><td><p class=\"\">INDEX</p></td><td><p class=\"\">STOCKS DAILY %</p></td><td><p class=\"\">STOCKS YTD %</p></td></tr><tr><td><p class=\"\">Japan</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.61</p></td><td><p class=\"\">+2.47</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.18</p></td><td><p class=\"\">-1.48</p></td></tr><tr><td><p class=\"\">China</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.63</p></td><td><p class=\"\">+0.22</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.45</p></td><td><p class=\"\">-3.45</p></td></tr><tr><td><p class=\"\">India</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.00</p></td><td><p class=\"\">-1.67</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.00</p></td><td><p class=\"\">0.40</p></td></tr><tr><td><p class=\"\">Indonesia</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.25</p></td><td><p class=\"\">-1.29</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.53</p></td><td><p class=\"\">-0.62</p></td></tr><tr><td><p class=\"\">Malaysia</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.52</p></td><td><p class=\"\">+1.15</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.69</p></td><td><p class=\"\">-4.08</p></td></tr><tr><td><p class=\"\">Philippines</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.21</p></td><td><p class=\"\">-0.08</p></td><td><p class=\"\"></p></td><td><p class=\"\">1.75</p></td><td><p class=\"\">-5.10</p></td></tr><tr><td><p class=\"\">S.Korea</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.21</p></td><td><p class=\"\">+1.65</p></td><td><p class=\"\"></p></td><td><p class=\"\">1.12</p></td><td><p class=\"\">4.59</p></td></tr><tr><td><p class=\"\">Singapore</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.01</p></td><td><p class=\"\">+1.01</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.15</p></td><td><p class=\"\">0.78</p></td></tr><tr><td><p class=\"\">Taiwan</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.30</p></td><td><p class=\"\">-0.32</p></td><td><p class=\"\">TWSE:TAIEX</p></td><td><p class=\"\">1.74</p></td><td><p class=\"\">0.67</p></td></tr><tr><td><p class=\"\">Thailand</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.09</p></td><td><p class=\"\">+1.90</p></td><td><p class=\"\"></p></td><td><p class=\"\">-100.00</p></td><td><p class=\"\">-100.00</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW054:0-asian-currencies-subdued-as-us-china-trade-war-dents-sentiment/",
            "pub_date": "2025-02-05 11:58:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}