{
    "data": [
        {
            "id": "DJN_DN20250204005975:0",
            "title": "Hubbell Files 8K - Operations And Financial Condition >HUBB",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hubbell Inc. (HUBB) filed a Form 8K - Operations and Financial Condition - with the U.S Securities and Exchange Commission on February 04, 2025.</p><p class=\"\">On February 4, 2025, Hubbell Incorporated (the \"Company\") issued a press release announcing results for the fourth quarter and full year ended December 31, 2024.</p><p class=\"\">The full text of the press release issued in connection with the announcement is furnished as Exhibit 99.1 to this Current Report on Form 8-K and hereby incorporated in this Item 2.02 by reference. The information in this Item 2.02, including Exhibit 99.1 attached hereto, shall not be deemed \"filed\" for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, nor shall it be deemed incorporated by reference in any filing under the Securities Act of 1933, as amended, except as shall be expressly set forth by specific reference in such filing.</p><p class=\"\">INFORMATION CONCERNING FORWARD-LOOKING STATEMENTS — Certain of the statements contained in this report and the exhibit attached hereto, including, without limitation, statements as to management's good faith expectations and belief are forward-looking statements. Forward-looking statements are made based upon management's expectations and belief concerning future developments and their potential effect upon the Company. There can be no assurance that future developments will be in accordance with management's expectations or that the effect of future developments on the Company will be those anticipated by management. Investors should consider this cautionary statement as well as the \"Risk Factors\" and other factors described in our periodic reports filed with the Securities and Exchange Commission when evaluating our forward-looking statements.</p><p class=\"\">The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/48898/000162828025003586/hubb-20250204.htm</p><p class=\"\">Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/48898/000162828025003586/0001628280-25-003586-index.htm</p><p class=\"\">Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005975:0/",
            "pub_date": "2025-02-04 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005958_20250204005971:0",
            "title": "Greenwave Tech Solutions Raises FY25 View To Rev $47M-$50M >GWAV",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005958_20250204005971:0/",
            "pub_date": "2025-02-04 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005969:0",
            "title": "Estée Lauder to Cut Up to 7,000 Jobs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dean Seal</p><p class=\"\">Estée Lauder said it now expects to cut between 5,800 and 7,000 positions as part of its two-year restructuring plan.</p><p class=\"\">The beauty company said Tuesday that it is expanding the restructuring effort and now forecasts $1.2 billion to $1.6 billion in pretax charges tied to employee-related costs, contract terminations, asset write-offs and other expenses.</p><p class=\"\">In December, Estée Lauder pegged the restructuring plan's total costs at $500 million to $700 million pretax.</p><p class=\"\">Shares fell 7.6% to $76.50 in premarket trading.</p><p class=\"\">The overhaul is expected to yield $800 million to $1 billion, before taxes, in annual benefits, which should help restore operating margins and be reinvested in consumer-facing areas, the company said.</p><p class=\"\">Estée Lauder launched the restructuring in November 2023 with a goal of expanding margins in 2025 and 2026 by focusing on profitability, lower costs and accelerating sales growth.</p><p class=\"\">The job cuts figure was delivered on Tuesday alongside the New York-based company's latest quarterly report, which showed it swinging to a loss in the last three months of 2024 on a 6% drop in revenue.</p><p class=\"\">Write to Dean Seal at dean.seal@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005969:0/",
            "pub_date": "2025-02-04 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005972:0",
            "title": "Church & Dwight Is Maintained at Underweight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:08 GMT) </strong>Church &amp; Dwight Price Target Raised to $93.00/Share From $90.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005972:0/",
            "pub_date": "2025-02-04 21:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446560:0",
            "title": "US Futures Lack Direction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Stock futures in the US swung between small gains and losses on Tuesday as traders continue to follow the trade war while digesting fresh corporate results.</p><p class=\"\">The 10% US tariffs on Chinese imports took effect today, prompting an immediate response from Beijing, which imposed retaliatory tariffs on select US exports including oil and gas.</p><p class=\"\">However, markets remain cautiously optimistic as President Trump and President Xi are expected to discuss the situation, raising hopes that further escalation could be avoided and tariffs might be reversed.</p><p class=\"\">Meanwhile, Alphabet is due to report quarterly results today after the closing bell.</p><p class=\"\">Shares of Merck sank about 8% in premarket trading after the company's 2025 sales guidance disappointed.</p><p class=\"\">Also, PepsiCo lost more than 2% after a revenue miss.</p><p class=\"\">On the other hand, Palantir Technologies soared more than 22% after the company strong guidance and sales forecast and Pfizer gained about 2% in premarket hours after its earnings and revenue topped forecasts.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446560:0-us-futures-lack-direction/",
            "pub_date": "2025-02-04 21:08:20",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308793:0",
            "title": "CFIB Comments on The Pause in Canada-U.S. Trade Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Monday's announcement of a pause in the use of tariffs in Canada-United States trade is a welcome relief for small businesses, said the Canadian Federation of Independent Business (CFIB). </p><p class=\"\">However, as the threat of tariffs continues to loom, the ongoing uncertainty will make it challenging for small business owners to plan and make decisions around their operations, noted CFIB. </p><p class=\"\">While Canada catches its breath and implements the border measures, CFIB stated it can't afford to take its eyes off the many other critical changes needed to prepare for the future. </p><p class=\"\">This means Canada needs to seize the opportunity now to bring in policies that improve its investment climate, reduce taxes, slash red tape and break down internal trade barriers to ensure businesses are prepared no matter what external threats comes along, it added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308793:0/",
            "pub_date": "2025-02-04 21:08:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005675_20250204005986:0",
            "title": "Pulse Biosciences: Skinner Was VP, FP&A and Investor Relations at Copeland, Private Equity-Backed Industrial Co >PLSE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005675_20250204005986:0/",
            "pub_date": "2025-02-04 21:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005958_20250204005991:0",
            "title": "Greenwave Tech Solutions: Outlook Bump Follows Trump's Announcement of Tariffs on Steel, Aluminum, Copper Imports >GWAV",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005958_20250204005991:0/",
            "pub_date": "2025-02-04 21:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Nvidia, Super Micro, Merck, PayPal, Spotify, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stock futures declined Tuesday as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were poised to make moves Tuesday:</p><p class=\"\">Palantir Technologies soared 20% in premarket trading after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla was up 0.2% in premarket trading after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in the U.S. but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were rising 0.5%. Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 7% in premarket trading. The maker of AI servers said it would be providing a fiscal second-quarter \" business update\" on Feb. 11. The  Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">PepsiCo posted fourth-quarter adjusted earnings of $1.96 a share, beating analysts' estimates of $1.94 but the stock fell 1.8% after revenue declined 0.2% from a year earlier to $27.78 billion and missed expectations of $27.89 billion. Shares fell 2.7%.</p><p class=\"\">Shares of Spotify Technology jumped 11% after the audio-streaming company added more premium subscribers in the fourth quarter than Wall Street expected, helping revenue top estimates.</p><p class=\"\">Merck was falling 6.8% after the drug maker reported fourth-quarter adjusted earnings that beat analysts' estimates but issued guidance for f2025 that missed expectations. Merck said it expects 2025 adjusted earnings of $8.88 to $9.03 a share, below consensus of $9.21.</p><p class=\"\">Pfizer was up 1.2% after fourth-quarter adjusted earnings of 63 cents a share topped analysts' forecasts of 46 cents.</p><p class=\"\">Semiconductor design company Synaptics fell 5% after announcing CEO Michael Hurlston would be stepping down to become chief executive and president of Lumentum, the maker of products for cloud and AI applications. Lumentum shares rose 1.7%.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 1.3% in premarket trading.</p><p class=\"\">Additional earnings reports are expected Tuesday from Alphabet, Advanced Micro Devices, Chipotle Mexican Grill,  PayPal Holdings, and Amgen.</p><p class=\"\">Alphabet rose 0.6% in premarket trading ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-04 21:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006001:0",
            "title": "Fabrinet Is Maintained at Equal-Weight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:10 GMT) </strong>Fabrinet Price Target Cut to $245.00/Share From $292.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006001:0/",
            "pub_date": "2025-02-04 21:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308773:0",
            "title": "Allegion Buys Next Door",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Allegion  said Tuesday that it had acquired Next Door, a maker of stainless steel and hollow metal doors. </p><p class=\"\">Financial terms for the acquisition were not provided.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308773:0/",
            "pub_date": "2025-02-04 21:10:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308698:0",
            "title": "Xtract One Technologies Partners with New Distributor Velasea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Xtract One Technologies  said Monday it is bringing its threat detection and security solutions to Velasea, a full-service original equipment distributor of physical security, retail analytics, computer vision, and artificial intelligence solutions. </p><p class=\"\">The two companies will jointly market and sell Xtract One's products to the broader marketplace and through Velasea's more than 900 partners. </p><p class=\"\">\"By offering our security solutions in partnership with Velasea, we can provide more organizations with the advanced security they require, at a much larger scale, all while enabling individuals to feel the difference our solutions are designed to make in enhancing safety, and overall experience,\" said Peter Evans, CEO of Xtract One.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308698:0/",
            "pub_date": "2025-02-04 21:10:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308760:0",
            "title": "Ingredion Plans to Invest $100 Million in Indianapolis Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ingredion  said Tuesday it is investing over $100 million to modernize equipment, increase efficiency, and install an energy cogeneration system at its Indianapolis facility. </p><p class=\"\">The investment project aims to expand texture business capabilities, enhance operational efficiency, and reduce greenhouse gas emissions. </p><p class=\"\">The upgrades are expected to be completed in H2 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308760:0/",
            "pub_date": "2025-02-04 21:10:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV16S:0",
            "title": "United Airlines to restart services to Israel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Airlines  said on Tuesday it will restart its services to Tel Aviv, Israel on March 15.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV16S:0-united-airlines-to-restart-services-to-israel/",
            "pub_date": "2025-02-04 21:04:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC87S5XG:0",
            "title": "Volati Buys Clever Etiketten GmbH In Germany",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volati AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">VOLATI ACQUIRES CLEVER ETIKETTEN GMBH IN GERMANY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLEVER GENERATED REVENUES OF ABOUT SEK 290 MILLION IN 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUISITION IS FINANCED VIA VOLATI’S EXISTING CREDIT FACILITIES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC87S5XG:0-volati-buys-clever-etiketten-gmbh-in-germany/",
            "pub_date": "2025-02-04 21:04:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308780:0",
            "title": "Earnings Flash (FOX) Fox Posts Fiscal Q2 Revenue $5.08 Billion, vs. FactSet Est of $4.87 Billion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308780:0/",
            "pub_date": "2025-02-04 21:04:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308771:0",
            "title": "IES Holdings Fiscal Q1 Adjusted Earnings, Revenue Increase",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings  reported fiscal Q1 adjusted earnings Tuesday of $2.64 per diluted share, up from $1.86 a year earlier. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $749.5 million, up from $634.4 million a year earlier. </p><p class=\"\">Comparable analyst estimates were not readily available.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308771:0/",
            "pub_date": "2025-02-04 21:04:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308785:0",
            "title": "Wells Fargo Adjusts Hilton Worldwide Price Target to $240 From $232, Maintains Equal Weight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hilton Worldwide Holdings  has an average rating of overweight and mean price target of $250.83, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308785:0/",
            "pub_date": "2025-02-04 21:04:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNEJCyG1:0",
            "title": "Rackspace Technology Teams Up with Munster Technological University to Launch Ireland’s First Quantum Cloud Platform on AWS, Advancing Collaborative Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">QCloud Connects 13 Research Institutes and Fuels 11 Major Quantum Computing Projects to Transform Ireland’s Quantum Research Landscape</p><p class=\"\">SAN ANTONIO, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Rackspace Technology® </strong>, a leading provider of hybrid, multicloud, and AI technology solutions, today announced, working with Munster Technological University (MTU) to unveil QCloud, Ireland's first quantum cloud computing hub on Amazon Web Services (AWS). This groundbreaking initiative aims to enhance collaborative research and remove barriers to accessing cutting-edge quantum computing technologies.</p><p class=\"\">Established in 2021, MTU operates across six campuses in southwestern Ireland and is at the forefront of national cybersecurity initiatives within the European Union. QCloud was developed due to MTU’s commitment to democratizing access to quantum resources, enabling secure and scalable connectivity to genuine quantum computing power for researchers throughout Ireland. MTU partnered with Rackspace Technology on the project due to its expertise in navigating the European Open Science Cloud (EOSC) Future project, which encourages collaboration between commercial service providers and researchers.</p><p class=\"\">“Rackspace collaborated with MTU to secure essential funding to launch QCloud, enhancing research opportunities across the region,” said D K Sinha, Rackspace Technology, President Public Cloud. “We are proud of this accomplishment because, through QCloud, MTU has established Ireland as a quantum research hub, democratizing access to cutting-edge quantum computing resources and fostering the next generation of quantum innovation.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>QCloud Implementation</em></strong></p><p class=\"\">Following a successful proposal process facilitated by Rackspace, MTU launched QCloud in February 2024 with funding from the EOSC Future project. This innovative platform provides centralized access to quantum computing resources for researchers, facilitating groundbreaking work in various fields, including autonomous systems security. Through QCloud, MTU establishes Ireland as a key player in the quantum research ecosystem, fostering innovation and democratizing access to quantum computing resources.</p><p class=\"\">Collaboration between MTU, Rackspace Technology, and AWS resulted in a comprehensive quantum research environment that includes:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A centralized platform providing quantum computing access to eight universities and 13 research institutes</li><li class=\"listItem-bmN0_SHH\">AWS Control Tower landing zone with Account Factory for streamlined project management</li><li class=\"listItem-bmN0_SHH\">Custom quantum cost control dashboard for Amazon Braket using Amazon Identity and Access Management (IAM), AWS Cloud Development Kit (CDK), Amazon EventBridge and Amazon CloudWatch</li><li class=\"listItem-bmN0_SHH\">Real-time cost tracking with automated budget alerts and management systems</li></ul><p class=\"\">“Rackspace's collaboration was essential for establishing the QCloud infrastructure. Their expertise in AWS technologies was invaluable throughout this process,” said Dr. Anila Mjeda, Cybersecurity Lecturer at MTU. “QCloud opens doors for researchers to explore advanced applications while managing costs effectively, allowing for real-time monitoring and budget management. With QCloud, researchers can leverage actual quantum computers, moving beyond traditional simulators that fall short in accounting for real-world factors like quantum noise.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>QCloud Impact and Vision </em></strong></p><p class=\"\">Since its inception, QCloud has connected multiple institutions, supporting 12 startups and 11 major research projects. The platform marks a significant shift in Ireland's quantum research landscape, empowering universities to provide hands-on experiences with quantum computing.</p><p class=\"\">\"In classical computing, information is stored in binary code, represented by ones and zeroes,\" said Dr. Hazel Murray, Ph.D., Cybersecurity Lecturer and QCloud Project Lead at MTU. \"Quantum computing, however, leverages quantum particles, where information is encoded in the quantum states of electrons or photons, for instance. This enables exponentially greater flexibility in data representation, unlocking the potential to store and analyze information beyond the limitations of classical systems.\"</p><p class=\"\">The university expects to double its research projects in the coming year and welcomes new participants. \"This is a remarkable time for innovation in quantum computing. We’re finally seeing ideas evolve into commercial and societally beneficial products while exploring new possibilities,\" added Murray.</p><p class=\"\">For additional in-depth details on the groundbreaking Munster Technology University QCloud initiative, click to read the entire case study and view the video.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Rackspace Technology </strong> </p><p class=\"\">Rackspace Technology is a leading end-to-end, hybrid, multicloud, and AI solutions company. We can design, build, and operate our customers' cloud environments across all major technology platforms, irrespective of technology stack or deployment model. We partner with our customers at every stage of their cloud journey, enabling them to modernize applications, build new products, and adopt innovative technologies.  </p><p class=\"\">Media Contact: Natalie Silva, publicrelations@rackspace.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNEJCyG1:0-rackspace-technology-teams-up-with-munster-technological-university-to-launch-ireland-s-first-quantum-cloud-platform-on-aws-advancing-collaborative-research/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005915:0",
            "title": "Quantum to Release Fiscal Third Quarter 2025 Financial Results on Wednesday, February 12, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quantum to Release Fiscal Third Quarter 2025 Financial Results on Wednesday, February 12, 2025</p><p class=\"\">SAN JOSE, Calif.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Quantum(R) Corporation  (\"Quantum\" or the \"Company\"), a leader in solutions for AI and unstructured data, today announced it will release financial results for its fiscal third quarter 2025 on Wednesday, February 12, 2025, after the markets close.</p><p class=\"\">Jamie Lerner, Chairman and Chief Executive Officer, and Kenneth Gianella, Chief Financial Officer and Chief Operating Officer, will host a conference call at 5:00 p.m. Eastern Time (2:00 p.m. Pacific Time) to discuss the Company's financial results.</p><p class=\"\">Analysts and investors are invited to join the conference call using the following information:</p><p class=\"\">Date: Wednesday, February 12, 2025</p><p class=\"\">Time: 5:00 p.m. ET (2:00 p.m. PT)</p><p class=\"\">Conference Call Number: 1-866-424-3436</p><p class=\"\">International Call Number: +1-201-689-8058</p><p class=\"\">Conference ID: 13751306</p><p class=\"\">Webcast link (listen only) and presentation slides: Click Here</p><p class=\"\">A telephone replay of the conference call will be available approximately two hours after the conference call and will be available through February 26, 2025. To access the replay dial 1-877-660-6853 and enter the conference ID 13751306 at the prompt. International callers should dial +1-201-612-7415 and enter the same conference ID. Following the conclusion of the live call, a replay of the webcast will be available on the Company's website for at least 90 days.</p><p class=\"\">About Quantum</p><p class=\"\">Quantum delivers end-to-end data management solutions designed for the AI era. With over four decades of experience, our data platform has allowed customers to extract the maximum value from their unique, unstructured data. From high-performance ingest that powers AI applications and demanding data-intensive workloads, to massive, durable data lakes to fuel AI models, Quantum delivers the most comprehensive and cost-efficient solutions. Leading organizations in life sciences, government, media and entertainment, research, and industrial technology trust Quantum with their most valuable asset — their data. Quantum is listed on Nasdaq (QMCO). For more information visit www.quantum.com.</p><p class=\"\">Quantum and the Quantum logo are registered trademarks of Quantum Corporation and its affiliates in the United States and/or other countries.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250203319767/en/</p><p class=\"\">CONTACT:    Investor Relations Contact:</p><p class=\"\">Shelton Group</p><p class=\"\">Leanne K. Sievers | Brett Perry</p><p class=\"\">E: sheltonir@sheltongroup.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005915:0/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6bd9ddb733aab:0",
            "title": "Mesa Labs Announces Third Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mesa Laboratories, Inc., a global leader in the design and manufacture of life science tools and critical quality control solutions, has released its financial results for the third fiscal quarter ended December 31, 2024. The company reported significant growth in revenues and operating income, alongside strategic initiatives aimed at reducing debt and enhancing profitability.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the third quarter of fiscal year 2025, Mesa Labs reported a 17.5% increase in revenues compared to the same period in the previous year, reaching $62.84 million. Operating income saw a substantial rise of 8,725% to $5.779 million. However, the company recorded a net loss of $1.676 million, primarily due to unrealized foreign currency losses and interest expenses. On a non-GAAP basis, core organic revenues grew by 13.2%, and adjusted operating income (AOI) excluding unusual items increased by 13.3%.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Mesa Labs operates in four divisions: Sterilization and Disinfection Control (SDC), Clinical Genomics (CG), Biopharmaceutical Development (BPD), and Calibration Solutions (CS). Each division contributed to the overall growth, with notable performances in the Calibration Solutions and Biopharmaceutical Development segments. The acquisition of GKE, completed in December 2023, also played a significant role in driving revenue growth.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">During the third quarter, Mesa Labs repaid $9.4 million in debt, reducing its total Net Leverage Ratio to 3.20. The company aims to bring this ratio below 3.0x by the end of the second quarter of fiscal year 2026. The acquisition of GKE has exceeded initial revenue and profitability expectations, contributing positively to the company's financial performance.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Gary Owens, Chief Executive Officer of Mesa Labs, highlighted the company's strong performance across all divisions, with sequential and year-over-year growth in revenues, orders, and AOI. Owens emphasized the company's commitment to reducing debt and adapting to potential market shifts, including changes in U.S. policies and economic conditions in Europe.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead, Mesa Labs anticipates continued year-over-year core revenue growth in the fourth quarter of fiscal year 2025. The company remains focused on strategic initiatives and is prepared to adapt to new policies and market conditions, including the appreciation of the U.S. dollar and rising recession risks in Europe.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/724004/000143774925002661/mlab20250203_8k.htm\" rel=\"nofollow\" target=\"_blank\">MESA LABORATORIES INC /CO/ [ MLAB ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6bd9ddb733aab:0-mesa-labs-announces-third-quarter-results/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6f6c679c13b08:0",
            "title": "Madison Square Garden Sports Corp. Reports Fiscal 2025 Second Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Madison Square Garden Sports Corp. has released its financial results for the fiscal second quarter ending December 31, 2024. The company, which owns and operates the New York Knicks and New York Rangers, reported a notable increase in revenues driven by strong demand and additional home games.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fiscal 2025 second quarter, MSG Sports reported revenues of $357.8 million, marking a 9% increase from the prior year period. Despite this revenue growth, operating income decreased by 54% to $13.3 million, and adjusted operating income fell by 45% to $20.2 million. The decline in operating income was primarily due to increased direct operating expenses and higher selling, general, and administrative expenses.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The New York Knicks and New York Rangers began their 2024-25 regular seasons, playing three more games at Madison Square Garden compared to the previous year. This contributed to higher ticket-related revenues, suite revenues, sponsorship and signage revenues, and food, beverage, and merchandise sales. Additionally, local media rights fees saw an increase due to contractual rate hikes.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">During the quarter, MSG Sports experienced higher team personnel compensation and increased provisions for league revenue sharing expenses and NBA luxury tax. The company also reported higher operating lease costs and professional fees, partially offset by lower employee compensation and related benefits.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">James L. Dolan, Executive Chairman and CEO, commented, \"In the fiscal second quarter, fan enthusiasm and robust corporate demand helped drive growth in per-game revenues across all key areas of our business. We remain confident in the fundamentals of our business and our ability to drive long-term shareholder value.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">While the company did not provide specific forward-looking statements in this report, the management's confidence in the business fundamentals suggests a positive outlook for the upcoming periods. Investors are advised to monitor future filings for more detailed guidance and projections.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1636519/000163651925000004/msgs-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Madison Square Garden Sports Corp. [ MSGS ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6f6c679c13b08:0-madison-square-garden-sports-corp-reports-fiscal-2025-second-quarter-results/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7g1vdb:0",
            "title": "IO Biotech Announces Publication of Preclinical Data Investigating Immune-Modulatory Effects of IO112, an Arginase 1-Targeting Therapeutic Cancer Vaccine Candidate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"> – Submission of Investigational New Drug Application (IND) to US FDA expected in 2025 – </p><p class=\"\">NEW YORK, Feb.  04, 2025  (GLOBE NEWSWIRE) — IO Biotech , a clinical-stage biopharmaceutical company developing novel, immune-modulatory, off-the-shelf therapeutic cancer vaccines, today announced the publication of results from a preclinical study of its second immune-modulatory therapeutic cancer vaccine candidate, IO112, targeting arginase 1 (Arg1), in the Journal for ImmunoTherapy of Cancer.</p><p class=\"\">These preclinical data further expand upon previously reported data that IO112 treatment inhibits tumor growth through dynamic changes in the tumor microenvironment (TME). The present study showed how Arg1-specific T cells expanded by the vaccine enhance anti-tumor immunity by reprogramming tumor-associated macrophages (TAMs) and promote a proinflammatory TME. Arg1 plays a central role in immune suppression, and its overexpression has been reported in several cancers.</p><p class=\"\">“Arg1-expressing TAMs remain a major hurdle in cancer immunotherapy due to their role in creating an immunosuppressive TME,” said Ayako Wakatsuki Pedersen, PhD, Senior Vice President of Translational Research at IO Biotech. “TAMs represent one of the most abundant immune cell subsets found within the TME and it’s really exciting to learn that IO112 treatment directly impacts TAMs, changing the phenotype of TAMs completely. These findings further support the continued clinical development of Arg1-based immune-modulatory vaccines.”</p><p class=\"\">“These data published in the <em>Journal of ImmunoTherapy of Cancer</em> add to the strong body of evidence that the unique approach of our T-win® platform, designed to kill both tumor cells and immune-suppressive cells in the TME, could potentially change the treatment paradigm in the management of a number of cancers,” said Mai-Britt Zocca, Ph.D., President and CEO of IO Biotech. “We look forward to submitting an IND for IO112 in 2025 and advancing into clinical development as part of our commitment to transform the treatment of cancer patients.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IO112</strong></p><p class=\"\">IO112 is the company’s fully-owned, novel investigational product candidate containing a single Arginase 1-derived peptide designed to engage and activate Arginase 1-specific human T cells. IO112 is designed to target T cells that recognize epitopes derived from Arginase 1, which is an immunoregulatory enzyme highly expressed in difficult-to-treat tumors associated with high levels of myeloid-derived suppressor cells (MDSCs) including renal cell carcinoma, head and neck, breast, pancreatic, ovarian, colorectal and prostate cancers. Arginase overexpression is a well-documented tumor escape mechanism. IO112 has been studied in a single arm first-in-human Phase 1 trial in patients with arginase-positive solid tumors, conducted in an investigator-initiated trial at the University of Copenhagen. The company anticipates filing an IND for IO112 in 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IO Biotech</strong></p><p class=\"\">IO Biotech is a clinical-stage biopharmaceutical company developing novel, immune-modulatory, off-the-shelf therapeutic cancer vaccines based on its T-win® platform. The T-win platform is based on a novel approach to cancer vaccines designed to activate T cells to target both tumor cells and the immune-suppressive cells in the tumor microenvironment. IO Biotech is advancing its lead investigational cancer vaccine candidate, Cylembio™ (imsapepimut and etimupepimut, adjuvanted) in clinical trials, and additional pipeline candidates through preclinical development. Based on positive Phase 1/2 first line metastatic melanoma data, IO102-IO103, in combination with Merck’s anti-PD-1 therapy, KEYTRUDA® (pembrolizumab), has been granted a Breakthrough Therapy Designation for the treatment of advanced melanoma by the US Food and Drug Administration. IO Biotech is headquartered in Copenhagen, Denmark and has US headquarters in New York, New York.</p><p class=\"\">For further information, please visit www.iobiotech.com. Follow us on our social media channels on LinkedIn and X (@IOBiotech).</p><p class=\"\">Cylembio is a trademark of IO Biotech ApS.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statement</strong></p><p class=\"\">This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements, including regarding the timing of submission of an IND for IO112, other current or future regulatory submissions or clinical trials, their progress, enrollment or results, or the company’s financial position or cash runway, are based on IO Biotech’s current assumptions and expectations of future events and trends, which affect or may affect its business, strategy, operations or financial performance, and actual results and other events may differ materially from those expressed or implied in such statements due to numerous risks and uncertainties. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified. Because forward-looking statements are inherently subject to risks and uncertainties, you should not rely on these forward-looking statements as predictions of future events. These forward-looking statements speak only as of the date hereof and should not be unduly relied upon. Except to the extent required by law, IO Biotech undertakes no obligation to update these statements, whether as a result of any new information, future developments or otherwise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors</strong></p><p class=\"\">Maryann Cimino, Director of Investor Relations </p><p class=\"\">IO Biotech, Inc.</p><p class=\"\">617-710-7305</p><p class=\"\">mci@iobiotech.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media</strong></p><p class=\"\">Julie Funesti</p><p class=\"\">Edelman</p><p class=\"\">917-498-1967</p><p class=\"\">julie.funesti@edelman.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7g1vdb:0-io-biotech-announces-publication-of-preclinical-data-investigating-immune-modulatory-effects-of-io112-an-arginase-1-targeting-therapeutic-cancer-vaccine-candidate/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:31f9379bfc0ce:0",
            "title": "Fox Corporation Q2 Fiscal 2025 Earnings Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox Corporation has released its financial results for the second quarter of fiscal 2025, ending December 31, 2024. The company reported significant growth in revenues and net income, driven by strong performance in its Television and Cable Network Programming segments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the quarter ended December 31, 2024, Fox Corporation reported total revenues of $5.08 billion, a 20% increase from the $4.23 billion reported in the same period last year. Net income for the quarter was $388 million, up from $115 million in the prior year quarter. Earnings per share (EPS) attributable to Fox Corporation stockholders rose to $0.81 from $0.23. Adjusted net income was $442 million ($0.96 per share), compared to $165 million ($0.34 per share) in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The Television segment saw a 16% increase in revenues to $2.96 billion, driven by higher political advertising revenues, improved MLB postseason ratings, and NFL pricing. The Cable Network Programming segment reported a 31% increase in revenues to $2.17 billion, primarily due to higher news ratings and digital advertising revenues.</p><p class=\"\">Adjusted EBITDA for the quarter was $781 million, a 123% increase from the $350 million reported in the prior year quarter. This growth was primarily due to increased revenues, partially offset by higher expenses related to sports programming rights and production costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Fox Corporation declared a dividend of $0.27 per Class A and Class B share, payable on March 26, 2025. The company also continued its share repurchase program, buying back approximately $250 million of its Class A common stock during the quarter. As of December 31, 2024, Fox has repurchased approximately $5.1 billion of its Class A common stock and $1 billion of its Class B common stock, with a remaining authorization of $900 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Executive Chair and Chief Executive Officer Lachlan Murdoch commented on the results, stating, \"A compelling fall sports schedule combined with a record-breaking presidential election news cycle resulted in second quarter results that reflect the strength and breadth of FOX. Whether measured in terms of engagement, monetization or profitability, our focused strategy of live news and sports programming, coupled with our growing digital initiatives, continues to deliver. We remain committed to sustained long-term value creation for our shareholders through our thoughtful and disciplined strategy for growth.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">While the company did not provide specific guidance for the next reporting period, the strong performance in key segments and ongoing strategic initiatives suggest a positive outlook for the remainder of the fiscal year.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1754301/000162828025003584/fox-20250204.htm\" rel=\"nofollow\" target=\"_blank\">Fox Corp [ FOX ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:31f9379bfc0ce:0-fox-corporation-q2-fiscal-2025-earnings-report/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204005909:0",
            "title": "Easterly Government Properties Schedules Fourth Quarter 2024 Earnings Release and Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Easterly Government Properties Schedules Fourth Quarter 2024 Earnings Release and Conference Call</p><p class=\"\">WASHINGTON--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Easterly Government Properties, Inc.  today announced that the Company will release its fourth quarter 2024 financial results on February 25, 2025.</p><p class=\"\">A conference call will be held Tuesday, February 25, 2025 at 11:00am Eastern time. The management team will review fourth quarter performance, discuss recent events and conduct a question-and-answer session.</p><p class=\"\">Attendees that would like to join the call and ask a question may register here to receive the dial-in numbers and unique PIN to access the call. There will also be a live audio, listen-only webcast of the call on the Investor Relations section of Easterly's Investor Relations website at ir.easterlyreit.com.</p><p class=\"\">Shortly after the call, a replay of the call will be available on the Company's website for up to twelve months.</p><p class=\"\">About Easterly Government Properties, Inc.</p><p class=\"\">Easterly Government Properties, Inc.  is based in Washington, D.C. and focuses primarily on the acquisition, development and management of Class A commercial properties that are leased to the U.S. Government. With a long-stated goal of being the partner of choice to the United States Government, Easterly's experienced management team brings specialized insight into the strategy and needs of mission-critical U.S. Government agencies for properties leased to such agencies either directly or through the U.S. General Services Administration (GSA). For further information on the company and its properties, please visit www.easterlyreit.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204165378/en/</p><p class=\"\">CONTACT:    Easterly Government Properties, Inc.</p><p class=\"\">Lindsay S. Winterhalter</p><p class=\"\">Senior Vice President, Investor Relations &amp; Operations</p><p class=\"\">202-596-3947</p><p class=\"\">ir@easterlyreit.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204005909:0/",
            "pub_date": "2025-02-04 21:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308673:0",
            "title": "Microbix Receives $2.4 Million From Warrants Exercise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Microbix Biosystems  on Tuesday said it has received $2.4 million from the partial exercise of expiring share purchase warrants. </p><p class=\"\">The warrants were issued in connection with a Jan. 2020 private placement and had an exercise price of $0.36. A total of 6.7 million of the remaining 8.9 million warrants were exercised in this round. The remaining 1.45 million 2020 warrants were exercised by insiders, the company said. </p><p class=\"\">Microbix intends to use the proceeds to broaden its product development capabilities. </p><p class=\"\">There are no further Microbix warrants outstanding following the expiry of this series. </p><p class=\"\">Mirobix was last seen up US$0.60, to US$11.09, in New York trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308673:0/",
            "pub_date": "2025-02-04 21:05:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2Xp8Jg:0",
            "title": "Alpha Modus Sues Walgreens for Patent Infringement, Strengthening Its Leadership in AI-Driven Retail Innovation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CORNELIUS, N.C., Feb.  04, 2025  (GLOBE NEWSWIRE) — Alpha Modus Holdings, Inc.  (“Company”) announced today that its wholly owned subsidiary, Alpha Modus, Corp. (“Alpha Modus”), has filed a patent infringement lawsuit that also alleges willful infringement against Walgreens Co. (“Walgreens”) in the United States District Court for the Eastern District of Texas. This legal action underscores Alpha Modus’s unwavering commitment to protecting its groundbreaking AI-driven retail technology and further solidifies its leadership in the rapidly evolving retail innovation landscape.</p><p class=\"\">Championing Innovation and Protecting Shareholder Value</p><p class=\"\">Alpha Modus has transformed AI-powered retail engagement with its extensive patent portfolio, including its latest—its ninth AI patent. Alpha Modus’s patented solutions are designed to enhance consumer experiences, improve retail efficiency, and boost revenue for retailers and brands.</p><p class=\"\">“We believe our technology is currently being used by scores of brands, retailers and technology providers. Our research demonstrates that, as a result, damages due Alpha Modus far exceed an estimated $500 million and could easily run into the billions over the life of our patents. This lawsuit is a necessary step to protect our intellectual property and uphold fair competition,” said Alpha Modus CEO William Alessi.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alleged Patent Infringement Details</strong></p><p class=\"\">Walgreens allegedly willfully infringed on Alpha Modus’s patented AI-driven retail technology, which enhances in-store shopping through data-driven insights, interactive advertising, and consumer engagement tools. Walgreens’s deployment of Cooler Screens digital smart screens in its stores mirrors the innovations protected under Alpha Modus’s patents, necessitating this legal action.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Pattern of Defending Innovation</strong></p><p class=\"\">This lawsuit follows recent actions Alpha Modus has taken against major retailers and technology providers, including Kroger, Cooler Screens, Wakefern, Shelf Nine LLC, VSBLTY Groupe Technologies, Brookshire Grocery, and Grocery TV. These cases reflect Alpha Modus’s commitment to protecting its technology and securing rightful recognition of its innovations. The first of these cases is set for trial in November 2025.</p><p class=\"\">Meanwhile, Walgreens finds itself entangled in another legal dispute, with Cooler Screens recently filing a $200 million lawsuit against the pharmacy giant over alleged contract breaches related to digital smart screens deployed by Cooler Screens. Cooler Screens was co-founded by Greg Wasson, former CEO of Walgreens Boots Alliance. The Company’s understanding is that Wasson, through Wasson Enterprises, funded the startup of Cooler Screens and helped deploy Cooler Screens technology throughout Walgreens. These ongoing legal challenges between Walgreens and Cooler Screens further reinforce the strategic importance of Alpha Modus’s claims and the value of its intellectual property.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Market Confidence and Unprecedented Momentum</strong></p><p class=\"\">Alpha Modus’s firm stance on intellectual property aligns with its broader strategic vision, as reaffirmed in a recent press release by CEO William Alessi. That announcement on January 30, 2025, which addressed Alessi's perspective on uninformed or ill-informed speculation in the Company’s stock, market volatility and Alpha Modus’s successful SPAC merger, triggered an unprecedented surge in AMOD stock trading volume, leading to AMOD stock trading over 25 times its public float—demonstrating strong investor confidence in the Company’s ability to achieve its long-term growth objectives.</p><p class=\"\">“Alpha Modus remains committed to redefining retail technology,” added Alessi. “We are dedicated to delivering shareholder value, and this lawsuit reaffirms our commitment to innovation, fairness, and growth.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Alpha Modus</strong></p><p class=\"\">Alpha Modus Holdings, Inc.  is a pioneering technology company specializing in AI-driven retail solutions. The Company’s patented technologies optimize consumer engagement, enhance in-store experiences, and drive measurable returns for retailers and brands. For more information, visit www.alphamodus.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release includes “forward-looking statements” within the meaning of the “safe harbor” provisions of the United States Private Securities Litigation Reform Act of 1995. Alpha Modus’s actual results may differ from their expectations, estimates, and projections, and, consequently, you should not rely on these forward-looking statements as predictions of future events. Words such as “expect,” “estimate,” “project,” “budget,” “forecast,” “anticipate,” “intend,” “plan,” “may,” “will,” “could,” “should,” “believes,” “predicts,” “potential,” “continue,” and similar expressions (or the negative versions of such words or expressions) are intended to identify such forward-looking statements, but are not the exclusive means of identifying these statements. These forward-looking statements include, without limitation, Alpha Modus’s expectations with respect to future performance.</p><p class=\"\">Alpha Modus cautions readers not to place undue reliance upon any forward-looking statements, which speak only as of the date made. Alpha Modus does not undertake or accept any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements to reflect any change in its expectations or any change in events, conditions, or circumstances on which any such statement is based.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts</strong></p><p class=\"\">Alpha Modus Holdings, Inc.</p><p class=\"\">Investor Relations</p><p class=\"\">ir@alphamodus.com</p><p class=\"\">+1(704)252-5050</p><p class=\"\">Follow us on LinkedIn</p><p class=\"\">Follow us on X</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2Xp8Jg:0-alpha-modus-sues-walgreens-for-patent-infringement-strengthening-its-leadership-in-ai-driven-retail-innovation/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OU1GJ:0",
            "title": "AI giants’ less-is-more logic bears three caveats",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Bosses of big technology firms may find reassurance in comparing artificial intelligence to a lump of coal. Claimed cost-efficiency breakthroughs made by China’s DeepSeek have rocked markets betting on a boom in spending on the chips and servers powering silicon smarts. Analysts and executives like Microsoft’s  Satya Nadella reason that this shouldn’t be an issue by appealing to long-dead economist William Stanley Jevons’ observation that more-efficient coal-fired engines drove higher fuel demand. Scrutinizing other, more recent cases shows why that dynamic doesn’t guarantee success for today’s incumbents.</p><p class=\"\">Jevons, in an 1865 book called “The Coal Question,” laid out the seeming paradox. As steam engines improved, they needed less fuel for tasks like hauling trains. Yet coal demand in the United Kingdom kept rising. The reason is simple: railroad operators consumed less of it per train journey, increasing profits and encouraging them to run more locomotives. The trend is durable. Industrial processes keep getting more efficient, but in 2024, 159 years after the book was written, the world burned a record 8.8 billion tonnes of the stuff.</p><p class=\"\">Like energy, intelligence is a necessary input for economic activity. High-margin products from medicine to software, not to mention the day-to-day running of any big corporation, require mental effort for everything from organizational coordination to cutting-edge research. Even a wildly expensive AI that can perform some of this work will find takers where its output is valuable enough. Lower the price, and the range of tasks to which it makes sense to apply it expands.</p><p class=\"\">So when DeepSeek claimed it could train and run cutting-edge language models at a fraction of the cost of Western versions, it’s no wonder some people found comfort in coal. Sure, investors initially panicked, slicing nearly $600 billion off the market value of Nvidia , the dominant maker of chips used for AI, in one day. But Nadella, in a social media post, declared that “Jevons paradox strikes again,” adding that rising efficiency will cause AI use to “skyrocket.”</p><p class=\"\">Yet Jevons can’t help if demand isn’t there or assumptions underlying investments are wrong. Three more up-to-date industrial examples exemplify the pitfalls.</p><p class=\"\">Take hydraulic fracturing, which involves injecting shale formations with water, sand and chemicals to break open previously inaccessible deposits of natural gas and oil. Technological progress steadily reduced costs, leading to a massive rise in production. The U.S. is now the world’s largest producer of crude oil, with about two-thirds coming from fracking. Yet demand did not rise nearly as much. Companies that took on leverage to finance breakneck expansion couldn’t keep up, and waves of bankruptcies followed. Some 42 fracking companies bearing almost $26 billion in debt went under in 2019, according to the Institute for Energy Economics and Financial Analysis. Gas prices scraped along at all-time lows last year, the U.S. Energy Information Administration reported.</p><p class=\"\">This might be unfair to AI. Unlike oil – the need for which is increasingly being displaced by technologies like electric cars – intelligence seems unlikely to go out of style. But that still might not prop up, say, a mooted valuation of $300 billion for ChatGPT-maker OpenAI if competition swamps the market. Just look at solar panels.</p><p class=\"\">The cost of a U.S. solar system has fallen about 40% in a decade, according to the Solar Energy Industries Association trade group, with declines even steeper overseas. Unlike with gas, demand has exploded in response. Installed global solar power capacity increased 10-fold between 2013 and 2023.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:938.3259911894272px;aspect-ratio:1.5638766519823788\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-3b4f4ab69c7a44f90455995def2412c7-resized.webp\" type=\"images/webp\"/><img alt=\"A chart showing the annual increase in global installed solar photovoltaic power capacity\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-3b4f4ab69c7a44f90455995def2412c7-resized.jpeg\" style=\"background-color:#f8e4da\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">The world's demand for solar appears limitless</span></figcaption></figure></span></p><p class=\"\">Yet competition is fierce because panels are largely interchangeable. All that matters is price. Operating margins for the top ten manufacturers averaged roughly 0% in the third quarter of 2024, according to the National Renewable Energy Laboratory, despite record shipments.</p><p class=\"\">AI insiders like Dario Amodei, the CEO of Anthropic, however, think that competition will thin out. He claims smaller, newer companies have been able to jump into the race because novel techniques that produce big gains are still emerging so rapidly. Over time, improvements will become harder and more costly, by his reckoning. That could mean few firms – or even just one – will dominate.</p><p class=\"\">Yet limited competition and rapid growth do not guarantee extraordinary profit margins, either. Illumina , for instance, has dominated genetic sequencing for over a decade. In 2019, the Federal Trade Commission estimated it had an over-90% share of the market for advanced machines that identify the nucleotides in DNA samples.</p><p class=\"\">These machines have potential uses from telling people where their ancestors came from to designing personalized cancer treatments. Efficiency improvements have been swift and substantial. The price of sequencing one person’s genome, their entire set of DNA, has fallen from roughly $100 million in 2001 to about $200 today, according to the company.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:867.6171079429736px;aspect-ratio:1.4460285132382893\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-ec4ec5097208d4e002b39a10c6bbb183-resized.webp\" type=\"images/webp\"/><img alt=\"The price of sequencing a human genome has fallen from over $100 million in 2000 to about $200 today.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OU1GJ-ec4ec5097208d4e002b39a10c6bbb183-resized.jpeg\" style=\"background-color:#fbfafa\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">The price of genetic sequencing has cratered</span></figcaption></figure></span></p><p class=\"\">Yet even with nearly the entire market in its grasp, analysts expect Illumina’s revenue in 2026 to reach only $4.7 billion, according to LSEG data, not much different than in 2021. This is the result of a nasty combination that comes from having to outpace both a demand shortfall and rising competition. Genetic testing still needs to improve to be useful enough to draw in more customers; upstarts, meanwhile, are developing their own tests in an attempt to break through. Illumina must run faster just to stay in place.</p><p class=\"\">Perhaps AI will escape all these traps, proving useful enough, cheap enough, but hard enough to copy that it results in not just an explosion of usage, but profit, too. It’s just a much trickier matter than simply offering up Jevons’ paradox as some kind of proof that less is always more.</p><p class=\"\">Follow @rob_cyran on X</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OU1GJ:0-ai-giants-less-is-more-logic-bears-three-caveats/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9S70l6:0",
            "title": "2025 Best of IT Services™ Award Winners Achieve Superior Ratings for Client and Employee Experience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PORTLAND, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — ClearlyRated®, the leading provider of client and employee satisfaction surveys and service quality benchmarking for IT Services firms, announced the winners of their inaugural Best of IT Services™ award today on ClearlyRated.com.</p><p class=\"\">“The remarkable achievements of our 2025 Best of IT Services winners deserve the highest recognition,\" said ClearlyRated CEO, Baker Nanduru. \"These industry leaders have proven through independently verified service ratings that excellence isn't just a goal—it's their standard operating procedure. As we celebrate this year's honorees, we're inspired by their commitment to consistently delivering exceptional experiences that shape the future of the IT services industry.”</p><p class=\"\">The 2025 Best of IT Services award program recognizes client and employee satisfaction leaders in the IT services industry. Participating firms use the Net Promoter® Score (NPS®) methodology to collect feedback and measure satisfaction of their clients and/or internal employees. Only firms that earned exceptional satisfaction ratings that outpace industry benchmarks for service qualified for the 2025 Best of IT Services award.</p><p class=\"\">According to ClearlyRated's latest survey data, clients of 2025 Best of IT Services winners for client satisfaction are 70% more likely to be completely satisfied with the services provided than the 2024 industry average. Fewer than 1% of all accounting firms in the U.S. and Canada achieve Best of IT Services for client or employee satisfaction.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ClearlyRated</strong></p><p class=\"\">ClearlyRated is a leading provider of client satisfaction surveys and service quality research for IT and other professional service providers. We help firms leverage the Net Promoter® Score survey methodology to gain deep insights, identify strengths and weaknesses, fuel data-driven action, build reputation and future-proof their organizations with third-party validation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Best of IT Services</strong></p><p class=\"\">The Best of IT Services Award is the only award in the U.S. and Canada that recognizes IT services firms that have proven superior service quality based entirely on ratings provided by their clients. Award winners are showcased by city and area of expertise on ClearlyRated.com—an online business directory that helps buyers of professional services find service leaders and vet prospective firms with the help of validated client ratings and testimonials.</p><p class=\"\">Net promoter, NPS, and Net Promoter Score are trademarks of Satmetrix Systems, Inc., Bain &amp; Company, and Fred Reichheld.</p><p class=\"\">Contact</p><p class=\"\">Stephen Banbury, VP of Marketing</p><p class=\"\">P (503) 977-6295</p><p class=\"\">stephen.banbury@clearlyrated.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9S70l6:0-2025-best-of-it-services-award-winners-achieve-superior-ratings-for-client-and-employee-experience/",
            "pub_date": "2025-02-04 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4z092g:0",
            "title": "Vivos Inc. Reports Encouraging Human Clinical Trial Results and Announces Expansion Plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Richland, WA, Feb.  04, 2025  (GLOBE NEWSWIRE) — Vivos Inc. (OTCQB: RDGL) is pleased to report that the first five patients demonstrated the safety of RadioGel Precision Radionuclide TherapyTM by satisfying the criteria in the Clinical Study Plan, including confirmation via PET imaging that the Y-90 remained at the point of injection and no adverse events reported by any of the initial five patients since the initial treatment date.</p><p class=\"\">Additionally, 30-day PET/F-18 imaging of a local patient—a young teacher with a cancerous node near the trachea—revealed an over 80% reduction in both tumor size and metastatic activity. Other treatment options would have jeopardized her voice, making this outcome particularly meaningful. While the trial’s primary objective is to establish safety, these early signs of efficacy are highly encouraging.</p><p class=\"\"><em>Expansion of Clinical Trial</em></p><p class=\"\">After completing the detailed assessment of the available data from the patients, the results will be presented to the Ethics Committee. The lead investigator intends to request authority to increase the study from 30 patients to 50 patients. The expanded trial will provide valuable data on a variety of cancers and include the utilization of new deep injection technology being installed and tested in the treatment hospital in India.</p><p class=\"\">This advanced deep-needle CT-guided precision injection device, designed for use with RadioGel®, will enable precise treatment of deeper-seated tumors, including lung and pancreatic cancer nodules.</p><p class=\"\">Under the current timeline, we anticipate completing the initial 30-patient trial by June 30 and the expanded trial by year-end. Consistent with our previous disclosure, the trial’s comprehensive data will be submitted under the guidance of the lead investigator for publication in leading medical journals. Additionally, as results emerge, they will be shared with the FDA to further support RadioGel®’s safety profile and reinforce our Investigational Device Exemption (IDE) submission and advance expanded indications for use in the United States.</p><p class=\"\"><em>Manufacturing and Global Expansion</em></p><p class=\"\">Vivos continues to collaborate with its contract manufacturer, IsoTherapeutics, recently acquired by Telix , to enhance production capacity for both Isopet™ and RadioGel®. Simultaneously, we are evaluating additional manufacturing partners in India and other regions to support global supply chain expansion.</p><p class=\"\"><em>Statement of CEO Mike Korenko</em>:</p><p class=\"\">“After years of dedicated effort, we are thrilled with these initial clinical trial results and optimistic about future findings. As the study progresses, we look forward to sharing additional updates. In parallel, we are advancing key growth initiatives to strengthen RadioGel®’s competitive position, and we will provide further updates on these technology and business developments in the coming weeks and months.”</p><p class=\"\">– <strong class=\"root-Tkn6WL2y\">Michael K. Korenko, Sc.D.</strong></p><p class=\"\">President &amp; CEO, Vivos Inc.</p><p class=\"\"><em>Follow Vivos Inc @VivosIncUSA, Radiogel</em>®<em> and Isopet</em>®<em> on X (Twitter):</em> </p><p class=\"\">For media inquiries, contact:</p><p class=\"\">Michael K. Korenko, Sc.D.</p><p class=\"\">President &amp; CEO, Vivos Inc.</p><p class=\"\">Email: MKorenko@RadioGel.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Vivos Inc. (OTCQB: RDGL)</strong></p><p class=\"\">Vivos Inc. has developed an Yttrium-90-based injectable <strong class=\"root-Tkn6WL2y\">Precision Radionuclide Therapy</strong><strong class=\"root-Tkn6WL2y\">™</strong> medical device to treat tumors in animals (IsoPet®) and humans (RadioGel®). Using the company's proprietary hydrogel technology, PRnT™ uses highly localized radiation to destroy cancerous tumors by placing a radioactive isotope directly inside the treatment area. The injection delivers therapeutic radiation from within the tumor without the entrance skin dose and associated side effects of treatment that characterize external-beam radiation therapy. This feature allows the safe delivery of higher doses needed for treating non-resectable and radiation-resistant cancers.</p><p class=\"\">RadioGel® is a hydrogel liquid containing tiny yttrium-90 phosphate microparticles that may be administered directly into a tumor. The hydrogel is a yttrium-90 carrier at room temperature that gels within the tumor interstitial spaces after injection to keep the radiation sources safely in place. The short-range beta radiation from yttrium-90 localizes the dose within the treatment area so that normal organs and tissues are not adversely affected.</p><p class=\"\">RadioGel® also has a short half-life – delivering more than 90% of its therapeutic radiation within 10 days. This compares favorably to other available treatment options requiring up to six weeks or more to deliver a full course of radiation therapy. Therapy can be safely administered as an outpatient procedure, and the patient may return home without subsequent concern for radiation dose to family members.</p><p class=\"\">University veterinary hospitals use the IsoPet® Solutions division to demonstrate animal cancers' safety and therapeutic effectiveness. Testing on feline sarcoma at Washington State University was completed in 2018, and testing on canine soft tissue sarcomas at the University of Missouri was completed in 2019. The Company has obtained confirmation from the FDA Center for Veterinary Medicine that IsoPet® is classified as a medical device according to its intended use and means by which it achieves its intended purpose. The FDA also reviewed the product labeling, which included canine and feline sarcomas as the initial indications for use. The FDA does not require pre-market approval for veterinary devices, so no additional approval was required to generate revenue through the sale of IsoPet® to University animal hospitals and private veterinary clinics.</p><p class=\"\">IsoPet® for treating animals uses the same technology as RadioGel® for treating humans. The Food and Drug Administration advised using different product names to avoid confusion and cross-use.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">This release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. You can identify these statements by the use of the words \"may,\" \"will,\" \"should,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimates,\" \"projects,\" \"intends,\" and similar expressions. Forward-looking statements involve risks and uncertainties that could cause results to differ materially from those projected or anticipated. These risks and uncertainties include, but are not limited to, the Company's ability to successfully execute its expanded business strategy, including by entering into definitive agreements with suppliers, commercial partners, and customers; general economic and business conditions, effects of continued geopolitical unrest and regional conflicts, competition, changes in technology and methods of marketing, delays in completing various engineering and manufacturing programs, changes in customer order patterns, changes in product mix, continued success in technical advances and delivering technological innovations, shortages in components, production delays due to performance quality issues with outsourced components, regulatory requirements and the ability to meet them, government agency rules and changes, and various other factors beyond the Company's control.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4z092g:0-vivos-inc-reports-encouraging-human-clinical-trial-results-and-announces-expansion-plans/",
            "pub_date": "2025-02-04 21:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}