{
    "data": [
        {
            "id": "forexlive:3d5d73911094b:0",
            "title": "Federal Reserve Daly and Jefferson  speaking on Tuesday, February 4, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fed speakers have been emphasing the Bank is on hold for now, we should get more of the same from these two:</p><p class=\"\">1900 GMT/1400 US Eastern time:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Federal Reserve Bank of San Francisco President Mary Daly participates in hybrid discussion, \"The Economy 2025: the Impacts of Tariffs, Tax Cuts and Trump\" before the Commonwealth Club</li></ul><p class=\"\">0030 GMT (on Wednesday)/1930 US Eastern time (on Tuesday)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Federal Reserve Vice Chair Philip Jefferson speaks on the U.S. economic outlook and monetary policy before the Lafayette College Economics Department Special Lecture</li></ul><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:800px;aspect-ratio:1.3333333333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:3d5d73911094b-9e05f4a9180ab61765b1f0f008c6ea0f-resized.webp\" type=\"images/webp\"/><img alt=\"Federal Reserve\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:3d5d73911094b-9e05f4a9180ab61765b1f0f008c6ea0f-resized.jpeg\" style=\"background-color:#59656d\"/></picture></div></figure></span><p class=\"\">Federal Reserve</p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:3d5d73911094b:0-federal-reserve-daly-and-jefferson-speaking-on-tuesday-february-4-2025/",
            "pub_date": "2025-02-04 11:46:00",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463138:0",
            "title": "Rhythm Biosciences Completes Initial Integration of Genetype Business",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rhythm Biosciences  completed the initial integration of the Genetype business it acquired on Dec. 24, 2024, with the commercial processes required to provide and sell the geneType genetic risk assessment product restored, according to a Tuesday Australian bourse filing. </p><p class=\"\">The integration was expected to take over 12 weeks earlier. Full integration is now expected to be completed by the end of February, per the filing. </p><p class=\"\">The firm said the transition included the transfer, restoration, and rebuilding of several processes and supply partnerships. </p><p class=\"\">The firm's shares fell past 2% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463138:0/",
            "pub_date": "2025-02-04 11:46:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012108:0",
            "title": "Yuan Steady, Supported by Hopes for China-U.S. Talks on Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The yuan is steady against the dollar in offshore markets, supported by hopes for potential China-U.S. talks on tariffs. President Trump mentioned overnight that the U.S. might speak with China, likely within the next 24 hours, regarding tariffs, notes Mizuho Securities Asia's Ken Cheung in an email. Trump's comments revived hopes for a pause in U.S. tariffs on China, similar to the situation with Canada and Mexico, according to the director of FX Strategy. However, with mainland China still closed for holiday today, the USD/CNY fixing guidance on Wednesday will be closely monitored, Cheung adds. USD/CNH is little changed at 7.3114. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012108:0/",
            "pub_date": "2025-02-04 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012103_20250203012103:0",
            "title": "LG Chem Target Price Cut to KRW280,000 From KRW420,000 by Nomura >051910.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012103_20250203012103:0/",
            "pub_date": "2025-02-04 11:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463139:0",
            "title": "Superlon Offers Over 1 Million Share Options to Employees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Superlon Holdings  offered 1.4 million options to employees under its employees' share option scheme. </p><p class=\"\">The options have an exercise price of 0.81 ringgit, according to a Monday filing with Bursa Malaysia.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463139:0/",
            "pub_date": "2025-02-04 11:41:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV08T:0",
            "title": "Aussie tech stocks gain as Nasdaq futures jump",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australia's technology sub-index  gains 2.1% to 2,859.9 points; broader benchmark index  adds 0.4%</p><p class=\"\">** Local tech stocks rise tracking a 0.9% jump in futures of tech-heavy Nasdaq</p><p class=\"\">** Wall Street, which ended lower on Monday, recouped steep losses it faced earlier in the session as investors scrambled to keep up with sudden changes in U.S. trade policy </p><p class=\"\">** Tech-focussed Siteminder  and IT major Megaport  top gainers, adding 5% and 4.7% respectively</p><p class=\"\">** Index heavyweight WiseTech Global  up 3.3%</p><p class=\"\">** AXIJ gains 4% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV08T:0-aussie-tech-stocks-gain-as-nasdaq-futures-jump/",
            "pub_date": "2025-02-04 11:42:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463136:0",
            "title": "Market Chatter: Yadea, Narada Power Tie Up for Solid-State Battery Development",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Electric bicycle manufacturer Yadea Group Holdings  signed a strategic cooperation agreement with battery manufacturer Zhejiang Narada Power Source  to co-develop solid-state batteries, the Securities Times reported Tuesday. </p><p class=\"\">The agreement will also include further upgrading of solid-state batteries and the building of the technology's industrial chain synergy, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463136:0/",
            "pub_date": "2025-02-04 11:42:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012104_20250203012104:0",
            "title": "India's Sensex Opens 0.6% Higher at 77687.60, Led by Tech, Auto Stocks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012104_20250203012104:0/",
            "pub_date": "2025-02-04 11:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012106:0",
            "title": "LG Chem Set to Post Weak 2025 Earnings on Lower Sales — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012106:0/",
            "pub_date": "2025-02-04 11:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:39c979332094b:0",
            "title": "Bitcoin 4-Hour RSI Hits Oversold Zone – Is A BTC Rebound Near?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitcoin (BTC) has had a volatile 24 hours, plunging from $99,500 to as low as $91,231 amid mounting concerns over impending US trade tariffs on Canada, Mexico, and China. However, some crypto analysts see this sharp decline as a buying opportunity, suggesting that BTC may be oversold and poised for a rebound.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Is Bitcoin Poised For A Relief Rally?</strong></p><p class=\"\">Yesterday, the crypto market experienced one of its largest sell-offs in history, with over $2.3 billion in liquidations affecting more than 742,000 traders. This level of liquidations surpasses those seen during the COVID market crash in March 2020 and the FTX collapse in November 2022.</p><p class=\"\">Despite the downturn, some analysts argue that BTC may have entered oversold territory, signaling a potential relief rally. Crypto analyst Caleb Franzen shared insights in a post on X, highlighting that Bitcoin’s 4-hour Relative Strength Index (RSI) has dipped into oversold levels. He noted:</p><div class=\"blockquote-xrkxvh37\"><p class=\"\">For the 5th time since August 2024, Bitcoin’s 4-hour RSI is becoming oversold. Each of the prior signals were attractive accumulation periods, even if price made new short-term lows after the signal flashed.</p></div><p class=\"\">For the uninitiated, the RSI is a momentum indicator that measures the speed and magnitude of recent price changes to determine whether BTC is overbought or oversold. A reading above 70 suggests overbought conditions – potential for a pullback – while a reading below 30 indicates oversold conditions – potential for a rebound.</p><p class=\"\">According to Franzen’s chart, Bitcoin’s current RSI is hovering around 24 on the 4-hour timeframe, indicating that BTC may be in an attractive accumulation zone. If historical trends hold, BTC could be on the verge of a short-term recovery.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1007.9754601226994px;aspect-ratio:1.6799591002044991\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:39c979332094b-68a72e9f5874aed5d48ead63dcaff9f3-resized.webp\" type=\"images/webp\"/><img alt=\"RSI\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:39c979332094b-68a72e9f5874aed5d48ead63dcaff9f3-resized.jpeg\" style=\"background-color:#f1f3f1\"/></picture></div></figure></span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Is There More Trouble For BTC Ahead?</strong></p><p class=\"\">As of the latest updates, Donald Trump and his Mexican counterpart Claudia Sheinbaum have agreed to temporarily delay the proposed trade tariffs, offering some relief to financial markets. However, uncertainty remains regarding trade negotiations with Canada, leaving investors cautious about BTC’s next move.</p><p class=\"\">Meanwhile, fellow crypto analyst Johnny’s analysis indicates that “the meat” of BTC’s current down move is likely over. The analyst added that as long as BTC continues to trade above range lows and the yearly open, it will “look good compared to the rest of the market.”</p><p class=\"\">However, not all experts are optimistic. Renowned businessman and author Robert Kiyosaki warns that BTC could face further downside pressure if Trump follows through with his tariff plans. </p><p class=\"\">According to Kiyosaki, increased tariffs could strengthen the US dollar, potentially driving investors away from risk assets like Bitcoin in the short term. At press time, BTC trades at $98,644, up 0.4% in the past 24 hours.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:811.3207547169811px;aspect-ratio:1.3522012578616351\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:39c979332094b-97cdcb541fe4c9a69b6dc79c30fc0c74-resized.webp\" type=\"images/webp\"/><img alt=\"bitcoin\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:39c979332094b-97cdcb541fe4c9a69b6dc79c30fc0c74-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></span></div>",
            "link": "https://www.tradingview.com/news/newsbtc:39c979332094b:0-bitcoin-4-hour-rsi-hits-oversold-zone-is-a-btc-rebound-near/",
            "pub_date": "2025-02-04 11:30:27",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463134:0",
            "title": "Baidu Smart Cloud Qianfan Offers DeepSeek Models",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Baidu Smart Cloud Qianfan platform launched DeepSeek-R1 and DeepSeek-V3 models at \"ultra-low\" price plans. </p><p class=\"\">The platform also offers limited-time free services, according to a Monday news release on Weibo. </p><p class=\"\">The model has fully integrated the Qianfan reasoning link and Baidu's exclusive content security operator.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463134:0/",
            "pub_date": "2025-02-04 11:35:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463132:0",
            "title": "Barbeque-Nation Hospitality to Buy Up To 51% Stake in Ice Cream Company Willow Gourmet",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Barbeque-Nation Hospitality  has agreed to acquire up to a 51% stake in upto 51% in Willow Gourmet for 170 million Indian rupees, according to a Monday filing to the Indian stock exchanges. </p><p class=\"\">Willow Gourmet operates an ice-cream brand 'Omm Nom Nomm' through the delivery channel. </p><p class=\"\">The transaction is expected to be completed by April 30, after which Will Gourmet will become a subsidiary.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463132:0/",
            "pub_date": "2025-02-04 11:36:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463133:0",
            "title": "Ahmad Zaki Resources Bags About MYR64 Million Bridge Construction Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ahmad Zaki Resources  secured a deal worth 63.5 million ringgit</p><p class=\"\">from the Government of Malaysia for the construction and completion of the Bridge in Pahang, Malaysia. </p><p class=\"\">The deal has a duration of 36 months, starting Feb. 12, according to a Monday Malaysian bourse filing. </p><p class=\"\">This bridge will span about 400 meters in length and 11 meters in width, crossing the Sungai Lipis River in Pahang, it added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463133:0/",
            "pub_date": "2025-02-04 11:36:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV03E:0",
            "title": "BOJ aims to achieve 2% inflation as measured by overall CPI, governor Ueda says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bank of Japan Governor Kazuo Ueda said on Tuesday the central bank will aim to achieve 2% inflation, as measured by the overall consumer price index, on a sustained basis.</p><p class=\"\">In gauging whether inflation will sustainably hit its target, the BOJ focuses on underlying inflation, or the broad trend of price moves that strips away one-off factors such as fuel and volatile fresh food costs.</p><p class=\"\">\"When we speak of underyling inflation, we exclude one-off factors from overall CPI moves. But that process at times could be difficult,\" Ueda told parliament.</p><p class=\"\">The BOJ introduced a 2% inflation target in 2012, which served as a basis for former governor Haruhiko Kuroda to deploy a massive stimulus programme in 2013.</p><p class=\"\">The central bank exited the stimulus last year and raised short-term interest rates to 0.5% in January on the view Japan was on the cusp of sustainably achieving 2% inflation.</p><p class=\"\">The BOJ has said its long-term goal would be for overall consumer price index (CPI) to stably move around 2%. But in seeking to do so, it looks at indices that strip away one-off factors to better capture price moves driven by the strength of the economy.</p><p class=\"\">To that extent, the BOJ produces its inflation forecasts based on core CPI, which excludes fresh food prices, and the so-called \"core-core\" index that also strips away fuel costs.</p><p class=\"\">The difference between overall and core CPI has become politically sensitive as soaring price of rice, vegetables and fuel boost the rising cost of living for households.</p><p class=\"\">Overall CPI rose 3.6% in December from a year earlier, much faster than a 3.0% gain in core CPI and a 2.4% increase in core-core CPI.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV03E:0-boj-aims-to-achieve-2-inflation-as-measured-by-overall-cpi-governor-ueda-says/",
            "pub_date": "2025-02-04 11:38:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012100:0",
            "title": "Global Risks May Tilt Australia Central Bank to Cut Rate in February — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australia's core inflation remains high and the economy is fully employed, but global risks should make the Reserve Bank of Australia more dovish, say economists at HSBC Global Research. The escalation of trade tensions creates downside risk for the global economy and the scale and breadth of tariffs on products and countries suggest the impact is likely to be significant, say Paul Bloxham and Jamie Culling in a note. They reckon this is enough to tip the RBA's view to start supporting the economy a little earlier than expected. HSBC now sees the RBA cutting its cash rate by 25 bps this month, with another cut expected in 3Q and a final cut in the current cycle in 1Q 2026. (monica.gupta@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012100:0/",
            "pub_date": "2025-02-04 11:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV02V:0",
            "title": "COMMENT-China may not devalue the yuan - merely liberate it",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Much has been said about China keeping its powder dry to deal with Trump's trade tariffs when they hit. The time has come, and one obvious way to counter the broad levy is to weaken the yuan; Beijing might just relax its grip instead.</p><p class=\"\">The People's Bank of China's USD/CNY fixing on Wednesday will be more highly anticipated than usual, as Trump's initial slate of tariffs against China takes effect. It will be the first USD/CNY daily midpoint since onshore markets closed for the Lunar New Year; it was last set at 7.1698 on Jan 27. The U.S. dollar has since surged, driving the offshore USD/CNH to a new record high of 7.3765 on Monday; it currently trades around 7.3080.</p><p class=\"\">The Wall Street Journal reported on Monday that China will propose restoring the 'Phase One' trade deal, and pledge not to devalue the yuan. Whether this occurs is questionable, but it is possible given Trump's deal-making inclinations.</p><p class=\"\">The PBOC could still relax its control of the yuan benchmark on Wednesday, allowing it to move in line with other currencies that have fallen against the dollar. This could be portrayed as leaving the yuan to market forces, though it would in effect weaken it. </p><p class=\"\">The impact could be net-positive for Chinese assets if it's seen as a signal that Beijing is going to step up stimulus measures to mitigate coming U.S. trade barriers.</p><p class=\"\">For more click on  </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:869.8762035763411px;aspect-ratio:1.4497936726272354\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02V-a60d6b7b2f10410504f59d7bd1d7680b-resized.webp\" type=\"images/webp\"/><img alt=\"Daily Chart\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02V-a60d6b7b2f10410504f59d7bd1d7680b-resized.jpeg\" style=\"background-color:#2a2621\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">CNYfix</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:865.5737704918032px;aspect-ratio:1.442622950819672\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02V-c43faae4f9fe18a9eb9350be4c20992b-resized.webp\" type=\"images/webp\"/><img alt=\"Daily Chart\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV02V-c43faae4f9fe18a9eb9350be4c20992b-resized.jpeg\" style=\"background-color:#2c2825\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">CNH</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV02V:0-comment-china-may-not-devalue-the-yuan-merely-liberate-it/",
            "pub_date": "2025-02-04 11:40:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV08B:0",
            "title": "Julius Baer, Siam Commerical JV appoints Adrian Mazenauer As CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    SCB Julius Baer on Tuesday said it has appointed Adrian Mazenauer, currently the head of its wealth management business in Thailand, as its CEO.</p><p class=\"\">Mazenauer, who is also the company's deputy CEO, will be heading the joint venture backed by Swiss wealth manager Julius Baer  and Thailand's Siam Commerical Bank.</p><p class=\"\">The news come shortly after Julius Baer announced plans to cut 400 jobs and shrink the executive board to five from 15, after posting worse than expected 2024 pretax profit.</p><p class=\"\">\"His extensive expertise, deep understanding of the local wealth management landscape, and dedication to excellence make him the ideal leader to guide SCB Julius Baer into its next chapter,\" Siam Commercial Bank CEO and Chairman Kris Chantanotoke said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV08B:0-julius-baer-siam-commerical-jv-appoints-adrian-mazenauer-as-ceo/",
            "pub_date": "2025-02-04 11:40:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV02I:0",
            "title": "Indonesia passes law allowing creation of Temasek-like investment arm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's parliament on Tuesday approved a bill that allows the government to set up an investment agency that can manage stakes in some of the biggest state companies and is intended to operate like Singapore's investment arm Temasek. </p><p class=\"\">The creation of the Daya Anagata Nusantara Investment Management Agency, or Danantara, was announced soon after President Prabowo Subianto took office in October, with the aim of improving the performance and returns from state investments.</p><p class=\"\">The new agency is set to receive 1,000 trillion rupiah ($61 billion) in initial capital, Darmadi Durianto, a lawmaker from the parliament's commission overseeing the bill, told Reuters.</p><p class=\"\">In October, the government said Muliaman Hadad, a former chief of Indonesia's Financial Services Authority, would head up the agency.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV02I:0-indonesia-passes-law-allowing-creation-of-temasek-like-investment-arm/",
            "pub_date": "2025-02-04 11:33:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463130:0",
            "title": "Health and Happiness (H&H) International to Redeem $25 Million Senior Bonds; Shares Rise 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Health and Happiness (H&amp;H) International Holdings  will redeem $24.7 million senior notes on Feb. 13, according to a Monday filing with the Hong Kong Bourse. </p><p class=\"\">The bonds have a 13.5% interest rate and are due in 2026. The redemption price will equal 109.54% of the redemption principal amount and the accrued and unpaid interest to the redemption date. </p><p class=\"\">The company's stocks were up by about 5% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463130:0/",
            "pub_date": "2025-02-04 11:34:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463135:0",
            "title": "SEQ Hospitality's Takeover Bid for Eumundi Group Freed From Conditions",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SEQ Hospitality Group's off-market takeover bid for Eumundi Group  has been freed from conditions, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The offers remain subject to the 90% minimum acceptance threshold and scheme condition, per the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463135:0/",
            "pub_date": "2025-02-04 11:34:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:1b0e37623094b:0",
            "title": "Financial Times: China’s exporters to step up offshoring to beat Trump’s tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">An additional 10 per cent tariff on Chinese exporters is due at 1201 US Eastern time on Tuesday, February 4, 2025:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Extra Trump tariffs on China are due to hit in a little over 5 hours</li><li class=\"listItem-bmN0_SHH\">USD strength has crept back in as China tariff implementation time nears</li><li class=\"listItem-bmN0_SHH\">Trump China tariffs - Trump says will talk with Xi “probably over the next 24 hours”</li></ul><p class=\"\">The Financial Times is gated, but here is the link if you can access it:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">China's exporters to step up offshoring</li></ul><p class=\"\">In brief:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Chinese manufacturers say they will speed up efforts to move production to other countries to circumvent US tariffs</li><li class=\"listItem-bmN0_SHH\">locations including the Middle East</li></ul><p class=\"\">Other strategies include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">passing the cost to US customers</li><li class=\"listItem-bmN0_SHH\">seeking alternative markets</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:1b0e37623094b:0-financial-times-china-s-exporters-to-step-up-offshoring-to-beat-trump-s-tariffs/",
            "pub_date": "2025-02-04 11:20:12",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "marketindex:815ebb1b6094b:0",
            "title": "ASX Dividend Stocks: A 20-30% yielder (that's not a dividend trap)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cue Energy shares soared 49% last February after announcing a strong 1H24 result, which included a special dividend of 2 cents per share (yielding approximately 17%)</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">The company remains debt-free, generating strong cash flows, with a $17.1 million cash balance and fully funded development activities across Australia, Indonesia, and New Zealand</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cue's dividend strategy remains uncertain, but further clarity is expected at its half-year result in February</li></ul></span></div><span><p class=\"\">I'm on a mission to uncover some of the ASX's most compelling dividend-paying stocks. The aim is to provide readers with the key data and forecasts to make more informed decisions. Today, we're reviewing Cue Energy – a microcap oil and gas producer and exploration company.</p><p class=\"\">Cue Energy  has production assets across Australia, Indonesia and New Zealand. In most cases, the company holds a minority interest in these projects, with producing sharing contracts in place.</p><p class=\"\">Key Stats</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Market cap: $73 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cash: $17.1 million (as at 31 December 2024)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enterprise value: $55.9 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">12-month performance: 66.6%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">12-month price range: 6.3 cents - 12 cents</p></li></ul><p class=\"\">Major Projects</p><p class=\"\">Australia:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Mereenie (7.5% interest): Gas field in the Northern Territory</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Palm Valley (15% interest): Gas field in the Northern Territory</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Dingo (15% interest): Gas field in the Northern Territory</p></li></ul><p class=\"\">Indonesia:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Mahato PSC: The PB field in this Production Sharing Contract is a significant contributor to Cue's results, generating $19.7 million in revenue in 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Sampang PSC (15% interest): Includes two producing fields, Oyong and Wortel gas fields, and a gas discovery at Paus Biru</p></li></ul><p class=\"\">New Zealand:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PMP 38160 (Maari/Manaia): Oil production from these fields averaged approximately 4,900 barrels of oil per day over the 2024 financial year</p></li></ul><p class=\"\">What Makes Cue Interesting</p><p class=\"\">Cue has been profitable for the past four years, though its share price remained largely flat between December 2020 and January 2024. It wasn’t until its half-year FY24 result (29 February 2024) that the stock experienced a significant re-rate. That report highlighted:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue up 22% to $29.3 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net profit after tax up 34% to $9.1 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Rapidly repaid $4 million in debt, now debt-free</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Issued special dividend of 2 cents per share (a yield of approximately 17%)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Activities planned for all assets over the next 12 months to increase production from existing oil and gas fields</p></li></ul><p class=\"\">Cue returned $14 million to shareholders through a special dividend, representing a payout ratio of 100% of first-half net profits, plus an additional $4.9 million from cash reserves. The strong financial performance and dividend announcement sent the stock soaring by 49% on the day.</p><p class=\"\">Six months later, Cue’s FY24 result included a final dividend of 1 cent per share (yield of approximately 10%). </p><p class=\"\">Despite recent volatility in oil and gas prices, Cue continues to report solid cash flows. The latest December quarter report revealed:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net cash flow of $4.3 million </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cash balance of $17.1 million </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">No debt</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Total production of 146.4kboe (1Q25: 147.3kboe)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Development activity fully funded</p></li></ul><p class=\"\">What's Next</p><p class=\"\">Cue has not outlined a formal capital management strategy, and its latest quarterly report provided only a broad outlook.</p><p class=\"\">“These milestones reflect our strategic focus on maintaining strong cash flow, advancing development projects, and positioning Cue for continued growth and shareholder returns,” said CEO Matthew Boyall.</p><p class=\"\">Despite this, 2024 marked a clear shift in the company’s strategic priorities, with the introduction of a significant dividend payout for shareholders. Cue is expected to clarify its dividend intentions at its upcoming half-year result in February.</p><p class=\"\">Cue is generating strong cash flow, growing production, and fully funding its development activities. The December quarter alone delivered a free cash flow yield of approximately 5.8%.</p><p class=\"\">A key risk to future capital returns is if Cue prioritises growth over shareholder returns. This could come in the form of M&amp;A, increased investment in existing projects, or higher capital expenditures.</p></span></div>",
            "link": "https://www.tradingview.com/news/marketindex:815ebb1b6094b:0-asx-dividend-stocks-a-20-30-yielder-that-s-not-a-dividend-trap/",
            "pub_date": "2025-02-04 11:20:45",
            "source": "Market Index",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446466:0",
            "title": "New Zealand Dollar Pares Losses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The New Zealand dollar traded around $0.561 on Tuesday, paring sharp losses from the previous session after US President Donald Trump paused tariffs on Mexico and Canada late Monday.</p><p class=\"\">Trump postponed the 25% tariffs on both countries by a month, raising hopes they could be avoided entirely.</p><p class=\"\">However, uncertainty remained as markets awaited details, with the Trump administration yet to engage with China on a possible reprieve from the additional 10% tariffs set to take effect later today.</p><p class=\"\">Meanwhile, the prospect of further rate cuts by the Reserve Bank of New Zealand pressured the currency, with markets anticipating a 50bps reduction to 3.75% this month and a policy rate bottom of 3% over the next 12 months.</p><p class=\"\">On the economic front, investors now await New Zealand’s Q4 jobless rate data, set for release on Wednesday, after Q3 figures reached their highest level since Q4 2020.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446466:0-new-zealand-dollar-pares-losses/",
            "pub_date": "2025-02-04 11:25:50",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:5a3bce6c5094b:0",
            "title": "Titagarh Rail enters shipbuilding and maritime business in a major diversification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Titagarh Rail Systems has announced plans to enters the strategic space of shipbuilding and maritime systems, in an effort to enhance its strong presence in railway related manufacturing, a company statement said on February 3.</p><p class=\"\">The company announced the addition of a new business vertical for Shipbuilding and Maritime Systems, wherein it will undertake \"marine business including shipbuilding, ship repair and other maritime business activities.\"</p><p class=\"\">The railway wagon maker has also set up a new business vertical for 'signaling and safety systems' for railways. \"This segment focuses on railway operations, particularly in ensuring safety and efficiency and will involve development and installation of products that enables smooth and secure train operations,\" said Titagarh Rail.</p><p class=\"\">Titagarh Rail has a market capitalization of Rs 12,200 crore, and the shares of the company are down 10% in last one year, and over 17% since the start of 2025. There was a sharp selloff in the shares of the company on Budget Day on February 1, possibly due to a muted capex announcement.This is being updated.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:5a3bce6c5094b:0-titagarh-rail-enters-shipbuilding-and-maritime-business-in-a-major-diversification/",
            "pub_date": "2025-02-04 11:26:17",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012064:0",
            "title": "Centurion Corp. Appears Well-Placed for Higher Rental Rates in Singapore — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Centurion Corp. looks well-placed to generate higher rental rates in Singapore given the dormitory supply shortage situation, RHB Research's Alfie Yeo says in a research report. Its purpose-built workers' accommodation bed rates in Singapore continue to be robust, and thanks to the demand-supply situation, RHB sees ongoing upward rental adjustments boosting its average bed rates. RHB lifts its 2025-2026 earnings estimates for the Singapore-listed manager of workers and student accommodations by 9% each year. RHB maintains the stock's buy rating and raises the stock's target price to S$1.16 from S$1.06. Shares are 0.5% higher at S$0.995. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012064:0/",
            "pub_date": "2025-02-04 11:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446467:0",
            "title": "Offshore Yuan Steady Amid Trade Deal Hopes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The offshore yuan held steady around 7.30 per dollar, after recovering  from a record low overnight, driven by optimism about a possible trade deal to avoid 10% tariffs on Chinese goods.</p><p class=\"\">However, uncertainty remains as Trump warned of substantial levies if no deal is reached.</p><p class=\"\">This aligns with a broader stabilization in major currencies following the temporary suspension of tariffs on Canada and Mexico.</p><p class=\"\">Meanwhile, the yuan faced  pressure as traders await China’s next daily reference rate, expecting authorities to loosen control and allow the currency to weaken if Trump’s tariffs take effect, especially as a strong dollar complicates efforts to stabilize it.</p><p class=\"\">Additionally, recent data showed China’s manufacturing activity slowed in January, missing expectations and marking the slowest growth in four months, adding pressure on Beijing to boost economic stimulus amid US tariffs.</p><p class=\"\">Investors are now eyeing upcoming additional PMI data and inflation figures next week.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446467:0-offshore-yuan-steady-amid-trade-deal-hopes/",
            "pub_date": "2025-02-04 11:27:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L3N3OO01L:0",
            "title": "KKR-Bain standoff tests Japan’s buyout patience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Missteps were inevitable in Japan’s fledgling M&amp;A trade as foreign investors and listed companies work out best practices. But the slow grind between U.S. private equity rivals KKR  and Bain Capital for Fuji Soft , a $4 billion IT firm with chunky real estate assets, is anathema to Tokyo’s desire for efficient value-creating deals. The longer it drags on, the more it risks damaging foreign investors' reputations. </p><p class=\"\">The last six months have seen a preponderance of left feet and crushed toes. The first surprise came from Bain in September, when it floated a non-binding offer, about 5% above a binding one from KKR of 8,880 yen per share. Bain cast itself as a white knight and conditioned its promises to firm up a bid on a recommendation from Fuji Soft’s board.</p><p class=\"\">Fuji Soft's special committee demurred and stuck by KKR, who took the unusual move of splitting its tender offer into two successive parts. That allowed it to snap up a 34% stake from activist investors including 3D Investment Partners, who first solicited buyout offers in 2023. </p><p class=\"\">The plan was perhaps too clever by half, however. KKR bagged enough shares to block any rival takeover but is left holding a minority stake in a publicly listed company, a position through which it can't add much value. KKR subsequently raised both parts of its offer to 9,451 yen. Nonetheless, unconvinced investors have forced the buyout firm to extend the second tender offer three times, with the latest ending on Feb. 7. KKR even asked Fuji Soft to file an injunction against Bain, which expects to launch its bid at 9,600 yen this month even without management's support. </p><p class=\"\">For now, the share price continues to hover above the offer prices but there is also a time value to money. Japanese regulators ought to consider how they can hasten M&amp;A proceedings and whether introducing something akin to the UK's \"put up or shut up rule\" might help to give targets more certainty. It was only a decade ago that foreign private equity groups were seen as vultures, and one protracted messy deal could be a setback for everybody. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:766.1870503597123px;aspect-ratio:1.276978417266187\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OO01L-fd17aa77b65b88d6761dc6044e3d9147-resized.webp\" type=\"images/webp\"/><img alt=\"Line chart showing Fuji Soft share price and prices of binding offers from KKR and Bain\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OO01L-fd17aa77b65b88d6761dc6044e3d9147-resized.jpeg\" style=\"background-color:#fbfaf9\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Fuji Soft buyout drama grows long in the tooth</span></figcaption></figure></span></p><p class=\"\">Follow @KangHexin on X</p><p class=\"\">CONTEXT NEWS</p><p class=\"\">U.S. private equity group KKR on Jan. 24 extended the deadline for the second stage of a tender offer to take control of Fuji Soft, a Japanese software services company. </p><p class=\"\">The extension until Feb. 7 was the third in just over a month and left KKR’s offer price unchanged at 9,451 yen per share, below the stock’s latest close of 9,800 yen. The offer values the company's equity at $4.1 billion. KKR picked up its existing 34% stake in Fuji Soft in the first tender offer, which closed in November. </p><p class=\"\">Rival Bain Capital announced on Dec. 18 that it would pursue a take-private of Fuji Soft at 9,600 yen per share even without management's support. The two buyout firms have been sparring over the company since KKR first announced its binding offer at 8,800 per share in August.</p><p class=\"\">Activist 3D Investment Partners kicked off a sale process for Fuji Soft roughly a year earlier by soliciting take-private proposals and submitting them to the company's board. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L3N3OO01L:0-kkr-bain-standoff-tests-japan-s-buyout-patience/",
            "pub_date": "2025-02-04 11:27:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463131:0",
            "title": "Market Chatter: China's Shanxi Province Logs 19% Jump in 2024 Coal-Bed Methane Output",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The coal-bed methane output in China's Shanxi Province in 2024 jumped 18.9% year on year to a record high of 13.4 billion cubic meters, Yicai Global reported Monday, citing the provincial statistics bureau. </p><p class=\"\">The coal-bed methane or CBM, a coal byproduct, can be used as a clean energy source, reducing its risk as a cause for gas explosions in coal mines, the report said. </p><p class=\"\">Shanxi's CBM resources for 2024 accounted for 80.6% of China's total output, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463131:0/",
            "pub_date": "2025-02-04 11:30:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3L7080:0",
            "title": "Indonesia parliament passes law allowing for creation of Temasek-like investment arm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's parliament on Tuesday approved a bill that allows the government to set up an investment agency that can manage stakes in some of the biggest state companies and is intended to operate like Singapore's investment arm Temasek.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3L7080:0-indonesia-parliament-passes-law-allowing-for-creation-of-temasek-like-investment-arm/",
            "pub_date": "2025-02-04 11:18:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV044:0",
            "title": "Indonesian fund, Mitsui vie for $300 mln stake in toll operator RKE, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indonesia's sovereign wealth fund, Indonesia Investment Authority (INA), and Japan's Mitsui &amp; Co  are among prospective buyers of CVC Capital Partners' 25% stake in Indonesian toll road operator RKE International, valued at up to $300 million, two sources with knowledge of the matter said.</p><p class=\"\">CVC, a Luxembourg-based investment firm, initiated the sale process for its 25% stake in RKE International, also known as Road King Expressway International Holdings, late last year. The sale attracted interest from various financial investors and strategic companies, one of the sources added. </p><p class=\"\">The potential transaction could value CVC's stake at around $250 million to $300 million, or the whole company at up to $1 billion, both sources said. </p><p class=\"\">The remaining stake in RKE International is held by Hong Kong-listed property development and infrastructure group Road King Infrastructure .</p><p class=\"\">The sources declined to be named as the matter was private.</p><p class=\"\">CVC declined to comment. RKE International and Road King did not respond to emailed requests seeking comment. INA said it was unable to comment on the matter. Mitsui refrained from commenting on individual matters.</p><p class=\"\">The sale comes amid growing global investors' interest in infrastructure assets across Southeast Asia lured by the region's growth prospects and the sector's stable and long-term returns against the backdrop of global uncertainties.</p><p class=\"\">RKE International's current toll road portfolio consists of four Indonesian expressways spanning around 335 kilometers (208.2 miles) in total located in the provinces of Central Java, East Java and North Sumatra, according to Road King's website. </p><p class=\"\">In 2018, CVC invested 2 billion Hong Kong dollar ($256.7 million) into RKE International, which at that time had a portfolio of expressways in China, according to an announcement at that time. </p><p class=\"\">In November 2023, RKE International sold its Chinese expressway assets to Hong Kong-based Cornerstone Holdings Ltd. for 4.4 billion yuan ($606.8 million), according to stock exchange filings.</p><p class=\"\">($1 = 7.7918 Hong Kong dollars)</p><p class=\"\">($1 = 7.2507 Chinese yuan)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV044:0-indonesian-fund-mitsui-vie-for-300-mln-stake-in-toll-operator-rke-sources-say/",
            "pub_date": "2025-02-04 11:20:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}