{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbGhT1M:0",
            "title": "FAVO Capital Inc. Partners with IBN to Strengthen Investor Communications and Market Visibility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — via IBN – FAVO Capital Inc. , a leading provider of alternative financing solutions in the private credit sector, has engaged IBN, a multifaceted financial media and publishing firm, to enhance its investor communications strategy, serve as its investor relations liaison, and expand market reach.</p><p class=\"\">FAVO Capital is transforming the private credit and alternative lending industry by expanding funding capacity, enhancing technology-driven underwriting models, and optimizing borrower acquisition strategies to drive market share growth and investor value.</p><p class=\"\">To meet the growing demand for non-bank financing solutions, FAVO Capital provides fast, flexible funding to underserved small and medium-sized businesses. By leveraging proprietary underwriting algorithms and a data-driven approach, the company streamlines access to working capital while mitigating risk, positioning itself as a key player in the $1.5 trillion alternative lending market.</p><p class=\"\">As part of its strategic roadmap to uplist to Nasdaq, FAVO Capital is optimizing its capital structure, strengthening regulatory compliance, and advancing institutional partnerships to support long-term growth. Additionally, the company is developing an advanced digital platform to enhance client engagement and streamline funding processes. This platform will enable businesses to apply for funding, track progress, and manage repayments with greater efficiency. A complementary mobile app is also in development to provide real-time financial insights and tailored funding recommendations, improving the overall borrower experience.</p><p class=\"\">As part of the Client Partner relationship, IBN will leverage its investor-focused distribution network, which includes over 5,000 key syndication outlets, various newsletters, social media channels, and wire services via InvestorWire, along with blogs and other outreach tools, to generate greater awareness for FAVO Capital.</p><p class=\"\">With over 19 years of experience assisting over 500 client partners and a sizable family of 70+ trusted brands, IBN has amassed a collective audience that includes millions of social media followers. This positions IBN to provide FAVO Capital the solutions needed to reach a wide audience of investors, journalists, and the general public.</p><p class=\"\">To learn more about FAVO Capital, please visit the company’s corporate newsroom at https://IBN.fm/FAVO</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FAVO Capital Inc.</strong></p><p class=\"\">FAVO Capital Inc.  is a fast-growing alternative finance company specializing in flexible, technology-driven funding solutions for emerging, small, and medium-sized businesses. Headquartered in Fort Lauderdale, Florida, FAVO leverages advanced underwriting models and a client-centric approach to bridge gaps left by traditional lenders.</p><p class=\"\">With a commitment to efficiency, flexibility, and long-term growth, FAVO Capital is dedicated to providing scalable financial solutions that help businesses access the capital they need to succeed in an evolving market.</p><p class=\"\">For more information, visit www.FAVOCapital.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IBN</strong></p><p class=\"\">IBN consists of financial brands introduced to the investment public over the course of 19+ years. With IBN, we have amassed a collective audience of millions of social media followers. These distinctive investor brands aim to fulfill the unique needs of a growing base of client-partners. IBN will continue to expand our branded network of highly influential properties, leveraging the knowledge and energy of specialized teams of experts to serve our increasingly diversified list of clients.</p><p class=\"\">Through our Dynamic Brand Portfolio (DBP), IBN provides: (1) access to a network of wire solutions via InvestorWire to reach all target markets, industries and demographics in the most effective manner possible; (2) article and editorial syndication to 5,000+ news outlets; (3) Press Release Enhancement to ensure maximum impact; (4) full-scale distribution to a growing social media audience; (5) a full array of corporate communications solutions; and (6) total news coverage solutions.</p><p class=\"\">For more information, please visit https://www.InvestorBrandNetwork.com</p><p class=\"\">Please see full terms of use and disclaimers on the InvestorBrandNetwork website applicable to all content provided by IBN, wherever published or re-published: http://IBN.fm/Disclaimer</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended. All forward-looking statements are inherently uncertain as they are based on current expectations and assumptions concerning future events or future performance of the company. Readers are cautioned not to place undue reliance on these forward-looking statements, which are only predictions and speak only as of the date hereof. In evaluating such statements, prospective investors should review carefully various risks and uncertainties identified in this release and matters set in the company's SEC filings. These risks and uncertainties could cause the company's actual results to differ materially from those indicated in the forward-looking statements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Corporate Communications</strong></p><p class=\"\">IBN</p><p class=\"\">Austin, Texas</p><p class=\"\">www.InvestorBrandNetwork.com</p><p class=\"\">512.354.7000 Office</p><p class=\"\">Editor@InvestorBrandNetwork.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbGhT1M:0-favo-capital-inc-partners-with-ibn-to-strengthen-investor-communications-and-market-visibility/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX66ZY3f:0",
            "title": "EZCORP to Release First Quarter Fiscal 2025 Results After Market Close on Wednesday, February 5th, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AUSTIN, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — EZCORP, Inc. (“EZCORP” or the “Company”) , a leading provider of pawn transactions in the United States and Latin America, will issue first quarter fiscal 2025 results (period ended December 31, 2024) on Wednesday, February 5th, 2025, after the market close.</p><p class=\"\">The Company will host a webcast and conference call at 9:00 a.m. Eastern time on Thursday, February 6th, 2025, to discuss its results. The presentation slides will be posted to the Investor Relations section of its website after the market close on Wednesday, February 5th, 2025.</p><p class=\"\">Date Thursday, February 6th, 2025</p><p class=\"\">Time: 9:00 a.m. Eastern time</p><p class=\"\">Dial-in registration link: https://register.vevent.com/register/BI86f9072cf4c447ae86954e0a22daa957</p><p class=\"\">Live webcast registration link: https://edge.media-server.com/mmc/p/j568nkgu</p><p class=\"\">A replay of the conference call will be available online at http://investors.ezcorp.com shortly after the live call concludes. If you have any difficulty accessing the conference call, please contact Elevate IR at EZPW@elevate-ir.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EZCORP</strong></p><p class=\"\">Formed in 1989, EZCORP has grown into a leading provider of pawn transactions in the United States and Latin America. We also sell pre-owned and recycled merchandise, primarily collateral forfeited from pawn lending operations and merchandise purchased from customers. We are dedicated to satisfying the short-term cash needs of consumers who are both cash and credit constrained, focusing on an industry-leading customer experience. EZCORP is traded on NASDAQ under the symbol EZPW and is a member of the S&amp;P 1000 Index and Nasdaq Composite Index.</p><p class=\"\">Follow EZCORP on social media:</p><p class=\"\">Facebook EZPAWN Official https://www.facebook.com/EZPAWN/</p><p class=\"\">EZCORP Instagram Official https://www.instagram.com/ezcorp_official/</p><p class=\"\">EZPAWN Instagram Official https://www.instagram.com/ezpawnofficial/</p><p class=\"\">EZCORP LinkedIn https://www.linkedin.com/company/ezcorp/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Sean Mansouri, CFA</p><p class=\"\">Elevate IR</p><p class=\"\">EZPW@elevate-ir.com</p><p class=\"\">(720) 330-2829</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX66ZY3f:0-ezcorp-to-release-first-quarter-fiscal-2025-results-after-market-close-on-wednesday-february-5th-2025/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006306_20250204006306:0",
            "title": "Data443 Acquires Breezemail.Ai, Accelerating AI-Powered Email Privacy Capabilities For Microsoft Office And Google GMail >ATDS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006306_20250204006306:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5xNM9m:0",
            "title": "Coquille Tribe Breaks Ground on New Distillery, Heritage Distilling-Branded Tasting Room & Expanded Entertainment Zone at Coos Bay Casino",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EUGENE, Ore., Feb.  04, 2025  (GLOBE NEWSWIRE) — Heritage Distilling Company, Inc. (\"HDC\" or \"Heritage\" or \"The Company\"), a leading craft distiller of innovative premium brands, and the Coquille Indian Tribe of Oregon announced the ground breaking of Oregon’s first Tribally-Owned distillery and tasting room, located at The Mill Casino-Hotel &amp; RV Park on Coos Bay, in North Bend, Oregon. The project broke ground this month and is expected to open to the public by the end of the year. Both Heritage and Coquille-branded spirits will be produced and bottled on Tribal land and sold at the casino’s several bars, restaurants and retail outlets.</p><p class=\"\">“After more than two years of planning, negotiating with the state of Oregon, and completing design work, we are thrilled to have broken ground on this historic project,” said Margaret Simpson, Chief Executive Officer of CEDCO, the Tribe’s venture arm that owns and operates The Mill Casino-Hotel &amp; RV Park. “All members of the team, including Heritage Distilling and fi architecture, have brought forth a design for a customer experience space that will be unparalleled for hundreds of miles in every direction. The completion of this project at The Mill further solidifies our casino and resort as the premier destination in the region.”</p><p class=\"\">The project will feature an updated Plank House restaurant, two indoor digital golf suites and a Heritage-branded tasting room. Spanning two levels and with panoramic views of Coos Bay, the tasting room includes two full-service bars, a cigar lounge, retail space, private event suites and Heritage’s proprietary Cask Club®.</p><p class=\"\">Led by Justin and Jennifer Stiefel since 2011, Heritage is the most-awarded craft distillery in North America by the American Distilling Institute for a decade and is recognized for its brand family of premium whiskies, gins, vodkas, rums and ready-to-drink cocktails. Beyond their mastery of distilling, the Stiefels saw both an injustice done to Native American indigenous communities and a mutually beneficial economic opportunity to create national distribution for Heritage’s portfolio of craft spirits. Together, they established the Tribal Beverage Network (TBN), a first-of-its-kind partnership with Native American Tribes to develop Heritage-branded distilleries, brands and tasting rooms to serve patrons of Tribal casinos and entertainment venues.</p><p class=\"\">Jennifer Stiefel, president and co-founder of Heritage Distilling, added: “We are honored to break ground on this historic project with the Coquille Tribe. This marks a significant milestone for the Tribe, the Tribal Beverage Network and Oregon’s craft spirits industry. The Tribe’s commitment to economic self-sufficiency and innovation aligns perfectly with Heritage Distilling’s mission, and we are proud to stand alongside them in bringing the state’s first Tribally-Owned distillery to life. This is more than a distillery—it’s a long-term economic resource that will support the Tribe for generations to come.”</p><p class=\"\">The distillery will be modeled after Heritage’s industry-leading operations derived from its five distilleries and tasting rooms across Washington and Oregon. As a TBN partner, the Coquille-owned and operated destination will also offer several amenities for patrons including a tasting room that features Heritage spirits like Cocoa Bomb Chocolate Whiskey, Heritage canned cocktails, Florescence Vodka, Stiefel’s Select Single Barrel and small batch whiskeys, and Heritage’s latest Salute Series which honors and supports military and first responder communities.</p><p class=\"\">In addition to on-site tastings, the Coquille distillery will also extend unique membership programs available to TBN partners: The Cask Club®, an annual membership-based program that allows members to create, customize and age spirits of their choice; and The Spirits Club®, a program that provides members quarterly shipments of Heritage’s award-winning spirits delivered directly to their door at a reduced rate, as well as priority access to new, limited and seasonal releases.</p><p class=\"\">The project designs were conceived by the team at fi architecture in Gig Harbor, Washington, the longtime design partner for all of Heritage Distilling’s retail and TBN locations. Detailed renderings of the project can be found on the fi architecture website here.</p><p class=\"\">TBN members can benefit from wholesale and retail margins and tax capture. In addition, Tribes entering this industry can generate funds to support social and economic initiatives, increase employment, diversify the skillsets of their members and work with Heritage to create their brands to celebrate the unique characteristics of a Tribe or region.</p><p class=\"\">The Coquille Tribe’s announcement follows on the heels of a recent announcement by the Tonto Apache Tribe in Payson, Arizona on its plans to open a Heritage Distilling branded location in partnership with Heritage at the Mazatzal Hotel and Casino’s newest development, Apache Corners. Until recently, an 1834 federal law prohibited anyone from setting up a distillery on Tribal land for manufacturing “ardent spirits.” In large part due to Heritage Distilling Company’s efforts, the antiquated Andrew Jackson-era law was finally repealed by Congress in 2018, paving the way for the Coquille Indian Tribe to pursue distillery operations on Tribal lands.</p><p class=\"\">Heritage has several other Tribes participating in TBN, with partnership announcements planned in line with each Tribe’s development timeline. For more information on Heritage Distilling Company and the Tribal Beverage Network, visit heritagedistilling.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Coquille Indian Tribe</strong></p><p class=\"\">The Coquille Indian Tribe flourished in Oregon’s southwestern corner for thousands of years, cherishing the bountiful forests, rivers and beaches of a homeland encompassing more than 750,000 acres. In 1954, Congress declared the Coquille Tribe “terminated.” 35 years later the Tribe was formally restored to federal recognition in 1989. Today the Tribe numbers more than 1,100 members and it has regained more than 10,000 acres of ancestral homeland, proudly managing the bulk of it as sustainable forest. The Tribe provides education assistance, health care, elder services and (where needed) housing assistance to its people, while contributing substantially to the surrounding community’s economy. Its various enterprises employ approximately 600 people, and its community fund is the region’s leading local source of charitable grants.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Heritage Distilling Company, Inc.</strong></p><p class=\"\">Heritage is among the premier independent craft distilleries in the United States offering a variety of whiskeys, vodkas, gins, rums and ready-to-drink canned cocktails. Heritage has been North America's most awarded craft distillery by the American Distilling Institute for ten consecutive years out of the more than 2,600 craft producers. Beyond this remarkable achievement, Heritage has also garnered numerous Best of Class, Double Gold, and Gold medals at esteemed national and international spirits competitions. As one of the largest craft spirits producers on the West Coast by revenue, the company is expanding its presence nationwide through a diverse range of sales channels, including wholesale, on-premises venues, e-commerce, and the innovative Tribal Beverage Network (TBN). The TBN initiative, a groundbreaking collaboration with Native American Tribes, focuses on developing Heritage-branded distilleries, unique Tribal brands, and tasting rooms tailored to Tribal communities. By serving patrons of Tribal casinos and entertainment venues, the TBN creates meaningful economic and social benefits for participating Tribes, while providing an additional avenue for Tribes to exercise and strengthen their sovereignty. This unique partnership reflects Heritage’s commitment to innovation, community engagement, and sustainable growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements, including statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements may be identified by words such as \"aims,\" \"anticipates,\" \"believes,\" \"could,\" \"estimates,\" \"expects,\" \"forecasts,\" \"goal,\" \"intends,\" \"may,\" \"plans,\" \"possible,\" \"potential,\" \"seeks,\" \"will,\" and variations of these words or similar expressions that are intended to identify forward-looking statements. Any such statements in this press release that are not statements of historical fact may be deemed to be forward-looking statements. These forward-looking statements include, without limitation, statements regarding anticipated results or benefits anticipated from the opening and operation of the TBN location mentioned in this press release or any other current or potential TBN location. Any forward-looking statements in this press release are based on Heritage’s current expectations, estimates and projections only as of the date of this release and are subject to a number of risks and uncertainties that could cause actual results to differ materially and adversely from those set forth in or implied by such forward-looking statements. These risks and uncertainties include, but are not limited to, the risks of expanding sales and revenue due to the addition of new members of the executive team or new directors to the board. These and other risks concerning Heritage’s programs and operations are described in additional detail in its registration statement on Form S-1, which is on file with the SEC. Heritage explicitly disclaims any obligation to update any forward-looking statements except to the extent required by law.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\">Contacts</td></tr><tr><td>The Mill CasinoMichael LaffeyMlaffey@themillcasino.com(541) 252-8251</td><td>Heritage Distilling Co.InvestorsScott EcksteinHeritage@kcsa.com(212) 896-1210</td></tr><tr><td> </td><td>Heritage Distilling Co.MediaFrancesca DeMauroHeritage@kcsa.com(917) 880-9771</td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5xNM9m:0-coquille-tribe-breaks-ground-on-new-distillery-heritage-distilling-branded-tasting-room-expanded-entertainment-zone-at-coos-bay-casino/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006353:0",
            "title": "Chubb Appoints Seth Gillston Head of Global Casualty for North America Major Accounts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chubb Appoints Seth Gillston Head of Global Casualty for North America Major Accounts</p><p class=\"\">PR Newswire</p><p class=\"\">NEW YORK, Feb. 4, 2025</p><p class=\"\">Lou Capparelli to serve as Chairman of Global Casualty</p><p class=\"\">NEW YORK, Feb. 4, 2025 /PRNewswire/ — Chubb today announced the appointment of Seth Gillston as Executive Vice President, Head of Global Casualty for Major Accounts in North America. Seth will oversee the day-to-day operations of the Chubb Global Casualty business unit, which provides domestic casualty insurance coverage offerings and service solutions to large national and multinational companies.</p><p class=\"\">In addition, he will lead all strategies around production, product development and management, and profit and loss performance. Seth will be based in New York City and report to Matt Merna, Senior Vice President, Chubb Group and Division President, North America Major Accounts. Seth succeeds Lou Capparelli, who will now serve as Chairman of Global Casualty.</p><p class=\"\">\"Seth's extensive experience and deep understanding of our clients' needs will be invaluable as he drives the strategic direction of the Global Casualty business,\" said Merna. \"Together, Seth and Lou will work closely to enhance our capabilities and service offerings, aligning our global casualty strategies with the needs of our distribution partners and clients, further strengthening our position as a leading provider of casualty solutions.\"</p><p class=\"\">Gillston has nearly 30 years of insurance industry experience. He joined Chubb in 2000 and has held leadership roles in M&amp;A and Private Equity, Global Casualty, Real Estate &amp; Hospitality Practice, Alternative Risk Solutions group and North America Industry Practices.</p><p class=\"\">Capparelli joined Chubb in 2002 and has led the Global Casualty business unit since 2017. Previously, he served as Executive Vice President of Chubb's Global Casualty Field Operations.</p><p class=\"\">About Chubb</p><p class=\"\">Chubb is a world leader in insurance. With operations in 54 countries and territories, Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance to a diverse group of clients. The company is defined by its extensive product and service offerings, broad distribution capabilities, exceptional financial strength and local operations globally. Parent company Chubb Limited is listed on the New York Stock Exchange  and is a component of the S&amp;P 500 index. Chubb employs approximately 40,000 people worldwide. Additional information can be found at: www.chubb.com.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/chubb-appoints-seth-gillston-head-of-global-casualty-for-north-america-major-accounts-302367464.html</p><p class=\"\">SOURCE Chubb</p><p class=\"\">/CONTACT: Media Contact: mediarelations@chubb.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006353:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006326_20250204006326:0",
            "title": "Catheter Precision, Inc. Announces The Closing Of Its Acquisition Of PeriKard, LLC >VTAK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006326_20250204006326:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5rLXyv:0",
            "title": "CVR Partners to Release Fourth Quarter and Full-Year 2024 Earnings Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUGAR LAND, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — CVR Partners, LP , a manufacturer of ammonia and urea ammonium nitrate (UAN) solution fertilizer products, plans to release its fourth quarter and full-year 2024 earnings results on Tuesday, Feb. 18, after the close of trading on the New York Stock Exchange. The Partnership also will host a teleconference call on Wednesday, Feb. 19, at 11 a.m. Eastern to discuss these results.</p><p class=\"\">This call, which will contain forward-looking information, will be webcast live and can be accessed on the Investor Relations section of CVR Partners’ website at www.CVRPartners.com. For investors or analysts who want to participate during the call, the dial-in number is (877) 407-8029. The webcast will be archived and available for 14 days at https://edge.media-server.com/mmc/p/kcgnk2wr. A repeat of the call also can be accessed for 14 days by dialing (877) 660-6853, conference ID 13751233.</p><p class=\"\">CVR Partners’ fourth quarter and full-year 2024 earnings news release will be distributed via GlobeNewswire and posted at www.CVRPartners.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CVR Partners, LP</strong></p><p class=\"\">Headquartered in Sugar Land, Texas, CVR Partners, LP is a Delaware limited partnership focused on the production, marketing and distribution of nitrogen fertilizer products. It primarily produces urea ammonium nitrate (UAN) and ammonia, which are predominantly used by farmers to improve the yield and quality of their crops. CVR Partners’ Coffeyville, Kansas, nitrogen fertilizer manufacturing facility includes a 1,300 ton-per-day ammonia unit, a 3,100 ton-per-day UAN unit and a dual-train gasifier complex having a capacity of 89 million standard cubic feet per day of hydrogen. CVR Partners’ East Dubuque, Illinois, nitrogen fertilizer manufacturing facility includes a 1,075 ton-per-day ammonia unit and a 950 ton-per-day UAN unit.</p><p class=\"\">For further information, please contact:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations: </strong>                                </p><p class=\"\">Richard Roberts</p><p class=\"\">CVR Partners, LP                                         </p><p class=\"\">(281) 207-3205                                         </p><p class=\"\">InvestorRelations@CVRPartners.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Relations:</strong></p><p class=\"\">Brandee Stephens</p><p class=\"\">CVR Partners, LP</p><p class=\"\">(281) 207-3516</p><p class=\"\">MediaRelations@CVRPartners.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5rLXyv:0-cvr-partners-to-release-fourth-quarter-and-full-year-2024-earnings-results/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4y6h6y:0",
            "title": "CVR Energy to Release Fourth Quarter and Full-Year 2024 Earnings Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUGAR LAND, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — CVR Energy, Inc.  plans to release its fourth quarter and full-year 2024 earnings results on Tuesday, Feb. 18, after the close of trading on the New York Stock Exchange. The Company also will host a teleconference call on Wednesday, Feb. 19, at 1 p.m. Eastern to discuss these results.</p><p class=\"\">This call, which will contain forward-looking information, will be webcast live and can be accessed on the Investor Relations section of CVR Energy’s website at www.CVREnergy.com. For investors or analysts who want to participate during the call, the dial-in number is (877) 407-8291. The webcast will be archived and available for 14 days at https://edge.media-server.com/mmc/p/4a2maqba. A repeat of the call also can be accessed for 14 days by dialing (877) 660-6853, conference ID 13751234.</p><p class=\"\">CVR Energy’s fourth quarter and full-year 2024 earnings news release will be distributed via GlobeNewswire and posted at www.CVREnergy.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CVR Energy, Inc.</strong></p><p class=\"\">Headquartered in Sugar Land, Texas, CVR Energy is a diversified holding company primarily engaged in the renewables, petroleum refining and marketing businesses as well as in the nitrogen fertilizer manufacturing business through its interest in CVR Partners, LP. CVR Energy subsidiaries serve as the general partner and own 37 percent of the common units of CVR Partners, LP.</p><p class=\"\">For further information, please contact: </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations:</strong> </p><p class=\"\">Richard Roberts</p><p class=\"\">CVR Energy, Inc. </p><p class=\"\">(281) 207-3205</p><p class=\"\">InvestorRelations@CVREnergy.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Relations:</strong> </p><p class=\"\">Brandee Stephens                        </p><p class=\"\">CVR Energy, Inc. </p><p class=\"\">(281) 207-3516</p><p class=\"\">MediaRelations@CVREnergy.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4y6h6y:0-cvr-energy-to-release-fourth-quarter-and-full-year-2024-earnings-results/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4gh7l6:0",
            "title": "AmpliTech Group's AmpliTech Inc. Division Secures Additional Purchase Orders Under 5-Year Basic Order Agreement With Fortune 1000 U.S. Company",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HAUPPAUGE, N.Y., Feb.  04, 2025  (GLOBE NEWSWIRE) — AmpliTech Group, Inc. (Nasdaq: AMPG, AMPGW), a designer, developer, and manufacturer of state-of-the-art signal processing components for satellite, Public and Private 5G, and other communications networks, including the design of complete 5G/6G systems and a global distributor of packages and lids for integrated circuits assembly, today announced receiving additional Purchase Orders, as part of the recently announced signing of a 5 Year Basic Order Agreement (BOA), with a US based Fortune 1000 Company. These purchase orders increase the cumulative PO’s received by the company in excess of US$1M in Q1 to date, all orders deliverable within Fiscal Year 2025.</p><p class=\"\">“We are thrilled to announce that our Q1 bookings have already exceeded the $1M milestone, and we eagerly anticipate the arrival of long-awaited orders for our 5G Division in the coming weeks,” said Fawad Maqbool, CEO of AmpliTech Group. “We’re equally delighted with the robust performance of orders generated by our BOA with the Fortune 1000 company, which we believe is a direct testament to our proprietary low noise technology driving superior performance in LNAs and LNBs. These additional purchase orders not only highlights our technological edge but also reinforces the strategic impact of our R&amp;D investments in new product lines—fueling both revenue growth and enhanced potential profitability for our shareholders.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About AmpliTech Group</strong></p><p class=\"\">AmpliTech Group, Inc., comprising five divisions—AmpliTech Inc., Specialty Microwave, Spectrum Semiconductors Materials, AmpliTech Group Microwave Design Center, and AmpliTech Group True G Speed Services—is a leading designer, developer, manufacturer, and distributor of cutting-edge radio frequency (RF) microwave components and 5G network solutions. Serving global markets including satellite communications, telecommunications (5G &amp; IoT), space exploration, defense, and quantum computing, AmpliTech Group is committed to advancing technology and innovation. For more information, please visit www.amplitechgroup.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">This release contains statements that constitute forward-looking statements. These statements appear in several places in this release and include all statements that are not statements of historical fact regarding the intent, belief or current expectations of the Company, its directors or its oﬃcers with respect to, among other things, that the receipt of these follow on orders will lead to further production orders, work for the customer, growth and profitablity. The words \"may\" \"would\" \"will\" \"expect\" \"estimate\" \"anticipate\" \"believe\" \"intend\" for 5G orders and similar expressions and variations thereof are intended to identify forward-looking statements. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, many of which are beyond the Company's ability to control, and that actual results may differ materially from those projected in the forward-looking statements because of various factors. Other risks are identiﬁed and described in more detail in the “Risk Factors” section of the Company’s ﬁlings with the SEC, which are available on our website and with the SEC at sec.gov. We undertake no obligation to update, and we do not have a policy of updating or revising these forward-looking statements, except as required by applicable law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Corporate Social Media</strong></p><p class=\"\">X:<strong class=\"root-Tkn6WL2y\"> </strong>@AmpliTechAMPG</p><p class=\"\">Instagram:<strong class=\"root-Tkn6WL2y\"> </strong>@AmpliTechAMPG</p><p class=\"\">Facebook: AmpliTechInc</p><p class=\"\">LinkedIn<strong class=\"root-Tkn6WL2y\">: </strong>AmpliTech Group Inc</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Social Media</strong></p><p class=\"\">X: @AMPG_IR</p><p class=\"\">StockTwits: @AMPG_IR</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company Contact:</strong></p><p class=\"\">Jorge Flores</p><p class=\"\">Tel: 631-521-7831</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors@amplitechgroup.com</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4gh7l6:0-amplitech-group-s-amplitech-inc-division-secures-additional-purchase-orders-under-5-year-basic-order-agreement-with-fortune-1000-u-s-company/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006375:0",
            "title": "Alpha Modus Sues Walgreens Over Alleged Patent Infringement of AI Tech",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Don Nico Forbes</p><p class=\"\">Alpha Modus filed a lawsuit against Walgreens for what it called patent infringement concerning its AI-driven retail technology.</p><p class=\"\">The technology company said a patent for its AI retail technology--which is designed to enhance in-store shopping through data-driven insights, interactive advertising and consumer engagement tools--is being infringed by Walgreens' Cooler Screens digital smart screens.</p><p class=\"\">\"We believe our technology is currently being used by scores of brands, retailers and technology providers. Our research demonstrates that, as a result, damages due Alpha Modus far exceed an estimated $500 million and could easily run into the billions over the life of our patents,\" Chief Executive William Alessi said.</p><p class=\"\">Alpha Modus shares were up nearly 25% in premarket trading at $2.61.</p><p class=\"\">Write to Don Nico Forbes at don.forbes@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006375:0/",
            "pub_date": "2025-02-04 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh:0",
            "title": "Data443 Acquires Breezemail.ai, Accelerating AI-Powered Email Privacy Capabilities for Microsoft Office and Google GMail",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RESEARCH TRIANGLE PARK, N.C., Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\"><em>Data443 Risk Mitigation, Inc</em></strong>. (OTCPK: ATDS) (“Data443” or the “Company”), a data security and privacy software company for \"All Things Data Security,\" today announced the acquisition of intellectual property and operational assets of Breezemail.ai, an innovative provider of AI-powered email management technology. This acquisition marks a significant expansion of Data443's capabilities in intelligent threat detection and leverages its leadership at the forefront of the rapidly evolving AI security landscape.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900.562851782364px;aspect-ratio:1.5009380863039399\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh-e3375cc8f84ea9694351fc5055aab853-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1v8Pxh-e3375cc8f84ea9694351fc5055aab853-resized.jpeg\" style=\"background-color:#d4d8da\"/></picture></div></figure></span></p><p class=\"\">Breezemail.ai leverages proprietary implementations of machine-learning algorithms that manage end-user mailboxes for both Microsoft Office365 and Google GSuite GMail. This capability is the industry's first implementation, giving end users direct management of their inboxes from outside the service provider - creating private implementations of email organization, detection, and visibility for important information. Managing this privately ensures that the mail provider does not have access to the rulesets that the end user designs, ensuring ongoing privacy of private rulesets for the customer. Email providers do not see the rules that the end user creates.</p><p class=\"\">\"AI privacy continues to be a major issue the industry continues to tackle. End users should be able to keep their mailbox organization rules private, change them at will, and have a simple interface for managing this. Breezemail.ai enables this capability in a few mouse clicks and gives the user ultimate control. Even more importantly, the users' private rules and decisions are not shared with any service provider,\" stated Jason Remillard, CEO and Founder of Data443.</p><p class=\"\">Integrating this technology into Data443's award-winning product suites increases the adoption of these capabilities in other segments, such as healthcare, national defense, and government organizations.</p><p class=\"\">The acquisition coincides with significant market validation of AI-powered email security solutions, evidenced by Abnormal Security's anticipated IPO and growing enterprise demand for intelligent security platforms. This strategic move positions Data443 to capture an expanding share of the email security market, which is experiencing rapid growth driven by the increasing sophistication of cyber threats.</p><p class=\"\">The integration of Breezemail.ai's technology will deliver immediate benefits to Data443's customers:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Seamless integration with existing Cyren by Data443 deployments</li><li class=\"listItem-bmN0_SHH\">Enhanced protection against sophisticated social engineering attacks</li><li class=\"listItem-bmN0_SHH\">Real-time threat intelligence sharing across the customer base</li><li class=\"listItem-bmN0_SHH\">A rich implementation for selective decision-making driven by the end-user without IT assistance</li><li class=\"listItem-bmN0_SHH\">Complete privacy on how the users' internal mindset works with data</li></ul><p class=\"\">\"Combining Breezemail.ai's innovative AI implementations with our existing security capabilities, we're building on our compounding advantages with our Cyren by Data443 email and threat intelligence product stack,\" added Remillard. \"This integration will provide our customers with unprecedented AI privacy enablement protection while significantly simplifying management tools for end users.\"</p><p class=\"\">\"This acquisition transcends mere technological expansion, marking a pivotal shift in email privacy protection. As artificial intelligence continues to automate more aspects of our digital lives, safeguarding user privacy has emerged as one of the industry's most pressing challenges. This enables millions of users to self-manage their data with complete privacy,\" concluded Mr.Remillard.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Data443 Risk Mitigation, Inc.</strong></p><p class=\"\">Data443 Risk Mitigation, Inc. (OTCPK: ATDS) provides software and services to enable secure data across devices and databases, at rest and in flight/in transit, locally, on a network or in the cloud. We are All Things Data Security™. With over 10,000 customers in over 100 countries, Data443 provides a modern approach to data governance and security by identifying and protecting all sensitive data regardless of location, platform or format. Data443’s framework helps customers prioritize risk, identify security gaps and implement effective data protection and privacy management strategies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements </strong></p><p class=\"\">This press release contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by use of terms such as \"expect,\" \"believe,\" \"anticipate,\" \"may,\" \"could,\" \"will,\" \"should,\" \"plan,\" \"project,\" \"intend,\" \"estimate,\" \"predict,\" \"potential,\" \"pursuant,\" \"target,\" \"continue\" or the negative of these words or other comparable terminology. Statements in this press release that are not historical statements, including statements regarding Data443's plans, objectives, future opportunities for Data443's services, future financial performance and operating results, and any other statements regarding Data443's future expectations, beliefs, plans, objectives, financial conditions, assumptions or future events or performance, or regarding the anticipated consummation of any transaction, are forward-looking statements. These statements are not guarantees of future performance and are subject to numerous risks, uncertainties and assumptions, many of which are difficult to predict or are beyond Data443's control. These risks, uncertainties and assumptions could cause actual results to differ materially from the results expressed or implied by the statements. They may relate to the outcome of litigation, settlements and investigations; actions by third parties, including governmental agencies; volatility in customer spending; global economic conditions; inability to hire and retain personnel; loss of, or reduction in business with, key customers; difficulty with growth and integration of acquisitions; product liability; cybersecurity risk; anti-takeover measures in the Company’s charter documents; and the uncertainties created by global health issues, such as the ongoing outbreak of COVID, and political unrest and conflict, such as the invasion of Ukraine by Russia. These and other important risk factors are described more fully in the Company’s reports and other documents filed with the Securities and Exchange Commission (\"the SEC\"), including in Part I, Item 1A of the Company’s Annual Report on Form 10-K filed with the SEC on April 17, 2024, and subsequent filings with the SEC. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to the Company on the date hereof. Except as otherwise required by applicable law, Data443 undertakes no obligation to publicly update or revise any forward-looking statements, whether because of new information, future events or otherwise.</p><p class=\"\">“DATA443” is a registered trademark of Data443 Risk Mitigation, Inc.</p><p class=\"\">All product names, trademarks and registered trademarks are property of their respective owners. All company, product and service names used in this press release are for identification purposes only. Use of these names, trademarks and brands does not imply endorsement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information:</strong> </p><p class=\"\">Follow us on LinkedIn: https://www.linkedin.com/company/data443-risk-mitigation-inc/</p><p class=\"\">Follow us on YouTube: https://www.youtube.com/channel/UCZXDhJcx-XgMBhvE9aFHRdA </p><p class=\"\">Sign up for our Investor Newsletter: https://data443.com/investor-email-alerts/</p><p class=\"\">To learn more about Data443, please watch the Company’s video introduction on its YouTube channel: https://youtu.be/1Fp93jOxFSg</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Matthew Abenante</p><p class=\"\">ir@data443.com </p><p class=\"\">919.858.6542</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Data443 Risk Mitigation, Inc.      </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Data443 Risk Mitigation, Inc.</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Data443 Acquires Breezemail.ai, Accelerating AI-Powered Email Privacy Capabilities for Microsoft Office and Google GMail</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1v8Pxh:0-data443-acquires-breezemail-ai-accelerating-ai-powered-email-privacy-capabilities-for-microsoft-office-and-google-gmail/",
            "pub_date": "2025-02-04 21:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbtRgh9:0",
            "title": "Catheter Precision, Inc.  Announces The Closing of its Acquisition of PeriKard, LLC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FORT MILL, S.C., Feb.  04, 2025  (GLOBE NEWSWIRE) —  Catheter Precision, Inc. (NYSE American: VTAK), a U.S.-based innovative medical device company focused on electrophysiology products, today announces that it has closed the previously announced acquisition of PeriKard, LLC.</p><p class=\"\">David Jenkins, CEO of Catheter Precision, commented on the acquisition, “We are happy to have closed on this all-stock transaction within our anticipated timeline. The acquired technology will complement our emphasis on the ventricular therapeutic market and expectation for continuing growth in this market segment”.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Catheter Precision</strong></p><p class=\"\">Catheter Precision is an innovative U.S.-based medical device company bringing new solutions to market to improve the treatment of cardiac arrhythmias. It is focused on developing groundbreaking technology for electrophysiology procedures by collaborating with physicians and continuously advancing its products.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional Information</strong></p><p class=\"\">This release and all other releases from Catheter Precision, Inc. are limited in their entirety by other information filed with the SEC including, but not limited to, our latest 10-K, 10-Q’s, and 8-K’s, and should be read in conjunction with those filings.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward Looking Statements</strong></p><p class=\"\">This communication contains forward-looking statements. Forward-looking statements can be identified by words such as \"believe,\" \"anticipate,\" \"may,\" \"might,\" \"can,\" \"could,\" \"continue,\" \"depends,\" \"expect,\" \"expand,\" \"forecast,\" \"intend,\" \"predict,\" \"plan,\" \"rely,\" \"should,\" \"will,\" \"may,\" \"seek,\" or the negative of these terms and other similar expressions, although not all forward-looking statements contain these words. These forward-looking statements are subject to the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Forward-looking statements contained in this press release include, but are not limited to, statements regarding the following: that PeriKard’s kit of tools is designed to enable physicians to more easily gain access to the pericardial space of the heart and that it is intended that the kit will have both a better needle system and a better drainage system than current alternatives, Catheter’s ability to continue development of PeriKard’s products and gain the regulatory approvals needed to bring the products to market, that the anticipated PeriKard product offering will complement our emphasis on the ventricular therapeutic market and expectation for continuing growth in this market segment. The Company's expectations and beliefs regarding these matters may not materialize. Actual outcomes and results may differ materially from those contemplated by these forward-looking statements as a result of uncertainties, risks and changes in circumstances, including but not limited to risks and uncertainties included under the caption \"Risk Factors\" in the Company's 2023 Form 10-K filed with the SEC, and its Form 10-Q for the quarter ended June 30, 2024, and available at www.sec.gov. These risks and uncertainties include, but aren't limited to, with respect to statements regarding PeriKard, that regulatory approvals may not be obtained, that test results may prove disappointing, and that we may be unable to raise sufficient funding to further the development of PeriKard’s products. With respect to Catheter’s business, which will include PeriKard following closing of the transaction, and our growth expectations, these risks and uncertainties include that the results of anticipated trials may not turn out as we currently expect and future trials may not occur on the time tables we expect or may be more costly than anticipated, we do not have sufficient liquidity to fund our operations as currently proposed unless we are able to obtain additional financing or enter into a strategic transaction that would provide additional liquidity, we will not be able to reach profitability unless we are able to achieve our product expansion and growth goals, our research and development and commercialization efforts may depend on entering into agreements with corporate collaborators, we have entered into joint marketing agreements with respect to our products, and may enter into additional joint marketing agreements, that will reduce our revenues from product sales, royalty agreements with respect to our LockeT device will reduce any future profits from this product, if we experience significant disruptions in our information technology systems, our business may be adversely affected, litigation and other legal proceedings may adversely affect our business, if we make acquisitions or divestitures, we could encounter difficulties that harm our business, failure to attract and retain sufficient qualified personnel could also impede our growth, failure to maintain effective internal controls could cause our investors to lose confidence in us and adversely affect the market price of our common stock, we have determined that our internal controls and disclosure controls were not effective as of December 31, 2023 and September 30, 2024, and as a result, without effective remediation of the material weaknesses that we have identified, we may not be able to accurately report our financial results or prevent fraud, our revenues may depend on our customers' receipt of adequate reimbursement from private insurers and government sponsored healthcare programs, we may be unable to compete successfully with companies in our highly competitive industry, many of whom have substantially greater resources than we do, our future operating results depend upon our ability to obtain components in sufficient quantities on commercially reasonable terms or according to schedules, prices, quality and volumes that are acceptable to us, and suppliers may fail to deliver components, or we may be unable to manage these components effectively or obtain these components on such terms, if hospitals, physicians and patients do not accept our current and future products or if the market for indications for which any product candidate is approved is smaller than expected, we may be unable to generate significant revenue, if any, our medical device operations are subject to pervasive and continuing FDA regulatory requirements, our products may be subject to additional recalls, revocations or suspensions after receiving FDA or foreign approval or clearance, which could divert managerial and financial resources, harm our reputation, and adversely affect our business, changes in trade policies among the U.S. and other countries, in particular the imposition of new or higher tariffs, could place pressure on our average selling prices as our customers seek to offset the impact of increased tariffs on their own products, increased tariffs or the imposition of other barriers to international trade could have a material adverse effect on our revenues and operating results. The risks and uncertainties described above may be amplified by the COVID-19 pandemic, which has caused significant economic uncertainty, or other pandemics, supply chain disruptions from the Ukraine war or Israeli-Hamas conflict and otherwise, and ongoing volatility in the stock markets and the U.S. economy in general.</p><p class=\"\">The forward-looking statements included in this communication are made only as of the date hereof. The Company assumes no obligation and does not intend to update these forward-looking statements, except as required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACTS:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">At the Company</strong></p><p class=\"\">David Jenkins</p><p class=\"\">973-691-2000</p><p class=\"\">IR@catheterprecision.com</p><p class=\"\"># # #</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbtRgh9:0-catheter-precision-inc-announces-the-closing-of-its-acquisition-of-perikard-llc/",
            "pub_date": "2025-02-04 21:30:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Tnw94DcQt:0",
            "title": "VSBLTY Expands Marketsquare Program to Measure Point of Sale Transactions Throughout Latin America",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">VSBLTY Has Validated Model forIdentifying SKU’s (Stock Keeping Unit) at POS Tied to Sales andCustomer Demographic Data </p><p class=\"\">Philadelphia, PA – TheNewswire - February 4, 2025, 2025 –VSBLTY Groupe Technologies Corp.(OTCQB: VSBGF)  (Frankfurt 5VS) (“VSBLTY”), aglobal leader in AI software providing retail and security analyticstechnology, announced the expansion of theirMarketSquare program in Mexico and throughout Latin America. VSBLTYwill begin to bundle this data with data being collected on behalf ofWinkel Media for sale to major consumer package goods clients. </p><p class=\"\">\"This is no longer just aproof of concept. We are now scaling thisimportant program that helps brands know more precisely what theirtransaction and inventory data is in stores that traditionally havevery little POS data. The cost savings to brandsthat can more efficiently service stores that need restocking vs thosethat do not is significant.  Jay Hutton, CEO ofVSBLTY added “We are excited with the initial results that we havebeen able to achieve this past year in regard to accuracy, usingcomputer vision technology to train computers and cameras to “see”and identify specific products by brand and SKU. Accuracy levels areapproaching 90% and above. This capability, coupled with demographicdata about the actual shopper provides tremendous insights to CPGclients.”</p><p class=\"\">According to Grand View Research, the global Point ofSale (POS) marketplace surpassed $100 Billion in 2023 and has anongoing growth estimate of 8.3% CAGR. This innovation, a result of anintegrated co-development effort, with one of the largest consumerbrands in the world, is in direct response to a chronic commercialproblem for CPG’s aiming to fully digitize supply chain.</p><p class=\"\">Adding accurate computer vision-based sales trackingwith audience measurement allows brands, for the first time, to deriveinsights regarding brand preference based upon demographicinformation. The computer sees the product and, in a privacy compliantway, also sees the demographic profile of the consumer. </p><p class=\"\">This product offering uses computer vision to not onlydetect physical products at the point of sale but also to correlatesales with demographics in near real time. It will be made availableto brands on a monthly subscription basis to track sell out and salesmomentum in locations where there is little or no alternativemethodology. </p><p class=\"\">About VSBLTY (http://vsblty.net/)</p><p class=\"\">Headquartered in Philadelphia, VSBLTY(OTCQB: VSBGF)  (Frankfurt: 5VS) (“VSBLTY”) is the world leader in Artificial Intelligence and realtime interpretation of what a CCTV and other cameras see. By utilizingfacial recognition, age and gender, VSBLTY’s proprietary technologycan effectively enhance retail brand engagement and data analyticsmeasurement through customized ads on in-store digital displays atpoint of purchase in real time. This technology has been proven toincrease brand sales by over 25%. The firm is also recognized for itsleadership role in the growing “Store as a Medium” movement thatenables brands to reach customers with paid media ads when and wherebuying decisions are being made while producing a new revenue streamfor retailers. Most recently, VSBLTY has been building objectrecognition software to identify products by SKU, at the point ofcheckout, to integrate this capability into their retail media networkoffering to retailers and large CPG brands that lack customerinformation and transaction data at the point of sale. </p><p class=\"\">Using its proprietary AI software, andthe various data collected using their software, VSBLTY has alsodeveloped a range of security solutions that include not only facialrecognition but weaponrecognition utilizing modern surveillance cameras and legacy CCTVcameras. VSBLTY has the capability to create a proactive securitysystem rather than a reactive security system, providing early warningof threats that can save lives. Data collected through the platformcan inform large scale deployments for smart city, private state andfederal municipal security programs including bordercontrol.</p><p class=\"\">InvestorRelations</p><p class=\"\">HarborAccess</p><p class=\"\">Jonathan Paterson,475-477-9401</p><p class=\"\">Jonathan.Paterson@Harbor-Access.com</p><p class=\"\">CONTACT:Linda Rosanio,609-472-0877 </p><p class=\"\">lrosanio@vsblty.net</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Tnw94DcQt:0-vsblty-expands-marketsquare-program-to-measure-point-of-sale-transactions-throughout-latin-america/",
            "pub_date": "2025-02-04 21:30:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007106:0",
            "title": "Pfizer stock climbs on Q4 revenue and earnings beat, reaffirmed guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pfizer Inc. (PFE) shares rose 1.7% in premarket trades Tuesday after the drug maker topped Wall Street's revenue and profit estimates in its fourth-quarter results and reaffirmed its full-year guidance.</p><p class=\"\">Pfizer's adjusted fourth-quarter profit of 63 cents a share beat the FactSet consensus estimate of 47 cents a share. Revenue rose to $17.76 billion from $14.57 billion, and beat the FactSet consensus of $17.35 billion.</p><p class=\"\">Pfizer also reaffirmed its full-year 2025 guidance, which includes revenue in a range of $61 billion to $64 billion and adjusted earnings between $2.80 and $3 a share.</p><p class=\"\">(This is a developing news story with updates to come.)</p><p class=\"\">-James Rogers</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007106:0/",
            "pub_date": "2025-02-04 21:22:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV15Z:0",
            "title": "Dhanlaxmi Bank Dec-Quarter Net Profit 198.5 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dhanlaxmi Bank Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER NET PROFIT 198.5 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER GROSS NPA 3.53%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER INTEREST EARNED 3.35 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER PROVISIONS &amp; CONTINGENCIES 67 MILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV15Z:0-dhanlaxmi-bank-dec-quarter-net-profit-198-5-mln-rupees/",
            "pub_date": "2025-02-04 21:22:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006238:0",
            "title": "L3Harris Technologies Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006238:0/",
            "pub_date": "2025-02-04 21:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006241:0",
            "title": "American Woodmark Cut to Peer Perform From Outperform by Wolfe Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006241:0/",
            "pub_date": "2025-02-04 21:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463501:0",
            "title": "Eshraq Investments to Halt Trading in Abu Dhabi",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eshraq Investments (ADX:ESHRAQ) shares will temporarily pause trading on the Abu Dhabi Securities Exchange from 11 am local time on Friday due to a board meeting. </p><p class=\"\">The Abu Dhabi-listed investment company will restart trading after it publishes the results of its meeting, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463501:0/",
            "pub_date": "2025-02-04 21:23:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV160:0",
            "title": "Qlm Life & Medical Insurance FY Profit Falls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">QLM LIFE &amp; MEDICAL INSURANCE :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">QLM LIFE &amp; MEDICAL INSURANCE FY NET PROFIT 65.1 MILLION RIYALS VERSUS 76.3 MILLION RIYALS YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">QLM LIFE &amp; MEDICAL INSURANCE - BOARD PROPOSES FY CASH DIVIDEND OF 0.1 RIYAL PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV160:0-qlm-life-medical-insurance-fy-profit-falls/",
            "pub_date": "2025-02-04 21:23:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV18N:0",
            "title": "India Glycols Dec-Quarter Consol Net Profit 568.1 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India Glycols Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 568.1 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 24.24 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV18N:0-india-glycols-dec-quarter-consol-net-profit-568-1-mln-rupees/",
            "pub_date": "2025-02-04 21:23:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006256:0",
            "title": "LyondellBasell Is Maintained at Overweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:24 GMT) </strong>LyondellBasell Price Target Cut to $85.00/Share From $90.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006256:0/",
            "pub_date": "2025-02-04 21:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308772:0",
            "title": "Silicon Laboratories Reports Fiscal Q4 Loss, Revenue Rises; Provides Q1 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Silicon Laboratories  reported a fiscal Q4 adjusted loss Tuesday of $0.11 per share. Year-ago figures were not available. </p><p class=\"\">Analysts surveyed by FactSet expected a loss of $0.11. </p><p class=\"\">Revenue for the quarter ended Dec. 28 was $166.2 million, compared with $86.8 million a year earlier. Analysts surveyed by FactSet expected $166.1 million. </p><p class=\"\">For fiscal Q1, the company said it expects non-GAAP EPS ranging from a loss $0.19 and earnings of $0.01 on revenue of $170 million to $185 million. Analysts surveyed by FactSet expect a fiscal Q1 adjusted loss of $0.09 per share on revenue of $175.7 million. </p><p class=\"\">Silicon Laboratories' shares were down 2.4% in premarket trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308772:0/",
            "pub_date": "2025-02-04 21:24:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACShzBxya:0",
            "title": "Clearstep Emerges as Most Adopted Digital Self-Triage Solution Among U.S. Health Systems",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clearstep leads the market as the most widely adopted digital self-triage platform among U.S. health systems, according to a comprehensive study published in npj Digital Medicine</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CHICAGO, IL / ACCESS Newswire / February 4, 2025 /</strong> Clearstep, a market leader in AI-powered triage and healthcare navigation for patients and capacity optimization for care teams, has been prominently featured in a recent study published in <em>Nature Publishing Group's npj Digital Medicine.</em> The study, titled \"Contrasting Rule and Machine Learning Based Digital Self-Triage Systems in the USA\", analyzes the adoption and effectiveness of digital self-triage systems across 647 U.S. health systems and reveals Clearstep as the frontrunner.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key findings from the study include:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Only 7.72% of surveyed health systems have adopted self-triage solutions, indicating adoption of self-triage has moved beyond the \"early innovator\" phase and is in the \"early adopter\" phase.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Clearstep's platform is available on more than 2X as many health system websites as the next most adopted solution.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Clearstep's platform, when normalized to scale (as indicated by number of hospital regions with digital access) is available to more than 3X as many patients.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The adoption of self-triage solutions has increased by 57% since 2022, demonstrating rapid market growth.</p></li></ul><p class=\"\">This timeline traces the progression from nurse call centers to the automation of their decision rules and content. This evolution has resulted in distinct categories of AI-powered patient self-service technologies available today.</p><p class=\"\">Adeel Malik, CEO and Co-founder of Clearstep, commented on the findings: \"This recognition validates our commitment to improving patient access and efficiency in healthcare. As the most adopted solution, we're proud to be leading the charge in transforming how patients navigate their healthcare needs.\"</p><p class=\"\">With an estimated 25% of annual U.S. healthcare spending wasted due to inefficiencies like unnecessary ER visits and delayed care, the need for intelligent self-triage solutions is now more urgent than ever. As online scheduling expands across health system websites and medical groups standardize provider templates, qualifying patient appointments through self-triage is essential. Digital self-triage tools are critical to addressing these challenges by empowering patients to make informed care-seeking decisions while reducing strain on providers and lowering overall costs.</p><p class=\"\">The study highlights the growing importance of digital self-triage in healthcare, with benefits including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enhanced patient access &amp; experience for navigating both clinical and non-clinical needs</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">More precise patient routing to the right care level, improving clinical outcomes</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Better specialty &amp; sub-specialty scheduling, reducing appointment mismatches</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Optimized ambulatory &amp; outpatient capacity, improving resource utilization</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Lower call center burden by reducing unnecessary interactions via automation</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Fewer avoidable ER visits, cutting costs &amp; improving care efficiency</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Strong ROI for health systems, driving financial and operational gains</p></li></ul><p class=\"\">\"Our dedication to safely and scalably combining clinical best practice &amp; expertise with AI-capabilities has set a new standard in digital self-triage,\" said Bilal Naved, Chief Product Officer and Co-Founder of Clearstep. \"This study affirms that our approach not only meets but exceeds the standards for trust in deploying automated, artificially intelligent systems of modern healthcare navigation, offering a seamless experience for patients while supporting healthcare providers in delivering efficient, appropriate care.\"</p><p class=\"\">As healthcare systems face growing demand and ongoing provider shortages, hybrid self-triage systems that bring together trusted clinical best practice guidelines with the latest advances in artificial intelligence like Clearstep's Smart Care Routing solutions will play an increasingly vital role in improving care navigation and operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Clearstep</strong></p><p class=\"\">Clearstep is addressing critical challenges in healthcare access, engagement, and efficiency with its AI-powered solutions for self-triage and care navigation. By combining clinically validated protocols with advanced AI capabilities, Clearstep empowers health systems to reduce unnecessary care utilization, streamline workflows, and enhance patient outcomes. Trusted by health systems across the U.S., Clearstep's solutions are paving the way for a more accessible and efficient healthcare future.</p><p class=\"\">For more information, visit clearstep.health and follow Clearstep news on LinkedIn.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, contact:</strong></p><p class=\"\">Clearstep: info@clearstep.health</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE</strong>: Clearstep</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACShzBxya:0/",
            "pub_date": "2025-02-04 21:24:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV10W:0",
            "title": "Emirates Driving FY Dividend 17 Fils Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EMIRATES DRIVING :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">EMIRATES DRIVING FY DIVIDEND PER SHARE 17 FILS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV10W:0-emirates-driving-fy-dividend-17-fils-per-share/",
            "pub_date": "2025-02-04 21:24:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6b4ee0330e2ee:0",
            "title": "Graphic Packaging Holding Company Reports Fourth Quarter and Full-Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Graphic Packaging Holding Company, a global leader in sustainable consumer packaging, has released its fourth quarter and full-year 2024 financial results. The company, headquartered in Atlanta, Georgia, designs and produces consumer packaging primarily from renewable or recycled materials.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the full year 2024, Graphic Packaging reported net sales of $8.807 billion, a decrease from $9.428 billion in 2023. Net income for the year was $658 million, down from $723 million in the previous year. Adjusted EBITDA also saw a decline, coming in at $1.682 billion compared to $1.876 billion in 2023. The adjusted EBITDA margin was 19.1%, slightly lower than the 19.9% reported in 2023. Earnings per diluted share (EPS) were $2.16, down from $2.34 in 2023, while adjusted EPS was $2.49, compared to $2.91 in the prior year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">In 2024, the company launched its Vision 2030 initiative and achieved innovation sales growth of $205 million. Despite a challenging first half, the company returned to positive packaging volume growth in the second half of the year. Additionally, Graphic Packaging executed a Virtual Power Purchase Agreement to increase renewable energy use in Europe and repurchased 2% of its common shares outstanding, returning $322 million of capital to stockholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Graphic Packaging made significant strides in its strategic initiatives, including the divestiture of the Augusta, GA bleached paperboard manufacturing facility, which impacted net sales and adjusted EBITDA. The company also announced a 10% increase in the quarterly dividend, effective for the first quarter of 2025, reflecting its commitment to returning value to shareholders.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Michael Doss, President and CEO, highlighted the company's strong and steady margins and significant new consumer packaging innovations. He emphasized the strategic investments in capabilities, innovation, and competitive advantage that have positioned the company for long-term value creation. Doss also noted that customer destocking is largely over, and the company is responding to evolving consumer needs by creating more circular, functional, and convenient packaging.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, Graphic Packaging expects net sales to be in the range of $8.6 billion to $8.8 billion, adjusted EBITDA between $1.66 billion and $1.76 billion, and adjusted EPS from $2.48 to $2.73. The company also anticipates a significant decline in capital spending as major asset investments come to completion, allowing for the deployment of excess cash to create substantial value for stockholders.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1408075/000140807525000003/gpk-20250204.htm\" rel=\"nofollow\" target=\"_blank\">GRAPHIC PACKAGING HOLDING CO [ GPK ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6b4ee0330e2ee:0-graphic-packaging-holding-company-reports-fourth-quarter-and-full-year-2024-results/",
            "pub_date": "2025-02-04 21:25:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:dbf6d0cb0cbd1:0",
            "title": "Ball Corporation Reports Fourth Quarter 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ball Corporation, a leading supplier of sustainable aluminum packaging solutions, has released its financial results for the fourth quarter and full year of 2024. The report highlights the company's performance across various segments and provides insights into its strategic initiatives and future outlook.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the full year 2024, Ball Corporation reported net earnings attributable to the corporation of $4.01 billion, translating to a total diluted earnings per share (EPS) of $13.00. This marks a significant increase from the previous year's net earnings of $707 million and EPS of $2.23. However, the fourth quarter of 2024 saw a net loss attributable to the corporation of $32 million, or a diluted loss per share of 11 cents, compared to net earnings of $154 million and EPS of 49 cents in the same period of 2023.</p><p class=\"\">Full-year comparable net earnings were $977 million, or $3.17 per diluted share, up from $920 million, or $2.90 per diluted share, in 2023. Fourth quarter comparable earnings per diluted share were 84 cents, an increase from 78 cents in the fourth quarter of 2023.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Ball Corporation's beverage packaging segments in North and Central America, EMEA, and South America showed mixed results. The North and Central America segment reported full-year comparable operating earnings of $747 million on sales of $5.62 billion, while the EMEA segment reported $416 million on sales of $3.47 billion. The South America segment reported $296 million on sales of $1.95 billion.</p><p class=\"\">Notably, the company returned $1.96 billion to shareholders through share repurchases and dividends in 2024. The company also recorded a noncash impairment charge related to its aluminum cup business, which is expected to be deconsolidated in early 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">In 2024, Ball Corporation completed the divestiture of its aerospace business for a purchase price of $5.6 billion. This strategic shift allowed the company to focus on its core aluminum packaging business. The company is also exploring strategic partnerships for its aluminum cup business, which has not met initial growth expectations.</p><p class=\"\">Additionally, Ball Corporation entered into an agreement to sell a portion of its ownership in Ball United Arab Can Manufacturing Company, expected to close in the first half of 2025. This transaction is anticipated to result in a gain of approximately $80 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Daniel W. Fisher, chairman and chief executive officer, commented, \"We delivered strong full-year and fourth quarter results and returned $1.96 billion to shareholders in 2024. Leveraging our strong financial position and leaner operating model, the company was able to deliver on its 2024 goals and remains uniquely positioned to enable our purpose of advancing the greater use of sustainable aluminum packaging.\"</p><p class=\"\">Howard Yu, executive vice president and chief financial officer, added, \"Our company performed well and delivered on our stated comparable earnings growth goal while returning $1.96 billion to shareholders in 2024. By consistently executing on our plans to drive continuous improvement, operational excellence, and cost management, our resulting strong free cash flow will allow us to return significant value to shareholders while also prudently investing in our business over the years to come.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Looking ahead to 2025, Ball Corporation aims to grow comparable diluted earnings per share by more than 10 percent, generate strong free cash flow, and continue returning value to shareholders through share repurchases and dividends. The company is focused on advancing aluminum packaging and leveraging its Ball Business System to achieve these goals.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/9389/000000938925000002/ball-20250204x8k.htm\" rel=\"nofollow\" target=\"_blank\">BALL Corp [ BALL ] - 8-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:dbf6d0cb0cbd1:0-ball-corporation-reports-fourth-quarter-2024-results/",
            "pub_date": "2025-02-04 21:25:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308800:0",
            "title": "Fox Fiscal Q2 Adjusted Earnings, Revenue Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox  reported fiscal Q2 adjusted earnings Tuesday of $0.96 per diluted share, compared with $0.34 a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $0.69. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $5.08 billion, compared with $4.23 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $4.87 billion. </p><p class=\"\">Fox shares were up 4.2% in recent Tuesday premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308800:0/",
            "pub_date": "2025-02-04 21:17:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308795:0",
            "title": "JPMorgan Adjusts Price Target on Sysco to $82 From $86, Keeps Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sysco  has an average rating of overweight and mean price target of $83.79, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308795:0/",
            "pub_date": "2025-02-04 21:17:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006157:0",
            "title": "W. P. Carey Is Maintained at Underweight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:18 GMT) </strong>W. P. Carey Price Target Cut to $56.00/Share From $59.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006157:0/",
            "pub_date": "2025-02-04 21:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006155:0",
            "title": "ViaSat Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:18 GMT) </strong>ViaSat Price Target Cut to $12.00/Share From $26.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006155:0/",
            "pub_date": "2025-02-04 21:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}