{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0CO:0",
            "title": "Athens International Airport's January Passenger Traffic At 1.83 Million, Up 14.5% YoY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Athens International Airport SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DURING JANUARY THE AIRPORT’S PASSENGER TRAFFIC AMOUNTED TO 1.83 MILLION UP 14.5% YOY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0CO:0-athens-international-airport-s-january-passenger-traffic-at-1-83-million-up-14-5-yoy/",
            "pub_date": "2025-02-05 16:12:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002284:0",
            "title": "DCC's Energy Segment to Improve in the Short Term — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DCC's third-quarter results were driven by growth in its key energy division, RBC Capital Markets analyst Andrew Brooke says in a note. The FTSE 100 company said its energy segment's performance remains robust despite warm weather, the analyst adds, noting that the healthcare unit's profit was flat while profit declined in technology. RBC expects a positive topline performance in the short term, along with the disposal of healthcare forecast in the next six months and further delivery of its energy strategy--including acquisitions--, Brooke says. \"Whilst energy standalone is tough to value, the division is cleaner, has positive mix drivers, is higher return and has more favorable working capital dynamics,\" he adds. Shares are down 2.2% at 53.75 pounds. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002284:0/",
            "pub_date": "2025-02-05 16:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463861:0",
            "title": "Finland's Metso Bags Jordan Plant Operations Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Metso  secured a lifecycle contract from Ideal Development for Manufacturing Industries for a new phosphate beneficiation facility at the Eshidiya Mine in Jordan. </p><p class=\"\">The Finnish industrial technology company will be involved in commissioning, ramping up production, optimizing the plant's performance, and handling maintenance and plant operations, according to a Wednesday release. </p><p class=\"\">The performance-based contract has a two-year term, with an option for a two-year extension.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463861:0/",
            "pub_date": "2025-02-05 16:13:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309526:0",
            "title": "TKO Group Holdings Insider Bought Shares Worth $39,553,775, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Patrick Whitesell, 10% Owner, on January 31, 2025, executed a purchase for 251,506 shares in TKO Group Holdings  for $39,553,775. Following the Form 4 filing with the SEC, Whitesell has control over a total of 3,748,325 Class A common shares of the company, with 66,179 shares held directly and 3,682,146 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1973266/000095017025014105/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1973266/000095017025014105/xslF345X05/ownership.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309526:0/",
            "pub_date": "2025-02-05 16:13:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0PO:0",
            "title": "DNB rises after Q4 profit beat as Norway's economy gains momentum",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in DNB rise 3% after the Norwegian bank posts a better-than-expected jump in Q4 profit, as Norway's economy gains momentum</p><p class=\"\">** Shares on track for their best day since October 2024</p><p class=\"\">** DNB's net profit surges 34.8% to NOK 12.68 billion ($1.13 billion), driven by strong customer activity, solid fee income, lending growth, and rising financing demand</p><p class=\"\">** Quarterly net interest income rises to NOK 16.72 billion, beating expectations of NOK 16.17 billion, and up from NOK 16 billion a year earlier</p><p class=\"\">** Barclays notes that while some may argue DNB's net interest income beat is due to \"treasury\" and \"amortization effects\", the strong loan growth still drove a positive surprise</p><p class=\"\">** Jefferies says DNB's 4Q24 profit exceeded expectations by 27%, driven by 3% higher net interest income, all-time high fees, lower impairments, and a 40 bps stronger CET1 ratio</p><p class=\"\">($1 = 11.2113 Norwegian crowns)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0PO:0-dnb-rises-after-q4-profit-beat-as-norway-s-economy-gains-momentum/",
            "pub_date": "2025-02-05 16:13:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiSKBTka:0",
            "title": "notice of Written Resolution",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">bond maturity extension</p><p class=\"\">https://newsweb.oslobors.no/message/637753</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiSKBTka:0-notice-of-written-resolution/",
            "pub_date": "2025-02-05 16:14:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0T2:0",
            "title": "Drugmaker Abbott India jumps on Q3 profit rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Abbott India  jumps 3.5% post Q3 results</p><p class=\"\">** Drugmaker's profit rises 16% y/y in Q3; rev from ops up 12%</p><p class=\"\">** Day's move trims YTD losses to 10%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0T2:0-drugmaker-abbott-india-jumps-on-q3-profit-rise/",
            "pub_date": "2025-02-05 16:14:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463862:0",
            "title": "The Hyakujushi Bank Posts 43% Jump in April-December 2024 Period",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Hyakujushi Bank  reported a 42.6% year-on-year surge in profit to 9.99 billion yen in the nine months ended Dec. 31, 2024, from 7.00 billion yen a year earlier, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Basic earnings per share rose to 350.72 yen, compared with 243.91 yen a year ago. </p><p class=\"\">Comprehensive income decreased 75.4% to 6.18 billion yen from 25.17 billion yen a year earlier. </p><p class=\"\">For the fiscal year ending March 31, the company expects attributable profit to rise 19.3% to 11.5 billion yen, or 404.63 yen per share. </p><p class=\"\">The company expects to pay a dividend of 55 yen per share for the fiscal ending March 31, 2024, and expects to pay a total final dividend of 120 yen per share for the fiscal ending March 31, 2025. </p><p class=\"\">Hyakujushi Bank shares were down nearly 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463862:0/",
            "pub_date": "2025-02-05 16:14:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002306:0",
            "title": "TotalEnergies Plans $2 Bln Quarterly Buyback After Earnings Jump Sequentially — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Whittaker</p><p class=\"\">TotalEnergies set out a $2 billion quarterly share buyback target for 2025 after net profit jumped on higher gas prices and an increased refining margins.</p><p class=\"\">The French oil and gas company reported a fourth-quarter net profit of $3.96 billion, up 72% on the prior quarter after strong earnings in its integrated LNG and integrated power divisions. Despite this, it missed the $4.21 billion analysts had expected according to a Visible Alpha consensus.</p><p class=\"\">Adjusted net profit--a company preferred metric--rose to $4.41 billion from $4.07 billion the previous quarter. This compares with the $3.94 billion analysts had expected.</p><p class=\"\">Cash flow from operations rose to $12.51 billion, a 74% increase on quarter. It said it would target share buy backs worth 2 billion pounds a quarter in 2025.</p><p class=\"\">The company also hiked its full-year dividend 7% to 3.22 euros a share.</p><p class=\"\">During the period, oil prices declined 5% on quarter but this was partially offset by higher gas prices. Downstream division's refining margins remained weak but increased on quarter.</p><p class=\"\">TotalEnergies upstream division reported adjusted net operating profit of $2.31 billion while earnings from its LNG division jumped 35% on quarter, boosted by 6% production growth and average LNG prices above $10 per million British thermal unit.</p><p class=\"\">Meanwhile, TotalEnergies integrated power division reported adjusted net operating profit of $575 million adjusted net operating profit, an increase of 19% compared with the prior quarter.</p><p class=\"\">Within its downstream division, adjusted net operating profit rose 12% on quarter to $680 million as it benefited from a jump in its refining margin to $25.9 a metric ton, an increase from $15.4 a ton in the prior quarter.</p><p class=\"\">Hydrocarbon production was 2.43 million of oil-equivalent barrels per day, in line with its guidance of between 2.4 million and 2.45 million oil-equivalent barrels a day.</p><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002306:0/",
            "pub_date": "2025-02-05 16:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002303:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 3 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Demand Rose to Fresh High in 2024, Report Says</strong></p><p class=\"\">The record demand was driven by central banks and investors as geopolitical and economic uncertainty continued apace.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002303:0-news-highlights-top-global-markets-news-of-the-day-wednesday-at-3-am-et/",
            "pub_date": "2025-02-05 16:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002304:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 3 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Arm's Earnings for Clues on What DeepSeek Means for AI</strong></p><p class=\"\">The company makes money by licensing its chip designs to semiconductor companies and smartphone makers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk's Wegovy Sales Miss Expectations</strong></p><p class=\"\">The Danish pharmaceutical company's blockbuster Wegovy weight-loss drug just missed sales expectations in the fourth quarter despite more than doubling on the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</strong></p><p class=\"\">Spain's biggest bank by assets was also confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda Deal to Create World's No. 3 Automaker</strong></p><p class=\"\">Shares in Nissan fell while Honda stock closed higher, reflecting investor views that Nissan was more likely to benefit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Raises Earnings Guidance After Profit Jumps</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Australia Bans DeepSeek From Government Devices</strong></p><p class=\"\">Australia directed all government entities to prevent the use of DeepSeek products, applications and web services on government systems and mobile devices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002304:0-news-highlights-top-company-news-of-the-day-wednesday-at-3-am-et/",
            "pub_date": "2025-02-05 16:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr67LFPK:0",
            "title": "Aqilion Resumes Development of its TAK1-Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Aqilion<p class=\"\">AQILION AB (publ) announces that the Company has resumed development of the its TAK1 program as the company has <strong class=\"root-Tkn6WL2y\"> </strong>regained the control and ownership of the program. After reviewing and analysing the complete data package, Aqilion decided to recommence the development of the program. The TAK1 mechanism is a key regulator of inflammation and the objective is to develope a new treatment for severe diseases caused by chronic inflammation and dysfunctional immune reactions.</p><p class=\"\">The TAK1 mechanism is a central biological switch for several central inflammatory processes. By dampening its activity, there is potential to block and delay progression in severe and chronic diseases. The target has been identified as a key mechanism by academia and industry, and there is widespread interest in its potential in a number of indications.</p><p class=\"\">Aqilion's internal drug development has led to unique small molecule inhibitors and the collaboration with Merck KGaA further added new molecular assets. The new project strategy for the TAK1 program is based on proprietary data in combination with data and knowledge generated in collaboration with Merck KGaA during 2023 -2024.</p><p class=\"\">Sarah Fredriksson, CEO of Aqilion, comments:</p><p class=\"\">“We are pleased and excited to continue our preclinical TAK1 program, since it is a highly interesting drug target in several chronic inflammation and autoimmune diseases. The analysis of all data, generated internally and externally, encouraged us to resume the development. We are looking forward to presenting the program during partnering meetings later this year.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TAK1</strong></p><p class=\"\">TAK1 (Transforming growth factor-β-activated kinase 1) is a ”master regulator” of both     NF-κB and JNK signaling. It is a key kinase in innate immunity that integrates and controls signaling and production of key pathological cytokines. TAK1 integrates clinically and genetically validated pathways in human disease. Aqilion has discovered highly selective and potent TAK1 inhibitors with excellent drug-like properties within a unique chemical space.</p><p class=\"\">Kinases are a very succesful drug target class. Immune kinases including, JAK1, JAK2, JAK3, TYK2 and BTK have shown clinical effects in many autoimmune and and inflammatory diseases. However, innate immunity kinase targets that are hypothesized to affect e.g. NF-kB or JNK signaling have failed to provide sufficient or sustained efficacy. These include p38⍺, SYK, TPL2 and IRAK4. Due to the central upstream node function of TAK1, inhibiting this kinase has the potential to provide a higher degree of efficacy by modulating the key cytokines IL-1β, IL-6 and TNF⍺.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the collaboration with Merck KGaA</strong></p><p class=\"\">The TAK1 program began in the fall of 2019 and in early 2023, Aqilion signed a pre-clinical licensing- and collaboration deal with Merck KGaA Darmstadt, Germany (10 M€ upfront and 950 M€ in potential milestones) to discover, develop and commercialize small-molecule inhibitors of TAK1. June 20, 2024 Aqilion announced that Aqilion and Merck have decided to terminate the joint development of the TAK1 program. Data generated in the course of the collaboration have altered the risk-benefit profile within the intended indications. Merck has returned all rights according to the licensing and collaboration agreement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Sarah Fredriksson, CEO, AQILION AB, + 46 (0)70 261 4575, sarah.fredriksson@aqilion.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aqilion</strong></p><p class=\"\">Aqilion is a biotech company that focuses on developing innovative new treatments for diseases caused by chronic inflammation and dysfunctional immune reactions such as autoimmune diseases.</p><p class=\"\">We identify innovative ideas that could potentially lead to new medications and refine them into commercially interesting projects. The innovation approach is based on solid scientific grounds, in disease areas where we, with reasonable assumptions, can understand the underlying biology, clinical relevance of the mechanism, potential patient benefit and the likelihood for finding a partner.</p><p class=\"\">The company is mainly active in the early phases of drug discovery, from idea to proof-of-concept in clinical trials. Aqilion executes it's development programs in a partly virtual organization in close collaboration with selected partners, with specific expertise in drug development.</p><p class=\"\">AQILION AB (publ) is a Swedish public limited company headquartered in Helsingborg, Sweden. www.aqilion.com</p><p class=\"\">https://news.cision.com/aqilion/r/aqilion-resumes-development-of-its-tak1-program%2Cc4100669</p><p class=\"\">20250205 Press release Aqilion Resumes Developmen of its TAK1-Program</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr67LFPK:0-aqilion-resumes-development-of-its-tak1-program/",
            "pub_date": "2025-02-05 16:15:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446695:0",
            "title": "Czech Republic Retail Sales Growth Tops Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Retail sales in the Czech Republic advanced by 6.2% year-on-year in December 2024, defying market estimates of a 4.1% gain and accelerating from an upwardly revised 4.2% increase in the previous month.</p><p class=\"\">This marked the twelfth consecutive month of growth in retail activity and the strongest in the sequence, driven by higher sales for both food, beverages &amp; tobacco (2.7% vs 0.5% in November) and non-food products (8.1% vs 5.3%).</p><p class=\"\">Meanwhile, sales growth slowed automotive fuel (8.1% vs 10.3%).</p><p class=\"\">On a seasonally adjusted monthly basis, retail trade rose by 1.2% in December, rebounding from a 0.1% decline in the preceding period.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446695:0-czech-republic-retail-sales-growth-tops-forecasts/",
            "pub_date": "2025-02-05 16:15:33",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463776:0",
            "title": "Jefferies Adjusts Gateway Distriparks' Price Target to INR100 From INR110, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gateway Distriparks  has an average rating of buy and price targets ranging from 83 Indian rupees to 147 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463776:0/",
            "pub_date": "2025-02-05 16:07:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463779:0",
            "title": "Jefferies Adjusts Godrej Properties' Price Target to INR3,525 From INR3,750, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Godrej Properties  has an average rating of outperform and price targets ranging from 2,113 Indian rupees to 4,200 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463779:0/",
            "pub_date": "2025-02-05 16:07:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0SM:0",
            "title": "GSK rises after 2031 sales target hike, Q4 results beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of GSK  up 4.5% at 1,442p - top pct gainer on the FTSE 100 index <!-- -->CURRENCYCOM:UK100<!-- --> </p><p class=\"\">** The British drugmaker lifts 2031 sales target to more than 40 bln pounds from the 38 bln pounds previously expected</p><p class=\"\">** Co beats Q4 earnings with core EPS of 23.2p vs IBES ests of 19.01p, on strength in its HIV and oncology portfolio</p><p class=\"\">** Reports Q4 sales of 8.12 bln pounds ($10.15 bln), above IBES ests of 7.75 bln pounds</p><p class=\"\">** Launches share buyback of 2 bln pounds</p><p class=\"\">** Sets 2025 sales growth target of 3%-5% against analysts' expectations for growth of about 3.5%, according to a company-compiled consensus</p><p class=\"\">** GSK fell about 12% in the last 12 months</p><p class=\"\">($1 = 0.8002 pounds)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0SM:0-gsk-rises-after-2031-sales-target-hike-q4-results-beat/",
            "pub_date": "2025-02-05 16:07:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002258:0",
            "title": "Toyota Boosts Earnings Guidance, to Set Up China EV Unit — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after posting higher third-quarter net profit and said it will establish an electric-vehicle unit in China, seeking to shore up its operations in the world's largest auto market.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed from a year earlier for the three months ended December, beating analysts' estimates, as revenue grew.</p><p class=\"\">Toyota said the new Shanghai-based subsidiary will develop and produce Lexus-branded battery EVs. The unit will also make batteries for the group's businesses.</p><p class=\"\">The wholly owned unit is expected to make 100,000 vehicles annually, with production scheduled to begin in 2027 or later, the company said.</p><p class=\"\">Toyota Motor remained the world's biggest carmaker in 2024, with sales of 10.8 million vehicles globally, as it benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles.</p><p class=\"\">But like many other global carmakers, it struggled in China as a cutthroat price war and consumers' shift away from conventional gas-powered vehicles disrupted the world's largest auto market.</p><p class=\"\">Toyota shares rose Wednesday after it boosted its outlook and reported better-than-expected quarterly results. The stock ended 3.1% higher, virtually recouping losses made earlier this week following the U.S. tariff announcement.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">Toyota said Wednesday that third-quarter net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion. That exceeded the estimate of Y1.175 trillion in a poll of analysts by data provider Quick. Revenue rose 2.9% to Y12.391 trillion despite lower vehicle sales.</p><p class=\"\">The bottom line was also helped by one-off gains related to a change in the way it holds foreign-currency-denominated assets, the company said.</p><p class=\"\">For the fiscal year ending March, Toyota expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously forecast Y3.570 trillion in net profit on Y46.000 trillion in revenue.</p><p class=\"\">The company left its fiscal-year group sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002258:0/",
            "pub_date": "2025-02-05 16:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002256:0",
            "title": "GSK Issues $2.5 Billion Buyback, Raises Midterm Outlook After Beating Market Views — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Helena Smolak</p><p class=\"\">GSK plans to buy back $2.50 billion in shares and raised its midterm sales target, citing promising pipeline developments.</p><p class=\"\">The British pharmaceutical giant said Wednesday that the 2.0 billion-pound share buyback will be implemented over the next 18 months.</p><p class=\"\">The company said it now expects sales of more than 40 billion pounds by 2031, compared with previous guidance of more than 38 billion pounds, on the back of expected new medicines between 2025 and 2031, including oncology treatments.</p><p class=\"\">GSK expects sales to grow 3% to 5% this year and core operating profit and core earnings per share to grow between 6% and 8% at constant exchange rates. This compares with 2024 sales growth of 7%, core operating profit growth of 11% and core earnings per share growth of 10%.</p><p class=\"\">Its cancer treatments lifted sales and profit ahead of analysts' expectations, offsetting lower vaccines sales on weak demand in the U.S.</p><p class=\"\">In the fourth quarter of 2024, sales rose 4% at constant currencies to 8.12 billion pounds, above the 7.83 billion pounds that analysts had expected, according to a consensus poll by Visible Alpha.</p><p class=\"\">Core operating profit, closely watched by analysts and investors, fell 10% at constant currencies to 1.43 billion pounds on lower-than-anticipated vaccine sales, but beat analysts' expectations of  1.385 billion pounds.</p><p class=\"\">Core earnings per share fell 10% at constant currencies to 23.2 pence, above analysts' expectations of 20.6 pence.</p><p class=\"\">The company expects to pay a full-year dividend of 61 pence, up from 60 pence in 2023.</p><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002256:0/",
            "pub_date": "2025-02-05 16:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463863:0",
            "title": "Arab National Bank Declares Lower H2 2024 Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank's (SASE:1080) board declared a cash dividend of 0.0065 Saudi riyal per share for the second half of 2024. </p><p class=\"\">The Saudi-based lender will distribute the dividend on Feb. 19 to shareholders on record Feb. 9, according to a Wednesday release. It paid 0.007 riyal per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463863:0/",
            "pub_date": "2025-02-05 16:09:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463785:0",
            "title": "Jefferies Adjusts Asian Paints' Price Target to INR2,000 From INR2,080, Keeps at Underperform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asian Paints  has an average rating of hold and price targets ranging from 2,000 Indian rupees to 3,650 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463785:0/",
            "pub_date": "2025-02-05 16:09:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0L4:0",
            "title": "Credit Agricole tops estimates in Q4, aided by Amundi and trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Q4 net income up 27%, revenue up 17% y/y</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">CEO says increased Banco BPM to defend group's interests</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Controlling entity buys 500 mln euros worth of additional shares</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Proposes dividend of 1.1 euro per share, no buyback announced</li></ul></span></div><span><p class=\"\">    Credit Agricole SA , France's second-biggest listed bank, exceeded quarterly earnings forecasts on Wednesday with a 27% jump in profit, driven by insurance and asset management even as gains in its investment banking business lagged rivals. </p><p class=\"\">The lender is the latest to benefit from soaring demand from clients wanting to trade in global markets, particularly in the final three months of 2024, with rival BNP Paribas  beating expectations on Tuesday.</p><p class=\"\">Credit Agricole said net income for the three months ending in December rose 27% from a year earlier to 1.69 billion euros ($1.8 billion), beating the 1.32 billion-euro analyst average estimate it had compiled. </p><p class=\"\">Revenue came in at 7.1 billion euros, up 17%, also above an average forecast of 6.53 billion euros.</p><p class=\"\">The strong fourth quarter enabled Credit Agricole to report record full-year sales and net income, the latter totalling more than 7.1 billion euros.</p><p class=\"\">Analysts at Royal Bank of Canada saluted a \"strong set of results\" in a note to clients.</p><p class=\"\">Credit Agricole's shares were up 1.2% in early Paris trading, outperforming France's benchmark blue-chip index CAC 40  </p><p class=\"\">The group's asset management arm, Amundi , Europe's largest fund manager, saw sales grow by 14.5% year-on-year.</p><p class=\"\">Sales at Credit Agricole's investment banking unit increased 7.7% to a record 1.57 billion euros, a smaller rise than elsewhere.</p><p class=\"\">Sales from trading in fixed income, currencies and commodities, while rising 17%, underperformed BNP and below the average 26% year-on-year increase recorded by Wall Street companies, according to Jefferies.    </p><p class=\"\">The listed entity of the larger Credit Agricole Group, composed of 39 regional banks, said its insurance business saw sales surge by 37%, notably thanks to growth in assets under management.</p><p class=\"\">The lender said it would propose a dividend of 1.10 euro per share, up 5% from a year earlier.</p><p class=\"\">GOALS MET EARLY</p><p class=\"\">Credit Agricole said it had reached as expected its 2025 targets a year in advance, including a return on tangible equity of more than 12%. </p><p class=\"\">The bank did not provide a new set of targets for 2025. </p><p class=\"\">Bumper profits have left European banks flush with cash and encouraged some CEOs to bid for rivals, including in Italy, where ongoing takeover battles have drawn in Credit Agricole. Italy is its biggest market outside France. </p><p class=\"\">Outgoing Chief Executive Philippe Brassac said the French lender had no plans to buy Italy's third-largest lender Banco BPM , the subject of an unsolicited bid from UniCredit  after Credit Agricole raised its stake in BPM in December to 15.1%.</p><p class=\"\">\"Our only motivation is to defend our own interests, we are not biased,\" Brassac said.</p><p class=\"\">\"Key questions from here for Credit Agricole remain Italian development plans as well as new MTP (medium term plan) targets and ambitions from the new CEO (Olivier Gavalda),\" Barclays said in a note.</p><p class=\"\">Credit Agricole became BPM's main investor in 2022, shortly after an earlier aborted takeover attempt of BPM by UniCredit. </p><p class=\"\">The French lender partners with BPM in consumer credit and insurance while Amundi has a distribution contract with UniCredit that runs out in 2027.</p><p class=\"\">SAS Rue La Boetie, the controlling entity of Credit Agricole, said in a separate statement that it intended to buy up to 500 million euros worth of Credit Agricole's shares by the end of the third quarter. </p><p class=\"\">It currently owns 62.76% of Credit Agricole. </p><p class=\"\">($1 = 0.9633 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0L4:0-credit-agricole-tops-estimates-in-q4-aided-by-amundi-and-trading/",
            "pub_date": "2025-02-05 16:09:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002266_20250205002266:0",
            "title": "Hang Seng Index Closes 0.9% Lower at 20597.09",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002266_20250205002266:0/",
            "pub_date": "2025-02-05 16:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463793:0",
            "title": "Jefferies Adjusts Military Commercial Joint Stock Bank's Price Target to 29,277 Dong From 31,430 Dong, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Military Commercial Joint Stock Bank (HOSE:MBB) has an average rating of buy and price targets ranging from 23,652.17 dong to 29,391.30 dong, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463793:0/",
            "pub_date": "2025-02-05 16:10:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463796:0",
            "title": "Jefferies Adjusts Adani Enterprises' Price Target to INR3,000 From INR3,800, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463796:0/",
            "pub_date": "2025-02-05 16:10:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEE3npka:0",
            "title": "Montenegro turns to 231 mln euro budget deficit in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PODGORICA (Montenegro), February 5 (SeeNews) - Montenegro's budget turned to a 231 million euro ($239 million) deficit in 2024, from an 11 million euro surplus in 2023, the finance ministry said.</p><p class=\"\">Last year's deficit was equivalent to 3.2% of the projected gross domestic product (GDP), the finance ministry said in a statement last week.</p><p class=\"\">Under the 2024 budget plan, last year's deficit was projected at 235.5 million euro.</p><p class=\"\">In December alone, the budget gap widened to 231 million euro from 146 million euro in the same month of 2023.</p><p class=\"\">Budget revenue in 2024 was 7.3% higher on the year but 0.6% below plan, reaching 2.755 billion euro, or 37.8% of GDP. Tax revenue in the period amounted to 1.969 billion euro, compared to 1.666 billion euro in the like period of 2023.</p><p class=\"\">Budget expenditures amounted to 2.986 billion euro last year, equivalent to 41% of GDP, and were 16.8% higher compared to 2023, but 0.7% below plan.</p><p class=\"\">Last year's capital budget totalled 251.17 million euro, up 33% compared to 2023.</p><p class=\"\">In August, the government revised the 2024 budget plan, targeting a fiscal deficit of 237 million euro, equivalent to 3.26% of GDP. The revised deficit figure was 1.36 million euro higher than originally planned, but lower as a percentage of GDP due to an updated GDP projection.</p><p class=\"\">In November, the government adopted the 2025 budget draft envisaging a deficit equivalent to 3.5% of the planned gross domestic product (GDP), or 278 million euro. However, the parliament has failed so far to endorse the budget as the opposition has blocked its work.</p><p class=\"\">($ = 0.968 euro)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEE3npka:0-montenegro-turns-to-231-mln-euro-budget-deficit-in-2024/",
            "pub_date": "2025-02-05 16:10:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW08X:0",
            "title": "Tokyo tech IPO soars but Seoul deal tanks 10% in volatile Asian markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">LG CNS shares dive 10%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Tokyo's Next Generation Technology shares jump 58%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets roiled by trade war tensions</li></ul></span></div><span><p class=\"\">    Shares of a small Japanese technology firm shot up nearly 60% on its first day of trade on Wednesday, while Seoul's largest initial public offering (IPO) in three years tanked almost 10% as volatility driven by geopolitics again gripped Asia's equity markets.</p><p class=\"\">South Korea's LG CNS  shares dropped from opening bell and traded in negative territory for the session, failing to arrest the recent trend of weak debuts for the Seoul market. </p><p class=\"\">The IT, cloud and AI services provider's shares closed at 55,800 won, down from their issue price of 61,900 won.</p><p class=\"\">Shares of Next Generation Technology - the first IPO debut of 2025 in Tokyo - traded 58% higher before paring some gains across the day. It raised 1.3 billion yen in the IPO ($8.49 million), according to its regulatory filings.</p><p class=\"\">The strong first day performance came as Tokyo's Nikkei  nudged up 0.1% on Wednesday, In Seoul, the Kospi  gained 1.1%.</p><p class=\"\">MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) was 0.44% higher later Wednesday as China's main equities indices traded lower.</p><p class=\"\">The prospect of a <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/trump-china-us-tariffs-live-updates-2025-02-04/\" rel=\"nofollow\" target=\"_blank\">trade war</a> between the U.S and China as tit-for-tat tariffs between the world's top two economies has raised investor concerns about financial market volatility over the near term.</p><p class=\"\">Asian deal makers were hopeful the region's equity capital markets would perform better in 2025 as global interest rates began to fall and more Chinese IPOs were given regulatory sign off. </p><p class=\"\">LNG CNS last month priced its IPO at the top of its targeted valuation range, raising 1.2 trillion won ($827.1 million). </p><p class=\"\">At closing, the firm's market valuation was about 5.4 trillion won.</p><p class=\"\">The IPO is the largest since LG Energy Solution  raised $10.74 billion in 2022. </p><p class=\"\">Last year, South Korea raised $2.85 billion worth of IPOs, according to LSEG data, up slightly from $2.79 billion in 2023.</p><p class=\"\">LG CNS' offering was one of the few by South Korean firms to draw strong demand in recent months against the backdrop of an IPO market slump since the second half of last year, analysts said. </p><p class=\"\">The retail portion of the initial public offering was oversubscribed nearly 123 times, while more than 2,000 institutional investors made bids worth 76 trillion won during the bookbuilding last month, according to the company. </p><p class=\"\">However, LG CNS's weak market debut has continued a trend of similarly disappointing listings since last year, which analysts said could further discourage investors and other companies from coming to market. </p><p class=\"\">($1 = 1,450.8900 won</p><p class=\"\">($1 = 153.1300 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW08X:0-tokyo-tech-ipo-soars-but-seoul-deal-tanks-10-in-volatile-asian-markets/",
            "pub_date": "2025-02-05 16:10:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463855:0",
            "title": "French Monthly Industrial Production Edges Down 0.4% in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">France's industrial production fell 0.4% month over month in December 2024, following a revised 0.1% rise in November 2024, the country's National Institute of Statistics and Economic Studies said Wednesday. </p><p class=\"\">Analysts expected a 0.1% decline for the month. </p><p class=\"\">On a yearly basis, the index decreased 1.2% in December 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463855:0/",
            "pub_date": "2025-02-05 16:02:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002217_20250205002217:0",
            "title": "Novo Nordisk Shares Rise 6% After 4Q Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002217_20250205002217:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002214:0",
            "title": "Narrowing French-Spanish Bond Yield Spread Signals Improving Sentiment on France — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002214:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002211:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0756 GMT - There are some green shoots in China's consumption spending, but caution persists, HSBC Global Research analysts write in a note. Preliminary data show the country's box office sales exceeded 9 billion yuan during the Lunar New Year holiday, while domestic travel reached a new record of over 2.33 billion cross-regional trips within China, they say. These are positive signs for consumer sentiment, but HSBC remains cautious over whether the holiday spirit can translate into more sustainable momentum without further stimulus. Another fiscal policy push is still needed to drive a sustained increase in activities in the coming months, especially given geopolitical uncertainty, HSBC adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0732 GMT - German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p><p class=\"\">0714 GMT - The impact of Trump's 10% tariff on Chinese exports on China's GDP growth this year looks manageable, Bank of Singapore chief economist Mansoor Mohi-uddin writes in a note. If the 10% levy is maintained for the rest of 2025, that would shave around 0.5% off China's GDP growth, he says. But if tariffs are raised to 20% to 30%, that would likely drag China's economic growth this year to 4.0% from 5.0% last year, he adds. That said, Beijing's retaliation, with targeted tariffs aimed at U.S. exports amounting to only $14 billion, leaves the door open for a potential deal with Washington to avert a broader trade war, he adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0704 GMT - The 'tariff can' has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbours still not off the table entirely, says Pepperstone's Michael Brown. \"In fact, this whole saga could well rumble on until the start of April, when the review ordered by President Trump into U.S. trade policy is due to report back,\" the senior research strategist says in a note. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. \"Perhaps, it is at that point, that we will see tariffs shift from being used as a bargaining chip to further certain political aims, to actually being used as a measure to address trade imbalances,\" Brown says. (emese.bartha@wsj.com)</p><p class=\"\">0659 GMT - Japan, South Korea and Taiwan have dodged tariff bullets for now, but they shouldn't get too comfortable, Moody's Analytics economists say. The three appear obvious targets given their hefty trade surpluses with the U.S. One possible reason is security ties with the U.S. Another is the fact that Japan is among the U.S.'s biggest foreign investors. Korean and Taiwanese firms have been ramping up investment too. That's come at China's expense, aligning with the U.S. bid to curb its influence in supply chains, they add. But the mood could shift and tariffs could come. The economies also face collateral damage. Carmakers like Toyota and Kia have plants in Mexico, and Taiwanese and Korean chip and electronics producers in the U.S. face disruptions via trade barriers or surging production costs. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002211:0/",
            "pub_date": "2025-02-05 16:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}