{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8lqlff:0",
            "title": "Ninety-Nine Percent of Life Sciences and High-Tech Leaders Expect AI to Drive Revenue Management Value in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SAN MATEO, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Model N, the leader in revenue optimization and compliance for life sciences and high-tech companies, published its seventh annual State of Revenue Report, highlighting how executives in these industries are transforming their revenue operations. The report reveals that while 87% of industry leaders are shifting toward automated revenue management operations, nearly 60% still rely on multiple solutions. Additionally, 62% are using or planning to implement generative artificial intelligence (GenAI) for revenue optimization activities, including deal analytics, process automation, and forecasting. </p><p class=\"\">This gap between automation goals and system integration presents both a challenge and an opportunity. The research found that companies with more than 10,000 employees are 51% more likely than smaller organizations to use a unified revenue management solution.  </p><p class=\"\">“Life sciences and high-tech manufacturers are using advanced technologies to automate and optimize revenue operations with data-driven insights,” said Suresh Kannan, Model N Chief Product Officer. “This year’s State of Revenue Report highlights the value of integrating GenAI for revenue management and transitioning to a unified solution. By harnessing AI and consolidating platforms, organizations can unlock greater revenue optimization opportunities, boost efficiency, and drive growth.” </p><p class=\"\">Life Sciences Executives Focus on Regulatory Readiness and AI Adoption </p><p class=\"\">Pharmaceutical companies are modernizing their revenue management approach to navigate a complex regulatory landscape. Pricing strategy is pharmaceutical leaders’ highest priority for revenue management-related strategic investment over the next two years. Eighty-seven percent of leaders report that they have already adjusted their launch plans in response to the Inflation Reduction Act (IRA).</p><p class=\"\">State-level regulations like price transparency mandates and affordability boards are also a significant focus, with 76% of leaders concerned about how the regulatory changes may impact revenue management. Automation and technology, including GenAI, are key enablers, with 62% of pharmaceutical companies using or planning to use GenAI to strengthen revenue operations. </p><p class=\"\">The medtech sector is undergoing a similar transformation. Regulatory changes like healthcare price transparency (45%) and the European Union’s implementation of the Medical Device Regulation (MDR) (40%) top the list of impacts on revenue programs. Nearly two-thirds of medtech companies are already seeing shifts as AI and automation are integrated into healthcare operations, and leaders are beginning to incorporate these approaches into their own company’s revenue optimization and compliance processes. Looking ahead, 38% of leaders are focusing on adapting to value-based care models, expecting further impacts on revenue optimization functions. </p><p class=\"\">High-Tech Manufacturers Strengthen Channel Intelligence</p><p class=\"\">High-tech companies are advancing their use of channel data – in fact, 87% regularly use channel sales data to inform price management and optimization processes. This industry leads in applying new technology to business processes, with 74% of high-tech manufacturers planning to implement GenAI solutions – the highest rate across industries surveyed in the State of Revenue Report.</p><p class=\"\">Supply chain disruption continues to influence strategy, prompting 53% of companies to diversify suppliers, 51% to deploy new technologies, and half to implement sustainability initiatives. Additionally, 95% of high-tech leaders express concerns about grey market sales, implementing measures such as removing unauthorized sellers and enhanced contract enforcement.</p><p class=\"\">For more specific information about revenue optimization in life sciences and high-tech, download the full 2025 State of Revenue Report.</p><p class=\"\">###</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">More About the 2025 State of Revenue Report</strong></p><p class=\"\">This report, commissioned by Model N with research conducted by Dimensional Research, is based on the results of a survey of more than 400 strategy and finance, operations, and technology leaders who are directly responsible for revenue management at large pharmaceutical, medical technology, high-tech, or semiconductor and electronic component manufacturers. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Model N</strong></p><p class=\"\">Model N is the leader in revenue optimization and compliance for pharmaceutical, medtech and high-tech innovators. For 25 years, our intelligent platform has powered digital transformation for pharmaceutical, medtech, and high-tech companies with integrated technology, data, analytics, and expert services that deliver deep insight and control. Our integrated cloud solution is proven to automate pricing, incentive and contract decisions to scale business profitably and grow revenue. Model N is trusted across more than 120 countries by the world’s leading companies, including Johnson &amp; Johnson, AstraZeneca, Stryker, Seagate Technology, Broadcom, and Microchip Technology. For more information, visit www.modeln.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Dimensional Research</strong></p><p class=\"\">Dimensional Research® provides practical market research for technology companies. We partner with our clients to deliver actionable information that reduces risks, increases customer satisfaction, and grows the business. Our researchers are experts in the applications, devices, and infrastructure used by modern businesses and their customers. </p><p class=\"\">PANBlast</p><p class=\"\">modeln@panblastpr.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8lqlff:0-ninety-nine-percent-of-life-sciences-and-high-tech-leaders-expect-ai-to-drive-revenue-management-value-in-2025/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8m3Qty:0",
            "title": "New Toolkit Provides Research-Based Tips to Build Understanding of Public Health’s Role and Value",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bethesda, Maryland, Feb.  04, 2025  (GLOBE NEWSWIRE) — The de Beaumont Foundation today released Communicating about Public Health: A Toolkit for Public Health Professionals, a collection of research-based messaging and practical guidance to build understanding about what public health is, what health departments do, and how that work benefits people’s lives. </p><p class=\"\">“By communicating about specific health topics in a way that’s easy for people to understand and act on, public health professionals can make their communities healthier and safer,” said de Beaumont president and CEO Brian C. Castrucci, DrPH. “But public health organizations often struggle to convey the overarching goals and core concepts of their work, and that can lead to confusion and distrust, especially in an environment with politically driven narratives, misinformation, and a general distrust of government.”  </p><p class=\"\">Based on surveys, focus groups, and in-depth interviews with over 1,600 U.S. adults, de Beaumont and its research partner CommunicateHealth identified five core concepts about the purpose and value of public health that are generally not understood:  </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Public health works at the community level, while health care works at the individual level.   </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Public health focuses on preventing people from getting sick or hurt.   </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Public health workers serve their local communities.   </li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Public health workers play a variety of professional roles – and many work behind the scenes.   </li><li class=\"listItem-bmN0_SHH\">Public health benefits everyone.   </li></ul><p class=\"\">The toolkit includes messaging to address each of these knowledge gaps, research-tested examples to make each core concept more tangible, and practical guidance for public health workers to share information across a variety of real-world situations.  </p><p class=\"\">For more information, view the toolkit at https://debeaumont.org/resources/communicating-about-public-health-toolkit/. </p><p class=\"\">* * * </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the de Beaumont Foundation</strong><strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\">The de Beaumont Foundation creates and invests in bold solutions that improve the health of communities across the country. Its mission is to advance policy, build partnerships, and strengthen public health to create communities where everyone can achieve their best possible health. For more information, visit www.debeaumont.org.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Build your community's understanding of public health      </li><li class=\"listItem-bmN0_SHH\">Terminology tips for public health communication      </li></ul><p class=\"\">Nalini Padmanabhan</p><p class=\"\">de Beaumont Foundation</p><p class=\"\">301-802-6783</p><p class=\"\">media@debeaumont.org</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8m3Qty:0-new-toolkit-provides-research-based-tips-to-build-understanding-of-public-health-s-role-and-value/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9fYNtq:0",
            "title": "National Nonprofit SoldierStrong Announces 2024 Recipients of Annual Commitment to Service Award",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STAMFORD, Conn., Feb.  04, 2025  (GLOBE NEWSWIRE) — SoldierStrong, a national nonprofit dedicated to helping military Veterans take their next steps forward in life after service through the donation of revolutionary medical technology, announced the individual and corporate 2024 recipients of its annual Commitment to Service Award today.</p><p class=\"\">The organization presents the Commitment to Service Award to individuals and corporations that have demonstrated exemplary and inspirational leadership and provided material support to SoldierStrong’s mission. Recipients leverage their talents and resources to elevate the standard of excellence in health care available to our nation’s Veterans.</p><p class=\"\">LTG (Ret) Patricia “Patty” D. Horoho was the 43rd United States Army Surgeon General and the Commander of the U.S. Army Medical Command. She made history as the first woman, first nurse and non-physician to hold these posts. In these roles, General Horoho led the world’s third-largest health care system with a multi-billion-dollar budget, a staff of 156,000 and a global logistics, research and care network that spanned five continents.</p><p class=\"\">In 2017, she was chosen to establish and lead Optum Serve, the end-to-end federal business of both Optum and UnitedHealth Group. Her role has expanded to include leading Optum Health Solutions, and she was later appointed as Chief Strategy, Innovation and Transformation Officer for Optum Health.</p><p class=\"\">She established the 2Serve Together Foundation in 2023, a nonprofit dedicated to empowering and recognizing military women by providing them with opportunities to share their individual stories, or simply put, to say “Thank you for your service.” This initiative was inspired by her late father, Lieutenant Colonel (Ret) Frank J. Dallas, a Veteran of World War II, Korea, and Vietnam.</p><p class=\"\">“SoldierStrong is honored to recognize LTG (Ret) Patty Horoho with our individual 2024 Commitment to Service Award. Her work within the Veteran community and continued support of SoldierStrong have demonstrated her unwavering dedication to service, healthcare, mental health and Veterans,” said SoldierStrong co-founder and chairman Dr. Chris Meek. “I’ve always admired a sentiment attributed to General Horoho: ‘It’s wonderful to be the first, but you are committed to seeing that you’re not the last.’ Her career has been one of trailblazing, not just for herself, but for other women, particularly servicewomen, who have followed in her footsteps. General Horoho's leadership and impact continue to inspire, and her legacy serves as a beacon for all those who strive to serve with excellence, compassion, and vision.”</p><p class=\"\">“It is deeply humbling to be named the 2024 recipient of the SoldierStrong Commitment to Service Award, and I am truly grateful for this prestigious recognition,” said General Horoho. “SoldierStrong’s dedication to serving those who have sacrificed greatly for our democracy and our freedom is both inspiring and critical. I am delighted to be recognized by an organization that embodies the power of service, sacrifice and compassion that allows our Veterans to thrive with the dignity and respect they so richly deserve. It is a privilege to be part of this important work, and I look forward to continuing our collaboration with SoldierStrong.”</p><p class=\"\">Founded in 1989, the Bobby Rahal Automotive Group is a 13-dealership group in central and western Pennsylvania that represents the Acura, BMW, Honda, Jaguar, Land Rover, Lexus, Mercedes-Benz, Toyota, and Volvo brands. For eight consecutive years the group has donated a share of the revenue from every new and used vehicle sold at its central Pennsylvania and Pittsburgh region dealerships to SoldierStrong during the month of November in recognition of Veterans Day.</p><p class=\"\">Under the leadership of founder and chairman of the board Bobby Rahal, 1986 Indianapolis 500 winner and three-time CART champion, the Bobby Rahal Automotive Group is extensively involved in community programs and charitable organizations within the communities they serve. To date, they have contributed over $1 million in charitable funds to numerous organizations, including more than $260,000 in donations to SoldierStrong.</p><p class=\"\">“The Bobby Rahal Automotive Group’s commitment to charitable causes is second to none,” said Meek. “Recognizing Rahal Automotive with our corporate Commitment to Service Award serves as a testament to the selfless generosity their team continues to show by having the backs of those servicemen and women who have had our backs on the battlefield and beyond. Their ability to rally communities around life-changing causes is an example of benevolence, leadership and doing the right thing for all Americans to look up to.”</p><p class=\"\">“It is truly an honor to receive SoldierStrong’s Commitment to Service Award. It is our privilege to assist in efforts to bring cutting-edge medical devices and technology to improve the daily lives of the brave men and women who have selflessly served to protect and defend our country and its citizens,” said Harrisburg Area Bobby Rahal Automotive Group President, Brad Lee. “The SoldierStrong mission aligns perfectly with our core value and belief that involvement in the communities we serve is imperative and contributes to the growth and welfare of both the public and our company.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About SoldierStrong: </strong>Since 2009, SoldierStrong has assisted America’s military veterans in taking their next steps forward in life after service. Our mission is fully realized through the donation of revolutionary medical technology to Veterans Affairs medical facilities and individual veterans across the country. These revolutionary medical technologies include the SoldierSuit, a wearable robotic exoskeleton used to help paralyzed and injured veterans walk again, and the BraveMind virtual reality system used to treat post-9/11 veterans living with the devastating impacts of post-traumatic stress (PTS). To date, SoldierStrong has donated more than $7 million in advanced medical technology, including 30 SoldierSuits and 30 BraveMind systems. For more information, visit soldierstrong.org.</p><p class=\"\">CONTACT: ERIC WOOLSON</p><p class=\"\">515.681.3967</p><p class=\"\">Photos accompanying this announcement are available at </p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/dfc530e0-9200-498a-8bc2-ae63bbc4b519</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/92d46137-d211-44c8-aa47-ff7e798222a5</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LTG (Ret) Patricia “Patty” D. Horoho</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">LTG (Ret) Patricia “Patty” D. Horoho</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bobby Rahal Automotive Group</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Bobby Rahal Automotive Group</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9fYNtq:0-national-nonprofit-soldierstrong-announces-2024-recipients-of-annual-commitment-to-service-award/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN34097D:0",
            "title": "Modular Finance IR Consensus: Knowit – Consensus estimates Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estimates compiled by Modular Finance on behalf of Knowit.</p><p class=\"\">Number of contributors: 4 (all of which have been updated or confirmed before the report)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\">KPI (MSEK, unless otherwise specified)</td><td colspan=\"1\" rowspan=\"1\">Q4 2024E</td></tr><tr><td colspan=\"1\" rowspan=\"1\">Net sales</td><td colspan=\"1\" rowspan=\"1\">1,655</td></tr><tr><td colspan=\"1\" rowspan=\"1\">Operating profit, EBITA</td><td colspan=\"1\" rowspan=\"1\">119</td></tr><tr><td colspan=\"1\" rowspan=\"1\">EBITA margin (%)</td><td colspan=\"1\" rowspan=\"1\">7.2</td></tr><tr><td colspan=\"1\" rowspan=\"1\">EBIT</td><td colspan=\"1\" rowspan=\"1\">77</td></tr><tr><td colspan=\"1\" rowspan=\"1\">Net profit</td><td colspan=\"1\" rowspan=\"1\">53</td></tr><tr><td colspan=\"1\" rowspan=\"1\">Earnings per share (EPS)</td><td colspan=\"1\" rowspan=\"1\">1.93</td></tr></tbody></table></div><p class=\"\">Knowit’s Q4 report will be released on Friday 7 February at 7:30 CET.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN34097D:0-modular-finance-ir-consensus-knowit-consensus-estimates-q4-2024/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7lrm57:0",
            "title": "Global Virus Network (GVN) Adds Duke University School of Medicine, Czech Republic’s National Institute of Virology and Bacteriology, University of Pennsylvania Perelman School of Medicine, and Yale University as Newest Centers of Excellence",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TAMPA, Fla., Feb.  04, 2025  (GLOBE NEWSWIRE) — The Global Virus Network (GVN), comprised of eminent human and animal virologists from 80+ Centers of Excellence and Affiliates in 40+ countries, announced the addition of Duke University School of Medicine, The National Institute of Virology and Bacteriology, a consortium of research institutes from the Czech Republic, University of Pennsylvania Perelman School of Medicine, and Yale University as GVN’s newest Centers of Excellence.</p><p class=\"\">“We are pleased to announce GVN’s newest Centers of Excellence,” said <strong class=\"root-Tkn6WL2y\">Robert C. Gallo, MD</strong>, chairman of the Scientific Leadership Board and co-founder of the GVN. <!-- -->\"By fostering collaboration, driving innovation, and advancing scientific understanding, we are strengthening and enhancing the global health infrastructure. Each of these four new Centers brings invaluable expertise, and together, we will expand the frontiers of virus research and control, ensuring the protection of future generations from emerging threats.\" Dr. Gallo is also the James P. Cullison Professor of Medicine, director of the USF Health Virology Institute at the University of South Florida, and director of the Microbial Oncology Program at Tampa General Hospital (TGH) Cancer Institute.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Duke University School of Medicine</strong> comprises several entities that will collaborate well with the GVN. Duke Research and Discovery @RTP is a research hub for Duke University School of Medicine scientists devoted to the study of infectious diseases. Located in the world-famous Research Triangle Park (RTP), the campus is near more than 300 companies, including science and technology firms, government agencies, academic institutions, startups, and nonprofits. Additionally, the Duke Global Health Institute works to achieve health equity for vulnerable groups and individuals worldwide through research, education, and partnership. Importantly, the Duke Human Vaccine Institute (DHVI) continues to lead with cutting-edge vaccine research against infectious diseases that impact global health. Scientists at the DHVI conduct basic and translational research to develop novel vaccines, therapeutics, and diagnostics for diseases such as HIV-1, influenza, SARS-CoV-2, tuberculosis, syphilis, and gonorrhea. Several DHVI basic science discoveries are currently being produced in current Good Manufacturing Practice (cGMP) facilities for early-phase vaccine trials.</p><p class=\"\">“We look forward to working with the GVN to help develop diagnostics for emerging pathogens, manufacture investigational biologics for use in Phase I clinical trials, and help conduct human trials of monoclonal antibodies or vaccines for re-emerging or emerging pathogens,” said <strong class=\"root-Tkn6WL2y\">Thomas N. Denny, MSc, M.Phil, </strong>director of the new center of excellence at the GVN and chief operating officer of the DHVI, associate dean for Duke Research and Discovery @RTP, and professor of medicine in the department of medicine at Duke University Medical Center. He is also an affiliate member of the Duke Global Health Institute.</p><p class=\"\">The National Institute of Virology and Bacteriology (NIVB) is a unique research platform that brings together top research institutes from all over the Czech Republic, aiming to accelerate the development of drugs and vaccines against viral and bacterial diseases. NIVB’s efforts focus on developing safe and effective therapies that counteract viruses and bacteria with pandemic potential. The design of new therapeutics requires a fundamental understanding of the mechanisms that allow pathogens to infect cells and cause disease, which are unfortunately still poorly understood. Thus, NIVB focuses on a combination of basic and clinical research on viruses and pathogenic bacteria to better understand the processes by which pathogens cause disease, escape the immune system, and resist treatment. NIVB is comprised of the Institute of Organic Chemistry and Biochemistry of the Czech Academy of Sciences (CAS), Masaryk University, Charles University, University of Chemistry and Technology Prague, Palacký University Olomouc, Institute of Molecular Genetics of the CAS, Institute of Microbiology of the CAS, and Biology Centre CAS.</p><p class=\"\">“NIVB was established with funding from the European Union’s program NextGenerationEU as part of a plan to recover Europe after the COVID-19 pandemic and to better prepare for future pandemics,” said <strong class=\"root-Tkn6WL2y\">Zdeněk Hostomský, PhD</strong>, director of the new center of excellence at the GVN and director of NIVB. <!-- -->“In addition to basic and applied research we conduct at the NIVB, the education of students and junior researchers is an integral and important part of our activities. Obtaining GVN membership is an opportunity for our young scientists to further their education and development while participating in the GVN's training programs and pursuing internships at GVN partner institutions. Further, our experienced researchers can share their expertise by contributing to the GVN training programs. Our laboratories are well-equipped, and we are happy to host colleagues from other GVN institutions. Because, above all, passing on experience to future generations is central to society's preparedness to face future pandemics and other challenges.”</p><p class=\"\">The Perelman School of Medicine of the University of Pennsylvania is one of the world’s leading academic medical centers, dedicated to the related missions of medical education, biomedical research, excellence in patient care, and community service. Founded in 1765, the Perelman School of Medicine is the oldest medical school in the United States. The Perelman School of Medicine is consistently among the nation's top funding recipients from the National Institutes of Health, with $580 million awarded in the 2023 fiscal year. Home to a proud history of “firsts” in medicine, Penn Medicine teams have pioneered discoveries and innovations that have shaped modern medicine, including recent breakthroughs such as CAR T cell therapy for cancer and the Nobel Prize-winning mRNA technology used in COVID-19 vaccines.</p><p class=\"\">“I have been involved with the GVN for the past two years, having spoken at the 2023 and 2024 annual meetings and participated last year as a lecturer in the GVN Short Course for Translational Virology,” said <strong class=\"root-Tkn6WL2y\">Susan R. Weiss, PhD</strong>, director of the new center of excellence at the GVN and professor of microbiology, vice chair of the department of microbiology of the University of Pennsylvania, and director of the Penn Center for Research on Coronaviruses and Other Emerging Pathogens. <!-- -->“My own research involves human coronaviruses, and, most relevant to the GVN, we are investigating the determinants of MERS-CoV spillover into humans. I look forward to continuing to contribute my expertise in coronavirus biology and pathogenesis to the GVN. I am also eager to interact with international scientists to further investigate strains of MERS-CoV that are currently circulating and to evaluate the threat of future coronavirus pandemics. I initially joined the GVN as an individual member, and in this new capacity, I look forward to integrating other groups at Penn.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Yale University</strong>, founded in 1701, is one of the world’s premier universities. Its leadership position in education and research, its collegial environment, and its closely interconnected campus make Yale ideally suited to provide the intellectual and physical infrastructure for effectively integrating clinical and basic science collaborative research efforts. Yale is home to diverse leading virologists in public health, medicine, ecology &amp; evolution, and beyond. The new Yale Center of Excellence is co-led by <strong class=\"root-Tkn6WL2y\">Chantal Vogels, PhD</strong>, assistant professor of epidemiology (microbial diseases), <strong class=\"root-Tkn6WL2y\">David Martinez, PhD</strong>, assistant professor of immunobiology, <strong class=\"root-Tkn6WL2y\">Inci Yildirim, MD, PhD</strong>, associate professor of pediatrics (infectious diseases) and public health (epidemiology of microbial diseases), and <strong class=\"root-Tkn6WL2y\">Craig Wilen, MD, PhD</strong>, associate professor of laboratory medicine and immunobiology. Together with virologists across the Yale campus, they are committed to finding innovative solutions to better prevent and control viral diseases through collaborative research and training.</p><p class=\"\">“I am thrilled to establish the Yale GVN Center of Excellence and to join forces with GVN to mitigate the burden of emerging viral diseases on public health,” said <strong class=\"root-Tkn6WL2y\">Dr. Vogels</strong>.</p><p class=\"\">\"We are excited to welcome these four prestigious institutions and their renowned experts, significantly strengthening our expertise in virus research and training,\" said <strong class=\"root-Tkn6WL2y\">Sten H. Vermund, MD, PhD,</strong> chief medical officer of the GVN and Distinguished University Health Professor and dean of the USF Health College of Public Health at the University of South Florida. <!-- -->\"Their contributions will be invaluable to the GVN, offering essential resources and specialized knowledge to combat and mitigate viral threats while also training the next generation of virologists who will lead the battle against emerging infections. Through these partnerships, the GVN looks forward to providing our new members with impactful and unique opportunities to help end viral threats through global collaborative science, innovation, and implementation.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>About the Global Virus Network (GVN)</em></strong></p><p class=\"\">The GVN, headquartered at the University of South Florida, is essential and critical in the preparedness, defense, and first research response to emerging, existing, and unidentified viruses that pose a clear and present threat to public health. Working in close coordination with established national and international institutions, the GVN is a coalition comprised of eminent human and animal virologists from 80+ Centers of Excellence and Affiliates in 40+ countries, working collaboratively to train the next generation, advance knowledge about how to identify and diagnose pandemic viruses, mitigate and control how such viruses spread and make us sick, as well as develop drugs, vaccines, and treatments to combat them. No single institution in the world has expertise in all viral areas other than the GVN, which brings together the finest medical virologists to leverage their individual expertise and coalesce global teams of specialists on the scientific challenges, issues, and problems posed by pandemic viruses. The GVN is a non-profit 501(c)(3) organization. For more information, please visit www.gvn.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact: </strong></p><p class=\"\">Nora Samaranayake, GVN </p><p class=\"\">nsamaranayake@gvn.org</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7lrm57:0-global-virus-network-gvn-adds-duke-university-school-of-medicine-czech-republic-s-national-institute-of-virology-and-bacteriology-university-of-pennsylvania-perelman-school-of-medicine-and-yale-university-as-newest-centers-of-excellence/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2mqR5s:0",
            "title": "Frank's Redhot® and Paris Hilton Glam Up Big Game Eats and Launch Sweepstakes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toronto, ON, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">TORONTO</strong><strong class=\"root-Tkn6WL2y\">, </strong><strong class=\"root-Tkn6WL2y\">ON</strong><strong class=\"root-Tkn6WL2y\">., Feb</strong><strong class=\"root-Tkn6WL2y\">. </strong><strong class=\"root-Tkn6WL2y\">4</strong><strong class=\"root-Tkn6WL2y\">, 2025 </strong>– Frank’s RedHot®, the #1 hot sauce in the world*, is upping the ante with pop culture icon, Paris Hilton, just in time for Big Game 59. </p><p class=\"\">“Paris Hilton is a consummate entertainer who knows a thing or two about what’s hot and what’s not,” says Tabata Gomez, Chief Marketing Officer at McCormick &amp; Company, Inc. “I think fans are going to love seeing Frank’s with Paris’ flair and tongue-in-cheek personality—an invitation to all to go bold and dial up their game day flavours. Hit us with your most out-there food pairings.” </p><p class=\"\">The collaboration with Hilton’s next-gen media company, 11:11 Media, has Hilton making irresistible game day recipes, and encouraging fans to show how they heat up their favorite foods with Frank’s for a chance to win exciting prizes that include enough cash to get them Frank’s RedHot for life.** Fans can follow Frank's RedHot on Instagram as Paris Hilton changes up her catchphrase “That’s Hot” to make it “That’s RedHot” for a rousing game day experience.  </p><p class=\"\">“Whether you’re rooting for a team, the commercials or the halftime show—I’m here to make sure all football foods are full-flavored and totally slay,“ says Paris Hilton. “That’s why I’m collaborating with Frank’s RedHot to shake up game day spreads with unmatched flavor. The real MVP is the host… now that’s RedHot.” </p><p class=\"\">Hilton will challenge fans to put Frank’s RedHot on their favourite foods for a chance to win—leading up to the Big Game, from Feb. 3 through Feb. 9. In honor of the 59th Big Game, 59 lucky winners will receive $1,000 USD in cash, enough to get Frank’s RedHot for life. Five additional winners will score the cash prize plus an ultra-exclusive, custom crystal-bedazzled bottle of Frank’s RedHot, designed in collaboration with Hilton. To enter for a chance to win, fans can share videos or photos of foods they’re heating up with Frank’s RedHot for the Big Game by tagging @FranksRedHot and including #FranksSweepstakes. ​​​​Entries can also be submitted here. Limit one entry per person. </p><p class=\"\">Hilton is no stranger to the kitchen as she previously hosted the lighthearted show “Cooking With Paris,” where she brought her fun, over-the-top style to every dish. With this collaboration, Hilton flexes her foodie sensibilities to show fans how to create iconic Frank’s RedHot recipes like Buffalo Chicken Dip and Buffalo Chicken Wings. </p><p class=\"\">For information about the partnership and sweepstakes, and to find more game day recipes, visit FranksRedHot.com/ca. Follow @FranksRedHot and @ParisHilton on social media for all the hot sauce action leading up to and during the game. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Note</strong>: Download high-resolution images <strong class=\"root-Tkn6WL2y\">here</strong><strong class=\"root-Tkn6WL2y\">.</strong> Media assets may be credited to Frank's RedHot.  </p><p class=\"\"><em>*</em>Source Euromonitor International Limited; based on custom research conducted September 2024 for volume sales (ounces/ml) in 2023 through all retail channels. <em>Hot sauce</em> <em>defined</em> as spicy table sauce/condiment made from chiles and excludes chili paste, chili oil and dried chili powder/flakes. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>**</em></strong><strong class=\"root-Tkn6WL2y\"><em>NO PURCHASE NECESSARY TO ENTER OR WIN. </em></strong>Open only to legal U.S. residents of 50 U.S. and D.C., 18+ (19+ in AL/NE, 21+ in MS) and legal residents of Canada (excluding Quebec) at/over the age of majority. Void <em>where</em> prohibited by law and outside the US/Canada. Starts 02/0<em>3</em>/25 at 8:00 a.m. ET; ends 02/10/25 at 7:59 a.m. ET. To enter through Instagram, log into your Instagram account, make sure your account is set to “public,” and create your own post on Instagram by taking and posting a photo or video (60 seconds or less) of you putting Frank’s <em>RedHot</em> on the food you love, then include the hashtag #FranksSweepstakes in your caption and tag @FranksRedHot in your post. Or, to enter through the website for free, go to <em>www.franksredhot.com/thatsredhotCA</em><em> and fill out/</em><em>submit</em> entry form with all requested information. Total ARV of 64 prizes: <em>$65,250.00 USD.</em> <em>Sponsor</em><em> may issue prizes in CAD, at its discretion</em><em>. </em><em>Limit 1 entry per person. Full rules: </em><em>https://www.franksredhot.com/thatsredhotCA</em><em>.</em> Sponsor: McCormick &amp; Company, Incorporated, 24 Schilling Rd Suite 1, Hunt Valley, MD 21301. Sweepstakes not sponsored or administered by Meta Platforms, Inc.<em> </em> </p><p class=\"\">###  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Frank's </strong><strong class=\"root-Tkn6WL2y\">RedHot</strong>  </p><p class=\"\">It all started back in 1920 when the first bottle of Original Cayenne Pepper Sauce was introduced. Made with a premium blend of aged cayenne peppers, Frank’s RedHot adds the perfect blend of flavour and heat to your favourite foods. Frank’s Cayenne Pepper Sauce was used as the secret ingredient in the original Buffalo wings created in Buffalo, NY in 1964. Try our family of products including the Original sauce, Buffalo Wings sauce, Queso Dip seasoning mix, Buffalo Ranch seasoning, Frozen Buffalo Wings and more. Visit www.FranksRedHot.com for more information and recipes.  </p><p class=\"\">Frank’s is one of McCormick &amp; Company's (MKC) brands. With over $6.5 billion in annual sales across 150 countries and territories, McCormick is a global leader in flavour. Founded in 1889 and headquartered in Hunt Valley, Maryland USA, McCormick is guided by our principles and committed to our Purpose – To Stand Together for the Future of Flavour. McCormick envisions A World United by Flavour where healthy, sustainable, and delicious go hand in hand. To learn more, visit mccormickcorporation.com or follow McCormick &amp; Company on Instagram and LinkedIn. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About 11:11 Media</strong> </p><p class=\"\">11:11 Media is a global, next-gen entertainment company at the center of pop culture – connecting content, community and commerce – founded by Paris Hilton and entertainment industry veteran Bruce Gersh in 2021. The company spans a broad array of businesses including film, TV, audio, music, books, consumer products, and digital, with passion points around lifestyle, fashion, beauty, wellness, art, travel and more. Elevating brands, building communities, and driving social impact through the power of storytelling, experience, and products is the core mission of 11:11 Media. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contacts</strong> </p><p class=\"\">Cierra Colón </p><p class=\"\">McCormick &amp; Company </p><p class=\"\">Cierra_Colon@mccormick.com  </p><p class=\"\">Amanda Swinhoe </p><p class=\"\">North Strategic </p><p class=\"\">Amanda.Swinhoe@northstrategic.com </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Frank's RedHot and Paris Hilton Glam Up Big Game Eats      </li></ul><p class=\"\">Amanda Swinhoe</p><p class=\"\">North Strategic</p><p class=\"\">amanda.swinhoe@northstrategic.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2mqR5s:0-frank-s-redhot-and-paris-hilton-glam-up-big-game-eats-and-launch-sweepstakes/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7CKWGn:0",
            "title": "Fazoli’s Introduces Fresh Twist on Classic Pasta Dish—Lasagna Rolls",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Beloved Italian Chain Cooks Up New Pasta Dishes, Brings Back Fan-Favorite Dessert</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LOS ANGELES, Feb.  04, 2025  (GLOBE NEWSWIRE) — </strong>Fazoli’s, America’s favorite fast and fresh Italian chain owned by FAT Brands Inc., is starting 2025 on a fresh note—with an all-new twist to its beloved lasagna. Beginning today, Feb. 4, through April 28, pasta lovers can dig into four different <em>Lasagna Roll</em> meal options for a limited time.</p><p class=\"\">From meaty to extra cheesy options, including an unbeatable duo deal of a lasagna roll and fettuccine alfredo starting at just $5.99, there are plenty of flavorful pasta options made with fresh ingredients for fans to noodle over:</p><p class=\"\">-<strong class=\"root-Tkn6WL2y\">L</strong><strong class=\"root-Tkn6WL2y\"><em>asagna Roll and Fettuccine Alfredo Duo</em></strong><em> - </em>Lasagna noodles rolled with cheesy ricotta filling, covered with Marinara sauce and served side-by-side with Fettuccine topped with Alfredo sauce. Baked with Mozzarella and Provolone cheeses.</p><p class=\"\">-<strong class=\"root-Tkn6WL2y\"><em>Classic Lasagna Roll</em></strong> - Lasagna noodles rolled with cheesy ricotta filling, topped with sausage, mushrooms, and meat sauce then baked to perfection. A fun twist on a popular classic.</p><p class=\"\">-<strong class=\"root-Tkn6WL2y\"><em>Chicken Alfredo Lasagna Roll</em></strong> - Lasagna noodles rolled with cheesy ricotta filling, topped with alfredo sauce, chicken, and broccoli then baked to perfection with mozzarella.</p><p class=\"\">-<strong class=\"root-Tkn6WL2y\"><em>Shrimp Alfredo Lasagna Roll</em></strong> - Lasagna noodles rolled with cheesy ricotta filling, topped with alfredo sauce, garlic shrimp, and broccoli then baked to perfection with mozzarella.</p><p class=\"\">A sweet touch to the menu – brought back by popular demand – is the <em>Italian Cream Cake</em>. Guests will be sure to leave room for the fan-favorite treat made with moist vanilla cake and filled with Italian mascarpone mousse with a hint of lemon, finished with a butter streusel topping, and a dusting of powdered sugar.</p><p class=\"\">“While Fazoli’s is known for its classic, mouthwatering pasta dishes, as a brand, we continually look for ways to innovate and provide unique spins on menu items our fans already love,” said Tisha Bartlett, VP of Marketing at Fazoli’s. “We have a <em>Lasagna Roll</em> option that hits the spot for everyone—from both a flavor and value perspective.”</p><p class=\"\">Since 1988, Fazoli's has been committed to serving quality Italian food, fast, fresh, and friendly. From unlimited signature breadsticks to freshly prepared pasta entrees, the chain prides itself on serving high-quality menu offerings, all at an affordable price.</p><p class=\"\">For more information or to find a Fazoli’s near you, visit www.fazolis.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FAT (Fresh. Authentic. Tasty.) Brands</strong> </p><p class=\"\">FAT Brands  is a leading global franchising company that strategically acquires, markets, and develops fast casual, quick-service, casual dining, and polished casual dining concepts around the world. The Company currently owns 18 restaurant brands: Round Table Pizza, Fatburger, Marble Slab Creamery, Johnny Rockets, Fazoli’s, Twin Peaks, Smokey Bones, Great American Cookies, Hot Dog on a Stick, Buffalo’s Cafe &amp; Express, Hurricane Grill &amp; Wings, Pretzelmaker, Elevation Burger, Native Grill &amp; Wings, Yalla Mediterranean and Ponderosa and Bonanza Steakhouses and franchises and owns approximately 2,300 units worldwide. For more information, please visit www.fatbrands.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fazoli's: Fast. Fresh. Italian.</strong> </p><p class=\"\">Fast. Fresh. Italian. Founded in 1988 in Lexington, Ky., Fazoli's owns and operates nearly 220 restaurants in 27 states, making it the largest QSR Italian chain in America. Fazoli’s prides itself on serving quality Italian food, fast, fresh and friendly. Menu offerings include freshly prepared pasta entrees, sub sandwiches, salads, pizza and desserts – along with its unlimited signature breadsticks. For more information, visit www.Fazolis.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MEDIA C</strong><strong class=\"root-Tkn6WL2y\">ontact</strong><strong class=\"root-Tkn6WL2y\">: </strong> </p><p class=\"\">Erin Mandzik, FAT Brands </p><p class=\"\">emandzik@fatbrands.com </p><p class=\"\">860-212-6509</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7CKWGn:0-fazoli-s-introduces-fresh-twist-on-classic-pasta-dish-lasagna-rolls/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXcgzfST:0",
            "title": "Elevated Materials™ Launches to Revolutionize Battery Performance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SANTA CLARA, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Elevated Materials™, a newly formed independent company, launched today with investments from TPG’s Rise Climate fund and Applied Materials, Inc. Building on extensive technology development from Applied, Elevated Materials brings to market revolutionary ultra-thin, uniform lithium films designed to enable the next generation of batteries with enhanced energy density, cycle life, and charge rates.</p><p class=\"\">“Today’s battery market is under immense pressure to deliver improved battery performance and lower cost,” said <strong class=\"root-Tkn6WL2y\">Jim Cushing, CEO of Elevated Materials</strong>. “We are helping our customers solve these challenges with our differentiated roll-to-roll vapor deposition technology. Elevated Materials’ advanced lithium films maximize energy density and provide a cost-effective solution for gigawatt-hour scale production.”</p><p class=\"\">Leveraging decades of materials engineering expertise and hundreds of patents, Elevated Materials’ technology represents a breakthrough in battery innovation that can be applied across graphite, silicon, and lithium metal anodes. With a significant equity investment from TPG Rise Climate, the dedicated climate investing strategy of global alternative asset management firm TPG, Elevated Materials is equipped to help advance better-performing, lower-cost electric vehicles, eVTOLs and e-aircraft, energy storage systems, and consumer electronics.</p><p class=\"\">“Elevated Materials' expertise in thin film technology is a big step for next-generation batteries,” said <!-- -->Dr. Peter Lamp, Principal Expert Battery Cell Technology, BMW Group. “Its innovative solutions are key to overcoming challenges in energy density and anode-specific capacities, such as silicon oxide materials or lithium-metal. I am confident that Elevated Materials' technology has high potential to enhance lithium-ion cell performance and hence address a huge market.”</p><p class=\"\">“Our deep understanding of the climate sector broadly, and green mobility supply chain specifically, has positioned us to uncover, carve-out, and scale breakthrough technologies like Elevated Materials,” said <!-- -->Jonathan Garfinkel, a Managing Partner of TPG Rise Climate. “Incubated inside Applied Materials, a proven leader in materials science, we believe Elevated Materials’ lithium film technology will play a key role in accelerating the electrification of energy, transportation, and other industries. We look forward to complementing Applied Materials’ world-class technology expertise with TPG’s business-building capabilities to accelerate and scale this new business to serve the world’s largest battery, auto, and aviation OEMs around the world.”</p><p class=\"\">“At Applied Materials, we believe that materials engineering is a fundamental capability that has the power to transform industries and make possible a better future,” said <!-- -->Dr. Om Nalamasu, Chief Technology Officer and Senior Vice President, Applied Materials. “The launch of Elevated Materials is a testament to the creativity and dedication of our team, customers, and ecosystem partners in turning the vision of a next-generation energy economy into reality.”</p><p class=\"\">Elevated Materials has offices in Santa Clara, Calif. and Alzenau, Germany. To learn more about how Elevated Materials is driving innovation with better materials for better batteries, please visit Elevated.inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TPG Rise Climate</strong></p><p class=\"\">TPG Rise Climate is the dedicated climate investing strategy of TPG’s $25 billion global impact investing platform. TPG Rise Climate pursues climate-related investments that benefit from the diverse skills of TPG’s investing professionals, the strategic relationships developed across TPG’s existing portfolio of climate-focused companies, and a global network of executives and advisors. The fund takes a broad-based sector approach to investment types, from growth equity to buyouts, and focuses on climate solutions in the following thematic areas: clean electrons, clean molecules and materials, and negative emissions. For more information, please visit www.therisefund.com/tpgriseclimate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Elevated Materials</strong></p><p class=\"\">Elevated Materials is at the forefront of battery innovation, delivering ultra-thin, uniform lithium films through our advanced vapor deposition process. Our lithium films unlock battery performance, enhancing energy density, lifespan and charge rates. Leveraging decades of materials engineering expertise and hundreds of patents, our technology can be applied across graphite, silicon, and lithium metal anodes and tailored to the customer's end-product needs. We empower electric vehicles, eVTOL aircraft, grid energy storage systems, and consumer electronics to achieve unparalleled performance and longevity. For more information, please visit Elevated.inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For media inquiries, please contact:</strong></p><p class=\"\">Edward Lin</p><p class=\"\">Merritt Group, on behalf of Elevated Materials</p><p class=\"\">elevated@merrittgrp.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXcgzfST:0-elevated-materials-launches-to-revolutionize-battery-performance/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbbQ7QM:0",
            "title": "Edmunds Presents 13th Annual Five Star Dealer Awards Honoring Outstanding Customer Service",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SANTA MONICA, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Edmunds, an online car shopping resource that generates more than 20 million visits every month, today announced the winners of the 2025 Edmunds Five Star Dealer Awards. This year’s awards honor 107 dealers nationwide for outstanding customer satisfaction ratings, with 10 of those dealers earning the prestigious Edmunds Five Star Premier Dealer designation.</p><p class=\"\">“The automotive market continued to normalize in 2024 after years of disruption, but affordability challenges remained a significant hurdle for many car shoppers. In this environment, consumers increasingly turned to trusted resources like Edmunds for guidance and demonstrated a stronger preference for dealerships that prioritized outstanding service and positive shopping experiences,\" said Seth Berkowitz, president of Edmunds. \"Edmunds’ Five Star Dealer Awards honor the extraordinary efforts of dealerships across the country that go above and beyond to make customers feel comfortable, valued, and supported throughout the car-buying and ownership journey.\"</p><p class=\"\">To qualify for a Five Star Dealer Award, dealers must be actively participating in the Edmunds Dealer Partner program, receive at least 30 sales reviews in 2024, and earn an average customer sales review rating of at least 4.5 stars on Edmunds during the 2024 calendar year. To qualify for a Five Star Premier Award, dealers must meet all the requirements of a Five Star Dealer Award and also receive at least 150 sales reviews on Edmunds in 2024.</p><p class=\"\">To find the full list of 2025 winners, visit the Edmunds Industry Center at https://www.edmunds.com/industry/five-star-dealers.html. Edmunds Five Star Dealerships are organized by state, making it easy to identify local winners. Car shoppers can look up the reviews and ratings for any dealer in their area on the Find a Dealer page on Edmunds. Winning dealerships are distinguished by the Five Star Dealer badge on Edmunds and are also presented with a physical trophy to celebrate their achievement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Edmunds</strong></p><p class=\"\">Edmunds guides car shoppers online from research to purchase. With in-depth reviews of every new vehicle, shopping tips from an in-house team of experts, plus a wealth of consumer and automotive market insights, Edmunds helps millions of shoppers each month select, price and buy a car with confidence. Regarded as one of America's best workplaces by Fortune, Great Place to Work and Built In, Edmunds is based in Santa Monica, California. Follow us on TikTok, Twitter, Facebook and Instagram.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">###</strong></p><p class=\"\">Mitch Paul</p><p class=\"\">Edmunds</p><p class=\"\">310-491-8738</p><p class=\"\">pr@edmunds.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbbQ7QM:0-edmunds-presents-13th-annual-five-star-dealer-awards-honoring-outstanding-customer-service/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1bRG4z:0",
            "title": "EdgeRunner AI and Carahsoft Partner to Bring Air-Gapped, Generative AI to the Public Sector",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SEATTLE and RESTON, Va., Feb.  04, 2025  (GLOBE NEWSWIRE) — EdgeRunner AI, a leader in air-gapped, domain specific Generative AI for the Warfighter, and Carahsoft Technology Corp., The Trusted Government IT Solutions Provider®, today announced a partnership. Under the agreement, Carahsoft will serve as EdgeRunner AI’s Public Sector distributor, making the company’s EdgeRunner Athena platform available to the Public Sector through Carahsoft’s reseller partners and NASA Solutions for Enterprise-Wide Procurement (SEWP) V, Information Technology Enterprise Solutions – Software 2 (ITES-SW2), National Association of State Procurement Officials (NASPO) ValuePoint, The Interlocal Purchasing System (TIPS) and OMNIA Partners contracts.</p><p class=\"\">“We are thrilled to partner with Carahsoft to bring air-gapped, domain-specific Generative AI to the Warfighter and our Public Sector partners,” said Tyler Saltsman, Founder and CEO at EdgeRunner AI. “EdgeRunner’s advanced technology, combined with Carahsoft’s reach and expertise, enables the Warfighter and Public Sector to bring the power of Generative AI to the edge, privately and securely without internet connectivity. This will be the standard for AI agents assisting our Warfighters in combat.”</p><p class=\"\">EdgeRunner offers a sophisticated, air-gapped Generative AI platform that delivers personalized support on any device. Specifically engineered for Warfighters and the Public Sector, this technology enhances battlefield readiness in real time and streamlines a single common operating picture (COP) through natural language processing (NLP) akin to a human conversation. By offering a hyper-personalized assistant that functions independently of internet connectivity, EdgeRunner fundamentally transforms how the Department of Defense, Public Sector and State and Local Governments meet their operational requirements.</p><p class=\"\">EdgeRunner Athena enhances productivity, decision-making and operational efficiency while maintaining stringent data privacy and security protocols. Utilizing EdgeRunner's advanced open source small language models (SLMs), Athena is highly adaptable for mission-specific applications and is compatible with diverse hardware configurations. Functioning as a dedicated personal assistant and subject matter expert (SME), Athena excels in providing mission readiness assessments, delivering real-time combat support, drafting memos, summarizing extensive documents, brainstorming solutions, addressing job-specific inquiries, transcribing meetings, translating conversations, clarifying internal policies, generating calendar invites and more. With EdgeRunner Athena, customers gain a personalized AI ally equipped to assist in critical tasks, whenever needed, that’s specific to them.</p><p class=\"\">“With the addition of EdgeRunner AI to our offerings, Carahsoft and its reseller partners are now able to equip Government agencies with an innovative, air-gapped Generative AI solution that enhances mission readiness and operational effectiveness,” said Michael Adams, Program Executive for AI Solutions at Carahsoft. “EdgeRunner Athena’s ability to provide secure, personalized support for Warfighters and Public Sector agencies ensures these organizations have the AI-driven tools necessary to excel in critical situations.”</p><p class=\"\">EdgeRunner AI’s solutions are available through Carahsoft’s SEWP V contracts NNG15SC03B and NNG15SC27B, ITES-SW2 Contract W52P1J-20-D-0042, NASPO ValuePoint Master Agreement #AR2472, TIPS Contract #220105 and OMNIA Partners Contract #R191902. For more information, contact the Carahsoft Team at (703) 871-8548 or EdgeRunner@carahsoft.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EdgeRunner AI</strong></p><p class=\"\">EdgeRunner offers a state-of-the-art, air-gapped Generative AI platform that delivers personalized support on any device. Specifically engineered for Warfighters and the Public Sector, this technology enhances battlefield readiness in real time and streamlines a single common operating picture (COP) through natural language processing (NLP) akin to a human conversation. By offering a hyper-personalized assistant that functions independently of internet connectivity, EdgeRunner fundamentally transforms how the Department of Defense, Public Sector and State and Local Governments meet their operational requirements. Learn more at: https://www.edgerunnerai.com/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Stephen Francy </p><p class=\"\">(212) 805-3017</p><p class=\"\">sfrancy@rubensteinpr.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Carahsoft’s AI Portfolio</strong>  </p><p class=\"\">Carahsoft’s Artificial Intelligence (AI) Portfolio includes leading and emerging technology vendors that are enabling government agencies and systems integrators to harness the power of AI and ultimately meet mission needs. Supported by dedicated AI product specialists and an extensive ecosystem of resellers, integrators and service providers, we help organizations identify the right technology for unique environments and provide access to technology solutions through our broad portfolio of contract vehicles. Our AI portfolio spans solutions for Data Center &amp; Hardware, Generative AI, Synthetic Data &amp; Labeling, Autonomous Systems &amp; Robotics and more. Learn more about Carahsoft’s AI Solutions for Government here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Carahsoft</strong></p><p class=\"\">Carahsoft Technology Corp. is The Trusted Government IT Solutions Provider, supporting Public Sector organizations across Federal, State and Local Government agencies and Education and Healthcare markets. As the Master Government Aggregator® for our vendor partners, we deliver solutions for Artificial Intelligence, Cybersecurity, MultiCloud, DevSecOps, Customer Experience and Engagement, Open Source and more. Working with resellers, systems integrators and consultants, our sales and marketing teams provide industry leading IT products, services and training through hundreds of contract vehicles. Visit us at www.carahsoft.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Mary Lange</p><p class=\"\">(703) 230-7434</p><p class=\"\">pr@carahsoft.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1bRG4z:0-edgerunner-ai-and-carahsoft-partner-to-bring-air-gapped-generative-ai-to-the-public-sector/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8pThGJ:0",
            "title": "Blueface Featuring The Game’s \"Stop Cappin\" Acquired by Music Licensing, Inc. (OTC: SONG) (OTC: SONGD)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Naples, FL, Feb.  04, 2025  (GLOBE NEWSWIRE) — </strong> Music Licensing, Inc. (OTC: SONG)  is thrilled to announce its acquisition of royalty-generating intellectual property stakes in <strong class=\"root-Tkn6WL2y\">“Stop Cappin”</strong> by Blueface featuring The Game. While the work will continue to be administered by third-party organizations, Music Licensing, Inc. will receive ongoing passive royalty payments from its performance.</p><p class=\"\">Blueface, a platinum-selling rapper known for his unique offbeat style, has become a defining voice in contemporary hip-hop. His collaboration with The Game, a legend in the genre with multiple chart-topping albums, resulted in <strong class=\"root-Tkn6WL2y\">“Stop Cappin”</strong>, a powerful anthem that blends gritty lyricism with unparalleled charisma. The track has amassed millions of streams globally, affirming its cultural impact and commercial success.</p><p class=\"\">This acquisition enhances Music Licensing, Inc.’s growing portfolio of iconic works, cementing its reputation as a leader in acquiring and managing high-value music royalties.</p><p class=\"\">Watch “Stop Cappin” by Blueface featuring The Game here<strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About</strong> <strong class=\"root-Tkn6WL2y\">Music Licensing,</strong> <strong class=\"root-Tkn6WL2y\">Inc.</strong> <strong class=\"root-Tkn6WL2y\">(OTC: SONG) (</strong>ProMusicRights.com)</p><p class=\"\">Music Licensing, Inc. (OTC: SONG), also known as Pro Music Rights, is a diversified holding company and the fifth public performance rights organization (PRO) formed in the United States. Its licensees include notable companies such as TikTok, iHeart Media, Triller, Napster, 7Digital, Vevo, and many others. Pro Music Rights holds an estimated market share of 7.4% in the United States, representing over 2,500,000 works by notable artists such as A$AP Rocky, Wiz Khalifa, Pharrell, Young Jeezy, Juelz Santana, Lil Yachty, MoneyBagg Yo, Larry June, Trae Pound, Sauce Walka, Trae Tha Truth, Sosamann, Soulja Boy, Lex Luger, Trauma Tone, Lud Foe, SlowBucks, Gunplay, OG Maco, Rich The Kid, Fat Trel, Young Scooter, Nipsey Hussle, Famous Dex, Boosie Badazz, Shy Glizzy, 2 Chainz, Migos, Gucci Mane, Young Dolph, Trinidad James, Chingy, Lil Gnar, 3OhBlack, Curren$y, Fall Out Boy, Money Man, Dej Loaf, Lil Uzi Vert, and countless others, as well as artificial intelligence (A.I.) created music.</p><p class=\"\">Additionally, Music Licensing, Inc. (OTC: SONG) owns royalty stakes in Listerine “Mouthwash” Antiseptic and musical works by artists such as The Weeknd, Justin Bieber, Kanye West, Elton John, Mike Posner, blackbear, Lil Nas X, Lil Yachty, DaBaby, Stunna 4 Vegas, Miley Cyrus, Lil Wayne, XXXTentacion, BlueFace, The Game, Jeremih, Ty Dolla $ign, Eric Bellinger, Ne-Yo, MoneyBagg Yo, Halsey, Desiigner, DaniLeigh, Rihanna, and numerous others.</p><p class=\"\">Forward-Looking Statements:</p><p class=\"\">This press release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, which are intended to be covered by the safe harbors created thereby. Investors are cautioned that, all forward-looking statements involve risks and uncertainties, including without limitation, the ability of Music Licensing, Inc. &amp; Pro Music Rights, Inc. to accomplish its stated plan of business. Music Licensing, Inc. &amp; Pro Music Rights, Inc. believes that the assumptions underlying the forward-looking statements contained herein are reasonable, any of the assumptions could be inaccurate, and therefore, there can be no assurance that the forward-looking statements included in this press release will prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by Pro Music Rights, Inc., Music Licensing, Inc., or any other person.</p><p class=\"\">Non-Legal Advice Disclosure:</p><p class=\"\">This press release does not constitute legal advice, and readers are advised to seek legal counsel for any legal matters or questions related to the content herein.</p><p class=\"\">Non-Investment Advice Disclosure:</p><p class=\"\">This communication is intended solely for informational purposes and does not in any way imply or constitute a recommendation or solicitation for the purchase or sale of any securities, commodities, bonds, options, derivatives, or any other investment products. Any decisions related to investments should be made after thorough research and consultation with a qualified financial advisor or professional. We assume no liability for any actions taken or not taken based on the information provided in this communication</p><p class=\"\">Contact: investors@ProMusicRights.com</p><p class=\"\">SOURCE: Music Licensing, Inc.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8pThGJ:0-blueface-featuring-the-game-s-stop-cappin-acquired-by-music-licensing-inc-otc-song-otc-songd/",
            "pub_date": "2025-02-04 22:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6qqRCD:0",
            "title": "Poor delivery experiences threaten restaurant reputations, Chatmeter report finds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SAN DIEGO, Feb.  04, 2025  (GLOBE NEWSWIRE) —  More than one third (36%) of Americans plan to order food delivery for the Big Game on Sunday, Feb. 9, and 37% of them plan to spend more than in 2024, Chatmeter’s 2025 Restaurant Delivery &amp; Reputation report found.  </p><p class=\"\">Chatmeter, a leader in multi-location customer intelligence, used its generative AI platform, Pulse Ai: Signals, to analyze more than two million customer reviews and understand why most consumers are opting for pick up or cooking at home: growing frustration with expensive fees, delayed deliveries, incorrect orders and poor customer service.</p><p class=\"\">“Americans love the convenience of delivery, but restaurants who hand the experience over to third party apps without a strategy risk their reputations,” said John Mazur, CEO of Chatmeter. “Customers still associate the experience with your brand. On such a pivotal weekend for restaurant delivery, promotions, menus, pricing and operations should all be informed by holistic customer intelligence.”</p><p class=\"\">Consumers plan to order delivery because they want to focus on something else besides food preparation (42%), like watching the game or socializing. More than one third (35%) said they plan to take advantage of discounts in delivery apps like DoorDash, GrubHub and Uber Eats.</p><p class=\"\">However, half of consumers (50%) have experienced a late food delivery, and the same amount have received cold food. Additionally, more than two in five surveyed (44%) reported having items missing from their order. Chatmeter’s AI found that the issues were compounded by poor customer service and rude, dismissive staff when people called to check on their order or report quality issues. More than half of delivery-related reviews were negative (46%) or mixed (6%) in sentiment.</p><p class=\"\">Expensive fees were cited by 55% as the top reason they sometimes skip delivery, followed by long estimated wait times (43%), the prospect of food arriving cold (41%), delivery menu prices being more expensive (39%), poor experiences with delivery drivers (22%) and having to tip (20%).</p><p class=\"\">Chatmeter also identified the top items consumers love for delivery–and which items are better eaten right away.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Top delivery menu items</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Pizza</li><li class=\"listItem-bmN0_SHH\">Wings</li><li class=\"listItem-bmN0_SHH\">Sandwiches/subs</li><li class=\"listItem-bmN0_SHH\">Burgers</li><li class=\"listItem-bmN0_SHH\">Tacos</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Worst delivery menu items</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Seafood</li><li class=\"listItem-bmN0_SHH\">Ice cream</li><li class=\"listItem-bmN0_SHH\">Steak</li><li class=\"listItem-bmN0_SHH\">French fries</li></ul><p class=\"\">To learn more and read Chatmeter’s recommendations for restaurants to use customer intelligence to improve delivery experiences, click here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Chatmeter</strong></p><p class=\"\">Chatmeter is the multi-location intelligence company reimagining customer connections and reputation management through AI-powered deep listening. Chatmeter makes it easy for multi-location brands to drive real-time impact through relevant insights in critical moments that matter. Chatmeter understands the challenges of multi-location, and omnichannel reputation management, and has created a scaled platform that enables end-to-end visibility for everyone, from local owners to executive leadership. With a 93% customer retention rate, Chatmeter is the brand reputation partner of choice across the retail, restaurant, healthcare, and financial services industries, and more. For more information, visit www.chatmeter.com/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PR Contact</strong></p><p class=\"\">Anna Rice</p><p class=\"\">PR@Chatmeter.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6qqRCD:0-poor-delivery-experiences-threaten-restaurant-reputations-chatmeter-report-finds/",
            "pub_date": "2025-02-04 22:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308737:0",
            "title": "InPlay Oil Approves 2025 Capital Budget of $41-44 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">InPlay Oil  on Tuesday said its board approved a 2025 capital program between $41 million and $44 million focused on maximizing free adjusted funds flow (FAFF). </p><p class=\"\">The capital program includes forecasted production of 8,650 - 9,150 boe/d representing a 2% increase from 2024 based on the mid-point, 20% FAFF yield and 11% dividend yield and expects total return of 22%. InPlay plans to utilize excess FAFF to reduce debt and is forecasted to exit 2025 with net debt between $52 million and $58 million. </p><p class=\"\">\"InPlay anticipates increased volatility in commodity prices throughout 2025 as the global energy market digests the impact of US tariffs, US sanctions on key oil producing countries and global demand in general,\" the company said in a statement. </p><p class=\"\">The company plans to allocate a \"significant\" portion of its 2025 capital budget to PCU7 and plans to drill about 6.0 net extended reach horizontal (ERH) Cardium wells in PCU7. InPlay also intends to drill an additional 1.0 - 2.0 net Cardium ERH wells in Pembina and Willesden Green, which the company believes will benefit from cost savings leveraging the drilling and completions operational enhancements achieved in PCU7. </p><p class=\"\">In the first quarter of 2025, the company plans to drill three (3.0 net) ERH Cardium wells in PCU7. Drilling operations began in January and production is expected to be on-line by March, with majority of its remaining 2025 capital program taking place in the second half of the year. </p><p class=\"\">Shares of the company closed down $0.080, or 4.7%, to $1.61 on Monday on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308737:0/",
            "pub_date": "2025-02-04 22:00:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACScqbW5a:0",
            "title": "NexTech3D AI Reports Preliminary Unaudited 2024 Revenue of $3.1mill with Gross Profit of $1.9 mill +62% Sees Positive Outlook for 2025 With a 80%+ Profit Margins and AI Sales Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Company Sees Strong Sales Growth in 2025 starting in January</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">TORONTO, ON / ACCESS Newswire / February 4, 2025 /</strong> Nextech3D.AI (OTCQX:NEXCF)(FSE:1SS), established in 2018, has been a pioneer in augmented reality (AR) and artificial intelligence (AI) technologies, and a leader in advanced 3D AI-driven solutions reports preliminary unaudited results for 2024:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Reports Preliminary Unaudited 2024:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue of $3.1mill</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">with Gross Profit of $1.9 mill +62%</strong></p><p class=\"\">Sees Positive Outlook for 2025 With a 80%+ Profit Margin</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Comparison of 2024 to 2023:</strong> In 2024, Nextech3D AI achieved a strong increase in its gross profit margin, reaching <strong class=\"root-Tkn6WL2y\">65%</strong> compared to <strong class=\"root-Tkn6WL2y\">29%</strong> in 2023. This was driven by the implementation of AI technologies and having 3D operations in India. Furthermore, the Company reduced its overall operational costs by <strong class=\"root-Tkn6WL2y\">35%</strong> in 2024, positioning it for even greater savings and operational efficiency in 2025. The improved gross margin and cost reduction reflect the company's commitment to innovation and its ongoing efforts to streamline operations.</p><p class=\"\">\"We are encouraged with our early success in sales in 2025 and the solid progress we made in cost cutting and improving margins in 2024,\" said Evan Gappelberg, CEOI. \"With a strong sales performance in January, cost reduction initiatives on track, and continued advancements in AI, we are confident that we will meet our 2025 goals of achieving an 80% gross profit margin and expanding our market share.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025 Outlook and Performance Projections:</strong> Looking ahead to 2025, NexTech3D AI is tracking a projected gross profit margin of <strong class=\"root-Tkn6WL2y\">80%+</strong> by the end of the year. This is a continuation of the Company's commitment to enhancing operational efficiency through AI, cloud optimization, and automated processes. The Company is also laser focused on driving sales growth through strategic hires, including new Business Development Representatives (BDRs), and further expansion of its product offerings, including the continued growth of its MapD platform. Additionally, using AI tools the company anticipates reducing its overall operational costs by <strong class=\"root-Tkn6WL2y\">more than 50%</strong> in 2025, leveraging AI and optimizing cloud infrastructure to drive sustained profitability.</p><p class=\"\">Nextech3D.AI continues to lead in the development and deployment of AI-powered 3D solutions that drive value for its customers and shareholders, with a focus on technological innovation and operational excellence.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About NexTech3D AI:</strong> NexTech3D AI is a leader in the development and deployment of AI-powered 3D solutions for various industries, offering a suite of cutting-edge products that enhance customer engagement and streamline operations. With a focus on technological innovation, the Company is transforming the future of 3D and AI integration for businesses worldwide.</p><p class=\"\">The Company has renewed its previously established share purchase warrant program pursuant to which it will issue an aggregate of 7,781,185 share purchase warrants (the \"Warrants\") to its service providers in connection with their employment and/or consulting arrangements with the Company. Each Warrant will be exercisable to acquire one common share of the Company (an \"Underlying Share\") at an exercise price of Cdn$0.08 for a period of one year. The Warrants will be automatically exercised in equal monthly tranches on a pro rata basis over the term of the Warrants, and the exercise price will be satisfied by the monthly salaries otherwise payable by the Company to the recipients of the Warrants. Upon exercise, the recipients of the Warrants may opt to either receive the Underlying Shares, or participate in a managed sale program to sell the Underlying Shares on the open market and receive the cash proceeds. Any shortfall as a result of participation in such a managed sale program will be funded by the Company.</p><p class=\"\">For more information, visit Nextech3D.ai.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sign up for Investor News and Info -</strong> <strong class=\"root-Tkn6WL2y\">Click Here</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information and full report go to</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">https://www.sedarplus.ca</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nextech3D.ai</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Evan Gappelberg /CEO and Director</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">866-ARITIZE (274-8493)</strong></p><p class=\"\">About Nextech3D.ai Nextech3D.ai or the \"Company,\" (OTCQX:NEXCF)(FSE:1SS), is a versatile augmented reality and AI technology company that utilizes its proprietary artificial intelligence (AI) to craft immersive 3D experiences at scale for manufacturers with CAD files and for E-COMMERCE merchants. The Company's primary focus lies in creating high-quality 3D WebAR photorealistic models for Amazon and various other online retailers with patented 2D-3D technology.</p><p class=\"\">Forward-looking Statements The CSE has not reviewed and does not accept responsibility for the adequacy or accuracy of this release. Certain information contained herein may constitute \"forward-looking information\" under Canadian securities legislation. Generally, forward-looking information can be identified by the use of forward-looking terminology such as, \"will be\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements regarding the completion of the transaction are subject to known and unknown risks, uncertainties and other factors. There can be no assurance that such statements will prove to be accurate, as future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Nextech will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Nextech3D.ai</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACScqbW5a:0/",
            "pub_date": "2025-02-04 21:51:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006667:0",
            "title": "Ferrari Expects Higher Revenue and Earnings This Year — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dominic Chopping</p><p class=\"\">Ferrari expects revenue and earnings to rise this year after it reported a strong end to 2024 thanks to growing demand for customized vehicles as well as its strong line-up of luxury sports models.</p><p class=\"\">The Italian sports-car maker reported revenue of 1.74 billion euros ($1.8 billion) in the fourth quarter, up 14% on year as it shipped 3,325 vehicles to customers--80 more than a year earlier. Analysts polled by FactSet had forecast 1.65 billion euros in revenue, while shipments were seen at 3,333 units, according to LSEG Refinitiv data.</p><p class=\"\">Chief Executive Benedetto Vigna said 2024 was marked by a focus on the quality of revenue rather than volumes, as the company reported a sharp rise in profitability thanks to sales of higher-margin cars in higher-margin countries.</p><p class=\"\">\"On these solid foundations, we expect further robust growth in 2025, that will allow us to reach one year in advance the high-end of most of our profitability targets for 2026\" he said in a statement.</p><p class=\"\">Ferrari shares in Milan traded 3.8% higher in afternoon European trade.</p><p class=\"\">Fourth-quarter shipments rose by 4% in Europe, the Middle East and Africa and by 8% in the Americas, Ferrari's two largest regional markets. Mainland China, Hong Kong and Taiwan logged a 21% contraction in shipments, while the rest of Asia-Pacific recorded 5% growth.</p><p class=\"\">European auto makers have faced a torrid time of late as they grapple with intense competition in China, where local manufacturers have been launching new models at aggressive price points while economic challenges have seen consumers pare back on high-end spending. But Ferrari has been sheltered from the turmoil thanks to its limited exposure to China and its ability to maintain margins as it sells to more exclusive customers than ordinary manufacturers.</p><p class=\"\">In China, sports cars are a smaller part of the luxury market than other regions. Ferrari wants to keep sales in the country below 10% of its overall deliveries as it is a lower-margin region due to high taxes.</p><p class=\"\">Mainland China, Hong Kong and Taiwan accounted for only around 8% of the company's global car shipments in 2024.</p><p class=\"\">Analysts also expect Ferrari to weather any trade charges levied on European imports into the U.S., should President Trump follow through with threats to hit the EU with tariffs.</p><p class=\"\">Ferraris are exclusively produced in Italy, so all of its cars for the U.S. market are imports, but analysts at Bernstein say the company is protected by its strong pricing power.</p><p class=\"\">Net profit in the quarter grew to 386 million euros from 294 million euros, ahead of the 335 million euros analysts had forecast.</p><p class=\"\">Earnings before interest, taxes, depreciation, and amortization rose to 643 million euros from 558 million euros, generating a 37.0% margin. Meanwhile, earnings before interest and taxes increased to 468 million euros from 372 million euros, generating a 27.0% margin.</p><p class=\"\">Analysts had forecast Ebitda of 631 million euros and EBIT of 442 million euros.</p><p class=\"\">Ferrari set its full-year 2025 revenue target at more than 7 billion euros, after achieving 2024 revenue of 6.68 billion euros.</p><p class=\"\">The company is targeting 2025 adjusted Ebitda of at least 2.68 billion euros, from 2.56 billion euros in 2024, with a margin of at least 38.3%. Its 2025 EBIT target is for at least 2.03 billion euros, from 1.89 billion euros, with a margin of at least 29.0%.</p><p class=\"\">If successful, most metrics would land above the 2026 targets it laid out more than two years ago.</p><p class=\"\">Write to Dominic Chopping at dominic.chopping@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006667:0-ferrari-expects-higher-revenue-and-earnings-this-year-update/",
            "pub_date": "2025-02-04 21:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV17U:0",
            "title": "Wall St set for subdued open after China's retaliatory tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">PepsiCo down after forecasting annual profit below estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Merck falls on dour 2025 forecast</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Futures: Dow down 0.13%, S&amp;P 500 up 0.07%, Nasdaq up 0.22%</li></ul></span></div><span><p class=\"\">        Wall Street was on track to a cautious opening on Tuesday as investor appetite for risk waned after China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs.  </p><p class=\"\">Minutes after U.S. President Donald Trump's 10% tariff on Chinese goods kicked in at 12:01 a.m. ET (0501 GMT), China's finance ministry announced levies on some U.S. imports, effective Feb. 10.</p><p class=\"\">Beijing's limited reply to Trump's imposition underscored its attempts to engage the U.S. president in talks and avert an outright trade war between the world's two largest economies.</p><p class=\"\">\"The tariff gun is clearly loaded... we don't know if it eventually is going to fire, (but) we now have some time in between the announcement and the implementation,\" said Art Hogan, chief market strategist at B. Riley Wealth. </p><p class=\"\">    \"Markets are going to take the pause and try to price in the uncertainty.\"  </p><p class=\"\">Biotechnology firm Illumina  and PVH Corp , the holding company for brands including Calvin Klein, dropped more than 4% each in premarket trading after China placed the firms in its \"unreliable entity list\". </p><p class=\"\">Trump had also imposed a 25% tariff on goods from Mexico and Canada over the weekend, but agreed to a 30-day pause in the levies on Monday, in return for border and crime concessions from both countries.</p><p class=\"\">The last-minute change helped the three major U.S. stock indexes pare some of the heavy losses suffered earlier on Monday and closed trading well off session lows.</p><p class=\"\">The S&amp;P 500  came as close as eight points to all-time highs on Friday before selling off, as the tariffs rattled global markets.</p><p class=\"\">Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise.</p><p class=\"\">Traders are pricing in no interest-rate action from the U.S. Federal Reserve before June, with bets on a cut in June at 62%, according to CME's FedWatch.</p><p class=\"\">Comments from three Fed leaders including Atlanta's Raphael Bostic are expected through the day.</p><p class=\"\">In economic data, a December job openings reading is due at 10:00 a.m. ET on Tuesday, with the all-important January nonfarm payrolls report expected on Friday.</p><p class=\"\">At 08:30 a.m. ET, Dow E-minis  were down 58 points, or 0.13%, S&amp;P 500 E-minis  were up 4.5 points, or 0.07%, and Nasdaq 100 E-minis  were up 46.25 points, or 0.22%.</p><p class=\"\">    In earnings-driven moves, PepsiCo  fell 2.2% after it forecast annual profit below expectations and missed quarterly revenue estimates.</p><p class=\"\">Merck  dropped 7.9% after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenue.</p><p class=\"\">Palantir  jumped 24% after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates. </p><p class=\"\">Pfizer  rose 1.3% after it beat estimates for fourth-quarter profit, helped by strong sales of its heart-disease drug and a smaller-than-feared drop in COVID-19 vaccine sales.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV17U:0-wall-st-set-for-subdued-open-after-china-s-retaliatory-tariffs/",
            "pub_date": "2025-02-04 21:52:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006678:0",
            "title": "ADM Says It's Uncertain About 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006678:0/",
            "pub_date": "2025-02-04 21:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308845:0",
            "title": "Pulse Biosciences Names Jon Skinner CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pulse Biosciences  said Tuesday it named Jon Skinner its chief financial officer, effective Feb. 3. </p><p class=\"\">Skinner was previously the vice president of financial planning and analysis and investor relations at private equity firm Copeland, the company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308845:0/",
            "pub_date": "2025-02-04 21:53:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006697:0",
            "title": "Palantir Technologies Is Maintained at Neutral by Cantor Fitzgerald",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:54 GMT) </strong>Palantir Technologies Price Target Raised to $98.00/Share From $72.00 by Cantor Fitzgerald</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006697:0/",
            "pub_date": "2025-02-04 21:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446564:0",
            "title": "Coal Retreats Toward 4-Year Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Newcastle coal futures fell to below $116 per tonne, not far from the four-year low of $114 touched on January 10th, amid lingering concerns of oversupply.</p><p class=\"\">The Chinese Coal Transportation and Distribution Association announced that output is set to expand 1.5% to 4.82 billion tons in 2025 following a record-setting 2024.</p><p class=\"\">The agency cited expanded mining capacity to avoid availability risks from carbon emission limits and mine shutdowns from safety protocol breaches.</p><p class=\"\">The development occurred as utilities already deal with record-high coal inventories, which rose by 12% in the two months ending October.</p><p class=\"\">In the meantime, China threatened to impose tariffs on US coal next week should the US maintain its blanket restrictions on China.</p><p class=\"\">However, the impact on thermal coal is minimal, as US imports made up 0.8% of China’s foreign thermal coal purchases in 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446564:0-coal-retreats-toward-4-year-low/",
            "pub_date": "2025-02-04 21:54:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5wbFYH:0",
            "title": "AgEagle Aerial Systems Participated in the French Army’s 61st Artillery Regiment Event FID25-61e RA Chaumont ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Key drone innovation forum for the French Army features eBee VISION flight demonstration</p><p class=\"\">WICHITA, Kan., Feb.  04, 2025  (GLOBE NEWSWIRE) — AgEagle Aerial Systems Inc. (NYSE: UAVS) a leading provider of best-in-class unmanned aerial systems (UAS), sensors and software solutions for customers worldwide in the commercial and government verticals, announces it recently completed a successful flight demonstration of its eBee VISION Intelligence Surveillance and Reconnaissance (ISR) UAS platform at the French Army’s 61st Artillery Regiment’s event, FID25-61e RA Chaumont. The drone innovation forum was conducted January 30-31, 2025 and attended by the Company in conjunction with its French reseller partner Flying Eye.</p><p class=\"\">AgEagle CEO Bill Irby commented, “We continue to strengthen and broaden our relationship with the French Army through our partner Flying Eye, who completed training in January to become certified eBee VISION operators. This strategic union is expected to build upon the success of our largest single order in AgEagle’s history, valued at $3.4M, completed with the French Army in Q4 2024. We look forward to leveraging this momentum as we continue to expand the global footprint of our UAS products within both government and commercial verticals.”</p><p class=\"\">The eBee VISION is a state-of-the-art ISR UAS, designed to provide tactical flexibility, durability, and efficiency. Its unique features and performance metrics will be evaluated during a series of rigorous field exercises, providing valuable insights into its applicability in diverse operational scenarios.</p><p class=\"\">The 61st artillery regiment (61e RA) of Chaumont is the original image intelligence regiment of the French Army. To fulfill its mission, it implements drones (pilotless aircraft) and is equipped with means of receiving satellite images. With a history spanning more than a century, the 61st Artillery Regiment has distinguished itself over the decades by demonstrating its tactical know-how, which has earned it numerous military distinctions. Both through its historical weapon, artillery, and later in the field of intelligence and the implementation of drones, the Black Devils have served their country with the courage and determination that honors their elders. This precious heritage gives the 61st Artillery Regiment an extraordinary singularity, which continues to flourish today.</p><p class=\"\">Simon Leroy Co-CEO of Flying Eye commented, “We are proud to represent AgEagle on the French market. The eBee VISION fills a gap that was unaddressed so far by UAS manufacturers and answers the needs of both our public and private customer base. Its unique performance and its advanced features make the VISION stand out in its category. 2024 has seen Flying Eye completing the largest sales of eBee VISION ever, we expect 2025 to be even more successful.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About AgEagle Aerial Systems Inc.</strong></p><p class=\"\">Through its three centers of excellence, AgEagle is actively engaged in designing and delivering best-in-class flight hardware, sensors and software that solve important problems for its customers. Founded in 2010, AgEagle was originally formed to pioneer proprietary, professional-grade, fixed-winged drones and aerial imagery-based data collection and analytics solutions for the agriculture industry. Today, AgEagle is a leading provider of full stack UAS, sensors and software solutions for customers worldwide in the energy, construction, agriculture, and government verticals. For additional information, please visit our website at www.ageagle.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong> </p><p class=\"\">Certain statements in this press release may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical fact, contained in this press release are forward-looking statements. Forward-looking statements contained in this press release may be identified by the use of words such as “anticipate,” “believe,” “contemplate,” “could,” “estimate,” “expect,” “intend,” “seek,” “may,” “might,” “plan,” “potential,” “predict,” “project,” “suggest,” “target,” “aim,” “should,” \"will,” “would,” or the negative of these words or other similar expressions, although not all forward-looking statements contain these words. Forward-looking statements are based on AgEagle’s current expectations and are subject to inherent uncertainties, risks and assumptions that are difficult to predict, including risks related to the timing and fulfilment of current and future purchase orders relating to AgEagle’s products, the success of new programs, the ability to implement a new strategic plan and the success of a new strategic plan. Further, certain forward-looking statements are based on assumptions as to future events that may not prove to be accurate. For a further discussion of risks and uncertainties that could cause actual results to differ from those expressed in these forward-looking statements, as well as risks relating to the business of AgEagle in general, see the risk disclosures in the Annual Report on Form 10-K of AgEagle for the year ended December 31, 2023, and in subsequent reports on Forms 10-Q and 8-K and other filings made with the SEC by AgEagle. All such forward-looking statements speak only as of the date they are made, and AgEagle undertakes no obligation to update or revise these statements, whether as a result of new information, future events or otherwise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AgEagle Aerial Systems Contacts</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations:</strong></p><p class=\"\">Email<strong class=\"root-Tkn6WL2y\">: </strong><strong class=\"root-Tkn6WL2y\">UAVS@ageagle.com</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Email: media@ageagle.com</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5wbFYH:0-ageagle-aerial-systems-participated-in-the-french-army-s-61st-artillery-regiment-event-fid25-61e-ra-chaumont/",
            "pub_date": "2025-02-04 21:54:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308787:0",
            "title": "Realbotix Adds Third Party AI Integration to Humanoid Robots",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Realbotix  on Tuesday said this month it is introducing large language model (LLM) integration and advanced customization features in its Realbotix robots. </p><p class=\"\">Realbotix robots will now support integration with both local AI applications and cloud-based AI providers, including OpenAI's ChatGPT, Meta's Llama, Google's Gemini and DeepSeek R1. Third party integrations will also be supported by Realbotix's lip sync technology to enhance the accuracy of robotic speech synchronization.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308787:0/",
            "pub_date": "2025-02-04 21:54:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1AC:0",
            "title": "Baltic index extends gain as panamax, supramax rates firm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Baltic Exchange's dry bulk sea freight index, which measures shipping rates for vessels transporting dry bulk commodities, rose for the third consecutive session on Tuesday, supported by gains in panamax and supramax vessel segments.</p><p class=\"\">* The index , which factors in rates for capesize, panamax and supramax shipping vessels, rose by 15 points to 753 points.</p><p class=\"\">* The panamax index (.BPNI) gained 71 points to 901 points. </p><p class=\"\">* Average daily earnings for panamax vessels (.BPWT), which usually carry 60,000-70,000 tons of coal or grain cargo, increased by $643 to $8,112.</p><p class=\"\">* The capesize index (.BACI) was down 17 points to 844 points.</p><p class=\"\">* Average daily earnings for capesize vessels (.BATCA), which typically transport 150,000-ton cargoes such as iron ore and coal, decreased by $146 to $6,998.</p><p class=\"\">* Among smaller vessels, the supramax index (.BSIS) was up 3 points at 605 points, snapping its over two-month loosing streak.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1AC:0-baltic-index-extends-gain-as-panamax-supramax-rates-firm/",
            "pub_date": "2025-02-04 21:54:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002254:0",
            "title": "Croatia Issues 2 Bln Euros in 12-Year Bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emese Bartha</p><p class=\"\">Croatia issued 2 billion euros ($2.07 billion) in February 2037-dated bonds via a bank syndicate on Tuesday, drawing demand in excess of 5 billion euros, one of the joint lead manager banks said.</p><p class=\"\">The books include 175 million euros of joint lead manager demand.</p><p class=\"\">The spread on the bond was set 90 basis points above mid-swaps, the same bank said.</p><p class=\"\">Joint lead managers of the transaction were Erste Group; IMI-Intesa Sanpaolo/PBZ; ING; J.P. Morgan and Morgan Stanley.</p><p class=\"\">Write to Emese Bartha at emese.bartha@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002254:0/",
            "pub_date": "2025-02-04 21:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN64Lqcv:0",
            "title": "Carnegie Access: Irisity: Share issue in focus during Q4(24e) – Q4 preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new commissioned research report on Irisity.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/irisity</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN64Lqcv:0-carnegie-access-irisity-share-issue-in-focus-during-q4-24e-q4-preview/",
            "pub_date": "2025-02-04 21:55:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308849:0",
            "title": "Redbook US Same-Store Sales Accelerate in Week Ended Feb. 1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Redbook US same-store sales rose by 5.7% from a year earlier in the week ended Feb. 1 after a 4.9% year-over-year increase in the previous week. </p><p class=\"\">Redbook noted an increase in sales of food and Super Bowl-related goods. Retailers and vendors are collaborating to adjust prices and diversify their supply chains as a precaution for proposed tariffs on imported goods. Footwear and discount stores are at risk as they rely heavily on Chinese imports. </p><p class=\"\">Through the fourth selling week for January, sales were up 4.8% compared with January 2024, slightly below the target for a 4.9% gain, Redbook said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308849:0/",
            "pub_date": "2025-02-04 21:55:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308839:0",
            "title": "Zoetis Updates Label on Drug for Treatment of Canine Osteoarthritis",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zoetis  said Tuesday that it has updated the US label for Librela following its submission of a supplement to the US Food and Drug Administration based on post-approval experiences with the veterinary drug. </p><p class=\"\">The company said it remains confident in the safety and effectiveness of the treatment for the pain associated with osteoarthritis in dogs. </p><p class=\"\">The company said that out of 25 million doses, no adverse event has been reported at a rate higher than rare, representing less than 10 occurrences per 10,000 treated dogs. </p><p class=\"\">Shares of the company were down more than 1% in Tuesday's premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308839:0/",
            "pub_date": "2025-02-04 21:47:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006592:0",
            "title": "Estée Lauder Stock Is Tumbling. Blame a Huge Charge and Disappointing Outlook. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Karishma Vanjani</p><p class=\"\">Luxury beauty brand Estée Lauder offered weak earnings guidance, and will take more than $1 billion in pretax charges, and cut thousands of jobs. Shares are tumbling.</p><p class=\"\">Early Tuesday, Estée Lauder posted adjusted earnings per share of 62 cents for the second fiscal quarter ended Dec. 31, well above the consensus estimate of 32 cents, according to FactSet. Sales of $4 billion topped the $3.98 billion estimate.</p><p class=\"\">But Estée Lauder sees earnings per share of 24 cents to 34 cents for the third fiscal quarter ending March 31, far short of the consensus projection for 63 cents.</p><p class=\"\">Estée Lauder stock is down 7.3% to $76.71 in Tuesday premarket trading.</p><p class=\"\">In order to streamline, the company expects to take restructuring and other charges of $1.2 billion to $1.6 billion, before taxes, \"consisting of employee-related costs, contract terminations, asset write-offs, and other costs associated with implementing these initiatives.\"</p><p class=\"\">Estée Lauder estimates a net reduction in positions of 5,800 to 7,000, including approvals to date. The net reduction includes the elimination of positions after retraining, and \"redeployment of certain employees in select areas.\"</p><p class=\"\">The company's bet on Asia isn't paying off. Travel retail business in Korea was weak in the latest quarter, while overall sales trends in China continue to be poor. Sales have declined year-over-year for two straight quarters now.</p><p class=\"\">\"For the third quarter, we expect overall soft retail trends to persist in Asia travel retail, significantly pressuring our organic net sales despite the improvement we made with in-trade inventory levels in the first half of fiscal 2025, which we intend to maintain around current levels,\" CEO Stéphane de La Faverie said in the earnings release.</p><p class=\"\">Write to Karishma Vanjani at  karishma.vanjani@dowjones.com.</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006592:0/",
            "pub_date": "2025-02-04 21:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308833:0",
            "title": "VICI Properties Launches $2.5 Billion Unsecured Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VICI Properties  said Tuesday it has established a new $2.5 billion unsecured revolving credit facility. </p><p class=\"\">The company said the revolving credit facility matures Feb. 3, 2029 and can be extended for either two successive six-month terms or one 12-month term. </p><p class=\"\">VICI said it also said it has the option to increase the facility by up to $1 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308833:0/",
            "pub_date": "2025-02-04 21:48:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308788:0",
            "title": "PepsiCo Reports Mixed Fourth-Quarter Results Amid North America Weakness",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo's  fourth-quarter earnings came in ahead of Wall Street's estimates, while revenue posted a surprise decline amid weakness in the beverage and snacks company's North American businesses. </p><p class=\"\">Adjusted earnings came in at $1.96 a share for the three months through Dec. 28, up from $1.78 the year before and ahead of the FactSet-polled consensus of $1.94. Revenue edged down 0.2% year over year to $27.78 billion, compared with the Street's view for an increase to $27.89 billion. The stock was down 2.3% in premarket activity. </p><p class=\"\">Overall net pricing had a positive impact of 3% on the topline, while consolidated organic volume slipped 1%. Volume increased by 1% each in the company's beverage and convenient food businesses. </p><p class=\"\">\"Our businesses remained resilient in 2024, despite subdued category performance trends in North America, the continued impacts related to a recall in our Quaker Foods North America division and business disruptions due to geopolitical tensions in certain international markets,\" Chief Executive Ramon Laguarta said in a statement. \"Our enhanced multiyear productivity initiatives enabled us to invest in our businesses, and deliver improvements in our gross margin, operating margin expansion and EPS in 2024.\"</p><p class=\"\">In North America, PepsiCo's Frito-Lay snack business saw revenue decrease to $7.32 billion from $7.47 billion in the prior-year quarter. Quaker Foods' reported revenue fell to $874 million from $893 million. On an organic basis, revenue in both segments declined 2%. Sales in the beverages unit remained nearly flat at $7.91 billion. </p><p class=\"\">\"Looking ahead to 2025, we will continue to build upon the successful expansion of our international business, while also taking actions to improve performance in North America,\" according to Laguarta. \"Our multiyear productivity initiatives will help fund disciplined commercial investments and aid our profitability.\"</p><p class=\"\">For fiscal 2025, the company expects low-single-digit growth in both core EPS and organic revenue. The Street is looking for non-GAAP EPS of $8.52 and sales of $93.77 billion. In the previous fiscal year, adjusted EPS climbed to $8.16 from $7.62, while organic revenue moved 2% higher. </p><p class=\"\">\"We expect our North America performance to gradually improve as the year progresses, and our commercial activities take hold,\" Laguarta and Chief Financial Officer Jamie Caulfield said in prepared remarks published on the company's website. \"We expect our International business to remain resilient, although geopolitical tensions and macroeconomic volatility may persist in certain markets.\"</p><p class=\"\">PepsiCo forecasts a foreign-exchange translation headwind of about three percentage points on reported revenue and adjusted EPS based on current rates.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308788:0/",
            "pub_date": "2025-02-04 21:48:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}