{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2GB:0",
            "title": "Anthropic Statement On The Comments From Secretary Of War Pete Hegseth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC: STATEMENT ON THE COMMENTS FROM SECRETARY OF WAR PETE HEGSETH</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC: HAVE TRIED IN GOOD FAITH TO REACH AN AGREEMENT WITH THE DEPARTMENT OF WAR</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC: TO THE BEST OF OUR KNOWLEDGE, THESE EXCEPTIONS HAVE NOT AFFECTED A SINGLE GOVERNMENT MISSION TO DATE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC : WE HAVE TRIED IN GOOD FAITH TO REACH AN AGREEMENT WITH THE DEPARTMENT OF WAR</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC: FIRST, WE DO NOT BELIEVE THAT TODAY’S FRONTIER AI MODELS ARE RELIABLE ENOUGH TO BE USED IN FULLY AUTONOMOUS WEAPONS.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC: BELIEVE DESIGNATION WOULD BOTH BE LEGALLY UNSOUND, SET DANGEROUS PRECEDENT FOR ANY AMERICAN COMPANY THAT NEGOTIATES WITH THE GOVERNMENT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC:  HAVE NOT YET RECEIVED DIRECT COMMUNICATION FROM THE DEPARTMENT OF WAR OR THE WHITE HOUSE ON THE STATUS OF OUR NEGOTIATIONS.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC:  WILL CHALLENGE ANY SUPPLY CHAIN RISK DESIGNATION IN COURT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ANTHROPIC:  \"NO AMOUNT OF INTIMIDATION OR PUNISHMENT FROM THE DEPARTMENT OF WAR WILL CHANGE OUR POSITION ON MASS DOMESTIC SURVEILLANCE OR FULLY AUTONOMOUS WEAPONS\"</span></p></li></ul><p class=\"\"><span>Source: https://tinyurl.com/439y6s45</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2GB:0-anthropic-statement-on-the-comments-from-secretary-of-war-pete-hegseth/",
            "pub_date": "2026-02-28 09:22:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:e338d2a74094b:0",
            "title": "Damon Announces Board Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Damon Inc. (OTC Pink: DMNIF) (\"Damon\" or the \"Company\"), a designer and developer of electric motorcycles and other personal mobility products that seek to empower the personal mobility sector through innovation, today that the Board of Directors including the Chief Executive Officer and Chief Financial Officer has resigned. </span></p><p class=\"\"><em><span>For more information about Damon's vision for a connected mobility future and to learn about the investment opportunity, please visit </span></em><em><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/5WeVMiWeX4\" rel=\"nofollow\" target=\"_blank\">https://invest.damon.com/</a></em><em><span>.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Damon</span></strong></p><p class=\"\"><span>Damon Inc. is a designer and developer of personal mobility products and technology solutions that integrate AI-enabled safety systems, smart electrification, and user-driven design to revolutionize sustainable transportation. Operating across four potential revenue verticals - Data Intelligence &amp; Services, Engineering Services, Personal Mobility Products, and Special Projects - Damon believes it is positioned to capture a significant share of the $200B global two-wheeler market by 20321. The company distinguishes itself through its integrated ecosystem approach, combining advanced data analytics and engineering expertise, while seeking to enter into strategic partnerships with OEMs and Tier 1 suppliers. Damon emphasizes accessible mobility solutions while leveraging its proprietary AI-enabled safety systems and intelligent energy management technology to deliver superior performance and operational efficiency in the urban and business mobility space. For more information, please visit </span><strong class=\"root-Tkn6WL2y\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/OARrxh2DjP\" rel=\"nofollow\" target=\"_blank\">damon.com</a></strong><span>.</span></p><p class=\"\"><span>1 Source Fortune Business Insights (2025)</span></p><p class=\"\"><span>Contact: </span></p><p class=\"\"><span>236-326-3619</span></p><p class=\"\"><span>Info@damon.com</span></p><p class=\"\"><span>FORWARD-LOOKING STATEMENTS</span></p><p class=\"\"><span>This press release, including any materials referenced herein, contains forward-looking information or forward-looking statements under applicable Canadian and U.S. securities laws (collectively, \"forward-looking statements\") that reflect current expectations and projections of Damon Inc. (\"Damon\") about its future development. When used in this press release, forward-looking statements can be identified by the use of words such as \"may,\" or by such words as \"will,\" \"intend,\" \"believe,\" \"estimate,\" \"consider,\" \"expect,\" \"anticipate,\" and \"objective\" and similar expressions or variations of such words. Forward-looking statements in this press release include, but are not limited to, statements relating to the Company's strategic plans and expected benefits of the divestiture of Grafiti Limited. Forward-looking statements are, by their nature, not guarantees of Damon's future operational or financial performance and are subject to risks and uncertainties and other factors that could cause Damon's actual results, performance, prospects, or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements. No representation or warranty is intended with respect to anticipated future results, or that estimates, or projections will be sustained.</span></p><p class=\"\"><span>In developing the forward-looking statements in this press release, we have applied several material assumptions, including the general business and economic conditions of the industries and countries in which Damon operates, and general market conditions. Many risks, uncertainties, and other factors could cause the actual results of Damon to differ materially from the results, performance, achievements, or developments expressed or implied by such forward-looking statements. Factors that could cause actual results to differ from those discussed in the forward-looking statements include, but are not limited to, our history of losses, our ability to implement our growth strategy, generate revenue and achieve profitability, our ability to obtain adequate financing as needed, our ability to continue as a going concern, our status as a foreign private issuer, impact of our prior delisting from Nasdaq, our ability to establish and sustain an active trading market on an over-the-counter market maintained by OTC Markets Group Inc., customer demand for or acceptance of our products and services, our ability to enter into strategic partnerships with OEMs and Tier 1 suppliers, the impact of competitive or alternative products, technologies, and pricing, emerging competition and rapidly advancing technology that may outpace our own, our ability to develop, manufacture or distribute products and services and secure strategic supply, manufacturing, licensing and distribution arrangements, our ability to protect our intellectual property, our ability to protect user data and user information, impact of any changes in existing or future regulatory and tax regimes applying to our business, our ability to successfully consummate strategic transactions and integrate companies or technologies we acquire, our ability to attract and retain management and employees with specialized knowledge and technical skills, our ability to develop and maintain effective internal controls, general economic conditions and events and the impact they may have on us and our customers, including but not limited to escalating tariff and non-tariff trade measures imposed by the United States and other countries, increases in inflation rates and rates of interest, supply chain challenges, increased costs for materials and labor, cybersecurity threats, and conflicts such as those in Russia/Ukraine, Israel/Hamas and Iran, our success at managing the risks involved in the foregoing items, and other risk factors discussed in our periodic and current reports and registration statements filed with the U.S. Securities and Exchange Commission and the British Columbia Securities Commission.</span></p><p class=\"\"><span>Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of the press release or as of the date otherwise specifically indicated herein. Due to risks and uncertainties, events may differ materially from current expectations. Damon disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required pursuant to applicable securities law. All forward-looking statements contained in the press release are expressly qualified in their entirety by this cautionary statement.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:e338d2a74094b:0-damon-announces-board-update/",
            "pub_date": "2026-02-28 09:30:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:bb68993ae094b:0",
            "title": "EQV Ventures Acquisition Corp. Shareholders Approve Business Combination with Presidio",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><em><span>Transaction expected to close on or about March 4, 2026</span></em></p><p class=\"\"><span>Fort Worth, TX, Feb. 27, 2026 (GLOBE NEWSWIRE) -- EQV Ventures Acquisition Corp. </span><span> (“EQV”), a special purpose acquisition company sponsored by EQV Group, is pleased to announce that in an extraordinary general meeting held today, EQV shareholders voted to approve the previously announced business combination with Presidio Investment Holdings LLC (“Presidio” or the “Company”), a differentiated oil and gas operator focused on the acquisition and optimization of mature, producing oil and natural gas assets in the United States. A Form 8-K disclosing the full voting results will be filed with the Securities and Exchange Commission.</span></p><p class=\"\"><span>The closing of the business combination is expected to occur on or about March 4, 2026, subject to the satisfaction or waiver of all closing conditions, with shares of the combined entity expected to trade on NYSE under the symbol “FTW” on March 5, 2026.</span></p><p class=\"\"><span>Shortly following the closing of the Transaction and upon approval of the combined company Board of Directors, Presidio expects to provide formal dividend timing details aligned with its previously announced dividend framework and broader shareholder return strategy, which highlights Presidio’s differentiation as an E&amp;P company with a capital-light platform with minimal reinvestment requirements, enabling a greater portion of cash flow to be returned directly to shareholders. The strategy is underpinned by accretive acquisitions, supported by a favorable M&amp;A environment for purchasing non-core assets at attractive returns.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Presidio</span></strong></p><p class=\"\"><span>Headquartered in Fort Worth, TX, Presidio is a leading operator of mature oil and gas wells across the Mid-Continent. The Company is focused exclusively on optimizing existing production and generating sustainable cash flow from low-decline, producing assets.</span></p><p class=\"\"><span>Dividends are not guaranteed and may be adjusted, suspended, or discontinued at the discretion of the Board of Directors based on liquidity, legal surplus, business conditions, commodity price volatility, market conditions and other factors.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About EQV Ventures Acquisition Corp.</span></strong></p><p class=\"\"><span>EQV is a blank check company incorporated as a Cayman Islands exempted company for the purpose of effecting a merger, amalgamation, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities. EQV’s sponsor is an affiliate of EQV Group, which was formed in 2022 and is an active acquirer and operator of proved developed producing oil and gas properties, and currently owns and operates more than 3,500 wells across 10 states.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This press release includes “forward-looking statements.” These include EQV’s, Presidio Pubco Inc’s (“Pubco”), EQV Resources LLC’s (“EQVR”) or Presidio’s or their management teams’ expectations, hopes, beliefs, intentions or strategies regarding the future. Forward-looking statements may be identified by the use of words such as “estimate,” “plan,” “project,” “forecast,” “intend,” “expect,” “anticipate,” “believe,” “seek,” “potential,” “budget,” “may,” “will,” “could,” “should,” “continue” or other similar expressions that predict or indicate future events or trends or that are not statements of historical matters. These forward-looking statements include, but are not limited to, statements regarding Pubco’s, Presidio’s, EQVR’s and EQV’s expectations with respect to future performance, the timing and amount of any dividend payments; the ability to successfully complete acquisitions on attractive terms, or at all, the capitalization of EQV or Pubco after giving effect to the proposed Business Combination and expectations with respect to the future performance and the success of Pubco following the consummation of the proposed Business Combination. These statements are based on various assumptions, whether or not identified in this press release, and on the current expectations of Pubco’s, Presidio’s, EQVR’s and EQV’s management and are not predictions of actual performance. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as, and must not be relied upon by any investors as, a guarantee, an assurance, a prediction or a definitive statement of fact or probability. Actual events and circumstances are difficult or impossible to predict and will differ from assumptions. Many actual events and circumstances are beyond the control of Pubco, Presidio, EQVR and EQV. These forward-looking statements are subject to a number of risks and uncertainties, including changes in business, market, financial, political and legal conditions; benefits from hedges and expected production; the inability of the parties to successfully or timely consummate the proposed Business Combination, including the risk that any regulatory approvals are not obtained, are delayed or are subject to unanticipated conditions that could adversely affect Pubco or the expected benefits of the proposed Business Combination; failure to realize the anticipated benefits of the proposed Business Combination, which may be affected by, among other things, competition, the ability of Pubco to grow and manage growth profitably, maintain key relationships and retain its management and key employees; risks related to the uncertainty of the projected financial information with respect to Presidio or Pubco; risks related to Presidio’s current growth strategy; the occurrence of any event, change or other circumstances that could give rise to the termination of any definitive agreements with respect to the proposed Business Combination; the outcome of any legal proceedings that may be instituted against any of the parties to the potential Business Combination following its announcement and any definitive agreements with respect thereto; changes to the proposed structure of the proposed Business Combination that may be required or appropriate as a result of applicable laws or regulations or as a condition to obtaining regulatory approval of the proposed Business Combination; risks that Presidio or Pubco may not achieve their expectations; the ability to meet stock exchange listing standards following the proposed Business Combination; the risk that the proposed Business Combination disrupts the current plans and operations of Presidio; costs related to the potential Business Combination; changes in laws and regulations; risks related to the domestication of EQV as a Delaware corporation; risks related to Pubco’s ability to pay expected dividends; the extent of participation in rollover agreements; the amount of redemption requests made by EQV’s public equity holders; and the ability of EQV or Pubco to issue equity or equity-linked securities or issue debt securities or enter into debt financing arrangements in connection with the proposed Business Combination or in the future. Additional information concerning these and other factors that may impact such forward-looking statements can be found in filings and potential filings by Presidio, EQV, EQVR or Pubco resulting from the proposed Business Combination with the SEC, including under the heading “Risk Factors” in the Registration Statement on Form S-4 filed by Presidio, EQVR and Presidio. If any of these risks materialize or any assumptions prove incorrect, actual results could differ materially from the results implied by these forward-looking statements. There may be additional risks that none of Pubco, Presidio, EQVR nor EQV presently know or that Pubco, Presidio, EQVR or EQV currently believe are immaterial that could also cause actual results to differ from those contained in the forward-looking statements. These forward-looking statements are provided for illustrative purposes only and are not intended to serve as and must not be relied on by investors as a guarantee, an assurance, a prediction or a definitive statement of fact or probability.</span></p><p class=\"\"><span>In addition, forward-looking statements reﬂect Pubco’s, Presidio’s, EQVR’s and EQV’s expectations, plans or forecasts of future events and views as of the date they are made. Pubco, Presidio, EQVR and EQV anticipate that subsequent events and developments will cause Pubco’s, Presidio’s, EQVR’s and EQV’s assessments to change. However, while Pubco, Presidio, EQVR and EQV may elect to update these forward-looking statements at some point in the future, Pubco, Presidio, EQVR and EQV specifically disclaim any obligation to do so, except as required by law. These forward-looking statements should not be relied upon as representing Pubco’s, Presidio’s, EQVR’s or EQV’s assessments as of any date subsequent to the date they are made. Accordingly, undue reliance should not be placed upon the forward-looking statements. None of Pubco, Presidio, EQVR or EQV, or any of their respective affiliates have any obligation to update these forward-looking statements other than as required by law.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>No Offer or Solicitation</span></strong></p><p class=\"\"><span>This press release shall not constitute a solicitation of any proxy, vote, consent or approval in any jurisdiction in connection with the proposed Business Combination and shall not constitute an offer to sell or a solicitation of an offer to buy the securities of EQV, PIH, EQVR or Pubco, nor shall there be any sale of any such securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of such state or jurisdiction. No offer of securities shall be made except by means of a prospectus meeting the requirements of the Securities Act of 1933, as amended. This press release is restricted by law; it is not intended for distribution to, or use by any person in, any jurisdiction in where such distribution or use would be contrary to local law or regulation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Presidio Media and Investor Contact</span></strong><span>:</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=_s6R5sLbRhBEeA5U1YX1sGex4e9P9tKRuqED31rFUj-RVQcKVgq6UTWJ_qJbVoe81h9bvrlhjkKPt-iZ_lLzPfrq9mjqbxvETqHU7ZnJzPQ=\" rel=\"nofollow\" target=\"_blank\">Presidio@icrinc.com</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For EQV:</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=1rLNCs4Ui4AgeGVRH9f5INV2vlumhGY3xFkton8LaFWhTvgz27eWmGIzmmxp9AqH2WAs2Y6DcNINiq0mWyS9Wcymg8HlSkcRxgJrRS06i2k=\" rel=\"nofollow\" target=\"_blank\">IR@eqvventures.com</a><span> </span></p><p class=\"\"><span>Source:EQV</span><span> Ventures Acquisition Corp.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:bb68993ae094b:0-eqv-ventures-acquisition-corp-shareholders-approve-business-combination-with-presidio/",
            "pub_date": "2026-02-28 09:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3ee68d74b63dd:0",
            "title": "RingCentral President and COO Kira Makagon Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Kira Makagon, President and COO of RingCentral, sold a total of 22,196 Class A Common Stock shares on February 27, 2026, for a total sale amount of $780,278. The sales were conducted under a Rule 10b5-1 trading plan, with prices ranging from $34.81 to $35.41, resulting in a weighted average price of $35.147 for the majority of shares. Following these transactions, Makagon directly owns 339,545 shares of RingCentral.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Makagon Kira</span></td></tr><tr><td><span>Relationship</span></td><td><span>President and COO</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$780,278</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1586648/000158664826000008/xslF345X05/form4-02282026_010228.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1586648/000158664826000008/xslF345X05/form4-02282026_010228.xml\" rel=\"nofollow\" target=\"_blank\">RingCentral, Inc. [ RNG ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:3ee68d74b63dd:0-ringcentral-president-and-coo-kira-makagon-sells-shares/",
            "pub_date": "2026-02-28 09:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:79f6a2c4f094b:0",
            "title": "Ethereum’s Market Order Imbalance Hits Record Negatives: $1,850 Is Now The Line In The Sand",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Ethereum is attempting to stabilize around the $2,000 level as the broader crypto market shows tentative signs of relief. After weeks of persistent pressure, price action has paused its decline, but sentiment remains fragile. The recent rebound has helped ease immediate downside momentum, yet the technical structure still reflects a market recovering from significant damage rather than entering a confirmed uptrend.</span></p><p class=\"\"><span>According to a CryptoQuant analyst, Ethereum endured a severe liquidation-driven sell-off in recent weeks, falling sharply from local highs near $3,300 to lows around the $1,850 region. The intensity of this move becomes particularly evident when analyzing the Net Taker Volume (30-day moving average), a metric that measures aggressive market order activity. In February, this indicator plunged to its most negative level since last November, highlighting the dominance of aggressive sellers during the decline.</span></p><p class=\"\"><span>Such extreme negative readings typically reflect panic-driven execution rather than orderly repositioning. When taker volume skews heavily to the sell side, it often signals forced exits, stop-outs, and cascading liquidations across derivatives markets. While Ethereum’s attempt to hold $2,000 suggests that immediate selling pressure may be easing, the underlying data confirms that the market recently absorbed one of its most intense bouts of downside aggression in months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Taker Volume Signals Capitulation — But Not Confirmation</span></strong></p><p class=\"\"><span>The dominance of towering red bars in Ethereum’s Net Taker Volume underscores how aggressively sellers controlled the order books during the recent decline. When taker sell orders consistently exceed taker buy orders by such a magnitude, it reflects urgency. This is not passive distribution; it is market participants hitting bids aggressively, often under stress. The combination of panic-driven exits, systematic short positioning, and forced long liquidations likely amplified the move from $3,300 to sub-$1,900 levels.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:79f6a2c4f094b-bca6a7701b37dfb33c5bfa7c53921e16-resized.webp\" type=\"image/webp\"/><img alt=\"Ethereum NetTakerVolume | Source: CryptoQuant\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:79f6a2c4f094b-bca6a7701b37dfb33c5bfa7c53921e16-resized.webp\" style=\"background-color:#f6eae7\"/></picture></div></button></figure><p class=\"\"><span>Notably, the only meaningful cluster of green bars — representing aggressive buying — emerged in mid-January, coinciding with Ethereum’s local peak near $3,400. That brief resurgence in demand failed to sustain itself, after which sell-side momentum reasserted control. Structurally, this pattern suggests that upside liquidity was exhausted before a broader deleveraging cycle unfolded.</span></p><p class=\"\"><span>Extreme negative Net Taker Volume readings are often associated with capitulation phases. Historically, such flushes can mark exhaustion points, as aggressive sellers eventually deplete themselves. However, capitulation alone does not confirm reversal. For a structural shift to materialize, the imbalance must normalize. A contraction in red bars followed by sustained green dominance would signal renewed conviction from aggressive buyers.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum Struggles To Reclaim $2,000 As Downtrend Persists</span></strong></p><p class=\"\"><span>Ethereum remains structurally weak despite brief stabilization attempts near the $2,000 level. The chart shows a clear breakdown from the $3,400–$3,600 region earlier this year, followed by a sequence of lower highs and lower lows — a textbook downtrend formation. The recent bounce has not altered this structure.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:886.5979381443299px;aspect-ratio:1.4776632302405497\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:79f6a2c4f094b-46913d8cb5e6211c1027734b57be8218-resized.webp\" type=\"image/webp\"/><img alt=\"ETH consolidates in a critical price level | Source: ETHUSDT chart on TradingView\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:79f6a2c4f094b-46913d8cb5e6211c1027734b57be8218-resized.webp\" style=\"background-color:#1a1e29\"/></picture></div></button></figure><p class=\"\"><span>Price is currently trading below the 50-day, 100-day, and 200-day moving averages, all of which are sloping downward. This alignment confirms bearish momentum across short-, medium-, and long-term horizons. Notably, the 50-day average has accelerated lower, reflecting sustained selling pressure rather than a temporary liquidity vacuum.</span></p><p class=\"\"><span>The sharp decline toward the $1,850 zone was accompanied by a significant spike in volume, suggesting forced liquidations and aggressive distribution. Since then, volume has moderated during consolidation, indicating that while panic may have eased, conviction among buyers remains limited.</span></p><p class=\"\"><span>Technically, $2,000 functions as a psychological pivot rather than confirmed support. A sustained move above the 50-day average would be required to signal improving momentum. Conversely, failure to hold the current range could reopen downside risk toward deeper liquidity pockets.</span></p><p class=\"\"><span>Featured image from ChatGPT, chart from TradingView.com </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:79f6a2c4f094b:0-ethereum-s-market-order-imbalance-hits-record-negatives-1-850-is-now-the-line-in-the-sand/",
            "pub_date": "2026-02-28 09:00:59",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2DI:0",
            "title": "U.S. Food And Drug Administration Approves Biomarin's Palynziq® (Pegvaliase-Pqpz) For Adolescents 12 Years Of Age And Older With Phenylketonuria (Pku)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Biomarin Pharmaceutical Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>U.S. FOOD AND DRUG ADMINISTRATION APPROVES BIOMARIN'S PALYNZIQ® (PEGVALIASE-PQPZ) FOR ADOLESCENTS 12 YEARS OF AGE AND OLDER WITH PHENYLKETONURIA (PKU)</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2DI:0-u-s-food-and-drug-administration-approves-biomarin-s-palynziq-pegvaliase-pqpz-for-adolescents-12-years-of-age-and-older-with-phenylketonuria-pku/",
            "pub_date": "2026-02-28 09:02:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1385555cde4ae:0",
            "title": "Key facts: Rio Tinto, Codelco sign MOU; Closure agreement with Tłı̨chǫ Government",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Rio Tinto and Chile's Codelco have signed a memorandum of understanding to explore potential development and investment opportunities.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L6N3ZN0GY:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Rio Tinto has finalized a closure agreement with the Tłı̨chǫ Government regarding the Diavik Diamond Mine in Behchokǫ̀.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_FWN3ZN2EW:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:1385555cde4ae:0-key-facts-rio-tinto-codelco-sign-mou-closure-agreement-with-t-ch-government/",
            "pub_date": "2026-02-28 09:03:24",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:d2da27a8db2ed:0",
            "title": "Key facts: GSK acquires 35Pharma for $950M; shares buyback totals 5.98%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>GSK is acquiring Canadian biopharma 35Pharma for $950 million, including the drug HS235, which has finished phase I trials and will soon enter studies for pulmonary hypertension.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/sharecast:26f4d1a9c094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>On February 27, 2026, GSK plc bought 3,706,000 shares in its buyback program, totaling 243,597,094 treasury shares, or 5.98% of voting rights.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026-02-27:newsml_RSa6047Ua:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:d2da27a8db2ed:0-key-facts-gsk-acquires-35pharma-for-950m-shares-buyback-totals-5-98/",
            "pub_date": "2026-02-28 09:03:24",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3753fc24dbf91:0",
            "title": "Key facts: Shell faces debt crisis at Raízen; announces share buyback; continues Kazakhstan projects",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Shell is experiencing a debt crisis at its Brazilian biofuels joint venture, Raízen, raising concerns about the financial stability of the business.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_FWN3ZM2AG:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>On February 27, 2026, Shell plc announced a share buyback program, initiated on February 5, 2026, with Morgan Stanley managing trades until May 1, 2026.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/globenewswire:7c66056f2094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Shell will continue its development projects in Kazakhstan, despite previous indications of a possible halt due to ongoing legal issues with the government.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_S8N3Z804X:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:3753fc24dbf91:0-key-facts-shell-faces-debt-crisis-at-ra-zen-announces-share-buyback-continues-kazakhstan-projects/",
            "pub_date": "2026-02-28 09:03:49",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:dcc9621d939b7:0",
            "title": "Key facts: HSBC earnings boost European outlook; 2025 Annual Report released",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>HSBC's recent earnings updates have positively influenced the corporate outlook in Europe, enhancing investor sentiment amid concerns regarding AI disruptions and trade tariffs.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L4N3ZN0QS:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>On February 27, 2026, HSBC Holdings PLC announced the availability of its 2025 Annual Report on Form 20-F.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026-02-27:newsml_RSa7776Ua:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:dcc9621d939b7:0-key-facts-hsbc-earnings-boost-european-outlook-2025-annual-report-released/",
            "pub_date": "2026-02-28 09:03:49",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:5579b2f0f3c92:0",
            "title": "Key facts: Eskom cuts electricity prices by 29% for Glencore; Capital Group exceeds voting rights threshold",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Eskom has cut electricity prices by 29% for Glencore's joint venture with Merafe Resources, reducing the tariff from 87.74 to 62 cents per kilowatt hour to aid the ferrochrome sector.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L8N3ZN0KW:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>On February 26, 2026, Glencore PLC announced that The Capital Group Companies, Inc. exceeded a voting rights threshold after a share transaction on February 25, 2026.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/eqs:f40137510094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:5579b2f0f3c92:0-key-facts-eskom-cuts-electricity-prices-by-29-for-glencore-capital-group-exceeds-voting-rights-threshold/",
            "pub_date": "2026-02-28 09:03:49",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1f4b3facd4f6a:0",
            "title": "Key facts: Barclays sued over Tricolor securities fraud; shares repurchased",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Barclays is facing a lawsuit in Manhattan, accused of failing to spot warning signs in the fraudulent marketing of securities linked to the bankrupt subprime auto lender Tricolor.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L6N3ZN118:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>As of February 26, 2026, Barclays PLC has repurchased 3,185,000 shares, totaling 41,431,750 since February 10, 2026, at an average price of 470.56 pence each.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026-02-27:newsml_RSa6106Ua:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:1f4b3facd4f6a:0-key-facts-barclays-sued-over-tricolor-securities-fraud-shares-repurchased/",
            "pub_date": "2026-02-28 09:03:49",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012014:0",
            "title": "What Is a City When Its Wealthiest Leave? — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Richard Florida</span></p><p class=\"\"><span>Google co-founder Larry Page recently made headlines by spending $188 million on three Miami mansions. He's not the only billionaire looking at a big move: His Google co-founder Sergey Brin is reportedly shopping for Miami property. So is WhatsApp co-founder Jan Koum.</span></p><p class=\"\"><span>The shopping spree comes as California considers a wealth tax to impose a one-time retroactive levy on billionaires that has fueled speculation that they have had it with the Golden State. In New York City, where Mayor Zohran Mamdani earlier this month proposed an increase in taxes on high-income people — and short of that, a property tax increase — there is talk of a parallel exodus.</span></p><p class=\"\"><span>The wealthy have long threatened to leave when battling local governments over taxes. In the past, they rarely did. But their threats have teeth this time — not because they are abandoning great cities, but because they have figured out they don't have to. Now that digital technology allows them to separate where they live and pay taxes from where their businesses operate, they aren't relocating their companies. They are relocating themselves.</span></p><p class=\"\"><span>This upends the basic arrangement that underwrote great cities — what they are, how they work and who pays for them. Amid this seismic shift looms an existential question: Can those cities survive without them?</span></p><p class=\"\"><span>For most of history, people lived where they worked — on the farm, above the shop, close to the factory. Suburbanization expanded the radius, but workers, managers and executives still had to be close to where jobs concentrated. Because people had to be there, cities could charge a premium. Residents paid it in housing costs, in taxes and in the costs of commuting or other frictions of day-to-day life. The alternative — living elsewhere — meant being cut off from their livelihoods and economic opportunity. Taxes were part of that price, and people paid because they had no choice.</span></p><p class=\"\"><span>When Covid hit, this social compact appeared to quake. A chorus of commentators predicted the imminent collapse of New York, London, San Francisco and other great global cities. They predicted the wealthy and their companies would be driven out by lockdowns, governance failures, crime and the sudden possibility of remote work. The cities, as a result, would hollow out.</span></p><p class=\"\"><span>There seemed to be something to it — at first. Ken Griffin relocated himself and the headquarters of his Citadel hedge fund from Chicago to Miami. The venture capitalists Peter Thiel and Keith Rabois bought homes in Miami Beach and opened an office for their venture capital fund in Miami, too. Jeff Bezos moved from Seattle to Miami, assembling a $200 million plus compound.</span></p><p class=\"\"><span>But the predicted total exodus never fully materialized.</span></p><p class=\"\"><span>Many of those who moved to Miami quickly came face to face with its limits. Public and private schools couldn't match what they had left behind. Housing costs rose astronomically — making Miami now one of the most unaffordable markets in the country.</span></p><p class=\"\"><span>Most critically, they found it hard to recruit top talent. New York and London remained the centers of global finance. San Francisco remained the center for high technology, with the lion's share of venture capital investment to AI startups still flowing into the Bay Area.</span></p><p class=\"\"><span>In 2023, Thiel admitted as much, conceding that the tech industry remained densely concentrated in California and that Miami's housing costs had put the city out of reach for much of the talent he needed — making it far harder to move companies and their people than he initially thought. Griffin himself ended up building a massive new building in New York even as Citadel expanded in Miami.</span></p><p class=\"\"><span>But eventually they realized they didn't have to move their companies at all. Digital technology enabled them to live in one place and keep their business in another. They could establish residency in Miami, which requires no particular time spent there to claim residency status, and spend much of the year wherever else they wanted — flying into New York or San Francisco for what mattered. The city where their businesses are headquartered became just that — not somewhere they needed to reside and pay taxes.</span></p><p class=\"\"><span>That has transformed the underlying economic logic of cities. They are no longer self-contained economic units. Digital technology is remaking them into networks — physical places connected by virtual ties and dynamic talent flows.</span></p><p class=\"\"><span>Economic participation now happens across places, not within them. My own research has documented the rise of what I call lifestyle tax havens — cities such as Miami, Dubai and Singapore that combine low or no income taxes with warm weather, luxury amenities and easy access to global networks.</span></p><p class=\"\"><span>These lifestyle tax havens do not replace the great hubs. They are satellites in their orbit, part of the networks that form around them. Miami is a critical node in New York's financial network. Austin operates as a satellite of San Francisco's tech network. Dubai plays a similar role for London and the financial centers of Europe and Asia.</span></p><p class=\"\"><span>Billionaires make headlines, but the same math applies down the economic ladder. For a high earner, a move from San Francisco, Los Angeles or New York to Miami could save 10 to 14 percentage points on income tax, based on current rates. For a professional couple earning $1 million a year, that is roughly $100,000 to $140,000 annually — adding up to more than $1 million over a decade. This is a simplification, of course — certainly, taxes can be complicated by write offs and different income types. But the income-tax rates paint a clear picture.</span></p><p class=\"\"><span>But what becomes of cities that are lifestyle tax havens?</span></p><p class=\"\"><span>They were never built to scale in the way older cities have. In the old urban system, people were anchored to place. That anchoring did more than generate tax revenue. It created loyalty, civic investment and philanthropy — the long-term commitment that built private schools, museums, hospitals, universities and cultural institutions. When people stayed, they fixed what was broken because they had no alternative.</span></p><p class=\"\"><span>The lifestyle tax havens often lack the civic commitment that allowed places like New York, London, Paris or Chicago to grow into fuller-spectrum cities. Places like Miami lack the integrated infrastructure and public systems, and as population and activity increase, everyday urban functions become harder to manage. Moving around becomes increasingly difficult. Housing costs rise rapidly. Schools and public services struggle to keep pace. These are not temporary growing pains. They are structural limits.</span></p><p class=\"\"><span>The model works well enough for wealthy residents who can buy private solutions — housing, education, transportation, security. For empty-nesters and young professionals without children, the trade-offs may be manageable. For families, they are far more consequential. And for service workers — the people who staff hospitals, schools, restaurants and local government — the barriers are often insurmountable. When the people who make a city run cannot afford to live there, the city itself begins to fray.</span></p><p class=\"\"><span>This is the dynamic the economist Albert Hirschman warned about: That loyalty is what turns frustration into voice — the impulse to fix what is broken rather than flee. Today, exit is cheap and reversible. When taxes rise or services disappoint, the response is no longer to press for reform but to move.</span></p><p class=\"\"><span>Cities, then, are pushed toward a race to the bottom — not one driven by ideology, but by mobility. As high earners leave the tax base without leaving the economy, cities face pressure to lower taxes without lowering obligations. The burden of funding schools, transit, parks and public safety shifts to those who remain. Established cities and rising stars alike are caught in this trap.</span></p><p class=\"\"><span>Cities cannot simply chase mobile residents by cutting taxes. That is a losing game. National governments are unlikely to solve this problem, and in any case it plays out at a global scale. Cities will have to respond on their own by rethinking what they tax. If income and wealth can move, cities must focus on what cannot: land and property, consumption and entertainment, visitors and tourism, commuters and employment, companies that operate locally and anchor institutions that are rooted in place.</span></p><p class=\"\"><span>For decades, great cities benefited from a relatively captive tax base. That constraint has now weakened — and in many cases, it has been broken. Cities can respond to this new competition, or they can choose not to. But they cannot opt out.</span></p><p class=\"\"><span>--</span></p><p class=\"\"><span>Richard Florida is a Distinguished Visiting Professor at Vanderbilt University, a University Professor at the University of Toronto, and a Distinguished Fellow at The Kresge Foundation. He is the author of \"The Rise of the Creative Class\" and \"The New Urban Crisis\" and is currently writing a book on how digital technology is reshaping cities and the geography of work.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012014:0/",
            "pub_date": "2026-02-28 09:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:5114c1eca094b:0",
            "title": "Railtown AI Technologies Inc. Announces Closing of $3.4M Fully Subscribed Non-Brokered Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - </span><strong class=\"root-Tkn6WL2y\"><span>Railtown AI Technologies Inc. </span><span> (OTCQB: RLAIF) </span></strong><span>(\"</span><strong class=\"root-Tkn6WL2y\"><span>Railtown</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") is pleased to announce that the Company has closed its previously-disclosed, fully subscribed non-brokered private placement (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Offering</span></strong><span>\") of units of the Company (each, a \"</span><strong class=\"root-Tkn6WL2y\"><span>Unit</span></strong><span>\") at a price of $0.30 per Unit for aggregate gross proceeds of $3,400,000. Each of the 11,333,334 Units consists of one common share in the capital of the Company (each, a \"</span><strong class=\"root-Tkn6WL2y\"><span>Share</span></strong><span>\") and one-half of one common share purchase warrant (each whole warrant, a \"</span><strong class=\"root-Tkn6WL2y\"><span>Warrant</span></strong><span>\"), with each Warrant entitling the holder thereof to acquire one additional Share at an exercise price of $0.45 per Share for a period of 18 months.</span></p><p class=\"\"><span>The Warrants are subject to acceleration in certain limited circumstances. For details regarding those circumstances, please see Railtown's news release dated February 9, 2026. </span></p><p class=\"\"><span>All securities issued in connection with the Offering are subject to a standard hold period of four months and one day in accordance with applicable Canadian securities laws. </span></p><p class=\"\"><span>In connection with the Offering, the Company paid aggregate cash commissions of $160,000 to certain eligible arm's length finders (each, a \"</span><strong class=\"root-Tkn6WL2y\"><span>Finder</span></strong><span>\"), equal to 8% of the gross proceeds raised from purchasers introduced by such Finders, and issued an aggregate of 533,333 non-transferable common share purchase warrants (each, a \"</span><strong class=\"root-Tkn6WL2y\"><span>Finder's Warrant</span></strong><span>\") to the same Finders, equal to 8% of the number of Units sold to purchasers introduced by such Finders. Each Finder's Warrant entitles the holder thereof to acquire one Share at an exercise price of $0.30 per Share for a period of 18 months from the date of issuance.</span></p><p class=\"\"><span>The Company expects to use the net proceeds of the Offering for general working capital purposes.</span></p><p class=\"\"><span>None of the securities referenced in this news release have been or will be registered under the United States Securities Act of 1933, as amended (the \"</span><strong class=\"root-Tkn6WL2y\"><span>U.S. Securities Act</span></strong><span>\"), or any applicable state securities laws and may not be offered or sold in the United States or to, or for the account or benefit of, U.S. persons (as defined in Regulation S under the U.S. Securities Act) or persons in the United States absent registration or an applicable exemption from such registration requirements. This news release does not constitute an offer to sell or the solicitation of an offer to buy any of the securities in any jurisdiction in which such offer, solicitation or sale would be unlawful.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Railtown</span></strong></p><p class=\"\"><span>Railtown AI Technologies Inc. builds AI developer tools and agentic frameworks that power the next generation of intelligent applications. Its Platform — including real-time ingestion (Railengine), agent development frameworks (Railtracks ADK), and advanced observability (Conductr) — helps teams build, deploy, and operate AI agents with confidence and at scale.</span></p><p class=\"\"><span>For more information, visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/mjxXnUxmoQ\" rel=\"nofollow\" target=\"_blank\">www.railtown.ai</a><span>.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Follow us on social media</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>LinkedIn: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/kXYRWtY837\" rel=\"nofollow\" target=\"_blank\">https://www.linkedin.com/company/railtown-ai/</a><span> </span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SUBSCRIBE FOR INVESTOR NEWS</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/B5LGYFPrRV\" rel=\"nofollow\" target=\"_blank\">Click here</a><span> to receive our latest investor news alerts.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ON BEHALF OF THE BOARD</span></strong></p><p class=\"\"><span>\"Cory Brandolini\" </span></p><p class=\"\"><span>Cory Brandolini, Chief Executive Officer</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>INVESTOR CONTACT</span></strong></p><p class=\"\"><span>Rebecca Kerswell</span></p><p class=\"\"><span>Investor Relations Contact</span></p><p class=\"\"><span>Email: investors@railtown.ai </span></p><p class=\"\"><span>Phone: 1-604-417-4440</span></p><p class=\"\"><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><p class=\"\"><em><span>This news release contains forward-looking statements relating to the future operations of the Company and other statements that are not historical facts. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"intends\", \"anticipates\", \"expects\" and similar expressions. All statements other than statements of historical fact included in this news release, including, without limitation, statements regarding the closing of the Private Placement, the use of proceeds from the Private Placement, and the future plans and objectives of the Company, are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations are detailed from time to time in the filings made by the Company with securities regulators.</span></em></p><p class=\"\"><em><span>Readers are cautioned that any forward-looking statements are not based on historical facts but instead reflect management's expectations, estimates or projections concerning future results or events based on the opinions, assumptions and estimates of management considered reasonable at the date the statements are made. Such opinions, assumptions and estimates may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. As a result, the Company cannot guarantee that any forward-looking statement will materialize, and readers should not place undue reliance on any forward-looking information. Any forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will only update or revise publicly any of the included forward-looking statements as expressly required by Canadian securities law.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>***NOT FOR DISSEMINATION IN THE UNITED STATES OR FOR DISTRIBUTION TO UNITED STATES NEWS WIRE SERVICES.***</span></strong></p></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:5114c1eca094b:0-railtown-ai-technologies-inc-announces-closing-of-3-4m-fully-subscribed-non-brokered-private-placement/",
            "pub_date": "2026-02-28 09:00:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSMpCzga:0",
            "title": "Empress Reports 2025 Year End Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>VANCOUVER, BC / ACCESS Newswire / February 27, 2026 / Empress Royalty Corp. </span><span>(OTCQX:EMPYF) (\"</span><strong class=\"root-Tkn6WL2y\"><span>Empress</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") is pleased to announce its audited financial and operating results for the fiscal year ended December 31, 2025. The Company concluded the year with record-breaking revenue.</span></p><p class=\"\"><span>\"2025 was a transformational year for Empress, we doubled revenue, generated strong cash flow, and strengthened our balance sheet,\" stated Alexandra Woodyer Sherron</span><em><span>,</span></em><span> CEO and President of Empress Royalty</span><span>. \"We executed our strategy with discipline and focus, and our model delivered. With rising production and strong gold and silver prices, we enter 2026 from a position of strength - ready to redeploy capital with precision and continue building durable, value-accretive growth for our shareholders.\"</span></p><p class=\"\"><span>Key Financial and Operating Highlights for the year ended December 31, 2025</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Record Revenue: Empress generated royalty and streaming revenue of US$17.2M, resulting in a gross profit of US$12.1M.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Strong Cash Generation: The Company maintained its focus on liquidity, achieving positive operating cash flow of US$3.7M.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Substantial Earnings Growth: Empress reported a net income of US$7.4M for the year, representing a significant increase over the US$1.0M reported in fiscal year 2024.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Operational Efficiency: Adjusted EBITDA for the full year stood at US$13.9M, reflecting the high-margin nature of the Company's streaming and royalty interests.</span></p></li></ul><p class=\"\"><span>These annual results highlight the strength of the Company's portfolio and its commitment to building long-term, sustainable value through selective, high-quality investments.</span></p><p class=\"\"><span>The financial statements and accompanying management's discussion and analysis have been filed on </span><strong class=\"root-Tkn6WL2y\"><span>Sedar+</span></strong><span> (www.sedarplus.ca) and are also available on the Company's website at www.empressroyalty.com.</span></p><p class=\"\"><span>Empress provides the following guidance as part of its annual financial statement filing, reflecting management's current expectations for fiscal 2026 based on the performance of its existing royalty and streaming portfolio, information provided from operators, and prevailing market conditions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key Guidance Metrics for Fiscal 2026</span></strong></p><p class=\"\"><span>Empress anticipates meaningful growth in its attributable production in 2026, supported by continued contributions from key assets with potential optimization initiatives and steady performance with its portfolio holdings. Guidance incorporates assumptions of stable or improving operator performance and no major disruptions, consistent with disclosure standards under NI 51-102 and, where applicable, National Instrument 43-101 - Standards of Disclosure for Mineral Projects (\"NI 43-101\") for technical information.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attributable Gold Equivalent Ounces (GEOs)</span></strong></p><p class=\"\"><span>As a royalty and streaming company focused on precious metals, the Company's performance is inherently tied to production volumes and metal prices, which are volatile; accordingly, emphasis is placed on attributable gold equivalent ounces (\"GEOs\") sales as a primary metric to reflect production exposure. For streams, guidance reflects GEOs that have been delivered from the operators of our assets. Our GEO deliveries may differ from operators' production based on timing of deliveries and due to recovery and payability factors. GEO sales may differ from GEO deliveries based on the timing of the sales. For royalties, GEO guidance reflects the timing of royalty payments or accruals.</span></p><p class=\"\"><span>Empress expects attributable GEOs of 7,045 to 7,430 for fiscal 2026. This range represents the Company's diversified exposure across gold and silver calculated using conservative conversion ratios based on assumed commodity prices of $4,000/oz gold and $70/oz silver. GEOs are emphasized as the core metric, as they directly reflect the underlying production from operators and reduce dependency on volatile spot prices for performance evaluation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Assumptions and Basis for Guidance</span></strong></p><p class=\"\"><span>The 2026 Guidance is based on public and non-public forecasts, other disclosure by the owners and operators of our assets, internal analysis of historical performance, and management's understanding of the underlying producing assets. Additionally, the Company may receive information from the owners and operators of the properties, which the Company is not permitted to disclose to the public pursuant to the underlying agreement.</span></p><p class=\"\"><span>Key assumptions include:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Annual increases in revenue if metals prices continue to be in the range of $4,000oz gold and $70/oz silver, and/or operating improvements are made at the underlying assets, and/or additional assets are added to the stream and royalty portfolio;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Production estimates reliant on operator guidance under NI 43-101-compliant reports and other non-public technical information and no material production interruptions;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>No major new acquisitions or divestitures beyond those already announced, though the Company continues to actively evaluate opportunities; and</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Currency exchange rates and tax considerations consistent with current levels.</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sensitivity</span></strong></p><p class=\"\"><span>The success of the Company in 2025 was based on a small number of investments and a significant increasing trend in gold and silver prices. There is no guarantee that this trend will continue in 2026. Given the volatile nature of gold and silver markets, an increase or decrease in gold or silver prices could impact attributable GEO values and related revenue considerably.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Risks and Uncertainties</span></strong></p><p class=\"\"><span>Achievement of this guidance is subject to various risks, including but not limited to commodity price volatility (a primary concern given the small number of investments), operator-specific challenges (e.g., production delays), geopolitical factors, and environmental considerations. These could result in actual GEOs and revenues varying from the provided guidance, potentially materially. Investors should refer to the cautionary statements contained at the end of this news release, and the full discussion of risks in the Company's 2025 Annual Information Form filed on www.sedarplus.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Conclusion and Updates</span></strong></p><p class=\"\"><span>Empress continues to implement its stated strategy of building a diversified, cash-flowing portfolio to deliver sustainable value to shareholders. The Company will review and update this outlook quarterly or as material events occur, such as new acquisitions, significant operator announcements, or commodity price shifts. Management remains focused on disciplined growth and capital allocation in the streaming and royalty sector.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT EMPRESS ROYALTY CORP.</span></strong></p><p class=\"\"><span>Empress is a global royalty and streaming creation company providing investors with a diversified portfolio of gold and silver investments. Empress has built a portfolio of precious metal investments and is actively investing in mining companies with development and production stage projects who require additional non-dilutive capital. The Company has a strategic partnership with Endeavour Financial which allows Empress to not only access global investment opportunities but also bring unique mining finance expertise and deal structuring. Empress is looking forward to continuously creating value for its shareholders through the proven royalty and streaming models.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ON BEHALF OF EMPRESS ROYALTY CORP.</span></strong></p><p class=\"\"><span>Per: Alexandra Woodyer Sherron, CEO and President</span></p><p class=\"\"><span>For further information, please visit our website at www.empressroyalty.com, or contact us by email at info@empressroyalty.com or by phone at +1.604.331.2080.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this press release.</span></p><p class=\"\"><span>The information contained herein includes \"forward-looking statements\" and \"forward looking information\" as defined under applicable Canadian securities laws (\"forward-looking statements\"). Forward-looking statements and information can generally be identified by the use of terms such as \"may\", \"will\", \"should\", \"expect\", \"intend\", \"estimate\", continue\", \"believe\", \"plans\", \"anticipate\" or similar terms.</span></p><p class=\"\"><span>Forward-looking information and statements include, but are not limited to, statements with respect to the activities, events or developments that Empress Royalty Corp. (\"Empress\" or the \"Company\") expects or anticipates will or may occur in the future, including those regarding future growth and ability to create new streams or royalties, the development and focus of the Company , its acquisition strategy, the plans and expectations of the operators of the projects underlying its interests, including the proposed advancement and expansion of such projects; the results of exploration, development and production activities of the operators of such projects; and the Company's expectations regarding future revenues.</span></p><p class=\"\"><span>Forward-looking information and statements are based on the then current expectations, beliefs, assumptions, estimates and forecasts about Empress's business and the industry and markets in which it operates. Forward-looking information and statements are made based upon numerous assumptions and although the assumptions made by the Company in providing forward-looking information and statements are considered reasonable by management at the time, there can be no assurance that such assumptions will prove to be accurate. Forward-looking information and statements also involve known and unknown risks and uncertainties and other factors, which may cause actual results, performances and achievements of Empress to differ materially from any projections of results, performances and achievements of Empress including, without limitation, any inability of the operators of the properties underlying the Company's royalty and stream interests to execute proposed plans for such properties or to achieve planned development and production estimates and goals, risks related to the operators of the projects in which the Company holds interests, including the successful continuation of operations at such projects by those operators, risks related to exploration, development, permitting, infrastructure, operating or technical difficulties on any such projects, risks related to international operations, government relations and environmental regulation, uncertainty relating to the availability and costs of financing needed in the future and the Company's ability to carry out its growth plans as well as the impact of the COVID-19 pandemic and other related risks and uncertainties. For a discussion of important factors which could cause actual results to differ from forward-looking statements, refer to the annual information form of Empress for the year ended December 31, 2024 and its other publicly filed documents under it profile a </span><em><span>www.sedarplus.ca</span></em><span>. Although the Company has attempted to identify important factors that could cause actual results to differ materially from those contained in the forward-looking information and statements, there may be other factors that cause results not to be as anticipated, estimated, or intended. There can be no assurance that forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking information and statements. The Company undertakes no obligation to update or reissue forward-looking information as a result of new information or events except as required by applicable securities laws. Disclosure relating to properties in which Empress holds royalty or stream interests is based on information publicly disclosed by the owners or operators of such properties. The Company generally has limited or no access to the properties underlying its interests and is largely dependent on the disclosure of the operators of its interests and other publicly available information. The Company generally has limited or no ability to verify such information. Although the Company does not have any knowledge that such information may not be accurate, there can be no assurance that such third-party information is complete or accurate. In addition, certain information publicly reported by operators may relate to a larger property than the area covered by the Company's interest, which often may only apply to a portion of the overall project area or applicable mineral resources or reserves.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Empress Royalty Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSMpCzga:0/",
            "pub_date": "2026-02-28 09:00:48",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011636:0",
            "title": "Correction to First Brands Article — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Negotiations between First Brands and its lenders broke down two weeks ago, prompting Ford to step in because it is vital to the automaker that deals with a stable buyer happen quickly, Ford's lawyer Mark Freedlander of McGuireWoods said Friday. \"First Brands Races to Sell Units in Bankruptcy to Avert April Wind-Down,\" at 5:43 p.m. ET incorrectly identified lawyer Mark Freedlander as First Brands' lawyer, while he represents Ford.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011636:0/",
            "pub_date": "2026-02-28 08:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:06f4fdba7dddc:0",
            "title": "Taiwan Fund Director Kirby William C. Acquires 50,686 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Taiwan Fund Director, Kirby William C., purchased 50,686 shares of Taiwan Fund, Inc. on February 26, 2026, at a price of $64.9 per share, totaling $3,289,521. Following this transaction, Kirby William C. directly owns 2,886 shares of Taiwan Fund, Inc.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Kirby William C.</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Purchase</span></td></tr><tr><td><span>Amount</span></td><td><span>$3,289,521</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1413483/000119312526083648/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1413483/000119312526083648/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">TAIWAN FUND INC [ TWN ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:06f4fdba7dddc:0-taiwan-fund-director-kirby-william-c-acquires-50-686-shares/",
            "pub_date": "2026-02-28 08:50:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1035db4b38a5d:0",
            "title": "Clear Secure Executives Sell Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Lynn Haaland, GC &amp; Chief Privacy Officer of Clear Secure, sold all her holdings of 15,533 Class A Common Stock shares on February 25, 2026, under a Rule 10b5-1 trading plan. The sales were executed in two parts, with prices of $44.0 and $46.0 per share, totaling $698,986. Following these transactions, Haaland no longer owns any Class A Common Stock of Clear Secure.</span></p><p class=\"\"><span>Adam Wiener, a Director at Clear Secure, sold 33,000 shares of Class A Common Stock across three transactions on February 25 and 26, 2026, for a total of $1,525,280. The sales were conducted at weighted average prices of $45.00 and $40.66 for the first two transactions on February 25, and $50.00 for the third transaction on February 26. After these sales, Wiener directly owns 132,634 shares of Clear Secure. Both sets of transactions were made under a Rule 10b5-1 trading plan.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><span>Reporter Name</span></th><th><span>Relationship</span></th><th><span>Type</span></th><th><span>Amount</span></th><th><span>SEC Filing</span></th></tr></thead><tbody><tr><td><span>Haaland Lynn</span></td><td><span>GC &amp; Chief Privacy Officer</span></td><td><span>Sell</span></td><td><span>$698,986</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2028962/000095014226000558/xslF345X05/es260744993_4-haaland.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td><span>Wiener Adam</span></td><td><span>Director</span></td><td><span>Sell</span></td><td><span>$1,525,280</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1856314/000095014226000559/xslF345X05/es260744994_4-wiener.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:1035db4b38a5d:0-clear-secure-executives-sell-shares/",
            "pub_date": "2026-02-28 08:50:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:55d07b94a0444:0",
            "title": "Arcellx Director Rami Elghandour Sells 89,916 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Rami Elghandour, serving as President, CEO, and Chairman of the Board for Arcellx, has sold 89,916 shares of Common Stock on February 27, 2026, at a weighted average price of $113.9204, totaling $10,243,266. Following this transaction, Elghandour directly owns 276,051 shares and indirectly owns 416,500 shares through trusts. The sale was conducted to satisfy tax withholding obligations related to the vesting of restricted stock units.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Elghandour Rami</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$10,243,266</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1786205/000119312526083657/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1786205/000119312526083657/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Arcellx, Inc. [ ACLX ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:55d07b94a0444:0-arcellx-director-rami-elghandour-sells-89-916-shares/",
            "pub_date": "2026-02-28 08:50:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN1AM:0",
            "title": "Soy barge bids tick lower while offers rise",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Basis bids for soybeans and corn shipped by barge to U.S. Gulf Coast terminals fell on Friday, while offers rose as buyers and sellers moved further apart in subdued trade, brokers said.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CIF Gulf soybean barges loaded in February were bid at 105 cents over Chicago Board of Trade March (SH26) soybean futures, down 3 cents from Thursday, while offers inched a few cents higher. March barges were bid at 105 cents over futures, also down 3 cents. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FOB export premiums for soybeans loaded from the Gulf in March held steady at around 130 cents over CBOT March futures. Offers for April loadings were unchanged at 106 cents over May (SK26) futures. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>For corn, CIF Gulf barges loaded in February were bid at 104 cents over March corn futures, down 4 cents from Thursday, while March corn barges were bid at 100 cents over futures, down 2 cents. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FOB export premiums for March corn loadings were steady at around 123 cents over futures.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The U.S. Department of Agriculture confirmed private sales of 257,000 metric tons of U.S. old-crop corn to undisclosed destinations. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>South Korean feedmakers were booking corn. The Major Feedmill Group (MFG) purchased about 135,000 tons of optional-origin corn in an international tender, and the Korea Feed Association (KFA) purchased around 66,000 tons in a private deal without issuing a tender, European traders said.  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Traders await the results of a Saudi Arabian purchase tender for 655,000 tons of wheat. The deadline for the submission of price offers was Friday and results were expected on Monday, European traders said. </span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN1AM:0-soy-barge-bids-tick-lower-while-offers-rise/",
            "pub_date": "2026-02-28 08:50:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2A7:0",
            "title": "AGT Food And Ingredients IPO Consists Of A Treasury Offering Of 18,478,212 Common Shares At A Price Of $23 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AGT FOOD AND INGREDIENTS: IPO CONSISTS OF A TREASURY OFFERING OF 18,478,212 COMMON SHARES AT A PRICE OF $23 PER SHARE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AGT FOOD AND INGREDIENTS: SECONDARY OFFERING OF 1,065,288 COMMON SHARES AT OFFERING PRICE, FOR AGGREGATE GROSS PROCEEDS OF AROUND $24.5 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AGT FOOD AND INGREDIENTS: FAIRFAX AFFILIATES TO BUY ON PRIVATE PLACEMENT BASIS 8.7 MILLION SHARES FOR ABOUT $200 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2A7:0-agt-food-and-ingredients-ipo-consists-of-a-treasury-offering-of-18-478-212-common-shares-at-a-price-of-23-per-share/",
            "pub_date": "2026-02-28 08:51:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:ef9a87ff4094b:0",
            "title": "Crossroads Gold Completes Acquisition of the Steiglitz Gold Project in Australia, Announces Anticipated Trading Date, and Provides Corporate and Leadership Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Crossroads Gold Corp. (formerly Northern Silicon International Inc.) (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\" or \"</span><strong class=\"root-Tkn6WL2y\"><span>Crossroads</span></strong><span>\") is pleased to announce, further to the Company's news releases dated October 29, 2025 and November 25, 2025, the Company has completed the acquisition (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Transaction</span></strong><span>\") of the Steiglitz gold project (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Steiglitz Project</span></strong><span>\") located approximately 80 kilometers west of Melbourne, Australia. </span></p><p class=\"\"><span>The Company has filed a listing application dated February 27, 2026 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Listing Application</span></strong><span>\") with the TSX Venture Exchange (the \"</span><strong class=\"root-Tkn6WL2y\"><span>TSXV</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Exchange</span></strong><span>\") for the common shares of the Company to begin trading on the Exchange under the symbol \"CRG\", with trading expected to commence on or about March 4, 2026. A copy of the Listing Application is available on the Company's SEDAR+ profile at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/XEzmESMaqD\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>.</span></p><p class=\"\"><span>Mr. Motton, Chief Executive Officer and Director of the Company, stated, </span><em><span>\"The closing of this Transaction marks a new beginning of a well-funded Australian-focused gold exploration company backed by the Fiore Group. We are excited about the year ahead for Crossroads as we embark on our aggressive exploration campaign at the Steiglitz Project, located in Victoria's renowned goldfields. Steiglitz exhibits the structural, geological and geochemical characteristics associated with significant orogenic gold systems. With a high-grade largely unexplored significant historical producer at Steiglitz, which occurs on the West Selwyn Block Trend that hosts the outstanding Fosterville gold mine, and an application for an exploration license at Pheasant Creek near Southern Cross' Sunday Creek project, we believe we have an exciting portfolio of assets. We are well positioned to execute our 2026 exploration program of extensive drilling of key targets at our Steiglitz Project. I look forward to leading Crossroads in executing a disciplined exploration program.\"</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Transaction, Financing and CUSIP/ISIN</span></strong></p><p class=\"\"><span>The Transaction was completed by statutory amalgamation under the provisions of the </span><em><span>Business Corporations Act</span></em><span> (British Columbia) among a wholly owned subsidiary of the Company and a private British Columbia company which owned the Steiglitz Project. On February 20, 2026, the TSXV conditionally approved the Transaction and the listing of the Company's common shares on the TSXV following the closing of the Transaction. The Company will be classified as a Tier 2 Mining Issuer pursuant to Exchange policies. </span></p><p class=\"\"><span>As previously disclosed on October 29, 2025 and November 25, 2025, the Company completed a brokered private placement of 26,215,000 subscription receipts issued at a price of C$0.20 per Subscription Receipt (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Subscription Receipts</span></strong><span>\") for gross proceeds of C$5,243,000 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Financing</span></strong><span>\"). The Financing was led by Red Cloud Securities Inc. as lead agent and sole bookrunner. The Subscription Receipts have converted into common shares of the Company concurrently with the closing of the Transaction.</span></p><p class=\"\"><span>The aggregate number of common shares of the Company (on an undiluted basis) issued and outstanding at closing of the Transaction (including the common shares issued pursuant to the Financing) is 63,509,094.</span></p><p class=\"\"><span>In connection with the change of the Company's name to \"Crossroads Gold Corp.\", the Company obtained the following new CUSIP number 227921103 and ISIN number CA2279211031.</span></p><p class=\"\"><span>For further information regarding the Transaction and other details, please see the documents listed under the Company's SEDAR+ profile at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/DOyPOSPXAr\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>, including the Listing Application dated February 27, 2026, as well as the news releases of the Company dated November 25, 2025 and October 29, 2025.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Board of Directors, Senior Management </span></strong></p><p class=\"\"><span>In connection with the Transaction, and following the Company's annual general meeting on December 19, 2025, certain officers and members of the Company's Board of Directors resigned. The Board of Directors and senior management team of Crossroads is now comprised of the following individuals: Mr. Neil (Rex) Motton (CEO and Director), Ms. Brenda Nowak (Chief Financial Officer and Corporate Secretary), Mr. Derrick Pattenden (Director), Mr. Paul McNeill (Director), Mr. Joaquin Emilio Marias Baldillou (Director), and Mr. Carson Sedun (Vice President, Corporate Development). </span></p><p class=\"\"><em><span>Mr. Neil (Rex) Motton, MAusMM(CP), FSEG - CEO and Director </span></em></p><p class=\"\"><span>Mr. Motton brings approximately 40 years of global industry and exploration experience in the mining industry, having been involved in the business as a professional exploration geologist since 1986. He has been a director of various mining and exploration companies since 1988. Mr. Motton has a proven track record of discovery and exploration across the globe, including having worked at exploration projects in Australia, South America, Central America, Jamaica and the Philippines. During his tenure at Fosterville South (now Great Pacific Gold </span><span> as Chief Operating Officer for over five years, he was responsible for exploration strategy, project and target generation, overseeing exploration program design and execution, as well as managing community engagement programs. Throughout his career, he has worked in a number Australian of states and territories with a primary focus on gold mineralization. He has also worked in base metals exploration, including porphyry copper deposits, VMS copper-lead-zinc, Mississippi Valley type lead-zinc and nickel laterite within Australia and overseas. Mr. Motton is a registered geologist in Australia and is a Chartered Professional of the AusIMM, as well as a Fellow of the Society of Economic Geology (FSEG). He has an Honours Degree of Applied Science (B.Ap.Sc.) majoring in Geology from the Federation University Australia.</span></p><p class=\"\"><em><span>Ms. Brenda Nowak - Chief Financial Officer, Corporate Secretary</span></em></p><p class=\"\"><span>Ms. Nowak has over 30 years of experience in the legal industry specializing in securities and corporate finance. As CFO and Corporate Secretary, she plays a pivotal role in supporting her board of directors and executive management teams. Her responsibilities encompass legal and regulatory compliance, corporate governance, oversight of board and committee affairs, management of continuous disclosure obligations and the facilitation of corporate and securities transactions. In addition to her role as Corporate Secretary and CFO with Crossroads, she is Vice President Corporate Finance for Fiore Management Advisory Corp. (FMAC) and also the Corporate Secretary for North Arrow Minerals. In the past, she has served as Corporate Secretary for Filo Mining, NGEx Minerals, Cornish Metals, International Northair Mines, New Dimension Resources, Troon Ventures, Stornoway Diamonds, Capstone Mining, Creston Moly, Kaminak Gold, Bluestone Resources, Kivalliq Energy and West Melville Metals.</span></p><p class=\"\"><em><span>Mr. Carson Sedun - Vice President, Corporate Development</span></em></p><p class=\"\"><span>Mr. Sedun is a Canadian mining &amp; resources executive with 13 years of experience in the public capital markets, investment banking, advisory, investor relations and corporate development. He has focused on the global resource and commodities industry throughout his career, advancing resource projects across Ecuador, Ontario, California, Nevada, New Mexico, Mexico and now Australia. He is the former Director of Corporate Development with Northstar Clean Technologies, a Canadian cleantech company. During his four-year tenure, Northstar secured C$67 million in funding and in 2024, Northstar was recognized in the TSX Venture Top 50 (top 50 of 1,600 issuers). He has been a Co-Founder, Director or executive of numerous resource companies, including Stronghold Silver (sold to Apollo Silver in 2021) and Core Gold (sold to ASX-listed Titan Minerals in 2020). He was formerly an Investment Banking Associate with Canaccord Genuity and Dundee Capital Markets in Vancouver, Toronto and London, UK, in which he successfully closed 35 transactions in his career. He holds an MBA degree (Dean's List, Honours with Distinction, mining specialization) from the Schulich School of Business at York University, a Bachelor of Commerce from McGill University and a Graduate Certificate from the Norman Keevil Institute of Mining Engineering at the University of British Columbia</span><em><span>. </span></em></p><p class=\"\"><em><span>Mr. Derrick Pattenden, CFA - Director </span></em></p><p class=\"\"><span>Mr. Pattenden is an accomplished investment banker with over 15 years of extensive experience in the mining industry specializing in finance, mergers and acquisitions. Throughout his career he has completed M&amp;A transactions with a combined equity value of over C$20 billion. Mr. Pattenden is currently President, Chief Executive Officer and Director of Nations Royalty Corp. </span><span>, market cap: C$180 million(1)). He has direct experience with transactions involving the creation of new mining royalties, and royalty companies, as well as the restructuring of existing metal streaming agreements. He has a Bachelor of Applied Science in Mining Engineering from the University of British Columbia and holds a Chartered Financial Analyst (CFA) designation. He is a band member of the Mohawks of the Bay of Quinte First Nation.</span></p><p class=\"\"><em><span>Mr. Joaquin Marias, P.Geo. - Director </span></em></p><p class=\"\"><span>Mr. Marias is a geologist and mining executive with over 16 years of international experience in mineral exploration, project development, and corporate leadership across the Solomon Islands, Argentina, Australia, Canada, and Alaska. He is President, CEO and Director of Argenta Silver Corp. </span><span>, which he co-founded alongside Frank Giustra and the Fiore Group. Under his leadership, Argenta raised C$60.5 million and, in its first year as a public company, was recognized among the TSX Venture 50™ 2026, ranking in the top 50 out of more than 2,000 TSXV-listed companies. He also serves as Director of Lunex Metals. Joaquin combines technical expertise with disciplined capital markets execution, building companies entirely focused on creating sustainable value for stakeholders.</span></p><p class=\"\"><em><span>Mr. Paul McNeill, P.Geo., ICD.D - Director</span></em></p><p class=\"\"><span>Mr. McNeill is currently VP Exploration for NexGold Mining Corp. </span><span>, market cap: C$515 million(1)). With 28 years of experience Mr. McNeill previously served as VP Exploration for Signal Gold expanding mineral resources and developing the Goldboro Project in Nova Scotia, Canada, VP of Anaconda Mining where he led the expansion of mineral resources and provision of mine feed for the Point Rousse Project, Newfoundland and Labrador Canada, and VP of Exploration of Aurora Energy Resources, developing uranium resources at the Michelin Project in Labrador, Canada which was acquired by Paladin Energy where he subsequently served as Principal Geologist. He has worked throughout Canada, the United States and Australia, and has developed strong technical expertise in orogenic gold deposits, grassroots exploration discovery &amp; development, including analogous deposits to the Pheasant Creek and Steiglitz Projects. He also has expertise in grassroots exploration, project development, operations, community and aboriginal engagement. Mr. McNeill is a Professional Geologist registered in the Provinces of Newfoundland and Labrador, Nova Scotia and Ontario. He holds an ICD.D designation from the Rotman School of Management at the University of Toronto, as well as degrees from Memorial University of Newfoundland and the University of New Brunswick.</span></p><p class=\"\"><em><span>Mr. Gordon Keep - Advisor</span></em></p><p class=\"\"><em><span>Mr. Rob McLeod - Advisor</span></em></p><p class=\"\"><em><span>Mr. Ryan Weymark, P.Eng. - Advisor</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Options Issuance</span></strong></p><p class=\"\"><span>The Company's Board of Directors has approved the issuance of an aggregate of 6,200,000 stock options (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Options</span></strong><span>\"), pursuant to the Company's Incentive Stock Option Plan to certain directors, officers, employees and consultants of the Company, each exercisable at C$0.20 per common share of the Company for a 10-year term. All Options will have a vesting schedule with 1/3 vesting on the date of grant, 1/3 vesting on the six-month anniversary of the date of grant, and the remaining 1/3 vesting on the 12-month anniversary of the date of grant. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Listing Application and Technical Report</span></strong></p><p class=\"\"><span>The Company has filed the Listing Application dated February 27, 2026 with the Exchange containing details of the Transaction and the Resulting Issuer, including financial information. The Listing Application is available under the Company's profile on SEDAR+ at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/rpXQpcwr4k\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>. </span></p><p class=\"\"><span>The Company has also filed a National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects</span></em><span> compliant technical report on the Steiglitz Project (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Steiglitz 43-101 Report</span></strong><span>\"). The Steiglitz 43-101 Report is also available under the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Steiglitz Project</span></strong></p><p class=\"\"><span>The Steiglitz Project is located approximately halfway between Geelong and Ballarat, about 80 km west of Melbourne in Victoria State, within one of Australia's earliest quartz-vein (hard-rock) goldfields. Victoria is the largest gold producing state in Australia, has produced 33% of all gold mined in Australia in history, and currently has 13 goldfields that have each produced over 1 million ounces of gold.(2) </span></p><p class=\"\"><span>The Steiglitz Project covers Exploration Licence (\"EL\") 6164, encompassing 53 km² across 51 graticular sections. The Steiglitz Project lies in the Bendigo Zone of the Lachlan Fold Belt, host to world-class Fosterville gold deposits. Gold mineralization at Steiglitz occurs as earlier mesozonal quartz veins overprinted by later epizonal quartz veins in tightly folded Ordovician turbidites and is expressed in two principal styles: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Numerous high-grade, gold-antimony-arsenic mineralized narrow quartz veins striking north-south parallel to regional folding; and </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stockwork zones associated with the northeast striking Hanover Fault, a mineralized shear zone bearing gold-antimony-arsenic assemblages. </span></p></li></ul><p class=\"\"><span>Both styles of deposits have evidence of epizonal orogenic mineralization due to their gold and antimony association, quartz vein textures and also due to the regional structural geology setting being due south of Agnico-Eagle's epizonal orogenic high grade Fosterville gold mine hosting 1.7 million ounces gold (Proven &amp; Probable Reserves), 1.5 million ounces gold (Measured &amp; Indicated Resources), and 1.8 million ounces (Inferred Resources) in resources.(3)</span></p><p class=\"\"><span>Steiglitz was a top-ten producer in the historic Bendigo belt, yielding approximately 250,800 oz of gold at a recovered grade of 38 g/t Au between 1855 and 1911.(4) The Steiglitz Project area includes numerous past-producing mines - Alliance, Hanover, and North Birmingham, which operated to relatively shallow depths. The deepest mine was North Birmingham with a shaft to 233m depth, while other mines were generally less than 100m depth, which makes for a set of attractive exploration drilling targets.</span></p><p class=\"\"><span>Modern exploration has included soil and rock-chip geochemistry, IP geophysics, LiDAR, limited RC and diamond drilling (5 holes), and geological mapping. Work to date highlights multiple untested targets along both the Hanover Shear Zone and the north-south vein corridor, with strong gold-arsenic-antimony signatures typical of the region's premier gold systems.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Pheasant Creek Project</span></strong></p><p class=\"\"><span>In addition to the Steiglitz Project, as part of the Transaction, the Company has an application for an exploration license on the Pheasant Creek Project, which is not a material property for the Company. The Pheasant Creek Project is located approximately 75 km northeast of Melbourne in Victoria State, Australia. The large 232 km2 project is comprised of Exploration Licence 008776. The Pheasant Creek Project occurs within the Melbourne Zone of the Lachlan Fold Belt, which is composed of Siluro-Devonian sediments and Mid-Devonian granitic intrusions. The Pheasant Creek Project lies immediately south of, and in similar geology to, the Sunday Creek discovery of Southern Cross Gold (market capitalization: C$2.8 billion(1)), which is an outcropping orogenic or epizonal dyke-hosted deposit. Southern Cross has drilled 220 holes over 97,553m (as at August 31, 2025) and is allocating A$60 million over a 200,000m drill program to the Sunday Creek Project. At Sunday Creek, there are 75 intersections &gt;50-100 g/t AuEq x width in metres and 70 individual intersections exceeding 100 g/t AuEq x metres, which are globally leading hit rates (as at August 31, 2025).(5) </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:663.0857142857143px;aspect-ratio:1.1051428571428572\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" style=\"background-color:#faf0e2\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 1 - Crossroads Projects Map</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:663.0857142857143px;aspect-ratio:1.1051428571428572\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-1c293bc4ee70846b49369b79cf336bf1-resized.webp\" style=\"background-color:#faf0e2\"/></picture></div></button></figure><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:568.1118881118881px;max-width:1200px;aspect-ratio:2.112259970457903\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" style=\"background-color:#e4e5e0\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 2 - Regional Map of Victoria, Australia</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:568.1118881118881px;max-width:1200px;aspect-ratio:2.112259970457903\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-f99cce597d8aa787333dc0545b2db60b-resized.webp\" style=\"background-color:#e4e5e0\"/></picture></div></button></figure><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:805.1703877790835px;aspect-ratio:1.3419506462984725\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" style=\"background-color:#ebe9e5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 3 - Regional Map near Crossroads' Projects</span></strong></p><p class=\"\"><span>To view an enhanced version of this graphic, please visit:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:805.1703877790835px;aspect-ratio:1.3419506462984725\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tmx_newsfile:ef9a87ff4094b-09b59218e74f3c7ced1f9c063884af1c-resized.webp\" style=\"background-color:#ebe9e5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Fiore Group</span></strong></p><p class=\"\"><span>The Fiore Group is a Vancouver-based private investment firm founded and led by Frank Giustra, focused on building and supporting high-potential companies in mining, resource development and strategic investments. The firm has played a key role in the growth of companies including, NexGold, Argenta Silver, Copper Giant, Aris Gold, Nations Royalty, Cambria Gold, Selkirk Copper and West Red Lake Gold Mines. Backed by deep capital markets expertise and a disciplined, Fiore partners with exceptional management teams to scale companies and create long-term value.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Crossroads</span></strong></p><p class=\"\"><span>Crossroads is a Canadian gold exploration company backed by the Fiore Group and focused on high-potential gold projects within two hours' drive from Melbourne in Victoria State, Australia-one of the world's premier gold-producing jurisdictions. The Company aims to deliver new gold discoveries in a Tier-1 jurisdiction while generating long-term value for shareholders. Crossroads' portfolio includes the historic Steiglitz Project, a historical high-grade producer within the renowned Bendigo Gold Belt.</span></p><p class=\"\"><span>The Steiglitz Project is largely underexplored with modern technology and situated in highly prospective geological belts with proven potential for epizonal and mesozonal orogenic gold systems. Crossroads is led by an experienced management and technical team with deep Australian and global discovery expertise. Crossroads is supported by excellent infrastructure, year-round access, and a stable regulatory framework to systematically advance its projects with modern exploration and drilling aimed at unlocking meaningful gold discoveries.</span></p><p class=\"\"><span>Crossroads is committed to responsible resource development, proactive and open communication, and transparent and inclusive dialogue with regional communities, indigenous organizations and all stakeholders. Crossroads is committed to proactive decision-making and creating economic opportunities for all stakeholders, including the communities it operates in. </span></p><p class=\"\"><span>(1) Source: TMX Group. Market capitalization in C$ as at February 24, 2026.</span></p><p class=\"\"><span>(2) Source: Resources Victoria (link here).</span></p><p class=\"\"><span>(3) Source: Agnico-Eagle website (accessed January 5, 2026), based on Mineral Reserves and Mineral Resource data (as at December 31, 2024).</span></p><p class=\"\"><span>(4) Source: Lisitsin, V., Olshina, A., Moore, D.H. &amp; Willman, C.E., 2007. Assessment of undiscovered mesozonal orogenic gold endowment under cover in the northern part of the Bendigo Zone. GeoScience Victoria Gold Undercover Report 2. Department of Primary Industries.</span></p><p class=\"\"><span>(5) Source: Southern Cross Gold public disclosure and website (accessed January 5, 2026): (link here).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qualified Person</span></strong></p><p class=\"\"><span>The scientific and technical information contained in this news release was reviewed and approved by Mr. Andrew Hamilton, P.Geo. who is a \"Qualified Person\" (as defined in National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects</span></em><span>). Mr. Hamilton is independent of the Company in accordance with National Instrument 43-101 - </span><em><span>Standards of Disclosure for Mineral Projects </span></em><span>and has not visited the properties discussed in this disclosure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On behalf of the Board of Directors of Crossroads,</span></strong></p><p class=\"\"><span>Mr. Neil (Rex) Motton</span></p><p class=\"\"><span>CEO &amp; Director</span></p><p class=\"\"><span>Crossroads Gold Corp.</span></p><p class=\"\"><span>Email: investors@crossroadsgold.com</span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></em></p><p class=\"\"><em><span>Certain statements and information herein, including all statements that are not historical facts, contain forward looking statements and forward-looking information within the meaning of applicable securities laws. Such forward looking statements or information include but are not limited to statements or information with respect to: the business plans of the Company. With respect to forward-looking statements and information contained herein, the Company and Crossroads have made numerous assumptions including among other things, assumptions about general business and economic conditions. The foregoing list of assumptions is not exhaustive. Although management of the Company and Crossroads believe that the assumptions made and the expectations represented by such statements or information are reasonable, there can be no assurance that forward-looking statements or information herein will prove to be accurate. Forward-looking statements and information by their nature are based on assumptions and involve known and unknown risks, uncertainties and other factors which may cause actual results, performance or achievements, or industry results, to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements or information. These factors include, but are not limited to: risks associated with the business of Crossroads given its limited operating history; business and economic conditions in the mineral industry generally; the supply and demand for labour and other project inputs; risks relating to unanticipated operational difficulties (including unanticipated events related to mineral exploration); changes in general economic conditions or conditions in the financial markets; changes in the price of gold and currency exchange; and other risk factors as detailed from time to time. The Company does not undertake to update any forward-looking information, except in accordance with applicable securities laws. </span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:ef9a87ff4094b:0-crossroads-gold-completes-acquisition-of-the-steiglitz-gold-project-in-australia-announces-anticipated-trading-date-and-provides-corporate-and-leadership-update/",
            "pub_date": "2026-02-28 08:41:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:b2de848cb094b:0",
            "title": "RETRANSMISSION: Early Warning News Release",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This press release is issued pursuant to Multilateral Instrument 62-104 - </span><em><span>Take-Over Bids and Issuer Bids</span></em><span> and National Instrument 62-103 - </span><em><span>The Early Warning System and Related Take-Over Bid and Insider Reporting Issues</span></em><span>.</span></p><p class=\"\"><span>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - Mr. Ryan Kalt (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Acquiror</span></strong><span>\") reports that he has divested certain securities of Red Lake Gold Inc. (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Issuer</span></strong><span>\"), on an indirect basis, as represented by the sale of 1,562,000 common shares (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Divested Securities</span></strong><span>\"), during the inclusive period of February 26, 2026 to February 27, 2026 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Sale Period</span></strong><span>\"). Within said Sale Period, a sub-total of 1,117,000 common shares were sold today, resulting in the herein referenced Form 62-103F1 and this related news release.</span></p><p class=\"\"><span>In the direct and indirect aggregate, the Acquiror now owns and controls 19,868,500 common shares of the Issuer, representing approximately 39.31% of the Issuer's outstanding common shares, alongside certain other convertible instruments (being common share warrants and common share stock options), all of the same being further described and hereby referenced through the Form 62-103F1 filed today (on SEDAR+) involving this disclosure.</span></p><p class=\"\"><span>The Divested Securities represented approximately 3.09% of the outstanding common shares of the Issuer (based on the Issuer having 50,539,169 common shares issued as at the date hereof).</span></p><p class=\"\"><span>The Divested Securities were sold in the Sale Period through open-market facilities of the Canadian Securities Exchange (the \"</span><strong class=\"root-Tkn6WL2y\"><span>CSE</span></strong><span>\"), or other broker-routed market, at an average sale price of $0.02 per common share.</span></p><p class=\"\"><span>The Acquiror may sell securities of the Issuer either on the open market or through private dispositions in the future or may acquire securities of the Issuer either on the open market or through private acquisitions in the future depending upon market conditions, the Acquiror's investment objectives and/or other relevant factors. Other than the foregoing and/or as publicly filed, the Acquiror does not have plans or any future intentions which relate to or would result in any of the other foregoing matters.</span></p><p class=\"\"><em><span>\"Ryan Kalt\"</span></em></p><p class=\"\"><span>Ryan Kalt</span></p><p class=\"\"><span>The Form 62-103F1 - </span><em><span>Required Disclosure</span></em><span> </span><em><span>under the Early Warning Requirements </span></em><span>associated with this news release can be obtained from SEDAR+ at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/3KkDoUe4pR\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>. In the alternative, to obtain a copy of the report, please contact Mr. Kalt at 1.403.454.2984.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The CSE has not reviewed, approved or disapproved the contents of this press release.</span></strong></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:b2de848cb094b:0-retransmission-early-warning-news-release/",
            "pub_date": "2026-02-28 08:44:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN28A:0",
            "title": "Arrest of Western Australia man over alleged terror plot 'deeply shocking', PM Albanese says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Australian Prime Minister Anthony Albanese said Friday's arrest of a Western Australian man over an alleged terror plot targeting mosques, police and a parliament building was \"deeply shocking\". </span></p><p class=\"\"><span>The 20-year-old from the town of Bindoon about 63 km (39 miles) north of state capital Perth was later charged by police with planning a terrorist act. Police said the man had written a manifesto with plans for a mass casualty event and that he wanted to attack mosques, Western Australia's police headquarters and Parliament House. </span></p><p class=\"\"><span>Albanese said on X late on Friday: \"The arrest of a WA man over an alleged racially-motivated terrorist plot is deeply shocking.\"</span></p><p class=\"\"><span>\"Allegations the man was planning to target the Muslim community through attacks on mosques - as well as attacks on the WA police and parliament - are particularly distressing. He should face the full force of the law,\" Albanese said. </span></p><p class=\"\"><span>The arrest is the latest in a series of incidents in Australia classified as terrorism, including an attempt on January 26 to bomb a rally in Perth that was protesting against the country's national day. </span></p><p class=\"\"><span>In December, two gunmen attacked a Hanukkah celebration at Sydney's Bondi Beach, killing 15 in Australia's deadliest massacre in nearly 30 years. Authorities believe the pair were inspired by Islamic State, the Sunni Muslim militant group.     </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN28A:0-arrest-of-western-australia-man-over-alleged-terror-plot-deeply-shocking-pm-albanese-says/",
            "pub_date": "2026-02-28 08:36:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0acdabe035fb3:0",
            "title": "Delta Air Lines CEO Sells 100,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delta Air Lines Chief Executive Officer, Edward H Bastian, sold 100,000 shares of common stock on February 26, 2026, at a weighted average price of $70.257 per share, totaling $7,025,700. Following the transaction, Bastian directly owns 1,363,448 shares of the company.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Bastian Edward H</span></td></tr><tr><td><span>Relationship</span></td><td><span>Chief Executive Officer</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$7,025,700</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1289878/000168316826001373/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1289878/000168316826001373/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">DELTA AIR LINES, INC. [ DAL ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0acdabe035fb3:0-delta-air-lines-ceo-sells-100-000-shares/",
            "pub_date": "2026-02-28 08:40:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSvB5P1a:0",
            "title": "Electronic Caregiver Advances the Rio Grande Health Technology Corridor, Positioning Las Cruces as a National AI Healthcare Infrastructure Hub",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>LAS CRUCES, NM / ACCESS Newswire / February 27, 2026 / Electronic Caregiver, Inc., a nationally deployed AI-driven healthcare infrastructure company headquartered in Las Cruces, announced continued expansion of its operations as part of its long-term vision to build the Rio Grande Health Technology Corridor.</span></p><p class=\"\"><span>While New Mexico has long been recognized for its national laboratories and aerospace programs, it has not historically produced a nationally scaled, consumer-integrated AI healthcare technology platform.</span></p><p class=\"\"><span>Electronic Caregiver is changing that.</span></p><p class=\"\"><span>The company's Addison Care platform delivers continuous AI-driven healthcare engagement into the home, integrating remote patient monitoring, TeleCare operations, longitudinal data management, payer reimbursement alignment, and family caregiver support across multiple states nationwide.</span></p><p class=\"\"><span>Unlike research institutions or niche aerospace ventures, Electronic Caregiver operates as a recurring-revenue commercial enterprise serving patients, clinics, home care networks, and payers across the United States.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Building the Rio Grande Health Technology Corridor</span></strong></p><p class=\"\"><span>Electronic Caregiver is actively expanding its footprint across Southern New Mexico, with strategic plans to grow patient monitoring, TeleCare, logistics, and technology operations from Las Cruces to Roswell over the next 12 to 18 months.</span></p><p class=\"\"><span>This initiative, referred to internally as the Rio Grande Health Technology Corridor, is designed to establish Southern New Mexico as a nationally recognized AI healthcare infrastructure hub.</span></p><p class=\"\"><span>The expansion includes high-skill, high-wage roles across a broad range of disciplines, including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Advanced software engineering</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Artificial intelligence and machine learning</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Information technology and cloud architecture</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Computer vision and edge computing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>IoT architectures and device orchestration</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mixed reality and user experience design</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biomechanics and physiological biometric monitoring</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Health network integration and microservices infrastructure</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Full-stack TeleCare operations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nursing and clinical support</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Scientific and clinical research</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payer and compliance infrastructure</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Hardware and device lifecycle management</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Complex logistics and national fulfillment</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Commercial, consumer, and medical sales</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Award-winning digital marketing and media production</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sophisticated customer service operations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Diverse accounting and financial systems</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Intellectual property development</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Internal capital formation</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Human resources and workforce development</span></p></li></ul><p class=\"\"><span>The company operates across disciplines that include cloud computing, LLM integration, data architecture and management, health interoperability frameworks, and real-world longitudinal engagement analytics.</span></p><p class=\"\"><span>Silicon Valley-Level Opportunity in Southern New Mexico</span></p><p class=\"\"><span>Electronic Caregiver currently employs hundreds of staff members and continues to expand hiring across technical, clinical, operational, and commercial functions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chief Executive Officer Anthony Dohrmann</span></strong><span> stated:</span></p><p class=\"\"><span>\"Our goal is to build the first nationally and globally recognized commercial and health technology brand organically founded and headquartered in Las Cruces, New Mexico. As New Mexico's second largest city, neighboring El Paso, Texas, we see a tremendous opportunity to expand operations throughout the border region. Over the coming 12 to 18 months, we are working to strengthen patient monitoring and TeleCare operations from Las Cruces to Roswell, reinforcing the entire southern portion of the state. We are bringing Silicon Valley-level employment opportunities to fertile labor markets built on hard work ethic, sound culture, and ambitious individuals who value their hometown roots.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A National AI Healthcare Infrastructure Platform</span></strong></p><p class=\"\"><span>Electronic Caregiver's platform integrates consumer-facing AI engagement with healthcare reimbursement models, enabling daily adherence support, early identification of health status changes, safety and security monitoring, and longitudinal care oversight.</span></p><p class=\"\"><span>The company has completed over 100 pilot deployments across multiple verticals, secured national payer taxonomy approvals, and continues to scale patient engagement nationwide.</span></p><p class=\"\"><span>Electronic Caregiver partners alongside major global technology leaders while maintaining platform independence and operational control, positioning itself as a durable infrastructure layer in the evolving AI-first healthcare ecosystem.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>From Research Economy to Scalable Infrastructure</span></strong></p><p class=\"\"><span>New Mexico has long exported scientific research and engineering talent. The Rio Grande Health Technology Corridor represents a shift toward retaining and scaling that talent within a nationally recognized commercial AI healthcare enterprise.</span></p><p class=\"\"><span>Electronic Caregiver's continued expansion signals a new chapter for the state: the emergence of a founder-led, nationally deployed AI healthcare infrastructure platform organically founded and headquartered in Southern New Mexico.</span></p><p class=\"\"><span>Scalable Research, Workforce Development, and Certification Pathways</span></p><p class=\"\"><span>The majority of Electronic Caregiver's workforce are graduates of New Mexico State University. Over the past 15 years, the company has maintained a sustained collaborative relationship with the university, contributing to both research development and the cultivation of a high-skill regional workforce.</span></p><p class=\"\"><span>In addition to published scientific research and applied health technology initiatives, Electronic Caregiver partnered with NMSU to develop an Advanced TeleCare Care Coach certification curriculum, now officially offered to students. The program prepares graduates for high-skill roles in virtual care operations, remote patient engagement, longitudinal care coordination, and AI-assisted clinical support.</span></p><p class=\"\"><span>This formalized pathway bridges academic training with real-world healthcare infrastructure deployment, creating a direct pipeline from university education into nationally scaled TeleCare operations.</span></p><p class=\"\"><span>By aligning advanced healthcare engineering, applied research, and structured workforce certification, Electronic Caregiver is demonstrating that nationally competitive AI and health technology infrastructure can be built, staffed, and scaled from Las Cruces.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Electronic Caregiver</span></strong></p><p class=\"\"><span>Electronic Caregiver, Inc. Founded in 2009, is a New Mexico-based healthcare technology company delivering AI-driven continuous care infrastructure through its Addison Care platform. The company integrates remote patient monitoring, TeleCare operations, longitudinal data management, reimbursement pathways, and consumer engagement to extend care into the home across the United States.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact</span></strong></p><p class=\"\"><span>media@ecg-hq.com</span></p><p class=\"\"><span>(575) 649-7808</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Electronic Caregiver, Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSvB5P1a:0/",
            "pub_date": "2026-02-28 08:40:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_TnwsJkN5:0",
            "title": "Noble Announces Results of 2026 Shareholder Meeting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>TORONTO, February 27, 2026 –TheNewswire - Noble Mineral Exploration Inc. (\"Noble\" or the \"Company\") </span><span> (OTCQB: NLPXF) is pleased to announce theresults of its Annual General and Special Meeting of shareholders heldon February 26, 2026. (the “AGM”). At the AGM, the shareholdersapproved: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-election of management’s nominees to the Boardof Directors, namely: J. Birks Bovaird, Yvan Champagne, MichaelNewbury, Samuel Peralta, and H. Vance White (each director beingelected with over 99% of votes cast);  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-appointment of MNP LLP as the Company’sauditor for the upcoming year, and also authorized the directors tofix the renumeration of the auditors (approved by over 99% of votescast);   </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the re-approval of the Amended and Restated 2022 EquityIncentive Plan of the Company (approved by over 99% of votes cast);and </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>the approval of the Shareholder Rights Plan of theCompany (approved by over 99% of votes cast).          </span></p></li></ul><p class=\"\"><span>Following the AGM, the Board of Directors re-appointedthe officers of the Company to the positions they previously held. In addition, the Board confirmed that the Audit Committee wouldcontinue to be comprised of Michael Newbury (Chair), J. Birks Bovairdand Yvan Champagne, and the ESG, Nominating and Compensation Committeewill be comprised of J. Birks Bovaird (Chair), Michael Newbury andSamuel Peralta.</span></p><p class=\"\"><span>About</span><br/><span>Noble Mineral Exploration Inc.:</span><br/></p><p class=\"\"><br/><span>Noble Mineral Exploration Inc. is a Canadian-based</span><br/><span>junior exploration company, which has holdings of securities in Canada</span><br/><span>Nickel Company Inc., Homeland Nickel Inc., East Timmins Nickel Inc.</span><br/><span>(20%), and its interest in the Holdsworth gold exploration property in</span><br/><span>the area of Wawa, Ontario.</span><br/></p><p class=\"\"><br/><span>Noble holds mineral and/or exploration rights in</span><br/><span>~70,000ha in Northern Ontario and ~24,000ha elsewhere in Quebec upon</span><br/><span>which it plans to generate option/joint venture exploration programs.</span><br/><span> Noble holds mineral rights and/or exploration rights in 18,000</span><br/><span>hectares in the Timmins-Cochrane areas of Northern Ontario known as</span><br/><span>Project 81, ~2,215 hectares in Thomas Twp/Timmins, as well as an</span><br/><span>additional 20% interest in ~38,700 hectares in the Timmins area held</span><br/><span>by East Timmins Nickel. Project 81 hosts diversified drill-ready gold,</span><br/><span>nickel-cobalt and base metal exploration targets at various stages of</span><br/><span>exploration. Noble also holds ~4,600 hectares in the Nagagami</span><br/><span>Carbonatite Complex and its ~3,200 hectares in the Boulder Project</span><br/><span>both near Hearst, Ontario. ~3,700 hectares in the Buckingham Graphite</span><br/><span>Property, ~10,152 hectares in the Havre St Pierre Nickel, Copper, PGM</span><br/><span>property, and ~1,573 hectares in the Cere-Villebon Nickel, Copper, PGM</span><br/><span>property, ~569 hectare Uranium/Rare Earth property (Chateau), ~461</span><br/><span>hectare Uranium/Molybdenum property (Taser North), ~4,465 hectares REE</span><br/><span>Mehmet Property, and the ~3300 hectare Gull Lake REE Property all of</span><br/><span>which are in the Province of Quebec and the ~ 647 hectare  Chapiteau</span><br/><span>REE property in Labrador.</span><br/></p><p class=\"\"><br/><span>https://www.noblemineralexploration.com</span></p><p class=\"\"><span>Noble’s common shares trade on theTSX Venture Exchange under the symbol “NOB”.</span></p><p class=\"\"><span>Cautionary Statement:</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor itsRegulation Services Provider (as that term is defined in the policiesof the TSX Venture Exchange) accepts responsibility for the adequacyor accuracy of this release. No stock exchange,securities commission or other regulatory authority has approved ordisapproved the information contained herein.</span></p><p class=\"\"><span>Contacts:</span></p><p class=\"\"><span>H. Vance White, President</span></p><p class=\"\"><span>Phone:        416-214-2250</span></p><p class=\"\"><span>Fax:        416-367-1954</span></p><p class=\"\"><span>Email:        info@noblemineralexploration.com</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_TnwsJkN5:0-noble-announces-results-of-2026-shareholder-meeting/",
            "pub_date": "2026-02-28 08:40:02",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3YX006:0",
            "title": "Taiwan markets closed on Friday for a holiday",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Taiwan's financial markets are closed on Friday, February 27, for a holiday, and will resume trade on Monday, March 2.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3YX006:0-taiwan-markets-closed-on-friday-for-a-holiday/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:24fcb9ad43eed:0",
            "title": "Ichor Holdings CEO Sells 21,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Philip Ryan Barros Sr., Chief Executive Officer and Director of Ichor Holdings, Ltd., sold 21,000 ordinary shares at a weighted average price of $46.63 per share, totaling $979,230. Following the transaction, Barros directly owns 153,936 ordinary shares of the company. The sale occurred on February 26, 2026.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Barros Philip Ryan Sr.</span></td></tr><tr><td><span>Relationship</span></td><td><span>Chief Executive Officer</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$979,230</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">ICHOR HOLDINGS, LTD. [ ICHR ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:24fcb9ad43eed:0-ichor-holdings-ceo-sells-21-000-shares/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3XL04M:0",
            "title": "HHS Secretary Kennedy Appoints Two Physicians To CDC's Advisory Committee On Immunization Practices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KENNEDY APPOINTS TWO PHYSICIANS TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SEAN G. DOWNING AND ANGELINA FARELLA APPOINTED TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES- HHS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3XL04M:0-hhs-secretary-kennedy-appoints-two-physicians-to-cdc-s-advisory-committee-on-immunization-practices/",
            "pub_date": "2026-02-28 08:12:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}