{
    "data": [
        {
            "id": "DJN_DN20250205002933:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0450 ET - Base metal prices are mixed, with LME three-month copper flat at $9,174 a metric ton and LME three-month aluminum down 0.5% at $2,615 a ton. Metal prices rebounded on-week as the U.S. pushed back Canadian and Mexican tariffs one month, but trade tensions and global growth risks are still pressing, RBC Capital Markets' Sam Crittenden says. The U.S. imposed another Chinese import tariff of 10%, while China retaliated with fresh levies, including critical mineral export restrictions. President Trump and China's President Xi will talk over the coming days and U.S. tariffs won't be implemented until Feb. 10, so they could strike a deal before implementation, Crittenden writes. Tariff uncertainty has prompted a significant disconnect between LME and U.S. commodities exchange Comex copper pricing, with the market factoring in more potential trade disputes, the analyst adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0337 ET - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">1828 ET - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1711 ET - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">1252 ET - Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p><p class=\"\">1149 ET - Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p><p class=\"\">1141 ET - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1010 ET - Lean hog futures on the CME are higher in early trading, with the most-active contract up 0.8%. Traders appear to be pulling back from the steep selling seen to start the week, with contract limits in today's session extended to 6 cents a pound after the limit-down close Monday, following a drop of 4 cents a pound. While the hog market recalibrates amid tariff turmoil, there exists fundamental pressure points for hog demand. Pork carcass cutout prices shed 94 cents per hundredweight on Monday, according to USDA data, following a strong start to 2025 pricewise. Live cattle futures are down 0.2%. (kirk.maltais@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002933:0/",
            "pub_date": "2025-02-05 17:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002932:0",
            "title": "Base Metal Prices Mixed as Trade Tensions Continue to Unnerve Market — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Base metal prices are mixed, with LME three-month copper flat at $9,174 a metric ton and LME three-month aluminum down 0.5% at $2,615 a ton. Metal prices rebounded on-week as the U.S. pushed back Canadian and Mexican tariffs one month, but trade tensions and global growth risks are still pressing, RBC Capital Markets' Sam Crittenden says. The U.S. imposed another Chinese import tariff of 10%, while China retaliated with fresh levies, including critical mineral export restrictions. President Trump and China's President Xi will talk over the coming days and U.S. tariffs won't be implemented until Feb. 10, so they could strike a deal before implementation, Crittenden writes. Tariff uncertainty has prompted a significant disconnect between LME and U.S. commodities exchange Comex copper pricing, with the market factoring in more potential trade disputes, the analyst adds. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002932:0/",
            "pub_date": "2025-02-05 17:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446721:0",
            "title": "UK Private Sector Activity Growth Revised Down",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global UK Composite PMI rose to 50.6 in January of 2025 from 50.4 in the previous month, recovering from a 14-month low, revised lower from the preliminary estimate of 50.9 but ahead of the initial market expectations of no expansion at 50.</p><p class=\"\">The reading pointed to two consecutive years of expansion in British private sector activity, solely carried by service providers during January (50.8 vs 51.1 in December of 2024), which offset a slower contraction for manufacturers (48.3 vs 47).</p><p class=\"\">Still, new work at the aggregate level fell at the fastest pace since 2023, with companies citing poor underlying demand as clients limited non-essential spending.</p><p class=\"\">Consequently, job shedding at the aggregate level was the steepest since the global financial crisis more than 15 years ago, when excluding the momentary pandemic shock.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446721:0-uk-private-sector-activity-growth-revised-down/",
            "pub_date": "2025-02-05 17:51:08",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463932:0",
            "title": "Fredun Pharmaceuticals' Net Profit Rises in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fredun Pharmaceuticals'  net profit rose to 53.3 million Indian rupees in the fiscal third quarter from 42.2 million rupees a year ago, according to a BSE filing on Tuesday by the pharmaceutical company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 11.29 rupees from 8.99 rupees a year earlier. </p><p class=\"\">Income from operations in fiscal Q3 jumped year on year to 1.02 billion rupees from 866.5 million rupees, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463932:0/",
            "pub_date": "2025-02-05 17:51:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW01P:0",
            "title": "Everest’s AM Best ratings unchanged after $1.7bn reserve strengthening",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - AM Best has said Everest’s $1.7bn reserve strengthening for year-end 2024 is not expected to have a material impact on the Bermudian’s risk-adjusted capitalization as the agency said its A+ financial strength and 'aa-' long-term issuer credit ratings remain unchanged.</p><p class=\"\">Everest announced the record reserve charge on in late January ahead of its Q4 and full year 2024 earnings.</p><p class=\"\">In a statement, the firm noted that the reserve strengthening primarily reflects unfavourable loss trends in its US casualty business, including on more recent accident years.</p><p class=\"\">It added that its analysis shows that Everest’s operating performance trends remain “in line” with other companies assessed at the “adequate” level on a five-year basis, including the impact of the reserve actions.</p><p class=\"\">“Management has already implemented initiatives to improve underwriting and reserving trends going forward, which could result in a decline in top line premium. However, AM Best does not anticipate that this will have a material impact on the current business profile assessment of Everest,” the note continued.</p><p class=\"\">AM Best said it recognises that social inflation trends – and to a lesser extent economic inflation – have driven reserve development across the US casualty (re)insurance market for the past several calendar years.</p><p class=\"\">“That trend appears likely to continue for the foreseeable future, as there are no clear signs suggesting any dissipation of key factors that are currently promoting social inflation,” it continued.</p><p class=\"\">The ratings agency said it will continue to monitor Everest’s reserve adequacy and overall profitability following the reserve charge and ongoing underwriting actions to improve the performance of its casualty book.</p><p class=\"\">It added that should the (re)insurer have to take additional, material reserve strengthening in the near to medium term, AM Best could revisit the potential impact on Everest’s ratings.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW01P:0-everest-s-am-best-ratings-unchanged-after-1-7bn-reserve-strengthening/",
            "pub_date": "2025-02-05 17:51:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0DZ:0",
            "title": "COMMENT-Gold is the new king of currencies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Gold has surged to a record high this month and for the time being is the new king of currencies.</p><p class=\"\">While it is unlikely gold can usurp the dollar altogether, it has certainly far outperformed the greenback since the shock investors received when they piled into the greenback in 2022.</p><p class=\"\">In that year demand was so great that investment in the dollar became overcrowded, resulting in an abrupt reversal. While the dollar has risen again it has been far surpassed by gold.</p><p class=\"\">The greenback which reached its highest point since 2006 in January - highest for available data - has risen roughly 6% from 2022's low, but is only around 1% above 2022's peak.</p><p class=\"\">Gold has rocketed from just above $1600/oz in October 2022 toward $2900/oz this month has virtually doubled in the same period.</p><p class=\"\">This stratospheric rise could be the result of changes in foreign exchange reserves where central banks are seeking ways to mitigate risks stemming from a reserve currency that is booming even when the U.S. is at the epicentre of concerns. </p><p class=\"\">That is the case now with investors fretting over the policies of the new Trump administration, and was also the case during the U.S. banking crisis in 2023 and the global financial crisis in 2008.</p><p class=\"\">Many of the nations with the largest reserves that may be subject to change are politically opposed to the United States. Should they refocus on a more durable and liquid asset that is supported by a big economy, like China's yuan, the shift from the dollar could be much more significant.     </p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0DZ:0-comment-gold-is-the-new-king-of-currencies/",
            "pub_date": "2025-02-05 17:51:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463934:0",
            "title": "Market Chatter: Toyota Eyes 2027 Start of Lexus Production in Shanghai",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  is planning to set up a fully-owned company in Shanghai to develop and manufacture electric vehicles and batteries for its Lexus brand, Reuters reported Wednesday. </p><p class=\"\">Production is slated to begin in 2027, with an initial annual output of about 100,000 units, according to the report. </p><p class=\"\">The Japanese carmaker is also teaming up with the Shanghai municipal government on carbon-neutral initiatives to help support China's 2060 carbon neutrality goal, Reuters wrote. </p><p class=\"\">Toyota Motor shares closed 3% higher Wednesday. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463934:0/",
            "pub_date": "2025-02-05 17:51:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463928:0",
            "title": "Market Chatter: CK Asset to Launch Five Projects in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CK Asset  plans to open five projects with more than 2,500 units in 2025, The Standard reported Wednesday. </p><p class=\"\">Among the developments which CK Asset will launch include Blue Coast Phases 1 and 2 in Wong Chuk Hang, Phase 2 of 21 Borrett Road in Mid-Levels, Victoria Blossom in Kai Tak, the Kam Tai Road project in Yuen Long, and a joint project with the Urban Renewal Authority in To Kwa Wan, according to The Standard. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463928:0/",
            "pub_date": "2025-02-05 17:51:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002937:0",
            "title": "Alphabet Capex Guidance Worries Investors — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet's capital-expenditures target for the year raises fears among investors that the Google owner might be wasting money, AJ Bell's Dan Coatsworth writes in a note to clients. Alphabet Chief Executive Sundar Pichai said the group expects to invest roughly $75 billion in capex this year. Investors would have welcomed large capex in the past as a sign that Alphabet was doing everything in its power to cash in on the AI frenzy, Coatsworth says. \"Now the reverse is true,\" he says. \"There are fears it might be digging itself a big hole and potentially wasting money if rivals like DeepSeek have shown it is possible to do things a lot cheaper.\" Alphabet shares are down 7.5% premarket at $190.91. (mauro.orru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002937:0/",
            "pub_date": "2025-02-05 17:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463929:0",
            "title": "Daiwa Securities Group's Nine Month Profits Jumps 52%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Daiwa Securities Group  posted a 51.8% year-on-year increase in profit attributable to owners of the parent to 124.4 billion yen in the fiscal first quarter ended Dec. 31, 2024 from nearly 82.0 billion yen a year ago as higher revenue were boosted by share of profit of entities accounted for using the equity method. </p><p class=\"\">The investment bank's earnings per share (EPS) rose to 86.80 yen from 56.32 yen a year ago, according to a Tokyo Stock Exchange filing on Wednesday. </p><p class=\"\">Operating revenue grew 13.4% to 1.026 trillion yen from 905.5 billion yen a year earlier. </p><p class=\"\">It expects to pay a total annual dividend of 44 per share for the current year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463929:0/",
            "pub_date": "2025-02-05 17:53:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002943:0",
            "title": "XRP Price Rises, But Bitcoin Falls. Why the Crypto Could Dive to $80,000. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By George Glover</p><p class=\"\">XRP and Bitcoin were moving in different directions Wednesday as U.S. President Donald Trump's trade war with China sapped the market's risk appetite. Crypto investors should brace for losses if the uncertainty drags on.</p><p class=\"\">XRP, which is used to settle and facilitate transactions on Ripple Labs' digital-payments platform, climbed 2.5% to $2.51 in early trading, according to data from the crypto exchange Kraken. Other so-called altcoins were also rising — Ethereum gained 5%, Solana added 0.5%, and Dogecoin was up 3.2% to just under 27 cents.</p><p class=\"\">But Bitcoin, the world's largest token in terms of total market capitalization, slid 1% to $97,695. Its losses likely reflect the fact that institutional investors, who might have some exposure to the token but probably don't hold any other digital assets, still don't know what to make of escalating trade tensions. After Trump hiked taxes on Chinese imports by 10% over the weekend, Beijing hit back with levies of its own.</p><p class=\"\">The uncertainty plaguing markets in general could weigh on Bitcoin \"as traders derisk their portfolios in anticipation of further trade war developments,\" OKX Global Chief Commercial Officer Lennix Lai said late Tuesday. He added that market indicators including derivatives positioning and exchange flows signaled that the world's largest crypto could tumble to $80,000 — implying an 18% drop from its current level.</p><p class=\"\">Write to George Glover at george.glover@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002943:0/",
            "pub_date": "2025-02-05 17:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463931:0",
            "title": "RC Fornax Starts Trading on London Bourse's AIM, Raises GBP6 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RC Fornax  started trading on the AIM segment of the London bourse on Wednesday, with a market capitalization of 18.2 million pounds sterling, according to a same-day filing. </p><p class=\"\">The British engineering consultancy company's listing follows its recently concluded share placing of 15,846,153 new ordinary shares and 3,078,457 existing ordinary shares at 0.3250 pound apiece, which raised a total of 6.2 million pounds. Cavendish Capital Markets served as the broker for the placing transactions. </p><p class=\"\">Proceeds are earmarked for business expansion, additional product development, sales and marketing activities, improved engineering and training services, as well as for general working capital purposes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463931:0/",
            "pub_date": "2025-02-05 17:55:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW154:0",
            "title": "Toyota Motor Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Toyota Motor Corp  reported quarterly adjusted earnings of JPY165.80​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of JPY100.61.  The mean expectation of four analysts for the quarter was for earnings of JPY93.94 per share. Wall Street expected results to range from JPY75.69  to JPY114.45 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 2.9% to JPY12.39 trillion from a year ago; analysts expected JPY11.99 trillion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Toyota Motor Corp's reported EPS for the quarter was JPY165.80​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of JPY2.19 trillion.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Toyota Motor Corp shares had fallen by 8.7% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 3.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 18 \"strong buy\" or \"buy,\" 7 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the auto &amp; truck manufacturers peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Toyota Motor Corp is JPY3,300.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 09:55 a.m. UTC. ​All figures in yen unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.42 trillion</p></td><td><p class=\"\">1.22 trillion</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.24 trillion</p></td><td><p class=\"\">1.16 trillion</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.35 trillion</p></td><td><p class=\"\">1.31 trillion</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">747.31 billion</p></td><td><p class=\"\">1.11 trillion</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW154:0-toyota-motor-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 17:55:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:982038495094b:0",
            "title": "Bybit registers with Indian regulator, settles monetary fine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bybit crypto exchange has successfully registered with India’s financial regulator following its previous compliance issues in the country.</p><p class=\"\">Bybit has successfully registered with India’s Financial Intelligence Unit (FIU), according to a Feb. 5 announcement shared with Cointelegraph.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1080.4878048780488px;aspect-ratio:1.8008130081300815\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:982038495094b-c9ca8706dbb6e7601af4a8c30b7bbdb1-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:982038495094b-c9ca8706dbb6e7601af4a8c30b7bbdb1-resized.jpeg\" style=\"background-color:#231d11\"/></picture></div></figure></span></p><p class=\"\">As part of its ongoing compliance efforts, Bybit has settled the monetary fine related to its prior regulatory issues, according to the announcement, which added:</p><div class=\"blockquote-xrkxvh37\">“We have been working diligently with the FIU-IND to address their concerns and ensure full adherence to the Prevention of Money Laundering Act (‘PMLA’) and associated regulations.”</div><p class=\"\">The exchange is pursuing a Virtual Digital Asset Service Provider (VDASP) license in India, having submitted its registration application on June 26, 2024.</p><p class=\"\">The successful registration comes nearly a month after Bybit suspended its services in India, citing “recent developments with Indian regulators,” and compliance concerns. </p><p class=\"\">Following the suspension of services, Bybit’s country manager for India, Vikas Gupta, told Cointelegraph that they expect the full operations license “in the coming weeks.”</p><p class=\"\">This is a developing story, and further information will be added as it becomes available.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:982038495094b:0-bybit-registers-with-indian-regulator-settles-monetary-fine/",
            "pub_date": "2025-02-05 17:45:17",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:f8c8fa304094b:0",
            "title": "MC Exclusive: Markets according to Mishra -- Neelkanth Mishra. On capex, consumption, deficit, dollar, earnings, valuations and returns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Union Budget gave markets some good news and some bad news. The tax breaks came as a huge positive surprise while the muted capex spending target for FY26 came as a bit of a dampener. While the proposals have brought hopes of a bounce back in earnings for FY26, stocks are still not dancing to an upbeat mood as uncertainty around Trump policy and quarterly results seem to be weighing them down. Neelkanth Mishra, Chief Economist, Axis Bank and an authoritative voice in India’s economic policy-making spoke to Moneycontrol exclusively on a wide range of questions on the economy and markets. Edited excerpts:</p><p class=\"\">What changes after the budget from a market perspective?</p><p class=\"\">Not much. The only surprise was that the government found the space for one lakh rupees in tax cuts. The COVID bump in deficits has largely been moved out. By FY 2031, the target for debt-to-GDP is expected to range between 48% to 52% from the current 56%. In the worst case, the government may not consolidate much further, but in the best case, we could see a reduction of 15-20 basis points per year. But overall, the aggressive pace of fiscal consolidation is over. For markets, nothing changes. The improvement in fiscal certainty may justify a slightly higher P/E multiple.</p><p class=\"\">Were you surprised at the muted FY26 capex target?</p><p class=\"\">Comparing FY 2019 to FY 2026, two key changes are that personal income tax-to-GDP and capital expenditure-to-GDP have both increased. The problem the government is facing is the lack of absorptive capacity for central government capex. The government can only spend on national highways, railways, defense, telecom, major ports, and airports, but most of these sectors don’t require much capex anymore. That’s the reason they decided to return some of the extra funds to taxpayers instead of distorting the economy further.</p><p class=\"\">This is assumed to boost overall consumption – will it?</p><p class=\"\">I don’t think so. The fiscal deficit as a percentage of GDP falls from 4.8% to 4.4%. The government is actually being a drag on growth by reducing aggregate demand. Capital expenditure as a percentage of GDP is going to remain flat. Forget about the earlier projections; the government’s actual expenditure is already behind the curve. In the first nine months of the year, even with the revised down estimates, government expenditure was low. However, in the last three months, government capex grew by 21% year-on-year, and in December, capex was up 95% year-on-year. So, aggregate expenditure will decrease as a percentage of GDP, so consumption is not likely to get a boost. I’m quite surprised by how the market seems to be interpreting this.But taxpayers are getting this extra money from tax savings, which will trigger consumption…</p><p class=\"\">Personal income tax-to-GDP is still expected to increase by FY 2026, despite the tax cuts. From a market perspective, how the 70-75 lakh people who fall in the Rs 12 lakh to Rs 50 lakh tax bracket and are the biggest beneficiaries of these tax cuts, will use that discretionary income.</p><p class=\"\">Which areas will see an uptick in consumption?</p><p class=\"\">These people are in the 90th percentile of Indian households. For them, their consumption is focused less on staples and more on high-value discretionary items. While it’s not considered part of household consumption expenditure, the real estate market will likely benefit. While some of this boost will go into savings, a significant portion will also likely be spent on purchases like cars, jewelry, etc. The effect on staples or other consumption categories might not be significant.Strangely, banks have not responded positively.</p><p class=\"\">One reason for that could be the uncertainty around the global economy. For banks, the bigger issue right now is the uncertainty surrounding monetary policy. There’s a lot of market expectation for rate cuts in the upcoming MPC meeting, but I personally think it would be premature to cut rates now, as it might undermine the credibility of inflation-fighting efforts.</p><p class=\"\">Do you think \"animal spirits\" in private investments can really come back this year?</p><p class=\"\">It’s essential to understand why investment fell in the first place. Gross fixed capital formation, which measures investment activity, fell from 34% in 2012 to 27% in 2021. A significant portion of this decline, around 5%, was due to reduced household investment in real estate. A large part of the rest was power sector investments and manufacturing that feeds into real estate. If we break it down, the downturn in the real estate and power generation sectors was a primary factor in this (falling investments). These cycles are now starting to turn around, which could drive growth.</p><p class=\"\">The government’s fiscal slowdown during the election year also played a role, but spending is starting to pick up now. On the other hand, the central bank’s tightening on credit-deposit ratios inadvertently slowed overall credit growth. While it was necessary to control certain segments of the credit market, the broader slowdown from 17% to 11% growth in credit was problematic. If we can reverse that trend, the growth outlook could improve significantly. The key to reviving private-sector capex is ensuring enough liquidity in the system, as the underlying demand trends are supportive. However, global turbulence still poses a significant risk.</p><p class=\"\">Going back to capex, have themes like roads and railways run their course from a stock perspective?</p><p class=\"\">The railway sector can indeed see significant growth in spending. If you recall, in 2014, the plan was to increase spending from around half a trillion to 2.5-3 trillion rupees by 2019. But the issue with railways is its bureaucracy. It’s historically struggled to execute large contracts and tenders. That said, there’s been a push for process improvements within the railway ministry. They’re starting to tackle these challenges, and the capacity to absorb more spending is improving. Moving from spending Rs 1-1.5 lakh crores per year to 2.5 lakh crores is a big leap. There’s potential for unlocking an additional Rs 10-11 trillion in projects. The primary challenge here is not fiscal capacity or funds, but the railways’ ability to execute these projects efficiently.</p><p class=\"\">How about power?</p><p class=\"\">The announcements for power capacity have already been made, but investments have just begun. For the next 3-5 years, the focus should be on urban infrastructure, which is gaining traction. The budget allocates a significant amount, with the potential to trigger up to Rs 4 lakh crores in capex through competition among states. This is a clear area for growth. Within industrials, the focus will shift to construction – like machinery, materials, cement, etc. – rather than manufacturing. With excess capacity in China, the likelihood of very large, capital-intensive projects coming up in India is slim… other than maybe in strategic areas like semiconductors. But, mostly, if we do get manufacturing, it will be labour-intensive manufacturing.</p><p class=\"\">How do you interpret the impact of Trump tariffs on Indian markets?There are so many moving parts and so many layers… but overall, it’s not good for anyone. If anyone is under any illusion that these tariffs somehow help India, I think they are mistaken. Normal wars, while they are very bad for lives and livelihoods in some specific areas, can actually be a boost to the economy. The First World War, for three or four years, was a big boost to the US economy. The Second World War also, because most of the damage happened in Europe, they actually benefited from trade. But, these are wars where the objective is economic damage. You see even the US government statements; they say that they are willing to accept some damage. In fact, there are theoreticians who are saying that this is like mutually assured destruction.</p><p class=\"\">So the first thing is, this hurts everyone. It’s bad for growth. Secondly, there is involuntary contraction because, as prices go up, demand falls. The third is just the uncertainty -- if you're setting up a factory anywhere in the world, you would say, 'You know what, let me hold back.'</p><p class=\"\">As for foreign selling in Indian markets, will it continue in this environment?</p><p class=\"\">Yes, so the dollar strengthening is not so much because of any expectations on the balance of payment changes. Frankly, that's too hard to forecast at this stage. Yeah, but it's just de-risking. People want to get into safe assets, or what was considered to be safe assets 20 years ago. So these are muscle memories of the markets that whenever there is uncertainty, you dump all the speculative back of the dollar, and then money goes back to the dollar and to gold. I mean, gold is behaving much better, which again, shows that people are really becoming risk-averse. So that is the strength of the dollar, which I think will be temporary. Once some certainty emerges, and people see how this dust may settle, which could take three to six months, then, this reversal starts as well. Because, as you were rightly saying, this is contra to what the US government really wants.</p><p class=\"\">What's your take on Indian markets for 2025?</p><p class=\"\">The first thing is the headline, I don't think we will go anywhere, although I do expect that the underlying earnings will keep improving. We will see a time correction that we've been anticipating now. I was maybe 10 months too early in calling for a peak; the market ran for a lot longer. But now the potential growth acceleration in India is now behind us, a P/E expansion is unlikely. What has also happened is that given the high prices, the supply of equity is very high. So even this year, there is going to be seven and a half lakh crores of supply in terms of promoter selling, IPOs, block trades, etc., whereas the demand is only about six lakh crores. So, on both these fronts, the PE multiple doesn't go anywhere. The enhanced global uncertainty means that the PE multiples come off even more.The underlying demand or the earnings should grow because demand drivers are largely domestic. This is the headline approach. But if something really bad happens in the trade war, maybe there is a deeper swoon in the market correction, that should be bought into. But within sectors, I would say that the channel through which growth can really be boosted is credit. Because, there is not much scope for fiscal action. Given elevated inflation, there is not much scope for interest rates to come down. But there is a lot more scope to get credit growth back closer to where it was before the slowdown started. And so, the channel for that would be the financials.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:f8c8fa304094b:0-mc-exclusive-markets-according-to-mishra-neelkanth-mishra-on-capex-consumption-deficit-dollar-earnings-valuations-and-returns/",
            "pub_date": "2025-02-05 17:45:49",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEEfhXSpa:0",
            "title": "Romania's MedLife finalises 60% takeover of Routine Med",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BUCHAREST (Romania), February 5 (SeeNews) - Romanian private healthcare services provider MedLife Group [BSE:M] said it has completed the acquisition of a 60% stake in local peer Routine Med, based in the southeastern city of Tulcea.</p><p class=\"\">The acquisition allows MedLife to strengthen its market position in Romania's southeast region, it said in a press release on Tuesday.</p><p class=\"\">Routine Med operates a hospital facility equipped with an operating room, a hospitalisation unit, and an outpatient area. The hospital offers services in over 20 medical and surgical specialties as well as laboratory and medical imaging services.</p><p class=\"\">In 2023, Routine Med booked revenue of over 15 million lei ($3.1 million/3 million euro), as per the statement.</p><p class=\"\">\"We know the history of MedLife, we know that it has the largest portfolio of acquisitions on the medical market in Romania, and we see the partnership with this group as a new and promising stage in the development of our business,\" said Routine Med founder Mihai Pavel who retained a 40% stake in the company.</p><p class=\"\">Last year, MedLife agreed to acquire majority stakes in local peer Euromedica Baia Mare Group and in human medical genetics centre Personal Genetics. MedLife also agreed to buy local peer Antares Clinic.</p><p class=\"\">Established in 1996, MedLife is among Romania’s largest providers of healthcare services, with over 130 hyperclinics and clinics, 15 hospitals, four maternity centres – located in Bucharest, Sibiu, Brasov, and Arad, 42 laboratories, 21 pharmacies and 18 dental clinics. The group also has 202 private clinic partners across Romania.</p><p class=\"\">MedLife booked a consolidated net profit of 20.8 million lei ($4.3 million/4.2 million euro) in the first nine months of 2024, up from a net profit of 3.8 million lei in the prior-year period.</p><p class=\"\">Blue-chip MedLife’s shares traded 0.87% higher at 5.81 lei as at 1004 CET on February 5 on the Bucharest Stock Exchange.</p><p class=\"\">(1 euro = 4.9769 lei)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEEfhXSpa:0-romania-s-medlife-finalises-60-takeover-of-routine-med/",
            "pub_date": "2025-02-05 17:46:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205000204:0",
            "title": "Why central banks' hunger for gold shows 'no sign of being quelled' this year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Myra P. Saefong</p><p class=\"\">Central banks stretched their gold-buying streak to a 15th consecutive year in 2024, contributing to a rise in total demand for the precious metal to its highest annual level on record - with no sign of an end this year to their \"hunger\" for gold, according to the World Gold Council.</p><p class=\"\">Gold purchases by central banks and other institutions reached 1,044.6 metric tons in 2024, the World Gold Council said in its latest Gold Demand Trends report released Wednesday.</p><p class=\"\">That's down a bit from 1,050.8 metric tons in 2023, but buying topped 1,000 metric tons for a third year in a row - well above the 473-metric-ton annual average seen between 2010 and 2021.</p><p class=\"\">Total gold demand in 2024, meanwhile, rose to 4,974.5 metric tons, up 1% from the year before, as annual investment in the metal climbed 25% year on year to reach a four-year high of 1,179.5 metric tons, according to the World Gold Council.</p><p class=\"\">Read: Why there's 'incredible demand for physical gold' in New York markets</p><p class=\"\">\"As we continue through the first half of 2025, the gold market will be influenced by macroeconomic dynamics, particularly in the U.S.,\" Joe Cavatoni, senior market strategist, Americas, at the World Gold Council told MarketWatch. \"The new Trump administration adds uncertainty around monetary, fiscal and trade policies, each with significant implication for gold as a strategic asset.\"</p><p class=\"\">Trade tariffs targeting China, Mexico and Canada would be expected to \"increase inflation, which could weaken purchasing power and drive investors toward gold as a store of value,\" he said. The U.S. implemented on Tuesday an additional 10% tariff on goods imported from China, and Beijing announced retaliatory tariffs on the U.S. that go into effect Feb. 10. But the Trump administration delayed planned tariffs on Canada and Mexico by a month.</p><p class=\"\">Central banks, as well as exchange-traded-fund investors, are likely to drive gold demand this year, with economic uncertainty supporting gold's role as a risk hedge, the World Gold Council said. Central banks have been net buyers of gold for the past 15 years, \"yet their hunger for gold shows no sign of being quelled.\"</p><p class=\"\">Forecasting the level of demand for any specific central bank is \"particularly difficult, given that it is often dictated by policy,\" the World Gold Council said.</p><p class=\"\">'Geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset.'World Gold Council's Gold Demand Trends report</p><p class=\"\">But \"geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset,\" it said.</p><p class=\"\">On Tuesday, gold for April delivery (GC00) (GCJ25) climbed $18.70, or nearly 0.7%, to settle at $2,875.80 an ounce on Comex, marking the highest most-active contract finish on record.</p><p class=\"\">Read: Gold at $3,000 is 'within reach' as new era of U.S. trade policy rattles markets</p><p class=\"\">-Myra P. Saefong</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205000204:0/",
            "pub_date": "2025-02-05 17:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446720:0",
            "title": "UK Services Activity Expands Slightly in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global UK Services PMI was revised slightly downward to 50.8 in January 2025 from the preliminary estimate of 51.2, falling below December’s reading of 51.1.</p><p class=\"\">This marked the joint-lowest level in 15 months, matching November's figure, and signaled only a modest expansion in business activity.</p><p class=\"\">Total new work declined, ending a 14-month streak of continuous growth, as firms cited global economic uncertainty, elevated interest rates, and weaker business confidence following the Autumn Budget.</p><p class=\"\">Employment levels fell for the fourth consecutive month, with job cuts accelerating at the fastest pace since January 2021, while backlogs of work declined sharply.</p><p class=\"\">On the pricing front, cost inflation hit its highest level since April 2024, and selling prices rose at the steepest rate in 13 months.</p><p class=\"\">Finally, business optimism for the year ahead weakened to its lowest point since December 2022.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446720:0-uk-services-activity-expands-slightly-in-january/",
            "pub_date": "2025-02-05 17:47:19",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW14M:0",
            "title": "Prudential Financial Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc  reported quarterly adjusted earnings of $2.96​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $2.58.  The mean expectation of sixteen analysts for the quarter was for earnings of $3.25 per share. Wall Street expected results to range from $3.13  to $3.44 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 0.1% to $13.01 billion from a year ago; analysts expected $14.71 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc's reported EPS for the quarter was a loss of 17 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $62 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc shares had fallen by 0.5% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 3.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, eleven analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 13 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the life &amp; health insurance peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Prudential Financial Inc is $129.50 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 09:47 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.25</p></td><td><p class=\"\">2.96</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">3.48</p></td><td><p class=\"\">3.48</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">3.45</p></td><td><p class=\"\">3.39</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">3.13</p></td><td><p class=\"\">3.12</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW14M:0-prudential-financial-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 17:48:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002926:0",
            "title": "China's Counter Tariffs Could Affect U.S. LNG Export Projects — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's counter tariffs against the U.S. could affect long-term liquefied natural gas contract negotiations, Goldman Sachs says. Beijing's decision to impose sanctions on American LNG and crude oil is expected to have limited implications for energy prices. This is because affected U.S. volumes are likely to find alternative buyers and China can secure supplies from other sources. But \"we see a potential pause in new long-term LNG contract negotiations between China buyers and U.S. LNG export facilities,\" analysts at the bank say. \"Given that most proposed U.S. LNG facilities require that a significant portion of their capacity is contracted under long-term deals in order to obtain financing, such a pause might delay new U.S. LNG export facilities reaching a final investment decision.\" (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002926:0/",
            "pub_date": "2025-02-05 17:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr42X7hG:0",
            "title": "Publication of request to delist Penneo A/S' shares from Nasdaq Copenhagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 19/2025 </p><p class=\"\">Copenhagen, Denmark, 5 February 2025</p><p class=\"\">With reference to Penneo A/S' (\"<strong class=\"root-Tkn6WL2y\">Penneo</strong>\") announcement published today (no. 18/2025) regarding Visma Danmark Holding A/S' (\"<strong class=\"root-Tkn6WL2y\">Visma</strong>\") decision to initiate a compulsory acquisition of the shares held by the remaining shareholders in Penneo pursuant to sections 70-72 of the Danish Companies Act, Penneo's board of directors has today, upon request from Visma, decided to request Nasdaq Copenhagen A/S (\"<strong class=\"root-Tkn6WL2y\">Nasdaq Copenhagen</strong>\") to have Penneo's shares (ISIN DK0061283009) removed from trading and official listing at Nasdaq Copenhagen. </p><p class=\"\">Provided that Nasdaq Copenhagen accepts the request, the delisting will be completed as soon as possible. The last day of trading is expected to be 5 March 2025, being the last business day within the four-week compulsory acquisition period. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information - Penneo:</strong></p><p class=\"\">Jostein Vik</p><p class=\"\">Chairman of the Board of Directors at Penneo</p><p class=\"\">Mobile +47 92 22 23 92 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Enquiries – Visma:</strong></p><p class=\"\">Lage Bøhren</p><p class=\"\">Director of Communication at Visma</p><p class=\"\">Telephone: +47 92 15 78 01</p><p class=\"\">Sindre Talleraas Holden</p><p class=\"\">Head of M&amp;A at Visma</p><p class=\"\">Telephone: +47 93 05 94 69 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world’s leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/publication-of-request-to-delist-penneo-a-s--shares-from-nasdaq-copenhagen%2Cc4100906</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr42X7hG:0-publication-of-request-to-delist-penneo-a-s-shares-from-nasdaq-copenhagen/",
            "pub_date": "2025-02-05 17:49:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0D1:0",
            "title": "Russia plans to boost yuan sales by 17% to support the rouble",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Russia said on Wednesday it would boost its sales of Chinese yuan by 17% from Feb. 7 in a move seen as aimed at supporting the rouble in the face of increased volatility due to Western sanctions and turbulence in the global forex market. </p><p class=\"\">Under a complex scheme of foreign currency operations, the central bank buys and sells forex both to ensure supply on the domestic market and to act on behalf of the finance ministry, which runs the \"rainy day\" National Wealth Fund (NWF). </p><p class=\"\">The finance ministry said it would cut its purchases of foreign currency and gold in the month ahead, a move that will increase the state's overall forex sales, providing support for the rouble.</p><p class=\"\">The finance ministry said its purchases of foreign currencies and gold for the period from Feb. 7 to March 6 would amount to the equivalent of 66.5 billion roubles, or 3.3 billion roubles a day. </p><p class=\"\">In the previous period the purchases amounted to the equivalent of 70.2 billion roubles, or 4.1 billion roubles a day.</p><p class=\"\">The move implied that the overall net forex sales by the government and the central bank will rise to 5.56 billion roubles per day from Feb. 7 from 4.76 billion roubles previously. </p><p class=\"\">The central bank cannot buy and sell dollars and euros because of Western sanctions imposed over Russia's actions in Ukraine. China's yuan, which is now the most traded foreign currency in Russia, has become the regulator's only instrument for forex interventions.</p><p class=\"\">At 0930 GMT, the rouble  was up 2.2% at 98.50 against the dollar, according to data from the over-the-counter market. It strengthened 0.13% to 13.27 against China's yuan in trading on the Moscow Stock Exchange (MOEX).</p><p class=\"\">The rouble has already surged 13% against the dollar this year due to lower demand from Russian importers during the New Year holiday season and despite new Western sanctions, which targeted sales of oil, Russia's main export commodity. </p><p class=\"\">The central bank said on Feb. 4 that the rouble exchange rate remains volatile due to continued problems with cross-border payments with Russia's trading partners and the shrinking current account surplus. </p><p class=\"\">In a separate move, the central bank reduced the volume of its yuan swap operations by 50% to 5 billion yuan, as China's Lunar New Year holiday ended and Russian banks can now replenish their yuan stocks.     </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0D1:0-russia-plans-to-boost-yuan-sales-by-17-to-support-the-rouble/",
            "pub_date": "2025-02-05 17:50:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0ZK:0",
            "title": "India's Thangamayil Jewellery surges on upbeat Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Thangamayil Jewellery  climbs more than ~12% to 2,097 rupees; set for biggest intraday pct gain since June 21, 2024</p><p class=\"\">** Co's Q3 profit jumps 72% y/y; net sales up 26%</p><p class=\"\">** Around 333,000 shares traded vs 30-day avg of 26,000</p><p class=\"\">** THNG rises 6% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0ZK:0-india-s-thangamayil-jewellery-surges-on-upbeat-q3-results/",
            "pub_date": "2025-02-05 17:50:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463921:0",
            "title": "TSH Resources Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TSH Resources  bought back 1,150,000 shares for 1.4 million ringgit on Wednesday, according to a same-day disclosure on the Singapore bourse. </p><p class=\"\">The shares were repurchased at between 1.19 ringgit and 1.22 ringgit apiece, the dual-listed oil palm cultivation and wood products company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463921:0/",
            "pub_date": "2025-02-05 17:41:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0KE:0",
            "title": "AMD shares dive as AI chip revenue disappoints investors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Advanced Micro Devices  shares fell 9% in premarket trading on Wednesday, after the company's AI chip revenue failed to meet lofty expectations of investors betting billions on growth prospects of generative artificial intelligence.</p><p class=\"\">AMD, one of the biggest providers of chips for personal computer and servers, reported quarterly results and revenue outlook above analyst estimates, but that was overshadowed by its miss in AI chip-related revenue as investors scrutinized its results against Nvidia , which controls nearly 80% share of the market.</p><p class=\"\">The Santa Clara, California-based company reported fourth-quarter data center revenue - a proxy for its AI revenue - of $3.9 billion, compared to the consensus estimate of $4.15 billion.</p><p class=\"\">\"AMD may still be taking market share from Intel in the central processing unit (CPU) side of things, but it remains a long way behind Nvidia and is struggling to catch up when it comes to graphics processing units (GPU),\" said Ben Barringer, technology analyst at Quilter Cheviot.</p><p class=\"\">\"Investors want the company to take the fight to Nvidia, but for now it is very much struggling to break the moat and disrupt its market position,\" he added.</p><p class=\"\">If losses hold, AMD is set to lose around $17.5 billion in market capitalization at $108.78 premarket, according to data compiled by LSEG.</p><p class=\"\">The results comes as tech giants including Microsoft  and Meta  increasingly dedicate resources to develop their own silicon for processing large data volumes required by GenAI, amid rising competition from Chinese AI company DeepSeek.</p><p class=\"\">\"Investors were always going to be more sensitive, given the arrival of...DeepSeek,\" said Susannah Streeter, head of money and markets at Hargreaves Lansdown, adding that AMD's results and outlook have \"knocked confidence further.\"</p><p class=\"\">At least 5 analysts have cut their price targets on the stock, with median PT now at $155, compared to $166.5 before the results.</p><p class=\"\">AMD's stock fell 18% in 2024, while Nvidia gained 171% in the same period.</p><p class=\"\">AMD's 12-month forward price-to-earnings ratio stands at 23.39, compared with Nvidia's 26.27.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0KE:0-amd-shares-dive-as-ai-chip-revenue-disappoints-investors/",
            "pub_date": "2025-02-05 17:41:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463924:0",
            "title": "San Miguel Food and Beverage Declares Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">San Miguel Food and Beverage  declared a regular cash dividend of 0.50 Philippine pesos per share, according to a Wednesday Philippine Stock Exchange filing. </p><p class=\"\">The dividend is payable on March 6 to shareholders on record as of Feb. 19, the Philippine food and beverage giant said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463924:0/",
            "pub_date": "2025-02-05 17:41:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TZ:0",
            "title": "US-China trade war sparks record-breaking rally in gold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Bullion hits all-time high at $2,869.68</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Global gold demand up 1% in 2024 - WGC says</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump in no hurry to talk to Xi amid new tariff war</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Silver, platinum up over 1%</li></ul></span></div><span><p class=\"\">    Gold prices jumped 1% on Wednesday, continuing their record rally, driven by safe-haven demand amid the escalating U.S.-China trade war, while the spotlight was also on payrolls data from the world's largest economy.</p><p class=\"\">Spot gold  rose 0.9% to $2,867.59 per ounce by 0906 GMT, after rising 1% and hitting a record high of $2,869.68 earlier in the session. U.S. gold futures  gained 0.7% to $2,895.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:852.0000000000001px;aspect-ratio:1.4200000000000002\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.webp\" type=\"images/webp\"/><img alt='A line chart titled \"Spot gold price in USD per oz\" that tracks the metric over time.' class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.jpeg\" style=\"background-color:#fbfbfc\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Spot gold price in USD per oz</span></figcaption></figure></span></p><p class=\"\">China imposed tariffs on U.S. imports in a prompt retaliation to newly introduced U.S. duties on Chinese goods, reigniting the trade war between the world's two largest economies, while U.S. President Donald Trump stated he is in no rush to speak with President Xi Jinping to de-escalate tensions.</p><p class=\"\">\"The potential economic consequences of a trade war between the U.S. and China are causing investors to fear a global recession and rising inflation,\" said Dominik Sperzel, head of trading at Heraeus Metals Germany.</p><p class=\"\">Meanwhile, three Federal Reserve officials warned that Trump's trade tariffs could drive inflation, with one suggesting that uncertainty over price outlooks warrants slower interest rate cuts. Investors this week are watching out for the ADP employment report and the payrolls report, which could shed further clues on the U.S. rate path.</p><p class=\"\">Bullion is considered an inflation hedge, but higher interest rates could dampen its appeal as the metal yields no interest.</p><p class=\"\">\"Gold is overbought and needs to correct,\" said StoneX analyst Rhona O'Connell, adding \"there is still scope for further upside, but barring any black swans we still expect to see the price topping out this year.\"</p><p class=\"\">Gold's relative strength index is at 76, indicating that the price has surpassed the \"overbought\" territory that starts at 70. </p><p class=\"\">Meanwhile, global gold demand rose 1% to a record 4,974.5 metric tons in 2024, driven by higher investment and increased central bank purchases in the fourth quarter, according to the World Gold Council.</p><p class=\"\">Spot silver  rose 1.1% to $32.44 per ounce, platinum  gained 1.3% to $976.05 and palladium  added 0.8% to $998.00.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TZ:0-us-china-trade-war-sparks-record-breaking-rally-in-gold/",
            "pub_date": "2025-02-05 17:41:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463926:0",
            "title": "Thor Energy Names New Managing Director",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uranium and energy metals explorer Thor Energy  appointed Andrew Hume as its new managing director, according to a Wednesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463926:0/",
            "pub_date": "2025-02-05 17:42:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiQnzRXa:0",
            "title": "Crayon: Invitation to Q4 2024 presentation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crayon Group Holding ASA will publish its Q4 2024 financial results onFebruary12th, 2025, at 7:00 am CET.</p><p class=\"\">CEO Melissa Mulholland and CFO Brede Huser will present the results in a livewebcast at 8:30 am CET.</p><p class=\"\">The materials and webcast can be accessed atwww.crayon.com/investor-relations/.</p><p class=\"\">There will be a Q&amp;A session after the presentation. To join the conferencecallby telephone and ask questions, please use the information below.</p><p class=\"\">Dial in numbers:</p><p class=\"\">DK: +45 7876 8490</p><p class=\"\">SE: +46 8 1241 0952</p><p class=\"\">NO: +47 2195 6342</p><p class=\"\">UK: +44 203 769 6819</p><p class=\"\">US: +1 646-787-0157</p><p class=\"\">DE: +49 30 21789327</p><p class=\"\">Conference Code: 115901</p><p class=\"\">A recording of the presentation and Q&amp;A session will be available on-demandafter the live event has concluded.</p><p class=\"\">Investor contact:</p><p class=\"\">Kjell Arne Hansen Head of Investor Relation &amp; Corporate Finance</p><p class=\"\">ir@crayon.com</p><p class=\"\">+47 950 40 372</p><p class=\"\">About Crayon</p><p class=\"\">Crayon is a customer-centric innovation and IT services company with over4000team members across 46 countries. We optimize businesses' IT estate to helptheminnovate with expertise they can trust. Our services create value forcompaniesto thrive today, and scale for tomorrow. For more information, visitwww.crayon.com.</p><p class=\"\">https://newsweb.oslobors.no/message/637755</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiQnzRXa:0-crayon-invitation-to-q4-2024-presentation/",
            "pub_date": "2025-02-05 17:42:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002901:0",
            "title": "U.K. July 2053 Green Gilt Likely to Outperform in Relative Value Basis — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. Debt Management Office auction of the July 2053 green gilt at 1000 GMT is expected to perform well in relative value terms, RBC Capital Markets analysts say in a note. Wednesday's tap is likely to be the final one for the green gilt, which should support demand for the bond, the analysts say. \"We have also observed that outgoing 30-year conventional gilts have consistently outperformed into the end of their tapping cycles,\" RBC says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002901:0/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}