{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW03O:0",
            "title": "Yuan weakens as fresh tariff war dogs post-holiday trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    China's yuan weakened against the dollar on Wednesday in the first trading session after the week-long holiday, pressured by a new trade dispute between the world's two largest economies.</p><p class=\"\">Beijing on Tuesday slapped tariffs on U.S. imports in an immediate response to new U.S. duties on Chinese goods, renewing a Sino-American trade war as President Donald Trump sought to punish China for not halting the flow of illicit drugs.</p><p class=\"\">But the losses in the yuan were capped by a persistent strengthening bias in central bank guidance, currency traders said, which they interpreted as an official attempt to limit yuan weakness.</p><p class=\"\">Prior to the market opening, the People's Bank of China (PBOC) set the midpoint , around which the yuan is allowed to trade in a 2% band, at 7.1693 per dollar, its strongest since Nov. 8, 2024 and 968 pips firmer than a Reuters' estimate (CNY=RTRS) of 7.2661.</p><p class=\"\">The central bank has been setting its official guidance on the firmer side of market projections since mid-November, which analysts and traders say is a sign of unease over the yuan's decline.</p><p class=\"\">China's yuan hit a low of about 7.35 per dollar in 2023, weighed down by a combination of a widening yield differential with the United States and a slowing domestic economy. Many market watchers believe any sharp depreciation beyond the key level could mean China is loosening its grip on the currency.</p><p class=\"\">Traders also said they would monitor the daily midpoint fixing, which is widely seen by markets as an expression of official policy stance. </p><p class=\"\">    \"Any sharp depreciation beyond 7.35 or signs that the PBOC is loosening its grip on the yuan fixing rate could trigger massive selling pressure on the yuan and unleash market expectations for further depreciation,\" said Serena Zhou, senior China economist at Mizuho Securities.  </p><p class=\"\">    \"We believe the last thing Chinese policymakers want to see is soaring volatility in the FX and financial markets as they are working hard to revive economic sentiment onshore.\"  </p><p class=\"\">As of 0315 GMT, the yuan  was 0.64% lower at 7.2845 to the dollar, compared with the previous close of 7.2469 last week.</p><p class=\"\">While the onshore yuan was closed for the Lunar New Year holiday, its offshore counterpart  shed 0.6% against the dollar and hit a lifetime low this week. It last traded at 7.2917 around midday.</p><p class=\"\">        In equity markets, the benchmark Shanghai Composite index  dropped 0.36% and the blue-chip CSI 300 Index slipped 0.27% in morning deals. </p><p class=\"\">Still, investors will see any attempts by China to weaken the currency as a hint Beijing expects a protracted trade war and is using the yuan to counter the effect of tariffs, as it did during Trump's first term in 2018.</p><p class=\"\">\"While the tariffs imposed on China are not as aggressive as those on Mexico and Canada, this marks the beginning of another leg of the long-running trade war, with risks of further escalation,\" analysts at Barclays said in a note.</p><p class=\"\">\"We see intensified downside risk to the Chinese yuan (CNY) and other Asian currencies such as Korean won (KRW), Malaysian ringgit (MYR), and Thai baht (THB).\"</p><p class=\"\">During Trump's first term as president, the yuan weakened more than 12% against the dollar during a series of tit-for-tat U.S.-China tariff announcements between March 2018 and May 2020. </p><p class=\"\">\"The future path of U.S.-China trade conflicts remains highly uncertain, and reactions from the U.S. to China's retaliation, the potential Trump-Xi phone call, and PBOC's daily dollar-yuan pair (USD/CNY) fixing in the coming days are key events to watch,\" analysts at Goldman Sachs said in a note.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:799.2895204262877px;aspect-ratio:1.3321492007104796\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03O-2186c634d6d65c12b7251a4d0f4ccfbc-resized.webp\" type=\"images/webp\"/><img alt=\"China markets in 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03O-2186c634d6d65c12b7251a4d0f4ccfbc-resized.jpeg\" style=\"background-color:#ececeb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China markets in 2025</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW03O:0-yuan-weakens-as-fresh-tariff-war-dogs-post-holiday-trade/",
            "pub_date": "2025-02-05 12:21:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DA:0",
            "title": "Australia's Macquarie drops most in 3 months; MS flags renewable energy exposure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Macquarie Group  fall 3.0% to A$230.78, set for its worst day since Nov. 1</p><p class=\"\">** Morgan Stanley highlights investors' concerns about MQG's exposure to renewable energy investments, as the sector's stocks have de-rated by about 2x PE points in past few months</p><p class=\"\">** Still, MS highlights MQG's strong position in data centres should support performance fees in next 2-3 years; expects FY26 earnings increase of 19%</p><p class=\"\">** Keeps 'outperform' rating, hikes PT to Street-high of A$255</p><p class=\"\">** Avg rating of 11 analysts is equivalent to \"hold\" and their median PT is A$235.00 – LSEG data</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DA:0-australia-s-macquarie-drops-most-in-3-months-ms-flags-renewable-energy-exposure/",
            "pub_date": "2025-02-05 12:21:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014622:0",
            "title": "Hong Kong PMI Data Points to Continued Pessimism Among Private Sector — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong PMI data show continued concern among private sector firms about the year ahead as global uncertainty rises. The headline S&amp;P Global PMI for January signaled only a modest improvement in business conditions and slipped to its lowest since September 2024. Weak external demand was the main growth constraint, says Tim Moore, economics director at S&amp;P Global Market Intelligence. \"Survey respondents noted subdued willingness to spend among clients amid concerns about the near-term global economic outlook, in particular the impact of potential U.S. tariffs.\" Export sales fell at the fastest pace since September 2024, while new business from Mainland China decreased to the greatest extent since April 2022. Despite an upturn in total new work, Hong Kong firms remain pessimistic about the year ahead, Moore says. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014622:0/",
            "pub_date": "2025-02-05 12:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW058:0",
            "title": "BOJ will keep raising rates if prices move as forecast, c.bank official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Bank of Japan will continue to raise interest rates if underlying inflation accelerates toward its 2% target as projected, a senior central bank official said on Wednesday.</p><p class=\"\">\"Underlying inflation is heading toward 2% but still remains below that level now. As such, we must support economic activity with loose monetary policy,\" Kazuhiro Masaki, director-general of the BOJ's monetary affairs department, told parliament.</p><p class=\"\">\"Having said that, we will continue to raise interest rates and adjust the degree of monetary support, if underlying inflation accelerates toward 2% as we project,\" he said.</p><p class=\"\">    Japan's     core consumer inflation     hit 3.0% in December, marking the fastest year-on-year pace in 16 months and exceeding the BOJ's 2% target for nearly three years.  </p><p class=\"\">    But the central bank has said it focuses on underlying inflation, or the broad trend of price moves that strips away one-off factors such as fuel and volatile fresh food costs, in judging whether inflation will sustainably hit its 2% target.  </p><p class=\"\">In January, the BOJ's board raised its forecast for core-core CPI, which strips away the effect of volatile fresh food and fuel costs, to 2.1% for fiscal 2025, up from a previous estimate of 1.9% in October.</p><p class=\"\">    Japan's post-pandemic price increases have been driven mostly by rising raw material costs, blamed in part by higher import costs from a weak yen, Masaki said.  </p><p class=\"\">    Such cost-push inflationary pressure is likely to dissipate, while rising wages are leading to moderate increases in services prices, he added.  </p><p class=\"\">    \"We expect underyling inflation to gradually head toward our 2% target,\" Masaki said.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW058:0-boj-will-keep-raising-rates-if-prices-move-as-forecast-c-bank-official-says/",
            "pub_date": "2025-02-05 12:23:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463677:0",
            "title": "Market Chatter: BP Expected to Invest Up to $25 Billion to Redevelop Oil, Gas Fields in Iraq",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BP (BP.L) is expected to spend up to $25 billion to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday, citing an unnamed senior oil official in the country with direct knowledge of the issue. </p><p class=\"\">As part of the profit-sharing agreement, which is expected to run for over 25 years, the British oil and gas giant aims to raise the oilfields' capacity to 450,000 barrels per day in the next two to three years, the unnamed source noted. </p><p class=\"\">The official added that technical and economic negotiations are underway and that a deal for the project could be signed in the first half of February and possibly by the end of the week. </p><p class=\"\">BP did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463677:0/",
            "pub_date": "2025-02-05 12:23:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014632_20250204014632:0",
            "title": "Toyota Motor Sees FY Net Y4.52T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014632_20250204014632:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014631_20250204014631:0",
            "title": "Toyota Motor Raises FY Dividend to Y90.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014631_20250204014631:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014627:0",
            "title": "Toyota Motor 9-Mos Rev Y35.67T Vs Y34.02T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014627:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014629_20250204014629:0",
            "title": "Toyota Motor 9-Mos Pretax Pft Y5.43T Vs Pft Y5.36T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014629_20250204014629:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014628_20250204014628:0",
            "title": "Toyota Motor 9-Mos Oper Pft Y3.68T Vs Pft Y4.24T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014628_20250204014628:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014626:0",
            "title": "Toyota Motor 9-Mos Net Y4.10T Vs Net Y3.95T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014626:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014630_20250204014630:0",
            "title": "Toyota Motor 9-Mos EPS Y307.95 Vs EPS Y291.87",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014630_20250204014630:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463680:0",
            "title": "Green Technology Metals Progresses Canada Lithium Conversion Facility; Shares Rise Over 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Green Technology Metals  progressed its lithium conversion facility development strategy in Ontario, Canada, according to a Wednesday Australian bourse filing. </p><p class=\"\">The company is conducting pilot test work at battery producer EcoPro's Pohang-Yeongil Bay industrial complex in South Korea to produce battery-grade lithium hydroxide from ore mined from Green Technology's Seymour project in Canada. </p><p class=\"\">It shipped a one-tonne spodumene concentrate sample to the facility and it expects to achieve lithium hydroxide production in the second quarter of 2025. </p><p class=\"\">It will also conduct test work on a tonne of concentrate from the Root lithium project. </p><p class=\"\">The pre-feasibility study remains on track for completion by the fourth quarter. </p><p class=\"\">The firm's shares rose over 6% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463680:0/",
            "pub_date": "2025-02-05 12:25:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463671:0",
            "title": "Japanese Service Sector Sees Strongest Growth in Four Months Amid Rising Inflation and Employment Surge -S&P",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In January, the Japanese service sector experienced its strongest growth in business activity in four months, as indicated by the au Jibun Bank Japan Services Business Activity Index reaching 53.0. </p><p class=\"\">This upturn was driven by a significant rise in new business inflows, which prompted firms to increase employment levels to meet growing demand, according to S&amp;P Global statement on Wednesday. </p><p class=\"\">The sector's expansion was primarily seen in Transport &amp; Storage and Finance &amp; Insurance, while Information &amp; Communication faced a slight decline. </p><p class=\"\">Export demand contributed positively, rising for the first time in four months, particularly from parts of Asia. </p><p class=\"\">However, inflationary pressures intensified, with input price inflation reaching a five-month high due to rising wages, as well as increased fuel and raw material costs. </p><p class=\"\">As a result, service providers raised prices, leading to the highest inflation in prices charged since May 2024. </p><p class=\"\">Meanwhile,the au Jibun Bank Japan Composite PMI Output Index rose to 51.1 in January from 50.5 in December, remaining above the neutral 50.0 for the third month and indicating the strongest private sector output expansion since last September. </p><p class=\"\">This growth was driven by a solid increase in the service economy, although it was partially offset by a contraction in manufacturing output, as new business volumes reached a five-month high. </p><p class=\"\">Despite a quicker pace of input cost inflation, particularly in the service sector, output price inflation remained historically strong but little changed from December.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463671:0/",
            "pub_date": "2025-02-05 12:17:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:2f3b0f60b094b:0",
            "title": "Federal Reserve speakers on Wednesday include Barkin, Goolsbee, Bowman, and Jefferson",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The times below are listed GMT/US Eastern time. </p><p class=\"\">1400/0900 Federal Reserve Bank of Richmond President Thomas Barkin participates in fireside chat before the Conference Board \"2025: A Year in Preview\" Conference, in New York</p><p class=\"\">1800/1300 Federal Reserve Bank of Chicago President Austan Goolsbee speaks on economic perspectives before hybrid 31st Annual Automotive Insights Symposium</p><p class=\"\">2000/1500 Federal Reserve Board Governor Michelle Bowman gives brief economic update and bank regulation remarks before the 2025 Kansas Bankers Association Harold A. Stones Government Relations Conference</p><p class=\"\">0030/1930 Federal Reserve Vice Chair Philip Jefferson gives lecture, \"Do Non-Inflationary Economic Expansions Promote Shared Prosperity?\" at Swarthmore College, in Swarthmore, Pa</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1115.2941176470588px;aspect-ratio:1.8588235294117648\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.webp\" type=\"images/webp\"/><img alt=\"Federal Reserve\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.jpeg\" style=\"background-color:#b3b2a6\"/></picture></div></figure></span></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:2f3b0f60b094b:0-federal-reserve-speakers-on-wednesday-include-barkin-goolsbee-bowman-and-jefferson/",
            "pub_date": "2025-02-05 12:18:19",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0ET:0",
            "title": "India's Swiggy slides ahead of Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Swiggy  falls ~2% ahead of Q3 results later in the day</p><p class=\"\">** This will be food and grocery delivery firm's first quarterly report since going public in November 2024</p><p class=\"\">** Analysts expect consol loss of 6.17 bln rupees ($70.8 mln), per data compiled by LSEG</p><p class=\"\">** Co's Q2 consol loss was 6.26 bln rupees</p><p class=\"\">** ICICI Securities sees 20% y/y rise in SWIG's food delivery gross order value (GOV)</p><p class=\"\">** Expects quick-commerce (QC) segment GOV to grow 108.9% y/y</p><p class=\"\">** Anand Rathi Research says QC segment's EBITDA margins will contract 80-100 bps q/q on heightened competition, rival Zepto's relentless cash burn</p><p class=\"\">** Last month, SWIG dropped below IPO price (390 rupees) for the first time</p><p class=\"\">** Rival Zomato 's Q3 profit more-than-halved on rising competition in QC, increased expenses</p><p class=\"\">($1 = 87.1200 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0ET:0-india-s-swiggy-slides-ahead-of-q3-results/",
            "pub_date": "2025-02-05 12:19:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSR:0",
            "title": "UAE non-oil business sector expands robustly in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UAE's non-oil private sector continued to expand robustly at the start of 2025, although capacity pressures and competitive challenges posed headwinds, a survey showed on Wednesday.</p><p class=\"\">The seasonally adjusted S&amp;P Global UAE Purchasing Managers' Index was 55.0 in January, slightly down from December's nine-month high of 55.4, but well above the 50.0 mark indicating expansion. </p><p class=\"\">Business activity and new orders rose sharply, driven by favourable market conditions and easing cost pressures, although at a slightly slower pace, with the new orders sub index easing to 59.0 in January, from December's 59.3.  </p><p class=\"\">\"Robust expansions in activity and new business, as well as lower input cost inflation, suggest the economy is in a healthy position,\" said David Owen, Senior Economist at S&amp;P Global Market Intelligence. </p><p class=\"\">Input cost inflation fell to a 13-month low, allowing firms to increase purchases, but capacity pressures persisted, with backlogs of work rising at their fastest pace in eight months.</p><p class=\"\">\"Strong competition and cash flow concerns arising from heavy backlogs have appeared to sow doubt among firms that they can continue to boost their revenues,\" Owen said, noting that total confidence was at its lowest level since December 2022. </p><p class=\"\">A separate index for Dubai eased slightly to 55.3 from December's 55.5, as businesses reported improved conditions but expressed subdued expectations for future activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSR:0-uae-non-oil-business-sector-expands-robustly-in-january-pmi-shows/",
            "pub_date": "2025-02-05 12:19:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0F9:0",
            "title": "India's PC Jeweller rises on posting quarterly profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of PC Jeweller  up 4.9% to 15.7 rupees </p><p class=\"\">** Co posts Q3 consolidated net profit of 1.48 billion rupees ($17 million) vs loss of 1.98 billion rupees a year ago</p><p class=\"\">** Rev soars nearly 16x to 6.39 bln rupees on higher demand for jewellery during the festival and wedding season</p><p class=\"\">** Stock has been above its 200-day simple moving avg since Dec 2023, indicating bullish sentiment</p><p class=\"\">** PCJE rose nearly 240% in 2024</p><p class=\"\">($1 = 87.1250 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0F9:0-india-s-pc-jeweller-rises-on-posting-quarterly-profit/",
            "pub_date": "2025-02-05 12:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446665:0",
            "title": "Indonesia Economy Expands 0.53% QoQ in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy grew 0.53% qoq in Q4 of 2024, compared with market consensus of 0.56% and after a 1.5% expansion in Q3.</p><p class=\"\">It was the third quarterly rise but the softest in the sequence.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446665:0-indonesia-economy-expands-0-53-qoq-in-q4/",
            "pub_date": "2025-02-05 12:10:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014589:0",
            "title": "India's Sensex Flat as Financial, Tech Stocks Gains — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India's Sensex is flat at 78582.41 as gains in financial and tech stocks help offset losses in consumer stocks. IndusInd Bank is up 1.8% and Zomato is 1.5% higher, while Nestle India is down 2.8% and Hindustan Unilever is 0.8% lower. Investors are focusing on U.S. trade talks as well as domestic earnings. Reliance Power and Zydus Lifesciences are set to announce their quarterly results later in the day. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014589:0/",
            "pub_date": "2025-02-05 12:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463532:0",
            "title": "Mwb Research Keeps Infineon on Hold After Fiscal Q1 Beat as Geopolitical Risks Persist",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mwb research on Tuesday noted the stellar fiscal first-quarter performance of Infineon Technologies  but cautioned on the geopolitical risks that the European chipmaker is facing. </p><p class=\"\">As such, the research firm kept the German stock on hold and raised its price target to 35 euros from 33 euros. </p><p class=\"\">\"Despite Infineon's solid Q1 beat and slight order backlog growth, industry prospects remain tough and uncertain in the short-term due to ongoing inventory correction and soft demand across key end-markets,\" the note said. \"On top of that, Trump tariffs add an additional layer of uncertainty, particularly for the automotive segment, where slowing EV adoption in key regions, cost pressures, and geopolitical risks could disrupt supply chains and dampen expected recovery.\"</p><p class=\"\">Analysts at mwb also revised upwards their estimates for Infineon's sales, EBIT and EPS for 2025 to 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463532:0/",
            "pub_date": "2025-02-05 12:11:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463675:0",
            "title": "Titan Company's Consolidated Profit Remains Flat in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Titan Company's  consolidated attributable profit was largely flat at 10.5 billion Indian rupees in the fiscal third quarter ended Dec. 31, 2024 from the year-ago level. </p><p class=\"\">Earnings per share contracted to 11.80 rupees compared with 11.90 rupees a year ago, according to a Tuesday filing to the Indian stock exchanges by the watches and accessories manufacturer. The EPS was lower than the 12.03 rupees estimated by the analysts polled by Visible Alpha. </p><p class=\"\">Revenue from operations in fiscal Q3, however, increased to 175.5 billion rupees from 139.6 billion rupees a year earlier. This was higher than Visible Alpha's estimate of 170.96 billion rupees.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463675:0/",
            "pub_date": "2025-02-05 12:12:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463676:0",
            "title": "Vection Technologies Gets AU$4 Million Defense Contract Extension, Shares Down 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vection Technologies  received AU$4 million defense contract extension for its artificial intelligence software, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">The value of the contract will be recognized in its earnings results for the fiscal year ending June 30, the filing said. </p><p class=\"\">Shares were down 6% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463676:0/",
            "pub_date": "2025-02-05 12:13:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204015027:0",
            "title": "Nissan reportedly balks at Honda's terms, putting their merger in doubt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mike Murphy</p><p class=\"\">Shares of Nissan Motor Co. and Honda Motor Co. rose overnight following reports that the automakers' proposed merger may be scrapped.</p><p class=\"\">The Japanese newspaper Asahi Shimbun and the Wall Street Journal reported the two companies' boards would meet as soon as Wednesday to discuss possibly terminating the talks, after Nissan reportedly balked at a new proposal where it would become a subsidiary of Honda, rather than both being subsidiaries of a single holding company.</p><p class=\"\">Nissan's stock (JP:7201) rose nearly 2% in Tokyo trading early Wednesday. Honda's Japanese shares (JP:7267) were up about 3%, after its U.S.-traded shares (HMC) rose 2.4% on Tuesday.</p><p class=\"\">Merger talks to combine the companies and create one of the world's largest automakers were announced in December.</p><p class=\"\">Both Honda and Nissan saw sharp drops in global sales in 2024, especially in China and Southeast Asia, and they have been forced to cut production capacity as demand has dipped. Nissan has been particularly hard-hit, and announced 9,000 layoffs in November.</p><p class=\"\">When the deal was first announced, analysts said it was a sign of much-needed consolidation in the auto industry, as high prices have hurt sales amid competition from cheaper Chinese electric vehicles.</p><p class=\"\">Mitsubishi (JP:7211), a strategic partner of Nissan's, was invited to join the Honda-Nissan merger, but has not yet made a decision.</p><p class=\"\">-Mike Murphy</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204015027:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014597:0",
            "title": "New Zealand Shares Slip 0.5% as Tariff Worries Weigh — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's NZX-50 closed 0.5% lower at 12844.59, staying firmly on course for a fifth weekly decline in six weeks. The benchmark index fell at the open and stayed in the red all through Wednesday's session. Medical-device maker Fisher &amp; Paykel lost 3.7% amid continued worries over the impact of global tariffs. The stock is down 8.0% this week and is 9.9% lower so far in 2025. The NZX-50 benchmark index is down 2.0% year to date. Auckland International Airport fell 1.1% Wednesday. Aged-care providers Summerset and Ryman shed 0.8% and 1.6%, respectively. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014597:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014575:0",
            "title": "Indonesia's Economy Sustained Steady Pace Growth in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +5.02% On Year; Mkt Expected +4.89%<br/><strong class=\"root-Tkn6WL2y\">(04:08 GMT) </strong>*Indonesia 4Q GDP +0.53% On Quarter<br/><strong class=\"root-Tkn6WL2y\">(04:09 GMT) </strong>*Indonesia 2024 GDP +5.03%<br/><strong class=\"root-Tkn6WL2y\">(04:14 GMT) </strong>Indonesia's Economy Sustained Steady Pace Growth in 2024</p><p class=\"\">By Ying Xian Wong</p><p class=\"\">Indonesia's economy grew at a steady pace in 2024 as momentum picked up in the final quarter of the year.</p><p class=\"\">Annual growth of 5.03% compared with the 5.05% expansion seen in 2023, the statistics agency said Wednesday. Economists at HSBC and DBS had expected a reading of 5.0%.</p><p class=\"\">That continues a years-long run of growth at a roughly 5% clip, with Southeast Asia's largest economy having expanding at the same pace since about 2016, barring the Covid shock over 2020 and 2021.</p><p class=\"\">Indonesia's resource-rich economy grew 5.02% from a year earlier in the fourth quarter of 2024, compared with a 4.95% expansion in the third quarter. That exceeded economists' expectations, with a Wall Street Journal poll tipping growth at 4.89%.</p><p class=\"\">Gross domestic product expanded 0.53% in the fourth quarter compared with the previous quarter.</p><p class=\"\">The data comes as President Prabowo Subianto looks to boost growth throughout his five-year term.</p><p class=\"\">Current indicators suggest that economic growth will likely remain around 5% this year, ANZ economists Arindam Chakraborty and Sanjay Mathur said in a recent note. While the Indonesian government's focus on welfare-driven spending could help support consumption, the 2025 budget looks conservative, they added.</p><p class=\"\">Write to Ying Xian Wong at yingxian.wong@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014575:0/",
            "pub_date": "2025-02-05 12:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446666:0",
            "title": "Indonesia Enonomy Grows 5.03% in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy expanded by 5.02% yoy in Q4 2024, compared with market estimates of 4.98% and after a 4.95% growth in Q3, which was the softest growth in a year.</p><p class=\"\">For the full year, the economy grew by 5.03%, the lowest level in three years, after expanding by 5.05% in 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446666:0-indonesia-enonomy-grows-5-03-in-2024/",
            "pub_date": "2025-02-05 12:14:51",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014600_20250204014600:0",
            "title": "Nissin Foods Holdings 9-Mos Net Y43.58B Vs Net Y49.05B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014600_20250204014600:0/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014602:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Recover Despite China Tariff Fears</strong></p><p class=\"\">A call between Trump and Xi Jinping hasn't happened Tuesday, but might come Wednesday.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How U.S. Agriculture Market Is Approaching Tariffs and a Potential Trade War</strong></p><p class=\"\">Traders and farmers hope that the Trump administration is using tariff threats as leverage in trade negotiations, as opposed to following through with a major disruption to agricultural trade.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Keeps Hitting Record Highs. Here's Why-and Which Stocks Could Benefit.</strong></p><p class=\"\">The yellow metal is trading just below $2,900 an ounce. Miner stocks are rallying too. Geopolitical turmoil is boosting gold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eggs Are Through the Roof. What's Up With Food Prices?</strong></p><p class=\"\">Bird flu is making eggs costly, and looming tariffs could cause price hikes in certain items like avocados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014602:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014603:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</strong></p><p class=\"\">The Japanese automakers had announced a plan to combine in December.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chipotle Shares Fall as Chain Tempers Sales Growth Hopes</strong></p><p class=\"\">Chipotle reduced its financial outlook for same-store sales this year to an increase in the low to mid-single digits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group Replaces CEO as Growth Eludes Dating Apps</strong></p><p class=\"\">The owner of Tinder, Hinge and OkCupid apps said CEO Bernard Kim would step down and be succeeded by board member Spencer Rascoff, a co-founder and former CEO of home-listings portal Zillow Group.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</strong></p><p class=\"\">Novo's Wegovy and Ozempic are among the most closely watched new medications in recent history, but face serious competition from Eli Lilly's Zepbound and Mounjaro.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LG CNS Makes Weak Debut in South Korea After IPO</strong></p><p class=\"\">The information-technology services affiliate of conglomerate LG Group raised around $826 million in South Korea's biggest listing in three years.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mattel Relying on Supply Chain, Potential Price Increases to Offset Tariff Impacts</strong></p><p class=\"\">Chief Executive Ynon Kreiz said the company has spent years building out a supply chain that isn't overly reliant upon any one country. It will also consider increasing its prices, he said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014603:0-news-highlights-top-company-news-of-the-day-tuesday-at-11-pm-et/",
            "pub_date": "2025-02-05 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}