{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0G4:0",
            "title": "Market analysts react to US-Israel strikes on Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    The United States and Israel launched strikes on Iran on Saturday, targeting its leadership and plunging the Middle East into a new conflict that President Donald Trump said would end a security threat and give Iranians a chance to topple their rulers.</span></p><p class=\"\"><span>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and Tehran responded by launching missiles towards Israel. </span></p><p class=\"\"><span>Some oil majors and top trading houses suspended crude oil and fuel shipments via the Strait of Hormuz because of the attacks, four trading sources said on Saturday.    </span></p><p class=\"\"><span>QUOTES:</span></p><p class=\"\"><span>    ENERGY ANALYSTS AT EURASIA GROUP:  </span></p><p class=\"\"><span>    \"Oil prices will rise sharply when markets open. Should the conflict continue into Sunday, oil prices are likely to respond by increasing by $5-10 above the current $73 baseline, based on Iran's claim to have closed the Strait of Hormuz and the disruption in tanker traffic.\"  </span></p><p class=\"\"><span>ENERGY ANALYSTS AT BARCLAYS:</span></p><p class=\"\"><span>\"Oil markets might have to face their worst fears on Monday. As things stand right now, we think Brent could hit $100 (per barrel), as the market grapples with the threat of a potential supply disruption amid a spiralling security situation in the Middle East.\"</span></p><p class=\"\"><span>VISHNU VARATHAN, HEAD OF MACRO RESEARCH, ASIA EX-JAPAN, MIZUHO, SINGAPORE:</span></p><p class=\"\"><span>\"A broader state of spots of regional attacks/instability may be par for the course - in line with Iran’s warning. Oil prices are likely to remain elevated as production and passage remain prone to attacks and disruptions. OPEC may be under pressure to raise production to try and offset. But a 10-25% premium on oil is not outlandish - even without a blockade of the Strait of Hormuz, which is easily a 50% premium risk event.\"</span></p><p class=\"\"><span>CHRISTOPHER WONG, STRATEGIST, OCBC, SINGAPORE:</span></p><p class=\"\"><span>\"The strike raises geopolitical risk premia as markets head into Monday’s open. The immediate reaction function is fairly predictable: safe-haven assets such as gold are likely to see an upside gap, while oil prices may also firm on supply-disruption concerns. Risk assets and high-beta currencies … could face an initial bout of volatility, particularly if headlines suggest potential retaliation or regional spillovers.\"</span></p><p class=\"\"><span>NICK FERRES, CIO, VANTAGE POINT ASSET MANAGEMENT, SINGAPORE:</span></p><p class=\"\"><span>\"Energy is still inexpensive. That’s the obvious sector that rallies on Monday. And gold.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0G4:0-market-analysts-react-to-us-israel-strikes-on-iran/",
            "pub_date": "2026-03-01 03:37:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002563:0",
            "title": "Iran conflict raises talk of a return to $100-a-barrel oil",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Myra P. Saefong</span></p><p class=\"\"><span>Reports say Iran's military is not allowing passage through the crucial maritime waterway known as the Strait of Hormuz</span></p><p class=\"\"><span>Sealing the Straight of Hormuz would be the economic equivalent of pulling the fire alarm in a crowded theatre, says SPI Asset Management.</span></p><p class=\"\"><span>The U.S. and Israel's attack on Iran raised alarms on Saturday that a key regional source of the world's crude oil may now be at risk, sparking  talk of a return to $100-a-barrel oil prices.</span></p><p class=\"\"><span>The Strait of Hormuz, a maritime chokepoint vital to the world's crude-oil exports, has come into sharp focus as fears of a broader regional conflict grow. The strait is crucial because it allows cargo ships to pass the Persian Gulf,  the Gulf of Oman and the Arabian Sea, facilitating the production and flow of crude oil from the Middle East. The region is home to five of the world's top 10 biggest producers.</span></p><p class=\"\"><span>\"So far, there is no clarity on the magnitude of any energy disruptions, but there has been some disruption of shipping in the Strait of Hormuz,\" said Matt Gertken, chief geopolitical and U.S. political strategist at BCA Research. \"It is too soon to gauge the impact on the oil market, but the intensity of the military operation implies high odds of a major oil supply disruption\" of 5 million barrels per day or more, he told MarketWatch on Saturday.</span></p><p class=\"\"><span>The U.S. and Israel strikes on Iran targeted its leadership and military assets, The Wall Street Journal reported. The move followed failed negotiations between the U.S. and Iran to reach a deal to limit Iran's nuclear program. Iran has responded with strikes across the Middle East.</span></p><p class=\"\"><span>Read: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.</span></p><p class=\"\"><span>Several news reports Saturday indicated that passage through the Strait of Hormuz has been curtailed. An official from the European Union's naval mission Aspides told Reuters that vessels have been receiving VHF transmission from Iran's Revolutionary Guards saying that no ship is allowed to pass the Strait of Hormuz. So far, there has not been any official closure announcement.</span></p><p class=\"\"><span>'Iran understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports.'Stephen Innes, SPI Asset Management</span></p><p class=\"\"><span>Iran, however, \"understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports,\" said Stephen Innes, managing partner at SPI Asset Management. \"It would hit not only Western consumers but also China and regional buyers. It is a blunt instrument.\"</span></p><p class=\"\"><span>Developments in the region are sure to impact oil prices as soon as trading resumes late Sunday and into early Monday.</span></p><p class=\"\"><span>Oil prices will continue to rise on speculation that the war will expand and that infrastructure will be hit, said BCA Research's Gertken. U.S. global benchmark Brent crude (BRN00) could reach $90 per barrel without significant physical disruption, he said. That would be a more than 20% rise from Friday's settlement of $72.87 for the May contract (BRNK26).</span></p><p class=\"\"><span>If there is physical disruption, then it can rise above $100 per barrel - \"potentially well above\" that, said Gertken.</span></p><p class=\"\"><span>Strait of Hormuz: A staggering chokepoint</span></p><p class=\"\"><span>Just how much oil could be involved when it comes to the Strait of Hormuz and to the broader region is staggering. Kpler provided a snapshot Saturday of oil and oil-product tankers in the Strait of Hormuz.</span></p><p class=\"\"><span>This map is a snapshot of the oil and oil-product tankers currently in and around the Strait Hormuz. Green tankers are loaded, while red ones are in \"ballast,\" or essentially empty.</span></p><p class=\"\"><span>Around 20% of the global petroleum liquids the world uses transits through the strait each day. Last year, just over 14.5 million barrels per day of crude and crude condensate exports passed through the strait, said Matt Smith, U.S. head analyst at Kpler.</span></p><p class=\"\"><span>From the archives: Strait of Hormuz, the world's biggest oil chokepoint, in focus as U.S.-Iran tensions flare</span></p><p class=\"\"><span>Saudi Arabia accounted for around 5.5 million daily barrels, Iraq 3.25 million, UAE 1.97 million, Iran 1.59 million, Kuwait 1.55 million, and Qatar 0.72 million, said Smith. Over 90% of that oil typically heads to Asia, around 4% to Europe, 4% to the Americas and the rest to Africa, he said.</span></p><p class=\"\"><span>Four countries - China, India, Japan and South Korea - account for nearly three-quarters of the crude barrels that pass through the Strait of Hormuz, so they would feel the most significant impact, said Smith.</span></p><p class=\"\"><span>The Middle East is home to half of the world's top 10 oil producers - Saudi Arabia, Iraq, the United Arab Emirates, Iran and Kuwait, according to the International Energy Agency. In 2022, the region accounted for more than four in 10 barrels of global oil exports, it said.</span></p><p class=\"\"><span>Yet the oil market's biggest risk isn't the Strait of Hormuz being closed, said Kpler's Smith. It's that \"Iran's retaliation leads to broader unrest in the region, putting supply at risk,\" he said.</span></p><p class=\"\"><span>Iran alone produces 3.2 million daily barrels of crude oil, with around 2 million of that primarily exported to China for refining, according to OPIS, a unit of Dow Jones, the publisher of MarketWatch.</span></p><p class=\"\"><span>Iran's proven crude oil reserves are estimated at 208 billion barrels, according to OPIS.</span></p><p class=\"\"><span>There have been reports of explosions Iran's Kharg Island, a key export terminal roughly 15 miles off the coast of Iran, OPIS's Denton Cinquegrana and Tracy Cui wrote in a report Saturday. It is still too early to tell what kind of damage, if any, has been done to export infrastructure on Kharg Island, they said, but about 90% of Iran's exports go through it. Sometimes called \"oil island,\" it has a storage capacity of about 7 million barrels.</span></p><p class=\"\"><span>From the archives: Israeli strikes on Iran's 'oil island' could send crude prices soaring</span></p><p class=\"\"><span>OPEC+ meeting Sunday</span></p><p class=\"\"><span>The Iran conflict comes ahead of Sunday's monthly meeting of eight major oil producers, a group known as the Organization of the Petroleum Exporting Countries and its allies, or OPEC+.</span></p><p class=\"\"><span>The group had been raising their production quotas for most of last year, but paused those increases for the first quarter of 2026 on the heels of expectations for a global oil supply surplus.</span></p><p class=\"\"><span>Now OPEC+ is likely to increase production to \"try to suppress prices, cushion the global economy, and undercut Iranian regime funding,\" said BCA Research's Gertken. But if shipping is affected, then any such production increases \"may not be able to reach the global market immediately.\"</span></p><p class=\"\"><span>Read: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices</span></p><p class=\"\"><span>-Myra P. Saefong</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002563:0/",
            "pub_date": "2026-03-01 03:39:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:efb81792f094b:0",
            "title": "DBV Technologies Highlights Additional Data from Successful Phase 3 VITESSE Study at the AAAAI 2026 Annual Meeting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span> Châtillon, France, February 28, 2026</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>DBV Technologies Highlights Additional Data from Successful Phase 3 VITESSE Study at the AAAAI 2026 Annual Meeting</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Approximately 83% of children treated with the VIASKIN® Peanut Patch increased their eliciting dose at month 12, compared to approximately 48% in the placebo group</span></li><li class=\"listItem-bmN0_SHH\"><span>Approximately 60% of children treated with the VIASKIN® Peanut Patch increased their eliciting dose by at least two doses at month 12, compared to 23% in the placebo group</span></li><li class=\"listItem-bmN0_SHH\"><span>24% of children on placebo decreased their eliciting dose between the baseline and month 12 double-blind, placebo-controlled food challenge, compared to only 6.4% of children treated with the VIASKIN® Peanut Patch </span></li></ul><p class=\"\"><span>DBV Technologies </span><span>Euronext:DBV</span><span> – </span><span>ISIN:FR0010417345</span><span> – Nasdaq Stock </span><span>Market:DBVT</span><span>, a late-stage biopharmaceutical company, today announced that the company shared additional positive data from the </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=xy0QlGdQ03ALblgMLJ_X-bAQFm0DyPv0GchROlzObVj8_cbpk-wSlF71avDsoFbjCVCLAsg9Q2sS41noIPWhHhmrq0nVDCmntw6ZlxQCvmUQ8Z7hzxFW6uASu8Giaixj5t5N8J9n17HS5vt0Upup9mSv0iBwLE8DtYRnTc2Do6F3cLpEWfaCImpoSwq20ki3OvaIGAKNqZ2Pgb1IgBQG-ecQ19H7tdUjx3Hx04X7UNIgLi56B-gcDGHhGI8v9ANTDR9QHRRiLkCX1F5q1Klu5qLdZQSV5WZrEuJooV3YmWYcrxcftdjnvKvlyBzEBkvbF9VmsBux5syjvJ2GtZ80WQTiO5T4Dsqi14EoqHq0vL4=\" rel=\"nofollow\" target=\"_blank\">successful Phase 3 VITESSE clinical trial</a><span> as an oral presentation today at the American Academy of Allergy, Asthma, and Immunology (AAAAI) 2026 Annual Meeting, in Philadelphia, PA. VITESSE, the largest food allergy immunotherapy trial to date, is a Phase 3 study assessing DBV’s VIASKIN® Peanut Patch for the treatment of peanut-allergic children aged 4 to 7 years.</span></p><p class=\"\"><span>The VITESSE study met its primary endpoint whereby VIASKIN Peanut demonstrated a statistically significant treatment effect (p&lt;0.001), with 46.6% of children in the VIASKIN Peanut arm meeting the treatment responder criteria* at 12 months, as compared to 14.8% of children in the placebo arm (difference in response rates = 31.8%; 95% confidence interval (CI) = (24.5, 39.0%)), exceeding the lower bound prespecified threshold of 15%. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Highlights from the data presented at AAAAI 2026:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>82.8% of subjects treated with the VIASKIN® Peanut Patch increased their eliciting dose by at least one dose, or one incremental step in a double-blind placebo-controlled food challenge, at month 12, compared to approximately 48% in the placebo group. </span></li><li class=\"listItem-bmN0_SHH\"><span>60.1% of the treated subjects increased their eliciting dose by at least two doses of the double-blind, placebo-controlled food challenge at month 12, compared to 23.4% in the placebo group.</span></li><li class=\"listItem-bmN0_SHH\"><span>24% of subjects on placebo decreased their eliciting dose between the baseline and month 12 double-blind, placebo-controlled food challenge, compared to only 6.4% of treated subjects.</span></li><li class=\"listItem-bmN0_SHH\"><span>All sensitivity analyses were statistically significant with the 95% CI exceeding the lower bound prespecified threshold of 15%, ranging from 22.1% to 27.8%, confirming the robustness of the primary endpoint analysis.</span></li><li class=\"listItem-bmN0_SHH\"><span>In both baseline eliciting dose (ED) strata, a significantly greater proportion of children treated with the VIASKIN® Peanut Patch were treatment responders as compared to the placebo group. </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Among children with a baseline ED ≤ 30mg, 49.3% were responders versus 14.7% in the placebo group (△=34.6%; 95% </span><span>CI:24.93</span><span>, 44.24). </span></li><li class=\"listItem-bmN0_SHH\"><span>Among children with a baseline ED = 100mg, 43.1% were responders versus 14.6% in the placebo group (△=28.5%; 95% </span><span>CI:17.51</span><span>, 39.5). </span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><span>The VIASKIN® Peanut Patch was well tolerated; the majority of treatment emergent adverse events (TEAEs) were mild local application site reactions, consistent with DBV’s previous Phase 3 studies.</span></li></ul><p class=\"\"><em><span>“Building on the statistically significant topline results from the VITESSE Phase 3 study, the additional data presented at this year’s AAAAI Annual Meeting suggest a broad and consistent treatment effect of the VIASKIN</span></em><em><span>®</span></em><em><span> Peanut Patch, regardless of baseline eliciting dose strata or study population analysis,” stated </span></em><strong class=\"root-Tkn6WL2y\"><span>David Fleischer M.D., Professor of Pediatrics at Children’s Hospital Colorado and Global Principal Investigator of the VITESSE study.</span></strong><span> </span><em><span>“The increases in eliciting dose seen are clinically meaningful and may reflect a reduced risk of an allergic reaction. Conversely, nearly four times as many children on placebo saw their eliciting dose decrease, becoming more sensitized over the twelve-month period. These results not only support the VIASKIN</span></em><em><span>®</span></em><em><span> Peanut Patch as a potential treatment option for peanut-allergic children, if approved, but also reinforce the importance of prioritizing a proactive treatment for this specific patient population.\"</span></em></p><p class=\"\"><em><span>“We believe the additional data presented today demonstrate that the VIASKIN</span></em><em><span>®</span></em><em><span> Peanut Patch consistently induced desensitization among subjects irrespective of study subgroup or baseline characteristics,” </span></em><span>stated </span><strong class=\"root-Tkn6WL2y\"><span>Pharis Mohideen M.D., Chief Medical Officer of DBV Technologies</span></strong><span>. </span><em><span>“If approved, the VIASKIN</span></em><em><span>®</span></em><em><span> Peanut Patch would provide caregivers with a non-invasive option that fits into daily activities. To that end, these data support a Biologics License Application, which we are planning to submit to FDA in the first half of this year.”</span></em></p><p class=\"\"><span>The presentation will be made available on the Scientific Publication &amp; Presentations page on the Company’s website at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=nRNLtY8UbDhfyVlWthUNnjv_v6snbJzK_FjFdt47ga7RoPjClf1FlF8VE34dRjIbMoZ9bsKZBRkQVVLMrhS-ALcy6xBnVbKan4l6DlYfpXcWs_urhVyokDbA6aB6QRPmgg1IGoHtRCWTYPxDa7JAdK4tTVUWJkwKuhYlwQNQun_wCX8kvtck6fYdtEZgG0JiB-DhclmNUmtnsyeh7cwgFpHjH7N-ePyXI0CuJzEwaiKnBCOk4fYE1ldjY6-pYzkeYutMTlb-pxNSqpyyCz4CS3HEeG7OOPbZQLbe0FzTfM2GOeBY5b-7tGLO84NoTheErQPEwgORQUOjN1vBytwkzoLhcXWVBBv_QeFUWHraYdWSHW83DwT5uxHPj_fJHj41gQwCYZ_cAM4bWHO2zQWOyMw3lw4VL8vWgWOMetSULtdJpllFnLHa8Nw69jqL7UZBtoPDtjXneUirLlW3PfThplxMCBZzTS1395BONpnFe6ZktS9qx4XJvdwd668_6vyAY2wgr37Rv18Oc4EPUvtChEHtJXN_FRrSHhXiTzl0ILpgUoBqqtAF-rGy0911DZ2R0kcRY6fjU8Q9EJ2Grd2olVoTEJHgrfEfRHpuqbHPjvkDdCHGoaD_YbMZVTlZ_DDflIuO6Nz6LrXIhtwTchBcrM1-z4wowcXnunDplkaFD5xZ_pzYxfsOuSQvkf4vydNnIpTd2u0IDdIbZJwPYNlvD6peT79X4D1A-iRsVY0OQp1k5iM24IUqGJPXj_xqFQYpQUuPgp2T28a4DYgPv8qjol0FoEfsrZl8rg-3hgAPRP4SMApyJCh9uyNMpWR5OXIO-1AW_1dWvkknE6iVnKnvOcQvkcp2CO7y8K1WRZ4lTFTTFHhqiJIk4ZLwyATzPtERFe9zPF4AiQ3jdWqzdQlZ7McmCTj3NXV1bg5jvro2NH_04kYurZmAWaLY0FpUQG-GYP95nz98zhMo67UnNVdUzEGLiXeXhyBG0G5CGk6_w-j5W1lz2n_DdI9WpwQeneMjvV0SZ2PZHLBU-J25fAz-kLByJtsGmP6KwjxBrik2qQs=\" rel=\"nofollow\" target=\"_blank\">https://dbv-technologies.com/events/aaaai-annual-meeting-2026/</a><span>.</span></p><p class=\"\"><span>*Responders were defined as children with a baseline eliciting dose (ED) ≤30 mg who achieved an ED ≥300 mg of peanut protein at month 12, or children with a baseline ED = 100 mg who achieved an ED ≥600 mg of peanut protein at month 12, as measured by a double-blind, placebo-controlled food challenge (DBPCFC). The ED is the amount of peanut protein that induced an allergic reaction. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About DBV Technologies</span></strong></p><p class=\"\"><span>DBV Technologies is a late-stage biopharmaceutical company developing treatment options for food allergies and other immunologic conditions with significant unmet medical need. DBV Technologies is currently focused on investigating the use of its proprietary VIASKIN® patch technology to address food allergies, which are caused by a hypersensitive immune reaction and characterized by a range of symptoms varying in severity from mild to life-threatening anaphylaxis. Millions of people live with food allergies, including young children. Through epicutaneous immunotherapy (EPIT), the VIASKIN® Patch is designed to introduce microgram amounts of a biologically active compound to the immune system through intact skin. EPIT is a new class of non-invasive treatment that seeks to modify an individual’s underlying allergy by re-educating the immune system to become desensitized to allergen by leveraging the skin’s immune tolerizing properties. DBV Technologies is committed to transforming the care of food allergic people. The Company’s food allergy programs include ongoing clinical trials of the VIASKIN® Peanut Patch in peanut allergic toddlers (1 through 3 years of age) and children (4 through 7 years of age).</span></p><p class=\"\"><span>DBV Technologies is headquartered in Châtillon, France, with North American operations in Warren, NJ. The Company’s ordinary shares are traded on segment B of Euronext Paris (DBV, ISIN </span><span>code:FR0010417345</span><span> and the Company’s ADSs (each representing five ordinary shares) are traded on the Nasdaq Capital Market (DBVT – </span><span>CUSIP:23306J309</span><span>.</span></p><p class=\"\"><span>For more information, please visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=rhGzOL8krc9ABygpZxS2WHHewoffyU5h841OFeGx_jQKGD-r3NEYEN5GkNc_eop0PpaWP53_F4CkMlkYfrrJ3-_lWerbT2jI-Yzf-dlOjEfwRnKHZN2L0VyIHgZDVvH7MH8IbtDEa0KiHDN7lRRnXz07Kb-n9IIPQYflxxtl3rfS9BMcriBPkIWUF2NIC7N8sCFYqEajEq19NAjMkk6THhLv3l-M9RvtOU8CGdzJZCJoOvQL4iaGd9nGMWLAfnHeYmf0lfqwgfYVJdAuwGmEOjkMqhw3lXdqs8eMcvTyPoR6PyQO0Ht3UXp0gzjyA-vEXbSlMk9A1wwN3OE5oxXNbpbbJkw5m0KPbzuER4qnlB04oT8DqM-mw66JlxlPEbt8SJeq5ZFKXqkhG4HiPV9AYX2gxV5gd8g6Qr4Y2CE9_xQ=\" rel=\"nofollow\" target=\"_blank\">www.dbv-technologies.com</a><span> and engage with us on X (formerly Twitter) and LinkedIn. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward Looking Statements</span></strong></p><p class=\"\"><span>This press release may contain forward-looking statements and estimates, including statements regarding the therapeutic potential of VIASKIN® Peanut patch and EPIT, results of DBV’s clinical trials, DBV’s planned regulatory and clinical efforts including timing and results of communications with regulatory agencies, plans and expectations with respect to the submission of BLAs to FDA, and the ability of any of DBV’s product candidates, if approved, to improve the lives of patients with food allergies. These forward-looking statements and estimates are not promises or guarantees and involve substantial risks and uncertainties. At this stage, DBV’s product candidates have not been authorized for sale in any country. Among the factors that could cause actual results to differ materially from those described or projected herein include uncertainties associated generally with research and development, clinical trials and related regulatory reviews and approvals, and DBV’s ability to successfully execute on its budget discipline measures. A further list and description of risks and uncertainties that could cause actual results to differ materially from those set forth in the forward-looking statements in this press release can be found in DBV’s regulatory filings with the French Autorité des Marchés Financiers (“AMF”), DBV’s filings and reports with the U.S. Securities and Exchange Commission (“SEC”), including in DBV’s Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on April 11, 2025, as amended by Amendment No. 1 on Form 10-K/A filed with the SEC on April 28, 2025, and as amended further by Amendment No. 2 on Form 10-K/A filed with the SEC on May 14, 2025, and future filings and reports made with the AMF and SEC by DBV. Existing and prospective investors are cautioned not to place undue reliance on these forward-looking statements and estimates, which speak only as of the date hereof. Other than as required by applicable law, DBV Technologies undertakes no obligation to update or revise the information contained in this Press Release.</span></p><p class=\"\"><span>The Company reminds that the going concern assessment is made as of the date of this press release based on management’s current assumptions. In accordance with U.S. GAAP, IFRS, SEC and AMF rules, the Company will update its going‑concern evaluation as of the issuance of its Annual Report on Form 10‑K and the universal registration document.</span></p><p class=\"\"><span>VIASKIN is a registered trademark of DBV Technologies.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Relations Contact</span></strong></p><p class=\"\"><span>Jonathan Neely</span></p><p class=\"\"><span>DBV Technologies</span></p><p class=\"\"><span>jonathan.neely@dbv-technologies.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact</span></strong></p><p class=\"\"><span>Brett Whelan</span></p><p class=\"\"><span>DBV Technologies</span></p><p class=\"\"><span>brett.whelan@dbv-technologies.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachment</span></strong><span> </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>PDF Version</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:efb81792f094b:0-dbv-technologies-highlights-additional-data-from-successful-phase-3-vitesse-study-at-the-aaaai-2026-annual-meeting/",
            "pub_date": "2026-03-01 03:25:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM3yBF0ra:0",
            "title": "YBS SA - Raport kwartalny za I kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_203103_0000001415_0000065199.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM9H097a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_203103_0000001415_0000065200.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM8StxYma\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM3yBF0ra:0-ybs-sa-raport-kwartalny-za-i-kwarta/",
            "pub_date": "2026-03-01 03:31:15",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:720c0148b094b:0",
            "title": "Dubai Hit by Iranian Retaliation as Gulf Tensions Escalate",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Following joint Israeli-US air strikes on Iran on Saturday morning, described by President Donald Trump as “major combat operations,” Iran launched retaliatory missile attacks targeting several cities across the Gulf.</span></p><p class=\"\"><span>Authorities in Kuwait, Qatar, Bahrain and the United Arab Emirates, as well as Jordan, said their air defence systems intercepted incoming missiles.</span></p><p class=\"\"><span>In Dubai, five large explosions were heard late in the afternoon, according to Reuters. </span></p><p class=\"\"><span>Footage circulating on social media appears to show an impact at a five-star hotel on Palm Jumeirah in Dubai following the Iranian ballistic missile attack.</span></p><p class=\"\"><span>A supermarket employee in Dubai’s Nshama Town Square told Reuters that some suppliers had warned they would not immediately restock certain goods. “This is not normal,” the worker said. “The water is already running out.”</span></p><p class=\"\"><span>Dubai has emerged as a major hub for CFD brokers in recent times, due in part to faster licensing approval times. XM, Exinity, VT Markets, Eightcap, EC Markets, Pepperstone, Taurex, and many others have a Category 5 licence, which is similar to an introducing broker licence in some other parts of the world.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/financemagnates:720c0148b094b:0-dubai-hit-by-iranian-retaliation-as-gulf-tensions-escalate/",
            "pub_date": "2026-03-01 02:17:31",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0FN:0",
            "title": "Market analysts react to US-Israel strikes on Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    The United States and Israel launched strikes on Iran on Saturday, targeting its leadership and plunging the Middle East into a new conflict that President Donald Trump said would end a security threat and give Iranians a chance to topple their rulers.</span></p><p class=\"\"><span>The strikes put nearby oil-producing Gulf Arab countries on edge as fears of escalation grew, and Tehran responded by launching missiles towards Israel. </span></p><p class=\"\"><span>Some oil majors and top trading houses suspended crude oil and fuel shipments via the Strait of Hormuz because of the attacks, four trading sources said on Saturday.    </span></p><p class=\"\"><span>QUOTES:</span></p><p class=\"\"><span>ENERGY ANALYSTS AT BARCLAYS:</span></p><p class=\"\"><span>\"Oil markets might have to face their worst fears on Monday. As things stand right now, we think Brent could hit $100 (per barrel), as the market grapples with the threat of a potential supply disruption amid a spiralling security situation in the Middle East.\"</span></p><p class=\"\"><span>VISHNU VARATHAN, HEAD OF MACRO RESEARCH, ASIA EX-JAPAN, MIZUHO, SINGAPORE:</span></p><p class=\"\"><span>\"A broader state of spots of regional attacks/instability may be par for the course - in line with Iran’s warning. Oil prices are likely to remain elevated as production and passage remain prone to attacks and disruptions. OPEC may be under pressure to raise production to try and offset. But a 10-25% premium on oil is not outlandish - even without a blockade of the Strait of Hormuz, which is easily a 50% premium risk event.\"</span></p><p class=\"\"><span>CHRISTOPHER WONG, STRATEGIST, OCBC, SINGAPORE:</span></p><p class=\"\"><span>\"The strike raises geopolitical risk premia as markets head into Monday’s open. The immediate reaction function is fairly predictable: safe-haven assets such as gold are likely to see an upside gap, while oil prices may also firm on supply-disruption concerns. Risk assets and high-beta currencies … could face an initial bout of volatility, particularly if headlines suggest potential retaliation or regional spillovers.\"</span></p><p class=\"\"><span>NICK FERRES, CIO, VANTAGE POINT ASSET MANAGEMENT, SINGAPORE:</span></p><p class=\"\"><span>\"Energy is still inexpensive. That’s the obvious sector that rallies on Monday. And gold.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0FN:0-market-analysts-react-to-us-israel-strikes-on-iran/",
            "pub_date": "2026-03-01 03:16:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO0BP:0",
            "title": "UK minister quits despite being cleared over alleged investigation of journalists",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Sam Tabahriti</span></p><p class=\"\"><span>    A British government minister resigned on Saturday even though a review found he had not breached the ministerial code after reports accused him of ordering the investigation of journalists while he was running a think-tank.</span></p><p class=\"\"><span>A review by Prime Minister Keir Starmer's ethics adviser cleared Josh Simons, a junior minister involved in government plans for a new digital ID scheme, of breaching the code. </span></p><p class=\"\"><span>    Simons' exit adds to a growing number of     official departures     in the less than two years that Starmer has been in office. Turmoil in recent weeks has triggered some calls within his own party for him     to resign.  </span></p><p class=\"\"><span>\"It is clear that my remaining in office has now become a distraction from this government's important work,\" Simons wrote in a letter to Starmer, published on the government's website. </span></p><p class=\"\"><span>\"For that reason, and with sadness and regret, I offer my resignation.\"</span></p><p class=\"\"><span>NO BASIS FOR BREACH</span></p><p class=\"\"><span>    Starmer said he accepted the resignation \"with sadness\".  </span></p><p class=\"\"><span>He ordered the review after reports that Simons, a former director of Labour Together, had paid a PR agency to investigate journalists who had written about the think-tank's finances.</span></p><p class=\"\"><span>    The review said Simons had hired APCO Worldwide because he believed Labour Together had been the victim of an illegal hack and had not intended the firm to scrutinise journalists. It said he accepted the terms of reference had been \"wider than he had understood\", creating a perception that the work went beyond examining the suspected hack.  </span></p><p class=\"\"><span>    The review said APCO's initial report included references to a British newspaper journalist, but that Simons had acted to have those removed. It said his public statements had been made in good faith and found \"no basis\" to advise the prime minister he had breached the ministerial code.  </span></p><p class=\"\"><span>    Labour Together, which used to be run by Starmer's former chief of staff Morgan McSweeney and is seen as close to the current government, did not immediately respond to a request for comment. Neither did APCO.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO0BP:0-uk-minister-quits-despite-being-cleared-over-alleged-investigation-of-journalists/",
            "pub_date": "2026-03-01 03:19:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM7KksXka:0",
            "title": "YBS SA - Raport kwartalny za IV kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_201951_0000001414_0000065195.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM4lLzJXa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_201951_0000001414_0000065196.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM22scJZa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM7KksXka:0-ybs-sa-raport-kwartalny-za-iv-kwarta/",
            "pub_date": "2026-03-01 03:20:05",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:3aee0a563094b:0",
            "title": "Ethereum Breakout Alert: Corrective Channel Flip Sparks Impulsive Wave",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Ethereum is showing signs of a major breakout after flipping a corrective price channel. This shift suggests the start of an impulsive wave, signaling potential strong upside momentum. Traders should watch for confirmation above key levels as the path for the next leg up begins to take shape.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Wave 3 In Motion: Preparing For A Strong Upside Move</span></strong></strong></p><p class=\"\"><span>Charting an expected path for Ethereum on the 4-hour timeframe, Elliott Waves Academy has revealed a significant opportunity to ride a new bullish wave. The price appears to be preparing for a powerful upward surge following a successful breach of its corrective price channel.</span></p><p class=\"\"><span>The technical structure indicates that Ethereum is likely forming Wave 3 of (3), with current projections showing the asset reaching a minimum 161.8% extension. However, the internal momentum suggests the potential for the move to extend further, signaling that a major impulsive rally is now officially underway.</span></p><p class=\"\"><span>From a strategic standpoint, any temporary bearish corrections would be viewed as high-probability opportunities for long re-entries. These minor pullbacks serve to reset local indicators while the primary trend remains firmly higher. Traders are currently eyeing the $2,624.14 level as a primary target, with the possibility of a move toward the 261.8% extension if the positive momentum remains sustained.</span></p><p class=\"\"><span>To validate and maintain this bullish scenario, it is critical to see a confirmed breakout and sustained trading above the previous price channel. Staying above this structural boundary will reinforce the upward outlook and provide the necessary support for the next leg of the rally. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum Sweeps Range High: Buyers Step In</span></strong></strong></p><p class=\"\"><span>According to Lennaert Snyder, Ethereum recently reached its all-time high and liquidity, setting the stage for a notable bounce after testing the extremes of its current range. This move reflects a strong recovery following aggressive price action and shows that buyers are actively defending key levels.</span></p><p class=\"\"><span>For traders looking at local setups, caution is advised. Given the recent massive displacement, it’s best to wait for clearer directional signals before entering positions, ensuring trades align with confirmed momentum rather than chasing volatility.</span></p><p class=\"\"><span>That said, the liquidity captured during this sweep opens up opportunities for hedge strategies. For example, a short position on the opposite side could help mitigate risk while waiting for the market to stabilize. Specific levels, such as the 50% wick fill around $2,110, may present interesting shorting opportunities after a bearish MSB forms.</span></p><p class=\"\"><span>Additionally, similar to Bitcoin, Ethereum left a significant Fair Value Gap (FVG) during the aggressive leg higher, with the 50% level of this gap near ~$1,970. Should the price retest this FVG, it could provide a favorable setup for long entries following a reversal, highlighting potential areas for strategic accumulation.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:3aee0a563094b:0-ethereum-breakout-alert-corrective-channel-flip-sparks-impulsive-wave/",
            "pub_date": "2026-03-01 03:00:37",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260224011317:0",
            "title": "Why more CEOs are taking a page from Elon Musk and chatting directly with customers",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Charles Passy</span></p><p class=\"\"><span>Executives say it's all about learning how to better run their businesses, but some corporate watchers question if this is just a PR move</span></p><p class=\"\"><span>Elon Musk is just one of a number of chief executives and business leaders who sometimes connects directly with customers.</span></p><p class=\"\"><span>Have a complaint about a company? Or even a compliment to share? The chief executive is expecting your call.</span></p><p class=\"\"><span>At least that's how some businesses are handling customer-service matters these days. Tom Curtis, president of Burger King's U.S. and Canada operations (QSR), recently announced that he's inviting customers to reach out to him and offer feedback. He's even posted a phone number - (305) 874-0520 - for all to give him a ring.</span></p><p class=\"\"><span>There \"is a broader perception that large brands are not listening closely enough, and taking action based on feedback,\" Curtis said in a statement to MarketWatch. \"I see that as an opportunity. Listening to guests has always been part of how we operate, but this step makes that commitment more personal and visible.\"</span></p><p class=\"\"><span>Curtis is in good company these days. You'll find there are a number of prominent executives who often connect with customers. Elon Musk has been known to respond via social media to complaints regarding his Tesla (TSLA) vehicles. Richard Branson, founder of the Virgin Group, has said he walks throughout Virgin planes \"asking for feedback from passengers and crew.\"</span></p><p class=\"\"><span>Many corporate watchers expect the trend will continue, if not become bigger, as companies look for any way to appear more authentic and genuine - and grow their business as a result.</span></p><p class=\"\"><span>\"CEOs are stepping in because they see an opportunity to break through ... by personally signaling a culture of commitment to customers' wants and needs,\" said G. Tomas M. Hult, a professor at Michigan State University and a business executive at the American Customer Satisfaction Index. Hult has also authored a Harvard Business Review paper looking at how CEOs respond to customers.</span></p><p class=\"\"><span>Some question whether these eager-to-connect executives are truly invested in their customers, or if they're just making it appear that way for the sake of publicity. Others wonder if a CEO may do more harm than good by effectively overriding the usual customer-service channels and protocols.</span></p><p class=\"\"><span>And that's to say nothing of the obvious fact that a CEO simply doesn't have the time to deal with every customer complaint - or even more than a handful of them.</span></p><p class=\"\"><span>It \"is not a scalable business model,\" Hult said. \"The real infrastructure of customer satisfaction depends on front-line customer service, sales and customer experience management personnel who are trained to handle these matters at volume.\"</span></p><p class=\"\"><span>'CEOs are stepping in because they see an opportunity to break through.'G. Tomas M. Hult, professor at Michigan State University and business executive at the American Customer Satisfaction Index</span></p><p class=\"\"><span>Burger King's Curtis and other executives who spoke with MarketWatch say they're well aware that their efforts constitute just a drop in the proverbial bucket in terms of dealing with customer issues. But they also say these interactions can be critical to their business.</span></p><p class=\"\"><span>\"Not every [customer] suggestion can or should be implemented, but identifying consistent patterns is incredibly valuable,\" said Curtis.</span></p><p class=\"\"><span>Executives are quick to cite instances when their findings from customer exchanges led to action.</span></p><p class=\"\"><span>Carina Radonich, co-owner and CEO of the Magic Moment Resort &amp; Kids Club in the Orlando, Fla., area, says it was during her regular conversations with guests that she learned people were frustrated with the limited schedule of the theme-park shuttle service. She also found that guests were disappointed that the resort's breakfast menu didn't vary from day to day.</span></p><p class=\"\"><span>So Radonich made changes, adding more shuttle trips and switching up the morning food offerings, adding things like breakfast burritos and stuffed croissants.</span></p><p class=\"\"><span>\"Small operational shifts like these drive higher guest satisfaction and repeat bookings,\" she said.</span></p><p class=\"\"><span>Sweetwater CEO Mike Clem adds a note to every shipment that goes out to customers. He also makes his email contact information readily available.</span></p><p class=\"\"><span>Not all such interactions with customers are tied to complaints. Mike Clem, the CEO of Sweetwater, a leading retailer of musical instruments, says about 80% of the comments he receives are positive. And Clem receives hundreds of comments a year, because he makes his email contact information readily available.</span></p><p class=\"\"><span>The responses include Sweetwater customers sending Clem photos of their home studios. \"They send them to me like it's pictures of their kids,\" he said.</span></p><p class=\"\"><span>Even if a customer has a complaint, Clem says it's all about building a personal connection - and he insists it's those connections that have helped the 47-year-old business reach nearly $2 billion in annual sales.</span></p><p class=\"\"><span>There may, however, be another motive for CEOs who offer customers a direct line. Earl Stewart, who owns a Toyota dealership in Lake Park, Fla., has red phones scattered throughout his busy operation - all of which enable customers to put in a call to him personally.</span></p><p class=\"\"><span>Stewart says that when his employees see a customer reaching for one of the phones, they often step in to see if they can resolve the issue themselves. In effect, the phones keep his staff mindful of customers - and that's what Stewart believes has helped his business win accolades and awards.</span></p><p class=\"\"><span>But Stewart doesn't deny that the phones also help from a brand standpoint, announcing that his dealership is customer-centric all the way up to the top guy.</span></p><p class=\"\"><span>\"It's big PR,\" said Stewart.</span></p><p class=\"\"><span>Time will tell if the Burger King exec's outreach is seen more as a publicity stunt, or if it's really about listening to customers and learning from them.</span></p><p class=\"\"><span>Jessica Kriegel, chief strategy partner at Culture Partners, a consulting firm that works with large organizations, says if an executive is truly trying to connect with customers, they don't necessarily have to announce it to the world.</span></p><p class=\"\"><span>\"I'm more impressed with the CEOs that don't have press releases,\" she said.</span></p><p class=\"\"><span>-Charles Passy</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260224011317:0/",
            "pub_date": "2026-03-01 03:08:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:2dc315f37094b:0",
            "title": "Crypto treasury companies likely to consolidate in 2026: Crypto exec",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The crypto treasury market is likely to consolidate this year amid the market downturn, as companies with operating businesses merge with or acquire those trading below net asset value (NAV), according to Wojciech Kaszycki, chief strategy officer of crypto infrastructure and treasury company BTCS.</span></p><p class=\"\"><span>Operating businesses, such as providing validator services for blockchain networks or offering public and private credit instruments, generate cash flow that give crypto treasury companies an edge over those that only accumulate crypto, Kaszycki told Cointelegraph.</span></p><p class=\"\"><span>This financial edge allows them to buy up companies treading water on their crypto investments or trading below the value of their crypto holdings, he said. Kaszycki added: </span></p><div class=\"blockquote-xrkxvh37\"><span>“If you consolidate with another player, sometimes two plus two equals six or more, you can win faster, because everybody in this market trading below net asset value is struggling.”</span></div><p class=\"\"><span>Crypto treasury companies experienced a market-wide downturn in 2025, with many companies’ stock prices dropping below the value of the crypto held on their balance sheets. The crypto treasury decline preceded the crypto market crash in October. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Crypto Biz: A Bitcoin treasury shareholder revolt</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tokenized public and private credit instruments as a revenue stream for crypto treasuries </span></strong></p><p class=\"\"><span>“In today's world, credit instruments are one of the biggest financial instruments used worldwide,” Kaszycki told Cointelegraph.</span></p><p class=\"\"><span>Public and private credit instruments could also be tokenized on blockchain networks, Kaszycki said. </span></p><p class=\"\"><span>“I believe tokenized real-world assets (RWA), especially tokenization of public and private credit, is something that will grow a lot in the next 24 months,” he said. </span></p><p class=\"\"><span>These RWAs could be used as collateral on decentralized finance (DeFi) platforms, including lending or borrowing applications, he said.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1142.3999999999999px;aspect-ratio:1.904\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:2dc315f37094b-176ddf275a24708be3994d4b36be7532-resized.webp\" type=\"image/webp\"/><img alt=\"MicroStrategy, RWA, RWA Tokenization, Companies\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:2dc315f37094b-176ddf275a24708be3994d4b36be7532-resized.webp\" style=\"background-color:#f4f4f9\"/></picture></div></button></figure><p class=\"\"><span>Strategy, the biggest Bitcoin (BTC) treasury company in the world, offers credit-like and fixed-income instruments to the investing public. </span></p><p class=\"\"><span>The company cited its fixed-income instruments as one of the reasons that MSCI, an index provider, should include Strategy and other similar crypto treasury companies in its stock indexes.</span></p><p class=\"\"><span>“Strategy’s treasury operations are designed to provide investors with varying degrees of economic exposure to Bitcoin by offering a range of securities, including equity and fixed income instruments,” Strategy wrote in response to MSCI.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><span>‘China’s MicroStrategy’ Meitu sells all its Bitcoin and Ethereum: Asia Express</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:2dc315f37094b:0-crypto-treasury-companies-likely-to-consolidate-in-2026-crypto-exec/",
            "pub_date": "2026-03-01 02:56:44",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000910:0",
            "title": "The Financial Implications of Having a Relationship With the Boss — Journal Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Heidi Mitchell</span></p><p class=\"\"><span>Most people know someone who's dated their boss. In fact, office romances, especially those with power imbalances, are so common that they barely register as scandal — more than 25% of U.S. workers have engaged in a romantic relationship with a colleague, 18% of which were with a superior, according to the Society for Human Resources Managers.</span></p><p class=\"\"><span>But there has been little evidence on the financial impact of these relationships on the people involved.</span></p><p class=\"\"><span>Now, new research offers just such evidence, and finds that the financial benefits and costs are substantial — especially for women.</span></p><p class=\"\"><span>Previous research on office romances \"focused on clearly unacceptable behavior, where the lines are pretty black and white,\" says Emily Nix, an associate professor of finance and business economics at the University of Southern California's Marshall School of Business. \"But no one really looked at consensual relationships.\"</span></p><p class=\"\"><span>An earnings jump</span></p><p class=\"\"><span>Nix couldn't find good data sets in the U.S., but she did find it in Finland. She was able to examine heterosexual couples working in the same establishment, and where one partner is a manager and the other is not. She then compared them to workers with the same background who also date managers employed elsewhere. Nix then tracked the subordinates' earnings before and after relationships began and ended.</span></p><p class=\"\"><span>Her findings were clear: When a female subordinate enters a relationship with a male manager at the same workplace, the subordinate's earnings rise by about 6% over two years, on top of typical wage increases. \"Even in years three and four into the relationship, her gains are still larger than a similar woman who also dates a manager, but at a different workplace,\" Nix says.</span></p><p class=\"\"><span>When men date a boss, the increase in wages is even more pronounced — more than twice what women experienced, she says. However, those situations are much rarer.</span></p><p class=\"\"><span>Then there is the downside: When these office relationships end, women subordinates see their earnings drop roughly 18% the year after the breakup — mainly because many of them end up leaving the company. And their salaries remain substantially lower than what they had been for at least four years.</span></p><p class=\"\"><span>By contrast, Nix didn't find a significant income effect for men after breakups with their female managers. Again, the reason is primarily due to the fact that far fewer men end up leaving the company when a relationship ends.</span></p><p class=\"\"><span>Nix points to two possible reasons why office relationships can be both beneficial and so costly. On the upside, there is obvious nepotism: Managers may favor their romantic partners when handing out raises, bonuses or promotions. Also, managers may mentor their partners, increasing their skills and productivity.</span></p><p class=\"\"><span>For co-workers, she says, both reasons can hurt morale. The result is that when a manager--subordinate relationship begins, the retention rate among other workers at the same establishment falls by 6 percentage points. The churn is especially pronounced in small firms, where favoritism is hard to hide and easy to resent.</span></p><p class=\"\"><span>The HR dilemma</span></p><p class=\"\"><span>Rather than forbidding relationships, which is likely to be ineffective and unpopular, Nix suggests that firms can limit their impact by at minimum removing managers from making decisions about the pay, bonuses and promotions of romantic partners. That kind of firewall, she argues, can reduce perceptions of favoritism and protect subordinates (who are mostly women) if the relationship ends.</span></p><p class=\"\"><span>For employees, Nix suggests they first talk to their HR departments to see what protections are in place, so their career trajectories don't depend on the success of their in-office romance. \"They should also have a game plan for what they would do if the relationship were to end,\" Nix adds.</span></p><p class=\"\"><span>Dating at work isn't going away, but the impact can't be understated, she says. \"Dating the boss is a double-edged sword,\" she says. \"There may be some benefits to you personally, but there will always be a question mark around you and your success.\"</span></p><p class=\"\"><span>Write to reports@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000910:0/",
            "pub_date": "2026-03-01 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0BY:0",
            "title": "Berkshire CEO Abel seeks to reassure shareholders after taking baton from Buffett",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel emphasizes trust, Berkshire values</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Analysts say Abel struck the right tone</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Berkshire reports declining profit for Q4, 2025</span></li></ul></span></div><span><p class=\"\"><span>By Jonathan Stempel</span></p><p class=\"\"><span>    Berkshire Hathaway's </span><span> new Chief Executive Greg Abel moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its \"fortress-like\" balance sheet and uphold the values of his predecessor and mentor, Warren Buffett.</span></p><p class=\"\"><span>Abel, 63, said he wouldn't rush to deploy Berkshire's near-record $373.3 billion cash stake, though he said it gave the company plenty of \"dry powder\" and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has not repurchased its own stock since the spring of 2024.</span></p><p class=\"\"><span>\"I recognize how you want us to succeed together, and to do so in the right way,\" Abel wrote in an 18-page, single-spaced letter. \"My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.\"</span></p><p class=\"\"><span>Abel also paid homage to Buffett, 95, who remains chairman and goes to Berkshire's offices five days a week, calling him a \"remarkable\" CEO.</span></p><p class=\"\"><span>\"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen,\" Abel wrote. \"To invest in Berkshire has long been a vote of trust in our founder – a trust that now rests with Berkshire.\"</span></p><p class=\"\"><span>Berkshire shares have significantly underperformed the Standard &amp; Poor's 500 index </span><span> since Buffett announced unexpectedly in May he was stepping aside as CEO.</span></p><p class=\"\"><span>Though Abel's letter lacked Buffett's writing flair, CFRA Research analyst Cathy Seifert said it might prove reassuring to investors.</span></p><p class=\"\"><span>\"He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,\" she said. \"In my opinion, he hit the mark.\"</span></p><p class=\"\"><span>The letter also signaled that Abel wouldn't upend Buffett's 60 years of work transforming Berkshire from a failing textile company into a more than $1 trillion conglomerate that owns car insurer Geico, BNSF railroad and dozens of other insurance, manufacturing, energy and retail businesses.</span></p><p class=\"\"><span>\"If there were any doubts about whether Greg was the right individual to take the reins, the letter should dispel them,\" said Dan Hanson, who oversees more than $6 billion as head of the quality equity team at Neuberger Berman. </span></p><p class=\"\"><span>PROFIT DECLINES</span></p><p class=\"\"><span>Berkshire also reported declining profit, after taking writedowns for its approximately 27% stakes in both Kraft Heinz </span><span> and oil company Occidental Petroleum </span><span>.</span></p><p class=\"\"><span>Fourth-quarter operating profit fell 30% to $10.2 billion as income from insurance operations such as Geico declined.</span></p><p class=\"\"><span>Net income fell 3% to $19.2 billion, reflecting a $4.5 billion writedown for Occidental, despite gains from equity holdings led by Apple </span><span> and American Express </span><span>.</span></p><p class=\"\"><span>For all of 2025, operating profit fell 6% to $44.49 billion, while net income fell 25% to $66.97 billion. Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules for equity investments.</span></p><p class=\"\"><span>Full-year revenue was essentially unchanged at $371.44 billion, and Seifert said Abel \"teed up an expectation that reinsurance and commercial insurance growth may be nonexistent\" in 2026.\"</span></p><p class=\"\"><span>One of Berkshire's best-known businesses, Fruit of the Loom, shed 6,000 jobs last year as revenue fell, Berkshire said.</span></p><p class=\"\"><span>WILDFIRE-BATTERED PACIFICORP UTILITY 'NOT A DEEP POCKET'</span></p><p class=\"\"><span>Abel said Berkshire's culture and values will continue \"in perpetuity,\" and signaled no changes in its decentralized structure in which its dozens of businesses operate largely without interference from the top.</span></p><p class=\"\"><span>He also signaled a willingness to stick around, suggesting that in 20 years he will have had \"just a fraction of the tenure that Warren had.\"</span></p><p class=\"\"><span>Abel pledged to invest in durable, well-managed businesses that Berkshire understands and \"avoid businesses that undermine the fabric of society or could jeopardize Berkshire's reputation.\"</span></p><p class=\"\"><span>He didn't elaborate, but Seifert said he could have been referring to artificial intelligence. </span></p><p class=\"\"><span>Abel acknowledged pressures on its PacifiCorp utility from litigation over Oregon and California wildfires that burned more than 500,000 acres in 2020.</span></p><p class=\"\"><span>Many victims blame PacifiCorp, saying it failed to shut off power lines. The utility has reached more than $2.2 billion of settlements, but faces $50 billion of additional wildfire claims. Abel said Berkshire accepts responsibility when it causes wildfires, but will fight unjustified claims in court.</span></p><p class=\"\"><span>\"PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,\" Abel said. \"Accountability, paired with principled opposition to unwarranted liability, is essential to preserving the regulatory compact that governs utilities.\" </span></p><p class=\"\"><span>TED WESCHLER STAYS ON</span></p><p class=\"\"><span>Abel was more critical than Buffett of Berkshire businesses that could perform better.</span></p><p class=\"\"><span>He said the performance gap between BNSF and industry-leading rivals is \"too wide,\" while \"self-inflicted\" difficulties at the Shaw flooring company hurt quality and service.</span></p><p class=\"\"><span>\"Each business is accountable to its CEO, who is expected to pursue operational excellence relentlessly and close performance gaps,\" Abel said, referring to Berkshire's non-insurance businesses.</span></p><p class=\"\"><span>Hanson, the Neuberger Berman investment manager, said: \"Those are fighting words.\"</span></p><p class=\"\"><span>Berkshire has not named a chief investment officer to replace Buffett, though Abel said responsibility for equity investments \"ultimately resides with me as CEO.\"</span></p><p class=\"\"><span>Abel signaled that longtime portfolio manager Ted Weschler, who manages about 6% of Berkshire's equity investments, will continue playing a \"broader role\" assessing significant investment opportunities and supporting Berkshire in other ways.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0BY:0-berkshire-ceo-abel-seeks-to-reassure-shareholders-after-taking-baton-from-buffett/",
            "pub_date": "2026-03-01 02:46:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM7Nq6GVa:0",
            "title": "YBS SA - Raport kwartalny za III kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_194632_0000001413_0000065191.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEMb7Jj5qa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_194632_0000001413_0000065192.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM6xPvLKa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM7Nq6GVa:0-ybs-sa-raport-kwartalny-za-iii-kwarta/",
            "pub_date": "2026-03-01 02:46:47",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0FK:0",
            "title": "Barclays says Brent crude oil could reach $100 a barrel after US and Israel strike Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Scott DiSavino</span></p><p class=\"\"><span>    Barclays boosted its Brent crude oil futures price forecast to around $100 per barrel on Saturday, up from $80 on Friday, after the United States and Israel </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/iran-crisis-live-explosions-tehran-israel-announces-strike-2026-02-28/\" rel=\"nofollow\" target=\"_blank\">bombed several sites in Iran</a><span>.</span></p><p class=\"\"><span>\"Oil markets might have to face their worst fears on Monday. As things stand right now, we think Brent could hit $100 (per barrel), as the market grapples with the threat of a potential supply disruption amid a spiraling security situation in the Middle East,\" the bank said in a report.</span></p><p class=\"\"><span>The United States and Israel attacked Iran on Saturday, targeting its top leaders and calling for the overthrow of its government, while Iran responded with missiles fired at Israel and neighboring Gulf countries.</span></p><p class=\"\"><span>Oil prices rose about 2% on Friday, with traders bracing for supply disruptions as nuclear talks between the U.S. and Iran had yet to reach an agreement.  Brent </span><span> settled at $72.48 a barrel.</span></p><p class=\"\"><span>    About a fifth of     the     oil consumed globally passes through the     Strait of Hormuz     between Oman and Iran, making any disruptions in     the     area a major risk to global oil supplies.  </span></p><p class=\"\"><span>Iran and fellow Organization of the Petroleum Exporting Countries members Saudi Arabia, United Arab Emirates, Kuwait and Iraq export most of their crude via the strait, mainly to Asia.</span></p><p class=\"\"><span>In 2025, Iran was the third-biggest crude producer in OPEC behind Saudi Arabia and Iraq, according to U.S. Energy Information Administration data.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0FK:0-barclays-says-brent-crude-oil-could-reach-100-a-barrel-after-us-and-israel-strike-iran/",
            "pub_date": "2026-03-01 02:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000864:0",
            "title": "Iran May Close the Strait of Hormuz. Why Shipping Stocks Would Benefit. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Ben Levisohn</span></p><p class=\"\"><span>Iran appears to have effectively closed the Strait of Hormuz in response to U.S. and Israeli attacks on the county. While that could cause oil prices to spike, it could be good news for shipping stocks, including Frontline and DHT Holdings.</span></p><p class=\"\"><span>The Wall Street Journal reported Saturday that Iran's Islamic Revolutionary Guard Corps, or IRGC, has warned ships not to travel through the Strait of Hormuz, a major shipping corridor, especially for the transportation of oil. According to OPIS' Energy Markets team, 26% of the crude oil trade and 23% of liquefied natural gas goes through the strait, and a prolonged closure could cause oil prices to surge even higher.</span></p><p class=\"\"><span>Major escalations have historically caused shipping rates to spike, according to Evercore analyst Jonathan Chappell. In a report published last year, he noted that \"very large crude carrier\" prices spiked more than 40% at the start of the first Gulf War in 1991, and by as much as 304% during the second Gulf War, though that was complicated by China's entry into the World Trade Organization.</span></p><p class=\"\"><span>Tanker stocks, as a group, have already started to reflect the possibility of this outcome. Ardmore Shipping has gained 55% this year, while DHT Holdings has climbed 60%, Frontline has surged 74%, Nordic American Tanker Shipping has soared 67%, Scorpio Tankers has risen 56%, Teekay Tankers has advanced 47%, and TORM PLC. is up 54%. The S&amp;P 500 has risen just 0.5% in 2026.</span></p><p class=\"\"><span>The higher rates have already shown up in earnings. Frontline, which reported results on Friday morning, has \"booked 92% of its 1Q26 VLCC spot days at an average rate of $107,100/day...[which] would represent the highest since the heydays of 2Q08,\" Chappell wrote after the release, while raising his price target to $42 from $31. \"Still, FRO is the alpha male of the crude tanker market and retains material exposure to a spot market that has been leaping to all-time highs of late. Consequently, our estimates for the near term are likely to remain conservative until the tanker spot market comes back to earth. Until that time, FRO is likely to retain upside equity appreciation potential.\"</span></p><p class=\"\"><span>Until it doesn't.</span></p><p class=\"\"><span>Write to Ben Levisohn at ben.levisohn@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000864:0/",
            "pub_date": "2026-03-01 02:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002012:0",
            "title": "U.S. strikes on Iran will likely boost defense stocks. Here's what will keep the cash flowing even after the conflict ends.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Jurica Dujmovic</span></p><p class=\"\"><span>A massive backlog of maintenance and software contracts will ensure recurring revenue</span></p><p class=\"\"><span>A Lockheed Martin F-22 Raptor 4001 stealth fighter is silhouetted against the setting sun in this undated file photo. Saturday's strikes on Iran by the U.S. and Israel will likely shine an even bigger spotlight on defense stocks.</span></p><p class=\"\"><span>Wars end. Maintenance contracts do not.</span></p><p class=\"\"><span>Defense stocks have been treated as geopolitical barometer. When tensions rise and military conflict breaks out, shares climb. When headlines cool, the trade fades. It's a narrative built around procurement cycles and crisis-driven spending. The attack on Tehran on Saturday by Israel and the U.S. should repeat this pattern for defense stocks in coming days.</span></p><p class=\"\"><span>But something more structural and long-term has been unfolding, something that looks far less like a one-off weapons sale and more like a long-term service contract. Parts of the defense industry are beginning to resemble subscription businesses, recurring revenue layered on top of a growing installed base.</span></p><p class=\"\"><span>For investors focused on earnings durability rather than war headlines, that distinction matters.</span></p><p class=\"\"><span>Weapons systems have evolved from disposable purchases to multi-decade ecosystems nowadays. Once a country fields a fleet of fighter jets, missile defense batteries, or naval destroyers, it commits to years or even decades of operating and support costs.</span></p><p class=\"\"><span>The Government Accountability Office has repeatedly noted that operating and support costs can account for roughly 70% of a major weapon system's total life-cycle cost, according to recent GAO report. Upkeep includes spare parts, depot maintenance, training, software updates, systems integration and availability guarantees. Since national defense cannot tolerate downtime, readiness spending tends to persist even when procurement ebbs.</span></p><p class=\"\"><span>In practical terms, the contractor that builds the platform often remains embedded in its upkeep. Every additional aircraft delivered expands the pool of long-term maintenance, logistics and modernization revenue.</span></p><p class=\"\"><span>That dynamic increasingly resembles aerospace aftermarket economy (and, in some respects, enterprise software) where installed bases drive recurring cash flow. Three companies that stand to benefit: Lockheed Martin (LMT); RTX (RTX) and Northrop Grumman (NOC).</span></p><p class=\"\"><span>Lockheed Martin: The ecosystem model: Lockheed Martin provides the clearest example of this shift. The F-35 program represented 26% of consolidated net sales in 2024, according to the company's latest Form 10-K. The filing explicitly states that F-35 revenue includes development, production, and maintenance, underscoring how support and logistics are embedded in the program's economy.</span></p><p class=\"\"><span>Service sales increased in 2024, driven in part by higher volume on F-35 upkeep contracts, the company disclosed in that same annual report.</span></p><p class=\"\"><span>By the end of 2025, Lockheed Martin reported a record $194 billion backlog and strong free cash flow generation in its full-year earnings release. That backlog provides multi-year revenue visibility that many industrial companies lack.</span></p><p class=\"\"><span>Support performance is not immune from scrutiny; a Pentagon watchdog has recently criticized aspects of F-35 maintenance and aircraft availability. Recurring revenue in defense is contractual and performance-based, not automatic.</span></p><p class=\"\"><span>Even so, the installed-base effect is unmistakable: every aircraft delivered expands a long-term revenue stream tied to readiness and modernization.</span></p><p class=\"\"><span>RTX: Installed base, diversified: RTX offers a different version of installed-base economy. The company has recently reported strong sales growth and highlighted a backlog approaching $268 billion, according to its latest earnings results.</span></p><p class=\"\"><span>On the defense side, missile systems and air defense platforms require ongoing upgrades and upkeep. Collins Aerospace operates within a vast installed base of aircraft systems that generate recurring parts and maintenance demand, the approach the company emphasizes in its investor materials.</span></p><p class=\"\"><span>Commercial aftermarket revenue behaves in many ways like an annuity tied to flight hours, while defense modernization cycles add a second layer of durability. The combination smooths earnings compared to pure production-driven models.</span></p><p class=\"\"><span>Northrop Grumman and the long arc of modernization: Northrop Grumman's portfolio is heavily weighted toward advanced systems - stealth aircraft, space assets, sensors and mission technologies.</span></p><p class=\"\"><span>Once fielded, those systems demand continuous upgrades and integration work as modern defense doctrine emphasizes ongoing modernization rather than static platforms. Sensors are refreshed. Software evolves. Networks expand. The company ended 2025 with backlog nearing $95.7 billion, according to its most recent annual report.</span></p><p class=\"\"><span>Northrop's strength in high-end systems integration positions it to benefit from that long modernization arc, although development-heavy programs can introduce project timing volatility.</span></p><p class=\"\"><span>The software layer: Defense as ongoing service: The transformation is perhaps the most visible in defense's growing digital footprint. The U.S. Defense Department's Joint Warfighting Cloud Capability contract vehicle reflects a shift toward acquiring commercial cloud services across classification levels.</span></p><p class=\"\"><span>Software-native companies like Palantir Technologies (PLTR) operate directly in that layer, providing analytics and AI systems through multi-year government contracts. Recent analyst coverage has highlighted the company's expanding government engagements and recurring revenue profile.</span></p><p class=\"\"><span>While valuation and volatility differ from traditional primes, the software layer most closely resembles true subscription economy within defense budgets.</span></p><p class=\"\"><span>The market may be behind the curve</span></p><p class=\"\"><span>Despite these structural shifts, defense contractors are often valued like cyclical industrial companies. The implicit assumption is that earnings are driven primarily by procurement wins and geopolitical events.</span></p><p class=\"\"><span>If maintenance, modernization and software continue rising as a share of revenue, that assumption will grow increasingly incomplete. Recurring support contracts and installed-base monetization can dampen earnings swings and support steadier free cash flow.</span></p><p class=\"\"><span>At the same time, intellectual property and data rights in maintenance contracts is a critical issue that the U.S. Government Accountability Office examined in its recent review of IP and sustainment planning. Control over technical data can shape who captures margin over the life of a program.</span></p><p class=\"\"><span>Markets tend to reward predictability. Businesses with durable cash flows often command stronger valuation multiples than those dependent on episodic demand. If defense contractors continue migrating toward service-heavy revenue mixes, the sector's risk profile may increasingly resemble infrastructure rather than crisis trade.</span></p><p class=\"\"><span>Defense stocks will continue to react to geopolitical headlines, but beneath those swings lies a structural evolution in how revenue is generated and sustained. The companies that control large, technologically complex installed bases -aircraft fleets, missile systems, naval platforms, secure networks - are not merely selling equipment. They are managing ecosystems that require continuous funding to remain operational.</span></p><p class=\"\"><span>This shift reframes the opportunity. Defense may no longer be just a trade on conflict. Increasingly, it resembles a long-duration cash-flow business anchored in readiness, modernization and software-driven support.</span></p><p class=\"\"><span>The market may still be pricing yesterday's model. Wars end. Maintenance contracts do not.</span></p><p class=\"\"><span>Read: Trump says 'massive' strike against Iran underway - bitcoin plunge offers a glimpse of how markets could react</span></p><p class=\"\"><span>-Jurica Dujmovic</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002012:0/",
            "pub_date": "2026-03-01 02:12:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "eqs:7214c309c094b:0",
            "title": "Athletes from Sweden and the Netherlands Win Medals at the Olympic Winter Games Milano Cortina 2026 as Team TCL Ambassador Reaches the Podium",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span> </span></p><p class=\"\"><span>TCL Europe/ Key word(s): Miscellaneous </span></p><p class=\"\"><span> Athletes from Sweden and the Netherlands Win Medals at the Olympic Winter Games Milano Cortina 2026 as Team TCL Ambassador Reaches the Podium </span></p><p class=\"\"><span> 28.02.2026 / 19:15 CET/CEST</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>MILAN, Feb. 28, 2026 /PRNewswire/ -- At the </span><strong class=\"root-Tkn6WL2y\"><span>Olympic Winter Games Milano Cortina 2026</span></strong><span>, athletes from Sweden and the Netherlands, part of Team TCL, secured multiple medals, delivering standout performances that represent milestones in their careers. These achievements are a proud moment for both the athletes and Team TCL, as part of TCL's role as the Official Worldwide Olympic and Paralympic Partner in the Home Audiovisual Equipment and Home Appliances category.</span></p><p class=\"\"><span>Swedish athletes Ebba Andersson, Frida Karlsson, and Jonna Sundling, along with Dutch athlete Joy Beune, claimed </span><strong class=\"root-Tkn6WL2y\"><span>a total of 11 medals </span></strong><span>across individual and team events in cross-country skiing and speed skating, including four gold and seven silvers. TCL's global brand ambassador Eileen Gu secured a gold medal in the Women's Freeski Halfpipe, as well as silver medals in the Women's Freeski Slopestyle and Women's Freeski Big Air.</span></p><p class=\"\"><span>These podium finishes highlight the outstanding performance and strength of athletes competing at Milano Cortina 2026, inspiring greatness among audiences worldwide.</span></p><p class=\"\"><span>As a global leader in consumer electronics and the world's No. 1 Mini LED TV brand in the first half year of 2025, TCL unveiled its flagship SQD-Mini LED TV X11L at CES 2026, which won the Innovative Display Technology Gold Award for its exceptional color accuracy, display stability, and visual performance. With cutting-edge display and audio technologies, TCL continues to redefine the viewing experience, bringing fans an immersive, up-close feel of Winter Olympic Games action.</span></p><p class=\"\"><span>In the same way that the Olympic Games inspire people worldwide to surpass their limits, Team TCL encourages everyone to embrace its vision of \"</span><strong class=\"root-Tkn6WL2y\"><span>Inspire Greatness\",</span></strong><span> not only through TCL products that surpass the imagination, but also athletes who constantly raise the bar both on and off the field, and individuals who bravely push boundaries in their daily lives.</span></p><p class=\"\"><span>TCL is bringing athletes, fans, and families closer together during Milano Cortina 2026. With TCL technology in the </span><strong class=\"root-Tkn6WL2y\"><span>Athletes' Village</span></strong><span>, competitors can relax, unwind and celebrate meaningful moments together with their friends and family. As the sponsor of the </span><strong class=\"root-Tkn6WL2y\"><span>Athlete Moment</span></strong><span>, TCL will also use its display technology, provided at the side of the field of play, to allow athletes to connect with their families and friends immediately after competing, enabling meaningful moments of celebration and joy right in the thick of the action. </span></p><p class=\"\"><span>Commenting on their performance, Team TCL ambassadors said:</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ebba Andersson (Sweden, Cross-Country Skiing) </span></strong><span>\"This sport rewards consistency, otherwise greatness can't be achieved. Seeing all the preparation come to life and standing on the podium four times during this year's Olympic Winter Games has been a dream come true, and I'm grateful to TCL for supporting me.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Frida Karlsson (Sweden, Cross-Country Skiing) </span></strong><span>\"There's always pressure at the highest level, but greatness is only achieved when you push out of your comfort zone. Securing several podium finishes this year has been a real pinch-me moment, and I'm thankful to TCL for inspiring me to keep moving forward and believing in the power of perseverance.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jonna Sundling (Sweden, Cross-Country Skiing) </span></strong><span>\"The feeling of winning never gets old! I'm so proud to have represented my country and picked up three medals at this year's Olympic Winter Games and I am thankful to TCL for supporting my journey to get here, and helping share the joy and spirit of winter sports with fans everywhere.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Joy Beune (Netherlands, Speed Skating)</span></strong><span> \"I'm honored to have achieved a podium finish as part of the Dutch team at the Olympic Winter Games, and grateful for all the support from my loved ones and partners in making this dream a reality. Being part of Team TCL has reminded me that greatness is all about showing up and carrying that mindset into everyday life.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About TCL </span></strong><span> </span></p><p class=\"\"><span>TCL Electronics specializes in the research, development and manufacturing of consumer electronics including TVs, audio devices, smart home products and appliances. Combining thoughtful design and innovative technology to inspire greatness, our lineup delivers must-have features and meaningful experiences. As one of the world's largest consumer electronics brands, our vertically integrated supply chain, and state-of-the-art display panel factory help TCL deliver innovation for all. For more information, please visit: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=fe74e4c3540049e779c09e25e8fa99e6&amp;application_id=2283326&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://www.tcl.com</a><span> </span></p><p class=\"\"><span>TCL is a registered trademark of TCL Corporation. All other trademarks are the property of their respective owners. </span></p><p class=\"\"><span>Photo - </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=7a0d537667a203906da2c2bc5fa5673f&amp;application_id=2283326&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://mma.prnewswire.com/media/2922743/Team_TCL_at_Milano_Cortina_2026.jpg</a><span> </span></p><p class=\"\"><span> View original content:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=d0a7dd307d873a49554c1772310ae1e2&amp;application_id=2283326&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.co.uk/news-releases/athletes-from-sweden-and-the-netherlands-win-medals-at-the-olympic-winter-games-milano-cortina-2026-as-team-tcl-ambassador-reaches-the-podium-302700218.html</a></p><p class=\"\"><span> 28.02.2026 CET/CEST Dissemination of a Corporate News, transmitted by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=2be925ac0334ae7b4f51fbaee4a6daf0&amp;application_id=2283326&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS News</a><span> - a service of </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=f5d50dc7e8798b6eb177f7955e598e60&amp;application_id=2283326&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS Group</a><span>.</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>The EQS Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.</span></p><span> </span><p class=\"\"><span>2283326 28.02.2026 CET/CEST </span><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>Saving the news in databases or any forwarding of the news to third parties in a commercial context or for commercial purposes is only permitted with the prior written consent of EQS Group AG.</span></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/eqs:7214c309c094b:0-athletes-from-sweden-and-the-netherlands-win-medals-at-the-olympic-winter-games-milano-cortina-2026-as-team-tcl-ambassador-reaches-the-podium/",
            "pub_date": "2026-03-01 02:15:22",
            "source": "EQS",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:953679da0094b:0",
            "title": "Vitalik Buterin Lays Out A Plan To Make Ethereum 1,000 Times More Capable",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The number sounds almost too big to take seriously. Ethereum co-founder Vitalik Buterin posted a detailed technical roadmap on February 27 outlining how the network could handle up to 1,000 times its current transaction capacity — without pricing out the smaller node operators who keep the system decentralized.</span></p><p class=\"\"><span>The document, which Buterin informally calls the “Strawmap,” breaks the work into three problem areas: execution, data, and state.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Near-Term Upgrades Come First</span></strong></p><p class=\"\"><span>The closest item on the list is an upcoming protocol upgrade called “Glamsterdam.” According to reports, one of its key changes introduces block-level access lists — a technical adjustment that allows different parts of a block to be processed simultaneously rather than one after another.</span></p><p class=\"\"><span>Reports also say the upgrade improves how efficiently each 12-second block slot is used, making it safer to pack more transactions into every block without destabilizing the network.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">vitalik.eth</div><div class=\"username-n2KCMK3i\">@VitalikButerin</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>Now, scaling.</span></p><p class=\"\"><span>There are two buckets here: short-term and long-term.</span></p><p class=\"\"><span>Short term scaling I’ve written about elsewhere. Basically:</span></p><p class=\"\"><span>* Block level access lists (coming in Glamsterdam) allow blocks to be verified in parallel. * ePBS (coming in Glamsterdam) has many features, of…</span></p></div><span class=\"date-n2KCMK3i\">Feb 27, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/VitalikButerin/status/2027403360484430122\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>Buterin acknowledged that these changes, combined with better client software, might be enough to reach a stable state on their own. If real usage stays low, he suggested the full 1,000x push could be shelved in favor of other priorities entirely.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Zero-Knowledge Proofs Take Center Stage In Longer Plans</span></strong></p><p class=\"\"><span>The more ambitious part of the roadmap involves zero-knowledge Ethereum Virtual Machines, or ZK-EVMs. Rather than requiring every validator to re-run every transaction to confirm it is legitimate, ZK-EVMs allow validators to check cryptographic proofs instead — a far lighter task.</span></p><p class=\"\"><span>According to reports, Buterin’s timeline calls for a small group of validators to begin using this method as early as 2026, with broader adoption potentially following in 2027. If that plays out, the network’s capacity ceiling could be raised significantly without forcing node operators to invest in more powerful hardware.State Growth Gets Its Own Fix </span></p><p class=\"\"><span>Reports say Buterin flagged state growth as a separate and underappreciated problem. Deploying a large smart contract adds data that every Ethereum node must store permanently — and that accumulated storage gradually raises the cost of running a node at all.</span></p><p class=\"\"><span>His proposed fix tracks state creation gas independently, so it does not count against the regular transaction gas cap. Large contracts could still be deployed, but their pricing would reflect the real long-term storage cost.</span></p><p class=\"\"><span>The 1,000x figure is a long-term ceiling, not a promise for next year. Each phase of the plan depends on the one before it working as intended.</span></p><p class=\"\"><em><span>Featured image from Unsplash, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:953679da0094b:0-vitalik-buterin-lays-out-a-plan-to-make-ethereum-1-000-times-more-capable/",
            "pub_date": "2026-03-01 02:00:57",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:8ecc9f939094b:0",
            "title": "Judge blocks Binance from pushing class action suits over token sales into arbitration",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>A federal judge in Manhattan has denied Binance's attempt to force arbitration in a class action alleging the exchange sold unregistered digital tokens to U.S. investors, according to a Thursday opinion from the U.S. District Court for the Southern District of New York.</span></p><p class=\"\"><span>Judge Andrew L. Carter Jr. found that Binance failed to properly notify users when it amended its Terms of Use in February 2019 to add an arbitration clause and class action waiver. The plaintiffs, residents of California, Nevada and Texas, all created their Binance accounts between September 2017 and April 2018, when no such provisions existed.</span></p><p class=\"\"><span>The case traces back to a wave of class action lawsuits filed in April 2020 against major crypto exchanges and token issuers. It was initially dismissed in 2022 but revived by the Second Circuit in 2024, which held that U.S. securities laws applied to Binance even without a physical domestic headquarters. The Supreme Court declined to review that ruling in January 2025.</span></p><p class=\"\"><span>Binance argued its 2019 terms should govern, but the court noted that simply posting updated terms on a website, without individualized notice, was insufficient. The original 2017 terms included a change-of-terms provision, but the court cited Ninth Circuit precedent holding that users have no obligation to periodically check whether the other side has unilaterally changed a contract.</span></p><p class=\"\"><span>Even assuming the plaintiffs gained actual notice of the arbitration clause through the litigation itself, the court held the provision could not reach backward. Under California law, a unilateral modification silent on whether it applies to accrued claims is \"restricted based on the implied covenant of good faith and fair dealing.\"</span></p><p class=\"\"><span>The class action waiver also failed. While a heading in Binance's terms references a \"CLASS ACTION WAIVER,\" the body of the section never details the terms of such a waiver. The court called the language ambiguous and interpreted the adhesion contract against Binance as drafter.</span></p><p class=\"\"><span>The plaintiffs had previously voluntarily dismissed claims arising after the February 2019 effective date, narrowing the case to pre-2019 conduct. Binance founder Changpeng Zhao, who pleaded guilty to federal crimes in 2023, was pardoned by President Trump in October 2025.</span></p><p class=\"\"><span>The ruling comes as Binance's U.S. regulatory picture has shifted. The SEC moved to dismiss its own enforcement action against the exchange last May. But this private class action remains active, and Thursday's opinion clears a significant procedural hurdle for the plaintiffs.</span></p><p class=\"\"><span>Binance did not immediately respond to a request for comment.</span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:8ecc9f939094b:0-judge-blocks-binance-from-pushing-class-action-suits-over-token-sales-into-arbitration/",
            "pub_date": "2026-03-01 01:52:30",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM0U7:0",
            "title": "UK minister quits despite review clearing him over alleged journalist investigation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A British government minister resigned on Saturday even though a review found he had not breached the ministerial code after reports accused him of ordering the investigation of journalists while he was running a think-tank.</span></p><p class=\"\"><span>A review by Prime Minister Keir Starmer's ethics adviser found that Josh Simons, a junior minister involved in government plans for a new digital ID scheme, had not breached the code.</span></p><p class=\"\"><span>\"It is clear that my remaining in office has now become a distraction from this government's important work,\" Simons wrote in a letter to Starmer, seen by Reuters. </span></p><p class=\"\"><span>\"For that reason, and with sadness and regret, I offer my resignation.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM0U7:0-uk-minister-quits-despite-review-clearing-him-over-alleged-journalist-investigation/",
            "pub_date": "2026-03-01 01:54:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011514:0",
            "title": "Trump Bars Anthropic From Federal Agencies and Hegseth Labels It a Supply Chain Risk. Here's Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Evie Liu and Al Root</span></p><p class=\"\"><span>President Donald Trump said on Friday that he is directing all federal agencies to phase out the use of technology developed by the artificial-intelligence company Anthropic, including its Claude models.</span></p><p class=\"\"><span>The announcement came amid an escalating dispute between the company and the Department of Defense. Trump's directive was issued shortly before the Pentagon's deadline for Anthropic to agree to broader military access to its systems.</span></p><p class=\"\"><span>After that deadline passed, Defense Secretary Pete Hegseth said he was designating Anthropic a supply chain risk.</span></p><p class=\"\"><span>Anthropic CEO Dario Amodei has refused to accede to Pentagon demands that would allow its AI tools to be used without the company's restrictions, particularly in scenarios involving lethal force, surveillance, or other high-stakes applications.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Trump said in a social media post that most federal agencies must immediately cease using Anthropic's technology, and they would have a six-month window to remove the systems where they are already embedded.</span></p><p class=\"\"><span>Anthropic has reportedly won a contract last summer that's worth up to $200 million from the Defense Department, The Wall Street Journal reported last month.</span></p><p class=\"\"><span>Anthropic is a private company, so there is no publicly confirmed revenue figure for the firm. But Bloomberg has estimated that Anthropic's revenue run rate exceeded $9 billion at the end of 2025, which makes the loss of a $200 million contract trivial.</span></p><p class=\"\"><span>But the impact of Friday's moves by the U.S. leaders goes well beyond government contracts.</span></p><p class=\"\"><span>A \"supply-chain risk to national security,\" which Hegseth designated Anthropic, is typically applied to foreign companies. Rarely does the U.S. government label a major domestic company this way.</span></p><p class=\"\"><span>In the past, the Federal Communications Commission has named China's Huawei Technologies and ZTE Corporation as a national security risk to U.S. communications networks and supply chains.</span></p><p class=\"\"><span>Being designated a supply chain risk not only means no government contracts for Anthropic, defense contractors such as Lockheed Martin and Northrop Grumman also can't use Anthropic technology.</span></p><p class=\"\"><span>Neither company immediately responded to a request for comment about their relationship with Anthropic.</span></p><p class=\"\"><span>\"Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,\" wrote Hegseth in the X post.</span></p><p class=\"\"><span>Traditional defense stocks might not react to the conflict. Investors should keep an eye on Palantir. It is responsible for implementing a lot of AI technology at the Pentagon and has collaborated with Anthropic recently.</span></p><p class=\"\"><span>Palantir didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Palantir stock was unfazed on Friday, rising 0.9% to $137.20, while the S&amp;P 500 and Dow Jones Industrial Average fell 0.4% and 1.1%, respectively. Palantir shares were down 0.2% in after-hours trading.</span></p><p class=\"\"><span>The Anthropic conflict could open the door for other AI labs — notably OpenAI, Google's Gemini, and Elon Musk's xAI — to gain additional business with the defense industry.</span></p><p class=\"\"><span>Last year, OpenAI was awarded a contract worth up to $200 million to \"develop prototype frontier AI\" tools for military and national security applications. xAI was recently acquired by SpaceX, which already does a lot of business with the U.S. military and NASA.</span></p><p class=\"\"><span>But they will face the same discussions over terms for classified use of their models. While other AI labs' relationship with the government have not yet escalated to a public dispute, employees at OpenAI and Google have already protested or signed petitions opposing unrestricted military use of their companies' AI tools.</span></p><p class=\"\"><span>Write to Evie Liu at evie.liu@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011514:0/",
            "pub_date": "2026-03-01 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM5VMkN3a:0",
            "title": "YBS SA - Raport kwartalny za II kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_183716_0000001412_0000065187.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM5nY4P8a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_183716_0000001412_0000065188.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM6Clf2ra\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM5VMkN3a:0-ybs-sa-raport-kwartalny-za-ii-kwarta/",
            "pub_date": "2026-03-01 01:37:30",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:ebab718fc263c:0",
            "title": "Magle Chemoswed Holding AB enters into exclusive license agreement for amniotic stem cell technology",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Magle Chemoswed Holding AB (“Magle Chemoswed”) today announces that Magle Chemoswed Holding AB and its subsidiary Magle Biopharma AB (together, the “Licensors”) have entered into an exclusive license agreement (the “Agreement”) with</span></strong><strong class=\"root-Tkn6WL2y\"><span>Aktiebolaget Grundstenen 178422</span></strong><strong class=\"root-Tkn6WL2y\"><span>which has applied for a name change to Alvion Bio AB (“Alvion Bio”), granting Alvion Bio exclusive worldwide rights to develop and commercialise the Group’s amniotic stem cell technology.</span></strong></p><p class=\"\"><span>Alvion Bio has been established for the sole purpose of developing and commercialising the licensed technology and is owned by Justin Pierce, former Chief Executive Officer of Magle Group.</span></p><p class=\"\"><span>Under the Agreement, Alvion Bio will assume full responsibility for the continued development, regulatory advancement, and commercialisation of the licensed technology within the defined field.</span></p><p class=\"\"><span>The Agreement is not expected to have a material impact on Magle Chemoswed’ s financial results in 2026 but is expected to reduce operating costs by approximately SEK10 million and may generate future royalty revenue.</span></p><p class=\"\"><span>The licensed technology comprises intellectual property, know-how, cell lines, manufacturing processes, data, and related materials associated with amniotic stem cell–derived products. Alvion Bio has been established specifically to continue development activities and pursue regulatory approval and commercialisation of therapeutic products based on the licensed technology.</span></p><p class=\"\"><span>As part of the transaction:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Alvion Bio receives an exclusive, worldwide licence to the technology and related intellectual property;</span></li><li class=\"listItem-bmN0_SHH\"><span>As consideration for the licence, Magle Chemoswed AB and Magle Biopharma AB shall receive a royalty equal to four percent (4%) of all revenues generated from the commercialisation of the Licensed Technology and/or Licensed IPR by Alvion Bio, its Affiliates, and its Sublicensees. The obligation to pay royalties shall commence upon the first receipt of any Commercial Use Revenue by Alvion Bio, its Affiliates, or Sublicensees derived from the Licensed Technology and/or Licensed IPR. Royalties shall be payable on an ongoing basis for as long as Alvion Bio, its Affiliates, Sublicensees, or any successors or assigns continue to generate or receive Commercial Use Revenue from the Licensed Technology and/or Licensed IPR, and shall continue irrespective of whether any Licensed Patent has expired, lapsed, been abandoned, invalidated, or otherwise ceased to be in force.</span></li><li class=\"listItem-bmN0_SHH\"><span>Alvion Bio assumes full operational, regulatory, development, and commercial responsibility and associated risks from the effective date; and</span></li><li class=\"listItem-bmN0_SHH\"><span>Magle Group will provide limited transitional support during 2026 related to patent maintenance and transfer of documentation and materials.</span></li></ul><p class=\"\"><span>“This agreement represents an important strategic milestone for Magle Group. It enables a structured exit from the amniotic stem cell field while preserving long-term value potential through royalties and participation in future commercial success. At the same time, it allows us to sharpen our focus on our core business and strategic priorities,” said Aaron Wong, interim CEO of Magle Chemoswed Holding AB.</span></p><p class=\"\"><span>The Agreement was entered into on 28 February 2026, and becomes effective immediately.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contacts Aaron</span></strong></p><p class=\"\"><span>Aaron Wong, Interim CEO, CFO, phone +46 (0)76 664 35 79, aaron.wong@maglegroup.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Us</span></strong></p><p class=\"\"><span>The Magle Group aims to establish itself as a leader in high-quality life-changing healthcare innovations to meet medical needs through scientific excellence. The Magle Group is founded on strategic acquisitions aimed at driving growth and diversifying risk. Today, the Group includes three operational areas. Magle Chemoswed – a contract development and manufacturing organization (CDMO) with a strong reputation for its high-quality development and manufacturing expertise and Magle PharmaCept – an established sales and marketing company for development and direct sales of the Groups medical technology products. Magle Biopolymers A/S- a specialized manufacturing organization of Dextran technology. Learn more on</span><strong class=\"root-Tkn6WL2y\"><span>www.maglechemoswed.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglegroup.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglepharmacept.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglebiopolymers.com</span></strong></p><p class=\"\"><span>Redeye Sweden AB is the company's Certified Adviser.</span></p><p class=\"\"><em><span>This information is information that Magle Chemoswed is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 2026-02-28 18:40 CET.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/03632e61-ac63-4567-afad-4ddda3c61655/magle-chemoswed-holding-ab-enters-into-exclusive-license-agreement-for-amniotic-stem-cell-technology.pdf\" rel=\"nofollow\" target=\"_blank\">Magle Chemoswed Holding AB enters into exclusive license agreement for amniotic stem cell technology</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:ebab718fc263c:0-magle-chemoswed-holding-ab-enters-into-exclusive-license-agreement-for-amniotic-stem-cell-technology/",
            "pub_date": "2026-03-01 01:40:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000828:0",
            "title": "Anthropic Responds to President Trump in the Battle Over AI Weapons. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Al Root</span></p><p class=\"\"><span>Artificial-intelligence start-up Anthropic doesn't appear to be going away quietly in its battle with the Trump administration over the future of autonomous AI-trained weapons.</span></p><p class=\"\"><span>It provided a forceful response to the War Department's labeling of the company a \"supply chain risk.\" That threatens how Anthropic and other defense contractors conduct business.</span></p><p class=\"\"><span>On Friday, President Trump directed all federal agencies to phase out the use of technology developed by Anthropic, including its popular Claude models.</span></p><p class=\"\"><span>\"THE UNITED STATES OF AMERICA WILL NEVER ALLOW A RADICAL LEFT, WOKE COMPANY TO DICTATE HOW OUR GREAT MILITARY FIGHTS AND WINS WARS,\" said the president in a Friday post on Truth Social.</span></p><p class=\"\"><span>Anthropic and the Trump administration had been going back and forth on limits to the use of AI technology. Anthropic didn't want its systems used in mass surveillance or in autonomous weapons that would make kill or do-not-kill decisions without any human intervention.</span></p><p class=\"\"><span>\"In conjunction with the President's directive for the Federal Government to cease all use of Anthropic's technology, I am directing the Department of War to designate Anthropic a Supply-Chain Risk to National Security,\" added War Secretary Pete Hegseth in a Friday tweet.</span></p><p class=\"\"><span>That designation essentially bars Anthropic from doing business with the government, as well as stopping other defense contractors from using Anthropic technology.</span></p><p class=\"\"><span>\"We have tried in good faith to reach an agreement with the Department of War, making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions,\" reads part of a lengthy Friday statement from Anthropic.</span></p><p class=\"\"><span>\"We believe this [supply chain] designation would both be legally unsound and set a dangerous precedent for any American company that negotiates with the government,\" added the company. \"No amount of intimidation or punishment from the Department of War will change our position on mass domestic surveillance or fully autonomous weapons. We will challenge any supply chain risk designation in court.\"</span></p><p class=\"\"><span>The White House and Defense Department didn't immediatly respond to a request for comment about Anthropic's response.</span></p><p class=\"\"><span>Anthropic added that the supply chain risk designation would only prevent contractors from using its products in government business.</span></p><p class=\"\"><span>That distinction might not matter. \" Nvidia, Amazon, [and Google parent Alphabet], will have to divest from Anthropic if Hegseth gets his way. This is simply attempted corporate murder,\" wrote former Trump advisor Dean Ball on X. \"I could not possibly recommend investing in American AI to any investor; I could not possibly recommend starting an AI company in the United States.\"</span></p><p class=\"\"><span>Ball fears that the Trump administration has essentially made itself the strictest, de facto regulator of AI technology on the planet, adding in another tweet that he hopes for \"de-escalation.\"</span></p><p class=\"\"><span>What happens next is anyone's guess. Investors in defense contractors, drone makers, and Palantir Technologies will be paying attention to how things play out.</span></p><p class=\"\"><span>Write to Al Root at allen.root@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000828:0/",
            "pub_date": "2026-03-01 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000822:0",
            "title": "Marriott International Wins Court Battle Over Maasai Mara Safari Camp in Kenya — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Caroline Kimeu</span></p><p class=\"\"><span>NAIROBI — A Kenyan court dismissed a lawsuit by a Maasai leader who sought to demolish a Ritz-Carlton luxury safari camp, alleging it blocked a key route of the famous Serengeti migration.</span></p><p class=\"\"><span>The court this week sided with Marriott International, owner of the Ritz-Carlton brand, the Kenyan camp's owner-operator Lazizi Mara and the Kenyan government over Meitamei Olol Dapash, who brought the lawsuit.</span></p><p class=\"\"><span>Dapash, an elder of the Maasai ethnic group and head of the Maasai Environmental Resource Coalition, had argued the new camp stands at a critical point on the Sand River where wildebeest and zebra cross as they move from Tanzania's Serengeti National Park to Kenya's Maasai Mara National Reserve and adjacent conservancies in search of grass.</span></p><p class=\"\"><span>The owner of the Ritz-Carlton camp, which charges upward of $3,500 per guest per night during peak season, denied the allegations, saying it had secured necessary approvals from Kenyan authorities.</span></p><p class=\"\"><span>\"We remain committed to full environmental compliance, responsible stewardship, and constructive engagement with regulatory authorities and local stakeholders,\" Lazizi Mara said after the court announced its decision.</span></p><p class=\"\"><span>In her ruling, the judge said Dapash should have taken the dispute to an environmental tribunal before going to court. She also ruled he hadn't provided enough initial evidence to justify an order halting the camp's operations, while Lazizi Mara had presented the required environmental licenses and proof that it had consulted with the Maasai community about the development.</span></p><p class=\"\"><span>Dapash didn't respond to requests for comment on the ruling.</span></p><p class=\"\"><span>In response to questions, Marriott issued a statement Saturday saying it \"is committed to integrity, transparency, and respect for the environments and communities in which hotels under our brand operate.</span></p><p class=\"\"><span>Dapash himself had attempted to withdraw the lawsuit in December, citing ongoing talks with the developers. However, the court said the case touched on matters of public interest and should continue to play out.</span></p><p class=\"\"><span>Lazizi Mara also asked for the case to proceed, saying it would give the camp a chance to reverse the reputational damage it had suffered amid online furor over the suit.</span></p><p class=\"\"><span>Tensions between development and conservation have been growing in the Maasai Mara, where the number of camps and lodges, many built along scenic rivers, has nearly doubled over the past decade.</span></p><p class=\"\"><span>Kenyan authorities introduced a 2023 moratorium on new construction in response to concerns over poorly regulated development in the 580-square-mile reserve. However, the government granted the Ritz-Carlton camp an exemption from the directive, calling the move necessary to attract investors.</span></p><p class=\"\"><span>Supporters of the development say it generates jobs and tax revenue, while conservationists fear the developments may stifle the very spectacle hundreds of thousands of tourists visit to see each year.</span></p><p class=\"\"><span>Write to Caroline Kimeu at caroline.kimeu@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000822:0/",
            "pub_date": "2026-03-01 01:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:152eea1d5094b:0",
            "title": "RECAP, U.S. and Israel officials waiting confirmation ongoing attempt to decapitate Iran's leadership has been successful; Trump urges govt takeover",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>WASHINGTON (MaceNews) - The broad U.S. and Israel attack Saturday on Iran, which is said to include hundreds of targets over several days, has triggered retaliatory missile attacks on U.S. bases in the region.</span></p><p class=\"\"><span>Iran claims a girls school with several dozen casualties was among the targets.</span></p><p class=\"\"><span>President Trump urged Iran's people to now take over the government. In a video he said, \"Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people.\"</span></p><p class=\"\"><span>He continued, recounting Iranian attacks over the years. \"It's been mass terror and we're not going to put up with it any more.\" He said Iran was rebuilding its capability to produce nuclear weapons.</span></p><p class=\"\"><span>\"We are going to destroy their missile industry to the ground,\" he said. \"We're going to annihilate their navy. We're going to ensure that the .. terrorist proxies can no longer destabilize the region.\"</span></p><p class=\"\"><span>To the Islamic Revolutionary Guard and police forces, Trump said, \"Lay down your weapons and have complete immunity or in the alternative face certain death.\"</span></p><p class=\"\"><span>To the 90 million Iranian people, he said, \"Take over your government. It will be yours to take. This will probably be your only chance for generations.\" He said, \"Now is the time to seize control of your destiny and to unleash the prosperous and glorious future that is close within your reach.\" Israel Prime Minister Netanyahu echoed Trump's exhortation.</span></p><p class=\"\"><span>Prominent Democratic lawmakers immediately responded with criticism. Rep. Seth Moulton issued a statement and told CNN that the Trump administration had destroyed the pact and inspections that had stalled Iran's nuclear ambitions during Trump's first term and falsely claimed to have obliterated its nuclear capabilities during his second term. Now the new attack, he said, seemingly did not include plans for what happens afterward, a key blunder in the U.S. attack on Iraq. \"Bluster and bomb is not a strategy,\" he said. \"Trump's utter stupidity will get Americans killed.\"</span></p><p class=\"\"><span>Several Republican lawmakers praised the operation. Chairman of the Senate Armed Services Committee Roger Wicker said it was \"a pivotal and necessary operation,\" though one done without prior authorization from Congress.</span></p><p class=\"\"><span>Some members of Congress were notified in advance of the joint U.S. and Israel attack but, some said, not about its immense scope and aim to kill Iran's leadership. Officials said the attack will be spread over several days in what has been named \"Operation Epic Fury.\" Meanwhile Iranian missiles targeted U.S. installations in Bahrain, the U.A.E., Kuwait and Qatar with many of the incoming projectiles intercepted, Saudi Arabia was also a target and missiles were intercepted over Ryadh.</span></p><p class=\"\"><span>Oil tankers began avoiding the Iran-controlled Strait of Hormuz and oil prices were expected to skyrocket when trading in oil futures resumed.</span></p><p class=\"\"><span>Israel officials said three separate gathering places for Iranian officials were hit simultaneously without immediate confirmation Iran's Supreme Leader was among those killed. The U.S and Israel attacks, which are continuing against what was described as hundreds of targets, were launched during daylight hours in Iran. Initial reactions from some other countries, like China, were of dismay at the unfolding situation with several international experts warning of destabilizing forces being unleashed across the Mideast.</span></p><p class=\"\"><span>The United Nations security Council is convening a meeting Saturday in reaction to the military operation with condemnations from U.N. Secretary General Antionio Guterres. \"The use of force by the United States and Israel against Iran and the subsequent retaliation by Iran across the region undermine international peace and security,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/macenews:152eea1d5094b:0-recap-u-s-and-israel-officials-waiting-confirmation-ongoing-attempt-to-decapitate-iran-s-leadership-has-been-successful-trump-urges-govt-takeover/",
            "pub_date": "2026-03-01 00:54:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000814:0",
            "title": "What Images of Kim Jong Un's Daughter at Military Parade Tell Us About Her Rise — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Dasl Yoon and Andrew Barnett</span></p><p class=\"\"><span>At military parades of authoritarian regimes, it's not often a girl takes center stage.</span></p><p class=\"\"><span>But Kim Ju Ae, believed to be roughly 13 years old, is far from typical. She's the daughter of Kim Jong Un, the third-generation leader of North Korea — and the only one of the dictator's children to have ever been shown in public. Her growing profile has South Korea's spy agency believing she is increasingly positioned to succeed her father, although North Korea has stayed mum on the succession topic.</span></p><p class=\"\"><span>In photographs and videos released by state media, the Wednesday night appearance at a military parade signaled much about her growing prominence and the power dynamics among the regime's elite — in a country where images of the ruling Kims are carefully orchestrated pieces of propaganda.</span></p><p class=\"\"><span>The look</span></p><p class=\"\"><span>The positioning</span></p><p class=\"\"><span>Proximity is power in North Korea. Kim Ju Ae, in various parade photos, stood closest to her father. Top military and diplomatic officials often faded to the background.</span></p><p class=\"\"><span>The women</span></p><p class=\"\"><span>Of the females close to Kim Jong Un, his daughter took center stage. Her mother was photographed to the side, behind or even out of focus. Parade photos of Kim Yo Jong, the dictator's powerful younger sister, weren't prominent.</span></p><p class=\"\"><span>The intrigue swirling around Kim Ju Ae will persist. North Korea hasn't even officially confirmed her age or full name.</span></p><p class=\"\"><span>Her frequent appearances are a stark departure from the traditional secrecy surrounding children of the ruling Kim family. Whether she is the successor or not, the Kim regime is curating a public rollout to normalize a fourth generation of leadership.</span></p><p class=\"\"><span>Write to Dasl Yoon at dasl.yoon@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000814:0/",
            "pub_date": "2026-03-01 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACS3BwjZa:0",
            "title": "OCR Group Berhad Delivers Strong Q4 FY2025 Profit Surge with PBT Rising 69.1% YoY to RM6.2 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>PETALING JAYA, MY / ACCESS Newswire / February 28, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>OCR Group Berhad</span></strong><span> (\"</span><strong class=\"root-Tkn6WL2y\"><span>OCR</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Group</span></strong><span>\"), an integrated real estate company specialising in property development and project management, announced its unaudited financial results for the fourth quarter ended 31 December 2025 (\"Q4 FY2025\"), </span><span>recording revenue of RM71.7 million and profit before tax (\"PBT\") of RM6.2 million, reflecting a strong rebound in operational performance driven by accelerated construction progress and improved project billings.</span></p><p class=\"\"><span>For the current quarter, revenue surged significantly to RM71.7 million compared to RM4.0 million in Q4 FY2024, supported primarily by progress recognition from Residensi Akasia (Kyra Collection) in Shah Alam under the Rumah Selangorku scheme, alongside completed units from Isola KLCC and The Mate @ Damansara Jaya. </span><span>PBT rose 69.1% year-on-year to RM6.2 million from RM3.7 million previously, demonstrating stronger earnings conversion despite a higher financing cost environment.</span></p><p class=\"\"><span>On a quarter-on-quarter basis, revenue expanded 91.5% from RM37.5 million in Q3 FY2025, while PBT more than tripled from RM1.8 million in the immediate preceding quarter. The sequential improvement reflects accelerated site progress at Residensi Akasia (Kyra Collection) and Stellar Damansara, coupled with sales of completed units at Isola KLCC and The Mate @ Damansara Jaya, as well as improved cost absorption arising from higher development activity.</span></p><p class=\"\"><span>For the full financial year ended 31 December 2025 (\"FY2025\"), </span><span>OCR recorded cumulative revenue of RM184.9 million, nearly doubling from RM94.6 million in FY2024. Full-year PBT improved to RM7.6 million from RM7.0 million previously, supported by stronger property development contributions and disciplined cost management across ongoing projects.</span></p><em><span>Billy Ong Kah Hoe, Group MD of OCR Group Berhad</span></em><p class=\"\"><span>Group Managing Director of OCR Group Berhad, Billy Ong Kah Hoe commented, \"Q4 marks a strong operational turnaround for the Group, with meaningful acceleration in revenue recognition and improved profitability. The progress achieved at Residensi Akasia (Kyra Collection) and our ongoing developments reflects the strength of our project pipeline and execution capabilities. We remain focused on maintaining cost discipline while driving sales momentum across our key developments.\"</span></p><p class=\"\"><span>The Group's Property Development segment continued to anchor performance, contributing the majority of quarterly revenue as construction milestones advanced. Residensi Akasia remains a key earnings driver, while Stellar Damansara and The Mate @ Damansara Jaya continue to provide revenue visibility.</span></p><p class=\"\"><span>In Q4 FY2025, OCR also launched D'Templer Hilltop Residences in Rawang, a RM344 million gross development value (\"GDV\") landed residential project comprising bungalow lots as well as 2-storey and 3-storey semi-detached homes. Strategically located along Jalan Rawang with proximity to Bukit Lagong Forest Reserve and Commonwealth Park, the development reinforces OCR's focus on lifestyle-oriented housing in growth corridors.</span></p><p class=\"\"><span>OCR is optimistic for 2026, setting the stage for its pipeline of launches, including a mixed commercial and residential development project at Jalan Alor and </span><em><span>Residensi Begonia</span></em><span> (Phase II of Kyra Collection). Looking ahead, the RM81.0 billion in development expenditure allocations under Budget 2026, alongside Malaysia's projected GDP growth of 4.0% to 4.5%, continues to provide a supportive backdrop for the domestic property market. The RM20 billion Housing Credit Guarantee Scheme is expected to further stimulate first-time homebuyer demand, particularly within the affordable segment where OCR has established a strong presence.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>###</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT OCR GROUP BERHAD</span></strong></p><p class=\"\"><span>OCR Group Berhad (\"OCR\") is a full-fledged property player that prioritises customers' wellbeing at our core. OCR's integrated businesses of property development, construction and project management consultation embody the holistic approach of delivering value to stakeholders.</span></p><p class=\"\"><span>Led by a visionary, nimble and young management team, and backed by over 20 years' experience in completing more than RM2.2 billion Gross Development Value of projects, OCR's dynamism is best encapsulated in its unique project designs and innovative concepts to gain a strong following.</span></p><p class=\"\"><span>OCR focuses on providing innovative and unique homes in Klang Valley and up-and-coming hotspots in Malaysia. The Group's property development portfolio consists of three key segments, namely Essential Living, Urban Living and Luxury Living. Essential Living brand consist of affordably priced homes targeted towards the mass population, while Urban Living is marketed towards those who desire chic and modern lifestyles. Its Luxury Living label is largely targeted at the high-end crowd that prioritises premium living at prime locations.</span></p><p class=\"\"><span>Additionally, OCR has established a presence in the industrial properties segment with the successful launch of OCR Selayang Industrial Park in 2021.</span></p><p class=\"\"><span>For more information, visit https://ocrbhd.com/.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issued By:</span></strong><span> Swan Consultancy Sdn. Bhd. on behalf of OCR Group Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chris Ser</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> c.ser@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> OCR Group Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACS3BwjZa:0/",
            "pub_date": "2026-03-01 00:50:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSBbl8Na:0",
            "title": "Advancecon Returns to Full-Year Profitability with RM423.1 Million Revenue in FY2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KUALA LUMPUR, MY / ACCESS Newswire / February 28, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>Advancecon Holdings Berhad</span></strong><span> (前进控股有限公司) (\"Advancecon\" or \"the Group\") (Bursa:5281), an established provider of earthworks and civil engineering services in Malaysia, today announced its financial results for the fourth quarter ended 31 December 2025 (\"Q4 FY2025\"), marking the Group's return to full-year profitability following steady operational improvements and consistent project execution.</span></p><p class=\"\"><span>For the quarter under review, the Group recorded revenue of RM105.6 million, representing an increase of 5.0% compared to RM100.5 million in the corresponding quarter last year (\"Q4 FY2024\"). Profit attributable to owners of the Company stood at RM3.1 million, compared to a loss of RM3.6 million previously. The improved performance was primarily attributable to continued strong project execution and improved operational efficiency from the Group's core Construction and Support Services segment.</span></p><p class=\"\"><span>On a full-year basis, Advancecon recorded revenue of RM423.1 million, representing an increase of 10.4% from RM383.2 million in FY2024. The Group reported a profit attributable to owners of RM6.7 million, compared to a loss of RM22.7 million in the previous year. This reflects a successful turnaround driven by improved operational performance, cost optimisation efforts, and more disciplined project management across its business segments.</span></p><p class=\"\"><span>Notably, FY2025 also marked an important milestone for the Group, with Advancecon delivering four consecutive quarters of profit attributable to owners of the Company during the financial year. This reflects greater operational stability and consistency following measures undertaken to strengthen execution and improve overall efficiency. The Group's consistent quarterly profit performance reflects a structurally stronger and more sustainable earnings base.</span></p><p class=\"\"><span>As at </span><strong class=\"root-Tkn6WL2y\"><span>31 December 2025</span></strong><span> , Advancecon's outstanding order book stood at approximately </span><strong class=\"root-Tkn6WL2y\"><span>RM756 million</span></strong><span> , compared to </span><strong class=\"root-Tkn6WL2y\"><span>RM673 million as at 31 December 2024</span></strong><span> . This improvement has been supported by a series of strong contract wins secured over the past six months, with the Group securing new contracts totalling approximately RM229.5 million, reflecting continued participation in infrastructure and development projects. The order book provides ongoing work visibility for the Group's core construction activities. With a strengthened order book of approximately RM756 million and continued contract momentum, the Group is well-positioned to deliver sustained earnings growth over the next 24 months. The current order book provides strong earnings visibility through FY2027, underpinned by active participation in infrastructure and development projects.</span></p><p class=\"\"><span>Mdm. Phum Boon Eng, Managing Director of Advancecon Holdings Berhad , said: \"We are encouraged by the Group's return to full-year profitability and the consistency achieved over the past four quarters. This milestone marks not just a turnaround, but the beginning of Advancecon's next growth phase, as well as, the collective efforts of our team in strengthening execution, improving efficiency, and maintaining discipline in project delivery. With a strengthened order book we are confident in delivering sustainable earnings growth and long-term value for our stakeholders. We remain focused on operational stability and prudent project selection as we continue to carry out our existing works.\"</span></p><p class=\"\"><span>Advancecon's Construction and Support Services segment remained the primary contributor to revenue and profitability, supported by ongoing infrastructure and township development projects. The Group's quarry operations under Spring Energy Resources Berhad and its renewable energy segment also continued to contribute to the Group's overall operations.</span></p><p class=\"\"><span>Advancecon's renewable energy subsidiary continues to operate its solar assets, including a 37.7MWp large-scale solar farm in Kuala Langat, Selangor, which commenced operations in November 2024, as well as rooftop solar installations.</span></p><p class=\"\"><span>Separately, the Group's joint development with Perak Corporation Berhad for the Silver Valley Technology Park in Perak remains part of its longer-term business activities, and represents a key long-term value creation platform for the Group, with significant earnings potential as development progresses over its multi-phase rollout.</span></p><p class=\"\"><span>Malaysia's construction sector continues to be supported by infrastructure and development activities across both public and private sectors. The Group remains focused on its core competencies in earthworks and civil engineering while continuing to execute its existing projects. The Group is also well-positioned to benefit from increasing infrastructure investments, industrial expansion, and renewable energy development in Malaysia, which collectively support sustained construction activity across key growth corridors.</span></p><p class=\"\"><span>Despite ongoing cost pressures arising from regulatory changes and industry competition, the Group's improving financial position, strengthening order book, and consistent operational execution provide a solid foundation for continued growth. Management remains confident that Advancecon is well-positioned to build on its turnaround momentum and deliver sustainable earnings improvement in the coming financial year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>###</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT ADVANCECON HOLDINGS BERHAD</span></strong></p><p class=\"\"><span>Founded in 1990, Advancecon is primarily involved in the provision of earthworks and civil engineering services in Malaysia, as well as related support services such as the sale of construction materials, hiring of machinery, and ad-hoc general construction services. The Group was listed on the Main Market of Bursa Malaysia on 10 July 2017.</span></p><p class=\"\"><span>Advancecon's wide range of earthworks services encompass excavation and fill, rock-blasting, ground treatment works, erosion and sediment control plan, as well as compaction and surface finishing processes. On the civil engineering services front, Advancecon specializes in road works, drainage works, bridge construction, water supply works, and sewerage works.</span></p><p class=\"\"><span>To date, Advancecon has undertaken earthworks and civil engineering works for notable projects nationwide, including various township developments such as Bandar Setia Alam, Setia EcoHill, Setia Eco Gardens, Eco Majestic and Tropicana Aman, as well as infrastructure projects in relation to the construction of highways and railway such as West Coast Expressway (WCE), South Klang Valley Expressway (SKVE), Trumpet Interchange and Ecohill Link connected to Lebuhraya Kajang Seremban (LEKAS) Highway and East Coast Rail Link (ECRL).</span></p><p class=\"\"><span>In 2019, Advancecon also established a renewable energy subsidiary, Advancecon Solar Sdn Bhd, which will undertake the development and/or operations of power generation from solar and other renewable energy projects. It currently owns revenue-generating rooftop solar assets of more than 1.2MWp and also a 37.7MWp large-scale solar farm in Kuala Langat, Selangor which commenced operation on 8 November 2024.</span></p><p class=\"\"><span>In 2021, Advancecon further completed the acquisition of a 51% stake in Spring Energy Resources Berhad (\"Spring Energy\"), which is an integrated quarry operation management and service provider involved in contract quarry operations, provision, marketing and management of quarry products, related advisory services, as well as the undertaking of quarry-related earthworks and civil engineering works.</span></p><p class=\"\"><span>In 2024, Advancecon entered into a Joint Development Agreement with Perak Corporation Berhad to develop Silver Valley Technology Park (SVTP) on an 816-acre land in Kanthan, Perak, with an estimated Gross Development Value of RM1.0 billion, which is envisioned to be a state-of-the-art industrial park.</span></p><p class=\"\"><span>For more information, please visit https://www.advancecon.com.my/.</span></p><p class=\"\"><span>Issued By: Swan Consultancy Sdn. Bhd. on behalf of Advancecon Holdings Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chris Ser</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> c.ser@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Advancecon Holdings Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSBbl8Na:0/",
            "pub_date": "2026-03-01 00:55:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        }
    ]
}