{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463261:0",
            "title": "Nomura Adjusts Sun Pharmaceutical Industries' Price Target to INR1,970 From INR1,850, Keeps at Neutral",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sun Pharmaceutical Industries  has an average rating of outperform and price targets ranging from 1,625 Indian rupees to 2,450 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463261:0/",
            "pub_date": "2025-02-04 15:31:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463267:0",
            "title": "Nomura Adjusts Bank Negara Indonesia's Price Target to 6,250 Rupiah From 6,600 Rupiah, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bank Negara Indonesia (IDX:BBNI) has an average rating of buy and price targets ranging from 4,300 rupiah to 7,018 rupiah, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463267:0/",
            "pub_date": "2025-02-04 15:31:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463283:0",
            "title": "Thomas Cook (India)'s Consolidated Profit Declines in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thomas Cook (India)  recorded a decline in attributable consolidated profit to 495.8 million Indian rupees in the fiscal third quarter from 823.9 million rupees a year ago, according to an Indian bourse filing on Monday by the travel services company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, fell to 1.06 rupees from 1.77 rupees a year earlier. </p><p class=\"\">Net income from operations increased year on year to 20.6 billion rupees from 18.9 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463283:0/",
            "pub_date": "2025-02-04 15:31:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001799:0",
            "title": "UK Market Talk Roundup: Brokers Comments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Broker comments in the UK today. Compiled by Dow Jones Newswires Markets Desk, markets.eu@dowjones.com</p><p class=\"\">The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p><p class=\"\">Contact us in London. +44-20-7842-9288 <br/>Markettalk.eu@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001799:0/",
            "pub_date": "2025-02-04 15:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001798:0",
            "title": "FTSE 100 Seen Opening Lower as China Retaliates Against Trump Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001798:0/",
            "pub_date": "2025-02-04 15:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463279:0",
            "title": "Jefferies Adjusts Gland Pharma's Price Target to INR1,350 From INR1,630, Keeps at Underperform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gland Pharma  has an average rating of hold and price targets ranging from 1,162 Indian rupees to 3,120 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463279:0/",
            "pub_date": "2025-02-04 15:32:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463280:0",
            "title": "Jefferies Adjusts Aditya Birla Capital's Price Target to INR248 From INR265, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aditya Birla Capital  has an average rating of buy and price targets ranging from 235 Indian rupees to 270 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463280:0/",
            "pub_date": "2025-02-04 15:32:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446492:0",
            "title": "Romania Producer Prices Drop for 4th Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The producer prices in Romania fell by 0.71% year-on-year in December 2024, following a 0.37% drop in the previous month.</p><p class=\"\">This marked the fourth consecutive month of declining producer prices, as prices decreased for both mining and quarrying (-6.82%) and electricity, gas, steam, and air-conditioning supply (-7.48%).</p><p class=\"\">Meanwhile, prices accelerated for manufacturing (2.25%) and water supply, sewerage, waste management, and remediation activities (12.03%).On a monthly basis, producer prices declined by 0.86%, slipping from a 3.26% gain in the preceding period.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446492:0-romania-producer-prices-drop-for-4th-month/",
            "pub_date": "2025-02-04 15:32:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463284:0",
            "title": "Market Chatter: Hanwha Ocean, HD Hyundai Heavy Compete for Navy Warship Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Korea's Hanwha Ocean  and HD Hyundai Heavy Industries  were shortlisted to lead the country's 7.8 trillion won Korea Destroyer Next Generation project, Yonhap News reported Monday, citing the Ministry of Trade, Industry and Energy. </p><p class=\"\">The initiative aims to develop six 6,000-ton Aegis destroyers with domestic technologies, comparable to the Navy's 7,100-ton King Sejong the Great. The defense acquisition program administration will select the final contractor, the report said. </p><p class=\"\">Shares of Hanwha Ocean jumped nearly 7% at market close on Tuesday while those of HD Hyundai Heavy Industries rose nearly 3%. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463284:0/",
            "pub_date": "2025-02-04 15:32:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001859_20250204001860:0",
            "title": "Diageo CEO: Company Will Continue to Engage With US Administration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001859_20250204001860:0/",
            "pub_date": "2025-02-04 15:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446493:0",
            "title": "Copper Gains Amid US-China Trade Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Copper futures climbed above $4.32 per pound on Tuesday, reaching a one-week high as investors assessed the impact of the escalating trade war between the U.S. and China.</p><p class=\"\">The 10% U.S. tariffs on Chinese goods came into effect earlier today, prompting Beijing to retaliate with its own tariffs on select U.S. exports, including oil, gas, coal, cars, and farm equipment, effective February 10.</p><p class=\"\">Meanwhile, President Trump agreed late on Monday to \"immediately pause\" planned tariffs on Mexico and Canada for a month, following successful negotiations with their respective leaders.</p><p class=\"\">In China, the world’s largest copper consumer, a private survey revealed that manufacturing activity expanded less than expected in January, with foreign orders shrinking due to ongoing global trade uncertainties.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446493:0-copper-gains-amid-us-china-trade-concerns/",
            "pub_date": "2025-02-04 15:33:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463286:0",
            "title": "Indivior Wraps Up $100 Million Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indivior  completed its $100 million share buyback program approved by the board in July 2024, according to a Tuesday release. </p><p class=\"\">Morgan Stanley, on behalf of the British pharmaceutical company, repurchased a total of 9,415,726 shares at an average price of 8.2486 pounds sterling apiece.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463286:0/",
            "pub_date": "2025-02-04 15:33:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463255:0",
            "title": "Nomura Adjusts LIC Housing Finance's Price Target to INR735 From INR700, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LIC Housing Finance  has an average rating of outperform and price targets ranging from 470 Indian rupees to 940 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463255:0/",
            "pub_date": "2025-02-04 15:25:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001754:0",
            "title": "Asia Markets Give Up Earlier Gains — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new levies on the U.S.</p><p class=\"\">The news poured cold water on hopes that there would be talks between Washington and Beijing that would also postpone the 10% tariffs on all Chinese goods entering the U.S.</p><p class=\"\">The offshore yuan weakened against the dollar, while benchmark indexes in Hong Kong, Japan and South Korea pared gains.</p><p class=\"\">Oil futures extended losses, with front-month WTI crude oil futures down 1.8% to $71.83 per barrel, and Brent down 1.2% to $75.07 per barrel.</p><p class=\"\">Bitcoin tumbled, falling below $100,000. Spot gold was broadly steady, sitting 0.1% lower at $2,811.23 per ounce.</p><p class=\"\">The \"overarching geo-economic dimensions to U.S.-China trade means that resolution will be far more fraught than is the case with Mexico and Canada,\" Vishnu Varathan of Mizuho Securities said in a note.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001754:0/",
            "pub_date": "2025-02-04 15:26:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:0f856b452094b:0",
            "title": "Accumulate Sun Pharmaceutical Industries; target of Rs 1967: KR Choksey",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KR Choksey's research report on Sun Pharmaceutical Industries</p><p class=\"\">Sun Pharma’s revenue was largely in-line with our estimates. However, EBITDA beat our estimates (+4.7%) due to lower-than-expected operating expenses and Adj. PAT beat our estimates due to better operating performance and better than expected other income. We increase our FY26E/FY27E EPS estimates by 0.4% and 4.4% to INR 58.1 and INR 66.9 respectively, as we believe specialty products like Odomzo and Ilumya will continue to grow in EM and ROW markets, with new product launches the company reinforce its leadership position in branded generics in India.</p><p class=\"\">Outlook</p><p class=\"\">We roll over our valuation multiple to FY27E and assign a PE multiple of 29.4x to arrive at a target price of INR 1,967 (unchanged) and maintain our “ACCUMULATE” rating on the stock.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Sun Pharmaceutical - 04022025 - kr</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:0f856b452094b:0-accumulate-sun-pharmaceutical-industries-target-of-rs-1967-kr-choksey/",
            "pub_date": "2025-02-04 15:26:10",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001758:0",
            "title": "UBS Results Benefit From Cost Management — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group's fourth-quarter results were better than expected and benefited from good cost management, Vontobel's Andreas Venditti says in a research note. The Swiss banking group posted an underlying pretax profit of $1.77 billion for the fourth quarter, or 24% ahead of consensus forecasts thanks to lower expenses than expected, the analysts say. Its dividend was also higher than anticipated and came alongside plans to buy back up to $3 billion in shares this year, in line with expectations, Vontobel says. UBS remains on track to substantially complete the integration of Credit Suisse by the end of next year, even if expenses are now expected to be slightly higher than previously targeted, the analyst says. (adria.calatayud@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001758:0/",
            "pub_date": "2025-02-04 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001759_20250204001761:0",
            "title": "Novartis Target Raised to CHF110.00 From CHF100.00 by Deutsche Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001759_20250204001761:0/",
            "pub_date": "2025-02-04 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001759_20250204001759:0",
            "title": "Novartis Raised to Buy by Deutsche Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001759_20250204001759:0/",
            "pub_date": "2025-02-04 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001755:0",
            "title": "Infineon Lifts Sales Guidance After Boost From AI Chips — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mauro Orru</p><p class=\"\">Infineon Technologies raised its sales forecasts for the fiscal year amid solid demand for chips to power servers and data centers behind the artificial-intelligence boom.</p><p class=\"\">The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros ($15.94 billion) it reported for fiscal 2024. Infineon had previously forecast a slight decline. Meanwhile, Infineon's segment result margin--a key profitability measure--is still expected in the mid-to-high-teens percentage range.</p><p class=\"\">The upgrade comes after what Infineon said was a slightly better start to the fiscal year than expected amid a boost in semiconductors sales for servers and data centers to power AI. However, areas of the semiconductor industry outside of artificial intelligence continue to suffer from sluggish demand.</p><p class=\"\">Orders for legacy chips found in cars and industrial equipment has been subdued in recent months as car makers and manufacturers of industrial machinery cut spending since they stockpiled the semiconductors they needed years ago.</p><p class=\"\">The divergence in demand between AI chips and legacy semiconductors meant that chip makers with significant AI exposure like Nvidia have grown exponentially, while companies such as Infineon that mostly sell chips to the automotive sector and makers of industrial equipment have struggled.</p><p class=\"\">Infineon slashed its sales guidance three times in the previous fiscal year. Last week, Tesla supplier STMicroelectronics said it was expecting lower sales this quarter, citing challenges in demand for legacy semiconductors.</p><p class=\"\">\"Following the expected inventory reduction, we continue to anticipate that the recovery in demand will be gradual for the current fiscal year,\" Infineon Chief Executive Jochen Hanebeck said.</p><p class=\"\">The company posted 3.42 billion euros in sales in the three months to the end of December, down 8% on year. Infineon's automotive division--which accounts for the lion's share of revenue--logged a 8% contraction in sales. Only the power and sensor systems business reported an increase in sales, lifted by chips for servers and data centers.</p><p class=\"\">Net profit declined to 246 million euros from 587 million euros, while Infineon's segment result contracted to 573 million euros from 831 million euros, generating a 16.7% margin.</p><p class=\"\">Analysts had forecast quarterly sales of nearly 3.23 billion euros, a net profit of 252 million euros, a segment result of 477 million euros and a 14.8% margin, according to a Vara Research consensus.</p><p class=\"\">For the current quarter, Infineon is expecting sales of around 3.6 billion euros and a segment result margin in the mid-teens percentage range.</p><p class=\"\">Write to Mauro Orru at mauro.orru@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001755:0-infineon-lifts-sales-guidance-after-boost-from-ai-chips-update/",
            "pub_date": "2025-02-04 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001759_20250204001760:0",
            "title": "Deutsche Bank Had Novartis at Hold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001759_20250204001760:0/",
            "pub_date": "2025-02-04 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446491:0",
            "title": "Gold Holds Steady Near Record High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gold steadied around $2,810 per ounce on Tuesday, but remained near an all-time high reached in the previous session as tariff jitters prompted safe-haven spending.</p><p class=\"\">China announced retaliatory tariffs on U.S. goods after President Donald Trump’s 10% levy on Chinese imports came into effect.</p><p class=\"\">Meanwhile, Trump late Monday agreed to delay duties on Mexico and Canada for a month after the leaders of both countries took steps to appease his concerns about border security and drug trafficking.</p><p class=\"\">The inflationary impact of tariffs could further bolster gold’s appeal as a hedge against price pressures and geopolitical uncertainty.</p><p class=\"\">However, this may also lead to higher interest rates, posing a challenge for non-yielding bullion.</p><p class=\"\">Meanwhile, investors are keenly anticipating labor data this week, particularly Friday’s nonfarm payrolls report, which could offer more insights into the strength of the U.S. economy.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446491:0-gold-holds-steady-near-record-high/",
            "pub_date": "2025-02-04 15:27:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001762:0",
            "title": "Nintendo Cuts Earnings, Switch Sales Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Nintendo cut its annual projections for earnings and Switch console sales after weak results for the nine months ended December.</p><p class=\"\">The Japanese videogame maker said Tuesday that net profit dropped 42% from a year earlier to 237.19 billion yen, equivalent to $1.53 billion, for the nine-month period. Revenue fell 31% to Y956.22 billion.</p><p class=\"\">The Switch console, launched in 2017, was a runaway success for Nintendo, which has had a spotty record with hardware, but sales of the aging console are now firmly in decline.</p><p class=\"\">Nintendo said in January that it would start selling the successor to its nearly eight-year-old console this year, but didn't reveal the price, the launch date nor specifications.</p><p class=\"\">The company now expects to sell 11.0 million Switch consoles for the year ending March, down from 12.5 million units forecast previously, and 150 million software copies, lower than its previous view of 160 million copies.</p><p class=\"\">Nintendo projected net profit to drop 45% to Y270.00 billion and revenue to decline 29% to Y1.190 trillion this fiscal year.</p><p class=\"\">The videogame maker has been diversifying its revenue streams with some success, offering other forms of entertainment by leveraging its popular characters and game series.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001762:0-nintendo-cuts-earnings-switch-sales-guidance/",
            "pub_date": "2025-02-04 15:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001781_20250204001781:0",
            "title": "Nobia AB 4Q Sales SEK2.51B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001781_20250204001781:0/",
            "pub_date": "2025-02-04 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001779_20250204001779:0",
            "title": "Nobia AB 4Q Net Loss SEK856M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001779_20250204001779:0/",
            "pub_date": "2025-02-04 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001767:0",
            "title": "AMD Reports Earnings Today. The Outlook Is a Worry. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tae Kim</p><p class=\"\">The outlook for revenue will be investors' focus when Advanced Micro Devices reports its fourth-quarter earnings after the close Tuesday.</p><p class=\"\">The consensus forecast among analysts is that AMD will report December quarter revenue of $7.5 billion with adjusted earnings per share of $1.08. For the current quarter, the consensus call is that revenue will be $7.0 billion and earnings per share will come in at 95 cents, according to FactSet.</p><p class=\"\">On Friday, Keybanc analyst John Vinh reaffirmed an Overweight rating and $150 price target for AMD. The analyst warned, however, the company's near-term outlook may not impress shareholders.</p><p class=\"\">\"We expect AMD to post in line to higher results and lower guidance,\" he wrote. \"We see NT [near term] risk to forward guidance.\"</p><p class=\"\">The analyst cited softer laptop shipments and the potential for weaker demand for server processors for the potentially weak guidance.</p><p class=\"\">Last week, Intel, AMD's main chip rival, gave a softer-than-expected outlook for its March quarter, citing a weakening global economy. It said some buying that might have happened in the current quarter moved forward to the December quarter as investors sought to prepare for potential tariffs under the Trump administration.</p><p class=\"\">AMD shares are down 36% over the past 12 months, compared to the 8% gain for the iShares Semiconductor ETF.</p><p class=\"\">Write to Tae Kim at tae.kim@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001767:0/",
            "pub_date": "2025-02-04 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463281:0",
            "title": "Diageo Reports Lower Fiscal H1 Profit, Net Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Diageo  reported Tuesday that its profit and net sales decreased year over year in the first half of fiscal 2025. </p><p class=\"\">Profit attributable to equity shareholders of the parent company for the six months ended Dec. 31, 2024, was $1.94 billion, compared with $2.21 billion earlier. EPS moved to $0.869 from $0.984. </p><p class=\"\">The British alcoholic beverage company's net sales were $10.90 billion, compared with $10.96 billion a year ago. </p><p class=\"\">Meanwhile, the board declared an unchanged interim dividend of $0.4050 per share for the period, payable on April 24 to shareholders on record Feb. 28. </p><p class=\"\">The company withdrew its previous guidance of a sequential improvement in organic sales for the second half of fiscal 2025, as well as its medium-term guidance for organic net sales in the 5% to 7% range.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463281:0/",
            "pub_date": "2025-02-04 15:21:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463282:0",
            "title": "Vodafone Group Fiscal Q3 Revenue Climbs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vodafone  said Tuesday its total revenue for the three months ended Dec. 31, 2024, increased year over year. </p><p class=\"\">The British telecommunications company's revenue was 9.81 billion euros, compared with 9.35 billion euros previously.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463282:0/",
            "pub_date": "2025-02-04 15:21:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463274:0",
            "title": "Barclays Lifts Novartis' Price Target on Strong FY25 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Barclays raised its price target on Novartis  to 90 francs from 85 francs after the Swiss drugmaker provided stronger-than-expected guidance for 2025, following a solid prior-year performance. </p><p class=\"\">The research firm maintained its underweight rating on the stock. </p><p class=\"\">Novartis projected mid- to high-single-digit net sales growth for 2025, expecting core operating income to rise in the high single to low double-digit. The guidance came as a surprise to analysts, who had expected moderate single-digit percentage growth due to uncertainties around key drugs losing exclusivity, or LOEs, including heart failure drug Entresto in mid-2025. </p><p class=\"\">\"Whilst we do take our numbers up today to land in the FY25 guidance ranges (this drives our PT to CHF 90 from CHF85, which is 11.5x our revised FY25 Core EPS forecast vs. prior 11.1x), we remain closer to the LSD% end of the topline guide vs. the high end. Given our preference this year for catalyst-driven stories, we remain UW,\" Barclays wrote. </p><p class=\"\">In response to the updated forecast, Barclays adjusted its model to align with Novartis' expectations. The firm raised estimates for Entresto's US performance in the first half of 2025 and lifted full-year estimates for the psoriasis drug Cosentyx and multiple sclerosis treatment Kesimpta. </p><p class=\"\">For 2025, analysts now expect Novartis to generate $51.79 billion in net sales, up from a prior estimate of $51.13 billion, with core EPS forecast raised to $8.51 from $8.35. However, the 2026 outlook remains largely unchanged, with net sales now expected at $51.95 billion versus $51.83 billion previously, and core EPS at $8.79, slightly below the earlier estimate of $8.81.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463274:0/",
            "pub_date": "2025-02-04 15:22:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463275:0",
            "title": "Market Chatter: SoftBank, OpenAI to Form Japan Venture",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OpenAI and SoftBank Group  are launching a 50:50 venture to expand AI services in Japan, Bloomberg reported Monday. </p><p class=\"\">The venture intends to hire 1,000 people to market OpenAI's tools to industries from automakers to retailers. </p><p class=\"\">SoftBank expects to generate $3 billion in AI-related sales with the help of OpenAI's tools. </p><p class=\"\">The move underscores SoftBank's AI push, including its $100 billion Stargate project in the US. Founder Masayoshi Son dismissed smaller AI models, saying, \"More brain is definitely better.\"</p><p class=\"\">Japan lags in AI adoption, Prime Minister Shigeru Ishiba said at a meeting with Son and OpenAI's Sam Altman. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463275:0/",
            "pub_date": "2025-02-04 15:22:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001746:0",
            "title": "UBS's Results Look Positive on Several Fronts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group's plans to step up share buybacks and a better-than-expected net profit mean its 4Q results look positive on several fronts, RBC Capital Markets' Anke Reingen and Matthew Russell say in a research note. The higher-than-expected net profit was mainly thanks to the Swiss group's investment bank, where revenue was well ahead of consensus expectations, RBC says. Costs came in higher than expected in some divisions, but this could be due to seasonal factors, the analysts say. UBS provided more detailed targets for the turnaround of its U.S. global-wealth-management unit, which is positive, RBC says. On the integration of Credit Suisse, it reiterated its end-2026 savings target but raised its expectations for expenses, RBC says. (adria.calatayud@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001746:0/",
            "pub_date": "2025-02-04 15:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}