{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV180:0",
            "title": "Hut 8 Corp In Jan, Bitcoin Produced Was 65 BTC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hut 8 Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">HUT 8 CORP: IN JAN, BITCOIN PRODUCED  WAS 65 BTC, BITCOIN HELD IN RESERVE OF 10,208 BTC</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV180:0-hut-8-corp-in-jan-bitcoin-produced-was-65-btc/",
            "pub_date": "2025-02-05 07:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV2E4:0",
            "title": "Atmos Energy reports higher quarterly profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atmos Energy  posted a rise in first-quarter profit on Tuesday, as the natural gas utility benefited from higher rates.</p><p class=\"\">During the reported quarter, the company implemented, or received approval to implement ratemaking regulatory actions which resulted in an increase in annual operating income of $150.5 million.</p><p class=\"\">Higher rates boosted operating income in its distribution segment by 12.7% to $316.1 million, from the previous year.</p><p class=\"\">Growth in residential customers and increased industrial load also helped the segment's quarterly performance.</p><p class=\"\">Atmos delivers natural gas to about 3 million distribution customers across eight U.S. states.</p><p class=\"\">The company, which also operates about 5,700 miles of transmission pipelines in Texas, said quarterly operating earnings in its pipeline and storage unit rose 20.9% to $143.4 million, from the previous year.</p><p class=\"\">It reaffirmed its full-year profit forecast range of $7.05 to $7.25 per share.</p><p class=\"\">The Dallas, Texas-based company's net income rose to $351.9 million, or $2.23 per share, in the quarter ended Dec. 31, from $311.3 million, or $2.08 cents per share, a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV2E4:0-atmos-energy-reports-higher-quarterly-profit/",
            "pub_date": "2025-02-05 07:06:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008949:0",
            "title": "Snap Reports Surprise Profit. The Stock is Rising. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Levine</p><p class=\"\">Snapchat-parent Snap reported strong fourth-quarter earnings results Tuesday afternoon. Its shares rose in after-hours trading.</p><p class=\"\">After years of GAAP losses, Snap surprised with earnings-per-share of 1 cent versus a 15 cent loss the year before. Wall Street analysts expected a loss of four cents.</p><p class=\"\">Driving the profit was cost discipline. \"We came within or below our full-year cost structure guidance across all key metrics,\" Snap said in a letter to shareholders.</p><p class=\"\">Users for the quarter were at 453 million, in-line with expectations, and up 9% from 2023. Average revenue per user was also in-line at $3.44, up 5%.</p><p class=\"\">Revenue for the quarter reached $1.56 billion, above expectations of $1.55 billion, and up 14% on the year. As has become common with mature social networks, growth was led be markets outside North America, with European revenue up 20% on the year, and the rest of the world up 35%.</p><p class=\"\">Snap's revenue outlook range for the first quarter was $1.33 billion to $1.360 billion, up 12% from 2024 at the midpoint. Analysts have been expecting $1.33 billion analysts.</p><p class=\"\">User guidance was for 459 million, up 9% on the year — in excess of expectations of 451 million.</p><p class=\"\">Snap stock was up around 10% in after-hours trading following the release.</p><p class=\"\">This is breaking news. Read a preview of Snap's earnings below and check back for more analysis soon.</p><p class=\"\">Snapchat-parent Snap has a lot riding on the company's earnings seemingly every quarter. That could continue Tuesday, when the company is scheduled to report fourth-quarter earnings after the close.</p><p class=\"\">Since 2020, the company's stock has moved by an absolute average of 22% the day after earnings reports. After the fourth quarter 2021 release, the stock was up 59%. Two quarters later, it was down 39%. Last quarter shares rose by 16% after earnings.</p><p class=\"\">\"Snap shares don't trade on traditional valuation metrics like near-term GAAP EPS, Free Cash Flow or even Ebitda,\" Wells Fargo analyst Ken Gawrelski says. \"As a result, shares are exceptionally volatile as it feels like there is a referendum every earnings print on future growth.\"</p><p class=\"\">Oppenheimer analyst Jason Helfstein notes that there is \"reasonably high short interest\" in the stock, and investors entering or exiting those positions after the earnings release can have a large effect.</p><p class=\"\">He also sees TikTok's saga — will they be banned in the U.S. or not? — as another contributing factor to the volatility. Finally, he noted that Snap's direct response advertising has lagged behind digital ad leaders Alphabet and Meta Platforms, a point of frustration for investors.</p><p class=\"\">Gawrelski has a Buy rating and a $15 price target. Helfstein has a Hold rating and no price target. A quarter of analysts have the equivalent of a Buy, and 68% have a Hold rating. Just three out of 44 analysts have a Sell. The average price target is $13.06.</p><p class=\"\">Sales growth accelerated through the first three quarters of 2024. For the fourth quarter, Wall Street expects $1.55 billion in sales, up 14% from last year, driven by a 9% rise in users and a 5% rise in average revenue per user. Three months ago, Snap guided to $1.54 billion in revenue at the midpoint.</p><p class=\"\">In the 39 quarters that have been reported publicly by Snap, it has seen positive earnings per share once, back in 2021. But it has been able to keep last-twelve-months free cash flow positive, and occasionally uses some of it for share repurchases, including three of the last four quarters.</p><p class=\"\">For the fourth quarter, Wall Street expects the company to report a loss of four cents loss-per-share, up from a loss of 15 cents a year ago, with free cash flow of $161 million.</p><p class=\"\">Write to Adam Levine at adam.levine@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008949:0/",
            "pub_date": "2025-02-05 07:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463569:0",
            "title": "Piedmont Lithium's Spodumene Concentrate Shipped Rises in Q4, 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Piedmont Lithium  shipped 55,700 dry metric tons (dmt) of spodumene concentrate in the fourth quarter of 2024 from its North American Lithium operations (NAL), up from 31,500 dmt in the third quarter, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The spodumene concentrate produced at NAL fell to 50,922 dmt in the quarter, down from 52,141 dmt in the previous quarter. </p><p class=\"\">Despite the fall in production for the quarter, the company says it is on track to achieve Sayona Mining's  production guidance for the current year of 190,000 dmt to 210,000 dmt for its merged entity with the company.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463569:0/",
            "pub_date": "2025-02-05 07:07:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA3PVNXZ:0",
            "title": "3M Board Declares Quarterly Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">3M Co :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M BOARD DECLARES QUARTERLY DIVIDEND</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M CO - DECLARES QUARTERLY DIVIDEND OF $0.73 PER SHARE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M CO - AUTHORIZES REPURCHASE OF UP TO $7.5 BILLION OF COMMON STOCK</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA3PVNXZ:0-3m-board-declares-quarterly-dividend/",
            "pub_date": "2025-02-05 07:07:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX72GlpV:0",
            "title": "Bitdeer Announces Strategic Acquisition of 101 MW Site and Gas-fired Power Project in Alberta to Deliver the Industry’s First Fully-Vertically Integrated Bitcoin Mining Site",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SINGAPORE, Feb.  04, 2025  (GLOBE NEWSWIRE) — Bitdeer Technologies Group  (“<strong class=\"root-Tkn6WL2y\">Bitdeer</strong>” or the “<strong class=\"root-Tkn6WL2y\">Company</strong>”), a world-leading technology company for blockchain and high-performance computing, today announced the successful close of the acquisition of a fully licensed and permitted 101 MW site and gas-fired power project situated on 19 acres of land near Fox Creek, Alberta in an all-cash transaction for $21.7 million. The site has potential to scale to 1 GW of power, reflecting Alberta’s abundant energy resources, supportive regulatory posture and pro-business environment.</p><p class=\"\">The 101 MW gas-fired power project includes all permits and licenses required to construct an on-site natural gas power plant, as well as approval for a 99 MW grid interconnection with Alberta Electric System Operator (“AESO”). Bitdeer will develop and construct the power plant in partnership with a leading Engineering, Procurement and Construction (“EPC”) company and is expected to be energized by Q4 2026.</p><p class=\"\">Concurrently, the Company plans to build 99 MW of datacenter capacity for Bitcoin mining. This newly acquired site and power generation project provides the Company a unique opportunity to become the world’s first fully-vertically integrated Bitcoin miner at scale and potentially achieve some of the lowest Bitcoin mining production costs in the industry.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Benefits</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Full vertical integration: </strong>The Company will have control of the land, power generation, electrical and datacenter infrastructure as well as using its own internally developed and manufactured Bitcoin mining machines. The Company can deploy approximately [9] EH/s of its SEALMINER A3 mining machines upon completion, which are anticipated to have industry leading machine-level efficiency of 11-12 J/TH.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Low Power Costs:</strong> Projected energy production costs of approximately $20 to $25 per MWh1, based on current gas prices.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sustainability &amp; Potential Carbon Credit Upside:</strong> As part of the project acquisition, Bitdeer will deploy a carbon utilization system that captures CO2 making the project a net zero carbon producer. This initiative aims to offset Canada’s carbon tax obligations and may generate future revenue through carbon credits.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Energy Cost Optimization &amp; Revenue Flexibility:</strong> The Company expects to curtail and sell power back to the Alberta grid to stabilize prices during periods of high demand. The Company estimates this could potentially optimize costs even further.</li></ul><p class=\"\">“We are really excited about planting roots in Alberta, our first site in Canada. This acquisition is the culmination of extensive collaboration with multiple government agencies and the Canadian Blockchain Consortium. It marks a significant step in our strategy to become the first fully-vertically integrated Bitcoin miner, giving us unmatched control over costs, energy efficiency, and scalability,” said Haris Basit, Chief Strategy Officer at Bitdeer. “By combining our own power generation, SEALMINER mining machines and opportunistic grid participation, we believe this site will set a new benchmark for industry unit economics.”</p><p class=\"\">Regarding the project, Danielle Smith, Premier of Alberta said, “We are so pleased to welcome the world’s first net-zero, fully integrated off-grid Bitcoin mining facility — right here in Alberta. Today’s investment is another sign that Alberta continues to be a leader in technology and innovation not only across the country, but across the world. If you want to do business and have a plan to bring your own power, then Alberta is the place for you.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estimated Costs and Development Timeline </strong></p><p class=\"\">The Company plans to commence site preparation and initial infrastructure development in Q2 2025 and energization in Q4 2026.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Asset</td><td>Actual and Estimated Costs</td></tr><tr><td>101 MW Fox Creek Site and 19-acre land near Fox Creek, Alberta</td><td>$21.7 million cash</td></tr><tr><td>Gas-fired power plant</td><td>~$90 million</td></tr><tr><td>Electrical &amp; datacenter infrastructure</td><td>$300K per MW or ~$30 million</td></tr><tr><td colspan=\"2\"> </td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Bitdeer Technologies Group</strong>Bitdeer is a world-leading technology company for blockchain and high-performance computing industry. Bitdeer is committed to providing comprehensive computing solutions for its customers. The Company handles complex processes involved in computing such as equipment procurement, transport logistics, datacenter design and construction, equipment management, and daily operations. The Company also offers advanced cloud capabilities to customers with high demand for artificial intelligence. Headquartered in Singapore, Bitdeer has deployed datacenters in the United States, Norway, and Bhutan. To learn more, visit https://ir.bitdeer.com/ or follow Bitdeer on X @ BitdeerOfficial and LinkedIn @ Bitdeer Group.</p><p class=\"\">Investors and others should note that Bitdeer may announce material information using its website and/or on its accounts on social media platforms, including X, formerly known as Twitter, Facebook, and LinkedIn. Therefore, Bitdeer encourages investors and others to review the information it posts on the social media and other communication channels listed on its website.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">Statements in this press release about future expectations, plans, and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements” within the meaning of The Private Securities Litigation Reform Act of 1995. The words “anticipate,” “look forward to,” “believe,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” “would” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including factors discussed in the section entitled “Risk Factors” in Bitdeer’s annual report on Form 20-F, as well as discussions of potential risks, uncertainties, and other important factors in Bitdeer’s subsequent filings with the U.S. Securities and Exchange Commission. Any forward-looking statements contained in this press release speak only as of the date hereof. Bitdeer specifically disclaims any obligation to update any forward-looking statement, whether due to new information, future events, or otherwise. Readers should not rely upon the information on this page as current or accurate after its publication date.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For investor and media inquiries, please contact:</strong></p><p class=\"\">Investor Relations</p><p class=\"\">Orange Group</p><p class=\"\">Yujia Zhai</p><p class=\"\">bitdeerIR@orangegroupadvisors.com</p><p class=\"\">Public Relations</p><p class=\"\">BlocksBridge Consulting</p><p class=\"\">Nishant Sharma</p><p class=\"\">bitdeer@blocksbridge.com</p><p class=\"\">1 Assumes natural gas costs of ~$2.06 / GJ, plus regular maintenance and O&amp;M</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX72GlpV:0-bitdeer-announces-strategic-acquisition-of-101-mw-site-and-gas-fired-power-project-in-alberta-to-deliver-the-industry-s-first-fully-vertically-integrated-bitcoin-mining-site/",
            "pub_date": "2025-02-05 07:07:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSnQkfZa:0",
            "title": "Olympic Values Education: Celebrating the Milestone of 12 Million Children Reached in India",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / International Olympic Committee</p><p class=\"\">International Olympic Committee news</p><p class=\"\">The International Olympic Committee (IOC)'s Olympic Values Education Programme (OVEP) reached a major milestone last week: now in its third year of implementation in India, OVEP has engaged more than 12 million children across the country.</p><p class=\"\">To mark the occasion, the Olympic Museum, which manages the programme, welcomed children and teachers from Assam, India, to Lausanne, Switzerland, one year after OVEP was implemented in their state. The delegation, organised through the Abhinav Bindra Foundation Trust (ABFT), participated in the museum's 43rd annual Olympic Week, which features sports and cultural activities for kids.</p><p class=\"\">View additional multimedia and more ESG storytelling from International Olympic Committee on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: International Olympic Committee</p><p class=\"\">Website: https://www.3blmedia.com/profiles/international-olympic-committee</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> International Olympic Committee</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSnQkfZa:0/",
            "pub_date": "2025-02-05 07:08:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1AP:0",
            "title": "Databricks Acquires Bladebridge Technology And Talent",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Databricks:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DATABRICKS: ACQUIRES BLADEBRIDGE TECHNOLOGY AND TALENT; IN PAST YEAR DATABRICKS SQL REVENUE GREW OVER 150%, SURPASSING $600 MILLION RUN RATE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DATABRICKS: EXPECTS TO CROSS $3 BILLION REVENUE RUN RATE AND BE FREE CASH FLOW POSITIVE IN Q4 ENDING JAN 31, 2025</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1AP:0-databricks-acquires-bladebridge-technology-and-talent/",
            "pub_date": "2025-02-05 07:08:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013504:0",
            "title": "South Korea Inflation Accelerates to 2.2% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">South Korea's headline inflation accelerated at a faster-than-expected pace in the first month of the year to stay above the central bank's 2% target.</p><p class=\"\">The benchmark consumer-price index rose 2.2% in January from a year earlier, following a 1.9% gain in December, on higher prices for groceries and energy products, the country's statistics office said Wednesday.</p><p class=\"\">The latest print, the highest since July, beat the median forecast from 11 economists in a Wall Street Journal poll tipping a 2.0% gain for January.</p><p class=\"\">The pickup in price growth was largely led by Lunar New Year holiday-driven demand for agricultural and fishery products as well as higher gasoline and diesel prices, according to analysts.</p><p class=\"\">Compared with the prior month, the index gained 0.7% in January, also beating the median forecast in the WSJ poll for a 0.5% increase. In December, consumer prices rose 0.4% from the previous month.</p><p class=\"\">Core CPI, which strips out volatile food and energy prices, rose 1.9% from a year earlier in January and gained 0.5% from the previous month.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013504:0/",
            "pub_date": "2025-02-05 07:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013605:0",
            "title": "Norwegian Cruise Line Initiated at Hold by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(23:09 GMT) </strong>Norwegian Cruise Line Price Target Announced at $26.00/Share by Loop Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013605:0/",
            "pub_date": "2025-02-05 07:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013613:0",
            "title": "PBCO Announces Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PBCO Announces Cash Dividend</p><p class=\"\">MEDFORD, Ore.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">PBCO Financial Corporation (OTCPK: \"PBCO\"), the holding company (Company) of People's Bank of Commerce (Bank), today announced that it has declared a cash dividend representing 15% of 2024 year-end net income, or $0.229 per share. The $0.229 dividend will be paid on March 5, 2025, to shareholders of record February 19, 2025 and will be rounded up to the nearest full cent upon payment. \"I am pleased to announce that this represents the first cash dividend paid to shareholders since 2009. The Company remains well capitalized by regulatory capital standards,\" reported Julia Beattie, President and CEO.</p><p class=\"\">As of December 31, 2024, the Company reported total assets of $798.6 million, total deposits of $673.8 million, and shareholder's equity of $87.6 million. The Company reported net income of $8.1 million, or earnings per share of $1.52, for the year-end 2024.</p><p class=\"\">About PBCO Financial Corporation</p><p class=\"\">PBCO Financial Corporation's stock trades on the over-the-counter market under the symbol PBCO. Additional information about the Company is available in the investor section of the Company's website at: www.peoplesbank.bank.</p><p class=\"\">Founded in 1998, People's Bank of Commerce is a full-service, commercial bank headquartered in Medford, Oregon with branches in Albany, Ashland, Central Point, Eugene, Grants Pass, Jacksonville, Klamath Falls, Lebanon, Medford, and Salem.</p><p class=\"\">\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995:</p><p class=\"\">This release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as People's Bank or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts, \" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe People's Bank's business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204195175/en/</p><p class=\"\">CONTACT:    Julia Beattie, President &amp; CEO</p><p class=\"\">(541) 608-8920</p><p class=\"\">julia.beattie@peoplesbank.bank</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013613:0/",
            "pub_date": "2025-02-05 07:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013635:0",
            "title": "Carnival Initiated at Hold by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013635:0/",
            "pub_date": "2025-02-05 07:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV37X:0",
            "title": "American Financial Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc  reported quarterly adjusted earnings of $3.12​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $2.84.  The mean expectation of seven analysts for the quarter was for earnings of $3.10 per share. Wall Street expected results to range from $2.71  to $3.61 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 6.8% to $1.85 billion from a year ago; analysts expected $1.72 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc's reported EPS for the quarter was $3.03​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $255 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc shares had fallen by 0.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the property &amp; casualty insurance peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for American Financial Group Inc is $150.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:00 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.10</p></td><td><p class=\"\">3.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.47</p></td><td><p class=\"\">2.31</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.45</p></td><td><p class=\"\">2.56</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.70</p></td><td><p class=\"\">2.76</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV37X:0-american-financial-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:00:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013523:0",
            "title": "Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025</p><p class=\"\">TORONTO--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Organigram Holdings Inc.  , the parent company of Organigram Inc. (together, the \"Company\" or \"Organigram\"), a leading licensed producer of cannabis, announced today it will report earnings results for its first quarter fiscal 2025 ended December 31, 2024, on Tuesday, February 11, 2025, prior to market open.</p><p class=\"\">The Company will host a conference call to discuss its results with details as follows:</p><p class=\"\">Date: Tuesday, February 11, 2025</p><p class=\"\">Time: 8:00 am Eastern Time</p><p class=\"\">To register for the conference call, please use this link:</p><p class=\"\">https://registrations.events/direct/Q4I967665</p><p class=\"\">To ensure you are connected for the full call, we suggest registering a day in advance or at minimum 10 minutes before the start of the call. After registering, a confirmation will be sent through email, including dial in details and unique conference call codes for entry. Registration is open through the live call.</p><p class=\"\">To access the webcast:</p><p class=\"\">https://events.q4inc.com/attendee/638837238</p><p class=\"\">Participants will receive their details via email.</p><p class=\"\">A replay of the webcast will be available within 24 hours after the conclusion of the call at https://www.organigram.ca/investors and will be archived for a period of 90 days following the call.</p><p class=\"\">About Organigram Holdings Inc.</p><p class=\"\">Organigram Holdings Inc. is a NASDAQ Global Select Market and TSX listed company whose wholly-owned subsidiaries include Organigram Inc., a licensed cultivator of cannabis and manufacturer of cannabis-derived goods in Canada, and recently acquired Motif Labs Ltd., a licensed cannabis processor.</p><p class=\"\">Organigram is focused on producing high-quality, indoor-grown cannabis for patients and adult recreational consumers in Canada, as well as developing international business partnerships to extend the Company's global footprint. Organigram has also developed a portfolio of legal adult-use recreational cannabis brands, including Edison, Big Bag O' Buds, SHRED, Monjour and Trailblazer. Organigram operates facilities in Moncton, New Brunswick and Lac-Supérieur, Québec, with a dedicated manufacturing facility in Winnipeg, Manitoba. As a result of the acquisition of Motif Labs Ltd. on December 6, 2024, the Company now operates two additional cannabis processing facilities in Southwestern Ontario; one in Aylmer and the other in London. The facility in Aylmer houses best-in-class CO2 and Hydrocarbon extraction capabilities, and is optimized for formulation refinement, post-processing of minor cannabinoids, and pre-roll production. The facility in London will be optimized for labelling, packaging, and national fulfillment. The Company is regulated by the Cannabis Act and the Cannabis Regulations (Canada).</p><p class=\"\">This news release contains forward-looking information. Often, but not always, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"estimates\", \"intends\", \"anticipates\", \"believes\" or variations of such words and phrases or state that certain actions, events, or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results, events, performance or achievements of Organigram to differ materially from current expectations or future results, performance or achievements expressed or implied by the forward-looking information contained in this news release. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information include factors and risks as disclosed in the Company's most recent annual information form, management's discussion and analysis and other Company documents filed from time to time on SEDAR+ (see www.sedarplus.ca) and filed or furnished to the Securities and Exchange Commission on EDGAR (see www.sec.gov). Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. The forward-looking information included in this news release are made as of the date of this news release and the Company disclaims any intention or obligation, except to the extent required by law, to update or revise any forward-looking information, whether as a result of new information, future events or otherwise.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204831799/en/</p><p class=\"\">CONTACT:    For Media enquiries:</p><p class=\"\">Megan McCrae, Senior Vice President — Global Brands and Corporate Affairs</p><p class=\"\">megan.mccrae@organigram.ca</p><p class=\"\">For Investor Relations enquiries:</p><p class=\"\">Max Schwartz, Director of Investor Relations</p><p class=\"\">investors@organigram.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013523:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013527:0",
            "title": "Aware Taps Amlani to Be New CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Aware named Ajay Amlani its new chief executive officer.</p><p class=\"\">The provider of biometrics software products, services, and solutions on Tuesday said that Amlani replaces Robert Eckel, who in October agreed to leave the company by the end of 2024.</p><p class=\"\">Amlani brings nearly two decades of experience at the intersection of government, private sector innovation, and identity technology, the company said. Most recently, Amlani served as the head of the Americas region at iProov, a smaller competitor in the digital identity company space based in London.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013527:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS839zCa:0",
            "title": "Early Warning Report - Shares of Jade Leader Corp",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">CALGARY, AB / ACCESS Newswire / February 4, 2025 /</strong> This press release is being disseminated as required by National Instrument 62-103 - The Early Warning System and Take over Bid and Insider Reporting Issues regarding the disposition and acquisition of securities of Jade Leader Corp. (\"Jade Leader\").</p><p class=\"\">On February 4, 2025, Normand Goupil (\"Mr. Goupil\"), purchased pursuant to a private placement, a total of 2,500,000 Common Shares or 3.3% of the issued and outstanding shares on an undiluted basis of Jade Leader for cash consideration of $100,000 or $0.04 per Common Share. Following the share purchase Mr. Goupil will beneficially own, control or have direction over, directly or indirectly, an aggregate of 10,044,000 Common Shares representing 13.4% of the issued and outstanding Common Shares as well as hold 1,500,000 Warrants (representing 15.1% on a partly diluted basis, assuming the exercise of all Warrants held by Mr. Goupil). Mr. Goupil's acquisition represents an approximately 2.3% increase in his ownership and or control over Common Shares of Jade Leader on a partially diluted basis, assuming no further common shares of Jade have been issued. The Common Shares are being acquired for investment purposes and in the future, he may further decrease or increase his beneficial ownership of the securities of Jade Leader.</p><p class=\"\">A copy of the early warning report will be available on Jade Leader's Sedar profile at <strong class=\"root-Tkn6WL2y\">www.sedar.com</strong><strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For Further Information Contact:</strong></p><p class=\"\">info@jadeleader.ca</p><p class=\"\">Or Jean Pierre Jutras, President</p><p class=\"\">at 1.403.233.0464</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Jade Leader Corp.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS839zCa:0/",
            "pub_date": "2025-02-05 07:01:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463553:0",
            "title": "SKY Perfect JSAT Reports 2.6 Million SKY PerfecTV! Subscribers as of End-January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Perfect JSAT Holdings  reported 2.6 million subscribers to its SKY PerfecTV! pay-TV service at the end of January, a decline of 16,131 from the prior month, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The main SKY PerfecTV! service saw a net drop of 10,242 users to 1.9 million, while the premium service fell by 5,889 to 649,703. The optical fiber-based re-transmission service added 7,681 subscribers, reaching 2.8 million households.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463553:0/",
            "pub_date": "2025-02-05 07:01:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309491:0",
            "title": "Neurocrine Biosciences Insider Sold Shares Worth $413,967, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kevin Charles Gorman, Director, on January 31, 2025, sold 2,707 shares in Neurocrine Biosciences  for $413,967. Following the Form 4 filing with the SEC, Gorman has control over a total of 517,030 common shares of the company, with 517,030 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309491:0/",
            "pub_date": "2025-02-05 07:01:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013529:0",
            "title": "Viking Holdings Initiated at Buy by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(23:02 GMT) </strong>Viking Holdings Price Target Announced at $55.00/Share by Loop Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013529:0/",
            "pub_date": "2025-02-05 07:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463568:0",
            "title": "Business Activity in Australia's Services Sector Rises in January; Confidence Hits 32-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Business activity in Australia's services sector grew further in January, while confidence surged to a 32-month high, according to a survey by S&amp;P Global published Wednesday. </p><p class=\"\">The Services PMI Business Activity Index rose to 51.2 last month from 50.8 in December 2024. </p><p class=\"\">Improving customer demand helped drive new business, which grew at its fastest rate in three months. New export orders also improved for a second straight month, with notable growth from mainland China. </p><p class=\"\">Employment returned to growth as firms hired more staff to meet increased demand. </p><p class=\"\">Meanwhile, business confidence reached its highest level since May 2022. </p><p class=\"\">Elsewhere, the rates of inflation of input costs and selling prices accelerated in January.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463568:0/",
            "pub_date": "2025-02-05 07:02:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309486:0",
            "title": "Flex Partners With Husqvarna to Streamline Supply Chain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Flex  and Husqvarna said late Tuesday they have partnered to enhance Husqvarna's flexibility, efficiency, and time to market through Flex's advanced supply chain management solutions. </p><p class=\"\">Under the agreement, Flex will provide supply chain and manufacturing services for Husqvarna in the North American market. </p><p class=\"\">This collaboration will also expand Flex's portfolio into the outdoor and power equipment sector, according to the companies.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309486:0/",
            "pub_date": "2025-02-05 07:02:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013541:0",
            "title": "Nektar Names Kotzin Interim Chief Medical Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Nektar Therapeutics named Brian Kotzin its interim chief medical officer, succeeding Mary Tagliaferri, who stepped down from the role citing personal reasons.</p><p class=\"\">Kotzin will assist in the search for a permanent replacement, the San Francisco company said in a Tuesday filing with the Securities and Exchange Commission.</p><p class=\"\">Kotzin has served as a strategic advisor to Nektar since 2023. He has more than 40 years of experience in immunology, as well as development and management experience, the company said.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013541:0/",
            "pub_date": "2025-02-05 07:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA3YKMX6:0",
            "title": "Willdan Expands Florida Presence With Acquisition Of Alpha Inspections",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Willdan Group Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">WILLDAN EXPANDS FLORIDA PRESENCE WITH ACQUISITION OF ALPHA INSPECTIONS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WILLDAN GROUP INC: TERMS OF TRANSACTION WERE NOT DISCLOSED</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA3YKMX6:0-willdan-expands-florida-presence-with-acquisition-of-alpha-inspections/",
            "pub_date": "2025-02-05 07:03:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463554:0",
            "title": "SKY Perfect JSAT Partners JAXA Startup Penetrator for AI-Powered Real Estate Insights",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Perfect JSAT Holdings  said its unit, SKY Perfect JSAT Corporation, has entered into a business partnership with Penetrator, a JAXA-backed startup, to enhance real estate transactions using satellite data and artificial intelligence, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The collaboration seeks to digitize Japan's real estate brokerage industry, in which about 70% of land deals still rely on personal networks, according to Penetrator. </p><p class=\"\">The startup has developed an AI-powered search engine integrating satellite, government, and web data to identify off-market properties. </p><p class=\"\">SKY Perfect JSAT will provide cost-effective satellite data with high-frequency updates to enhance Penetrator's platform, aiming to expand the use of satellite imagery in the private real estate sector.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463554:0/",
            "pub_date": "2025-02-05 07:04:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013445:0",
            "title": "Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(22:52 GMT) </strong>*Insignia Financial Receives Takeover Proposal From Brookfield<br/><strong class=\"root-Tkn6WL2y\">(22:53 GMT) </strong>*Insignia: Brookfield Offering A$4.60/Share in Cash or Scrip<br/><strong class=\"root-Tkn6WL2y\">(22:53 GMT) </strong>*Insignia: Indicative Proposal at Same Price Proposed by Existing Suitors<br/><strong class=\"root-Tkn6WL2y\">(22:54 GMT) </strong>*Insignia Has Granted Brookfield Limited Non-Exclusive Due Diligence<br/><strong class=\"root-Tkn6WL2y\">(23:05 GMT) </strong>Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial</p><p class=\"\">By Stuart Condie</p><p class=\"\">SYDNEY--Brookfield Asset Management made a US$1.93 billion proposal for Insignia Financial, becoming the Australian wealth manager's third suitor.</p><p class=\"\">Insignia on Wednesday said that Brookfield made a non-binding proposal of 4.60 Australian dollars, or US$2.88, a share. That is the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\">Brookfield's proposal is for cash or shares in an unlisted post-takeover entity, Insignia said.</p><p class=\"\">ASX-listed Insignia, which already opened its books to CC Capital and Bain, granted Brookfield limited due diligence on a non-exclusive basis in hope of attracting a binding offer.</p><p class=\"\">Write to Stuart Condie at stuart.condie@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013445:0/",
            "pub_date": "2025-02-05 07:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013514_20250204013514:0",
            "title": "Stingray 3Q EPS C$0.23 >RAY.A.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013514_20250204013514:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013514_20250204013520:0",
            "title": "Stingray 3Q Adj EPS C$0.34 >RAY.A.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013514_20250204013520:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013513:0",
            "title": "Standard & Poor's Closing Stock Indexes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                  High        Low      Close     Change <br/>                                  ----        ---      -----     ------ <br/>  S&amp;P SmallCap 600 Index      1,445.21   1,426.05   1,444.29      17.23 <br/>  S&amp;P MidCap 400 Index        3,221.24   3,195.14   3,218.76      19.22 <br/>  S&amp;P 100 Index               2,952.21   2,920.55   2,950.25      26.30 <br/>  S&amp;P 500 Index               6,042.48   5,990.87   6,037.88      43.31 <br/> <br/> <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013513:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5XKSL1:0",
            "title": "North American Construction Group Ltd. Fourth Quarter Results Conference Call and Webcast Notification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ACHESON, Alberta, Feb.  04, 2025  (GLOBE NEWSWIRE) — North American Construction Group Ltd. (“NACG” or “the Company”) (TSX:NOA.TO/NYSE:NOA) announced today that it will release its financial results for the fourth quarter ended December 31, 2024 on Wednesday, March 5, 2025 after markets close. Following the release of its financial results, NACG will hold a conference call and webcast on Thursday, March 6, 2025, at 7:00 a.m. Mountain Time (9:00 a.m. Eastern Time).</p><p class=\"\">The call can be accessed by dialing:</p><p class=\"\">Toll free: 1-800-717-1738</p><p class=\"\">Conference ID: 71653</p><p class=\"\">A replay will be available through April 6, 2025, by dialing:</p><p class=\"\">Toll Free: 1-888-660-6264</p><p class=\"\">Conference ID: 71653</p><p class=\"\">Playback Passcode: 71653</p><p class=\"\">A slide deck for the webcast will be available for download the evening prior to the call and will be found on the company’s website at www.nacg.ca/presentations/</p><p class=\"\">The live presentation and webcast can be accessed at: North American Construction Group Ltd. Fourth Quarter Results Conference Call and Webcast Registration</p><p class=\"\">A replay will be available until April 6, 2025, using the link provided.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Company</strong></p><p class=\"\">North American Construction Group Ltd. is a premier provider of heavy civil construction and mining services in Canada, the U.S. and Australia. For over 70 years, NACG has provided services to the mining, resource and infrastructure construction markets.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Jason Veenstra, CPA, CA</p><p class=\"\">Chief Financial Officer</p><p class=\"\">North American Construction Group Ltd.</p><p class=\"\">Phone: (780) 960-7171</p><p class=\"\">Email: ir@nacg.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5XKSL1:0-north-american-construction-group-ltd-fourth-quarter-results-conference-call-and-webcast-notification/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0O9:0",
            "title": "China markets return from holiday facing trade war and AI rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mainland markets return to tariffs after week-long break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">HK-listed Chinese shares have surged this week</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Weak yuan fixing could signal Beijing's approach to trade</li></ul></span></div><span><p class=\"\">    China's markets return from a week's break on Wednesday to a fresh trade dispute with the United States and ructions in the global artificial intelligence sector. Investors said they are watching for what Beijing would do to bolster confidence.</p><p class=\"\">The early signs point to a measured open for stock markets on the Mainland. Tariffs so far have been less than what the Trump administration had initially indicated and relief was evident in Hong Kong, where Chinese stocks rallied this week. Enthusiasm around China’s artificial intelligence company DeepSeek is also likely to bolster AI stocks.</p><p class=\"\">Still, investors will look for signals from Beijing on how it sets the tone for things to come.</p><p class=\"\">One of the first such signals would come on Wednesday from where the central bank fixes the yuan , the midpoint in the trading band within which it allows the currency to trade on any given day, analysts said. </p><p class=\"\">Yuan’s weakness helped blunt the impact of tariffs in U.S. President Donald Trump's first term as president, and the fix could hold clues to China's negotiating stance on tariffs.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:799.2895204262877px;aspect-ratio:1.3321492007104796\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-2186c634d6d65c12b7251a4d0f4ccfbc-resized.webp\" type=\"images/webp\"/><img alt=\"China markets in 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-2186c634d6d65c12b7251a4d0f4ccfbc-resized.jpeg\" style=\"background-color:#ececeb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China markets in 2025</span></figcaption></figure></span></p><p class=\"\">Mainland stock markets ,  are also likely to take their cue from Hong Kong, which opened two days earlier after the Chinese New Year holiday. Chinese stocks there rose strongly on Tuesday, despite a move by the Trump administration to impose 10% tariffs on Chinese imports.</p><p class=\"\">Much has happened during China's week-long Lunar New Year holiday. Over the weekend, Trump imposed levies on goods from China, a move that prompted Beijing to announce targeted tariffs on U.S. imports and put several companies, including Google, on notice for possible sanctions. </p><p class=\"\">Trump’s actions, which also included duties on Mexico and Canada, jolted global markets. The tariffs came as the world of artificial intelligence — another major driver for global stocks over the past year — was roiled when China’s DeepSeek unveiled a cheaper AI model just a day before China went on break. That triggered a selloff across technology stocks as investors reassessed the sector's value.</p><p class=\"\">Even so, there was some relief for markets, too. Although he described the initial tranche of tariffs on China as an \"opening salvo,\" they were lower than what Trump has threatened in the past. And the president also gave reprieve to two other trading partners – Canada and Mexico – leading investors to believe that China could strike a deal as well.  </p><p class=\"\">Trump and Chinese leader Xi Jinping are expected to speak soon, although the timing of the conversation is not clear.   \"Any sign that Xi and Trump have a 'good talk' or both countries expressed commitment to work on a deal should qualify as a temporary truce and be supportive of sentiments,\" said Christopher Wong, a currency strategist at OCBC Bank. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">  Expectations Beijing will do more to support its economy in the face of U.S. tariffs, relief that the tariffs were lower than what Trump had initially threatened and bullishness on the AI and electric vehicle sectors drove gains in Hong Kong. </p><p class=\"\">Chinese companies listed in Hong Kong  rallied more than 4% this week to a three-month high, and tech heavyweights  rallied nearly 7%.</p><p class=\"\">The offshore yuan  has shed 0.6% against the dollar since Jan 27, when mainland markets closed for the holiday, and hit a lifetime low this week. Onshore, the yuan  closed at 7.2469 last week. </p><p class=\"\">Investors will see any attempts by China to weaken the currency as a hint Beijing expects a protracted war and is using the yuan to counter the effect of tariffs, as it did during Trump's first term in 2018.</p><p class=\"\">\"On the whole, having a trade war is not what the market wants... but investors are less likely to panic this time,\" said Elizabeth Kwik, investment director of Asian equities at abrdn, referring to how markets had been positioning for trade tensions for months.</p><p class=\"\">\"The underlying market for Hong Kong is very similar to China, so they should move in the same direction. Market reaction should not be too negative.\"      </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\">AI BETS</p><p class=\"\">Artificial intelligence-related stocks are likely to rise as they play catch-up to stocks in Hong Kong, riding on bullishness on local technology firms spurred by DeepSeek.</p><p class=\"\">China's top chipmaker SMIC  surged 8.5% to a record high in Hong Kong on Tuesday, and peer Hua Hong Semiconductor  advanced 12.7%.</p><p class=\"\">DeepSeek's development \"provides reason to be more optimistic on China's domestic AI players\" despite U.S. tech curbs, said Jason Chan, a senior investment strategist at Bank of East Asia. Their cheaper valuations compared with global peers could also be a tailwind, he said.</p><p class=\"\">China's benchmark blue chip index  fell 3% in January as investors fretted over the increasingly volatile macro outlook and Beijing's tepid policy response.</p><p class=\"\">Weak economic growth in the world's second-largest economy and trade risks could put pressure on policymakers to roll out more forceful support measures, investors said.</p><p class=\"\">\"China will need to deal with domestic issues including property and consumption, and improve the economic fundamentals regardless of how the tariff war pans out,\" said abrdn's Kwik. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0O9:0-china-markets-return-from-holiday-facing-trade-war-and-ai-rally/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}