{
    "data": [
        {
            "id": "DJN_DN20250204002289:0",
            "title": "Airbus Hires Goldman Sachs to Help Form European Space, Satellite Company, Bloomberg Says, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Airbus has hired Goldman Sachs to assist with forming a new European space-and-satellite company with France's Thales and Italy's Leonardo, to better compete against Elon Musk's SpaceX, Bloomberg reported, citing unnamed sources.</li><li class=\"listItem-bmN0_SHH\">Talks to create the business with aerospace company Thales and defense and aerospace group Leonardo are at an exploratory stage, according to the sources, who added that Leonardo has enlisted Bank of America while Thales is also speaking with advisers, the report said.</li><li class=\"listItem-bmN0_SHH\">The companies are assessing issues like complexity, regulatory obstacles and possible antitrust implications, Bloomberg reported, citing the sources.</li><li class=\"listItem-bmN0_SHH\">Representatives for Airbus, Leonardo, Goldman and BofA declined to comment. Thales reiterated that early discussions have taken place, without commenting on advisers, Bloomberg reported.</li></ul><p class=\"\">Full story: https://shorturl.at/2ZyWb</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002289:0-airbus-hires-goldman-sachs-to-help-form-european-space-satellite-company-bloomberg-says-citing-sources/",
            "pub_date": "2025-02-04 16:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308356:0",
            "title": "Gilead Sciences Insider Sold Shares Worth $13,822,740, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Andrew D Dickinson, Chief Financial Officer, on January 31, 2025, sold 142,180 shares in Gilead Sciences  for $13,822,740. Following the Form 4 filing with the SEC, Dickinson has control over a total of 129,873 common shares of the company, with 129,873 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/882095/000112760225002821/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/882095/000112760225002821/xslF345X05/form4.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308356:0/",
            "pub_date": "2025-02-04 16:51:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEEHFpRYa:0",
            "title": "Bulgaria’s ImPulse Growth to raise capital via warrants exercise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SOFIA (Bulgaria), February 4 (SeeNews) - Bulgarian investment firm ImPulse Growth [BUL:IMP] said it decided to raise its capital from some 6.02 million levs ($3.16 million/3.08 million euro) to up to 8.89 million levs through an exercise of warrants.</p><p class=\"\">Between February 17 and February 28, the company will offer its warrant holders up to 2.87 million voting shares with a nominal value of 1 lev each at a price of 1.50 levs apiece, ImPulse Growth said in a bourse filing on Monday.</p><p class=\"\">Warrant holders registered with the Central Depository as of February 14 will have the right to take part in the capital hike.</p><p class=\"\">Sofia International Securities will act as investment intermediary on the deal.</p><p class=\"\">In July, ImPulse Growth issued some 2.96 million warrants, each giving their owner the right to subscribe for one company share at a price of 1.50 levs during planned capital increases through May 30, 2025. These increases are scheduled for August and November 2024, as well as February and May 2025, and only warrant holders can participate.</p><p class=\"\">In the August and November 2024 capital increases, the company raised 88,803 levs and 48,638 levs, respectively.</p><p class=\"\">Shares in ImPulse Growth last traded on Monday when they closed at 1.50 levs on the BEAM growth market of the Bulgarian Stock Exchange, bourse data show.</p><p class=\"\">(1 euro = 1.95583 levs)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEEHFpRYa:0-bulgaria-s-impulse-growth-to-raise-capital-via-warrants-exercise/",
            "pub_date": "2025-02-04 16:52:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV08O:0",
            "title": "HK-listed Chinese stocks hit 3-month high despite China, US tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Stocks rally despite new Sino-US tariffs</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">AI and EV shares lead the gains</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Focus shifts to China's tariff responses and upcoming NPC</li></ul></span></div><span><p class=\"\">    Chinese stocks listed in Hong Kong surged on Tuesday as investors loaded up on artificial intelligence and electric vehicle shares while shrugging off news of tit-for-tat Sino-U.S. tariffs on each other's goods.</p><p class=\"\">        China's finance ministry announced a package of tariffs on a range of U.S. products in an immediate response to President Donald Trump's 10% tariff on Chinese imports that went into effect at 0501 GMT.</p><p class=\"\">Investors had been hoping Trump would retract the proposal to raise tariffs on China at the last minute, just as he did with Canada and Mexico on Monday.</p><p class=\"\">        However, as the deadline passed and U.S. tariffs came into force, Beijing announced its own levies of 15% for U.S. coal and LNG and 10% for crude oil, farm equipment and some autos. The new tariffs on U.S. exports will start on Feb. 10, China's finance ministry said.    </p><p class=\"\">\"China is trying to get some bargaining power before getting close to the negotiating table. It doesn't mean that they will not go for negotiation talks,\" said Steven Leung, who handles institutional trading at stockbroker UOB-Kay Hian in Hong Kong. </p><p class=\"\">Trump's press secretary said the president will speak with Chinese President Xi Jinping in the next couple of days</p><p class=\"\">The Hang Seng China Enterprises Index  closed up 3.5% at a fresh three-month high. The Hang Seng Tech Index  surged 5.1%, and Hong Kong's benchmark Hang Seng index  added 2.8%.   </p><p class=\"\">The Hang Seng Index has advanced 3.6% so far this year, outperforming major global markets including Japan  and the U.S. S&amp;P 500 index . Wong Kok Hoong, head of equity sales trading at Maybank, said investors had so far viewed  tariffs as a negotiation strategy between the two superpowers. </p><p class=\"\">Trump's announcement of the 10% tariff had also come as a relief, for his threats soon after he won the election last year were to impose 60% tariffs on China.    </p><p class=\"\">\"It's the glass-half-full way of looking at Hong Kong and China... perhaps only a 10% tariff and not the dreaded 60% from the get-go,\" he said. \"In a way markets may be slowly interpreting tariffs as a negotiation tactic, and one can strike a deal with this POTUS.\" </p><p class=\"\">Beijing's initial proposal to Trump's tariffs will centre on restoring the \"Phase 1\" trade deal signed in 2020 during his first term, the Wall Street Journal reported on Monday, citing sources.</p><p class=\"\">Leading gains on Tuesday, AI-related stocks rallied as investors continued to pile up wagers on home-grown firms after startup DeepSeek released a large language model at a lower cost. </p><p class=\"\">China's top chipmaker SMIC  surged 8.5% to a record high, and peer Hua Hong Semiconductor  advanced 12.7%. </p><p class=\"\">The EV sector also lifted the market, with carmaker XPeng  jumping 11.8% after the company said it delivered a nearly three-fold increase in smart EVs in January year-on-year. </p><p class=\"\">Financial markets in mainland China will reopen on Wednesday after the long Lunar New Year holiday. China's benchmark blue-chip index  fell 3% in January before the holiday, surrendering nearly half of September's 40% rally. </p><p class=\"\">The markets may look through the political noise to focus on China's responses to U.S. tariffs and the upcoming National People's Congress (NPC) meeting in the next few weeks, analysts at Citi said in a note. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV08O:0-hk-listed-chinese-stocks-hit-3-month-high-despite-china-us-tariffs/",
            "pub_date": "2025-02-04 16:52:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV01D:0",
            "title": "Iraq's Al-Ataa Islamic Bank FY Profit At 230.3 Million Dinars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AL-ATAA ISLAMIC BANK FOR INVESTMENT AND FINANCE PSC (BLAD.ISX):</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">AL-ATAA ISLAMIC BANK FOR INVESTMENT AND FINANCE FY NET PROFIT AFTER TAX 230.3 MILLION DINARS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">AL-ATAA ISLAMIC BANK FY NET INCOME FROM BANKING ACTIVITIES 5.80 BILLION DINARS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV01D:0-iraq-s-al-ataa-islamic-bank-fy-profit-at-230-3-million-dinars/",
            "pub_date": "2025-02-04 16:52:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002298:0",
            "title": "Diageo's Performance Seen as Positive, Guidance Withdraw Acceptable — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Diageo's 1H performance was satisfactory and likely exceeded market expectations, with signs of stabilization as sales were up by 1% and profits down by 1%, Quilter Cheviot's Chris Beckett says. Diageo's decision to remove medium-term guidance of 5%-7% organic sales growth might upset some investors. However, this move is acceptable given that the target was laid during the pandemic--when demand for alcohol was exceptionally high--and unrealistic given the current environment, Beckett writes in a note. Additionally, the owner of Johnnie Walker, Guinness and Smirnoff seems to be effectively managing its significant debt, given that the dividend remained unchanged amid concerns of a potential cut, Beckett says. Diageo's 2H performance is likely to be similar if U.S. tariffs are not imposed, he adds. Shares are down 3.3% and nearly 20% over the last 52 weeks. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002298:0/",
            "pub_date": "2025-02-04 16:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463340:0",
            "title": "Taichung Commercial Bank Names Chairman",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Taichung Commercial Bank's  board elected Ruey-Tsang Lee as chairman, effective Monday, according to a Tuesday Taiwan Exchange filing. </p><p class=\"\">Lee previously served as a director at the bank, according to a Monday Taiwan Exchange filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463340:0/",
            "pub_date": "2025-02-04 16:53:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463345:0",
            "title": "Hazoor Multi Projects Bags New Order Worth INR672 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hazoor Multi Projects  has secured a new order worth 671.6 million Indian rupees from the National Highways Authority of India, according to a Tuesday filing to the BSE. </p><p class=\"\">The contract entails acting as user fee collection agency at Hulikunte Fee Plaza for the use of four laning from Dobaspet to Dodaballapur Bypass section of National Highway-648 in the state of Karnataka and upkeep and maintenance of nearby areas.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463345:0/",
            "pub_date": "2025-02-04 16:54:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV09Z:0",
            "title": "Tariffs could deal $200 million blow to Diageo in second half",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Diageo  estimates its operating profit could be dented by roughly $200 million if U.S. tariffs on Mexico and Canada are implemented in March, its finance chief Nik Jhangiani said on Tuesday, adding it had strategies to offset the impact. </p><p class=\"\">The world's leading spirits maker generates around 45% of sales in the United States, its biggest market, from products that must be made in either Mexico or Canada, such as Don Julio tequila and Crown Royal Canadian whisky. </p><p class=\"\">U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> threatened to impose 25% tariffs on both nations from Tuesday, but just ahead of their implementation, he suspended both levies until March 1. </p><p class=\"\">If the tariffs are enforced, Jhangiani said Diageo anticipates a gross impact on operating profit for the remainder of its financial year, running to June 30, of around $200 million, but has plans in place to mitigate the impact.</p><p class=\"\">\"We feel today that we could cover around 40% of that before any pricing actions,\" he told journalists on a call for Diageo's interim results. </p><p class=\"\">CEO Debra Crew said the estimated hit was based on the current scenario and did not take into account further escalations or retaliatory actions. </p><p class=\"\">\"We're planning for all scenarios,\" she said. </p><p class=\"\">Executives said Diageo's options to mitigate the effect of tariffs included re-allocating resources, changes to its supply chain and pricing, as well as ongoing engagement with the Trump administration. </p><p class=\"\">It has already implemented initiatives around \"inventory management,\" they said, with approaches such as shipping stock into a country before duties come into force. </p><p class=\"\">The impending tariffs would be on the input cost, not the retail price, they added.</p><p class=\"\">Diageo said uncertainty around tariffs prevented it from giving clearer guidance on its future earnings on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV09Z:0-tariffs-could-deal-200-million-blow-to-diageo-in-second-half/",
            "pub_date": "2025-02-04 16:54:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002306:0",
            "title": "Grab Mulls Takeover of GoTo at $7 Billion Valuation, Bloomberg Says, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Grab Holdings is weighing a takeover of rival GoTo Group at a valuation of more than $7 billion, Bloomberg reported Tuesday, citing unnamed sources.</li><li class=\"listItem-bmN0_SHH\">The companies have held on-and-off talks for years, Bloomberg said.</li><li class=\"listItem-bmN0_SHH\">Discussions have intensified in recent weeks and the companies see this year as an opportune time for a deal, the people said, according to Bloomberg.</li><li class=\"listItem-bmN0_SHH\">A GoTo spokesperson declined to comment, while Grab had no immediate comment, the Bloomberg report said.</li></ul><p class=\"\">Full story: https://www.bloomberg.com/news/articles/2025-02-04/grab-goto-accelerate-merger-talks-and-aim-for-deal-in-2025</p><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002306:0/",
            "pub_date": "2025-02-04 16:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002307:0",
            "title": "Dollar Could Soon Recover Due to Continuing Tariff Uncertainty, Data — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The dollar falls after President Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank's Antje Praefcke says in a note. There is a risk of new tariff announcements coming at any time, she says. \"The next shock is bound to come, and this will probably be dollar-positive again.\" Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, she says. The DXY dollar index falls 0.4% to 108.589, having hit a three-week high of 109.881 Monday. (jessica.fleetham@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002307:0/",
            "pub_date": "2025-02-04 16:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463344:0",
            "title": "Jvckenwood's Nine-Month Profit Balloons 29%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jvckenwood  recorded a 29% rise in attributable profit for the nine months ended Dec. 31, 2024 to 14.1 billion yen from 10.9 billion yen in the year-ago period, a Monday bourse filing said. </p><p class=\"\">Earnings per share were 92.7 yen in the nine months, up from 69.88 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The electronics company saw a 1.2% rise in revenue to 270.5 billion yen in the period from 267.3 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 17 billion yen, a basic EPS of 113.46 yen, a revenue of 364 billion yen, and a total dividend of 13 yen per share for the fiscal year ending March 31. </p><p class=\"\">Shares of the company closed over 16% lower on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463344:0/",
            "pub_date": "2025-02-04 16:55:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0C6:0",
            "title": "Grab and GoTo in advanced merger talks, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Southeast Asian ride-hailing and food delivery company Grab (Grab.O) is in advanced talks to merge with its smaller Indonesian rival GoTo  as the firms seek to stem years of losses, two sources familiar with the matter told Reuters.</p><p class=\"\">A new round of merger talks, which were last held in 2024, resumed in December, with investors eager to reach a deal in 2025. An agreement may not happen, said the sources, with negotiations in previous years all falling through. The people declined to be identified as the talks are private.</p><p class=\"\">Grab and GoTo, which operates ride-hailing and food delivery platform Gojek, declined to comment. The revived talks were first reported by DealStreetAsia. </p><p class=\"\">GoTo shares, listed in Jakarta, were up nearly 9% on reports of the talks, while Grab was down 0.87% in premarket trading. Combined, the companies are worth nearly $25 billion.</p><p class=\"\">GoTo's Indonesian e-commerce unit Tokopedia was taken over by Tiktok in December 2023, in a deal where the Chinese social media giant would invest $1.5 billion in the unit in exchange for a 75% controlling stake.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0C6:0-grab-and-goto-in-advanced-merger-talks-sources-say/",
            "pub_date": "2025-02-04 16:55:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0MQ:0",
            "title": "Coloplast rises after in-line Q1, analysts point to positioning",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Coloplast's  shares rise 3.5% after its Q1 print comes in line with expectations, with analysts pointing to sector-leading growth momentum </p><p class=\"\">** The Danish intimate healthcare equipment maker reiterates its full-year EBIT margin and organic growth outlook, flagging it will be H2-weighted</p><p class=\"\">** J.P. Morgan says in a note it expected the shares to rise on positioning </p><p class=\"\">** \"Coloplast remains a key pick, thanks to every metric being sector-leading, notably an already superior growth profile set to accelerate even further,\" Jefferies says</p><p class=\"\">** The broker adds that while investors were taken off guard by two large deals since late 2021, the path to margin recovery is clear as M&amp;A dilution and inflation wear off</p><p class=\"\">** The stock is among top risers on Europe's STOXX 600  index</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0MQ:0-coloplast-rises-after-in-line-q1-analysts-point-to-positioning/",
            "pub_date": "2025-02-04 16:47:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308363:0",
            "title": "Dorman Products Insider Sold Shares Worth $1,704,621, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Steven L Berman, Director, on January 30, 2025, sold 12,668 shares in Dorman Products  for $1,704,621. Following the Form 4 filing with the SEC, Berman has control over a total of 885,195 common shares of the company, with 760,426 shares held directly and 124,769 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/868780/000162828025003540/xslF345X05/wk-form4_1738625572.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/868780/000162828025003540/xslF345X05/wk-form4_1738625572.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308363:0/",
            "pub_date": "2025-02-04 16:47:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002158_20250204002262:0",
            "title": "UBS CFO: Efforts to Restore GMW Profitability in U.S. Could Add Headwind to Asset Flows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002158_20250204002262:0/",
            "pub_date": "2025-02-04 16:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308362:0",
            "title": "Meta Platforms Insider Sold Shares Worth $8,992,540, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mark Zuckerberg, 10% Owner, Director, Chair of Board and Chief Executive Officer, on January 30, 2025, sold 12,975 shares in Meta Platforms  for $8,992,540. Following the Form 4 filing with the SEC, Zuckerberg has control over a total of 223,946 Class A common shares of the company, with 223,946 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1326801/000095010325001454/xslF345X05/dp224369_4-zuckerberg0130p2.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1326801/000095010325001454/xslF345X05/dp224369_4-zuckerberg0130p2.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308362:0/",
            "pub_date": "2025-02-04 16:48:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463338:0",
            "title": "Hong Kong Stocks Rebound Led by Tech Firms as Hopes of US Trade Talks Persist; Meituan Surges 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong stocks ended their losing streak and rose on Tuesday, led by AI-related firms, while investors clung to the hope of trade talks curbing a potential trade war between the two largest economies in the world. </p><p class=\"\">The Hang Seng Index surged 2.83%, or 572.70 points, to close the day at 20,789.96. The Hang Seng China Enterprises Index added 3.51%, or 259.52 points, to 7,643.63. </p><p class=\"\">A 10% duty from the US on Chinese goods was implemented Tuesday, despite indications of potential negotiations by Donald Trump, president of the US, an SCMP report stated. </p><p class=\"\">China retaliated by announcing its intention to put a 10% to 15% tariff in place starting Feb. 10 on various US products including coal, LNG, oil, and agricultural equipment. </p><p class=\"\">At the same time, the US has delayed imposing tariffs on Mexico and Canada by one month on an agreement for increased vigilance at the borders to restrict the flow of drugs and migrants, according to the report. </p><p class=\"\">Investors are hoping for similar negotiations with China to end the current tariff disputes. </p><p class=\"\">On an uplifting note, Hong Kong's gross domestic product increased 2.4% year over year in the fourth quarter of 2024, higher than the 1.9% growth in Q3 2024, according to advance estimates of the city's census and statistics department. </p><p class=\"\">Hong Kong's total retail sales, on the other hand, fell by 9.7% from the year-ago period to HK$32.8 billion in December 2024, according to a separate report released by the department Monday. </p><p class=\"\">In corporate news, tech and AI firms were the main drivers of the rally, with Alibaba Group , Tencent , and Xiaomi  rising around 4% each, while Meituan  soared 6%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463338:0-hong-kong-stocks-rebound-led-by-tech-firms-as-hopes-of-us-trade-talks-persist-meituan-surges-6/",
            "pub_date": "2025-02-04 16:48:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002278:0",
            "title": "Trade Tensions Keep U.K. Investors on Edge, Hargreaves Lansdown Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.K. investors are on edge as trade jitters continue, Hargreaves Lansdown's Matt Britzman writes. Trade tensions are dictating the market mood, especially in Europe where U.S. President Trump keeps the continent guessing with lingering threats, the senior equity analyst writes. With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, the analyst says. The U.K.'s FTSE 100 trades down 0.4%. (adam.whittaker@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002278:0/",
            "pub_date": "2025-02-04 16:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002240_20250204002279:0",
            "title": "Asian Paints CEO: Cautiously Optimistic About Recovery in Demand Conditions Near Term >500820.BY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002240_20250204002279:0/",
            "pub_date": "2025-02-04 16:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308361:0",
            "title": "Meta Platforms Insider Sold Shares Worth $21,563,848, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mark Zuckerberg, 10% Owner, Director, Chair of Board and Chief Executive Officer, on January 31, 2025, sold 30,908 shares in Meta Platforms  for $21,563,848. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1326801/000095010325001455/xslF345X05/dp224370_4-zuckerberg0131p1.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1326801/000095010325001455/xslF345X05/dp224370_4-zuckerberg0131p1.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308361:0/",
            "pub_date": "2025-02-04 16:49:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463335:0",
            "title": "Taiwanese Court Upholds Not-Guilty Verdict for Formosa Oilseed Processing Exec",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Formosa Oilseed Processing  said the Taiwan High Court Taichung Branch upheld a not-guilty verdict for its corporate chairman's representative, Chin Chuan Wu, in a securities law violation case. </p><p class=\"\">The first-instance court had ruled not guilty, but the Taichung District Prosecutors Office appealed the decision, according to a Monday Taiwan Exchange filing. </p><p class=\"\">The company stated that its business and finances remain unaffected.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463335:0/",
            "pub_date": "2025-02-04 16:49:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0OA:0",
            "title": "Indian metal stocks rise as US pauses tariffs on Mexico, Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Indian metal stocks  rebound, jump 2% on Tuesday after 1.7% drop on Monday</p><p class=\"\">** Fifteen-member Nifty Metal  index mirrors broader market that is up after U.S. paused planned tariffs on Canada and Mexico  </p><p class=\"\">** Jindal Stainless  top gainer, up 4.4%, followed by Vedanta  and state-owned SAIL , up 3.9% each</p><p class=\"\">** Index heavyweights Tata Steel , JSW Steel  up 1.4% and 1.2%, respectively; Hindalco  up 2.5%</p><p class=\"\">** Metal stocks dropped ~3% last month compared to blue-chip Nifty 50  index's ~0.6% decline</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0OA:0-indian-metal-stocks-rise-as-us-pauses-tariffs-on-mexico-canada/",
            "pub_date": "2025-02-04 16:50:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308359:0",
            "title": "Netflix Insider Sold Shares Worth $9,784,103, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spencer Adam Neumann, Chief Financial Officer, on January 30, 2025, sold 10,000 shares in Netflix  for $9,784,103. Following the Form 4 filing with the SEC, Neumann has control over a total of 3,691 common shares of the company, with 3,691 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1065280/000106528025000062/xslF345X05/wk-form4_1738624934.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1065280/000106528025000062/xslF345X05/wk-form4_1738624934.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308359:0/",
            "pub_date": "2025-02-04 16:50:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0A7:0",
            "title": "Most Gulf markets inch higher despite trade war fears",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Most stock markets in the Gulf edged higher in early trade on Tuesday as investors focused on upcoming corporate earnings, although escalating U.S.-China trade tensions weighed on sentiment.</p><p class=\"\">China slapped tariffs on U.S. imports in a swift response to new U.S. duties on Chinese goods, renewing a trade war between the world's top two economies even as President Donald Trump offered reprieves to Mexico and Canada.</p><p class=\"\">Additional 10% tariff across all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT) after Trump repeatedly warned Beijing it was not doing enough to halt the flow of illicit drugs into the United States.</p><p class=\"\">Saudi Arabia's benchmark index  added 0.2%, helped by a 1.4% rise in Al Rajhi Bank  and a 0.9% increase in Alinma Bank .</p><p class=\"\">The kingdom's non-oil business sector expanded at its strongest pace in just over a decade in January, driven by a surge in new orders and robust business activity, a survey showed on Tuesday.</p><p class=\"\">Dubai's main share index  rose 0.6%, with toll operator Salik Company  climbing 2.3% and blue-chip developer Emaar Properties  was up 0.7%.</p><p class=\"\">Abu Dhabi's benchmark index  edged up 0.2%, supported by a 1.6% gain in Borouge  after it reported a sharp rise in fourth-quarter profit.</p><p class=\"\">The petrochemical firm also proposed second-half dividend of 7.9 fils per share.</p><p class=\"\">The Qatari index , meanwhile, slipped 0.1%, hit by a 0.5% fall in Qatar Islamic Bank .</p><p class=\"\">Among other losers, utility firm Qatar Electricity and Water Company  retreated 1.4% ahead of its earnings announcement.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0A7:0-most-gulf-markets-inch-higher-despite-trade-war-fears/",
            "pub_date": "2025-02-04 16:50:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463341:0",
            "title": "Derayah Signs Binding Investment Deal with Olayan Saudi for IPO Subscription",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Derayah Financial signed a binding investment undertaking agreement with industrial, trading, and investment conglomerate Olayan Financing's unit Olayan Saudi Investment for the former's initial public offering in Saudi Arabia. </p><p class=\"\">Olayan Saudi will subscribe for 4,687,500 shares, representing 1.88% of the digital investment platform operator's share capital after its initial public offering on Tadawul, at the final offer price to be determined on Feb. 13, Zawya reported Tuesday. </p><p class=\"\">Derayah Financial plans to offer 49,947,039 shares, or 20% of its share capital, at between 27 Saudi riyals per share and 30 riyals per share to raise between 1.35 billion riyals and 1.50 billion riyals. The offer implies an expected market capitalization of between 6.74 billion riyals and 7.49 billion riyals.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463341:0/",
            "pub_date": "2025-02-04 16:50:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463332:0",
            "title": "Yi Shin Textile Accumulates NT$153.5 Million Worth of TSMC Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yi Shin Textile  has acquired 160,000 shares of Taiwan Semiconductor Manufacturing  for NT$153.5 million. </p><p class=\"\">The company purchased the TSMC shares between July 18, 2024, and Feb. 3, 2025, at an average price of NT$959.11 apiece, according to a Monday Taiwan Exchange filing. </p><p class=\"\">The investment is part of the company's financial and investment management strategy.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463332:0/",
            "pub_date": "2025-02-04 16:43:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0MP:0",
            "title": "Belgium's Melexis tops BEL20 on Infineon's positive results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Belgium's largest semiconductor firm Melexis  rise around 3.5% to the top of the country's main index BEL20 (.BFX), lifted by positive results of German peer Infineon </p><p class=\"\">** Analyst Michael Roeg of Degroof Petercam says Infineon's results, along with the company raising full-year guidance on a positive impact from currency fluctuations, drive Melexis shares higher</p><p class=\"\">** Shares of peer STMicroelectronics  are also up around 1.9%</p><p class=\"\">** Melexis will report full-year results for 2024 on Wednesday</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0MP:0-belgium-s-melexis-tops-bel20-on-infineon-s-positive-results/",
            "pub_date": "2025-02-04 16:43:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308367:0",
            "title": "SPS Commerce Insider Sold Shares Worth $2,255,832, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dan Juckniess, Executive Vice President, Chief Sales Officer, on January 29, 2025, sold 12,214 shares in SPS Commerce  for $2,255,832. Following the Form 4 filing with the SEC, Juckniess has control over a total of 20,522 common shares of the company, with 20,175 shares held directly and 347 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1092699/000162828025003545/xslF345X05/wk-form4_1738625927.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1092699/000162828025003545/xslF345X05/wk-form4_1738625927.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308367:0/",
            "pub_date": "2025-02-04 16:44:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446511:0",
            "title": "DAX Slightly Down",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX edged down to around 21,300 on Tuesday as investors closely watched escalating trade tensions between the world’s two largest economies, with the US and China imposing fresh tariffs on each other.</p><p class=\"\">Meanwhile, Trump agreed to pause the implementation of 25% tariffs on Canada and Mexico for 30 days.</p><p class=\"\">Traders are also focusing on upcoming quarterly results, particularly those from European banks</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446511:0-dax-slightly-down/",
            "pub_date": "2025-02-04 16:44:10",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        }
    ]
}