{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464072:0",
            "title": "Clean Motion AB to Start Sales Operations in Marbella, Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clean Motion AB  will establish sales operations in Marbella, Spain, as part of its European expansion. </p><p class=\"\">The Swedish electric vehicles maker said Wednesday the new office's initial focus is on the local market and then expand across southern Europe.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464072:0/",
            "pub_date": "2025-02-05 23:52:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310150:0",
            "title": "Valneva Gets Marketing Authorization in UK for Chikungunya Vaccine; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Valneva  secured marketing authorization in the UK for its Ixchiq vaccine for chikungunya, a mosquito-borne viral disease. </p><p class=\"\">The vaccine, manufactured at the company's leading production site in Livingston, Scotland, got the approval from the Medicines and Healthcare products Regulatory Agency,</p><p class=\"\">The single-dose vaccine is for active immunization for the prevention of disease caused by the chikungunya virus in people 18 years of age and older, Valneva said Wednesday in a statement. </p><p class=\"\">The vaccine is approved in the US, Europe and Canada in adults, and Valneva expects to get marketing approval in Brazil in Q1. </p><p class=\"\">Valneva submitted label extension applications in the US, Europe and Canada to possibly extend the use of Ixchiq to adolescents aged 12 to 17 years and plans to submit a label extension application in the UK. </p><p class=\"\">The company's shares rose 14% in recent Wednesday trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310150:0/",
            "pub_date": "2025-02-05 23:52:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007864:0",
            "title": "The Cooling Stock Heated Up After Earnings. Google Is Helping. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Al Root</p><p class=\"\">Shares of heating, ventilation, and air conditioning provider Johnson Controls soared after a solid quarterly earnings report. Guidance, and maybe even Google, helped too.</p><p class=\"\">Wednesday morning, Johnson Controls reported adjusted fiscal first-quarter earnings per share of 64 cents on sales of $5.4 billion. (The company's fiscal year ends in September.)</p><p class=\"\">Wall Street had expected earnings per share of 59 cents on sales of $5.4 billion, according to FactSet.</p><p class=\"\">For fiscal 2025, management now expects earnings per share of $3.50 to $3.60. That's up a dime from recent guidance. Wall Street currently projects $3.47 a share.</p><p class=\"\">Johnson Controls stock was up 12.7% in early trading at $87.09, while the S&amp;P 500 and Dow Jones Industrial Average were down about t0.4% and 0.2%, respectively.</p><p class=\"\">Johnson Controls shares are trading at a record high, according to Dow Jones Market Data.</p><p class=\"\">Jefferies analyst Stephen Volkmann noted orders were up 16% year over year and called profit margin performance \"solid\" in a Wednesday report. He rates Johnson Controls stock at Buy with a $95 target price.</p><p class=\"\">Along with the quarter, Google parent Alphabet might be helping Johnson Control shares. Alphabet said it plans to spend $75 billion on new capital in 2025. That's up from about $53 billion in 2024, and more than the $59 billion Wall Street was projecting.</p><p class=\"\">A lot of that spending will be for building artificial-intelligence data centers, benefiting a host of companies including Johnson Controls. Those data centers need to be cooled off.</p><p class=\"\">Full-year \"order growth of 7% in the year was led by data-center demand and contributed to our record backlog,\" said Johnson Controls CEO George Oliver on the earnings conference call.</p><p class=\"\">Data-center revenue, which isn't specifically disclosed, doubled year over year, according to the CEO.</p><p class=\"\">Oliver's comments and Alphabet's spending are a relief to investors who feared that the emergence of the Chinese AI app DeepSeek might lead to lower spending from data-center companies. DeepSeek was allegedly developed for a fraction of the cost of other AI models, creating the impression that useful AI might not cost as much to develop as previously expected.</p><p class=\"\">So far, that fear hasn't come to fruition. There is no slowdown in spending yet — or in business momentum at Johnson Controls.</p><p class=\"\">Write to Al Root at allen.root@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007864:0/",
            "pub_date": "2025-02-05 23:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW218:0",
            "title": "Fugro Acquires Mapping And Monitoring Firm EOMAP",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fugro NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUIRES EOMAP, ADDING UNIQUE SATELLITE ANALYTICS TO ITS WATER MARKET SOLUTIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW218:0-fugro-acquires-mapping-and-monitoring-firm-eomap/",
            "pub_date": "2025-02-05 23:54:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW265:0",
            "title": "Wall Street shows its 'bouncebackability': McGeever",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    \"Bouncebackability.\"</p><p class=\"\">This Britishism is usually associated with cliche-prone soccer managers trumpeting their teams' ability to respond to defeat. It's unlikely to find its way across the pond into the Wall Street crowd's lexicon, but it perfectly sums up the U.S. stock market's resilience to all the setbacks, shocks and everything else that's been thrown at it recently.</p><p class=\"\">And there have been a lot: U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a> tariff flip-flops, stretched valuations, extreme concentration in Big Tech and the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/technology/deepseek/\" rel=\"nofollow\" target=\"_blank\">DeepSeek</a>-led turmoil that recently cast doubt on America's \"exceptionalism\" in the global AI arms race.</p><p class=\"\">Any one of those issues still has the potential to snowball, causing an avalanche of selling that could push U.S. equities into a correction or even bear-market territory.</p><p class=\"\">But Wall Street has become remarkably resilient since the 2022 rout, especially in the last six months. </p><p class=\"\">Just look at the artificial intelligence-fueled turmoil on Jan. 27, spurred by Chinese startup DeepSeek's revelation that it had developed a large language model that could achieve similar or better results than U.S.-developed LLMs at a fraction of the cost. By many measures, the market move was seismic.</p><p class=\"\">Nvidia shares fell 17%, slicing nearly $600 billion off the firm's market cap, the biggest one-day loss for any company ever. The value of the wider U.S. stock market fell by around $1 trillion. </p><p class=\"\">Drilling deeper, analysts at JPMorgan found that the rout in \"long momentum\" - essentially buying stocks that have been performing well recently, such as tech and AI shares - was a near \"seven sigma\" move, or seven times the standard deviation. It was the third-largest fall in 40 years for this trading strategy.</p><p class=\"\">But this epic move didn't crash the market. Rotation into other sectors accelerated, and around 70% of S&amp;P 500-listed stocks ended the day higher, meaning the broader index fell only 1.45%. And buyers of tech stocks soon returned.</p><p class=\"\">U.S. equity funds attracted nearly $24 billion of inflows last week, technology fund inflows hit a 16-week high, and momentum funds attracted positive flows for a fifth-consecutive week, according to EPFR, the fund flows tracking firm.</p><p class=\"\">\"Investors saw the DeepSeek-triggered selloff as an opportunity rather than an off-ramp,\" EPFR director of research Cameron Brandt wrote on Monday. \"Fund flows ... suggest that many of those investors kept faith with their previous assumptions about AI.\" </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1038.9610389610389px;aspect-ratio:1.7316017316017316\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW265-144e642ff4ceaf5e8f585151f7680c54-resized.webp\" type=\"images/webp\"/><img alt=\"Weekly flows into US equity sector funds in $ million\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW265-144e642ff4ceaf5e8f585151f7680c54-resized.jpeg\" style=\"background-color:#f3f2f1\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Fund flows: U.S. equity sector funds</span></figcaption></figure></span></p><p class=\"\">PANIC MODE?</p><p class=\"\">Remember \"yenmageddon,\" the yen carry trade volatility of last August? The yen's sudden bounce from a 33-year low against the dollar sparked fears that investors would be forced to sell assets in other markets and countries to cover losses in their huge yen-funded carry trades.</p><p class=\"\">The yen's rally was extreme, on par with past financial crises, and the Nikkei's 12% fall on Aug. 5 was the biggest one-day drop since October 1987 and the second-largest on record. </p><p class=\"\">The panic, if it can be called that, spread. The S&amp;P 500 lost 8% in two days. But it vanished quickly. The S&amp;P 500 recouped its losses within two weeks, and the Nikkei did likewise within a month. </p><p class=\"\">So Wall Street has passed two big tests in the last six months, a period that included the U.S. presidential election and Trump's return to the White House.</p><p class=\"\">What explains the resilience? There's no one obvious answer. Investors are broadly bullish about Trump's economic agenda, the Fed still seems to be in easing mode (for now), the AI frenzy and U.S. exceptionalism narratives are still in play, and liquidity is plentiful.</p><p class=\"\">Perhaps one key driver is a well-worn one: the Fed put. Investors – many of whom have spent a good chunk of their working lives in the era of extraordinarily loose monetary policy – may still feel that, if it really comes down to it, the Fed will have their backs. </p><p class=\"\">There will be more pullbacks, and risks of a more prolonged downturn do seem to be growing. But for now, the rebounds keep coming. That's bouncebackability.</p><p class=\"\">(The opinions expressed here are those of the author, a columnist for Reuters.)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW265:0-wall-street-shows-its-bouncebackability-mcgeever/",
            "pub_date": "2025-02-05 23:54:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310169:0",
            "title": "Update On Calibre Mining; National Bank Looks At Leprechaun RC Drilling Shows Positive Reconciliation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Calibre Mining  on Wednesday released additional drill results from its Leprechaun open pit at the Valentine gold mine in Newfoundland and Labrador, adding 30% to contained gold. </p><p class=\"\">The results of drilling have so far demonstrated 29% more ore tonnes at a 1% higher grade for 30% more gold than the comparable area in the 2022 mineral reserve model at an ore-waste cut-off of 0.38 grams per tonne (g/t) gold. </p><p class=\"\">The grade distribution indicates that applying a higher cut-off grade will result in processing higher grade material, Calibre CEO Darren Hall said in a release. </p><p class=\"\">At a 0.7 g/t cut-off, the reserve model estimated 660,000 tonnes at 2.02 g/t but the ore control model for a similar tonnage results in 18% higher grade by increasing the cut-off to 1.0 g/t. </p><p class=\"\">The findings could result in increased metal production and extend the mine life, Hall noted. </p><p class=\"\">Meanwhile, the company has kept its Outperform rating and $3.40 price target at National Bank of Canada after the news. The price target was based on 5.00x EV/EBITDA NTM. </p><p class=\"\">National Bank said its thesis for Calibre is supported by its peer-leading 75% production growth over the next three years as Valentine commences commercial production (near Q3 2025), strong cash flow generation, and exploration/resource accretion given spare mill capacity. The thesis is tempered by short mine life at Nicaragua. </p><p class=\"\">CXB was at last look up more than 6% on the TSX.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310169:0/",
            "pub_date": "2025-02-05 23:54:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446792:0",
            "title": "US Crude Stocks Rise Most in Near a Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude stocks increased for the first time in ten weeks, along with a rise in gasoline inventories, while distillate stocks fell during the week ending January 24, according to the Energy Information Administration.</p><p class=\"\">Crude inventories grew by 3.463 million barrels, exceeding market expectations of a 3.2 million-barrel build, marking the first increase after nine consecutive weeks of declines.</p><p class=\"\">Crude stocks at the Cushing, Oklahoma, delivery hub also rose by 0.326 million barrels.</p><p class=\"\">Gasoline stocks climbed by 2.957 million barrels, surpassing the expected 1.5 million-barrel increase.</p><p class=\"\">However, distillate inventories, which include diesel and heating oil, fell by 4.994 million barrels, exceeding the anticipated 2.1 million-barrel decline.</p><p class=\"\">Meanwhile, net US crude imports rose by 0.532 million barrels per day.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446792:0-us-crude-stocks-rise-most-in-near-a-year/",
            "pub_date": "2025-02-05 23:54:24",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310161:0",
            "title": "Advanced Micro Devices' Proposed ZT Systems Deal Under Review by EU Regulators",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Advanced Micro Devices'  proposed acquisition of ZT Systems was placed under a routine merger review by the European Commission Wednesday, with a provisional deadline of March 12, according to a filing. </p><p class=\"\">AMD's proposed cash and stock deal for the server maker was valued at $4.9 billion when it was announced in August 2024. </p><p class=\"\">AMD and ZT didn't immediately respond to requests for comment from MT Newswires.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310161:0/",
            "pub_date": "2025-02-05 23:54:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446793:0",
            "title": "Heating Oil Extends Downturn",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US heating oil futures dropped to around $2.40 per gallon in February, marking a near one-month low as crude oil feedstocks continued to decline amid rising concerns over a potential US-China trade war and growing fears about global demand.</p><p class=\"\">These concerns were compounded by increased supply, with the latest EIA report revealing a significant 8.7 million barrel build, far exceeding the expected 2.6 million barrel increase for the week ending January 31st. Additionally, unseasonably warm temperatures in key heating oil-consuming regions, including the Midwest and Northeast, contributed to weaker demand, alleviating concerns about potential winter shortages, further pressuring heating commodities.</p><p class=\"\">However, the same report also highlighted a 5.5 million barrel draw in distillate inventories, a reduction more than three times the anticipated decline, which restricted the availability of refined products and moderated the fall in heating oil prices.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446793:0-heating-oil-extends-downturn/",
            "pub_date": "2025-02-05 23:54:54",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310180:0",
            "title": "Bio-Techne Keeps Quarterly Dividend at $0.08 a Share, Payable Feb. 28 to Investors of Record Feb. 17",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310180:0/",
            "pub_date": "2025-02-05 23:54:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007868:0",
            "title": "U.S. Ethanol Production Jumps Back to Near-Record Highs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kirk Maltais</p><p class=\"\">Average daily production of ethanol in the U.S. soared in the last week of January, returning to the near-record levels of November.</p><p class=\"\">In its latest report Wednesday, the Energy Information Administration said that average daily production of ethanol for the week ended Jan. 31 was 1.112 million barrels a day. That's up 97,000 barrels a day from last week's figure, and well beyond the forecasts of analysts surveyed by Dow Jones this week.</p><p class=\"\">Inventories of ethanol in the U.S. also posted a big jump, rising 690,000 barrels to 26.41 million barrels. This figure is also well above the forecasts of analysts surveyed this week.</p><p class=\"\">Surveyed analysts had projected average daily production to land between 1.015 million barrels a day and 1.073 million barrels a day. Stocks were projected between 25.5 million barrels and 26.19 million barrels.</p><p class=\"\">The record high for average daily ethanol production is 1.119 million barrels a day, set in late November of last year.</p><p class=\"\">Corn futures trading on the CBOT are down 0.8%. While higher ethanol production is typically seen as a positive thing for futures, as is the mixed outlook for weather in Argentina over the next two weeks, the net long held by fund traders in corn makes futures' movements unpredictable.</p><p class=\"\">\"We have a near record net long held by speculators and it's anyone's guess when new headlines will hit the market,\" said Doug Bergman of RCM Alternatives in a note Wednesday.</p><p class=\"\">To see related data, search \"U.S. DOE Oil Data: PADD Breakdown\" in Dow Jones NewsPlus.</p><p class=\"\">Write to Kirk Maltais at kirk.maltais@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007868:0/",
            "pub_date": "2025-02-05 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007866:0",
            "title": "EU LNG Imports to Rise This Year, Kpler Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The European Union's need to rapidly replenish dwindling gas reserves is expected to boost imports of liquefied natural gas by more than 20% this year, Kpler analysts say. According to the data provider, imports are estimated to increase to 102.3 million tons from 84.4 million tons in 2024. \"LNG will play a crucial role in Europe's efforts to offset the loss of Russian gas supply via Ukraine, particularly during the restocking season, given that underground storage levels are expected to end this winter significantly lower than in the past two years,\" the analysts say. In January, imports to the bloc's 27 members rose to 8.35 million tons, up from 7.30 million tons the previous month due to colder temperatures and lower wind power generation. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007866:0/",
            "pub_date": "2025-02-05 23:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310170:0",
            "title": "Beyond Air Gets 180-Day Extension to Regain Nasdaq Compliance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Beyond Air  said Wednesday that it secured a 180-day extension, through Aug. 4, to regain compliance with Nasdaq's minimum bid price requirement for continued listing. </p><p class=\"\">The company was notified of its non-compliance with the listing rule in August 2024 and was initially given until Tuesday to cure the deficiency, according to the statement. Beyond Air subsequently requested for the extension. </p><p class=\"\">Beyond Air said the extension does not affect its Nasdaq listing and its shares continue to trade on the bourse. </p><p class=\"\">Beyond Air shares were up nearly 1% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310170:0/",
            "pub_date": "2025-02-05 23:55:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007828:0",
            "title": "Mondelez Is Maintained at Equal-Weight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007828:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007824:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1034 ET - As the U.S. and Mexico grapple over tariff threats, Mexico is continuing to purchase U.S. corn exports — with the USDA confirming sales of 330,000 metric tons of corn for delivery to Mexico during the 2025/26 marketing year. Corn and soybean futures on the CBOT are lower in early trading, with the last-minute nature of agreements to delay implementing tariffs keeping investors in markets on edge. \"[His] eleventh-hour decision to delay the 25% tariffs he had threatened to impose on Canada and Mexico is a good reminder of his unpredictable nature,\" says Paul Ashworth of Capital Economics in a note, adding that the firm expects the Trump administration to move forward on a 10% universal tariff, as well as higher tariffs on Chinese goods. (kirk.maltais@wsj.com)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">0942 ET - U.S. farmers may see a significant price hike for fertilizer if Trump tariffs are implemented, as the materials used for fertilizer are often imported into the U.S, says Farmdoc Daily in a note. Potassium-based fertilizers may take the brunt, as 90% of U.S. consumption of potassium comes from imports. Canada is the leading producer of potash globally, and a tariff could add over $100 per ton for U.S. farmers to the current price tag around $450 a ton, says Farmdoc. Nitrogen fertilizers would also be impacted, although imports account for far less consumption, according to data from the U.S. Geological Survey. Nitrogen fertilizers are the most important for U.S. corn, while U.S. soybeans are often grown using potassium-based products. (kirk.maltais@wsj.com)</p><p class=\"\">0921 ET - U.S. ag traders are taking the lack of retaliatory tariffs from China on U.S. grain exports as a sign that a window for negotiations is open--but the lack of urgency coming from President Trump about negotiating with Chinese President Xi has grain traders nervous. \"Uncertain trade policy between the world's largest soybean importer and the world's second largest soybean exporter are in full display,\" says AgResource in a note. CBOT soybean futures are down 0.6% premarket. (kirk.maltais@wsj.com)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0847 ET - Oil futures are losing ground after an industry report of a large build in U.S. crude stocks, while the prospect of a trade war fuels concerns about demand. \"All of this tariff talk and general confusion that it's generating is bearish demand as companies can't expand if they don't know what their costs are or what they can sell their goods for,\" Scott Shelton of TP ICAP says in a note. The API reported a 5 million barrel increase in U.S. stocks for last week, analysts note. EIA data inventory are due later this morning, with a Wall Street Journal survey predicting a 1.3 million barrel build. WTI is off 1% at $71.97 a barrel and Brent is down 1.1% at $75.38 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0844 ET - Treasury yields and the dollar weaken as Trump's Gaza takeover proposal squeezes the trade war out of today's headlines. ADP reports 183,000 jobs created by private employers in January, up from an upwardly revised 176,000 in December and higher than consensus of 150,000 in a Wall Street Journal survey. Meanwhile, U.S. trade deficit widens to $98.4 billion in December from November's revised $78.9 billion and versus a forecast of $96.8 billion in a WSJ survey. Yields and the WSJ Dollar Index moved up after the ADP data, before weakening again. The 10-year is at 4.458% and the two-year at 4.187%. The WSJ Dollar Index falls 0.3%.(paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0812 ET - European fixed income markets offer better value than bond markets in the U.S., given the high risk of inflation in the latter, Edmond de Rothschild Asset Management's Benjamin Melman says in a note. \"The global inflation no longer appears to be retreating, notably in the U.S., due to uncertainties surrounding the Trump administration's programme,\" the global chief investment officer says. In fixed income markets, there is more value to be found in Europe, on account of the much higher risks on inflation forecasts in the U.S., he says. Edmond de Rothschild Asset Management has a preference for 'carry' strategies in the current environment, as the yields on money market instruments are expected to fall this year, he says. (emese.bartha@wsj.com)</p><p class=\"\">0705 ET - Euro credit looks more attractive and has more value to offer investors than U.S. credit, Benjamin Melman, global chief investment officer at Edmond de Rothschild Asset Management, says in a note. The risk of inflation reaccelerating in the U.S. makes euro credit more attractive, Melman says. \"The new Trump administration has added an extra layer of uncertainty over the future path of inflation with its tariff and deportation policies,\" he says. (miriam.mukuru@wsj.com)</p><p class=\"\">0606 ET - Gold futures rise, holding ground after setting a fresh record earlier in the session. Futures are up 0.6% at $2,892.70 a troy ounce, having reached $2,901.50 an ounce earlier in the day. The precious metal is gaining on a weaker U.S. dollar and growing concerns of an escalating U.S.-China trade war, and the likely hit to global economic growth prospects, ActivTrades' Ricardo Evangelista says in a note. The weaker dollar follows President Trump's last minute U-turn on imposing additional tariffs on Mexico and Canada, and disappointing U.S. labor and industrial data, Evangelista writes. At the same time, U.S. tariffs on China--and Beijing's response--are ominous for the global economy, increasing gold's safe-haven appeal. Demand is reinforced by further Middle East uncertainty, after Trump's comments about taking over Gaza and displacing the Palestinian population, Evangelista adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0519 ET - Bitcoin rises slightly but trades below the key $100,000 level amid uncertainty over President Trump's tariff plans. China's plans for retaliatory tariffs after Trump imposed a new 10% levy on Chinese imports add uncertainty to risky assets including cryptocurrencies, Saxo Bank analysts say in a note. Market sentiment is also muted after the Trump administration discussed the potential inclusion of bitcoin in a newly proposed U.S. sovereign wealth fund, sparking speculation over institutional adoption, they say. \"Traders remain focused on regulatory developments and macroeconomic shifts.\" Bitcoin rises 1.1% to $97,523, according to LSEG. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007824:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007822:0",
            "title": "Bunge Shares Fall With Uncertainty Ahead in Ag Markets — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007822:0/",
            "pub_date": "2025-02-05 23:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007842:0",
            "title": "Banco Santander Up Over 8%, on Track for Highest Close Since May 2018 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander S.A. Sponsored ADR (SAN) is currently at $5.54, up $0.42 or 8.09%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since May 25, 2018, when it closed at $5.60</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Oct. 4, 2022, when it rose 9.09%</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 12.02% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Oct. 4, 2022, when it rose 13.79%</li><li class=\"listItem-bmN0_SHH\">Up 21.6% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 73.98% from its all-time closing high of $21.31 on May 15, 2008</li><li class=\"listItem-bmN0_SHH\">Up 39.67% from 52 weeks ago (Feb. 7, 2024), when it closed at $3.97</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 42.91% from its 52-week closing low of $3.88 on Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $5.58; highest intraday level since May 25, 2018, when it hit $5.60</li><li class=\"listItem-bmN0_SHH\">Up 8.77% at today's intraday high; largest intraday percent increase since Oct. 4, 2022, when it rose as much as 9.09%</li></ul><p class=\"\">All data as of 10:45:44 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007842:0/",
            "pub_date": "2025-02-05 23:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007840:0",
            "title": "ATS Rises as Global Operations Seen Offsetting U.S. Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adriano Marchese</p><p class=\"\">ATS shares rose Wednesday morning after company executives said its global footprint could help mitigate the effects of U.S.-imposed tariffs.</p><p class=\"\">Shares traded 7.3% higher at 40.96 Canadian dollars ($28.60).</p><p class=\"\">The Canadian automation and technology company said U.S. tariffs on Canadian imports will add complexity in the short-term to the U.S.-bound products built in Canada, which represented a mid-teens percentage of the its revenue for the last three fiscal quarters.</p><p class=\"\">President Trump has threatened to impose 25% blanket tariffs on Canadian imports into the U.S. but before they took effect Monday, the two countries agreed to pause them for 30 days.</p><p class=\"\">With operations in the U.S., Europe as well as in Canada, the company is more optimistic about the flexibility it can offer its customers to address disruptions over the longer term, executives said on the earnings call Wednesday.</p><p class=\"\">\"We do view this as an area of opportunity ... more mid-to-long term,\" Chief Executive Andrew Hider said in the earnings call.</p><p class=\"\">This could be a boon for the company, TD Cowen's Cherilyn Radbourne said in a report. ATS operates across the world, including operations in the U.S., Europe and Canada. ATS could adjust its capacity to build all U.S. orders in the U.S., while still doing the engineering in Ontario, she said.</p><p class=\"\">\"Assuming that tariffs prompt U.S reshoring, we would expect ATS to benefit, as automation would very likely be required to alleviate labor skill and cost issues,\" Radbourne added.</p><p class=\"\">In the third fiscal quarter ended Dec. 29, ATS' order bookings rose 32% to C$883 million, bringing the backlog up 8% higher than a year earlier to C$2.06 billion.</p><p class=\"\">ATS credits the rise to strong organic growth and contributions from its acquisitions.</p><p class=\"\">Revenue in the period fell to C$652 million from C$752 million. Analysts were expecting a decline to C$651.1 million. The decline was largely in its transportation business, which saw a 79% decline, on the back of softer demand in the EV market in North America.</p><p class=\"\">Net income fell to C$6.5 million, or C$0.07 a share, from C$47.2 million, or C$0.48 a share, in the comparable quarter a year ago.</p><p class=\"\">Write to Adriano Marchese at adriano.marchese@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007840:0/",
            "pub_date": "2025-02-05 23:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSG5g4ca:0",
            "title": "CSPi to Announce Fiscal 2025 First Quarter Results on February 10, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">LOWELL, MA / ACCESS Newswire / February 5, 2025 /</strong> CSPi , an award-winning provider of security and packet capture products, managed IT and professional services and technology solutions, announced that it will issue its fiscal 2025 first quarter financial results before the open of the market on Monday February 10, 2025.</p><p class=\"\">CSPi President and Chief Executive Officer Victor Dellovo and Chief Financial Officer Gary W. Levine will host a conference call at 10:00 a.m. ET that day to review the financial results and provide a business update. To listen to a live webcast of the call, the event link is https://www.webcaster4.com/Webcast/Page/2912/52010. Individuals also may listen to the call via telephone, by dialing 973-528-0011 or 888-506-0062 and use the Participant Access Code: 321679 when greeted by the live operator. A replay of the webcast will be available for approximately one year on the CSPi website.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CSPi</strong></p><p class=\"\">CSPi  operates two divisions, each with unique expertise in designing and implementing technology solutions to help their customers use technology to success. The High Performance Product division, including ARIA Cybersecurity Solutions, originated from supporting initiatives for the Department of Defense and Western intelligence agencies related to network monitoring, data protection, and intelligence initiatives. This focused mindset now results in foolproof data protection, enterprise wide. Our ARIA Software Defined Security solutions set provides enhanced network security, as well as accelerating incident response capabilities, while our Myricom nVoy Series appliances provide automated breach identification and notification, enabled by the 10G dropless packet capture inherent in our Myricom intelligent adapters. CSPi's Technology Solutions division helps clients achieve their business goals and accelerate time to market through innovative IT solutions and professional services by partnering with best-in-class technology providers. For organizations that want the benefits of an IT department without the cost, we offer a robust catalog of Managed IT Services providing 24×365 proactive support. Our team of engineers have expertise across major industries supporting five key technology areas: Advanced Security; Communication and Collaboration; Data Center; Networking; and Wireless &amp; Mobility.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACT:</strong></p><p class=\"\">CSP Inc.</p><p class=\"\">Gary Levine, 978-954-5040</p><p class=\"\">Chief Financial Officer</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> CSP Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSG5g4ca:0/",
            "pub_date": "2025-02-05 23:48:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1S3:0",
            "title": "UnitedHealth dips after Bill Ackman says he would short in now-deleted post on X",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of healthcare conglomerate UnitedHealth  fall 2.65% to $530.97</p><p class=\"\">** Billionaire investor Bill Ackman, in a now-deleted post on social media platform X, said he would take a short position if he \"still shorted stocks\", referring to UNH's health insurance unit, UnitedHealthcare</p><p class=\"\">** Ackman also said the company's profits are likely overstated due to its coverage decisions</p><p class=\"\">** Any claims that health insurers, which typically have low- to mid-single digit margins, can somehow over-earn are grossly uninformed about the structure and strong regulatory oversight of the sector, UNH says</p><p class=\"\">** The murder of UnitedHealthcare CEO Brian Thompson had sparked conversations outpouring anger from Americans frustrated over their dealings with health insurers related to medical care denials </p><p class=\"\">** Stock fell ~4% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1S3:0-unitedhealth-dips-after-bill-ackman-says-he-would-short-in-now-deleted-post-on-x/",
            "pub_date": "2025-02-05 23:48:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0WM:0",
            "title": "US crude, gasoline inventories rise, distillates draw down, EIA says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S. crude oil and gasoline inventories rose while distillate stockpiles fell last week, the Energy Information Administration (EIA) said on Wednesday.</p><p class=\"\">Crude inventories rose by 8.7 million barrels to 423.8 million barrels in the week ended Jan. 31, the EIA said, compared with analysts' expectations in a Reuters poll for a 2 million-barrel rise.</p><p class=\"\">Crude stocks at the Cushing, Oklahoma, delivery hub (USOICC=ECI) fell by 34,000 barrels in the week, the EIA said.</p><p class=\"\">Oil futures fell following the larger-than-expected build. Global benchmark Brent futures  were trading at $74.88 a barrel, down $1.21 by 10:38 a.m. EST (1538 GMT), while U.S. West Texas Intermediate (WTI) was $1.22 lower at $71.48 a barrel.</p><p class=\"\">Refinery crude runs (USOICR=ECI) rose by 160,000 barrels per day, while utilization rates (USOIRU=ECI) rose by 1% in the week to 84.5% of total capacity, the EIA said.</p><p class=\"\">Gasoline stocks (USOILG=ECI) rose by 2.2 million barrels in the week to 251.1 million barrels, the EIA said, compared with analysts' expectations for a 525,000-barrel build.</p><p class=\"\">U.S. gasoline futures  extended losses following the surprisingly large build. ​</p><p class=\"\">Distillate stockpiles (USOILD=ECI), which include diesel and heating oil, fell by 5.5 million barrels to 118.5 million barrels, versus expectations for a 1.5 million-barrel drop, the EIA data showed.</p><p class=\"\">Net U.S. crude imports (USOICI=ECI) fell last week by 178,000 barrels per day, the EIA said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0WM:0-us-crude-gasoline-inventories-rise-distillates-draw-down-eia-says/",
            "pub_date": "2025-02-05 23:48:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007846:0",
            "title": "FMC Corporation Cut to Underperform From Neutral by B of A Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:49 GMT) </strong>FMC Corporation Price Target Cut to $48.00/Share From $61.00 by B of A Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007846:0/",
            "pub_date": "2025-02-05 23:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1S1:0",
            "title": "Tesla and SpaceX are ideal trade war hostages",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">If President Trump makes good on tariff threats, smaller nations can amplify any retaliation: target his allies. The $1.2 trln carmaker and $350 bln satellite firm’s sky-high valuations benefit from Elon Musk’s political ties. They aren’t pricing in risks to hefty overseas sales.</p><p class=\"\">Full view will be published shortly.</p><p class=\"\">Follow @rob_cyran on X</p><p class=\"\">CONTEXT NEWS </p><p class=\"\">U.S. President Donald Trump suspended his threat of steep tariffs on Mexico and Canada on Feb. 3, agreeing to a 30-day pause. The U.S. imposed an additional 10% tariff on China on Feb. 4.</p><p class=\"\">Ontario Premier Doug Ford said the province would retaliate against the U.S. through various measures, including by eliminating a $68 million contract with Starlink, the satellite communications service run by SpaceX. Retaliatory measures were paused when the U.S. delayed implementing the tariffs on Canada.</p><p class=\"\">On Jan. 31, Canadian MP Chrystia Freeland said Canada should target Tesla with a 100% tariff on its vehicles in an interview with the Canadian Press. Elon Musk, a political ally of the White House, is CEO of both Tesla and SpaceX.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1S1:0-tesla-and-spacex-are-ideal-trade-war-hostages/",
            "pub_date": "2025-02-05 23:49:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310162:0",
            "title": "US Total Crude Oil Stocks Rise in Week Ended Jan. 31",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude oil stocks, including those in the Strategic Petroleum Reserve, rose by 8.9 million barrels in the week ended Jan. 31 following an increase of 3.7 million barrels in the previous week. </p><p class=\"\">Excluding inventories in the SPR, commercial crude oil stocks rose by 8.7 million barrels after a 3.5-million-barrel gain in the previous week, a larger gain than the 1.9-million-barrel increase expected in a survey compiled by Bloomberg as of 7:35 am ET. </p><p class=\"\">Stocks in the SPR increased by 300,000 barrels in the week after increasing by 200,000 barrels in each of the previous two weeks. </p><p class=\"\">Overall crude oil stocks were up 1.1% from the previous week but were still up 4.3% from a year earlier. Crude oil inventories are about 5% below the five-year average for this time of the year. </p><p class=\"\">Gasoline stocks increased by 2.2 million barrels, above the 210,000-barrel increase expected. Gasoline stocks were up 0.9% from the previous week but held steady compared with a year earlier. </p><p class=\"\">Distillate stocks fell by 5.5 million barrels in the current week, compared with an expected decrease of 2.1 million barrels. Distillate stocks were down 4.4% from the previous week and were 7.1% lower than in the same week a year ago. </p><p class=\"\">Refineries operated at 84.5% of their capacity, up from 83.5% in the previous week.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310162:0/",
            "pub_date": "2025-02-05 23:49:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006861:0",
            "title": "Correction to Disney Streaming Offerings Article — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Disney's entertainment streaming business, home to Disney+ and Hulu, reported a profit of $293 million for the December quarter, compared with a $138 million loss a year earlier. \"Disney to Centralize Streaming Offerings Within Disney+,\" at 8:28 a.m. ET and updated at 9:15 a.m. ET, incorrectly said those results were for Disney's streaming business and pertained to Disney+, Hulu and ESPN+.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006861:0/",
            "pub_date": "2025-02-05 23:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310168:0",
            "title": "Truist Securities Adjusts AZEK Price Target to $61 From $57, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AZEK Co  has an average rating of overweight and mean price target of $58.56, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310168:0/",
            "pub_date": "2025-02-05 23:50:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007781:0",
            "title": "Archer Daniels Midland Is Maintained at Market Perform by BMO Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:41 GMT) </strong>Archer Daniels Midland Price Target Cut to $49.00/Share From $51.00 by BMO Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007781:0/",
            "pub_date": "2025-02-05 23:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX1pv8Yx:0",
            "title": "JORDON SMITH AND TRIUMPH FACTORY RACING MAKE HISTORY WITH SUPERCROSS WIN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atlanta, Georgia, Feb.  05, 2025  (GLOBE NEWSWIRE) — The fourth round of the 2025 AMA Supercross Championship will live on as a historic moment in sport: Triumph Factory Racing won its first AMA Supercross race via a superb effort from Jordon Smith on the TF 250-X. The manufacturer, competing in just its 13th supercross event, has climbed to the pinnacle of off-road, less than one year after its competitive debut.</p><p class=\"\">Glendale, Arizona, hosted the fourth round and the first Triple Crown of the 2025 season. Smith started the three-race format with 2-3 scores and was positioned to capitalize when the final stint launched into life. Starting second, thanks to the competitive power of his TF 250-X, he quickly moved into the lead and controlled the race to win.</p><p class=\"\">It was a terrific ride and one that underlined the leap forward that Triumph Factory Racing has made in its sophomore Monster Energy AMA Supercross Championship season. Now a supercross winner in Triumph colors, Smith's moved to second in the 250SX West championship standings. Just two points separate him from the championship leading red plate.</p><p class=\"\">With a break in the 250SX West calendar, Austin Forkner is set to make his Triumph Factory Racing debut and launch his own title bid as 250SX East kicks off next weekend at the Raymond James Stadium in Tampa, Florida, on February 8. Austin Forkner will make his Triumph Factory Racing debut at the Raymond James Stadium and strive to launch his own title bid.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jordon Smith</strong> said: \"This is unbelievable, man. Huge thanks to the whole team – everyone – as we made great decisions all day. Everything was just perfect. It was a flawless day. It feels incredible to get the first win for Triumph and we are only just getting started. The only way is up from here.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jeremy Coker</strong> – General Manager, Triumph Racing America added: \"What an amazing night! To be a part of this history is something special. To get the first win in the way that we did – and as fast as we did – is amazing. People do not understand that we have not even raced this bike for a whole year, nor have we scratched the surface. There will be many more of these in the future. I want to thank Triumph for putting their trust in me and assembling such a fantastic team.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Ian Kimber</strong> – Head of Global Racing Programs commented: “What an incredible night! Jordon and the team have made history in the sport for Triumph! We’ve accomplished a lot in the short time we’ve been competing with the TF 250-X in SuperMotocross – from building a world-class facility, putting together a race team, to developing bikes in a new segment for our company that can compete with the best at the highest level of Supercross competition.</p><p class=\"\">“Tonight saw everything that we have been working towards come together, and I know that everyone in the factory is going to be immensely proud of this achievement. We’d like to say a huge thank you to our partners and everyone that’s been involved with this project; let’s enjoy this moment to celebrate this huge success.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nick Bloor</strong> – CEO, Triumph Motorcycles concluded: “What a great moment for Triumph! Jordon standing on the top step is testament to the dedication of all our staff who work on our off-road projects. The team has worked incredibly hard to get to this point, and this victory is the result of all of their efforts. Congratulations to the whole Triumph team!” </p><p class=\"\">250SX West Results: 2025 AMA Supercross, Round Four – Glendale</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">1. Jordon Smith (Triumph) 2-3-1</strong></p><p class=\"\">2. Haiden Deegan (Yamaha) 3-2-4</p><p class=\"\">3. Cole Davies (Yamaha) 1-1-8</p><p class=\"\">4. Julien Beaumer (KTM) 4-7-2</p><p class=\"\">5. Michael Mosiman (Yamaha) 6-4-3</p><p class=\"\">250SX West Standings: 2025 AMA Supercross, Round Four – Glendale</p><p class=\"\">1. Julien Beaumer (KTM) 87pts</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2. Jordon Smith (Triumph) 85pts</strong></p><p class=\"\">3. Haiden Deegan (Yamaha) 84pts</p><p class=\"\">4. Cole Davies (Yamaha) 72pts</p><p class=\"\">5. Jo Shimoda (Honda) 68pts</p><p class=\"\">TF 250-X In Dealerships</p><p class=\"\">The TF 250-X, with its class-leading power-to-weight ratio, and all the spec you need to win, is now available in Triumph’s network of Motocross and Enduro dealerships from $9,495 USD / $11,795 CAD </p><p class=\"\">Developed entirely by Triumph in close collaboration with racing champions including Ricky Carmichael and Iván Cervantes, the four-stroke competition model is an all-new ground-up design. </p><p class=\"\">With a focused, aggressive style, the TF 250-X is slim, yet bold and is instantly recognizable on the track, with its minimal and lightweight presence and distinctive Triumph Racing Yellow and black graphics scheme. The performance racing powertrain and unique aluminum chassis are ultra compact and super light, with all the best components on the market, already fitted out of the crate. </p><p class=\"\">The TF 250-X is backed up with a unique 24/7 parts and accessories supply system available from the Triumph website, where riders can search for parts and place orders while out at the track. Riders can select what they need, check availability and price, and place an order for express delivery, standard delivery, or click and collect from their local Triumph motocross dealer.  </p><p class=\"\">- END - </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Notes to EditorsABOUT TRIUMPH</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">First established in 1902, Triumph Motorcycles celebrated 120 years of motorcycle manufacture in 2022. For more than three decades, Triumph Motorcycles has been based in Hinckley, Leicestershire, and has produced iconic bikes that perfectly blend authentic design, character, charisma, and performance.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">A GLOBAL BRITISH SUCCESS STORY</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Record global sales of 104,899 motorcycles were delivered in 2024, through a network of 839 dealers in 68 countries, confirming Triumph Motorcycles’ position as the largest British motorcycle manufacturer. </li><li class=\"listItem-bmN0_SHH\">Triumph currently employs around 3,000 personnel worldwide and has subsidiary operations in the UK, North America, France, Germany, Spain, Italy, Japan, Sweden (Scandinavia), Benelux, Brazil, China, and Thailand as well as a network of independent distributors. Triumph has manufacturing facilities in Hinckley, Leicestershire, and Thailand plus CKD facilities in Brazil and India.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">A WORLD-CLASS RANGE</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">With a laser-sharp focus on what riders across the world are looking for, a passion to deliver the perfect ride for every customer, and attention to detail that delivers the highest quality motorcycles, Triumph offers a growing range of category-leading motorcycles spanning Modern Classics, Roadsters and Adventure bikes. From the accessible Speed 400cc TR series to the Rocket 3 with its powerful 2500cc engine, every model exemplifies Triumph’s iconic style, quality and performance.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Delivering a fun, agile and confidence-inspiring ride for riders of all ages and experience levels, the Speed 400 and Scrambler 400 X launched in 2023 with a brand-new single engine platform (TR Series), representing incredible value for money and bringing Triumph to a whole new generation of riders.</li><li class=\"listItem-bmN0_SHH\">The Modern Classics feature Triumph’s legendary Bonneville twin engine. Famously named to celebrate Triumph’s 1956 land speed record on the Bonneville Salt Flats in Utah, USA, the Bonneville was the original British superbike and a race-winner straight out of the crate, chosen by famous motorcyclists of the past for its handling, style, and character. Now, the Bonneville family has evolved, with rider-focused technology and cool custom style. The range includes the Bonneville Bobber, Speedmaster, Thruxton RS, Speed Twin 900, Speed Twin 1200, Scrambler 900, Scrambler 1200 and the iconic Bonneville T120 and T100.</li><li class=\"listItem-bmN0_SHH\">The Roadsters start with the agile and popular Trident 660 and sporty Daytona 660 then the Street Triple 765, and finally the Speed Triple 1200 RS. For adventure riders, Triumph has a complete line-up of epic Tigers, starting with the Tiger Sport 660 and Tiger Sport 800, moving up to the Tiger 900 range, and finally to the Tiger 1200 range.</li><li class=\"listItem-bmN0_SHH\">In 2023 Triumph officially claimed the GUINNESS WORLD RECORDS™ title for ‘The greatest distance travelled on a motorcycle in 24 hours (individual)’. Riding a factory-specification Tiger 1200 GT Explorer on the High-Speed Ring at the Nardò Technical Center in Italy, 5x Enduro World Champion and Triumph Global Ambassador Iván Cervantes travelled more than 4012km in a 24-hour period, beating the previous record of 3406km by a huge margin of more than 600km.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">TRIUMPH RACING</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Triumph has a glorious racing history, competing in and winning races in almost every class and field of motorcycle sporting achievement. </li><li class=\"listItem-bmN0_SHH\">From winning the second ever Isle of Man TT in 1908, through to 1960s road and track success in Europe and America, right up to contemporary racing achievements with the Triumph triple powered 2014 and 2015 SuperSport titles and World SuperSport racing, Isle of Man SuperSport TT wins in 2014 and 2019, courtesy of Gary Johnson and Peter Hickman, plus an average speed of over 130mph 2023 by Peter Hickman on his Triumph STR765, and a thrilling last-lap victory at the legendary Daytona 200 by Brandon Paasch on the Street Triple 765 in 2022. </li><li class=\"listItem-bmN0_SHH\">Triumph’s racing legend continues as the exclusive engine supplier to the FIM Moto2™ World Championship since the start of the 2019 season. Triumph Motorcycles provides all the teams with race-tuned 765cc triples, each of which is based on the class-leading Street Triple RS powerplant. Redefining the class, Triumph broke record after record in the inaugural year, including the first ever +300km/h Moto2™ top speed. Reflecting these great successes, the wonderful feedback, and partnerships that Triumph have had with the riders and their teams, and the incredible response from Triumph fans across the world, Triumph and Dorna, decided to extend the relationship in 2021 and again in 2023, signing a new contract for another five years of racing: 2025 – 2029. </li><li class=\"listItem-bmN0_SHH\">Triumph is working with PTR Triumph Factory Racing to participate in the 2025 World Supersport Championship. Tom Booth-Amos will be joined by Oli Bayliss, racing on the Street Triple 765. Macadam Triumph Factory Racing continues with British Supersport riders Luke Stapleford (2024 vice-champion) and Max Wadsworth. In the National Sportbike Championship, the team has a four-rider lineup on the Daytona 660; Brodie Gawith, Jayden Martin, Katie Hand and Lewis Smart.</li><li class=\"listItem-bmN0_SHH\">In 2023, Triumph announced its intention to compete in the 2024 MXGP/MX2 and SuperMotocross World Championships, and after a successful first season, now lines up for SuperMotocross in 2025 with a four-rider team. Jalek Swoll, Austin Forkner, Jordon Smith, Stilez Robertson will race for the British manufacturer, who will compete on both coasts of Supercross and the full Pro Motocross series with the TF 250-X. In the FIM MX2 World Championship Camden McLellan will compete for a second year aboard Triumph machinery, while Guillem Farres joins the team. Mikkel Haarup remains as a test rider (due to age restrictions in the MX2 category).</li><li class=\"listItem-bmN0_SHH\">In September 2024 Triumph revealed Motorsport legend and former world champion Paul Edmondson has officially been appointed Team Manager of Triumph Racing’s enduro program, which will see the brand represented at the highest levels of enduro competition worldwide. In December 2024 Jonny Walker took Triumph’s first FIM SuperEnduro World Championship podium in Gliwice, Poland with third place, a feat he repeated at the second round in Riesa, Germany in January.</li></ul><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jordon Smith on 1st Place Podium on a Triumph TF 250-X at Supermotocross Round 4      </li><li class=\"listItem-bmN0_SHH\">Jordon Smith crossing the finish line on Triumph TF 250-X and captures the checkered flag      </li></ul><p class=\"\">Eric Van De Steeg</p><p class=\"\">Triumph Motorcycles</p><p class=\"\">720.217.7488</p><p class=\"\">eric.vandesteeg@triumphmotorcycles.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX1pv8Yx:0-jordon-smith-and-triumph-factory-racing-make-history-with-supercross-win/",
            "pub_date": "2025-02-05 23:41:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007787:0",
            "title": "Atkore Is Maintained at Overweight by Keybanc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:42 GMT) </strong>Atkore Price Target Cut to $80.00/Share From $105.00 by Keybanc</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007787:0/",
            "pub_date": "2025-02-05 23:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007793:0",
            "title": "WEC Energy Group Is Maintained at Market Perform by BMO Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:43 GMT) </strong>WEC Energy Group Price Target Raised to $100.00/Share From $95.00 by BMO Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007793:0/",
            "pub_date": "2025-02-05 23:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}