{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8fgWND:0",
            "title": "ThinkMarkets wins ‘Newcomer of the Year 2024’ at TradingView awards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900px;aspect-ratio:1.5\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX8fgWND-a131d6fc8dc1e2e913a2200fed4e80e7-resized.webp\" type=\"images/webp\"/><img alt=\"ThinkMarkets\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX8fgWND-a131d6fc8dc1e2e913a2200fed4e80e7-resized.jpeg\" style=\"background-color:#20395e\"/></picture></div></figure></span></p><p class=\"\">LONDON, Feb.  04, 2025  (GLOBE NEWSWIRE) — ThinkMarkets, a leading online trading provider, recently announced that it received an award from TradingView for ‘Newcomer of the Year 2024’. </p><p class=\"\">The annual TradingView awards aim to recognize integrated brokers on its platform that are at the forefront of global online trading and have consistently demonstrated providing their users with the best service over the last 12 months. </p><p class=\"\">TradingView selects the winner for its nominated categories based on a broker’s verified client reviews, feedback, and ratings, as well as client engagement, platform uptime, and more. This ensures all awards are authentic and that only the best brokers receive recognition. </p><p class=\"\">Commenting on the news, co-CEO, Nauman Anees, said the following: </p><p class=\"\">“We’re delighted to win this prestigious TradingView award. Despite launching on the platform only midway through the year in July 2024 and having to compete alongside other brokers that also joined that year, we’re thrilled to have made such an impact. We’ve received an overwhelmingly positive response from both new and existing clients eager to take advantage of this offering. We’re grateful that TradingView and the wider trading community have recognized our efforts with this award, and we’ll continue to expand and improve our offering to ensure we remain a leading choice among traders on TradingView.” </p><p class=\"\">ThinkMarkets also took the opportunity to express a big thank you for the continued support from its clients, partners, and employees who have all helped in their efforts to achieve this prestigious award. </p><p class=\"\">For more information and the latest updates, users can visit: www.thinkmarkets.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ThinkMarkets</strong></p><p class=\"\">ThinkMarkets is a global, multi-regulated online brokerage established in 2010 offering clients quick and easy access to 4,000+ CFD instruments across FX, indices, commodities, equities, and more. ThinkMarkets has offices in London, Dubai, Melbourne, and Tokyo and hubs in the Asia-Pacific, Europe, and South Africa. It also operates with several financial licenses around the globe and delivers some of the industry's most recognized trading platforms, including its award-winning platform, ThinkTrader.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">pr@thinkmarkets.com</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a0daee5a-f695-4bad-8f7e-faf0c960bd58</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">ThinkMarkets </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8fgWND:0-thinkmarkets-wins-newcomer-of-the-year-2024-at-tradingview-awards/",
            "pub_date": "2025-02-04 22:42:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC11Qzwl:0",
            "title": "Stonegate Capital Partners Updates Coverage on Alliance Resource Partners, L.P. (ARLP) 2024 Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dallas Texas--(Newsfile Corp. - February 4, 2025) -  Alliance Resource Partners, L.P. : Stonegate Capital Partners updates coverage on Alliance Resource Partners, L.P. ARLP reported a challenging 4Q24, impacted by lower coal sales pricing and higher operating expenses. Total revenues for the quarter decreased by 5.6% year-over-year to $590.1M, primarily due to a 2.3% decline in coal sales volumes. Net income for the quarter was down to $16.3M compared to $115.4M in 4Q23, reflecting higher operating costs and non-cash impairment charges of $31.1M related to the MC Mining operation. Adj. EBITDA came in at $124.0M, a 27.2% decline sequentially. Despite these headwinds, ARLP remains committed to its FY25 guidance, expecting improvements driven by efficiency realizations in its operations, a strengthening order book, and declining domestic inventories.</p><p class=\"\">To view the full announcement, including downloadable images, bios, and more, click here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Takeaways:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">ARLP continued to expand its O&amp;G royalties' business, completing $9.6M in mineral interest acquisitions during the quarter.</li><li class=\"listItem-bmN0_SHH\">ARLP reached its coal inventory goal for FY24, reaching 0.6 million tons.</li><li class=\"listItem-bmN0_SHH\">The Company ended 4Q24 with a solid liquidity position of $593.9M, consisting of $137.0M in cash and $456.9M in available credit.</li></ul><p class=\"\"><em>Click image above to view full announcement.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Stonegate</strong></p><p class=\"\">Stonegate Capital Partners is a leading capital markets advisory firm providing investor relations, equity research, and institutional investor outreach services for public companies. Our affiliate, Stonegate Capital Markets (member FINRA) provides a full spectrum of investment banking, equity research and capital raising for public and private companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contacts:</strong></p><p class=\"\">Stonegate Capital Partners</p><p class=\"\">(214) 987-4121</p><p class=\"\">info@stonegateinc.com</p><p class=\"\">Source: Stonegate, Inc.</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239566</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC11Qzwl:0-stonegate-capital-partners-updates-coverage-on-alliance-resource-partners-l-p-arlp-2024-q4/",
            "pub_date": "2025-02-04 22:42:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007411:0",
            "title": "Pfizer Shares Rise on Better-Than-Expected 4Q",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jared S. Hopkins</p><p class=\"\">Pfizer shares climbed Tuesday after the pharmaceutical company beat fourth-quarter estimates and reaffirmed its full-year guidance.</p><p class=\"\">The positive quarter caps a busy year of cost cutting and pressure from an activist investor as Pfizer has sought to turn around company performance. Shares rose 1.2% to $26.51 soon after market open.</p><p class=\"\">Sales for the fourth quarter rose to $17.76 billion, compared with $17.35 billion from analysts polled by FactSet. Pfizer reported $14.57 billion in sales a year ago.</p><p class=\"\">The New York-based pharma giant saw strong sales from drugs used to treat a range of diseases, including heart drug Vyndaquel, up 61% to $1.55 billion, and from oncology drugs, which saw sales grow 27% to more than $4 billion. New cancer drugs from the $43 billion acquisition of Seagen also aided sales.</p><p class=\"\">Pfizer reaffirmed its 2025 guidance of revenue between $61 billion and $64 billion, and of adjusted per-share earnings of between $2.80 and $3.</p><p class=\"\">Excluding certain items, earnings totaled 63 cents a share, compared with 47 cents a share forecast by analysts.</p><p class=\"\">Investors have been cool to Pfizer, with shares down some 50% since record highs in 2021. Pfizer Chief Executive Albert Bourla has been looking to turn around the company's performance, taking steps such as a multi-billion-dollar cost-cutting program.</p><p class=\"\">A closely watched weight-loss drug is expected to finish testing in the coming weeks, and Bourla has said the company is committed to being in the white-hot obesity market.</p><p class=\"\">Write to Jared S. Hopkins at jared.hopkins@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007411:0/",
            "pub_date": "2025-02-04 22:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1HQ:0",
            "title": "Grain trader ADM falls on Q4 profit miss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Grain trader ADM's shares  fall 3.4% to $48.37 in early morning trade</p><p class=\"\">** Company reported Q4 adj. EPS of $1.14/share vs est of $1.15/share - data compiled by LSEG</p><p class=\"\">** ADM raises dividend by 1 cent per share; says targeting cutting between $500 mln and $750 mln in spending over the next 3 to 5 years</p><p class=\"\">** Company says it is looking to lay off 600-700 people in 2025; it had 41,802 employees, according to its 2023 annual report</p><p class=\"\">** Expects adj. EPS for 2025 in the range of $4/share to $4.75/share, midpoint of which is below analysts' expectations of $4.67/share - LSEG </p><p class=\"\">** ADM down ~9.5% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1HQ:0-grain-trader-adm-falls-on-q4-profit-miss/",
            "pub_date": "2025-02-04 22:43:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Merck, PayPal, Super Micro, Spotify, Estee Lauder, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stock futures traded mostly higher Tuesday as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were poised to make moves Tuesday:</p><p class=\"\">Palantir Technologies soared 23% after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla  was up 0.9% after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in the U.S. but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were slipping 0.1%. Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 4.6%. The maker of AI servers said it would be providing a fiscal second-quarter \" business update\" on Feb. 11. The Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">PepsiCo posted fourth-quarter adjusted earnings of $1.96 a share, beating analysts' estimates of $1.94 but the stock fell 1.8% after revenue declined 0.2% from a year earlier to $27.78 billion and missed expectations of $27.89 billion. Shares fell 2.4%.</p><p class=\"\">Shares of Spotify Technology jumped 8.8% after the audio-streaming company added more premium subscribers in the fourth quarter than Wall Street expected, helping revenue top estimates.</p><p class=\"\">Merck fell 8.4% after the drug maker reported fourth-quarter adjusted earnings that beat analysts' estimates but issued guidance for f2025 that missed expectations. Merck said it expects 2025 adjusted earnings of $8.88 to $9.03 a share, below consensus of $9.21.</p><p class=\"\">Pfizer was up 0.8% after fourth-quarter adjusted earnings of 63 cents a share topped analysts' forecasts of 46 cents and the company reaffirmed guidance for 2025.</p><p class=\"\">PayPal was down 8.1%. The fintech beat fourth-quarter earnings and sales estimates, and said total payment volume rose 7% in the quarter, while payment transactions decreased 3%.</p><p class=\"\">Estée Lauder, the luxury beauty brand, declined 5.2% after it issued weak earnings guidance, said it expects to cut between 5,800 and 7,000 positions as part of a two-year restructuring plan, and would record more than $1 billion in pretax charges on employee-related costs.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 3.1%.</p><p class=\"\">Earnings reports are expected after the closing bell Tuesday from Alphabet, Advanced Micro Devices, Chipotle Mexican Grill, and Amgen.</p><p class=\"\">Alphabet rose 0.9% ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-04 22:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308940:0",
            "title": "Bending Spoons Finalizes Acquisition of Brightcove",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brightcove's  acquisition by Bending Spoons for $4.45 a share, or about $233 million in an all-cash deal, has been completed, Bending Spoons said Tuesday. </p><p class=\"\">The definitive agreement was signed in November, Bending Spoons said. </p><p class=\"\">Brightcove is now a privately-held company, and its shares will no longer be listed on any public stock exchange, the Italy-based technology company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308940:0/",
            "pub_date": "2025-02-04 22:44:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308944:0",
            "title": "UBS Adjusts Price Target on CyberArk Software to $440 From $400, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CyberArk Software  has an average rating of buy and mean price target of $384.25, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308944:0/",
            "pub_date": "2025-02-04 22:44:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1HY:0",
            "title": "Marathon Petroleum rises on Q4 profit beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of top U.S. refiner Marathon Petroleum  rise 2.6% to $150.81 in early morning trading</p><p class=\"\">** Marathon reports adjusted Q4 EPS of 77 cents versus analysts' average estimate of 2 cents - data compiled by LSEG </p><p class=\"\">** Midstream segment posted adjusted core profit of $1.71 bln versus $1.57 bln a year earlier</p><p class=\"\">** However, refining and marketing margin fell to $12.93/bbl from $17.81/bbl in Q4 2023</p><p class=\"\">** MPC up ~8.1% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1HY:0-marathon-petroleum-rises-on-q4-profit-beat/",
            "pub_date": "2025-02-04 22:44:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX54Gqsb:0",
            "title": "INFI Raises $12 Million to Revolutionize Self-Service Technology",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHICAGO, Feb.  04, 2025  (GLOBE NEWSWIRE) — INFI USA, a pioneering AI-driven self-service software platform, today announced $12 million in Series A funding to accelerate technological innovation, expand its team, and broaden market reach. The round was led by MK Capital.</p><p class=\"\">\"Our Series A funding marks a pivotal moment for INFI USA,\" said Lucas Liu, CEO of INFI USA. \"This investment will propel our mission to transform traditional business interactions through cutting-edge self-service technology that empowers businesses and delights consumers.\"</p><p class=\"\">INFI USA's innovative platform leverages AI to create seamless, intuitive self-service experiences across kiosks, tablets, and smartphones. By automating operations and enhancing consumer interactions, the company is redefining service models for retail businesses of all sizes—from local cafes to national restaurant chains.</p><p class=\"\">The past year has been transformative for INFI USA, with revenue growing and partnerships expanding to include prominent brands such as:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cilantro Taco Grill</li><li class=\"listItem-bmN0_SHH\">PJ's Coffee</li><li class=\"listItem-bmN0_SHH\">Qargo Coffee</li><li class=\"listItem-bmN0_SHH\">Randy's Donuts</li><li class=\"listItem-bmN0_SHH\">Wafels and Dinges</li></ul><p class=\"\">These partnerships now span all 50 states, demonstrating the platform's versatility and appeal across diverse markets.</p><p class=\"\">With this new funding, INFI USA plans to deepen integrations with industry-leading technology partners, including Stripe, Revel, NCR, Lightspeed, Square, Toast and Oracle.</p><p class=\"\">\"This investment enables us to help INFI push the boundaries of what’s possible in self-service technology,” said Mark Koulogeorge, Managing Partner at MK Capital. “With our deep expertise in scaling software companies, we are committed to providing strategic guidance and operational support to help INFI anticipate and meet the evolving needs of modern businesses.”</p><p class=\"\">The funds will be primarily allocated to - accelerating research and development, recruiting top-tier talent, expanding market presence, and enhancing technological capabilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About INFI USA</strong> INFI USA is a tech company specializing in self-service solutions that transform consumer interactions and business operations. By combining cutting-edge artificial intelligence with user-centric design, INFI USA helps businesses create more efficient, engaging, and personalized service experiences.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About MK Capital</strong> MK Capital is an early and growth-stage venture capital firm with more than $500 million in assets under management. MK invests in disruptive business-to-business software and technology companies. The MK partners average over twenty years of venture capital experience and have built dozens of leading companies in their chosen markets. As a member of the MK Capital portfolio, companies gain access to experienced partners with deep operating experience, not just a line of capital. MK collaborates on strategy, operations, and technology as active board members, leveraging deep insights to drive growth and scale.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Media Contact:</li><li class=\"listItem-bmN0_SHH\">Tony DawsonCRO415-846-9253tony_d@infi.us</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX54Gqsb:0-infi-raises-12-million-to-revolutionize-self-service-technology/",
            "pub_date": "2025-02-04 22:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFNbgZgv5:0",
            "title": "Ghent University publishes ASTar study results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Q-linea AB (publ) (OMX:QLINEA) today announces that results from a Belgian study have been published in the European Journal of Clinical Microbiology &amp; Infectious Diseases.</p><p class=\"\">A group from Ghent University conducting an interventional study recently published two articles showing clinical benefits of ASTar System for patients with bacteremia caused by Gram-negative bacteria. The performance was good and ASTar results were available 17 hours faster than the standard workflow. In 17.6% of patients, the clinicians changed the initial antibiotic therapy within one hour of the ASTar results being available, due to resistance to the initial therapy. ASTar also showed an opportunity for adapting the therapy in 63% of patients and in half of these the therapy was adapted within three hours.</p><p class=\"\">The second article shows how early detection of bacteria with specific resistance profiles can be facilitated by rapid MIC results from ASTar. Results from the ASTar System were available approximately six hours from positive blood culture from an immunocompromised patient and used in support of changed antimicrobial therapy 16 hours earlier than standard workflow.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFNbgZgv5:0-ghent-university-publishes-astar-study-results/",
            "pub_date": "2025-02-04 22:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV11O:0",
            "title": "Hindustan Oil Exploration Company Dec-Quarter Consol Profit 433.2 Million Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hindustan Oil Exploration Company Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL PROFIT 433.2 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 1.56 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV11O:0-hindustan-oil-exploration-company-dec-quarter-consol-profit-433-2-million-rupees/",
            "pub_date": "2025-02-04 22:45:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308938:0",
            "title": "SES AI Regains Compliance With New York Stock Exchange Requirement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SES AI  said Tuesday it has regained compliance with the New York Stock Exchange's minimum bid price requirement for continued listing, citing a letter from the exchange. </p><p class=\"\">Shares of the company were up more than 18% in recent Tuesday trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308938:0/",
            "pub_date": "2025-02-04 22:45:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1H6:0",
            "title": "Hubbell falls on quarterly sales miss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of electrical equipment maker Hubbell  down 1.3% at $403.27 premarket</p><p class=\"\">** Co reports Q4 net sales of $1.33 bln, below analysts' average estimate of $1.41 bln, according to data compiled by LSEG</p><p class=\"\">** Expects FY total sales growth and organic sales growth of 4%-5% vs analysts' average estimate of 6.57% </p><p class=\"\">** Also expects 2025 adj. profit from continuing operations in the range of $17.35 to $17.85 </p><p class=\"\">** \"While organic growth was below our expectations in quarter, continued operational execution resulted in significant margin expansion and we delivered earnings per share ahead of our prior outlook range,\" says CEO Gerben Bakker</p><p class=\"\">** Shares rose ~27.4% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1H6:0-hubbell-falls-on-quarterly-sales-miss/",
            "pub_date": "2025-02-04 22:45:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204006323:0",
            "title": "As Trump's tariffs grip markets, a key indicator flashes a warning for bullish investors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">Bank of America says Wall Street strategists are too bullish.</p><p class=\"\">The news pipeline has had this stock market and investors thrashing about lately. And that looks set to continue, with China now jumping into the tariff fray, and equities looking weaker for Tuesday.</p><p class=\"\">That's as we're still in the belly of earnings season, with results from a big Nvidia competitor looming after the close.</p><p class=\"\">Stepping away from the headlines that make the market these days, our call of the day from Bank of America flags a contrarian stock market indicator that they say is just a whisker away from a \"sell signal.\"</p><p class=\"\">BofA's sell side indicator, tracks average recommended equity allocations by Wall Street strategists. In January, that indicator climbed to 57%, the highest since early 2022 and a mere 1 percentage point shy from a sell signal, Savita Subramanian, equity and quant strategist, and her colleague Victoria Roloff, told clients in a note.</p><p class=\"\">In other words, when so many strategists are saying buy stocks, the best plan of action may be to not follow the herd. When the indicator has been at the 57% level or higher, returns for the next 12 months were positive  65% of the time versus 82% overall, BofA said.</p><p class=\"\">So the bank's voicing caution in a crowded market, as they put it.</p><p class=\"\">\"The [sell-side indicator] has been a reliable contrarian indicator. In other words, it has been bullish when Wall Street was extremely bearish and vice versa,\" and now sits at the closest to a sell signal since December 2021, said Subramanian and Roloff.</p><p class=\"\">Last month, those strategists left their equity allocations unchanged after a 2.8% gain for the S&amp;P 500 SPX in December, which suggests a wait-and-see approach on trade tensions and any policy risks, said the BofA team.</p><p class=\"\">\"The current level of 57% implies an estimated price return of 10.5% over the [next twelve months], lower than the past two years but still healthy. We see this as support for our view that 2025 is a year for buying stocks, not the index,\" they said.</p><p class=\"\">Societe Generale has predicted 2025 will be the best stock picking period in 25 years, citing reflationary policies from President Trump's administration, such as lower taxes, less regulation and lower oil prices, which they say can all yield potential stock picking ideas.</p><p class=\"\">Plus: Stock market's wild ride on Monday could be a microcosm of what to expect in 2025</p><p class=\"\">The markets</p><p class=\"\">U.S. stock-index futures (ES00) (NQ00) are turning higher, though Dow industrials futures are lagging. Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y are rising, and the ICE Dollar Index dollar DXY is down 0.4%. Oil prices (CL.1) are also dropping.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              5994.57    -0.29%  0.32%   1.92%  21.28% <br/>   Nasdaq Composite                                                     19,391.96  0.26%   -2.38%  0.42%  24.33% <br/>   10-year Treasury                                                     4.574      3.00    -13.20  -0.20  45.10 <br/>   Gold                                                                 2843.2     3.65%   7.42%   7.73%  39.27% <br/>   Oil                                                                  72.04      -1.45%  -1.89%  0.24%  -1.04% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">China slapped retaliatory tariffs on the U.S. for coal, liquefied natural gas, crude, agricultural machinery and large-engine cars, and will probe Alphabet's Google (GOOGL) over alleged antitrust violations, a day after Trump said he would delay Mexico and Canada tariffs for a month.</p><p class=\"\">In the earnings spotlight, Google's parent Alphabet (GOOGL) will report after the close, alongside Nvidia competitor AMD (AMD) and Chipotle (CMG).</p><p class=\"\">Regeneron (REGN) stock is up 5% after the biotech launched a divided program and boosted buybacks. Merck (MRK) is tumbling after disappointing guidance overshadowed an earnings beat. PepsiCo (PEP) logged a third-straight quarterly miss on revenue and shares are falling. Spotify (SPOT) swung to a profit and shares are popping.</p><p class=\"\">Job openings and factory orders are both coming at 10 a.m. We'll hear from Fed officials throughout the day - Atlanta Fed Pres. Raphael Bostic, San Francisco Fed Pres. Mary Daly and Fed Reserve Vice Chairman Philip Jefferson.</p><p class=\"\">Best of the web</p><p class=\"\">Tesla sales are getting crushed in its biggest U.S. market</p><p class=\"\">Elon Musk may have just staged a '21st-century coup' at the Treasury Department. What could happen next.</p><p class=\"\">The $22 billion vape industry is about to get even messier</p><p class=\"\">The chart</p><p class=\"\">The above chart shows the explosive growth of retail participation in options market over the past few years, which surged during the pandemic, according to derivatives and exchange network CBOE. That market clearly just keeps getting bigger. The CBOE (CBOE), which has also been pushing for more real-time trading data, said a record 12.2 billion options contracts traded in the U.S. in 2024, up 10.6% from 2023's total, a fifth-straight record year.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6 a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   PLTR    Palantir Technologies <br/>   TSLA    Tesla <br/>   GME     GameStop <br/>   AAPL    Apple <br/>   HOLO    MicroCloud Hologram <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMD     Advanced Micro Devices <br/>   SMCI    Super Micro Computer <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Eggspensive scramble on the freeway.</p><p class=\"\">British pub gives away nearly 300 pints of own-goal beer.</p><p class=\"\">On the road with the meteorite hunters.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204006323:0/",
            "pub_date": "2025-02-04 22:37:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1HE:0",
            "title": "TSX opens higher as industrials shares gain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canada's main stock index opened higher on Tuesday, helped by gains in industrials stocks, though investors remained cautious due to an escalating trade war between the U.S. and China.</p><p class=\"\">At 9:31 a.m. ET (1431 GMT), the Toronto Stock Exchange's S&amp;P/TSX composite index  was up 0.2% at 25291.43.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1HE:0-tsx-opens-higher-as-industrials-shares-gain/",
            "pub_date": "2025-02-04 22:38:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1LN:0",
            "title": "Arabica coffee hits fresh record high as it nears $4 per lb",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The relentless rally in arabica coffee continued on Tuesday, with the market setting a record high for a ninth successive session as roasters scrambled to secure supplies and farmers remained reluctant to sell.</p><p class=\"\">Arabica coffee futures on the ICE exchange , used as a global price benchmark, hit a record $3.8990 per lb earlier in the trading session, and were up 1.6% at $3.8680 by 1300 GMT, bringing gains for the year to around 20% so far. They gained 70% last year.</p><p class=\"\">Dealers said speculative investors are piling into coffee on the buy side mostly, prompting roasters to engage in panic-buying and farmers to withhold sales in the hope that prices can rise higher still.</p><p class=\"\">\"The natural target for this week is to test the $4/lb threshold,\" a dealer said.</p><p class=\"\">Arabica has been supported by an expected output slump in top producer Brazil this season, partly owing to last year's drought, though some experts say the harvest may not be as bad as initially feared thanks to ample rains recently. </p><p class=\"\">Robusta coffee , a generally cheaper variety used mostly to make instant coffee, rose 1.1% to $5,581 a metric ton, after peaking last week at $5,840, the highest price since the contract started trading in 2008.</p><p class=\"\">\"When coffee prices are this high, fundamentals start to matter less. Speculators will speculate. Many would be attracted to coffee following what happened in cocoa and the rally many of them missed,\" Rabobank said.</p><p class=\"\">It added that the market is also concerned that U.S. President Donald Trump might place trade tariffs on South American countries that are key coffee producers.</p><p class=\"\">\"Latin America is in the president's horizon. Uncertainty in tariffs and trade wars is uncertainty to coffee,\" it said.</p><p class=\"\">In other soft commodities, New York cocoa futures  were little changed at $10,916 a ton, having lost 5% last week, while London cocoa  slipped 0.2% to 8,742 pounds per ton.</p><p class=\"\">Raw sugar  edged up 0.1% to 19.28 cents per lb, while white sugar  rose 1.1% to $520.20 a ton.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1LN:0-arabica-coffee-hits-fresh-record-high-as-it-nears-4-per-lb/",
            "pub_date": "2025-02-04 22:38:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308924:0",
            "title": "Ericsson, Lower Colorado River Authority to Establish LTE Network for Texas Utilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ericsson  said Tuesday it has signed a multi-year agreement with the Lower Colorado River Authority to deploy a private LTE network for utilities in parts of 68 Texas counties. </p><p class=\"\">The network will back grid modernization projects, provide low-latency communications and help safeguard utility operations, Ericsson said. </p><p class=\"\">Initial operations to establish the network are slated to start in Q1 2025, the company said. </p><p class=\"\">Financial details were not disclosed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308924:0/",
            "pub_date": "2025-02-04 22:38:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObikQQrGa:0",
            "title": "NOTIFICATION OF MAJOR HOLDINGS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Please see attachment on www.newsweb.no</p><p class=\"\">https://newsweb.oslobors.no/message/637694</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObikQQrGa:0-notification-of-major-holdings/",
            "pub_date": "2025-02-04 22:39:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003093:0",
            "title": "Spotify Reports First Full-Year Profit — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anne Steele</p><p class=\"\">Spotify reported its first ever full year of profitability, fueled by record user growth and austerity measures after years of heavy spending on growth initiatives such as podcasts.</p><p class=\"\">Its fourth-quarter earnings are a sign that the company has been able to wean itself off years of intense investment and transform from a music-streaming service with tough margins to a full-service audio company.</p><p class=\"\">Spotify swung to a fourth-quarter profit of 367 million euros, or EUR1.76 a share, from a loss of EUR70 million, or 36 euro cents a share, a year ago. Analysts expected EUR1.99 a share, according to FactSet.</p><p class=\"\">Net income for the year was EUR1.14 billion, equivalent to about $1.18 billion, compared with a loss of EUR532 million in 2023.</p><p class=\"\">Monthly active users climbed 12% to 675 million — the largest fourth quarter in the company's history and topping guidance by 10 million.</p><p class=\"\">Spotify shares are up 20% so far this year.</p><p class=\"\">When Spotify went public nearly seven years ago, it told investors it would give priority to growth over profits in an effort to establish itself as the dominant audio-streaming service. After spending over $1 billion on podcasting and facing pressure from investors to turn a profit, the company in 2023 shifted its focus to cost controls and laid off about a fifth of its workforce.</p><p class=\"\">It raised subscription prices in many regions around the world last year, including in the U.S. for the second time, further juicing its revenue. Executives promised sustained profits last year while pushing into audiobooks.</p><p class=\"\">Other key highlights from Spotify's fourth-quarter earnings:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose 16% to EUR4.24 billion, topping guidance.   </li><li class=\"listItem-bmN0_SHH\">Gross margin of 32.2% was stronger than its guidance and ahead of the   goal it set at a 2022 investor day of achieving 30% gross margins between   2025 and 2027.   </li><li class=\"listItem-bmN0_SHH\">Premium subscribers, Spotify's most lucrative type of customer, grew 11%   to 263 million, above expectations.   </li><li class=\"listItem-bmN0_SHH\">Average revenue per user for its subscription business ticked up 5% to   EUR4.85, thanks to price increases. The metric has been pressured as   Spotify brings in new subscribers via discounted plans and lower prices   in emerging markets.   </li><li class=\"listItem-bmN0_SHH\">Ad-supported revenue grew 7% to EUR537 million, driven by both music and   podcasts. </li></ul><p class=\"\">Write to Anne Steele at anne.steele@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003093:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007386:0",
            "title": "Canada's Auto Industry Wary of U.S. Tariffs, Highlights Integrated Industry — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007386:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204004891:0",
            "title": "10, 30-year yields rise as China's tariff retaliation adds to inflation concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jamie Chisholm</p><p class=\"\">U.S. bond yields inched slightly higher early Tuesday, amid fears about the possible inflationary impact of a trade war between the U.S. and China and as investors turned their focus to labor market reports over the next few days.</p><p class=\"\">What's happening</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The yield on the 2-year Treasury BX:TMUBMUSD02Y fell 0.5 basis points to 4.260%.</li><li class=\"listItem-bmN0_SHH\">The yield on the 10-year Treasury BX:TMUBMUSD10Y climbed 1.2 basis points to 4.576%.</li><li class=\"listItem-bmN0_SHH\">The yield on the 30-year Treasury BX:TMUBMUSD30Y rose 1.4 basis points to 4.811%.</li></ul><p class=\"\">What's driving markets</p><p class=\"\">Longer-term Treasury yields are a fraction higher after China raised tariffs against U.S. energy and some vehicles, bolstering concerns that a prolonged trade war between the world's two biggest economies may increase inflationary pressures.</p><p class=\"\">See also: Trump's tariff moves upend inflation expectations in financial markets</p><p class=\"\">However, the more monetary policy-sensitive 2-year U.S. yield dipped as investors made bets that tit-for-tat tariff increases may also damage economic growth in the short term.</p><p class=\"\">Still, the overall market reaction - in fixed income, stock-index futures and forex - is relatively mild early Tuesday compared to the volatility seen on Monday, when traders reacted to U.S. tariffs on Mexico and Canada that were later in the day postponed.</p><p class=\"\">The calmer tone may allow investors to turn their focus to the health of the U.S. economy as the rest of the week sees a batch of labor data, starting with the job openings, or JOLTs report on Tuesday at 10:00 a.m. Eastern, and culminating with the January nonfarm payrolls report on Friday.</p><p class=\"\">\"Any strength in data will further fuel the Fed hawks and help push back the expectation of the next rate cut further down the road. For now, the first rate cut is being priced in for June - [at] the earliest,\" said Ipek Ozkardeskaya, senior analyst at Swissquote Bank.</p><p class=\"\">The Federal Reserve is expected to take its Fed funds rate target down to around 3.925% by December, according to 30-day Fed Funds futures, suggesting just two 25 basis point cuts this year.</p><p class=\"\">Other U.S. economic data due Tuesday include factory orders for December, released at 10:00 a.m. Eastern.</p><p class=\"\">Federal Reserve officials making comments include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">11:00 a.m. Atlanta Fed President Raphael Bostic speaks on housing.</li><li class=\"listItem-bmN0_SHH\">2:00 p.m. San Francisco Fed President Daly speaks on the economic outlook.</li><li class=\"listItem-bmN0_SHH\">7:30 p.m. Federal Reserve Vice Chairman Philip Jefferson speaks on the economy and monetary policy.</li></ul><p class=\"\">-Jamie Chisholm</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204004891:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV14C:0",
            "title": "Analysts say Trump tariffs could disrupt pulp, packaging sector",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Citigroup says U.S. President Donald Trump's tariffs could likely disrupt supply chain for beer cans and glass bottles in the U.S., potentially affecting companies like Ball Corp  and Crown Holdings  with operations in Mexico</p><p class=\"\">** Trump imposed tariffs on its top trading partners Canada and Mexico on Saturday, but later suspended them until Mar. 1</p><p class=\"\">** Brokerage says glass bottles and jars maker O-I Glass Inc  could also see impacts to its revenue from its Mexican glass bottle production unit</p><p class=\"\">        ** Separately, BofA sees potential short-term disruptions in Mexican alcohol imports impacting companies like BALL and OI, but expects domestic brands to offset some losses by inventory management and shifts in market share</p><p class=\"\">    ** Citigroup sees tariffs potentially increasing costs for Canadian-produced containerboard and pulp</p><p class=\"\">** Similarly, BofA sees tariffs on Canadian pulp imports, especially NBSK pulp (made from softwood trees), driving up prices and potentially shifting the supply chain to alternative sources</p><p class=\"\">** BALL beat Q4 profit estimates on Tuesday; OI and CCK to report this week</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV14C:0-analysts-say-trump-tariffs-could-disrupt-pulp-packaging-sector/",
            "pub_date": "2025-02-04 22:40:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308928:0",
            "title": "Ecovyst, ChiralVision Collaborate on Enzyme Immobilization Technologies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ecovyst  and ChiralVision said Tuesday they have signed a memorandum of understanding to advance enzyme immobilization technologies. </p><p class=\"\">Financial terms were not disclosed. </p><p class=\"\">The companies said they will develop technologies to enhance the efficiency and sustainability of enzyme-based processes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308928:0/",
            "pub_date": "2025-02-04 22:40:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308932:0",
            "title": "Natural Gas Falls as Mild Southern Weather Cuts Into Demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Natural gas eased early on Tuesday as mild southern temperatures cut heating demand, but with long-term forecasts seeing colder weather on the way, the price decline could be short-lived. </p><p class=\"\">Gas for March delivery was last seen down US$0.16 to US$3.19 per million British thermal units. </p><p class=\"\">The drop comes as southern states enjoy mild weather, even as wintry weather continues in the north. </p><p class=\"\">\"The northern 1/3 of the US will be cool to very cold as frosty weather systems track through w/snow and highs of -0s to 30s, coldest N. Plains. The southern 2/3 of the US will be mild to nice w/highs of 50s-80s as high pressure rules, including very nice highs of 70s-80s across Texas. Overall, Light national demand much of the next 7-days,\" NatGasWeather noted. </p><p class=\"\">However long-term forecasts from the National Weather Service see colder weather on the way, with nearly all states expected to see colder than seasonal temperatures over the agency's eight to 14 day outlook.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308932:0/",
            "pub_date": "2025-02-04 22:40:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308929:0",
            "title": "Evercore ISI Adjusts Dollar General Price Target to $90 From $118",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dollar General  has an average rating of Hold and mean price target of $87.42, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308929:0/",
            "pub_date": "2025-02-04 22:40:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308934:0",
            "title": "Evercore ISI Adjusts AutoZone Price Target to $3,500 From $3,900",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AutoZone  has an average rating of overweight and mean price target of $3,678.23, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308934:0/",
            "pub_date": "2025-02-04 22:40:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1T7:0",
            "title": "Madison Square Garden Sports Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp  reported quarterly adjusted earnings of 5 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 59 cents.  The mean expectation of five analysts for the quarter was for earnings of 31 cents per share. Wall Street expected results to range from 19 cents to 46 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 9.4% to $357.76 million from a year ago; analysts expected $352.68 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp's reported EPS for the quarter was 5 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $1.11 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp shares had fallen by 3.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the entertainment production peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Madison Square Garden Sports Corp is $260.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.31</p></td><td><p class=\"\">0.05</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">-0.86</p></td><td><p class=\"\">-0.31</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.38</p></td><td><p class=\"\">1.06</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.28</p></td><td><p class=\"\">1.57</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1T7:0-madison-square-garden-sports-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:31:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1EA:0",
            "title": "Wall St muted at open after China's retaliatory tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wall Street's main indexes were subdued at the open on Tuesday as investor appetite for risk waned after China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs.</p><p class=\"\">The Dow Jones Industrial Average  rose 47.5 points, or 0.11%, at the open to 44469.46. The S&amp;P 500  rose 3.6 points, or 0.06%, at the open to 5998.14​, while the Nasdaq Composite  rose 30.2 points, or 0.16%, to 19422.171 at the opening bell.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1EA:0-wall-st-muted-at-open-after-china-s-retaliatory-tariffs/",
            "pub_date": "2025-02-04 22:31:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX97ytlx:0",
            "title": "AgriFORCE Growing Systems Ltd. Supercharges Growth with Robust Financing, Strategic Acquisitions, and Potential for Unprecedented Operational Excellence",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vancouver, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — AgriFORCE Growing Systems Ltd. , a trailblazing technology-driven innovator committed to sustainability and operational excellence, is enthusiastic to comment upon a transformative series of developments. In an explosive 75-day period, the Company has evolved into a fully operational bitcoin mining and agtech company with diversified revenue streams, setting new industry benchmarks for growth and innovation across both Canada and the U.S.</p><p class=\"\">Unmatched Operational and Technological Breakthroughs</p><p class=\"\">AgriFORCE now operates three strategically located sites—two in Ohio and one in Alberta—with a combined installed capacity of 5 MW. The state-of-the-art facilities are delivering solid mining metrics:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Collective Hashrate:</strong> 18 PH/s</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bitcoin Production:</strong> Approximately 0.057 BTC per day</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Miner Count:</strong> 1,120</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Energy Cost:</strong> $0.04 per kWh</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Unprecedented Uptime:</strong> Only 1 outage day recorded since November 30, 2024</li></ul><p class=\"\">This remarkable operational ramp-up has driven a more than 600% increase in hashrate since the commencement of operations of its Sturgeon, Alberta facility, firmly establishing AgriFORCE’s potential as a formidable competitor in the digital asset mining arena.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Acquisitions Powering Future Growth</strong></p><p class=\"\">In a bold, strategic move to amplify its growth trajectory, AgriFORCE acquired an innovatively efficient 5 MW bitcoin mining facility in Columbiana County, Ohio, for $4.5 million in cash. This facility, powered by natural gas flare energy, currently runs over 900 bitcoin mining units—with the potential to expand to 1,200 units—delivering immediate cash flow and extraordinary scalability. This acquisition is a cornerstone of AgriFORCE’s trailblazing strategy to leverage stranded gas assets while integrating sustainable energy and agricultural growth strategies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robust Financing Accelerates Expansion</strong></p><p class=\"\">Highlighting investor confidence and a bright future ahead, AgriFORCE has secured the first tranche of an up to $50 million financing facility from leading institutional investors. An initial $7 million tranche was deployed to complete the recent high-impact acquisitions. This significant financial backing not only underpins the Company’s aggressive expansion plans but also enables the rapid scaling of operations and the anticipated integration of pioneering sustainable technologies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jolie Kahn, CEO of AgriFORCE,</strong> stated, </p><p class=\"\">“Our rapid growth, marked by a more than 600% increase in hashrate in under 60 days, is a testament to our innovative approach and the exceptional leadership driving AgriFORCE forward. The acquisition of high-potential assets in Ohio, combined with our trailblazing work repurposing waste heat and carbon emissions for anticipated sustainable agricultural initiatives in Ohio and Alberta, underscores our ability to redefine the intersection of cryptocurrency mining and environmental stewardship. With the support of our financing partners, we believe we are seizing a once-in-a-generation opportunity to revolutionize our industry and deliver extraordinary value to our shareholders.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Vision for Transformative Growth</strong></p><p class=\"\">AgriFORCE’s groundbreaking integration of bitcoin mining with sustainable agricultural practices is setting a new paradigm in the digital asset and environmental sectors. The secured financing gives us the runway to fuel further acquisitions and enable the expansion of operations, ensuring that AgriFORCE has the potential to remain at the forefront of the sustainable digital asset ecosystem.</p><p class=\"\">By harnessing innovative technology and a robust operational framework, AgriFORCE is not only accelerating its growth but also paving the way for a future where profitability potential and sustainability go hand in hand.</p><p class=\"\">About AgriFORCE Growing Systems Ltd.</p><p class=\"\">AgriFORCE Growing Systems Ltd.  is a forward-thinking technology company dedicated to solving critical challenges in agriculture, sustainability, and environmental stewardship. By leveraging advanced technologies and innovative business models, AgriFORCE aims to deliver value for shareholders while creating lasting benefits for communities and ecosystems.</p><p class=\"\">Follow AgriFORCE on Social Media:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Twitter: @agriforcegs</li><li class=\"listItem-bmN0_SHH\">Facebook: AgriFORCE Growing Systems Ltd.</li><li class=\"listItem-bmN0_SHH\">LinkedIn: AgriFORCE Growing Systems Ltd.</li></ul><p class=\"\">Forward-Looking Statements</p><p class=\"\">Statements made in this press release include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements can be identified by the use of words such as “may,” “will”, “plan,” “should,” “expect,” “anticipate,” “estimate,” “continue,” or comparable terminology. Such forward-looking statements are inherently subject to certain risks, trends and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate and involve factors that may cause actual results to differ materially from those projected or suggested. Readers are cautioned not to place undue reliance on these forward-looking statements and are advised to consider the factors listed above together with the additional factors under the heading “Risk Factors” in the Company's Period Reports on Forms 10-K and 10-Q, as may be supplemented or amended by the Company's Current Reports on Form 8-K. The Company assumes no obligation to update or supplement forward-looking statements that become untrue because of subsequent events, new information or otherwise. No information in this press release should be construed as any indication whatsoever of the Company’s future revenues, results of operations, or stock price.</p><p class=\"\">For more information, visit www.agriforcegs.com.</p><p class=\"\">For media inquiries, please contact:</p><p class=\"\">Richard Wong</p><p class=\"\">CFO</p><p class=\"\">AgriForce Growing Systems Ltd.</p><p class=\"\">1-778-658-0533</p><p class=\"\">rwong@agriforcegs.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">###</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX97ytlx:0-agriforce-growing-systems-ltd-supercharges-growth-with-robust-financing-strategic-acquisitions-and-potential-for-unprecedented-operational-excellence/",
            "pub_date": "2025-02-04 22:32:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1TH:0",
            "title": "Marathon Petroleum Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp  reported quarterly adjusted earnings of 77 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $3.98.  The mean expectation of eighteen analysts for the quarter was for earnings of 2 cents per share. Wall Street expected results to range from -39 cents to 14 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 9.1% to $33.47 billion from a year ago; analysts expected $31.12 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp's reported EPS for the quarter was $1.15​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $371 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp shares had risen by 5.4% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 98.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, fourteen analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 11 \"strong buy\" or \"buy,\" 7 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the oil &amp; gas refining and marketing peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Marathon Petroleum Corp is $170.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.02</p></td><td><p class=\"\">0.77</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">1.87</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">3.09</p></td><td><p class=\"\">4.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.42</p></td><td><p class=\"\">2.58</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1TH:0-marathon-petroleum-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:32:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}