{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464079:0",
            "title": "Woodbois Explores Funding Options to Restart Full Production",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Woodbois  is in talks with its advisers for potential funding options to secure working capital for the next few weeks. </p><p class=\"\">The forestry company said Wednesday it expects the business to be cash-generating and able to pay creditors once it resumes full production after disruptions and management changes in 2024. </p><p class=\"\">Woodbois added that it started shipping containers of existing stock from the Libreville port in Gabon and is moving supplies from its Mouila warehouse to the port.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464079:0/",
            "pub_date": "2025-02-06 01:07:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1V9:0",
            "title": "CRH to exit stake in SigmaRoc, says bookrunner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dublin-based building materials supplier CRH's  UK unit intends to sell about 171.6 million ordinary shares in SigmaRoc , exiting its entire stake in the British quarrying company, a bookrunner said on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1V9:0-crh-to-exit-stake-in-sigmaroc-says-bookrunner/",
            "pub_date": "2025-02-06 01:08:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310326:0",
            "title": "CIBC on Economist Forecast, Markets After Canada's Merchandise Trade Data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canadian exports ended the year on a high note, with the trade balance moving into a surplus position, but the increase in demand appeared to reflect some tariff front-running and more turbulent conditions lie ahead for exporters, said CIBC. </p><p class=\"\">Canada's international trade balance moved into a surplus of C$710 million in December, which was a little lower than the C$1.0 billion surplus expected by the consensus, noted the bank. </p><p class=\"\">While tariffs on Canada are now on hold for 30 days, the uncertainty will likely continue to result in United States importers front-running potential tariffs in the near term, stated CIBC. </p><p class=\"\">The uncertainty is clearly a negative for business investment in Canada and supports CIBC's call for further Bank of Canada cuts as the weakness is occurring at a time when the economy is still operating with slack. </p><p class=\"\">There was no material market reaction to the Wednesday data, added the bank.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310326:0/",
            "pub_date": "2025-02-06 01:09:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0KP:0",
            "title": "SUBBED - What’s happened to Lloyd’s policy of succession management?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Like all venerable institutions weighed by history, Lloyd’s has taken great care over succession planning. In its case, the Corporation has for many years adroitly staggered the arrivals and exits of its most senior leaders to avoid disruption and maintain an inviolable continuity of purpose.</p><p class=\"\">Until now, that is.</p><p class=\"\">Last week’s news that Lloyd’s CFO Burkhard Keese will shortly return to Germany was the latest in a flurry of unexpected exits from the Corporation’s executive team. The question is what has caused this trend and is it a problem?</p><p class=\"\">Keese’s imminent departure (he will join German MGA Konzept &amp; Marketing on 1 May) follows the announcement last month that CEO John Neal will take up the vacant position as Aon’s global reinsurance head, and comes during a handover period for the next Lloyd’s chairman with Bruce Carnegie-Brown retiring in May after almost nine years at One Lime Street.</p><p class=\"\">Nor are these the only notable changes on the executive floor. In August 2024, Lloyd’s COO Bob James was parachuted into the London market joint venture Velonetic to directly oversee Neal’s delayed Blueprint Two modernisation project, with the vacancy since filled on an interim basis by Accenture’s AI specialist George Marcotte. </p><p class=\"\">The Corporation – the body tasked with managing the near-350-year-old market – has not experienced this level of executive turnover since at least the Lloyd's Act of 1982 and perhaps even since Edward Lloyd began percolating his coffee. It is even possible four of the five most senior Corporation leaders will have changed in under a year – assuming Neal is released early from his 12-month rolling contract to avoid any tensions emerging from his next destination (no details have been released on his leaving date – another sign, perhaps, that his departure was unexpected).</p><p class=\"\">The only constant is chief of markets Patrick Tiernan, who has returned to his post after a brief health-related absence last year. However, even that position may become vacant later this year if he is successful in his ambition to succeed Neal as CEO.</p><p class=\"\">It is certainly a far cry from the previous model of stable succession planning. Since 2000, for example, Lloyd’s has had only four chairmen (Sax Riley, Lord Levene, John Nelson and Carnegie-Brown), four CEOs (Nick Prettejohn, Richard Ward, Dame Inga Beale and Neal), four underwriting heads (Rolf Tolle, Tom Bolt, Jon Hancock and Tiernan) and five CFOs (Bob Hewes, Andrew Moss, Luke Savage, John Parry and Keese). As the timeline below demonstrates, their arrivals and departures were managed to ensure continuity of senior leadership. In any one year between 2000-2024, only one of the top four executives left. Only rarely – such as when Hancock left in 2020 for AIG – was there a significant hiatus before a replacement was announced.</p><p class=\"\">In one sense, we shouldn’t be too surprised. Under Neal’s stewardship, there appears to have been a marked increase in the turnover of Corporation senior staff. This is perhaps natural at the beginning of a CEO’s tenure – however, in Neal’s case it seemed more of a continual theme. 2023, for example, saw the sudden departure of two members of the Corporation’s managerial ranks: long-serving general counsel Peter Spires and marketing and communications head Jo Scott. Both were effectively replaced by junior Corporation colleagues (albeit Scott temporarily remained with a reduced role overseeing charitable donations) who were assumed to be closer to Neal. James – another trusted Neal lieutenant from his time at QBE – was elevated to the vacant COO role following the exit of Jennifer Rigby the previous year.</p><p class=\"\">Does all this turnover matter? </p><p class=\"\">On the face of it, the Lloyd’s market is in rude health. In March, the Corporation is expected to announce another set of strong underwriting results for the ~100 syndicates that trade on the platform. Keese’s successor has already been identified in the form of his number two, Alexandra Cliff. Lloyd’s remains an attractive place to access wholesale and specialty business and the queue of aspiring entrants is said to remain healthy. Of course, rate pressures are growing in many classes but there is no sign yet of a return to the soft market nadir of 2016-2018. The venerable ship – which celebrates its 350th anniversary next decade – is back on course after the traumatic underwriting losses of 2017-19.</p><p class=\"\">But the vicissitudes of the risk business means the waters rarely stay calm for long – as we were reminded in California only last month. Catastrophic loss events – as well as geopolitical and economic storms – occur too frequently to indulge a leadership vacuum for long at a marketplace as important as Lloyd’s.</p><p class=\"\">However, the uncertainty of when Neal will go – and who will replace him – is complicated by the impending exit of his chairman. This departure was at least planned. Carnegie-Brown’s final term of office expires in the summer and his successor, the former McKinsey senior partner and civil servant Sir Charles Roxburgh, was identified last year following a thorough process.</p><p class=\"\">However, the sudden announcement of Neal’s departure has created a dilemma. Will it be Carnegie-Brown or Roxburgh who ultimately decides Neal’s leaving date? The situation is complicated by Neal’s decision to join Aon, one of the market’s largest and most influential producers. The longer he stays, the more Lloyd’s will have to tread carefully in decisions that affect Aon’s competitors to avoid any accusations of favouritism. If he goes prematurely, Lloyd’s may need to find an interim replacement – which could also affect the process to select a permanent successor.</p><p class=\"\">Committed, long-term leadership is also required to address two of the more vexatious issues during Neal’s tenure: modernisation and culture. The former hinges on Blueprint Two, which has likely cost more than all the infamous Lloyd’s white elephants of the past – such as Kinnect and TOM – combined. Neal and Carnegie-Brown are leaving with no official costings to date published, but there are fears it exceeds £500mn all in along with continued concerns over its delivery. Should it be shelved? </p><p class=\"\">Surely not, but a clear pathway of deliverable success needs to be presented to the market following the tensions that emerged last year between the influential trade body, the Lloyd’s Market Association, and Neal. This can’t be delayed for much longer.</p><p class=\"\">On culture, Lloyd’s has recently closed a market consultation on toughening its investigation powers following the failures of the Atrium/Richard Tomlin affair. </p><p class=\"\">Neal positioned himself as a reforming culture crusader during his time at Lloyd’s. Politically, this was smart considering the damaging Bloomberg investigation alleging widespread sexual harassment shortly after he arrived. </p><p class=\"\">But the delivery didn’t always appear consistent. </p><p class=\"\">Atrium was hit with a record £1mn fine and an exposé of a “boys' night out” culture, while a few years later CFC Underwriting was allowed to discreetly change its senior management and avoid any embarrassing revelations of its own culture shortcomings. </p><p class=\"\">Closer to home, Lloyd’s quietly parted ways with a number of unnamed executives in its performance directorate in 2022 following suggestions of whistleblower complaints relating to conduct and behaviour. Shouldn’t this also have been subject to the cleansing light of transparency? And what of the Corporation’s apparent deteriorating performance in the most recent annual market culture survey?</p><p class=\"\">This is all on Neal’s watch rather than his yet-to-be found successor, but someone still has to decide whether to proceed with the proposed tougher rules despite concerns – likely to have been echoed in the consultation – that they may result in regulatory over-reach and potential injustice. Should this be an exiting chairman and CEO or the new leadership team? Surely the latter.</p><p class=\"\">In summary, it’s been a month since the market was blindsided by the news of Neal’s resignation. This – together with the chairman handover process – no doubt explains the delay in announcing an agreed exit date. But Lloyd’s needs to resolve the current leadership limbo swiftly. Once achieved, perhaps it also makes sense for the Corporation to return to the policy of stable succession planning…</p><p class=\"\">In response to some of the points raised in this article, a Lloyd's spokesperson said: “Lloyd’s executive committee remain aligned on the Corporation’s strategy for 2025 and on the execution and delivery against the key priorities of performance; digitalisation; purpose and culture.</p><p class=\"\">“Following John Neal’s decision to step down as CEO of Lloyd’s in 2025, a rigorous process to recruit has successor is now underway. A formal departure date will be agreed in due course, and John will work with incoming chair Charles Roxburgh and Lloyd’s executive committee to ensure a smooth transition.</p><p class=\"\">“Alex Cliff will take over from Burkhard Keese, following his decision to step down as CFO at the end of April as part of a well-executed succession plan. She is a well-known member of the leadership team and well-respected deputy CFO, having been at Lloyd’s for over three years.”</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0KP:0-subbed-what-s-happened-to-lloyd-s-policy-of-succession-management/",
            "pub_date": "2025-02-06 01:09:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1VQ:0",
            "title": "JAB will pay just over $3 bln for Elliot owned Prosperity Life- Semafor",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/ymc5jbbu</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1VQ:0-jab-will-pay-just-over-3-bln-for-elliot-owned-prosperity-life-semafor/",
            "pub_date": "2025-02-06 01:09:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX6pMfr3:0",
            "title": "Davis Malm Launches Insurance Regulatory Practice with Addition of Three-Lawyer Team",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOSTON, Feb.  05, 2025  (GLOBE NEWSWIRE) — Boston law firm Davis Malm has bolstered its highly regarded Regulatory &amp; Administrative Law Group with the addition of a three-lawyer team from Verrill Dana LLP. Stuart T. Leslie, J. David Leslie and Eric A. Smith have joined Davis Malm to launch the firm’s Insurance Regulatory Practice, which was established to address the increasingly complex and evolving needs of clients navigating regulatory, administrative and compliance challenges.</p><p class=\"\">The Insurance Regulatory practice group specializes in representing insurance regulators and has deep experience assisting with the full range of regulator responsibilities, including insurer formation, change of control, redomestication, supervision/examination and delinquency proceedings. Davis Malm’s insurance regulatory attorneys represent insurance regulators as supervisors, rehabilitators and liquidators of property-casualty, life and health insurers, ranging from single-member risk retention groups to billion-dollar international insurance companies. The team has also acted on behalf of regulators from every United States jurisdiction in single- or multistate targeted market conduct examinations of property/casualty, life/health and specialty writers.</p><p class=\"\">Davis Malm President Christopher J. Marino said, “We are excited that Stu, Dave and Eric have joined the firm and launched this new practice group. Their unparalleled expertise in regulatory and administrative law aligns perfectly with our commitment to delivering top-tier legal services. This addition reinforces our ability to serve clients at the highest level and navigate the complexities of today’s regulatory landscape.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the New Shareholders</strong></p><p class=\"\">Davis Malm’s insurance regulatory attorneys have substantial expertise in administrative law, complex coverage analysis/litigation and financial analysis.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Stuart T. Leslie</strong> has a deep knowledge and understanding of complex insurance regulatory, coverage and compliance issues, including supervision, examination, and receivership of insurers ranging in size from single-member risk retention groups to the largest international writers of property/casualty, accident/health and specialty lines.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">J. David Leslie</strong> brings over 50 years of corporate and litigation experience, representing insurance regulators in complex issues, including material insurance company transactions, examinations and reorganizations, as well as counseling insurance companies and insurance agencies.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Eric A. Smith</strong> represents state insurance regulators in the liquidation, rehabilitation and examination of insurance companies, as well as handling administrative, insurance coverage, reinsurance and other disputes and litigation.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Davis Malm </strong></p><p class=\"\">Founded in 1979, Davis Malm is a premier full-service, Boston-based business law firm that represents local, national and global businesses, institutions and individuals in a wide spectrum of industries. Clients rely on Davis Malm’s attorneys to efficiently deliver successful results through direct partner involvement, responsive client service, and creative and strategic problem solving. Its attorneys practice at the top level of the profession and possess the agility necessary to handle any issues that arise during the course of a matter. Davis Malm is a member of the International Lawyers Network, representing Massachusetts and northern New England. This membership enables the firm to offer high-quality, efficient services to clients doing business globally.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">Lisa Murray</p><p class=\"\">Trevi Communications, Inc.</p><p class=\"\">O: 978.750.0333 / M: 617.835.0396</p><p class=\"\">lisa@trevicomm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX6pMfr3:0-davis-malm-launches-insurance-regulatory-practice-with-addition-of-three-lawyer-team/",
            "pub_date": "2025-02-06 01:09:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008576:0",
            "title": "S&P 500, Nasdaq Fall; Google, AMD in Focus — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angus Berwick</p><p class=\"\">After a flurry of tariff news, an old reliable-earnings season-is back in the spotlight. Investors are poring over results from Google parent Alphabet and chip maker Advanced Micro Devices, which each disappointed investors.</p><p class=\"\">Major indexes fluttered between modest gains and losses Wednesday morning, with the Dow industrial logging a modest increase around midday. Stocks had rebounded Tuesday, clawing back most of the previous session's losses, despite the escalating U.S.-China trade war.</p><p class=\"\">China's response to U.S. tariffs was considered by Wall Street to be fairly tame, with new levies imposed on a slim slice of American goods. Some analysts cautioned, however, that investors might be underestimating the risk of a lengthier trade spat.</p><p class=\"\">In recent market action:</p><p class=\"\">Earnings drove some big moves. Shares in Alphabet, AMD and Uber all fell sharply, while Mattel stock jumped.</p><p class=\"\">U.S. Treasury yields declined, after the 10-year note settled Tuesday at 4.511%. The Treasury said it wasn't planning to step up debt issuance anytime soon.</p><p class=\"\">Chinese stock indexes fell. Benchmarks in mainland China reopened after a long New Year break.</p><p class=\"\">Gold prices rose again. Futures surpassed $2,900 a troy ounce in intraday trading for the first time, putting the metal on pace for another record close.</p><p class=\"\">Bitcoin prices slipped below $99,000.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008576:0/",
            "pub_date": "2025-02-06 01:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN8zSv6X:0",
            "title": "Year-end report 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">October-December 2024</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 58% to SEK 144m (91), organic growth amounted to 52% during the quarter</li><li class=\"listItem-bmN0_SHH\">Operating profit increased by 260% to SEK 62m (17)</li><li class=\"listItem-bmN0_SHH\">Operating margin improved by 24.1 percentage points to 42.9% (18.8)</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities increased by SEK 55m to SEK 87m (31)</li><li class=\"listItem-bmN0_SHH\">Earnings per share, diluted, increased by 234% and amounted to SEK 1.99 (0.60)</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">January-December 2024</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales increased by 35% to SEK 483m (357), organic growth amounted to 35%</li><li class=\"listItem-bmN0_SHH\">Operating profit increased by 148% to SEK 174m (70)</li><li class=\"listItem-bmN0_SHH\">Operating margin improved by 16.4 percentage points to 36.1% (19.7)</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities increased by SEK 132m to SEK 142m (11)</li><li class=\"listItem-bmN0_SHH\">Earnings per share, diluted, increased by 120% to SEK 5.32 (2.42)</li><li class=\"listItem-bmN0_SHH\">The Board of Directors proposes a dividend of SEK 6.50 (6.00) per share, corresponding of 122% of net earnings during the year</li><li class=\"listItem-bmN0_SHH\">Updated long-term financial target to reach net sales &gt;SEK 2 billion no later than 2029</li></ul><p class=\"\">Strong end to the year with solid growth in all our categories and all geographies</p><p class=\"\">We ended the year with another strong quarter and organic growth of 52 percent compared to the same quarter last year. We achieved organic growth of 35 percent for the full year. I am pleased to see that our performance has been strong in all the categories we operate in, and that we have grown in all the geographies we sell to.</p><p class=\"\">In the Sports and Motorcycle categories, we are now seeing a more normalized market situation. In these categories, where we have strong customer awareness, our focus is to drive increased penetration by equipping more helmet models from more helmet brands with Mips solutions. The rate of implementation of Mips technology in new helmets was the highest ever this year. Furthermore, we are still seeing great interest from our customers in all three of our categories in implementing Mips’ safety system, also in the Safety category, which is significantly less mature in terms of implementing our type of solutions.</p><p class=\"\">We have experienced that helmet inventory levels have largely normalized this year, and a lot of our growth is due to our customers once again starting to order products from us, rather than taking from their own stocks. We believe this will continue to contribute to our growth in 2025. The fourth quarter was our best quarter ever in the Safety category. This year we have almost doubled the number of helmet models on the market and have substantially strengthened our position in this category.</p><p class=\"\">The increase in net sales that we saw this quarter has led to a considerable improvement in profitability compared to the same quarter last year. Operating profit improved by 260 percent to SEK 62m (17) this quarter, and the operating margin thereby improved to 43 percent (19). Looking at the entire year, operating profit has increased from SEK 70m to SEK 174m, and the operating margin has improved, reaching 36 percent (20). The operating cash flow amounted to SEK 87m (31) in the quarter, and for the full year the cash flow was SEK 142m (11).</p><p class=\"\">The Board of Directors proposes a dividend of SEK 6.50 (6.00) per share for 2024, which corresponds to 122 percent of net earnings for the year. This well exceeds our target of distributing more than 50 percent of our net earnings.</p><p class=\"\">Sustainability - continued focus on delivering against our long-term targets</p><p class=\"\">In terms of our work with sustainability, we continued our journey towards our long-term goals this year. One of our targets was to reduce Mips’ carbon dioxide emissions by 8 percent per solution sold this year, and we managed to deliver a total reduction of 18 percent. The second target was to expand the third-party auditing of our supply chain, and we have now audited five of our largest manufacturing suppliers and thus delivered on our target. Our third target was to increase the use of recycled materials in Mips’ solutions by at least 10 percent, and we have successfully achieved an increase of 16 percent.</p><p class=\"\">Helmet category Sports – strong progress in all sub-categories</p><p class=\"\">We achieved growth of 56 percent in the Sports helmet category this quarter, and for the fifth quarter in a row we delivered growth in the bike sub-category, Mips’ largest sub-category. Global inventory levels are now at a healthier level than during the very turbulent years following the pandemic. This does not mean that all inventory levels have now completely normalized though, and many retailers are still trying to come to terms with an unfavorable product mix.</p><p class=\"\">According to current market data for the bike market in North America, there is a shift in the trend and volumes in the quarter have started to grow again compared to last year. Looking at the entire year, volumes are still down however positive to note is that the market recovery has begun. We are seeing a recovery in Europe where there is growth in many markets once again. However, it is important to remember that there are relatively weak comparative figures for this market as European consumers have faced a challenging situation in recent years. The high levels of inventory that followed the pandemic have made many helmet brands cautious about new product launches. It will therefore be interesting to see how all the new helmet models are received when they are launched during the upcoming season.</p><p class=\"\">Helmet category Motorcycle – strong growth in the quarter</p><p class=\"\">In the Motorcycle helmet category we delivered sales growth of 57 percent for the quarter, and growth of 25 percent for the full year. We are happy to see that the inventory situation has normalized, and also that the initiatives we launched have had the desired effect. As in the Sports category, growth has primarily been driven by customers buying from us again rather than focusing on reducing their inventories, coupled with market launches of new helmet models equipped with Mips’ safety system.</p><p class=\"\">Our assessment is that the market has recovered substantially during this recent period, but we are still seeing a challenging consumer market and do not expect the general market situation in the Motorcycle category as a whole to materially contribute to our growth journey in the short term. Our growth will mainly be driven by taking greater market share and the roll-out of new helmet models equipped with Mips’ technology.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Helmet category Safety – best quarter so far</strong></p><p class=\"\">We delivered our best quarter so far in the Safety helmet category and we saw good growth of 119 percent. Growth for the full year was 55 percent in this category.</p><p class=\"\">During the quarter we launched a new partnership, and a new helmet equipped with Mips technology, with the HexArmor brand in the US. HexArmor is an innovative, driven helmet producer in the American market and we look forward to seeing how the helmet will be received. Through this launch we have sharpened our offering even further, and it will be exciting to follow developments in 2025. While larger volume sales with selected helmet brands have been slightly slower than we had hoped, we are delighted to see that growth has now taken off and we remain very positive about this category over the long term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Continued normalization of inventory levels</strong></p><p class=\"\">Progress was strong in the fourth quarter. I am pleased that all of our sub-categories and geographies grew during the quarter. During the quarter, it has been exciting to see the shift in trends that has occurred in the important American market after a challenging period. Our customers are still showing plenty of interest in developing new helmets equipped with Mips’ safety system in all three categories, and the number of completed helmets developed with our technology is the highest ever.</p><p class=\"\">The new American president has now taken office, and it remains to be seen how his administration will affect the business relationships with international companies and the geopolitical landscape. Mips sells all products based on Incoterms Ex Works, which means that the buyer takes responsibility for transport costs, fees, taxes, tariffs and so on.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Updated long-term financial target</strong></p><p class=\"\">We remain confident in the strategic plan communicated at our Capital Markets Day in June 2022. The plan is built on three strategic pillars to 1) grow the existing business, 2) open up new channels and markets and 3) capture new opportunities within helmet safety.</p><p class=\"\">We see that we have successfully continued to gain market share and increase the penetration of the number of helmet models equipped with Mips’ technology among our customers through our market-leading safety solution.</p><p class=\"\">After summarizing the year, we have assessed the possibilities of reaching our financial targets by 2027. We have seen that it has taken longer for both the retail chain and helmet manufacturers to normalize their inventory levels than expected in connection with our Capital Markets Day. This, together with a relatively uncertain consumer market, geopolitical uncertainty and a new administration in the important US market, means that our new assessment is that we will reach our net sales target of &gt;SEK 2 billion no later than 2029, which is two years later than the target communicated in 2022. Our long-term profitability target and dividend target communicated in 2022 remain unchanged. This means that our financial targets now are:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales &gt;SEK 2 billion no later than 2029 (previously 2027)</li><li class=\"listItem-bmN0_SHH\">EBIT margin &gt;50% (no change)</li><li class=\"listItem-bmN0_SHH\">&gt;50% dividend of annual net earnings (no change)</li></ul><p class=\"\">We will continue to grow our business with our strong market position in the helmet sector, our broad expertise and our patented technology. We will also continue to invest in research and development and in our brand to achieve our ambition.</p><p class=\"\">Stockholm, February 2025</p><p class=\"\">Max Strandwitz</p><p class=\"\">President and CEO</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN8zSv6X:0-year-end-report-2024/",
            "pub_date": "2025-02-06 01:10:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFNbKrRz7:0",
            "title": "Mips updates long-term financial target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mips AB’s (publ) board has today decided to update the long-term sales target communicated at the Capital Markets Day in June 2022. The sales target at SEK 2 billion is retained but now with the ambition to reach that target no later than 2029 instead of 2027. Mips’ financial targets for profitability and dividend remain unchanged. Mips’ strategy as communicated at the Capital Markets Day in June 2022 will also remain the same and be continuously focused on the three helmet categories Sports, Motorcycle and Safety.</p><p class=\"\">Mips’ updated long-term sales target is:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net sales &gt;SEK 2 billion no later than 2029</strong> (previously 2027)</li></ul><p class=\"\">Mips’ other two long-term financial targets remain unchanged:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">EBIT margin &gt;50% </strong>(no change)</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">&gt;50% dividend of annual net earnings</strong> (no change)</li></ul><p class=\"\">“<!-- -->We remain confident in the strategic path of Mips as communicated at our latest Capital Markets Day in June 2022, building on our three strategic pillars to 1) grow the existing business, 2) open up new channels and markets and 3) capture new opportunities within helmet safety. However, despite great progress during the last years in winning market shares with our leading offers for helmet safety, we have seen that the overall helmet market has taken longer to return to normal purchasing patterns than expected at the time when we set our financial targets. <!-- -->Based on this, together with a relatively uncertain consumer market, geopolitical uncertainty and a new administration in the important US market, we have decided to retain our sales target at SEK 2 billion but now with the ambition to reach that target no later than 2029 (previously 2027). Our financial targets for profitability and dividend remain unchanged. We will continue to grow our business with our strong market position in the helmet sector, our broad expertise and our patented technology. We will also continue to invest in research and development and in our brand to achieve our ambition”, says Max Strandwitz, Mips’ CEO and President.</p><p class=\"\">A presentation of the results for January - December 2024 will, as previously communicated, be held through a conference call tomorrow on 6 February 2025 at 10.00am CET. The year-end report and a presentation will be available at mipscorp.com/investor ahead of the conference call.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFNbKrRz7:0-mips-updates-long-term-financial-target/",
            "pub_date": "2025-02-06 01:10:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310315:0",
            "title": "Wells Fargo Adjusts Price Target on Estee Lauder Companies to $70 From $80",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder Companies  has an average rating of hold and mean price target of $76.27, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310315:0/",
            "pub_date": "2025-02-06 01:10:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310321:0",
            "title": "Jefferies Adjusts Price Target on Estee Lauder Companies to $70 From $75",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder Companies  has an average rating of hold and mean price target of $76.27, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310321:0/",
            "pub_date": "2025-02-06 01:10:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310323:0",
            "title": "Goldman Sachs Adjusts Price Target on Estee Lauder Companies to $70 From $75",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder Companies  has an average rating of hold and mean price target of $76.27, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310323:0/",
            "pub_date": "2025-02-06 01:10:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310324:0",
            "title": "Piper Sandler Adjusts Price Target on Estee Lauder Companies to $92 From $98",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder Companies  has an average rating of hold and mean price target of $76.27, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310324:0/",
            "pub_date": "2025-02-06 01:10:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008497:0",
            "title": "CRH to Sell Stake in SigmaRoc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Nina Kienle</p><p class=\"\">CRH said it intends to sell its shares in U.K. building-material company SigmaRoc.</p><p class=\"\">The Irish building-materials supplier on Wednesday said it intends to sell up to 172 million shares via bookbuilding, representing approximately 15.4% of SigmaRoc's issued share capital.</p><p class=\"\">Following the transaction, CRH will exit its interest in SigmaRoc in full, the company said.</p><p class=\"\">The final number of shares to be sold, as well as the price, will be announced as soon as practical, CRH said.</p><p class=\"\">Write to Nina Kienle at nina.kienle@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008497:0/",
            "pub_date": "2025-02-06 01:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSrxx1Za:0",
            "title": "OneMain Financial: Do's and Don'ts of Buying a Car",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW YORK, NY / ACCESS Newswire / February 5, 2025 / <strong class=\"root-Tkn6WL2y\">NEW YORK, NY /</strong> <strong class=\"root-Tkn6WL2y\">ACCESS Newswire</strong> <strong class=\"root-Tkn6WL2y\">/ February 5, 2025 /</strong> Buying a car can be complicated because it requires a buyer to make several decisions, like which make and model to go with and choosing between dealer financing or a personal loan to buy a car. Although the car-buying process can be exciting, there are potential pitfalls that car buyers can sometimes fall into. Below is a list of dos and don'ts to simplify the car-buying experience.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What to do when buying a car</strong></p><p class=\"\">Potential car buyers can shop online, go to an auto dealership, or browse classified ads that list new and used vehicles. In every case, the following steps should be taken once a borrower finds a car they love.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Look up the book value</strong>: The sticker price on the car is not the book value of the vehicle. That can be found by researching vehicle valuation websites. Another number to look for is the fair market value, which may vary slightly from the book value. Either number can be the starting place for price negotiations.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Add up the cost of ownership:</strong> The cost of ownership comes after the car's initial purchase. It includes loan payments, interest, insurance, gas, maintenance, and other miscellaneous expenses. Affordability is determined by this cost, not whether the buyer can come up with a down payment on the purchase date.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Get pre-approved before going to the dealership:</strong> Pre-approval from a bank or online lender gives the buyer a better understanding of their budget and prevents them from falling in love with a car that is out of their price range. It can also give the buyer negotiating power at the dealership. With a set interest rate and loan amount, the buyer can negotiate a better price for the vehicle.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Always test-drive the vehicle:</strong> A potential car buyer should never purchase a vehicle without test-driving it first. It's best to bring a mechanic along to evaluate the car on the spot. If that's not possible, the buyer should use their best instincts and take the vehicle in for a full mechanical checkup within a few days after purchasing.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Be prepared to walk away</strong>: Auto dealerships are notorious for hiring high-pressure salespeople to close deals. A buyer should be prepared to walk away if the deal doesn't seem right or doesn't fall in line with their budget.</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">What not to do when buying a car</strong></p><p class=\"\">The \"don'ts\" of car buying occur primarily in the negotiation stage. The following actions should be avoided if the buyer wants the best price on a new or used vehicle.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't buy based on price alone</strong>: There's an old saying about getting what you pay for. Paying a little more for a better-quality vehicle is better than getting stuck with a lemon because the \"price was right.\"</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't give up your leverage during negotiations</strong>: A buyer should never tell a car salesperson what's in their budget or how much they want their monthly payment to be. That's giving up leverage during the negotiation process.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Don't agree to buy before all questions have been answered: It's best not to leave anything unsaid during the negotiation phase. Ask every relevant question, and don't sign the purchase agreement until all of them have been answered.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't go over budget:</strong> Buyers should never stretch their budget too far when buying a car. Not being able to afford the monthly car payments will create financial challenges in other areas. It's best to stick with what they can reasonably afford.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Don't rely only on dealer financing: Several financing options exist for buying a car. Dealer financing is only one of them. A loan from a lender other than the dealership might have better terms and a lower interest rate. So, shopping around before making the final decision is more beneficial.</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Bottom Line</strong></p><p class=\"\">Always know the value of the vehicle being bought and how much it will cost to own. Test drive the vehicle before buying it and be prepared to walk away if the deal doesn't feel right. Don't buy based on price. Don't give up leverage in negotiations. Don't agree to buy a car when there are unanswered questions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sources:</strong></p><p class=\"\">https://www.gobankingrates.com/saving-money/car/biggest-dos-donts-when-buying-first-car/</p><p class=\"\">https://cars.usnews.com/cars-trucks/advice/dos-and-donts-of-car-buying</p><p class=\"\">https://www.consumerreports.org/buying-a-car/dos-and-donts-when-buying-a-car-from-a-dealer-a5825423505/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SPONSORED CONTENT</strong></p><p class=\"\">About OneMain Financial</p><p class=\"\">View Website</p><p class=\"\">OneMain Financial is the leader in offering nonprime customers responsible access to credit and is dedicated to improving the financial well-being of hardworking Americans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACT:</strong></p><p class=\"\">Sonakshi Murze</p><p class=\"\">Manager</p><p class=\"\">sonakshi.murze@iquanti.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> OneMain Financial</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSrxx1Za:0/",
            "pub_date": "2025-02-06 01:04:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310307:0",
            "title": "SOL Global Receives Second Advance Under $4 Million Debenture Unit Financing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SOL Global Investments (SOL.CN) on Wednesday said it received the second advance in full, under its previously closed fully subscribed $4-million private placement offering of units announced on Jan. 21. </p><p class=\"\">Subscribers under the offering had agreed to buy $4 million of units under their subscription agreements, in four equal advances of $1 million each, with the third and fourth advances expected to be advanced to the company on Feb. 18, and March 4, respectively. </p><p class=\"\">Each unit consists of one $1,000 principal amount unsecured convertible debenture, and 1,818 share purchase warrants. </p><p class=\"\">SOL Global intends to use 75% of proceeds to buy Solana Tokens at prevailing market prices through reputable cryptocurrency exchanges and the remaining proceeds for working capital and general corporate purposes. </p><p class=\"\">Shares of the company were last seen down $0.025, or 7%, at $0.32 on the Canadian Securities Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310307:0/",
            "pub_date": "2025-02-06 01:04:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446800:0",
            "title": "European Stocks Rise on Earning Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">European markets reversed losses to close higher on Wednesday, driven by strong earnings across various sectors.</p><p class=\"\">The Stoxx 50 rose 0.1%, while the broader Stoxx 600 gained 0.4%.</p><p class=\"\">Traders assessed earnings reports from companies like Handelsbanken, AkzoNobel, and Credit Agricole.</p><p class=\"\">Banco Santander led the Stoxx 600 with a 7% gain after posting record quarterly profits.</p><p class=\"\">Pharmaceutical giant GSK climbed 6% after raising its long-term sales forecast and reporting higher full-year core operating profits.</p><p class=\"\">Denmark’s Novo Nordisk rose nearly 3% after exceeding fourth-quarter profit estimates, fueled by strong demand for its obesity drugs.</p><p class=\"\">French oil major TotalEnergies also outperformed expectations, despite a 21% drop in full-year adjusted net income, with shares up 1.7%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446800:0-european-stocks-rise-on-earning-reports/",
            "pub_date": "2025-02-06 01:04:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSBMnFYa:0",
            "title": "Nexscient(R) Signs LOI for Acquisition of Generative AI Application",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">AI-Powered Media Toolkit for Content Creation</strong></em></p><p class=\"\">LOS ANGELES, CA / ACCESS Newswire / February 5, 2025 / Nexscient, Inc. (OTCQB:NXNT), a leading innovator in artificial intelligence (\"AI\") applications and intelligent enterprise solutions, today announced the signing of a non-binding Letter of Intent (\"LOI\") to acquire AI Media Toolkit, a software application that offers seamless access to a consolidated array of Generative AI (\"GenAI\") tools.</p><p class=\"\">Facilitated by its NXNT Labs division, Nexscient plans to incorporate AI Media Toolkit into a Software-as-a-Service (\"SaaS\") platform that will offer clients a flexible subscription service to a unified suite of GenAI tools. The SaaS platform expects to deliver a simplified user experience, allowing subscribers to access advanced GenAI capabilities, such as text generation, image creation, video synthesis, and audio production, all through an intuitive interface. This approach eliminates the need for expensive infrastructure or extensive technical expertise, enabling organizations to quickly integrate AI-driven solutions into their workflows. Additionally, the subscription model will offer businesses the ability to scale their usage based on demand, making it a cost-effective solution for enterprises navigating the dynamic landscape of content creation.</p><p class=\"\">\"The addition of AI Media Toolkit to our portfolio marks a significant milestone in our mission to revolutionize enterprise solutions with cutting-edge artificial intelligence,\" stated Fred E. Tannous, CEO of Nexscient, Inc. \"As the demand for GenAI tools continues to grow, this strategic move positions Nexscient as a key player in enabling businesses to harness the power of AI for seamless, efficient, and innovative content creation. We are excited about the opportunities this acquisition will bring, not only for our company but also for the industries we serve.\"</p><p class=\"\">The demand for AI-powered content creation tools has surged in recent years, driven by the rapid expansion of digital media, e-commerce, and personalized marketing. According to a research report published by Custom Market Insights, the Global AI Powered Content Creation Market was valued at $2.3 Billion in 2024 and is expected to reach $7.9 Billion by 2033, growing at a Compounded Annual Growth Rate (\"CAGR\") of 7.7% during the forecast period, reflecting the growing reliance on advanced technologies to meet the needs of a dynamic and competitive digital landscape. Businesses are increasingly seeking scalable, cost-effective solutions to generate high-quality content for social media, websites, advertising campaigns, and customer engagement.</p><p class=\"\">By offering the AI Media Toolkit as a unified subscription service, Nexscient is not only simplifying access to cutting-edge AI tools but also building a recurring revenue stream that supports the company's long-term growth strategy. This move further underscores Nexscient's dedication to democratizing AI technologies and empowering enterprises to achieve greater creativity, efficiency, and scalability in their content creation processes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nexscient, Inc.</strong></p><p class=\"\">Nexscient® is an emerging-growth company that's building a collaborative network of intelligent enterprise applications and technologies through internal development, synergistic acquisitions, and capital investments in companies involved in machine learning, artificial intelligence, and the Industrial Internet of Things technologies. Our flagship product, AegisOne, introduces a subscription-based, Software-as-a-Service platform that incorporates innovative technologies to offer intelligent enterprise solutions for businesses across several industries. As part of our growth strategy, we also seek to acquire and integrate synergistic companies and technologies into our collaborative network, further expanding our service offerings while enhancing shareholder value. For more information, please visit https://nexscient.ai.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release contains statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements appear in a number of places in this release and include all statements that are not statements of historical fact regarding the intent, belief or current expectations of Nexscient, Inc., its directors or its officers with respect to, among other things: (i) financing plans; (ii) trends affecting its financial condition or results of operations; (iii) growth strategy and operating strategy; and (iv) performance of our products and services. You can identify these statements by the use of the words \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimate,\" \"project,\" \"intend,\" \"likely,\" \"forecast,\" \"probable,\" \"potential,\" and similar expressions and variations thereof are intended to identify forward-looking statements. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, many of which are beyond Nexscient, Inc.'s ability to control, and actual results may differ materially from those projected in the forward-looking statements as a result of various factors. These risks and uncertainties also include such additional risk factors as are discussed in the Company's filings with the U.S. Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended June 30, 2024, Forms 10-Q and 8-K, and in other filings we make with the Securities and Exchange Commission from time to time. These documents are available on the SEC Filings section of the Investor Relations section of our website at https://nexscient.ai. The Company cautions readers not to place undue reliance upon any such forward-looking statements, which speak only as of the date made. The Company undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date on which such statement is made.</p><p class=\"\">#######</p><p class=\"\">COMPANY CONTACT:</p><p class=\"\">Investor Relations</p><p class=\"\">ir@nexscient.com</p><p class=\"\">(800) 785-6070</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Nexscient, Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSBMnFYa:0/",
            "pub_date": "2025-02-06 01:04:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSK0Cvka:0",
            "title": "St. George's University Announces New Admissions Partnership with McMaster University's W Booth School",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TRUE BLUE, GRENADA AND HAMILTON, ON / ACCESS Newswire / February 5, 2025 / St. George's University (SGU) has launched a new admissions partnership with the W Booth School in the Faculty of Engineering at McMaster University. This partnership will grant qualified BTech Biotechnology students fast-track admission into the St. George's University School of Medicine.</p><p class=\"\">\"St. George's University is delighted to offer this new opportunity for aspiring doctors from the W Booth School to pursue degrees in medicine with us,\" said Dr. Marios Loukas, Dean of St. George's University School of Medicine. \"SGU is tremendously proud to partner with the W Booth School to create more avenues for qualified Canadian students to become practicing physicians while helping to address Canada's ongoing physician shortage.\"</p><p class=\"\">The partnership creates a BTech in Biotechnology to Doctor of Medicine pathway that provides students who have successfully completed the Bachelor of Technology in Biotechnology at the W Booth School and meet the requirements for entry with admission to the four-year MD program at SGU. Booth students interested in pursuing the pathway must maintain a strong overall GPA and a strong GPA in prerequisite coursework.</p><p class=\"\">Qualified students will be eligible to complete the basic sciences component of the SGU MD program in either two years of study in Grenada or one year at Northumbria University in the United Kingdom and one year in Grenada. Students' clinical rotations will take place with SGU's affiliate network of more than 75 hospitals and health systems in the United States, Canada, and the United Kingdom offering clinical and ambulatory training.</p><p class=\"\">\"This opportunity significantly broadens the academic and career horizons for our BTech-Biotechnology graduates, offering invaluable global experience,\" says Heather Sheardown, Dean of Engineering at McMaster. \"We eagerly anticipate our first alumni embarking on this journey, gaining the academic and practical expertise needed to make meaningful contributions to healthcare.\"</p><p class=\"\">BTech Biotechnology students who are accepted into the pathway with a sufficiently high overall GPA and sciences GPA will be awarded a scholarship of US $85,000 at SGU School of Medicine. Students will also be eligible to be considered for all of SGU's School of Medicine scholarships. SGU granted more than US $71 million in scholarships in the 2023-2024 academic year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About St. George's University</strong></p><p class=\"\">St. George's University is a center of international education, drawing students and faculty from 140 countries to the island of Grenada, in the West Indies, to its programs in medicine, veterinary medicine, public health, science, and business. SGU is affiliated with educational institutions worldwide, including the United States, the United Kingdom, Canada, Australia, Ireland, and the Netherlands. The University's over 28,000 graduates include physicians, veterinarians, scientists, and public health and business professionals across the world. St. George's University School of Medicine is accredited by the Grenada Medical and Dental Council, which has been recognized by the World Federation for Medical Education (WFME). For more information, visit www.sgu.edu.</p><p class=\"\">About McMaster University — Faculty of Engineering</p><p class=\"\">The Faculty of Engineering plays a key role in helping McMaster University earn its reputation as one of Canada's most innovative and research-intensive universities. McMaster Engineering has a reputation for groundbreaking programs and research, leading faculty and aspiring students. It attracts around $44 million in annual research funding in more than 20 research centres, institutes, and networks whose interdisciplinary pursuits cross departmental and Faculty boundaries. Outside the university, the Faculty of Engineering collaborates with partners in universities, government and more than 130 companies in Canada and abroad.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact (SGU):</strong></p><p class=\"\">Evan Cobb</p><p class=\"\">ecobb@sgu.edu</p><p class=\"\">(203) 606-3127</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact (W Booth School):</strong></p><p class=\"\">Keiko Kataoka</p><p class=\"\">kataokak@mcmaster.ca</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> St. George's University</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSK0Cvka:0/",
            "pub_date": "2025-02-06 01:04:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008561:0",
            "title": "Stockholm Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX Stockholm 30 Index      2,629.11      -9.36      -0.35 <br/>  Index Components <br/>  ABB                           591.40      -5.80      -0.97 <br/>  Alfa Laval                    473.60     -14.20      -2.91 <br/>  Assa Abloy Series B           329.50      -4.10      -1.23 <br/>  AstraZeneca                 1,524.50      +2.50      +0.16 <br/>  Atlas Copco A                 184.80      -0.40      -0.22 <br/>  Atlas Copco Series B          163.05      -0.90      -0.55 <br/>  Boliden                       333.20      -1.30      -0.39 <br/>  Electrolux Series B            95.72      -1.02      -1.05 <br/>  Ericsson B                     82.94      -0.28      -0.34 <br/>  Essity Series B               275.40      -0.40      -0.15 <br/>  Evolution Gaming Group        829.40     -12.60      -1.50 <br/>  Getinge Series B              215.20      +0.70      +0.33 <br/>  H&amp;M Hennes &amp; Mauritz B        148.00      -0.30      -0.20 <br/>  Hexagon Series B              126.50      -2.85      -2.20 <br/>  Investor Series B             308.65      +1.95      +0.64 <br/>  Kinnevik Series B              89.91      +2.43      +2.78 <br/>  Nibe Industrier Series B       43.61      +0.12      +0.28 <br/>  Nordea Bank                   127.70      -0.85      -0.66 <br/>  Saab AB Series B              238.30      +0.65      +0.27 <br/>  Samhaellsbyggnadsbolaget        5.52      +0.09      +1.73 <br/>  Sandvik                       223.60      -3.00      -1.32 <br/>  Sinch                          24.14      +0.55      +2.33 <br/>  Skandinaviska Enskilda A      156.00      +0.05      +0.03 <br/>  SKF Series B                  214.10      -4.30      -1.97 <br/>  Svenska Cellulosa Ser B       151.60      -0.40      -0.26 <br/>  Svenska Handelsbnkn Ser A     123.90      +2.00      +1.64 <br/>  Swedbank Series A             241.20      +1.40      +0.58 <br/>  Tele2 Series B                122.85      +1.30      +1.07 <br/>  Telia                          33.55      +0.77      +2.35 <br/>  Volvo Series B                305.20      -1.90      -0.62 <br/>Prices in Swedish Krona <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008561:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008557:0",
            "title": "Oslo Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Oslo Stock Exch Equity      1,415.16      -6.87      -0.48 <br/>  Index Components <br/>  Norsk Hydro                    66.10      -0.28      -0.42 <br/>  Tomra Systems                 165.90      +1.30      +0.79 <br/>  Storebrand                    131.80      -0.90      -0.68 <br/>  DnB Bank                      243.00      +2.80      +1.17 <br/>  Kongsberg Gruppen           1,310.00     -16.00      -1.21 <br/>  Nordic Semiconductor          136.10     +23.75     +21.14 <br/>  Subsea 7                      187.90      +0.30      +0.16 <br/>  Mowi                          217.50      -1.70      -0.78 <br/>  Frontline                     206.00      -3.60      -1.72 <br/>  Orkla                         102.60      -0.10      -0.10 <br/>  TGS                           111.00      -0.80      -0.72 <br/>  Telenor                       138.40      -0.50      -0.36 <br/>  Equinor                       266.35     -11.45      -4.12 <br/>  Norwegian Air Shuttle          10.40      -0.19      -1.79 <br/>  Yara International            335.10      -1.50      -0.45 <br/>  Aker BP                       245.00      +4.20      +1.74 <br/>  SalMar                        572.00      +1.00      +0.18 <br/>  Wallenius Wilhelmsen           90.40      -1.00      -1.09 <br/>  Gjensidige Forsikring         232.00      -2.40      -1.02 <br/>  BW LPG                        147.50      +1.40      +0.96 <br/>  MPC Container Ships            18.48      -0.37      -1.96 <br/>  Hafnia                         60.75      -1.50      -2.41 <br/>  Hoegh Autoliners              102.70      -1.80      -1.72 <br/>  Var Energi                     34.57      -0.40      -1.14 <br/>  Golden Ocean Group            105.00      -1.25      -1.18 <br/>Prices in Krone <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008557:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008555:0",
            "title": "Madrid Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  Banco Santander               110,472,696         5.40        +0.41        +8.29 <br/>  Urbas Grupo Financiero         31,229,000         0.00         unch         unch <br/>  Banco de Sabadell              13,870,091         2.28        +0.01        +0.26 <br/>  Unicaja Banco                   8,231,304         1.46        +0.01        +0.97 <br/>  Amper                           7,474,577         0.13        +0.00        +1.75 <br/>  CaixaBank                       7,192,154         5.90        -0.04        -0.71 <br/>  Intl Consld Airlines Grp        7,150,331         4.22        +0.04        +1.00 <br/>  BBVA                            6,888,527        11.03        +0.03        +0.27 <br/>  Telefonica                      6,458,427         3.98        +0.06        +1.48 <br/>  Iberdrola                       5,334,011        13.78        +0.09        +0.62 <br/>  Obrascon Huarte Lain            4,957,602         0.36        +0.00        +0.44 <br/>  Repsol                          3,119,539        11.45        -0.04        -0.30 <br/>  Mapfre                          2,226,502         2.71        +0.04        +1.50 <br/>  Nyesa Valores                   2,215,900         0.01         0.00        -3.45 <br/>  Grifols                         1,941,837         8.28        +0.16        +1.95 <br/>  Sacyr                           1,924,306         3.19        -0.04        -1.12 <br/>  Bankinter                       1,790,937         8.16        -0.02        -0.29 <br/>  Industria Diseno Textil         1,625,178        52.16        -0.18        -0.34 <br/>  Indra Sistemas                  1,417,448        16.60        -0.25        -1.48 <br/>  Redeia                          1,215,238        16.63        +0.18        +1.09 <br/>  Enagas                          1,071,108        12.24        -0.06        -0.49 <br/>  Solaria Energia y Medio         1,019,344         7.79        +0.05        +0.65 <br/>  Endesa                            994,925        22.01        +0.22        +1.01 <br/>  Airtificial Intelligence          993,917         0.11        +0.00        +0.38 <br/>  Tubos Reunidos                    987,802         0.56         unch         unch <br/>  Cellnex Telecom                   865,109        32.50        +0.53        +1.66 <br/>  Acerinox                          741,364         9.90        +0.09        +0.92 <br/>  Prosegur Cash                     707,678         0.58        +0.01        +1.21 <br/>  Ferrovial                         688,381        40.76        -0.06        -0.15 <br/>  Tubacex                           569,576         3.60        +0.02        +0.42 <br/>  Grupo Ezentis                     532,405         0.10         0.00        -1.04 <br/>  ENCE Energia y Celulosa           515,697         3.49        -0.03        -0.91 <br/>  Gestamp Automocion                477,803         2.59        -0.03        -1.15 <br/>  Tecnicas Reunidas                 477,406        14.75        +0.78        +5.58 <br/>  Amadeus IT Group                  425,192        72.00        +0.60        +0.84 <br/>  Linea Directa Aseguradora         372,468         1.24        +0.02        +1.80 <br/>  Acciona Energias Renovbl          334,258        18.26        +0.37        +2.07 <br/>  Nueva Expresion Textil            329,852         0.37        -0.01        -1.34 <br/>  Fluidra                           308,058        23.28        -0.36        -1.52 <br/>  Faes Farma                        264,028         3.57        +0.01        +0.42 <br/>  Melia Hotels Intl                 257,412         7.18        -0.13        -1.78 <br/>  Puig Brands                       252,147        18.31        +0.01        +0.05 <br/>  Talgo                             248,492         3.91        -0.04        -1.01 <br/>  ACS Activ Construccion            213,526        48.94        -0.12        -0.24 <br/>  Logista Integral                  206,660        29.46        +0.20        +0.68 <br/>  Naturgy Energy Group              196,152        24.48        -0.20        -0.81 <br/>  Deoleo                            186,598         0.19        +0.00        +0.78 <br/>  Atresmedia                        176,556         4.51        +0.00        +0.11 <br/>  Audax Renovables                  167,530         1.51        -0.01        -0.53 <br/>  ArcelorMittal                     167,479        24.37        +0.16        +0.66 <br/>Prices in Euros <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008555:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008554:0",
            "title": "Madrid Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  IBEX 35 Index              12,536.70    +163.90      +1.32 <br/>  Index Components <br/>  Acciona                       109.80      +1.30      +1.20 <br/>  Acciona Energias Renovbl       18.26      +0.37      +2.07 <br/>  Acerinox                        9.90      +0.09      +0.92 <br/>  ACS Activ Construccion         48.94      -0.12      -0.24 <br/>  Aena SME                      212.00      +3.40      +1.63 <br/>  Amadeus IT Group               72.00      +0.60      +0.84 <br/>  ArcelorMittal                  24.37      +0.16      +0.66 <br/>  Banco de Sabadell               2.28      +0.01      +0.26 <br/>  Banco Santander                 5.40      +0.41      +8.29 <br/>  Bankinter                       8.16      -0.02      -0.29 <br/>  BBVA                           11.03      +0.03      +0.27 <br/>  CaixaBank                       5.90      -0.04      -0.71 <br/>  Cellnex Telecom                32.50      +0.53      +1.66 <br/>  Enagas                         12.24      -0.06      -0.49 <br/>  Endesa                         22.01      +0.22      +1.01 <br/>  Ferrovial                      40.76      -0.06      -0.15 <br/>  Fluidra                        23.28      -0.36      -1.52 <br/>  Grifols                         8.28      +0.16      +1.95 <br/>  Iberdrola                      13.78      +0.09      +0.62 <br/>  Indra Sistemas                 16.60      -0.25      -1.48 <br/>  Industria Diseno Textil        52.16      -0.18      -0.34 <br/>  Inmobiliaria Colonial           5.47      +0.08      +1.39 <br/>  Intl Consld Airlines Grp        4.22      +0.04      +1.00 <br/>  Laboratorios Farma Rovi        65.70      +0.45      +0.69 <br/>  Logista Integral               29.46      +0.20      +0.68 <br/>  Mapfre                          2.71      +0.04      +1.50 <br/>  Merlin Properties SOCIMI       11.15      +0.20      +1.83 <br/>  Naturgy Energy Group           24.48      -0.20      -0.81 <br/>  Puig Brands                    18.31      +0.01      +0.05 <br/>  Redeia                         16.63      +0.18      +1.09 <br/>  Repsol                         11.45      -0.04      -0.30 <br/>  Sacyr                           3.19      -0.04      -1.12 <br/>  Solaria Energia y Medio         7.79      +0.05      +0.65 <br/>  Telefonica                      3.98      +0.06      +1.48 <br/>  Unicaja Banco                   1.46      +0.01      +0.97 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008554:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008550:0",
            "title": "ICE Canola Market Weakens at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WINNIPEG, Manitoba--The ICE Futures canola market was weaker at midday Wednesday, taking back Tuesday's gains as losses in outside markets weighed on values.</p><p class=\"\">Sharp declines in crude oil spilled into world vegetable oil markets on Wednesday, with Chicago soyoil, European rapeseed and Malaysian palm oil all lower.</p><p class=\"\">The temporary pause on tariff threats from the United States remained somewhat supportive, although the likelihood of continued chaos from the Trump administration kept some caution in all markets.</p><p class=\"\">Solid end user demand and tightening supply projections provided underlying support for canola, with values also holding above most major moving averages from a chart standpoint.</p><p class=\"\">An estimated 19,500 canola contracts traded as of 11:53 ET.</p><p class=\"\">Prices in Canadian dollars per metric tonne at 11:53 ET:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>           Price      Change <br/>Mar       637.60     dn 9.60 <br/>May       645.50     dn 9.00 <br/>Jul       650.50     dn 8.60 <br/>Nov       636.30     dn 6.70 <br/> </pre><p class=\"\">Source: Commodity News Service Canada, news@marketsfarm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008550:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008553:0",
            "title": "Helsinki Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX Helsinki 25 Index       4,521.15     +10.83      +0.24 <br/>  Index Components <br/>  Huhtamaki                      34.70      -0.46      -1.31 <br/>  Kesko Series B                 17.44      -1.00      -5.42 <br/>  Kone B                         49.43      +0.39      +0.80 <br/>  Metsa Board Series B            4.55      -0.08      -1.73 <br/>  Wartsila                       19.29      +1.36      +7.59 <br/>  Nokia                           4.58      +0.07      +1.55 <br/>  Sampo Series A                 39.36       unch       unch <br/>  TietoEVRY                      18.42      +0.02      +0.11 <br/>  Kemira Oyj                     21.06      -0.12      -0.57 <br/>  Nokian Renkaat                  6.22      -0.62      -9.04 <br/>  Konecranes                     58.35      -0.15      -0.26 <br/>  UPM-Kymmene                    27.40      -0.54      -1.93 <br/>  Outokumpu Oyj                   3.08      -0.01      -0.29 <br/>  Stora Enso R                   10.40      -0.16      -1.52 <br/>  Fortum                         14.06      +0.15      +1.04 <br/>  Elisa                          42.44      +0.88      +2.12 <br/>  Nordea Bank                    11.26      -0.04      -0.31 <br/>  Neste                          11.75      -0.16      -1.34 <br/>  Cargotec                       47.25      -0.12      -0.25 <br/>  Orion Series B                 52.28      +0.62      +1.20 <br/>  Metso                           9.24      -0.15      -1.56 <br/>  Valmet                         25.96      +0.13      +0.50 <br/>  QT Group                       80.00      +0.95      +1.20 <br/>  Kojamo                         10.01      +0.18      +1.83 <br/>  Mandatum                        4.75      +0.03      +0.68 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008553:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE1dm5n:0",
            "title": "From Emerging Markets to Heritage Architecture, the Christie’s International Real Estate Global Luxury Forecast Reveals Themes Shaping Luxury Real Estate in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Annual report features insight and predictions from Christie’s International Real Estate affiliates around the world</p><p class=\"\">CHICAGO, Feb.  05, 2025  (GLOBE NEWSWIRE) — 2025 will bring a shift toward heritage architectural styles, a heightened interest in security and privacy, and a spotlight on up-and-coming markets including Madrid and the Balkans, according to the Christie’s International Real Estate 2025 Global Luxury Forecast.  </p><p class=\"\">Unveiled today, the annual report examines key trends and factors shaping the global luxury real estate market, with insights from broker-owners and leading agents within the network of more than 100 independent brokerage firms around the world.   </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Headlines from the 2025 forecast include:</strong> </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A growing emphasis on home security:</strong> Home security is of growing importance in the luxury market, and homeowners are adding both high-tech and analog amenities like intelligent camera systems, radar systems for waterfront homes, ballistic entry doors, biometrics and private neighborhood security details. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A move toward “heritage architecture”:</strong> Today’s high-net-worth buyers are expressing a renewed preference for architectural styles that reflect the history and natural qualities of their surroundings versus modern forms that have dominated new-home construction over the past decade plus. Examples include rustic homes in mountainous regions in the U.S., and Victorian and Regency designs in the U.K.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The impact of a changing climate:</strong> Well before the outbreak of the devastating Los Angeles wildfires, brokers and agents had identified climate-related events as having a major impact on the luxury market in 2025. Brokerage affiliates in San Francisco, Dubai, Naples, Fla., and Geneva, Switzerland, share how climate issues are affecting homebuying, and the ways governments and builders are planning for the future. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025’s hottest trends and amenities: </strong>Around the world, infrared saunas, car showrooms, and toy barns are set to top the list of must-have amenities for luxury homes in the coming year. In addition, biophilic design is becoming more sought after as HNWIs focus on environmental impact and healthy living.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Emerging luxury markets:</strong> Madrid, Perth, the Balkan nations of Albania and Bulgaria, and Monmouth County, New Jersey make the list of 2025’s up-and-coming markets to watch, enticing luxury home buyers and investors with local incentives, relative value, and strong potential for appreciation and return on investment.   </p><p class=\"\">The report also takes a look at the Christie’s International Real Estate network’s most significant home sales in 2024 and the market trends they underscore. These include the sale of a record-breaking $152 million private island in Palm Beach, Fla., a $36 million countryside estate in England, and a $90 million Los Angeles mansion purchased with Bitcoin.  </p><p class=\"\">“Global luxury real estate is thriving, and always evolving,” said Thad Wong, co-CEO of Christie’s International Real Estate. “We hope that these insights, shared by the experts who know their markets inside and out and are able to spot trends early will empower buyers and sellers to make confident, well-informed decisions in today’s market and beyond.” </p><p class=\"\">Findings in the Christie’s International Real Estate 2025 Global Luxury Forecast are based on a survey of independent Christie’s International Real Estate affiliates across North America, the Caribbean, Europe, the Middle East, Africa and Asia. </p><p class=\"\">### </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Christie’s International Real Estate</strong>  </p><p class=\"\">Christie’s International Real Estate has successfully marketed high-value real estate around the world for more than 30 years. Through its invitation-only Affiliate network spanning nearly 50 countries and territories, Christie’s International Real Estate offers incomparable services to a global clientele at the luxury end of the residential property market. For more information, please visit christiesrealestate.com.  </p><p class=\"\">Christie’s International Real Estate operates as a distinct luxury brand under the ownership of Compass , the largest residential real estate brokerage in the United States by sales volume. Founded in 2012 and based in New York City, Compass provides an end-to-end platform that empowers residential real estate agents to deliver exceptional service to seller and buyer clients. For more information, please visit www.compass.com. </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">1041 Lakeshore Boulevard, Lake Tahoe, Nevada      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE1dm5n:0-from-emerging-markets-to-heritage-architecture-the-christie-s-international-real-estate-global-luxury-forecast-reveals-themes-shaping-luxury-real-estate-in-2025/",
            "pub_date": "2025-02-06 01:05:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310286:0",
            "title": "Update: FirstService Down 4% as Q4 Earnings Miss Estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates shares.)</p><p class=\"\">FirstService  share were last seen down lost 4.3% after the company on Wednesday reported fourth-quarter results that missed analysts' forecasts. </p><p class=\"\">The company booked adjusted earnings of US$1.34 per share, below the FactSet projection of US$1.37 per share but higher than US$1.11 per share reported a year ago. </p><p class=\"\">FirstService's GAAP EPS stood at US$0.71, missing the FactSet estimate of US$0.89 but an increase from US$0.14 posted in the previous year. </p><p class=\"\">Revenue rose to US$1.37 billion in the three months ended Dec. 31 from $1.08 billion in the same quarter of the previous year. Adjusted EBITDA increased to US$137.9 million from US$103.3 million. </p><p class=\"\">\"Our teams were focused on driving healthy profitable growth which is reflected in the strong top-line and improved margins year,\" CEO Scott Patterson said. \"This momentum and continued operational execution reinforces our expectations for a strong 2025.\"</p><p class=\"\">The company's shares were last seen down $11.23 to $249.34 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310286:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008386:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1159 ET - The threat of U.S. tariffs on imports from its northern neighbor brought out waves of calls on social media for Canadians to buy local products in place of American goods. Canada's largest private sector union wants to go further, and has written to the country's largest grocery chains urging them to buy Canadian. Unifor in a letter to the CEOs of Empire, Loblaw and Metro encouraged them to prioritize Canadian products in response to President Trump's threatened levies. It also wants grocers to make it easier for consumers to prioritize Canadian items on their shelves, supporting domestic industries and jobs. \"Canadian workers and their families are ready to defend against the Trump tariff threat and we need Canadian grocers to do their part,\" says Unifor national President Lana Payne. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">1156 ET - Stanley Black &amp; Decker had a mixed quarter in which a big tax benefit drove its earnings beat, Edward Jones analyst Faisal Hersi says in a research note. Organic revenue was higher than anticipated, which was a nice surprise, but operating profitability fell short of expectations, even as it improved sequentially due to the company's cost-cutting efforts and improving supply-chain expenses, Hersi says. The tool market is still choppy and do-it-yourself work remains weak, while professional demand is solid, the analyst says. He expects mixed demand across the company's markets to persist near-term, though tools volume should keep recovering this year. Shares fall 2% to $84.97. (dean.seal@wsj.com)</p><p class=\"\">1153 ET - The market's stock reaction to PayPal earnings was overblown, especially considering underlying numbers such as transaction margin dollar growth, Bernstein analysts say in a research note. The digital-payments company also continued growing incrementality of many initiatives such as modern experiences, debit cards and Venmo. \"These initiatives, along with consumer habituation drivers such as debit cards, can support Branded volume growth in 2025,\" the analysts say. Overall, PayPal appears to be under more solid footing under the new management team, the analysts add, noting that they expect slightly more favorable risk-reward in the near-term. Shares rise 2.2% following a 13% drop on Tuesday. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">1149 ET - Finning International's answers to the threat of U.S. tariffs will be to reduce its cost profile. In an earnings call, executives said that its response to the near-term market environment of slower growth and higher uncertainty, \"we are focused on managing working capital levels and evaluating opportunities to create further sustainable cost efficiency.\" In particular, the focus will be to improve the cost-structure in Canada. And the company already has good model to follow: \"leveraging the structural changes and overhead reduction strategy demonstrated in our U.K. operations.\" (adriano.marchese@wsj.com)</p><p class=\"\">1139 ET - Griffon CEO Ronald Kramer says on a call with analysts that he's comfortable backing the company's 2025 outlook, calling the tariff situation extremely fluid. \"Similar to tariffs in 2018, we expect to mitigate the effects of changing tariff policy through a combination of price, supply renegotiations and further diversifying our global supply chain,\" he says. The company has \"significant amounts\" of product coming from China in its lawn and garden and Hunter Fan businesses, but those are the only area where tariffs could have an effect, Kramer adds. Shares rise 10% after reporting better-than-expected earnings in its fiscal 1Q. (connor.hart@wsj.com)</p><p class=\"\">1131 ET - Inflated cocoa costs melted into Mondelez International's earnings in 4Q, and they are likely too large to be fully offset by raising prices, Edward Jones analyst Brittany Quatrochi says. The snack maker's 2025 outlook was more disappointing than expected, with adjusted earnings per share set to fall 10%. Underlying sales growth remains solid across regions, despite cocoa prices pulling down operating income across the globe by 28%. Mondelez said in an earnings call it plans to raise prices, but low-cost distribution will be especially crucial for emerging international markets as the company generates about 70% of its sales outside of North America, Quatrochi says. Shares rise 1.7%. (katherine.hamilton@wsj.com)</p><p class=\"\">1124 ET - Mondelez International expects adjusted earnings per share to fall 10% in 2025 due to elevated cocoa costs, after the snack maker said operating income declined 28% in the fourth quarter primarily due to that inflation. If chocolate costs remain high, Mondelez plans to gradually increase prices in the second half of this year, especially in developed markets, but the company said consumer confidence is still rocky, which could pose challenges to its pricing plan. Chief financial officer Luca Zaramella said he expects earnings per share to grow again in 2026, either from price increases or cocoa costs normalizing. (katherine.hamilton@wsj.com)</p><p class=\"\">1120 ET - Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p><p class=\"\">1112 ET - Home Depot and Lowe's might report a better 4Q than Wall Street expects given recent results from the home-improvement chains' suppliers, Stanley Black &amp; Decker, Sherwin-Williams and Scotts Miracle-Gro, Davidson analyst Michael Baker says in a research note. Stanley Black &amp; Decker reports 2% organic growth in tools and outdoor products, an improvement from the 4% decline last quarter and the best increase since 2Q of 2021, the analyst says. Sherwin-Williams' consumer brands business, which is Lowe's main paint supplier, was flat in North America instead of down in the high-single digit percentage range like the three prior quarters, he says. And Scotts Miracle-Gro showed an acceleration of its gains from the prior quarter, the analyst says. (dean.seal@wsj.com)</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">1025 ET - GSK's 2025 outlook is promising, fueled by the sales growth expectations for its specialty medicines, Quilter Cheviot healthcare analyst Sheena Berry says in a note. The British pharma giant's clinical results for its chronic-cough drug candidate and regulatory decisions on a potential comeback of its blood-disorder treatment Blenrep are crucial for the group's future trajectory, she says. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008386:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008384:0",
            "title": "Canadian Private-Sector Union Pushes Grocers to Prioritize Local Items — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The threat of U.S. tariffs on imports from its northern neighbor brought out waves of calls on social media for Canadians to buy local products in place of American goods. Canada's largest private sector union wants to go further, and has written to the country's largest grocery chains urging them to buy Canadian. Unifor in a letter to the CEOs of Empire, Loblaw and Metro encouraged them to prioritize Canadian products in response to President Trump's threatened levies. It also wants grocers to make it easier for consumers to prioritize Canadian items on their shelves, supporting domestic industries and jobs. \"Canadian workers and their families are ready to defend against the Trump tariff threat and we need Canadian grocers to do their part,\" says Unifor national President Lana Payne. (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008384:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0ZQ:0",
            "title": "Wall Street mixed, Treasury yields slide amid mixed earnings, data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Alphabet earnings weigh on AI stocks</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Record U.S. imports widens trade gap, services weaken</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Wall Street struggled for direction and benchmark Treasury yields slid on Wednesday as disappointing earnings and mixed economic data counterbalanced easing jitters of a spreading global trade war.</p><p class=\"\">The S&amp;P 500 joined the tech-heavy Nasdaq in negative territory in the wake of disappointing earnings from Alphabet  fueled doubts about the payoff of investment in artificial intelligence. </p><p class=\"\">Simmering in the background are worries of escalating tit-for-tat tariff moves.</p><p class=\"\">\"We think the leaders of other countries don't really understand Trump's art of the deal,\" said Jay Hatfield, CEO and portfolio manager at InfraCap in New York. \"The threat of 25% was not meant to be the real tariff rate.\"</p><p class=\"\">\"We think the tariffs are quite bullish for the stock market,\" Hatfield added, saying that 5% or 10% tariffs across the board \"will fund a major corporate tax decrease.\" </p><p class=\"\">Markets appeared to look past President Donald Trump's eyebrow raising declaration that the United States would take over the Gaza Strip, a move underscored the likelihood of market volatility under the new administration.</p><p class=\"\">On the economic front, a stronger-than-expected ADP reading was offset by a surprise deceleration in the services sector, while record high imports pushed the U.S. trade deficit sharply wider.   </p><p class=\"\">        The Dow Jones Industrial Average  rose 71.80 points, or 0.16%, to 44,628.41, the S&amp;P 500  fell 0.02 points, or 0.00%, to 6,037.71 and the Nasdaq Composite  fell 42.30 points, or 0.21%, to 19,612.17.</p><p class=\"\">European stocks reversed an early selloff and were last higher, powered in part by healthcare stocks as Novo Nordisk's  blockbuster drug Wegovy sales more than doubled in the fourth quarter. </p><p class=\"\">        MSCI's gauge of stocks across the globe <!-- -->EURONEXT:IACWI<!-- --> rose 2.27 points, or 0.26%, to 869.19.</p><p class=\"\">The STOXX 600  index rose 0.36%, while Europe's broad FTSEurofirst 300 index (.FTEU3) rose 7.22 points, or 0.34% Emerging market stocks <!-- -->CBOE:EFS<!-- --> rose 3.55 points, or 0.32%, to 1,096.53. MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) closed higher by 0.45%, to 576.91, while Japan's Nikkei  rose 33.11 points, or 0.09%, to 38,831.48.</p><p class=\"\">U.S. Treasury yields dropped to their lowest level since mid-December in the wake of the disappointing services data, as investors continue to grapple with uncertainties arising from tariff skirmishes.</p><p class=\"\">        The yield on benchmark U.S. 10-year notes  fell 8.9 basis points to 4.424%, from 4.513% late on Tuesday. The 30-year bond (US30YT=RR) yield fell 9.2 basis points to 4.6556% from 4.748% late on Tuesday.</p><p class=\"\">The 2-year note (US2YT=RR) yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 4 basis points to 4.174%, from 4.214% late on Tuesday.</p><p class=\"\">The dollar softened as risk of a global trade war appeared to wane.</p><p class=\"\">The dollar index , which measures the greenback against a basket of currencies including the yen and the euro, fell 0.54% to 107.47, with the euro  up 0.37% at $1.0415. Against the Japanese yen , the dollar weakened 1.31% to 152.31.</p><p class=\"\">The Mexican peso &lt; MXN=&gt; weakened 0.53% versus the dollar at 20.621.</p><p class=\"\">The Canadian dollar  strengthened 0.21% versus the greenback to C$1.43 per dollar.</p><p class=\"\">        In cryptocurrencies, bitcoin  gained 1.24% to $97,701.41. Ethereum (ETH=) rose 4.32% to $2,754.13.</p><p class=\"\">Oil prices dropped as rising U.S. supply and worries of a new Sino-U.S. trade war overshadowed President Trump's renewed effort to eliminate Iranian oil exports.</p><p class=\"\">U.S. crude  fell 2.19% to $71.13 a barrel and Brent  fell to $74.68 per barrel, down 1.99% on the day.</p><p class=\"\">Gold resumed its rally as trade war jitters continue to attract investors to the safe-haven metal, sending it to fresh record highs.</p><p class=\"\">Spot gold  rose 0.97% to $2,869.39 an ounce. U.S. gold futures (GCc1) rose 0.62% to $2,871.10 an ounce.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0ZQ:0-wall-street-mixed-treasury-yields-slide-amid-mixed-earnings-data/",
            "pub_date": "2025-02-06 00:59:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}