{
    "data": [
        {
            "id": "DJN_DN20250204000180_20250204000188:0",
            "title": "Hana Financial Group 4Q Net Profit Missed FactSet-Compiled Consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000188:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000180_20250204000186:0",
            "title": "Hana Financial Group 4Q Net KRW521.10B Vs. Net KRW459.70B >086790.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000186:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000183:0",
            "title": "BNP Paribas: Each Interim Dividend Will Amount to 50% of the Net EPS of 1H",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000183:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000182:0",
            "title": "BNP Paribas: 2025 Semi-annual Interim Dividend to Be Paid out in Late September",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000182:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000181:0",
            "title": "BNP Paribas to Implement a Semi-annual Interim Dividend Starting in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000181:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463203:0",
            "title": "Number of Chinese Private Pension Funds Sales Agencies Grows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The number of China's private pension fund sales agencies increased to 52 in 2024 from 37 in 2022, Xinhua News Agency reported Monday, citing the Asset Management Association of China. </p><p class=\"\">Of the number, 19 are commercial lenders, including the Industrial and Commercial Bank of China  and the Agricultural Bank of China  while 25 are securities firms and eight are independent sales institutions, the report said. </p><p class=\"\">The government piloted its private pension scheme in a number of cities in 2022 and rolled out the program nationwide in December 2024, the report said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463203:0/",
            "pub_date": "2025-02-04 13:53:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463209:0",
            "title": "Bank Albilad Posts Higher FY24 Net Profit, Total Operations Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bank Albilad (SASE:1140) said Tuesday that its net profit and total operations profit for full-year 2024 jumped year over year. </p><p class=\"\">Net profit for the 12 months ended Dec. 31, 2024, was 2.81 billion Saudi riyals, compared with 2.37 billion riyals a year ago. EPS moved to 2.26 riyals from 1.91 riyals. </p><p class=\"\">The Saudi Arabia-listed bank's total operations profit was over 5.67 billion riyals, compared with 5.30 billion riyals earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463209:0/",
            "pub_date": "2025-02-04 13:53:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463210:0",
            "title": "Welspun Enterprises' Consolidated Profit Declines in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Welspun Enterprises'  consolidated profit attributable to shareholders fell to 775 million Indian rupees in the fiscal third quarter from 894.9 million rupees a year earlier, according to a Monday filing by the infrastructure services provider. </p><p class=\"\">Earnings per share for the quarter ended Dec. 31, 2024, dropped to 5.16 rupees from 5.20 rupees in the year-ago period. </p><p class=\"\">Revenue from operations in fiscal Q3 climbed year on year to 8.67 billion rupees from 7.07 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463210:0/",
            "pub_date": "2025-02-04 13:53:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000190:0",
            "title": "UBS: Noncore and Legacy Risk Weighted Assets Reduced by $3B in 4Q",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000190:0/",
            "pub_date": "2025-02-04 13:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000208:0",
            "title": "UBS Backs 2026 Targets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000208:0/",
            "pub_date": "2025-02-04 13:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000211:0",
            "title": "UBS Confirms Financial Targets and Ambitions for 2026 Exit Rate and 2028",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000211:0/",
            "pub_date": "2025-02-04 13:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000180_20250204000210:0",
            "title": "Hana Financial Group 2024 Rev KRW81.629T, Up 17% >086790.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000210:0/",
            "pub_date": "2025-02-04 13:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_JCN95756a:0",
            "title": "Fujitsu launches gen AI software analysis and visualization service to support optimal modernization planning",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KAWASAKI, Japan, Feb 4, 2025 - (JCN Newswire) - Fujitsu today announced the launch of a software analysis and visualization service. Available in Japan from February, this service will support enterprise and organizational modernization by investigating and analyzing software, visualizing black-box application structures and characteristics, and generating design documents using generative AI. This comprehensive approach enables a robust understanding of current systems and facilitates the creation of optimal modernization plans.</p><p class=\"\">The service comprises two components: software analysis and visualization, which visualizes the application structure and specifications of existing systems; and software design document reverse engineering, which generates design documents from software. Leveraging Fujitsu's expertise gained from analyzing the system assets of over 600 companies, this service provides comprehensive support, from gaining a robust understanding of company software to streamlining and optimizing software for migration to new systems, evaluating migration difficulty level during mainframe-to-open-environment migration, and even generating design documents using generative AI.</p><p class=\"\">Leveraging the core technology of Fujitsu's AI service, Fujitsu Kozuchi, the design document reverse engineering service generates user-friendly design documents from large datasets. This AI-powered service can significantly improve efficiency, with projections of a 50% improvement for retail customers compared to manual methods.</p><p class=\"\">Fujitsu is currently advancing the utilization of generative AI across a comprehensive range of phases within system integration (SI) projects, encompassing modernization initiatives and extending from requirements definition to operational maintenance. The strategic application of generative AI to tasks traditionally executed manually by engineers - including the creation of design documentation and source code throughout the design, development, and testing phases - is intended to yield significant increases in efficiency. The Fujitsu software analysis and visualization service, which enables the use of generative AI at the requirement definition stage of the SI process, represents one of the many ways that Fujitsu is accelerating SI transformation by leveraging generative AI to the maximum extent towards productivity and quality improvements.</p><p class=\"\">Overview of the Software Analysis and Visualization Service</p><p class=\"\">1. The software analysis and visualization service visualizes complex software to facilitate smooth system migrations</p><p class=\"\">This service supports a comprehensive understanding, streamlining, and optimization of software applications, as well as evaluating migration difficulty level. Through the automated creation of software maps that visualize application functional structures - representing the application as a building depicted on a map, it allows for a rapid and intuitive grasp of the current state of the software. Additionally, it categorizes all software by programming language, identifying unused items and similar source code. In evaluating migration difficulty level, it efficiently selects mainframe functions necessary for the application using a standardized process based on Fujitsu's modernization experience. From this selection, it extracts functions that pose obstacles to migration from mainframe to open environments and evaluates the difficulty of porting.</p><p class=\"\">2. The software design document reverse engineering service leverages generative AI to support the creation of high-quality design documents</p><p class=\"\">Departing from conventional analysis methodologies that mechanically parse source code line-by-line based on predefined rules and verify against documented results to ascertain system structure, Fujitsu combines the Fujitsu Knowledge Graph Enhanced Retrieval Augmented Generation (RAG) for Software Engineering to achieve a substantial enhancement in the quality of both asset comprehension and design document generation.</p><p class=\"\">This technology leverages a large language model (LLM) to significantly enhance the accuracy and completeness of software analysis and design information generation. The process involves constructing an asset knowledge graph from existing design documentation and static analysis of the source code (obtained through either conventional tools or LLM-based analysis). A proprietary RAG function then facilitates the precise identification and extraction of relevant knowledge for design information generation. This targeted information, combined with the source code, is input into the LLM, resulting in an approximately 40% improvement in the quality of generated design information compared to source-code-only methods.</p><p class=\"\">Furthermore, to mitigate the risk of LLM hallucinations, this technology incorporates a mechanism to refine input information and detect instances of LLM forgetting. This results in approximately 95% prevention of forgetting and enables the generation of accurate design information, leading to anticipated improvements in the efficiency of human review processes.</p><p class=\"\">Future Plans</p><p class=\"\">To further enhance productivity and bolster support for client modernization efforts, Fujitsu will widely expand the scope of generative AI application. Future developments will include interactive capabilities for verifying current application specifications and assessing the impact of source code changes. This commitment to innovation will significantly contribute to the successful realization of our clients' digital transformation (DX) objectives.</p><p class=\"\">About Fujitsu</p><p class=\"\">Fujitsu's purpose is to make the world more sustainable by building trust in society through innovation. As the digital transformation partner of choice for customers in over 100 countries, our 124,000 employees work to resolve some of the greatest challenges facing humanity. Our range of services and solutions draw on five key technologies: Computing, Networks, AI, Data &amp; Security, and Converging Technologies, which we bring together to deliver sustainability transformation. Fujitsu Limited  reported consolidated revenues of 3.7 trillion yen (US$26 billion) for the fiscal year ended March 31, 2024 and remains the top digital services company in Japan by market share. Find out more: www.fujitsu.com.</p><p class=\"\">Press Contacts</p><p class=\"\">Fujitsu Limited</p><p class=\"\">Public and Investor Relations Division</p><p class=\"\">Inquiries</p><p class=\"\">Source: Fujitsu Ltd</p><p class=\"\">Copyright 2025 JCN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_JCN95756a:0-fujitsu-launches-gen-ai-software-analysis-and-visualization-service-to-support-optimal-modernization-planning/",
            "pub_date": "2025-02-04 13:55:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_S8N3O505O:0",
            "title": "UBS reports Q4 net profit of $770 mln, beating expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  on Tuesday reported a net profit attributable to shareholders of $770 million in the fourth quarter, which compares with an average estimate of $438 million in a company-provided poll of analysts.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_S8N3O505O:0-ubs-reports-q4-net-profit-of-770-mln-beating-expectations/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000148:0",
            "title": "UBS 4Q Rev $11.635B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000148:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000151:0",
            "title": "Analysts Saw UBS 4Q Underlying Pretax Profit at $1.38B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000151:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000150:0",
            "title": "Analysts Saw UBS 4Q Revenue at $11.51B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000150:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000149:0",
            "title": "Analysts Saw UBS 4Q Net Profit at $483M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000149:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000152:0",
            "title": "UBS 4Q-End CET1 Capital Ratio 14.3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000152:0/",
            "pub_date": "2025-02-04 13:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463206:0",
            "title": "Singapore Post's CEO Steps Down",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore Post's  Chief Executive Officer Shahrin Abdol Salam has stepped down from the role, effective Monday, according to a same-day filing with the Singapore Exchange. </p><p class=\"\">Su Yin, the group's chief operating officer, will assume additional responsibility as CEO, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463206:0/",
            "pub_date": "2025-02-04 13:48:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV04H:0",
            "title": "Stocks, dollar on a rollercoaster as US slaps tariffs on China, China hits back",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mexico, Canada tariffs paused after border promises</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Hong Kong shares recoil from 2-month high as tariffs hit</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar on the rise</li></ul></span></div><span><p class=\"\">U.S. stock futures slipped, the dollar jumped and Hong Kong shares toppled from two-month highs on Tuesday after the U.S. imposed tariffs on Chinese imports and China quickly responded in kind.</p><p class=\"\">S&amp;P 500 futures , which had bounced in relief that Mexico and Canada had cut deals to delay a tariff hit, swung to a 0.4% loss. European futures  slipped 0.2% and the euro  skidded beneath $1.02 on nerves Europe may be next.</p><p class=\"\">Hong Kong's Hang Seng  pared gains of more than 2% to trade about 1.8% higher for the day.</p><p class=\"\">An additional 10% U.S. tariff on Chinese exports took effect at 0501 GMT. Minutes after, Beijing announced it was imposing tariffs on imports of U.S. oil, coal, gas, cars and farm equipment to take effect on Feb. 10 - reigniting market concern about a prolonged and messy tit-for-tat trade conflict.</p><p class=\"\">Bitcoin  came under selling pressure and fell 3% to $98,750.</p><p class=\"\">\"I think you see what we should get very used to, which is this kind of rollercoaster of public negotiation around tariffs and other policy,\" said Ross Mayfield, investment strategy analyst at Baird in Louisville, Kentucky.</p><p class=\"\">Australian shares  fell at the closing auction to finish just beneath flat. Japanese  stocks pared gains.</p><p class=\"\">Trump's press secretary said he will speak with Chinese President Xi Jinping in the next couple of days.</p><p class=\"\">Chinese markets remain shut for the Lunar New Year break, though the offshore yuan  slid to 7.3236 per dollar after the tariffs took effect.</p><p class=\"\">The more liquid Australian dollar , often seen as a proxy for the yuan, fell 0.7% to $0.6180.</p><p class=\"\">Gold  struck record highs on Monday as worries of a worldwide trade war pushed investors to safety. It traded close to those levels at $2,817 an ounce on Tuesday while Treasury yields crept a touch higher, with markets divided on whether there will be two or just one U.S. rate cut this year.    </p><p class=\"\">\"The increase in policy uncertainty will be hard to put back in the bottle,\" noted J.P. Morgan's chief U.S. economist, Michael Feroli.</p><p class=\"\">\"For the Fed, the weekend's developments will likely reinforce their inclination to sit on the sidelines and to remain below the radar as much as possible.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV04H:0-stocks-dollar-on-a-rollercoaster-as-us-slaps-tariffs-on-china-china-hits-back/",
            "pub_date": "2025-02-04 13:48:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000154:0",
            "title": "UBS 4Q Net Interest Income $1.84B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000154:0/",
            "pub_date": "2025-02-04 13:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000153:0",
            "title": "UBS 4Q Net Fee and Commission Income $6.60B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000153:0/",
            "pub_date": "2025-02-04 13:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L5N3OQ1QK:0",
            "title": "UBS exceeds expectations with $770 million Q4 net profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group , Switzerland's largest bank, on Tuesday posted net profit of $770 million for the fourth quarter of 2024, trouncing forecasts.</p><p class=\"\">The net profit attributable to shareholders compared with an average estimate of $483 million in a company-provided poll of analysts.</p><p class=\"\">The lender also announced a share buyback program of up to $3 billion for this year, higher than the $2.2 billion analysts at Vontobel expected. </p><p class=\"\">UBS said it planned to repurchase $1 billion of shares in the first half of 2025 and up to $2 billion in the second half while maintaining its target common equity tier 1 capital (CET1) ratio of around 14%. </p><p class=\"\">The bank also specified that the share repurchase amounts  were subject to \"the absence of material and immediate changes to the current capital regime in Switzerland.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L5N3OQ1QK:0-ubs-exceeds-expectations-with-770-million-q4-net-profit/",
            "pub_date": "2025-02-04 13:50:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000156:0",
            "title": "UBS 4Q Other Net Income From Financial Instruments $3.14B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000156:0/",
            "pub_date": "2025-02-04 13:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000155_20250204000159:0",
            "title": "BNP Paribas Approved Principle of Semi-Annual Interim Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000155_20250204000159:0/",
            "pub_date": "2025-02-04 13:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000118:0",
            "title": "Hong Kong Shares Trim Gains After China's Tariff Retaliation — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong shares pare gains after China announces retaliatory tariffs on some U.S. goods. The benchmark Hang Seng Index is up 1.6% at 20545.64, while the Hang Seng Tech Index is 3.4% higher at 4900.52. China's move comes days after U.S. President Trump announced an additional 10% tariff on imports from the country, which take effect Tuesday. Among advancers, SMIC rises 6.8%, Li Auto climbs 6.6% and Lenovo Group adds 6.3%. Meanwhile, ENN Energy falls 1.3% and NetEase sheds 1.6%. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000118:0/",
            "pub_date": "2025-02-04 13:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000050:0",
            "title": "China Hits Back at Trump Tariffs With Measures on Some U.S. Goods",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(05:11 GMT) </strong>*China Imposes Tariffs on Some U.S. Goods<br/><strong class=\"root-Tkn6WL2y\">(05:12 GMT) </strong>*China Imposes 15% Tariffs on U.S. Coal, Liquefied Gas<br/><strong class=\"root-Tkn6WL2y\">(05:17 GMT) </strong>*China Imposes Additional 10% Tariffs on U.S. Crude Oil, Agricultural Machinery, Vehicles<br/><strong class=\"root-Tkn6WL2y\">(05:25 GMT) </strong>*China Puts PVH, Illumina in Unreliable Entity List, Ministry of Commerce Says<br/><strong class=\"root-Tkn6WL2y\">(05:25 GMT) </strong>*China Says PVH, Illumina Discriminate Against Chinese Companies<br/><strong class=\"root-Tkn6WL2y\">(05:41 GMT) </strong>China Hits Back at Trump Tariffs With Measures on Some U.S. Goods</p><p class=\"\">China has announced new tariffs on a range of U.S. products in retaliation for the Trump administration's latest 10% levy on all Chinese exports to the U.S.</p><p class=\"\">The Customs Tariff Commission of the State Council said Tuesday it will impose a 15% tariff on U.S. coal and liquefied natural gas, along with 10% tariffs on crude oil, agricultural machinery, large-displacement vehicles, and pickup trucks.</p><p class=\"\">In a statement, the commission said the additional tariffs are a direct response to the new U.S. duties. The measures will take effect on Feb. 10, it added.</p><p class=\"\">Meanwhile, China's commerce ministry also said that from Tuesday, the country will implement export controls on tungsten, tellurium, bismuth, molybdenum, and indium products.</p><p class=\"\">The news poured some cold water on the earlier relief rally in markets prompted by the postponement of U.S. tariffs on Canada and Mexico.</p><p class=\"\">The offshore yuan weakened against the dollar, while benchmark indexes in Hong Kong, Japan and South Korea pared gains. Oil futures extended losses and bitcoin tumbled.</p><p class=\"\">Write to Singapore editors at singaporeeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000050:0/",
            "pub_date": "2025-02-04 13:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463204:0",
            "title": "Market Chatter: Trump Signs Executive Order to Set Up US Sovereign Wealth Fund to Aid TikTok Sale",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US President Donald Trump signed an executive order to establish a sovereign wealth fund that will help expedite the sale of short video platform TikTok, Bloomberg News reported Tuesday. </p><p class=\"\">The fund will help mitigate the \"burden of taxes on American families and small businesses, establish economic security for future generations, and promote United States economic and strategic leadership internationally,\" according to the presidential order that was signed on Monday. </p><p class=\"\">The order charged Treasury Secretary Scott Bessent and Secretary of Commerce Nominee Howard Lutnick to develop a plan for the establishment of the fund, which will be submitted to the president within 90 days, the document said. </p><p class=\"\">The fund will not only facilitate TikTok's sale, it will also be used to aid healthcare companies and drugmakers in the US, as well as other enterprises, Bloomberg said, citing the president's press conference. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463204:0/",
            "pub_date": "2025-02-04 13:42:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000127:0",
            "title": "China Probes Google Over Potential Violation of Antitrust Law",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sherry Qin</p><p class=\"\">China's market regulator has initiated an investigation into technology giant Google on suspected violation of antitrust law.</p><p class=\"\">The investigation will be carried out by the State Administration for Market Regulation, the regulator said on Tuesday.</p><p class=\"\">The statement, however, didn't provide further details on the probe.</p><p class=\"\">Google didn't immediately respond to a request for comments.</p><p class=\"\">The probe comes amid heightened tensions between the U.S. and China, particularly around trade and technology.</p><p class=\"\">Earlier this week, President Trump announced 10% tariffs on Chinese goods that have now taken effect. Beijing has also responded with its own tariff measures, including levies on imports of coal and liquefied natural gas.</p><p class=\"\">Write to Sherry Qin at sherry.qin@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000127:0-china-probes-google-over-potential-violation-of-antitrust-law/",
            "pub_date": "2025-02-04 13:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}