{
    "data": [
        {
            "id": "DJN_DN20250204012487_20250204012580:0",
            "title": "Match Group: Strengthening U.S. Dollar Continues to Put Pressure on as Reported Results >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012580:0/",
            "pub_date": "2025-02-05 05:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012586:0",
            "title": "ChampionX Files 8K - Operations And Financial Condition >CHX",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ChampionX Corp. (CHX) filed a Form 8K - Operations and Financial Condition - with the U.S Securities and Exchange Commission on February 04, 2025.</p><p class=\"\">On February 4, 2025, ChampionX Corporation (the \"Company\") issued a news release announcing its financial results for the quarter and year ended December 31, 2024. A copy of the news release is furnished as Exhibit 99.1 hereto and incorporated herein by reference.</p><p class=\"\">The information furnished pursuant to this Item 2.02 (including Exhibit 99.1) shall not be deemed to be \"filed\" for the purposes of Section 18 of the Securities and Exchange Act of 1934, as amended, (\"Exchange Act\") or otherwise subject to the liabilities of that section, and shall not be deemed to be incorporated by reference into any filing made by ChampionX Corporation under the Exchange Act or the Securities Act of 1933, as amended, regardless of any general incorporation language in any such filing, except as shall be expressly set forth by specific reference in such filing.</p><p class=\"\">The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1723089/000172308925000006/championx-20250204.htm</p><p class=\"\">Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1723089/000172308925000006/0001723089-25-000006-index.htm</p><p class=\"\">Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012586:0/",
            "pub_date": "2025-02-05 05:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463539:0",
            "title": "New Investment in Predictive Discovery Shows Africa Project Has Potential for Further Gold Discoveries, Euroz Hartleys Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Predictive Discovery's  over AU$69 million investment from the Lundin Family and Zijin Mining Group shows that the company's Bankan project in Guinea has potential for additional large-scale gold discoveries, according to a Tuesday note by Euroz Hartleys. </p><p class=\"\">On Monday, the company said it received binding commitments from the Lundin Family and Zijin Mining Group to raise roughly AU$69.2 million through a strategic private placement of 261.2 million shares at a price of AU$0.265 apiece to be invested in the Bankan project. </p><p class=\"\">The Lundin Family will subscribe for 170.1 million shares for an investment of AU$45.1 million to obtain a 6.5% shareholding in the company, while Zijin Mining Group will subscribe for 91.1 million shares for an investment of AU$24.1 million to obtain a 3.5% shareholding, the company said. </p><p class=\"\">Euroz Hartleys sees potential for high-grade additions from open, ongoing exploration at the Bankan project, calling it one of the best undeveloped gold projects in Africa. </p><p class=\"\">Euroz Hartleys reaffirmed a speculative buy rating and price target of AU$0.50 on Predictive Discovery.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463539:0/",
            "pub_date": "2025-02-05 05:49:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2qtKFf:0",
            "title": "Microchip Technology Appoints Victor Peng to Its Board of Directors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHANDLER, Ariz., Feb.  04, 2025  (GLOBE NEWSWIRE) — Microchip Technology Incorporated, a leading provider of smart, connected and secure embedded control solutions, today announced that Victor Peng, former President of Advanced Micro Devices, Inc. (AMD), will join the Board of Directors of Microchip effective February10, 2024.</p><p class=\"\">Regarding Mr. Peng’s appointment to the board, Microchip’s President and CEO, Steve Sanghi, said, “Victor most recently served as the President of AMD, a publicly held company that designs and manufactures hardware for high-performance computing. Prior to that, he served Xilinx for 14 years, most recently holding roles of president, CEO, board member. With over 40 years of industry experience, Victor has held leadership roles of increasing responsibility at Xilinx where he worked from 2008 until 2022, and at AMD from 2022 until his retirement in 2024. He brings years of industry experience in technology, strategy, and operations to Microchip. This knowledge of technology and of the semiconductor industry will be invaluable to our Board. Victor has also served on the board of KLA Corporation (a provider of process control and yield management systems for semiconductor manufacturing) since February 2019. We welcome Victor to our board and look forward to benefitting from his experience.”</p><p class=\"\">Mr. Peng commented, “I am honored to be appointed to the Microchip board. I believe that my industry experience and leadership skills can have a positive impact on the company’s strategic direction and plans. I look forward to working with the Microchip board to achieve the company’s goals”.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Microchip:</strong></p><p class=\"\">Microchip Technology Incorporated is a leading provider of smart, connected and secure embedded control solutions. Its easy-to-use development tools and comprehensive product portfolio enable customers to create optimal designs, which reduce risk while lowering total system cost and time to market. The company's solutions serve approximately 112,000 customers across the industrial, automotive, consumer, aerospace and defense, communications and computing markets. Headquartered in Chandler, Arizona, Microchip offers outstanding technical support along with dependable delivery and quality. For more information, visit the Microchip website at www.microchip.com.</p><p class=\"\">The Microchip logo and name are registered trademarks of Microchip Technology Incorporated.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">INVESTOR RELATIONS CONTACT:Sajid Daudi – Head of investor Relations</li><li class=\"listItem-bmN0_SHH\">(480) 792-7385</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2qtKFf:0-microchip-technology-appoints-victor-peng-to-its-board-of-directors/",
            "pub_date": "2025-02-05 05:49:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012595:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0545 ET - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p><p class=\"\">0359 ET - Dassault Systemes' new guidance for the current quarter and 2025 as a whole is slightly below market expectations, Bryan Garnier's Aurelien Deside writes in a note to investors. The French software maker is forecasting non-IFRS total revenue between nearly 1.54 billion euros and 1.60 billion euros for the first quarter and between 6.55 billion euros and 6.65 billion euros for the full year. Deside notes that projections for both periods are about 2% below consensus. Dassault Systemes shares trade 0.2% lower at 37.29 euros. (mauro.orru@wsj.com)</p><p class=\"\">0259 ET - Infineon Technologies' sales guidance is slightly ahead of market expectations, Citi analysts write in a note to clients. The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros it reported for fiscal 2024, better than a previous forecast of a slight decline. The new projection equates to roughly 15 billion euros against Vara Research consensus of 14.59 billion euros, Citi analysts note. Infineon's guidance lift is mostly driven by expectations of a stronger dollar based on an assumed exchange rate of $1.05 to the euro compared with $1.10 previously. (mauro.orru@wsj.com)</p><p class=\"\">2315 ET - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">2212 ET - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">1849 ET - Shares of Super Micro Computer, which had delayed its earnings while it was looking into accounting issues, are up 9% to $29.27 after-hours as the company schedules a business update for Feb. 11 at 5:00 p.m. ET. A press release refers to a \"second quarter fiscal 2025 business update,\" while the company's website calls it \"Fiscal 2Q 2025 results.\" The Wall Street Journal reported in September that the Justice Department was investigating the server company. Shares surged in early December when Super Micro said a final review showed no evidence of fraud or misconduct by its management or board relating to accounting issues. On Dec. 6, it said it expected to file its delayed financial statements by Feb. 25. (josh.beckerman@wsj.com)</p><p class=\"\">1732 ET - For the past two years, Palantir Technologies has argued that open- and closed-source artificial-intelligence models are becoming more similar, and that performance would eventually converge, Chief Technology Officer Shyam Sankar says on a call with analysts. \"That's because the market's been focused on AI supply,\" he says. \"With the release of Deep Seek R1, that has gone from a contrarian position to consensus.\" Shares jump 22% after the company says demand for its AI products continues to expand. (connor.hart@wsj.com)</p><p class=\"\">1727 ET - Palantir Technologies closed what it called a record number of deals during 4Q, including 32 deals worth $10 million or more. Chief Revenue and Legal Officer Ryan Taylor says on a call with analysts that the company's U.S. business is at the forefront of the artificial-intelligence revolution, with nearly five-times the number of commercial customers from three years earlier and continuing to add more. \"Organizations who have crossed the chasm with Palantir are driving real impact quickly,\" he says. \"In this AI revolution the biggest risk is not moving fast enough, and organizations are looking to us.\" Shares jump 22% in after-hours trading. (connor.hart@wsj.com)</p><p class=\"\">1706 ET - Palantir Technologies blew past analysts' expectations for 4Q and guided for another beat in the current quarter. CEO Alex Karp said in a letter to shareholders that the company's recent results are indicative of a new phase of its business. \"The business we have built has now developed its own internal momentum and strength, its own interior life and forms of untamed organic growth, with the output that we are seeing far surpassing what we are investing.\" He dubs the company a software juggernaut as its stock price jumps 21%, to $101.86, in after-hours trading. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012595:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012585_20250204012590:0",
            "title": "Microchip Technology Appoints Victor Peng to Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012585_20250204012590:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012487_20250204012600:0",
            "title": "Match Group: Tinder 4Q Rev $488M >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012600:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012487_20250204012588:0",
            "title": "Match Group: Tinder 4Q Direct Rev of $476M >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012487_20250204012588:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012598:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1216 ET - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1119 ET - Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1038 ET - Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p><p class=\"\">1001 ET - The average buyer's agent commission held steady at 2.37% in 4Q, down slightly from 2.45% a year prior, according to Redfin. Despite new commission rules by the National Association of Realtors implemented in August 2024, commissions saw only minor fluctuations, starting at 2.38% in July, dipping to 2.35% in August, and returning to 2.38% by December. A Redfin survey of 500 U.S. agents revealed that 48% said the average agent commission in their area remained about the same since the NAR settlement took effect, while 43% noted a decline. Moreover, 54% of agents reported increased negotiation efforts over commissions by clients, with only 6% seeing less negotiation. (chris.wack@wsj.com)</p><p class=\"\">0645 ET - UBS Group's guidance suggests more top-line pressure to come for its global-wealth-management and personal-and-corporate banking units this quarter, Deutsche Bank's Benjamin Goy and Sharath Kumar say in a research note. The bank guided for a decline in net interest income in global wealth management in the low to mid-single percentage digits this quarter and a 10% decline in the personal and corporate banking unit. While the Swiss bank's fourth-quarter results looked solid, the business mix behind them wasn't ideal, Deutsche Bank says. The group's key global wealth management business was only in line with expectations and its personal and corporate banking unit missed estimates, the analysts say. UBS shares fall 6.1%. (adria.calatayud@wsj.com)</p><p class=\"\">0615 ET - Scor provided a positive update on its January reinsurance-treaty renewals, but this was largely as expected and might not be enough to move the needle, RBC Capital Markets' Derald Goh and Sarah Chong say in a research note. The update points to healthy volumes and flat profit margins, which are consistent with comments the French reinsurer made at its December capital-markets day, the analysts say. \"While it's a positive development we think it's largely as expected and hence we do not see anything incremental to sway the story on the back of this,\" RBC says. Shares rise 3.2%. (adria.calatayud@wsj.com)</p><p class=\"\">0445 ET - Raiffeisen Bank posted a fourth-quarter profit of 128 million euros when excluding its Russia and Belarus operations, Citi analyst Simon Nellis says in a research note. That result brings its year-end result excluding Russia and Belarus to 975 million euros, an 8% miss compared with consensus. Year-end profit for the Vienna-based bank including Russia and Belarus came to 1.16 billion euros, better than Citi had anticipated, the analyst says. Citi says that the bank's result excluding Russia and Belarus, given the number of one-offs the bank faced including a provision and the effect of deconsolidating its Belarus business, is largely in line with expectations. Shares trade 1.6% higher at 20.36 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0414 ET - BNP Paribas reported strong underlying trends for the fourth quarter and consensus expectations could rise, RBC Capital Markets analyst Anke Reingen says in a research note. The French bank's quarterly result as well as it CET1 ratio exceeded expectations, the analyst says. The bank's new 2024-2026 net income growth rate target suggests at least a 4% consensus upgrade, Reingen says. The slight fall in the bank's 2025 return on tangible equity to 11.5% from a range of 11.5% to 12% previously, given consensus expectations at 10.4%, should offer relief to investors fearing a steeper downgrade. BNP Paribas' targeted revenue growth of at least 5% per year for 2025-2026 is also higher than investors had expected. BNP shares trade 2.5% higher to 65.94 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0410 ET - BNP Paribas's fourth-quarter profit exceeded market views thanks in part to its corporate and institutional banking business, Barclays analyst Flora Bocahut says in a research note. The company's commercial, personal banking and services division also drove the 4% consensus beat, the analyst says. BNP Paribas's investment and protection services unit disappointed but the business should benefit later this year from external growth, the analyst says. Meanwhile, the bank's targets for 2026 are slightly ahead of consensus, the analyst says. BNP Paribas shares trade 2.7% higher at 66.09 euros. (pierre.bertrand@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012598:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012591:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">0936 ET - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0321 ET - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">1852 ET - The more than 8% drop in Origin Energy's share price that followed a downgrade to annual production guidance for the Australia Pacific LNG project was overdone, contends UBS. The stock reaction ignores several tailwinds that could trigger upgrades to consensus earnings expectations for FY 2026, analyst Tom Allen says. They include a 15%-20% decline in current coal prices, UBS says, noting 45% of Origin's coal costs are unhedged. Origin also wants to expand a battery at the Eraring power station in Australia to become one of the largest battery storage systems in the world. \"We do not believe these incremental earnings (A$100 million per annum from 2H FY 2026) are factored into consensus estimates,\" UBS says. It keeps a buy call on Origin's stock. (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012591:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012594:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">0745 ET - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">2244 ET - LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p><p class=\"\">2213 ET - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p><p class=\"\">1923 ET - Drivers of Westgold's downgrade to FY 2025 production guidance are likely to spill into the following year as well, reckons Macquarie. Westgold expects to produce 330,000-350,000 oz of gold in FY 2025, down from a prior projection of 400,000-420,000 oz. It expects to dig up gold at a higher cost, forecasting all-in sustaining costs, or AISC, of A$2,400-A$2,600/oz. \"We also assume the slower ramp-up of Bluebird and Beta Hunt, and softer grades at Big Bell, carry over into FY 2026 and cut production 10% while AISC lifts 4%,\" says Macquarie, referring to Westgold's mines. Still, Macquarie's revised outlook equates to a 32% year-over-year increase in production in FY 2026. It retains an outperform call on Westgold's stock. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1858 ET - The proposed 25% tariff on Canadian shipments to the U.S. could cost Rayonier Advanced Materials up to $3.5 million per month while in place, the company said. \"Even with these potential tariffs at currently announced levels, the company expects to cover all fixed charges, including maintenance capital and interest expenses,\" it said. Last year, about 11% of the company's total revenues were generated from Canadian Paperboard exports to the U.S., it added. The company also said it sees 2025 Cellulose Specialties average sales prices increasing mid-single-digit percentage from 2024 levels. (stephen.nakrosis@wsj.com)</p><p class=\"\">1701 ET - Aeris Resources held less cash at the end of 2Q than expected by Ord Minnett, which retains a hold call on the stock as it balances long-term value with a stretched balance sheet. Aeris reported A$26 million in cash at end-December, some A$4 million less than projected by Ord Minnett and despite a lower capital spend. Aeris experienced operational challenges at its Tritton copper mine, with output some 27% below Ord Minnett's forecast and costs around 27% higher. \"The Tritton issues appear to have been somewhat rectified as FY 2025 guidance is unchanged with improved grades/tons set to come from Bugderygar, Avoca Tank and Murrawombie,\" says Ord Minnett, referring to other Aeris-owned pits. (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012594:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012596:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">1333 ET - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p><p class=\"\">1216 ET - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1037 ET - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">0940 ET - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0508 ET - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">0501 ET - TomTom's 2025 guidance is disappointing, ING analyst Marc Hesselink writes in a note. The location technology specialist's outlook remains very uncertain, with no free cash flow expected in the near term, he adds. However, \"the guidance provides significant room for error to reflect the uncertain automotive market,\" he adds. In the fourth quarter, the main negative was its free cash flow--5 million euros outflow--due to unfavorable working capital timing, Hesselink says. Shares are down 14% at 4.28 euros. (najat.kantouar@wsj.com)</p><p class=\"\">0500 ET - A potential merger between Grab and GoTo would improve margins, Citi Research analyst Alicia Yap writes in a note. Bloomberg reported Tuesday that talks between the ride-hailing companies over a possible combination have recently intensified. They would likely save costs on competing user subsidies, as well as see faster new user acquisition with broader product offerings and better reach to lower-tier cities, Yap says. There could also be better user targeting, cross-selling of financial services and increased advertising revenue on both platforms, Yap adds. Both brands would likely continue running independently, but there could be back-end integration of systems and more collaboration regarding merchant management and sharing their rider and vehicle pool, Yap adds. Citi retains a buy rating on Grab with a target of $5.90. Shares last closed at $4.54. (kimberley.kao@wsj.com)</p><p class=\"\">2133 ET - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012596:0/",
            "pub_date": "2025-02-05 05:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309404:0",
            "title": "Earnings Flash (ATO) Atmos Energy Fiscal Q1 EPS $2.23, vs. FactSet Est of $2.24",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309404:0/",
            "pub_date": "2025-02-05 05:50:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309396:0",
            "title": "Varonis Systems Q4 Non-GAAP Net Income Falls, Revenue Rises; Q1, 2025 Guidance Set",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Varonis Systems  reported Q4 non-GAAP net income late Tuesday of $0.18 per diluted share, down from $0.27 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.14. </p><p class=\"\">Revenue in the three months ended Dec. 31 rose to $158.5 million from $154.1 million a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $165.6 million. </p><p class=\"\">In Q1, the company expects a non-GAAP net loss of $0.04 to $0.06 per diluted share on revenue of $130 million to $135 million. Analysts expect a non-GAAP loss of $0.02 on revenue of $129.9 million. </p><p class=\"\">In 2025, Varonis expects non-GAAP net income of $0.13 to $0.17 per diluted share on revenue of $610 million to $625 million. Analysts expect non-GAAP EPS of $0.32 on revenue of $626.7 million. </p><p class=\"\">Shares of Varonis Systems fell 6.1% in after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309396:0/",
            "pub_date": "2025-02-05 05:44:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446623:0",
            "title": "US Crude Oil Inventories Exceed Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US crude oil inventories jumped by 5.025 million barrels for the week ending January 31st, 2025, following a 2.86 million barrel build in the previous week, according to the American Petroleum Institute's Weekly Statistical Bulletin.</p><p class=\"\">This marked the third consecutive week of inventory gains, after five weeks of declines, surpassing expectations of a 3.17 million barrel build.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446623:0-us-crude-oil-inventories-exceed-forecasts/",
            "pub_date": "2025-02-05 05:44:18",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309390:0",
            "title": "Lumen Q4 Exceeds Expectations; Shares Jump After-Hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lumen Technologies  reported late Tuesday Q4 adjusted earnings of $0.09 per share, up from $0.08 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected a loss of $0.05. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $3.33 billion, down from $3.52 billion a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $3.20 billion. </p><p class=\"\">For 2025, the company expects Adjusted EBITDA of $3.2 billion to $3.4 billion. </p><p class=\"\">Shares of the company were up about 10% in after-hours trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309390:0/",
            "pub_date": "2025-02-05 05:44:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2AP:0",
            "title": "Tariffs, earnings eyed as China reopens",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    A look at the day ahead in Asian markets. </p><p class=\"\">First Mexico reached agreement with the United States to put U.S. tariffs on ice, then Canada did likewise, leaving the world's attention on <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/trump-china-us-tariffs-live-updates-2025-02-04/\" rel=\"nofollow\" target=\"_blank\">China</a>. Can a similar rapprochement between Beijing and Washington be achieved?</p><p class=\"\">After China retaliated on Tuesday to sweeping U.S. tariffs with targeted tariffs of its own, and put several U.S. companies, including Google, on notice for possible sanctions, a sudden detente seems unlikely. </p><p class=\"\">This will keep trade tensions bubbling away in Asia, even though markets globally have welcomed Washington's temporary reprieves with Mexico and Canada. A proposed telephone call on Tuesday between U.S. President Donald Trump and Chinese President Xi Jinping didn't take place, suggesting relations remain cool at best. </p><p class=\"\">China's levies don't come into effect until Feb. 10, however, leaving time for Trump and Xi to hammer out a 'deal'.  </p><p class=\"\">Chinese onshore markets reopen on Wednesday after the Lunar New Year holiday. All asset classes will be under intense scrutiny, none more so than the currency and the central bank's daily fixing of the dollar/yuan exchange rate. </p><p class=\"\">It was last fixed at 7.1698 on Jan. 27, and the pressure for a higher fix - i.e, a weaker yuan - could be strong after the offshore dollar/yuan rate hit an all-time high of 7.3765 on Monday. It has since eased back to around 7.28, but that's still comfortably higher than the central bank's last official fix over a week ago.</p><p class=\"\">Chinese stocks listed in Hong Kong have shrugged off the U.S.-Sino trade war with surprising ease, as investors have loaded up on artificial intelligence and electric vehicle shares. The China-focused index rose 3.5% on Tuesday to a three-month high, and Hong Kong tech shares leaped 5%. Will that optimism spill over to the onshore market? </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OV2AP-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">Most Asian equity benchmarks rose solidly on Tuesday, and the tech-heavy Nasdaq's strong advance lifted Wall Street too. Surprisingly soft U.S. jobs opening figures on Tuesday pushed the dollar and Treasury yields lower, which could also support risk appetite in Asia on Wednesday.</p><p class=\"\">But while U.S. money markets are still pricing in two quarter-point rate cuts from the Fed this year, the inflationary cloud from U.S. tariffs is darkening. Economists at Morgan Stanley on Tuesday changed their Fed call to only one rate cut this year, in June, from two, warning: \"The path for monetary policy in 2025 remains highly uncertain.\"</p><p class=\"\">Among the U.S. companies that reported earnings after the market close on Tuesday was 'Magnificent 7' constituent Alphabet. Google's parent company missed revenue estimates, sending its shares down more than 1% in after-hours trading. If that is sustained, it could weigh on sentiment in Asia on Wednesday. </p><p class=\"\">Here are key developments that could provide more direction to Asian markets on Wednesday:</p><p class=\"\">- China \"unofficial\" services PMI (January) </p><p class=\"\">- China reserve requirements ratio</p><p class=\"\">- Japan corporate earnings, including Toyota</p><p class=\"\">- Indonesia GDP (Q4)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2AP:0-tariffs-earnings-eyed-as-china-reopens/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012456_20250204012456:0",
            "title": "Spencer Rascoff Appointed Match Group Chief Executive Officer >MTCH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012456_20250204012456:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012456:0",
            "title": "Spencer Rascoff Appointed Match Group Chief Executive Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(21:45 GMT) </strong>*Spencer Rascoff Appointed Match Group Chief Executive Officer &gt;MTCH<br/><strong class=\"root-Tkn6WL2y\">(21:45 GMT) </strong>Press Release: Spencer Rascoff Appointed Match Group Chief Executive Officer</p><p class=\"\">Spencer Rascoff Appointed Match Group Chief Executive Officer</p><p class=\"\">PR Newswire</p><p class=\"\">DALLAS, Feb. 4, 2025</p><p class=\"\">DALLAS, Feb. 4, 2025 /PRNewswire/ — Match Group's Board of Directors  today announced that Spencer Rascoff has been named Chief Executive Officer, effective immediately. Match Group's portfolio of over 20 brands includes category-leading global dating apps Tinder, Hinge, OkCupid, and Pairs. Rascoff, who has served as a member of Match Group's Board since March 2024, succeeds Bernard Kim, who is stepping down as CEO and as a member of the Board.</p><p class=\"\">Rascoff is a seasoned technology entrepreneur with a strong track record of building and scaling consumer tech businesses. As co-founder and CEO of Zillow Group for more than a decade, he transformed it into a category-defining platform, expanding its offerings and significantly growing its market value. He also co-founded Hotwire, a breakthrough online travel marketplace, and Pacaso, a proptech company reshaping second-home ownership. In addition to his operational experience, Rascoff has been an active investor and advisor to numerous high-growth technology companies across marketplaces, media, and AI.</p><p class=\"\">\"Spencer is an exceptional leader with deep experience in growing consumer technology businesses,\" said Tom McInerney, Chairman of Match Group. \"During his time on the Board, Spencer has demonstrated a strong strategic perspective and deep understanding of Match Group's brands and opportunities. We are confident in his ability to drive the company's next phase of innovation and growth. The Board also wants to thank BK for his leadership and contributions to Match Group, including advancing the company's approach to innovation. We appreciate all he has done for the company during his tenure.\"</p><p class=\"\">\"I am honored to step into the CEO role at such a pivotal and dynamic time for Match Group,\" said Spencer Rascoff. \"This is a company built on innovation, and its portfolio of iconic brands continues to redefine how people connect. As the industry leader, Match Group has set the standard for innovation in dating and relationships, and I'm excited to build on that momentum to bring new experiences to tens of millions of users worldwide. I look forward to working with our teams to foster a culture that embraces creativity and continuous innovation, ensuring we continue to shape the future of dating and relationships.\"</p><p class=\"\">\"Leading Match Group has been an incredible experience, and I'm deeply grateful to our teams for their passion, innovation, and dedication to helping people connect,\" said Bernard Kim. \"I've known Spencer for a long time and have no doubt that he'll bring great energy and vision to Match Group. I'm excited to see all that Spencer and the team will accomplish in the years ahead.\"</p><p class=\"\">At Investor Day in December, Match Group outlined its vision for the next phase of growth, emphasizing advancements in AI-powered features and new product innovations to enhance user experiences. Under Rascoff's leadership, the Company will continue executing on these initiatives, ensuring its brands remain at the forefront of digital connections while driving long-term value for users and shareholders.</p><p class=\"\">Rascoff will join Match Group's fourth quarter 2024 earnings conference call on Wednesday, February 5, 2025, at 8:30 a.m. Eastern Time (ET). Investors and analysts can access the webcast at https://ir.mtch.com.</p><p class=\"\">About Spencer Rascoff</p><p class=\"\">Spencer Rascoff was appointed Match Group CEO in February 2025 after having served on the company's board since 2024.</p><p class=\"\">A seasoned entrepreneur and technology leader, Spencer co-founded Zillow, where he served as CEO for a decade, scaling the company to over 4,500 employees, $3 billion in revenue, and a $10 billion market capitalization while earning dozens of 'best places to work' awards. He also co-founded Hotwire, a breakthrough online travel marketplace; and Pacaso, a proptech company reshaping second-home ownership.</p><p class=\"\">In addition to his operational experience, Spencer has been an active investor and advisor to numerous high-growth technology companies across marketplaces, media, and AI. He has also served on multiple public and private boards, including Palantir, TripAdvisor, and Zulily.</p><p class=\"\">Spencer began his career in investment banking at Goldman Sachs and private equity at TPG Capital. He graduated cum laude from Harvard University and serves on the Board of Trustees of Harvard-Westlake School.</p><p class=\"\">About Match Group</p><p class=\"\">Match Group , through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder(R), Hinge(R), Match(R), Meetic(R), OkCupid(R), Pairs(TM), PlentyOfFish(R), Azar(R), BLK(R), and more, each built to increase our users' likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.</p><p class=\"\">Safe Harbor Statement Under the Private Securities Litigation Reform Act of 1995</p><p class=\"\">This press release may contain \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. All statements that are not historical facts are \"forward looking statements.\" The use of words such as \"anticipates,\" \"estimates,\" \"expects,\" \"plans\" and \"believes,\" among others, generally identify forward-looking statements. These forward-looking statements include, among others, statements relating to: Match Group's future financial performance, Match Group's business prospects and strategy, anticipated trends, and other similar matters. These forward-looking statements are based on management's current expectations and assumptions about future events, which are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Actual results could differ materially from those contained in these forward-looking statements for a variety of reasons, including, among others: our ability to maintain or grow the size of our user base and convert users to paying users, competition, the limited operating history of some of our brands, our ability to attract users to our services through cost-effective marketing and related efforts, our ability to distribute our services through third parties and offset related fees, risks relating to our use of artificial intelligence, foreign currency exchange rate fluctuations, the integrity and scalability of our systems and infrastructure (and those of third parties) and our ability to adapt ours to changes in a timely and cost-effective manner, our ability to protect our systems from cyberattacks and to protect personal and confidential user information, impacts to our offices and employees from more frequent extreme weather events, risks relating to certain of our international operations and acquisitions, damage to our brands' reputations as a result of inappropriate actions by users of our services, and macroeconomic conditions. Certain of these and other risks and uncertainties are discussed in Match Group's filings with the Securities and Exchange Commission. Other unknown or unpredictable factors that could also adversely affect Match Group's business, financial condition and results of operations may arise from time to time. In light of these risks and uncertainties, these forward-looking statements may not prove to be accurate. Accordingly, you should not place undue reliance on these forward-looking statements, which only reflect the views of Match Group management as of the date of this press release. Match Group does not undertake to update these forward-looking statements.</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/spencer-rascoff-appointed-match-group-chief-executive-officer-302368108.html</p><p class=\"\">SOURCE Match Group</p><p class=\"\">/CONTACT: MatchGroupPR@match.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012456:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012448_20250204012448:0",
            "title": "Match Group: Bernard Kim Steps Down as CEO, From Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012448_20250204012448:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012448_20250204012449:0",
            "title": "Match Group Names Zillow Group Co-Founder Spencer Rascoff as CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012448_20250204012449:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE1YS9qq:0",
            "title": "Kansas City Royals To Simulcast 10 Regular Season Games On Gray Media’s KCTV5/KSMO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Games also to air on Gray Media stations throughout Midwest</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ATLANTA, Feb.  04, 2025  (GLOBE NEWSWIRE) — </strong>The Kansas City Royals today announced a partnership with Gray Media to provide new, expanded, and free access for fans by simulcasting 10 regular season broadcasts with FanDuel Sports Network, the Royals rightsholder partner.   The games will be shown on KCTV5 (CBS), KSMO (MyNetwork) or both on Sundays throughout the season, with selected games to be announced at a later date.</p><p class=\"\">This new partnership will greatly increase reach and access to the selected games, providing a new way for nearly 7 million households to watch the Royals.   All 10 games will be broadcast on KSMO, with at least 6 also airing on KCTV5. Gray stations cover much of the Royals home television territory, including markets in Missouri, Kansas, Nebraska, Iowa, and Arkansas.</p><p class=\"\">“Sharing our games, highlighting our world-class athletes, and telling our story to as many people as possible is a top priority for us,” Royals President of Business Operations Brooks Sherman said.   “This agreement gives our fans the power to watch however they want, whether that’s on cable, streaming, or local TV.   We are thrilled to partner with Gray Media, and know their experience and expertise will be beneficial for both the Royals and our fans.”</p><p class=\"\">“KCTV5, KSMO, and Gray Media are thrilled to bring the Royals back to free, over-the-air television,” said Curtis Miles, Vice President and General Manager of KCTV5 and KSMO.   “Gray Media has made significant investments in live sports, and we’re proud to bring viewers what they want.”</p><p class=\"\">In addition to the regular season broadcasts, the Royals and Gray will work together to create ancillary programming that will connect fans to their favorite team like never before.   Royals players, coaches, leadership, and alumni could be featured in content bringing fans closer than ever and add ways for everyone to follow the team beyond games.</p><p class=\"\">More information on the selected games and additional programming will be released prior to Opening Day, which will be March 27 against the Guardians.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Gray Media</strong></p><p class=\"\">Gray Media, Inc. , is a multimedia company headquartered in Atlanta, Georgia. The company is the nation’s largest owner of top-rated local television stations and digital assets serving 113 television markets that collectively reach approximately 36 percent of US television households. The portfolio includes 77 markets with the top-rated television station and 100 markets with the first and/or second highest rated television station, as well as the largest Telemundo Affiliate group with 43 markets totaling nearly 1.5 million Hispanic TV Households. The company also owns Gray Digital Media, a full-service digital agency offering national and local clients digital marketing strategies with the most advanced digital products and services. Gray’s additional media properties include video production companies Raycom Sports, Tupelo Media Group, and PowerNation Studios, and studio production facilities Assembly Atlanta and Third Rail Studios. Gray owns a majority interest in Swirl Films. For more information, please visit www.graymedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gray Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Curtis Miles</strong>, KCTV/KSMO Vice President &amp; General Manager, curtis.miles@graymedia.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE1YS9qq:0-kansas-city-royals-to-simulcast-10-regular-season-games-on-gray-media-s-kctv5-ksmo/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012470_20250204012470:0",
            "title": "Fortescue Offer for Red Hawk Increases to A$1.20/Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012470_20250204012470:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012440:0",
            "title": "Chipotle Earnings Beat. Why The Stock Is Falling. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Evie Liu</p><p class=\"\">Chipotle stock plunged in aftermarket trading after the fast-casual restaurant chain posted solid earnings but its quarterly revenues were lower than what analysts had expected.</p><p class=\"\">For the three months ended in December, the burrito chain posted 25 cents in adjusted earnings per share, beating the consensus estimates of 24 cents from analysts polled by FactSet. Sales came at $2.8 billion, below the expected $2.85 billion.</p><p class=\"\">This is the first quarterly earnings report since Scott Boatwright was named the new CEO of Chipotle in November. He was previously the interim CEO after former head Brian Niccol left the company in August to lead Starbucks's turnaround.</p><p class=\"\">Chipotle has been on a strong growth trajectory for many quarters, even when many restaurant peers struggle with declining traffic and weaker sales amid inflation pressures. Before the earnings report as of Tuesday's close, the stock had gained 19% over the past 12 months.</p><p class=\"\">In the fourth quarter, Chipotle opened 119 company-owned restaurants. Same-store sales also continued to improve, up by 5.4% from a year ago.</p><p class=\"\">Strong unit growth and comparable sales has lifted total revenue by 13% year over year. Earnings also came in 19% higher compared with the year-ago period, as operating margins improved to 14.6%.</p><p class=\"\">\"Chipotle had another outstanding year, delivering strong transaction driven comps each quarter, expanding margins, adding over 300 new restaurants, gaining momentum in key industry leading brand metrics, making progress on many restaurant operating initiatives and building our footprint internationally,\" said Boatwright in a statement.</p><p class=\"\">Still, the stock tumbled more than 3% in Tuesday aftermarket trading following the revenue miss.</p><p class=\"\">For 2025, Chipotle management plans to open 315 to 345 new company-owned restaurants, and expects comparable restaurant sales to grow in the low- to mid-single digit range.</p><p class=\"\">\"I want to make sure that as we continue to scale Chipotle, everything we do is in service of our guests or those who serve our guests which will enable us to achieve our long-term ambitious goals of reaching 7,000 restaurants in North America, growing our AUVs beyond $4 million, expanding margins and making progress toward becoming a global iconic brand,\" said Boatwright.</p><p class=\"\">On Chipotle's earnings call, investors will watch for commentary on inflationary costs and impact of potential tariffs on imported goods from Mexico and Canada. The tariffs have been put on a 30-day pause as of Tuesday as the three countries continue to negotiate.</p><p class=\"\">But if the levies were to kick in, costs of avocados — the main ingredient of Chipotle's popular guacamole — would likely see prices hike soon. Avocados represent 7% to 11% of Chipotle Mexican Grill's costs of goods sold, according to TD Cowen analyst Andrew Charles.</p><p class=\"\">Mexican avocados make up 80% of America's total avocado consumption, which means there are no easy alternatives from other countries.</p><p class=\"\">Last summer, when the Mexican avocado market saw some price volatilities, Chipotle said it was less impacted because it has been diversifying its supply chain, noting that the majority of its avocados came from Peru.</p><p class=\"\">Still, the company reported higher food, beverage and packaging costs in the third quarter, citing rising avocado and dairy costs as the main reason.</p><p class=\"\">\"Chipotle has historically cited other countries where the brand can import avocados, though we view it as prudent to expect it will be difficult to fully offset the impact,\" wrote Charles in a Monday note.</p><p class=\"\">Charles anticipates that the potential tariffs, if kicking in, could lift Chipotle's costs of goods sold by half a percentage point.</p><p class=\"\">Write to Evie Liu at evie.liu@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012440:0/",
            "pub_date": "2025-02-05 05:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0PP:0",
            "title": "SunCar Technology tumbles on stock offering plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">**  Shares of SunCar Technology Group  down 19.5% at $8.29 in extended trading as China-based auto services and insurance provider looks to raise equity</p><p class=\"\">** Co announces up to $50 mln stock offering for working capital, general corp purposes</p><p class=\"\">** BTIG lead bookrunner, joined by Macquarie and Oppenheimer</p><p class=\"\">** Co has ~98.5 mln total shares outstanding (Class A and B) as of Feb 4 for about $1 bln market cap, per the SEC prospectus filing</p><p class=\"\">** Its public float is ~33.2 mln shares, per LSEG</p><p class=\"\">** SDA closed up 1.4% at $10.30 on Tues. Shares up ~7% YTD and were trading around $7.50 a year ago</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0PP:0-suncar-technology-tumbles-on-stock-offering-plans/",
            "pub_date": "2025-02-05 05:45:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV188:0",
            "title": "US Democrats fight back against Musk access to sensitive records",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Democratic U.S. congressional leaders will push legislation this week to \"prevent unlawful meddling\" by the newly created Department of Government Efficiency in the Treasury Department payment system, Senate Democratic leader Chuck Schumer said on Tuesday.</p><p class=\"\">Billionaire <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/elon-musk/\" rel=\"nofollow\" target=\"_blank\">Elon Musk</a> chairs the informal DOGE group, which was tasked by President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> to identify fraud and waste in the government. Last week, the team gained access to the most sensitive payment systems at Treasury and, as Reuters reported, locked some employees out of their agency's computers.</p><p class=\"\">\"Whatever DOGE is doing, it is certainly not what democracy looks like, or has ever looked like in the grand history of this country, because democracy does not work in the shadows, democracy does not skirt the rule of law,\" Schumer said in a speech on the Senate floor. </p><p class=\"\">Musk, who has moved swiftly to shrink the size of the U.S. government at Trump's behest, is now considered a \"special government employee,\" the White House said on Monday.</p><p class=\"\">    Schumer said he and House Democratic leader Hakeem Jeffries intended for the legislation \"to prevent unlawful meddling in the Treasury department’s payment systems, to prevent everyone's records from being made available to a small group of people who can look at them at will.\"  </p><p class=\"\">Schumer said the legislation would deny special government employees access to sensitive government records.</p><p class=\"\">    Restrictions would also extend to those without proper clearances and add personal tax information to privacy-protected data.   </p><p class=\"\">    Musk, the founder of the Tesla electric car company and SpaceX has contracts with the U.S. government as well as operations in China.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV188:0-us-democrats-fight-back-against-musk-access-to-sensitive-records/",
            "pub_date": "2025-02-05 05:45:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6bf9083b0b83d:0",
            "title": "HEALTHPEAK PROPERTIES, INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Healthpeak Properties, Inc., a leading real estate investment trust (REIT) specializing in healthcare properties, has released its 2024 Form 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the current market environment.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Total Revenue</strong>: $1,197 million, reflecting a $58.8 million increase from the previous year due to new leasing activity and development projects.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (loss) applicable to common shares</strong>: $242.4 million, a decrease primarily due to increased depreciation and merger-related costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nareit FFO</strong>: $1,092.7 million, an increase driven by higher Adjusted NOI from acquisitions and development projects.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">FFO as Adjusted</strong>: $1,231.9 million, reflecting a significant increase due to higher cash collections and new leasing activity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">AFFO</strong>: $1,140.7 million, an increase attributed to higher cash collections of non-refundable entrance fees and increased Adjusted NOI.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corporate Reorganization</strong>: In 2023, Healthpeak Properties, Inc. completed its corporate reorganization into an umbrella partnership REIT (UPREIT), enhancing its operational structure and strategic flexibility.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Merger with Physicians Realty Trust</strong>: On March 1, 2024, Healthpeak completed a merger with Physicians Realty Trust, acquiring 299 outpatient medical buildings, significantly expanding its outpatient medical segment.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Portfolio Composition</strong>: As of December 31, 2024, Healthpeak's portfolio consisted of 697 properties, including 524 outpatient medical properties, 139 lab properties, and 15 continuing care retirement communities (CCRCs).</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Outpatient Medical Segment</strong>: The outpatient medical segment includes multi-tenant properties primarily leased to healthcare providers, with 78% located on or adjacent to hospital campuses and 96% affiliated with hospital systems.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Lab Segment</strong>: Lab properties are primarily leased to biotechnology, medical device, and pharmaceutical companies, with significant presence in San Francisco, San Diego, and Boston, reflecting strong geographical market positioning.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">CCRC Segment</strong>: Continuing care retirement communities offer a continuum of care, with operations managed through RIDEA structures, allowing for a comprehensive range of senior living services.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Internal Growth Strategies</strong>: Healthpeak focuses on building long-term leasing relationships, replacing tenants at favorable terms, and extending lease terms to maximize property performance and tenant retention.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Investment Strategies</strong>: The company targets healthcare real estate investments driven by favorable demographics and market consolidation, with a focus on outpatient medical and lab properties.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sustainability Initiatives</strong>: Healthpeak is committed to sustainability, achieving reductions in greenhouse gas emissions and receiving multiple certifications and recognitions for its environmental efforts.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Human Capital Management</strong>: The company emphasizes diversity, inclusion, and employee engagement, with a workforce comprising 59% female employees and 35% racially or ethnically diverse employees.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: Healthpeak anticipates continued growth through strategic acquisitions, development projects, and leveraging its expanded portfolio post-merger with Physicians Realty Trust.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The company completed a merger with Physicians Realty Trust, acquiring 299 outpatient medical buildings, and executed a $750 million five-year unsecured term loan to support this strategic expansion.</li><li class=\"listItem-bmN0_SHH\">Additionally, the company sold a 65% interest in two lab buildings in San Diego for $128 million and exercised options to buy out four redeemable noncontrolling interests for $53 million, enhancing its asset portfolio and ownership structure.</li><li class=\"listItem-bmN0_SHH\">The company repurchased 10.5 million shares of its common stock for $188 million under the 2022 Share Repurchase Program and declared an increase in the quarterly common stock cash dividend from $0.30 to $0.305 per share.</li><li class=\"listItem-bmN0_SHH\">The company also refinanced existing loans, extended maturity dates, and entered into interest rate swap instruments to manage interest rate exposure.</li><li class=\"listItem-bmN0_SHH\">Furthermore, the company maintained a strong equity position with 699 million shares outstanding and a market value of $14.5 billion.</li><li class=\"listItem-bmN0_SHH\">The company anticipates using cash flows from operations, property sales, and potential debt and equity issuances to fund future acquisitions, capital expenditures, and development projects.</li><li class=\"listItem-bmN0_SHH\">It plans to continue its share repurchase program with $500 million available under the 2024 Share Repurchase Program and aims to maintain its REIT status by distributing a significant portion of its cash flow as dividends.</li><li class=\"listItem-bmN0_SHH\">The company is also focused on managing its debt profile and interest rate exposure to support long-term growth and financial stability.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Macroeconomic Risks</strong>: The company is vulnerable to macroeconomic trends such as inflation, interest rate fluctuations, and supply chain disruptions. These factors have increased construction, labor, and operating costs, potentially affecting profitability and the ability to execute acquisitions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Interest Rate Risks</strong>: Rising interest rates have led to higher borrowing costs, which could limit the company's ability to refinance existing debt and finance new acquisitions. This may also impact consumer spending and demand for the company's properties.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Life Science Industry Risks</strong>: Changes in the life science industry, including regulatory challenges and funding difficulties, could reduce demand for lab properties. Industry consolidation and migration could further impact revenues.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Risks</strong>: The company faces challenges related to labor shortages and rising labor costs, which may require enhanced pay and benefits to attract personnel. Additionally, the integration of new technologies and changing consumer preferences could affect property demand.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Regulatory Risks</strong>: Compliance with extensive healthcare regulations is critical. Non-compliance could result in fines, loss of accreditation, or exclusion from government programs, impacting the company's financial performance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Environmental and Climate Risks</strong>: Properties are exposed to natural disasters and climate change impacts, which could lead to uninsured losses and increased insurance costs. The company may also face regulatory pressures to meet sustainability commitments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity Risks</strong>: The reliance on information technology exposes the company to cybersecurity threats, which could disrupt operations and lead to data breaches, impacting reputation and financial results.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Joint Venture Risks</strong>: Participation in joint ventures introduces risks such as conflicts of interest, limited control over decisions, and potential financial instability of partners.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Risks</strong>: The company faces competition in acquiring and developing healthcare properties, which could impact its ability to grow its investment portfolio and retain tenants.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Financial Market Risks</strong>: Volatility in financial markets may impair the company's ability to raise capital and fund operations, potentially affecting liquidity and financial performance.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/765880/000162828025003748/peak-20241231.htm\" rel=\"nofollow\" target=\"_blank\">HEALTHPEAK PROPERTIES, INC. [ DOC ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6bf9083b0b83d:0-healthpeak-properties-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 05:38:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309383:0",
            "title": "Earnings Flash (PRU) Prudential Financial Q4 Adjusted EPS $2.96, vs. $3.24 Year Ago",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309383:0/",
            "pub_date": "2025-02-05 05:38:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463536:0",
            "title": "Pinnacle Investment Posts Higher Fiscal H1 Earnings as Revenue Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pinnacle Investment Management Group  reported Tuesday fiscal half-year earnings of AU$0.367 per diluted share, up from AU$0.153 per diluted share a year earlier. </p><p class=\"\">Analysts polled by Visible Alpha expected AU$0.3081 per diluted share. </p><p class=\"\">Revenue from continuing operations for the six months ended Dec. 31, 2024, was AU$27.6 million, compared with AU$23.7 million a year earlier. </p><p class=\"\">Analysts surveyed by Visible Alpha expected AU$28.6 million. </p><p class=\"\">The board declared a dividend of AU$0.33 per share payable on March 21 to shareholders of record on March 7. This is higher than the previously reported period's dividend of AU$0.156.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463536:0/",
            "pub_date": "2025-02-05 05:38:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309389:0",
            "title": "Klaviyo Insider Sold Shares Worth $687,818, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Amanda Whalen, Chief Financial Officer, on February 03, 2025, sold 15,000 shares in Klaviyo  for $687,818. Following the Form 4 filing with the SEC, Whalen has control over a total of 376,820 Series A common shares of the company, with 376,820 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1835830/000183583025000007/xslF345X05/wk-form4_1738704413.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1835830/000183583025000007/xslF345X05/wk-form4_1738704413.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309389:0/",
            "pub_date": "2025-02-05 05:38:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}