{
    "data": [
        {
            "id": "financemagnates:6adccdd03094b:0",
            "title": "Political Bets Are Allowed, but Not Sports: Robinhood Halts Super Bowl Event Contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Robinhood (Nasdaq: HOOD) has suspended offering Super Bowl event contracts only a day after listing them, following a request from the Commodity Futures Trading Commission (CFTC).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Event Contracts Are Not Allowed</strong></p><p class=\"\">In a statement published yesterday (Tuesday), the trading platform revealed that the US regulator had formally requested that Robinhood Derivatives, which offers such contracts, must “not permit customers to access” sports event contracts.</p><p class=\"\">Robinhood has about 24.3 million customers globally. However, according to the firm, it rolled out the Super Bowl event contracts to only 1 per cent of its customers. Traders who have already placed orders can either close their positions or settle them.</p><p class=\"\">“While we continue to work with the CFTC to understand their concerns, we are suspending the rollout of the Pro Football Championship market,” Robinhood noted in its official announcement, adding: “We are disappointed by this outcome, especially given that we had been in regular communication with the CFTC about our intent and plans to offer this product.”</p><div class=\"container-n2KCMK3i\" data-name=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">Robinhood Comms</div><div class=\"username-n2KCMK3i\">@RobinhoodComms</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\">The Commodity Futures Trading Commission (CFTC) has formally requested that Robinhood Derivatives, LLC (RHD) “not permit customers to access” sports event contracts.</p><p class=\"\">While we continue to work with the CFTC to understand their concerns, we are suspending the rollout of the Pro…</p></div><span class=\"date-n2KCMK3i\">Feb 04, 2025</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/RobinhoodComms/status/1886830533415502082\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\">Event contracts allow traders to take a binary bet on the outcome of an event, in this case, the National Football League’s Super Bowl championship between the Philadelphia Eagles and the Kansas City Chiefs. These contracts resemble the notorious binary options, which are now banned in most jurisdictions.</p><p class=\"\">The US already has a massive sports betting market, governed by gambling rules. However, sports event contracts are seen as financial derivatives.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Most Watched Event in the US</strong></p><p class=\"\">The Super Bowl is also the top event in the United States in terms of viewership. This year, it is estimated to attract between 100 million and 150 million viewers globally, according to Forbes. With such popularity, many sponsors pay tens of millions of dollars for seconds of advertisements during the event’s broadcast.</p><p class=\"\">Meanwhile, Robinhood is not the only platform against which the CFTC has taken action over its offering of event contracts. The regulator recently opened a probe into Crypto.com and Kalshi for their joint offering of Super Bowl event contracts. Cointelegraph pointed out that Crypto.com will continue offering event contracts despite the probe.</p><p class=\"\">Interestingly, the CFTC lost its court battle with Kalshi last year over its offering of political event contracts, which allowed multiple US platforms to offer event contracts on the outcome of US Presidential elections. However, the regulator appealed against the court’s decision.</p><p class=\"\">“[Robinhood] will continue to collaborate with the CFTC as we work to roll out a more comprehensive event contracts platform later this year,” Robinhood added in its announcement.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:6adccdd03094b:0-political-bets-are-allowed-but-not-sports-robinhood-halts-super-bowl-event-contracts/",
            "pub_date": "2025-02-05 13:23:33",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:3736d4038094b:0",
            "title": "Google boss expects to spend $75B on AI this year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Google CEO Sundar Pichai expects his company to invest around $75 billion in capital expenditures in 2025 to boost artificial intelligence offerings.</p><p class=\"\">“We expect to invest approximately $75 billion in capital expenditures in 2025,” Pichai said in a statement in Google parent Alphabet’s fourth-quarter 2024 earnings report. The figure is a 43% increase from the firm’s $32.3 billion capital expenditures in 2023.</p><p class=\"\">He said the investment would “accelerate progress” in AI innovation and continue to strengthen the company’s core businesses. </p><p class=\"\">Capital expenditures — sometimes referred to as “capex” — are funds used to purchase long-term physical or fixed assets in business operations.</p><p class=\"\">It’s not clear exactly how much of the investment is earmarked for AI, but it’s expected that most of it will be funneled into expanding Google’s AI infrastructure. Other Big Tech firms have increased spending on AI-related projects, including Meta, which said it would spend $65 billion to expand its AI infrastructure.</p><p class=\"\">AI has been one of Google’s strongest revenue streams in the last few years, with overall revenue up 12% year-over-year at $96.5 billion.</p><p class=\"\">Meanwhile, Google Cloud revenue jumped 10% to $12 billion in the same time frame, something Google said had been supported by consistent growth across “core Google Cloud Platform products, AI Infrastructure and Generative AI Solutions.”</p><p class=\"\">However, Alphabet’s total revenue fell short of combined analyst expectations of $96.7 billion, and its share price fell more than 7% in after-hours trading, according to Yahoo Finance.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:488.6029411764706px;max-width:1200px;aspect-ratio:2.455981941309255\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:3736d4038094b-6906cfbf14d2ba6ea017f41e269c0f6c-resized.webp\" type=\"images/webp\"/><img alt=\"Google, Meta\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:3736d4038094b-6906cfbf14d2ba6ea017f41e269c0f6c-resized.jpeg\" style=\"background-color:#f7f3f3\"/></picture></div></figure></span></p><p class=\"\">In a Feb. 4 investor call, Pichai downplayed the risks posed by new competitors, including the China-based AI model DeepSeek, which shook the market in late January. </p><p class=\"\">Pichai told listeners of the call that Google’s Gemini 2.0 Flash models are “some of the most efficient models out there,” even when compared to DeepSeek’s v3 and R1 models. </p><p class=\"\">On Jan. 27, DeepSeek spooked US markets with news that the model’s developers were able to produce a worthy competitor to American AI firms such as OpenAI at a fraction of the cost.</p><p class=\"\">The firm claims it was able to develop its AI model on a shoestring budget of just under $6 million using less advanced hardware from semiconductor manufacturer Nvidia.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">AI Eye: </strong></em><em><strong class=\"root-Tkn6WL2y\">9 curious things about DeepSeek R1</strong></em></p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:3736d4038094b:0-google-boss-expects-to-spend-75b-on-ai-this-year/",
            "pub_date": "2025-02-05 13:24:20",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463724:0",
            "title": "Sabana Industrial REIT Completes Solar Panel Installation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sabana Industrial REIT  completed the installation of solar panels at nine of its properties in partnership with Keppel's Energy-as-a-Serivce arm, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">The dual-phase project was part of the REIT's target to become one of Singapore's first carbon neutral industrial REITs by 2040.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463724:0/",
            "pub_date": "2025-02-05 13:26:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0K1:0",
            "title": "Abrdn and JPMorgan move to bolster European active ETF suites - FT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/25lb968w</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0K1:0-abrdn-and-jpmorgan-move-to-bolster-european-active-etf-suites-ft/",
            "pub_date": "2025-02-05 13:27:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW00F:0",
            "title": "Japan's SKY Perfect JSAT to invest $230 mln in observation satellites",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's SKY Perfect JSAT  will invest about $230 million to build a constellation of low-Earth orbit satellites using U.S. company Planet Labs'  Pelican satellite, the company said on Wednesday.</p><p class=\"\">JSAT will enter the Earth observation satellite business through the investment that will be carried out by its American subsidiary, the company said.</p><p class=\"\">Shares in JSAT, the biggest broadcast and communication satellite operator in Asia, rose as much as 9% after the announcement.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW00F:0-japan-s-sky-perfect-jsat-to-invest-230-mln-in-observation-satellites/",
            "pub_date": "2025-02-05 13:28:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463538:0",
            "title": "SNB Capital Research Notes Bank Albilad's 'Strong' Q4 2024 Earnings Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SNB Capital Research expects Bank Albilad (SASE:1140) to benefit from an expected monetary policy easing and noted the Saudi Arabian bank's strong fourth-quarter 2024 results. </p><p class=\"\">\"Provision reversal is a key highlight from the Q4 24 results as Bilad is the only bank to book a reversal on a net basis among reported results. Overall, we believe the bank is well positioned to benefit from the anticipated interest rate cuts as it has ample room to grow its loan book as indicated by the latest [loan-to-deposit ratio] of 89.8%,\" analysts wrote Tuesday. </p><p class=\"\">The bank's quarterly net income of 790 million Saudi riyals surpassed SNB Capital and consensus estimates, thanks mainly to a lower-than-expected 58 million-riyal provision reversal, the research firm added. </p><p class=\"\">SNB Capital rated the Tadawul-listed stock overweight with a price target of 42.3 riyals.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463538:0/",
            "pub_date": "2025-02-05 13:28:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463729:0",
            "title": "Hartshead Resources Proposes New Gas Export Route for Phase-I Gas Development in the North Sea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hartshead Resources  submitted a revised concept select report addendum to the North Sea Transition Authority for its phase one gas development at the Anning and Somerville gas fields, selecting a new gas export route through the CalEnergy-owned Saturn Banks pipeline, according to a Wednesday Australian bourse filing. </p><p class=\"\">The pipeline will transport the gas to the Perenco-owned Bacton Terminal, where it will be processed before entry into the UK grid, the filing said. </p><p class=\"\">It said that talks regarding commercial and technical specifications for the transportation and processing of gas are progressing. It added that it is in advanced discussions, regarding capital investment for pipeline infrastructure associated with the development, per the filing. </p><p class=\"\">The new route offers numerous benefits including increased production capacity, accelerated production, and improved economic performance. </p><p class=\"\">The addendum was submitted under sole risk provisions, as the P2607 Production Seaward License joint venture partners did not vote in favor of the submission, though they may still join the development. </p><p class=\"\">Its shares fell 13% on market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463729:0/",
            "pub_date": "2025-02-05 13:29:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463727:0",
            "title": "Market Chatter: Henderson Land Sees Higher Sales with Inflow of Skilled Workers, Lower Mortgage",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Henderson Land Development  is positive about new home sales in 2025 due to the expected arrival of highly skilled workers and their families into Hong Kong and lower mortgage rates, The Standard reported Tuesday. </p><p class=\"\">The developer is planning 5,400 new homes on the market across 12 new projects, with 1,700 in the first sales division while 3,700 homes will be available in second division sales, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463727:0/",
            "pub_date": "2025-02-05 13:29:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0CM:0",
            "title": "Markets confounded by Trump's Gaza proposal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    A look at the day ahead in European and global markets from Wayne Cole.</p><p class=\"\">First off, nobody knows what to make of President Donald Trump's sudden suggestion that the United States take over the Gaza strip and turn it into the Riviera of the Middle East - once the Palestinians are resettled elsewhere, of course.</p><p class=\"\">It's not clear if this was a serious proposal, given it sounds eerily reminiscent of an idea floated last year by Trump's son-in-law Jared Kushner that Gaza's waterfront property could be very valuable and Israel should remove civilians while the strip was cleaned up.</p><p class=\"\">Markets have seemingly taken it with a pinch of salt and there's been no obvious reaction in oil prices.</p><p class=\"\">Otherwise, it's been a messy session so far in Asia with idiosyncratic  moves in share markets, and a pullback in the U.S. dollar following a drop in Treasury yields.</p><p class=\"\">While Wall Street had edged up on Tuesday, Nasdaq futures are now down about 0.5% following disappointing earnings from Alphabet  as it spends heavily on capex. The Google owner's shares shed 7.6% after hours, wiping $192 billion off its market worth.</p><p class=\"\">Asia share markets were mixed with some relieved that China had been restrained in its retaliation against President Donald Trump's tariffs. JPMorgan notes that China's additional levies would apply to products that last year accounted for just $14 billion of imports.</p><p class=\"\">Beijing also set a firm 7.1693-per-dollar fix for its yuan as markets returned from the Lunar New Year holidays, countering concerns it might allow a sharp depreciation to offset the impact of tariffs. The dollar did rise 0.5% on the onshore yuan, but that merely catches up to where the offshore market already was and remains well short of Monday's record top at 7.3765.</p><p class=\"\">Chinese blue chips were off just a shade, a resilient performance given they were returning from holiday to an actual trade war.</p><p class=\"\">Elsewhere, the dollar was mostly on the retreat, slipping 0.6% on the Japanese yen to around 153.33, partly reflecting a continued rise in JGB yields to highs not seen since 2008. The rise in the yen erased early gains made by the Nikkei.</p><p class=\"\">European share futures are all modestly in the red, no surprise given Trump continues to warn that the European Union is in his sight for tariffs but without specifying what he wants in return.</p><p class=\"\">Key developments that could influence markets on Wednesday: </p><p class=\"\">- Service PMIs for EU, Germany, UK and France; EU producer prices; ECB chief economist Philip Lane speaks  </p><p class=\"\">- U.S. ISM services survey, ADP employment report, Treasury refunding announcement</p><p class=\"\">- Speeches by Federal Reserve Board Governor Michelle Bowman and Vice Chair Philip Jefferson, along with Fed Presidents Barkin and Goolsbee</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0CM:0-markets-confounded-by-trump-s-gaza-proposal/",
            "pub_date": "2025-02-05 13:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463730:0",
            "title": "Zhejiang Tiantai Xianghe Industrial Buys Back Shares for 49 Million Yuan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zhejiang Tiantai Xianghe Industrial  has repurchased 6,882,847 shares for about 48.7 million yuan as of Jan. 27. </p><p class=\"\">The shares were bought back at prices between 6.66 yuan and 7.95 yuan apiece under a share buyback plan of between 50 million yuan and 100 million yuan, according to a Wednesday filing with the Shanghai bourse. </p><p class=\"\">The railway equipment manufacturer aims to continue executing the plan based on market conditions and will provide further updates as needed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463730:0/",
            "pub_date": "2025-02-05 13:30:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW06N:0",
            "title": "Ohio police at an active shooter situation at KDC/One warehouse",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Albany police are currently responding to an active shooter situation at KDC/One warehouse, City of New Albany said in a statement on Tuesday.</p><p class=\"\">The suspect or suspects are unknown at this time, it said.</p><p class=\"\">NBC4 earlier reported that several people were injured in the active scene near a warehouse.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW06N:0-ohio-police-at-an-active-shooter-situation-at-kdc-one-warehouse/",
            "pub_date": "2025-02-05 13:21:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463732:0",
            "title": "Arab National Bank Logs Higher FY24 Net Profit, Total Operations Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank (SASE:1080) said Wednesday that its net profit and total operations profit for full-year 2024 climbed year over year. </p><p class=\"\">Net profit for the 12 months ended Dec. 31, 2024, was 4.97 billion Saudi riyals, compared with 4.07 billion riyals a year ago. EPS moved to 2.48 riyals from 2.04 riyals. </p><p class=\"\">The Saudi Arabia-listed bank's total operations profit was 9.50 billion riyals, compared with 8.57 billion riyals previously.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463732:0/",
            "pub_date": "2025-02-05 13:22:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463721:0",
            "title": "Market Chatter: SoftBank, Samsung, OpenAI Chiefs Discuss AI Collaboration in Seoul",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SoftBank Group's  Masayoshi Son, Samsung's  Lee Jae-yong, and OpenAI's Sam Altman met in Seoul to discuss AI collaboration, Yonhap News reported Tuesday. </p><p class=\"\">The talks, held at a Samsung office, focused on mobile and AI strategies. </p><p class=\"\">Son called the discussions \"very good\" but gave no confirmation on Samsung joining OpenAI's 500 billion-dollar Stargate project, which aims to build AI infrastructure in the US with SoftBank and Oracle. </p><p class=\"\">Altman, on an Asia tour, earlier said South Korean firms would play a key role in Stargate. The meeting marked Jae-yong's first public appearance since his acquittal on accounting fraud charges. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463721:0/",
            "pub_date": "2025-02-05 13:23:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0F7:0",
            "title": "India's finance ministry asks employees to avoid AI tools like ChatGPT, DeepSeek",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's finance ministry has asked its employees to avoid using AI tools including ChatGPT and DeepSeek for official purposes, citing risks posed to confidentiality of government documents and data, an internal department advisory showed. </p><p class=\"\">Countries like Australia and Italy have placed similar restrictions on the use of DeepSeek, citing data security risks. Reports of the advisory surfaced on social media on Tuesday, ahead of a scheduled visit to India by OpenAI chief Sam Altman on Wednesday, when he is also due to meet the IT minister.</p><p class=\"\">\"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc.) in the office computers and devices pose risks for confidentiality of (government) data and documents,\" said the advisory by the Indian finance ministry dated Jan. 29.</p><p class=\"\">Representatives for India's finance ministry, ChatGPT-parent OpenAI and DeepSeek did not immediately respond to requests for comment. </p><p class=\"\">Three finance ministry officials said the note was genuine and the note was issued internally this week. </p><p class=\"\">Reuters could not immediately confirm whether similar directives have been issued for other Indian ministries. </p><p class=\"\">OpenAI is facing heat in India due to a high-profile copyright infringement battle with the country's top media houses, and has said in court filings that it does not have its servers in the country and Indian courts should not hear the matter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0F7:0-india-s-finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek/",
            "pub_date": "2025-02-05 13:23:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000059_20250205000137:0",
            "title": "Toyota Shares Extend Gains, Now Up 5.0%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000059_20250205000137:0/",
            "pub_date": "2025-02-05 13:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0D0:0",
            "title": "Australian mining stocks jump on strong metals prices, weaker dollar",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australian mining sub-index  rose more than 2%, clocking its biggest daily pct gain since Dec. 10</p><p class=\"\">** Sector heavyweights Rio Tinto  and BHP  rise 2.3% and 1.5%, respectively, to hit 2-week highs; Fortescue  about 2% higher</p><p class=\"\">** The positive overnight leads from the U.S. and new all-time highs in precious metals are contributing to the strong performance of miners, according to Junvum Kim, Asia Pacific senior sales trader with Saxo Markets</p><p class=\"\">** Materials and miners sector also supported by strength in metals such as copper, which is up for third straight day </p><p class=\"\">** Softer U.S. dollar is additionally helping commodity players, as a weaker dollar typically supports commodity prices, Kim added </p><p class=\"\">** An additional 10% tariff on Chinese imports came into effect on Tuesday, and was met with a package of retaliatory measures from China, which included stricter export regulations for tungsten and four other critical metals</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0D0:0-australian-mining-stocks-jump-on-strong-metals-prices-weaker-dollar/",
            "pub_date": "2025-02-05 13:25:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000128:0",
            "title": "Toyota Raises Earnings Guidance After Profit Jumps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after reporting a jump in third-quarter net profit on higher revenue.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion, for the three months ended Dec. 31. That beat the estimate of Y1.175 trillion in a poll of analysts by data provider Quick.</p><p class=\"\">Third-quarter revenue rose 2.9% to Y12.391 trillion.</p><p class=\"\">For the fiscal year ending March, Toyota now expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously expected Y3.570 trillion in net profit and Y46.000 trillion in revenue. The company left its fiscal-year group vehicle-sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\">The company has benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles, though it struggled in China, the world's largest auto market, like many other foreign carmakers.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them on Monday.</p><p class=\"\">Japanese auto stocks fell after the announcement of U.S. tariffs raised concerns about their U.S. sales of cars made in the North American trading partners and a further escalation in trade conflicts.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000128:0-toyota-raises-earnings-guidance-after-profit-jumps/",
            "pub_date": "2025-02-05 13:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0I8:0",
            "title": "India's ONCG adds to gains as Macquarie upgrades to 'outperform'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** ONGC shares  rise 1.8% to 258.5 rupees, rebounding for second day in a row after post-earnings slide</p><p class=\"\">** Macquarie upgrades to \"outperform\" from \"neutral\"; raises PT to 310 rupees from 250 rupees</p><p class=\"\">** Macquarie echoes other brokerages' bullish view on output growth due to new sites, higher output from older fields</p><p class=\"\">** Expects cumulative oil production growth of 10% over FY24-2027 and gas output growth of about 13%</p><p class=\"\">** Avg rating of 26 analysts remains \"buy\", but PT cuts since result slower median PT by ~2% 307.5 rupees -LSEG data</p><p class=\"\"> ($1 = 87.1220 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0I8:0-india-s-oncg-adds-to-gains-as-macquarie-upgrades-to-outperform/",
            "pub_date": "2025-02-05 13:17:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463714:0",
            "title": "Husqvarna to Sell US Manufacturing Site to Flex Under New Partnership",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Husqvarna (HUSQ-A.ST, HUSQ-B.ST) entered into an agreement to sell its manufacturing operations in South Carolina, US, to Flex. </p><p class=\"\">As part of the partnership, Flex will take over the operations at the Orangeburg site and continue producing Husqvarna's wheeled products and assembling handheld products for the North American market, according to a Tuesday release. The workforce at the site will be given an employment option with Flex. </p><p class=\"\">The Swedish manufacturer of forest and gardening power tools expects 350 million kronor in cost savings through the partnership in five years. The one-time costs are expected to be 250 million kronor, booked in the fourth quarter of 2024, and a limited cost booked for the first quarter of 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463714:0/",
            "pub_date": "2025-02-05 13:17:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000130:0",
            "title": "Hong Kong's Retail Sales May Rise 5% Increase This Year, CGS International Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000130:0/",
            "pub_date": "2025-02-05 13:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463719:0",
            "title": "Metropolis Healthcare's Consolidated Net Profit Rises in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Metropolis Healthcare  recorded an increase in its attributable consolidated net profit to 313.6 million Indian rupees in the fiscal third quarter from 271.6 million rupees a year ago, according to a Tuesday filing with the Indian exchanges by the healthcare services provider. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 6.09 rupees from 5.28 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 also increased to 3.23 billion rupees from 2.91 billion rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463719:0/",
            "pub_date": "2025-02-05 13:19:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463722:0",
            "title": "Market Chatter: Honda's Push for Full Nissan Takeover Puts $58 Billion Merger at Risk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Honda Motor's  proposal to make Nissan  a wholly owned subsidiary has put their planned $58 billion merger at risk, Financial Times reported Wednesday, citing sources familiar with the matter. </p><p class=\"\">The original plan involved a jointly-owned holding company to maintain Nissan's brand and autonomy, but Honda's unexpected \"take it or leave it\" offer has strained negotiations, the report said. </p><p class=\"\">Tensions have emerged over equity ratios and asset valuations, with Nissan's partner Renault, which holds a 36% stake, urging Nissan to seek a higher premium reflecting Honda's control. </p><p class=\"\">The two automakers have delayed their initial plan to finalize the merger direction by January, now targeting mid-February, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463722:0/",
            "pub_date": "2025-02-05 13:19:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463720:0",
            "title": "Market Chatter: China Tariffs on US Energy to Have Limited Impact, Goldman Sachs Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Goldman Sachs has downplayed the potential impact of China's new tariffs on US energy products, Reuters reported Tuesday. </p><p class=\"\">China recently imposed tariffs of up to 15% on US coal and LNG in response to the 10% tariffs levied by the Trump administration on Chinese imports. </p><p class=\"\">Goldman Sachs suggests that the impact on energy prices will be limited due to the likely redirection of LNG and coal exports. The bank anticipates that these exports will find alternative markets, such as Japan and South Korea, while China seeks new suppliers, according to the report. </p><p class=\"\">Goldman Sachs also indicated that existing Pacific basin supplies could be diverted to China, the report said. </p><p class=\"\">Additionally, Goldman Sachs believes the tariffs will have minimal effect on commodity freight rates, citing the distance between the US and China as trading partners. </p><p class=\"\">The most significant potential consequence of the tariffs, according to the report, is a possible freeze on new long-term LNG contract agreements between US export facilities and Chinese buyers. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463720:0/",
            "pub_date": "2025-02-05 13:20:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463712:0",
            "title": "Champion Technology Raises HK$39 Million via Share Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Champion Technology Holdings  raised HK$38.5 million in net proceeds by placing 164.1 million shares to at least six investors at HK$0.245 apiece. </p><p class=\"\">The company plans to use the proceeds mainly as working capital for its green energy business, according to a Tuesday disclosure.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463712:0/",
            "pub_date": "2025-02-05 13:20:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0H1:0",
            "title": "India's benchmark indexes muted as energy stocks offset drop in consumer shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's equity benchmarks were little changed on Wednesday as gains in energy shares, driven by ONGC and oil marketing companies on an improved earnings outlook, offset a drop in consumer stocks.</p><p class=\"\">The Nifty 50  was up 0.15% at 23,774 points, as of 10:47 a.m. IST, while the BSE Sensex  traded 0.06% lower at 78,539.29.</p><p class=\"\">Both the Nifty and Sensex advanced 1.6% and 1.8%, respectively, on Tuesday, logging their best session in a month to turn positive so far in 2025.</p><p class=\"\">While the benchmarks were muted on the day, the broader markets extended gains from the prior session. The smallcaps  and midcaps  jumped 1.9% and 1.2%, respectively. </p><p class=\"\">Energy  and state-owned firms &lt;.NIFTYPSE&gt; gained about 1.5% each, with ONGC  leading the charge following an improved production outlook for fiscal year 2025-28. This resulted in Macquarie upgrading the stock to \"outperform\" from \"neutral\".</p><p class=\"\">Oil marketing companies BPCL  and HPCL  rose 3.4% each after Goldman Sachs upgraded them to \"buy\" from \"neutral\", citing improved earnings outlook for the companies.</p><p class=\"\">\"Markets are anticipating an interest rate cut from the Reserve Bank of India, which will lower capital costs and fuel economic expansion. This expectation is keeping sentiment positive despite global trade uncertainty,\" said A Balasubramanian, managing director and CEO of Aditya Birla Sun Life AMC.</p><p class=\"\">The RBI is expected to deliver a 25 basis-point rate cut on Friday, supporting a growth revival following the announcement of personal tax cuts.              </p><p class=\"\">Consumer stocks  shed 1% on Wednesday, taking their three-session losses to about 3% and erasing the gains made on Feb. 1, when the annual budget was unveiled.           </p><p class=\"\">Among individual stocks, Asian Paints  lost 4% after the paint maker missed third-quarter profit view.</p><p class=\"\">Tata Power (TTP.NS) gained 3.5% after posting a higher December-quarter profit.    </p><p class=\"\">($1 = 87.1530 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0H1:0-india-s-benchmark-indexes-muted-as-energy-stocks-offset-drop-in-consumer-shares/",
            "pub_date": "2025-02-05 13:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463726:0",
            "title": "Singapore Retail Sales Drop 2.9% in December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's retail sales declined 2.9% in December 2024, following a 0.5% drop in November, data from the Department of Statistics showed on Wednesday. </p><p class=\"\">Excluding motor vehicles, sales fell 4%. </p><p class=\"\">The retail sales value totaled SG$4.6 billion, with online sales making up 13.4%, down from 14.7% in November. Sales in most segments, including electronics and apparel, declined, while food and beverage sales rose 1%. </p><p class=\"\">Food service sales saw a 16.7% jump for food caterers, but fast food and restaurants saw slower growth.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463726:0/",
            "pub_date": "2025-02-05 13:20:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0J9:0",
            "title": "Qatar Insurance FY Profit Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">QATAR INSURANCE  :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY NET PROFIT 725.3 MILLION RIYALS VERSUS 601.2 MILLION RIYALS YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY DIVIDEND QAR 0.1 PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0J9:0-qatar-insurance-fy-profit-rises/",
            "pub_date": "2025-02-05 13:20:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000114:0",
            "title": "USPS's Suspension of Chinese Packages Highlights Challenges Implementing New Tariff Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.S. Postal Services will likely need time to sort out how to implement new the tariff policy before resuming acceptance of Chinese packages, according to Chelsey Tam, senior equity analyst at Morningstar in an email. The process poses a significant challenge, given that in 2024, an estimated 4 million daily packages arrived in the U.S. under the de minimis rule, which allows low-value shipments to bypass duties and custom scrutiny, Tam says. The Trump administration revoked this exemption for China as part of broader tariff measures. Among Chinese e-commerce players, PDD Holdings will be hurt as its overseas e-commerce platform Temu has a significant exposure in the U.S., the analyst notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000114:0/",
            "pub_date": "2025-02-05 13:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW04N:0",
            "title": "China Lunar New Year holiday box office takings hit record high of $1.3 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's film market achieved a record high of 9.5 billion yuan  ($1.3 billion) in takings over the Lunar New Year period, 18.8% higher than the same period last year, as movie-goers flocked to cinemas to watch movies such as \"Nezha 2\". </p><p class=\"\">The box office figure, calculated by Reuters based on data from ticketing platform Maoyan , surpassed last year's record of 8.0 billion yuan for the same eight day period.</p><p class=\"\">A big draw has been \"Nezha 2\", a sequel to the 2019 animated hit that follows the adventures of the iconic Chinese mythological character Nezha. Box office tracker Beacon data showed that by 1.00 a.m. Wednesday (1500 GMT Tuesday), \"Nezha 2\" alone had grossed over 5 billion yuan. </p><p class=\"\">Some movie goers told Reuters that the show was so popular that they needed to buy tickets one or two days in advance. </p><p class=\"\">On Jan. 29, the first day of the Lunar New Year, the box office exceeded 1.8 billion yuan, with over 35 million cinema visits, setting a new single-day record. </p><p class=\"\">Trailing behind \"Nezha 2\" were all domestic films, including the comedy mystery \"Detective Chinatown 1900\", the epic fantasy \"Creation of the God II: Demon Force\", and the martial arts film \"Legends of the Condor Heroes: The Gallants\".</p><p class=\"\">($1 = 7.2832 Chinese yuan renminbi)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW04N:0-china-lunar-new-year-holiday-box-office-takings-hit-record-high-of-1-3-bln/",
            "pub_date": "2025-02-05 13:11:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446670:0",
            "title": "Singapore Retail Sales Fall at Faster Pace",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Retail sales in Singapore dropped by 2.9% year-on-year in December 2024, slipping further from a downwardly revised 0.5% fall in the previous month.</p><p class=\"\">This marked the second consecutive month of falling retail trade, as sales continued to decline for department stores (-4.5% vs -3.7% in November), mini-marts and convenience store (-9.3% vs -8.8%), wearing apparel and footwear (-6.7% vs -3.1%), and computer and telecommunications equipment (-13.1% vs -11%).</p><p class=\"\">Additionally, sales tumbled for furniture and household equipment (-4.8% vs 1.9%) and watches and jewelry (-6.2% vs 2.2%).</p><p class=\"\">Meanwhile, sales accelerated for food and alcohol (9.4% vs 4.6%) and motor vehicles (6% vs 5.2%).</p><p class=\"\">On a seasonally adjusted monthly basis, retail sales decreased 1.5% in December 2024, slowing from a 2.8% fall in the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446670:0-singapore-retail-sales-fall-at-faster-pace/",
            "pub_date": "2025-02-05 13:11:41",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        }
    ]
}