{
    "data": [
        {
            "id": "cnbctv:6c8e9e461094b:0",
            "title": "Here's why UBS has downgraded its rating on US equities to 'benchmark'",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Brokerage firm UBS in its recent note downgraded its rating on US equities to 'benchmark' but its 'high-conviction overweight' recommendation continued to be emerging markets.</span></p><p class=\"\"><span> UBS said it has downgraded the US to 'benchmark' in a 100% dedicated equity portfolio due to low operational leverage, the dollar risk, policy volatility, among other factors.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Low operational leverage</span></strong></p><p class=\"\"><span> UBS said the US has the lowest operational leverage of any major region. Hence, it historically underperforms if global growth accelerates to be above 3.5%.</span></p><p class=\"\"><span> The analyst has now forecast 3.4% global GDP in 2026, being above the Bloomberg consensus in Europe, US and Japan for the year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dollar risk</span></strong></p><p class=\"\"><span> The analyst has forecast the euro vs dollar to be 1.22 by the end of the the first quarter of the calendar year 2026. It said it continues to see asymmetric structural downside risks to the dollar.</span></p><p class=\"\"><span> Historically, if the dollar falls 10%, the US underperforms around 4% in unhedged terms, the analyst said. In the past quarter, the uplift to US earnings from a weaker dollar was much less than normal, it added.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Buyback yield is no longer exceptional</span></strong></p><p class=\"\"><span> UBS said the US' buyback yield is now only on par with global peers, this impacts funds flow, earnings per share and valuation. Hence, the total yield -- dividend + buybacks -- in the US is now half of Europe, whereas it used to be on par, it said</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Valuation</span></strong></p><p class=\"\"><span> The sector-adjusted price-to-earnings is 35% above peers, against a norm of 4% since 2010. Around 60% of the sectors are not only trading on a higher price-to-earnings ratio in the US than peers, but also at a higher ratio than their normal premium, UBS said.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tech at benchmark</span></strong></p><p class=\"\"><span> As much as 80% of the global tech market cap is in the US. Hence, 80% of the time tech outperforms, the US outperforms, it said.</span></p><p class=\"\"><span> Hyperscalers ave now underperformed year-to-day, but semis have outperformed by 5%, it said. UBS thinks this must be time-limited.</span></p><p class=\"\"><span> The capex-to-sales of the hyperscalers has now risen to 35% from 10% in 2022 and that is inconsistent with record margins, it said.</span></p><p class=\"\"><span> In many instances, the free-cash-flow after accounting for shareholder-based compensation is low, it added.</span></p><p class=\"\"><span> Other concerns on the remain -- Threats to growth of online advertising and the rise in memory prices might hit consumer electronic demand more than expected, UBS added.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Positioning</span></strong></p><p class=\"\"><span> UBS said from its marketing in North America, it seems unambiguous that funds would go global as shown inside of ETF flows. UBS crowding data still shows the US to be most crowded market.</span></p><p class=\"\"><span> With the US at 63% of the MSCI AC World, then small amounts of switching go a long way.</span></p><p class=\"\"><span> ETF flows show diversification is happening, as 45% of the recent flows have gone into non-US equities, UBS said.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Policy volatility</span></strong></p><p class=\"\"><span> The analyst said policy volatility and a potentially narrowing gap in corporate governance (to Japan and Korea) come on the back of this year, there being changes in tariffs, moves to potentially cap interest rates on credit cards and limiting the ability of price-to-earnings ratio to invest in housing, further risks to drug pricing and proposal to limit dividends/buybacks in defence companies</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Risk of underperformance looks higher</span></strong></p><p class=\"\"><span> UBS said it is not underweight on US equities as the risk of underperformance looks higher than outperformance.</span></p><p class=\"\"><span> The US has more of a symbiotic relationship between rising equities and rising GDP than elsewhere. UBS said it remains bullish on equities globally. As per the analysts calculations, 10% on US equities adds 1% to US GDP, which adds 4% to earnings per share.</span></p><p class=\"\"><span> It said while earnings revisions are still just better than the market and even by year-end earnings growth is 11% better than non-tech. It is wary of price-to-earnings ratios for tech, but they can't be entirely ignored.</span></p><p class=\"\"><span> The analyst also believes the US will adopt AI quicker than most other regions because of the flexibility of its labour market. However, UBS' European economists pointed that the cost saving is less than in Europe.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:6c8e9e461094b:0/",
            "pub_date": "2026-02-28 14:19:21",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2950319:0",
            "title": "AIKE.B: Revenue and margins improved sequentially, but liquidity remains a critical challenge",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw sharply reduced revenue and continued losses amid liquidity constraints, but cost discipline improved margins and the SaaS platform maintained strong market interest. Additional financing is essential for future growth and operational stability.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2950319-2ae56d8475507cff79cac86a3e659174\" target=\"_blank\">AIKE MEDIA AB CLASS B [AIKE.B] Interim report — Feb. 28 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2950319:0-aike-b-revenue-and-margins-improved-sequentially-but-liquidity-remains-a-critical-challenge/",
            "pub_date": "2026-02-28 14:14:23",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000008:0",
            "title": "Berkshire Hathaway's Earnings Are Nearly Here. Abel's Letter Will Be Top of Mind for Investors. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>The inaugural shareholder letter from  Berkshire Hathaway CEO Greg Abel is due on Saturday, along with Berkshire's annual report and fourth-quarter earnings. Wall Street will be on alert for Abel's insights on key issues such as dividends and stock repurchases.</span></p><p class=\"\"><span>Abel, 63, became CEO at year-end when Warren Buffett retired from the job after 60 years at the helm. Abel was Buffett's handpicked successor and had overseen the company's vast non-insurance operating units for nearly eight years before becoming CEO.</span></p><p class=\"\"><span>Buffett, 95, remains chairman, is the company's controlling shareholder and has said he plans to be at Berkshire's Omaha offices daily this year.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000008:0/",
            "pub_date": "2026-02-28 14:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:39204714b094b:0",
            "title": "Solana’s Next Major Support Levels Sit At $50, $22, And $10: Analyst",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>An analyst has pointed out where Solana support levels could lie based on a Parallel Channel forming in the asset’s weekly price chart.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Solana Parallel Channel Could Indicate Support At These Levels</span></strong></p><p class=\"\"><span>In a new post on X, analyst Ali Martinez has discussed how support is looking for Solana from the perspective of a Parallel Channel that may be emerging in its 7-day price.</span></p><p class=\"\"><span>The “Parallel Channel” is a pattern from technical analysis (TA) that forms whenever an asset trades between two parallel trendlines. There are a few different ways a Parallel Channel can be categorized based on the orientation of its trendlines.</span></p><p class=\"\"><span>Ascending Channels involve lines that are pointing up, while Descending Channels have a downward slope. These types correspond to periods of parallel consolidation to a net upside and downside, respectively.</span></p><p class=\"\"><span>In the context of the current topic, the third and the most basic type is of interest: a Parallel Channel that’s parallel to the time-axis. As the price moves inside such a channel, it observes a phase of perfectly sideways action.</span></p><p class=\"\"><span>Now, here is the chart shared by Martinez that shows the Parallel Channel that the weekly price of Solana has potentially been moving inside in recent years:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:480px;aspect-ratio:0.8\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:39204714b094b-2f943ca53b9704b2d9948b1b6af6af0e-resized.webp\" type=\"image/webp\"/><img alt=\"Solana Parallel Channel\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:39204714b094b-2f943ca53b9704b2d9948b1b6af6af0e-resized.webp\" style=\"background-color:#f1f1f1\"/></picture></div></button></figure><p class=\"\"><span>As displayed in the above graph, Solana retested the upper level of the Parallel Channel a couple of times during 2025. Each time, the price ended up topping out and a decline followed. The upper line of a Parallel Channel is considered to be a source of resistance, so these rejections may have been signs of the pattern being in action.</span></p><p class=\"\"><span>Since the latest rejection, SOL has been moving down in a sharp manner as the cryptocurrency sector as a whole has observed a bearish shift. So far, the coin is still contained inside the upper half of the channel, but if momentum weakens, it might end up traveling lower.</span></p><p class=\"\"><span>According to the analyst, these levels could act as support in such a scenario: $50.22, $22.47, and $9.98. These levels correspond to a point 50%, 75%, and 100% down the channel, respectively.</span></p><p class=\"\"><span>Solana last tested the lower-most of these levels during the bear market of the previous cycle. Back then, it had helped the cryptocurrency reach a bottom. It now remains to be seen which direction the asset will go next and if a retest of any of these levels will take place.</span></p><p class=\"\"><span>SOL isn’t the only cryptocurrency observing a Parallel Channel setup. As Martinez has highlighted in another X post, the monthly price of Stellar (XLM) has also been moving down such a pattern, with possible support levels existing at 0.147, 0.078, and 0.041.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:480px;aspect-ratio:0.8\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:39204714b094b-835925eca2c0892ea9408a107a4ee152-resized.webp\" type=\"image/webp\"/><img alt=\"Stellar Parallel Channel\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:39204714b094b-835925eca2c0892ea9408a107a4ee152-resized.webp\" style=\"background-color:#f0f0f0\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOL Price</span></strong></p><p class=\"\"><span>At the time of writing, SOL is floating around $81, down 5.5% in the last 24 hours.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:39204714b094b:0-solana-s-next-major-support-levels-sit-at-50-22-and-10-analyst/",
            "pub_date": "2026-02-28 14:00:13",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:97df5ee72086e:0",
            "title": "U.S. Dollar Falls Against Euro, Franc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - The U.S. dollar fell against the euro and the Swiss franc in the New York session on Friday.</span></p><p class=\"\"><span>The greenback fell to 1.1826 against the euro.</span></p><p class=\"\"><span>The greenback dropped to a 2-week low of 0.7671 against the franc.</span></p><p class=\"\"><span>The currency is seen finding support around 1.22 against the euro and 0.76 against the franc.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:97df5ee72086e:0-u-s-dollar-falls-against-euro-franc/",
            "pub_date": "2026-02-28 13:34:32",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:79ba10d7f094b:0",
            "title": "Eric Balchunas Says Morgan Stanley’s New Move Could Unlock ‘Boomer Money’ For Crypto",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Bloomberg ETF analyst Eric Balchunas said that even small investments from the \"massive network of what he called 'Boomer money' could bring in fresh capital into digital assets.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>A 1% to 2% portfolio investment from older generations could generate tens of billions for digital assets, reiterated the analyst.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Data from the Federal Reserve indicates that Baby Boomers and people over 70 own more than 80% of U.S. wealth, even though younger people are more likely to use crypto.</span></li></ul></span></div><span><p class=\"\"><span>Eric Balchunas, Senior Analyst at Bloomberg ETF, had a strong reaction to Morgan Stanley's decision to apply for a national trust bank charter to hold digital assets. He said that this could open the door for a huge new group of investors to get into crypto.</span></p><p class=\"\"><span>On Friday, Balchunas wrote on X, \"Wow, they're really going all the way,\" pointing out that the big Wall Street firm not only applied to hold digital assets but also has spot Bitcoin and Ether ETFs in the works. “Esp notable IMO given they have 16k advisors that manage $7T for 18 million people. It’s like a massive network of Boomer money.”</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:495.5974842767295px;max-width:1200px;aspect-ratio:2.421319796954315\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:79ba10d7f094b-7bad3b3a95bb43c58edb72f66aa766d5-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-27 at 10.57.27 PM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:79ba10d7f094b-7bad3b3a95bb43c58edb72f66aa766d5-resized.webp\" style=\"background-color:#dadada\"/></picture></div></button></figure><p class=\"\"><span>Bloomberg reported on Friday that Morgan Stanley has applied for a new national trust bank charter. This would allow the Wall Street giant to hold digital assets directly and greatly increase its presence in the cryptocurrency market.</span></p><p class=\"\"><span>An application filed with the Office of the Comptroller of the Currency (OCC) on February 18 says that the proposed entity would not only protect crypto assets but also trade them and offer staking services to the company's investment clients. The trust bank would be based in Purchase, New York, but would offer services nationwide.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Boomers Entering Crypto</span></strong></p><p class=\"\"><span>Historically, crypto adoption has largely been directed towards younger people, even though the 62 to 80 age cohort is more financially stable. According to the Federal Reserve data on wealth distribution, U.S. wealth is heavily concentrated among older generations, with Baby Boomers and those over 70 holding over 80% of total wealth. </span></p><p class=\"\"><span>Balchunas hinted that older people could get into the crypto space as Morgan Stanley's advisors build and manage portfolios for millions of clients, many of whom are close to retirement or already retired. A small investment of 1% to 2% of portfolios across a small part of the company's $7 trillion platform could bring in tens of billions of dollars for digital assets.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Morgan Stanley’s Steps Forward In Crypto Adoption</span></strong></p><p class=\"\"><span>The company hired Amy Oldenburg as the head of digital-asset strategy in January. The bank had also applied for spot Bitcoin (BTC), Ethereum (ETH), and Solana (SOL) exchange-traded funds, indicating that it wanted to give its clients more options for getting into crypto. Morgan Stanley also worked with Zerohash to let E*Trade customers trade digital assets starting this year.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1019.0163934426229px;aspect-ratio:1.698360655737705\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/stocktwits:79ba10d7f094b-0b7d8ed463dfbb1e13abd91a179ff6ea-resized.webp\" type=\"image/webp\"/><img alt=\"Screenshot 2026-02-28 at 12.06.02 AM.png\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/stocktwits:79ba10d7f094b-0b7d8ed463dfbb1e13abd91a179ff6ea-resized.webp\" style=\"background-color:#e1e1e1\"/></picture></div></button></figure><p class=\"\"><span>As of writing, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/bitcoin\" rel=\"nofollow\" target=\"_blank\">Bitcoin (BTC)</a><span> was trading at $65,677.09, down 3% in the last 24 hours. On Stoctwits, retail sentiment around BTC remained in the ‘neutral’ zone, accompanied by ‘low’ chatter levels over the past day. Ethereum and Solana were also down 5.7% and 6.9%, respectively, in the last 24 hours. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:79ba10d7f094b:0/",
            "pub_date": "2026-02-28 13:24:34",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZO01O:0",
            "title": "BlackRock and Goldman Sachs join race to fund Phoenix’s pension business - FT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>-- Source link: https://tinyurl.com/2muf63ym</span></p><p class=\"\"><span>-- Note: Reuters has not verified this story and does not vouch for its accuracy</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZO01O:0-blackrock-and-goldman-sachs-join-race-to-fund-phoenix-s-pension-business-ft/",
            "pub_date": "2026-02-28 13:07:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:aa08ea5f1094b:0",
            "title": "Mt. Gox's former CEO floats hard fork to recover 80K hacked Bitcoin",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Mark Karpelès, the former CEO of Mt. Gox, is calling on community support for a proposal to recover more than $5.2 billion stolen from his Bitcoin exchange more than a decade ago.</span></p><p class=\"\"><span>On Friday, Karpelès submitted a proposal on GitHub to add a consensus rule that would allow the 79,956 Bitcoin hacked from Mt. Gox (currently sitting in a single wallet) to be moved to a recovery address without the original private key. </span></p><p class=\"\"><span>“These coins have not moved in over 15 years. They are among the most well-known and publicly tracked UTXOs in Bitcoin's history,” he wrote.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:363.98104265402844px;max-width:1200px;aspect-ratio:3.2968749999999996\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:aa08ea5f1094b-3876bdedbf145ee0288e202f429b72c8-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:aa08ea5f1094b-3876bdedbf145ee0288e202f429b72c8-resized.webp\" style=\"background-color:#f2f3f3\"/></picture></div></button></figure><p class=\"\"><span>Karpelès said that with Mt. Gox trustee Nobuaki Kobayashi already overseeing distributions to creditors, if the coins were recoverable, the existing legal and logistical framework would distribute them to their rightful owners. </span></p><p class=\"\"><span>“I want to be upfront: this is a hard fork. It makes a previously invalid transaction valid. All nodes would need to upgrade before the activation height. I'm not trying to disguise that fact or sneak it through as something else,” he added.</span></p><p class=\"\"><span>However, Karpelès said the proposal wasn’t intended to bypass the Bitcoin development process; instead, it was an attempt to start a discussion with the Bitcoin community.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:358.32037325038885px;max-width:1200px;aspect-ratio:3.348958333333333\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:aa08ea5f1094b-fe5e86b163685576a295918887c6d0a1-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:aa08ea5f1094b-fe5e86b163685576a295918887c6d0a1-resized.webp\" style=\"background-color:#f5f6f6\"/></picture></div></button></figure><p class=\"\"><span>“The MtGox trustee has declined to pursue on-chain recovery, citing the uncertainty of whether such a consensus change would ever be adopted,” he said. </span></p><p class=\"\"><span>“This creates a deadlock: the trustee won't act without certainty, and the community can't evaluate the idea without a concrete proposal. This patch breaks that deadlock by providing something concrete to discuss.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin immutability at risk, say critics </span></strong></p><p class=\"\"><span>Karpelès’ proposal saw strong opposition on the online forum Bitcointalk, with most arguing that it would set a bad precedent for Bitcoin, a decentralized cryptocurrency intended to be irreversible and immutable. </span></p><p class=\"\"><span>“Each time a hack incident [happens], someone will call for another new consensus rule to recover stolen funds. This will destroy the bitcoin concept in full,” wrote “coupable,” who has been a member of the forum since 2015. </span></p><p class=\"\"><span>“Bitcoin should be independent from what Law Enforcement decides in any [jurisdictions],” said another forum member known as “PrivacyG.” </span></p><p class=\"\"><span>Karpelès also acknowledged that this would be the strongest argument against the proposal, but argued that the specific case is different enough, as there is both law enforcement and community consensus that the address in question contains Bitcoin stolen from Mt. Gox.</span></p><p class=\"\"><span>Some who claim to be affected by the Mt. Gox bankruptcy were in favor of the proposal.</span></p><p class=\"\"><span>“If those coins ever move by whatever mechanism, then I am going to want my share of them back,” said Samson. </span></p><div class=\"blockquote-xrkxvh37\"><span>“I'm a creditor and have been paid what little was left of my Bitcoin from the bankruptcy - I got about 15% back… I would support obtaining a court order to claim these coins.”</span></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A brief recap of Mt Gox’s collapse</span></strong></p><p class=\"\"><span>Mt. Gox was once the biggest Bitcoin exchange, operating from 2010 to 2014 and handling 70% of all Bitcoin transactions worldwide. </span></p><p class=\"\"><span>Its global presence, however, made it a honey pot for hackers, who used weaknesses in Mt. Gox’s security systems in 2011 to transfer out thousands of Bitcoin, while other operational errors led to thousands more Bitcoin being “lost.” </span></p><p class=\"\"><span>On Feb. 24, 2014, an alleged leaked document claimed that the company was insolvent after losing 744,408 Bitcoin in a theft that was undetected for years. </span></p><p class=\"\"><span>The exchange filed for bankruptcy protection in Tokyo on Feb. 28, 2014, reporting it had about $65 million in liabilities after losing 750,000 of its customers’ Bitcoin and 100,000 of its own, worth nearly half a billion dollars at the time. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Magazine: </span></strong></em><em><strong class=\"root-Tkn6WL2y\"><span>Review: The Devil Takes Bitcoin, a wild history of Mt. Gox and Silk Road</span></strong></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:aa08ea5f1094b:0-mt-gox-s-former-ceo-floats-hard-fork-to-recover-80k-hacked-bitcoin/",
            "pub_date": "2026-02-28 12:59:48",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:aa20fb542653a:0",
            "title": "Key facts: India targets 30% coal import cut by 2026; Coal India holds 115M tons",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>India aims to cut coal imports for power by 30% by 2026, targeting a 15 million ton reduction this year, boosted by higher domestic output from Coal India and private miners.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L4N3ZJ0G5:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>As of February 26, 2026, Coal India Ltd's producing units are maintaining significant pithead coal stocks totaling 115 million tonnes.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_FWN3ZN093:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:aa20fb542653a:0-key-facts-india-targets-30-coal-import-cut-by-2026-coal-india-holds-115m-tons/",
            "pub_date": "2026-02-28 13:03:05",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:608a67bb8094b:0",
            "title": "Weekly Wrap: ESMA Reins In Crypto Perps; 74% of Capital.com Gold Trades Closed in One Hour",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ESMA clips perpetual futures with CFD limits</span></strong></p><p class=\"\"><span>Europe’s top securities regulator warned that perpetual futures and similar perpetual contracts popular in crypto trading are very likely covered by existing EU rules on contracts for differences (CFDs), no matter how firms brand them.</span></p><p class=\"\"><span>The European Securities and Markets Authority (ESMA) said investment firms must assess whether these products fall within the scope of the bloc’s CFD product intervention regime.</span></p><p class=\"\"><span>If they do, firms must apply the full CFD rulebook, including leverage limits, standardized risk warnings, margin close-out rules, negative balance protection.</span></p><p class=\"\"><span>Can this latest directive kill crypto perpetuals contracts in the region altogether? European providers currently offer up to 10x leverage on perps, but if these products are classified as CFDs, the maximum leverage would drop to 2x.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Retail CFDs could rival US stocks by 2028</span></strong></p><p class=\"\"><span>Meanwhile, retail traders are quietly taking a much bigger slice of the global FX pie. FMintel’s new analysis of more than 50 retail brokers worldwide finds that retail CFD trading now makes up about 14% of daily global FX turnover, up from just 2.7% five years ago.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1080px;aspect-ratio:1.7999999999999998\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-ebc84f0b3ee39a666c05d3f444dd7f8a-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-ebc84f0b3ee39a666c05d3f444dd7f8a-resized.webp\" style=\"background-color:#050506\"/></picture></div></button></figure><p class=\"\"><span>The study builds on the Bank for International Settlements’ 2025 Triennial Survey, which put average daily over-the-counter FX turnover at 9.6 trillion dollars in April 2025, a 28% jump from 7.5 trillion dollars in 2022.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>iFOREX debut on LSE main market</span></strong></p><p class=\"\"><span>In London, a new name has joined the small group of listed retail CFD brokers. iFOREX, which is based in the British Virgin Islands, began trading on the London Stock Exchange’s Main Market on Wednesday under the ticker IFRX. Its shares rose 6% to 207 pence in their market debut, signaling a warm welcome from investors.</span></p><p class=\"\"><span>The listing completes a process that began in May 2025 but was temporarily paused as the broker worked through regulatory compliance issues raised by authorities in the British Virgin Islands. With those concerns now resolved, iFOREX has secured approval for the admission of its full share capital, allowing around 22.2 million ordinary shares to trade freely in London.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>IG set to join FTSE 100</span></strong></p><p class=\"\"><span>Still in the UK, IG is expected to enter the FTSE 100 index, based on changes FTSE Russell published ahead of its March 2026 quarterly review. The preliminary list is based on market data as of February 20, with the formal review to use closing prices on March 3 and confirmed changes to be announced after the market closes on March 4.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:709.8684210526316px;aspect-ratio:1.1831140350877192\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-37038be7d02f354f527bdc9e3b767692-resized.webp\" type=\"image/webp\"/><img alt=\"FTSE 100\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-37038be7d02f354f527bdc9e3b767692-resized.webp\" style=\"background-color:#f2f2f2\"/></picture></div></button></figure><p class=\"\"><span>If the move is confirmed, IG Group will shift from the FTSE 250 into the FTSE 100 as part of the regular rebalance. Index-tracking funds and ETFs tied to the FTSE 100 would then add the stock, while vehicles benchmarked to the FTSE 250 would remove it, typically triggering trading as passive investors adjust their portfolios.</span></p><p class=\"\"><span>In Africa, the story looks different for the London-listed broker. IG closed its South Africa office and laid off its remaining local staff, after previously employing around 90 people there. The move follows the broker’s decision to stop offering services under its South African unit, while allowing clients to transfer their accounts to offshore entities.</span></p><p class=\"\"><span>The broker had used the South Africa operation mainly as a marketing hub, making the closure a final step in its exit from the local market. IG also surrendered its South African ODP license, which is required to offer CFD trading in the country.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>74% of Capital.com gold closed within an hour</span></strong></p><p class=\"\"><span>Capital.com reported that 73.8% of gold trades executed on its platform in 2025 were closed within one hour, and 95.9% were completed within 24 hours. The broker noted that this concentration aligned with intraday trading behavior observed during a period of heightened market volatility. </span></p><p class=\"\"><span>The broker ended 2025 with a total trading volume of $3.42 trillion, a 92.1% increase from the $1.78 trillion recorded the previous year. Trading activity remained heavily concentrated in the Middle East, which accounted for about half of the platform’s annual volume. Europe, the broker’s second-largest market, also saw a 73% surge in volumes.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Deriv seeks banking licence in SVG</span></strong></p><p class=\"\"><span>At the same time, Deriv is seeking a banking license from the Financial Services Authority in St. Vincent and the Grenadines. Public records show the broker formed a separate entity on the island in June 2023, with its banking license application now listed as “pending approval.” </span></p><p class=\"\"><span>SVG’s regulator does not grant traditional brokerage licenses but allows firms to offer leveraged trading once they are incorporated locally. However, the authority recently required all forex and CFD companies based in SVG to verify their overseas licenses, effectively making external regulation a condition for operation from the jurisdiction.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>XTB CEO targets spot crypto to lower CFD dominance</span></strong></p><p class=\"\"><span>Also, eying diversification, Omar Arnaout, the CEO of Polish retail brokerage XTB, believes spot cryptocurrency trading could significantly rebalance the firm’s revenue mix within the next two to three years, provided regulatory barriers in Poland are eased.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1087.222808870116px;aspect-ratio:1.8120380147835267\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-e7ee0b136033953c1ec82ad3555c61a0-resized.webp\" type=\"image/webp\"/><img alt=\"XTB shares. Source: Tradingview.com\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/financemagnates:608a67bb8094b-e7ee0b136033953c1ec82ad3555c61a0-resized.webp\" style=\"background-color:#fcfbfb\"/></picture></div></button></figure><p class=\"\"><span>XTB shares. Source: Tradingview.com</span></p><p class=\"\"><span>Arnaout noted that about 95% of XTB’s income currently comes from CFD products, a concentration he said is increasingly frustrating. Arnaout’s goal is to reduce that share to around 70% by expanding into spot crypto and equity trading.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ASEAN's pivot from growth to dividends</span></strong></p><p class=\"\"><span>ASEAN companies are drawing investors’ attention with rising dividend payouts. Equities are shifting from a pure growth narrative to a more income-oriented story as companies across the region deliver strong dividend payouts. </span></p><p class=\"\"><span>The London Stock Exchange Group’s Miko Huang noted that the FTSE ASEAN Index, which tracks large- and mid-cap firms from Singapore, Malaysia, Indonesia, Thailand, and the Philippines has recorded a 10-year average dividend yield of 3.57%.The region’s appeal for dividend-focused investors has strengthened as cash flow per share and dividend payout ratios have remained resilient in recent years.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Prediction markets take center stage</span></strong></p><p class=\"\"><span>Online brokerages have long evolved through successive waves of innovation, from spot forex to CFDs, the rise of retail equity trading, and the expansion into digital assets. Each transition was initially met with scepticism before becoming an industry standard, shaping how brokers retained and competed for market share. </span></p><p class=\"\"><span>The latest shift appears to centre on prediction markets, which are moving beyond their reputation for political and sports forecasting. Industry observers note a growing institutional interest, with prediction markets increasingly viewed as potential macroeconomic instruments rather than niche products, signalling their gradual integration into the broader trading ecosystem.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The link between spreads and market</span></strong></p><p class=\"\"><span>The bid-offer spread has long served as a key indicator of market risk, compensating liquidity providers for holding inventory, managing uncertainty, and bridging information gaps between buyers and sellers. Whether set through dealer negotiations, brokered transactions, or electronic trading, the spread traditionally widened during periods of volatility and narrowed as conditions stabilized, acting as a visible measure of market stress.</span></p><p class=\"\"><span>That relationship has weakened in recent years. Across asset classes and trading models, competitive pressure has compressed spreads to levels detached from underlying risk. What began as a push toward greater efficiency has, in many cases, produced distortion, with spreads no longer performing their original role as reliable shock absorbers for market uncertainty.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Wise reportedly curbs Coinbase transfers</span></strong></p><p class=\"\"><span>Lastly, a LinkedIn post circulating online claims that Wise has started blocking payroll transfers from Coinbase to employees’ Wise accounts in the UK. According to the post, the move has disrupted some workers’ access to their wages and was described as “anti-competitive.”</span></p><p class=\"\"><span>Wise’s public Acceptable Use Policy prohibits customers from using its platform to buy, sell, or trade cryptocurrencies directly. It also states that the company may block or return payments linked to crypto-related businesses based on its compliance checks and risk assessments.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/financemagnates:608a67bb8094b:0-weekly-wrap-esma-reins-in-crypto-perps-74-of-capital-com-gold-trades-closed-in-one-hour/",
            "pub_date": "2026-02-28 12:00:00",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:965da0cde094b:0",
            "title": "Hyperliquid (HYPE) Eyes Native Token Issuance With Latest Upgrade Plan",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Hyperliquid (HYPE), one of the largest decentralized exchanges (DEXs) in the crypto sector, is preparing a significant upgrade that could reshape how new projects launch tokens on its platform. </span></p><p class=\"\"><span>The proposal, known as HIP-6, introduces a framework designed to enable permissionless, on-chain token launches without relying on the off‑chain capital-raising methods that many teams currently use.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>New Hyperliquid Proposal </span></strong></p><p class=\"\"><span>Details of the proposal were shared on social media by James Evans of Reciprocal Ventures. According to Evans, HIP-6 establishes a permissionless token launch auction for new HIP-1 assets, specifically tailored for teams seeking to issue tokens directly on Hyperliquid. </span></p><p class=\"\"><span>The system adapts Uniswap’s continuous clearing auction model to function within Hyperliquid’s central limit order book (CLOB) environment, allowing token launches to occur natively within the exchange’s infrastructure.</span></p><p class=\"\"><span>At present, while HIP-1 and HIP-2 already allow permissionless token deployment and automated liquidity provisioning, gaps remain in capital formation and price discovery. </span></p><p class=\"\"><span>Teams launching tokens on Hyperliquid often need to secure funding off chain, manually provide their own liquidity to seed HIP-2 pools, or release tokens into relatively thin order books. </span></p><p class=\"\"><span>These limitations have meant that, despite its technical strengths, Hyperliquid has not yet reached feature parity with other high-performance ecosystems and exchanges when it comes to initial token offerings. </span></p><p class=\"\"><span>HIP-6 is designed to close that gap, though participation will remain optional for projects. By integrating capital raising and liquidity seeding into a single on-chain flow, the proposal aims to simplify the process for founders. </span></p><p class=\"\"><span>Funds raised during the auction would be split automatically between the token deployer and liquidity provision through HIP-2, reducing operational friction and reliance on external arrangements.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Auction Structure And Ecosystem Growth</span></strong></p><p class=\"\"><span>A core component of the proposal is its approach to price discovery. Instead of a one‑time auction vulnerable to timing strategies, HIP-6 uses a continuous clearing auction that unfolds over multiple blocks. </span></p><p class=\"\"><span>This structure is intended to determine a fair market price while minimizing the “sniping” and last‑minute bidding behavior often seen in traditional token launches.</span></p><p class=\"\"><span>The upgrade also seeks to strengthen the broader ecosystem around Hyperliquid. By creating utility for aligned quote assets, HIP-6 could contribute to higher total value locked (TVL) in those assets and generate yield for the platform’s Assistance Fund. </span></p><p class=\"\"><span>While HIP-6 addresses how new tokens raise funds and establish initial liquidity, it does not dictate how those tokens create long-term value or how their governance systems operate. </span></p><p class=\"\"><span>Mechanisms such as revenue sharing, buybacks, staking rewards, treasury oversight, or voting rights would remain up to individual projects. </span></p><p class=\"\"><span>Similarly, tokenholder protections—such as treasury lockups, on-chain transparency requirements, or vesting schedules affecting both buyers and team allocations—would need to be built on top of the HIP-6 framework.</span></p><p class=\"\"><span>The proposal’s stated objective is to make the initial auction process as efficient and equitable as possible, leaving post-launch design choices to the creativity of the Hyperliquid community.</span></p><p class=\"\"><span>At the time of writing, HYPE, the platform’s native token, was trading at $27.430, representing a 3% drop over the previous 24 hours. </span></p><p class=\"\"><span>Featured image from OpenArt, chart from TradingView.com </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:965da0cde094b:0-hyperliquid-hype-eyes-native-token-issuance-with-latest-upgrade-plan/",
            "pub_date": "2026-02-28 13:00:33",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:8b90a9f10094b:0",
            "title": "Global stocks will get early March test with high stakes US jobs report next week",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The stakes for next week's jobs report just got higher after Friday's hot inflation print, amid rising fears that artificial intelligence will inflict greater damage to the labor market than investors thought.</span></p><p class=\"\"><span>Stocks sold off Friday, with the Dow Jones Industrial Average closing down more than 500 points after the latest wholesale inflation print showed traders have been underestimating pricing pressures.</span></p><p class=\"\"><span> Puzzlingly, the 10-year Treasury yield that would in theory go higher on a hotter inflation report remained below 4%. This raised fears of a stagflation stagflation scenario — in which higher inflation is coupled with slowing economic growth — that kept them in the bond market.</span></p><p class=\"\"><span> Investors trying to understand the economic outlook will read the nonfarm payrolls report carefully, as it will have to tread a fine line: Not too hot as to hurt the interest rate outlook, not too cold as to add to fears of a rapidly deteriorating labor market.</span></p><p class=\"\"><span> \"There is a whole debate in policy making — monetary policy making — about the fact that you could have good employment and yet keep prices into check,\" said Giuseppe Sette, co-founder at Reflexivity.</span></p><p class=\"\"><span> \"But underlying all of this, there is the parallel fear that comes from the AI evolution, and the impact it could have on jobs, and whether that could be a Citrini report kind of scenario,\" Sette added. He was referring to a Citrini Research report that warned AI could destroy the economy in two years, a speculative thesis that spooked markets.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI disruption</span></strong></p><p class=\"\"><span> The latest estimates show that the U.S. economy is expected to have added 60,000 jobs in February, and that the unemployment rate held at 4.3%, according to FactSet.</span></p><p class=\"\"><span> That forecast is far below the blowout report the prior month that showed a headline number of 130,000 jobs. However, it could also reflect the new reality investors have been accepting of in recent months: A \"no hire, no fire\" labor market in which a smaller pool of workers and higher productivity can justify slowing jobs growth.</span></p><p class=\"\"><span> Except fears are higher now amid rising signs that AI could damage the employment picture more than investors had been expecting.</span></p><p class=\"\"><span> The latest headline adding to those fears came from Block, which said Thursday that it's firing 4,000 employees as it utilizes AI to automate more work. On Friday, the stock closed up more than 16% on the news.</span></p><p class=\"\"><span> AI is the driving force behind the S&amp;P 500's more than 64% total gain over the past three years. But what was once the market's friend has recently turned more foe as uncertainty around how the technology will disrupt corporate business models contributed to a selloff in many parts of the market this year.</span></p><p class=\"\"><span> Software stocks have been battered, with the iShares Expanded Tech-Software Sector ETF (IGV) down 8% just this month on fears agentic AI automating work will make the sector obsolete. The IGV is in a bear market.</span></p><p class=\"\"><span> Real estate stocks even turned victim to AI, as investors weighed the possibility that AI will one day make tall office towers unnecessary.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Interest rate outlook</span></strong></strong></p><p class=\"\"><span> A hotter than expected report wouldn't be welcomed by markets either.</span></p><p class=\"\"><span> Mizuho Americas chief economist Steve Ricchiuto expects payrolls of 100,000 in February, much higher than is consensus, though he also expects that the January number will be revised down possibly as much as 50,000. He also said the unemployment rate will hold at 4.3%.</span></p><p class=\"\"><span> That could show investors the U.S. economy is even more exceptionally resilient than they thought, but could also hurt the interest rate outlook following this week's inflation print. While markets are currently pricing in two cuts this year, Ricchiuto expects that could actually be zero, which would be unwelcome news for stocks.</span></p><p class=\"\"><span> \"I think we'd be in a sideways correction for an extended period,\" Ricchiuto told CNBC. \"The markets are trying to find the technical bottom, and it looks like it's found it, but we need to test it one or two more times to see if we've actually hit it.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>March weakness</span></strong></strong></p><p class=\"\"><span> The jobs report will come in March, which has historically been a strong month for stocks but has been extremely volatile in recent years. It's the fourth best calendar month for the S&amp;P 500, rising 1% on average in a typical year, and 1.2% in midterm election years, according to the Stock Trader's Almanac.</span></p><p class=\"\"><span> That could bear out to be true if February's losses in the major averages means enough of the AI excess has been flushed out of the stock market, meaning investors feel readier to embrace the trade. In fact, tech is now nearly as attractively valued as consumer staples.</span></p><p class=\"\"><span> \"It's absolutely possible that the next move is up,\" Reflexivity's Sette said.</span></p><p class=\"\"><span> On Friday, however, stocks were heading for a sour ending to the month. The S&amp;P 500 lost 0.9% in February, while the Nasdaq Composite was the worst performer, down more than 3.4%. The Dow was the only one to have ended the month positive, up 0.2%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Week ahead calendar </span></strong></strong></p><p class=\"\"><em><span>All times ET.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Monday, March 2</span></strong></p><p class=\"\"><span> 9:45 a.m. S&amp;P Global PMI Manufacturing final (February)</span></p><p class=\"\"><span> 10:00 a.m. ISM Manufacturing (February)</span></p><p class=\"\"><span> Earnings: Norwegian Cruise Line Holdings</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tuesday, March 3</span></strong></p><p class=\"\"><span> Earnings: Ross Stores, CrowdStrike Holdings, AutoZone, Best Buy Co.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Wednesday, March 4</span></strong></p><p class=\"\"><span> 8:15 a.m. ADP Employment Survey (February)</span></p><p class=\"\"><span> 9:45 a.m. S&amp;P Global PMI Services final (February)</span></p><p class=\"\"><span> 10:00 a.m. ISM Services PMI (February)</span></p><p class=\"\"><span> Earnings: Broadcom, Brown-Forman</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Thursday, March 5</span></strong></p><p class=\"\"><span> 8:30 a.m. Export Price Index (January)</span></p><p class=\"\"><span> 8:30 a.m. Import Price Index (January)</span></p><p class=\"\"><span> 8:30 a.m. Initial Claims (02/28)</span></p><p class=\"\"><span> 8:30 a.m. Unit Labor Costs preliminary (Q4)</span></p><p class=\"\"><span> 8:30 a.m. Productivity preliminary (Q4)</span></p><p class=\"\"><span> Earnings: Cooper Companies, Costco Wholesale, Kroger, Fastenal, Ciena</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Friday, March 6</span></strong></p><p class=\"\"><span> 8:30 am. February Jobs Report</span></p><p class=\"\"><span> 8:30 a.m. Retail Sales (January)</span></p><p class=\"\"><span> 10:00 a.m. Business Inventories (December)</span></p><p class=\"\"><span> 10:00 a.m. Wholesale Inventories final (January)</span></p><p class=\"\"><span> 3:00 p.m. Consumer Credit (January)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:8b90a9f10094b:0/",
            "pub_date": "2026-02-28 12:29:29",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2949496:0",
            "title": "SQM_A: Record lithium and iodine sales drove robust Q4 2025 growth, with a positive 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw strong revenue and profit growth, driven by record lithium and iodine sales volumes and higher prices. Outlook for 2026 is positive for lithium and iodine, with stable or modest growth expected in other segments.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2949496-a28cc9d6e08bda9c28ad6d4fdd51ceca\" target=\"_blank\">Sociedad Quimica y Minera de Chile SA Pfd Series A [SQM_A] Slides Release — Mar. 4 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2949496:0-sqm_a-record-lithium-and-iodine-sales-drove-robust-q4-2025-growth-with-a-positive-2026-outlook/",
            "pub_date": "2026-02-28 12:33:15",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:7e1c5c2a253d1:0",
            "title": "Paramount's $81 Billion Warner Bros. Discovery Takeover Seals Deal After Netflix Bows Out",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>WASHINGTON (dpa-AFX) - Paramount Skydance Corporation (PSKY) announced it has entered into a definitive merger agreement to acquire Warner Bros. Discovery Inc. (WBD). The all-cash transaction, valued at $81 billion in equity and $110 billion in enterprise value, positions Paramount as a premier global media and entertainment powerhouse.</span></p><p class=\"\"><span>The announcement follows a dramatic turn in the industry, as Netflix declined to raise its offer for WBD, effectively clearing the path for Paramount to step in with its $81 billion bid.</span></p><p class=\"\"><span>Under the agreement, Paramount will pay $31 per share in cash for WBD's outstanding stock. To protect shareholders, a 'ticking fee' of $0.25 per share per quarter will be added if the transaction has not closed by September 30, 2026. Paramount projects that the deal will generate over $6 billion in synergies, achieved through technology integration, procurement savings, real estate optimization, and streamlined operations across the combined company.</span></p><p class=\"\"><span>The financing package is equally ambitious. Paramount has secured $47 billion in equity, backed by the Ellison Family and RedBird Capital Partners, with new Class B shares priced at $16.02 each. In addition, $54 billion in debt commitments from Bank of America, Citigroup, and Apollo will support the transaction, including funds to backstop WBD's existing bridge facility. Paramount shareholders will also be offered a $3.25 billion rights offering at the same share price, ensuring broad participation in the deal's funding.</span></p><p class=\"\"><span>This merger is expected to close in the third quarter of 2026, pending regulatory approvals and a shareholder vote scheduled for early spring.</span></p><p class=\"\"><span>Warner Bros. Discovery closed the regular trading session at $28.17, down $0.63 or 2.19%. In after-hours trading, the stock showed a slight recovery, rising to $28.26, an increase of $0.09 or 0.32%.</span></p><p class=\"\"><span>Copyright(c) 2026 RTTNews.com. All Rights Reserved</span></p><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:7e1c5c2a253d1:0-paramount-s-81-billion-warner-bros-discovery-takeover-seals-deal-after-netflix-bows-out/",
            "pub_date": "2026-02-28 12:27:21",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN1E4:0",
            "title": "KALENDER-Termine Politik/Vermischtes bis 8. März",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>*************************************************************</span></p><p class=\"\"><span> Weitere ausführliche Terminübersichten erhalten sie unter:</span></p><p class=\"\"><span> * FIRMEN/MÄRKTE \t      </span></p><p class=\"\"><span> * KONJUNKTUR/GELDPOLITIK                  </span></p><p class=\"\"><span>*************************************************************</span></p><p class=\"\"><span>Alle Zeitangaben in Central European Time (CET) </span></p><p class=\"\"><span>SATURDAY FEBRUARY 28, 2026</span></p><p class=\"\"><span>Trump supporters in Florida rally against Cuba's government</span></p><p class=\"\"><span>Political rally of RN Bardella for mayoral elections in Perpignan - Jordan Bardella, president of the French far-right Rassemblement National (National Rally - RN) political party, attends a political rally as part of the campaign for the mayoral election and to support mayor Louis Aliot in Perpignan</span></p><p class=\"\"><span>11:00 - Rachida Dati campaigns for the 2026 Paris municipal elections - Rachida Dati, candidate supported by Les Republicains (LR) and the MoDem parties for Paris 2026 mayoral election, talks with supporters as she campaigns for the upcoming municipal election at a market in the 17th district in Paris</span></p><p class=\"\"><span>SUNDAY MARCH 1, 2026</span></p><p class=\"\"><span>North Carolinians vote in primary election for high-stakes Senate race - With the retirement of Thom Tillis, Republicans are fighting to hold on to his U.S. Senate seat, while Democrats see a key pickup opportunity.</span></p><p class=\"\"><span>15:00 - Political rally of LFI leader Melenchon for mayoral elections in Perpignan - Jean-Luc Melenchon, leader of French far-left opposition party La France Insoumise (France Unbowed-LFI), attends a political rally as part of the campaign for the mayoral election, to support LFI candidate Mickael Idrac in Perpignan</span></p><p class=\"\"><span>MONDAY MARCH 2, 2026</span></p><p class=\"\"><span>U.S. first lady will preside over a United Nations Security Council meeting as the United States assumes the body's presidency. She is expected to discuss education's role in promoting peace.</span></p><p class=\"\"><span>Macron makes speech on nuclear deterrent from submarine base - French President Emmanuel Macron makes a speech on the nuclear deterrent from the Ile Longue submarine base in Brittany.</span></p><p class=\"\"><span>12:15 - German defence minister visits anti-drone unit, speaks to reporters - German Defence Minister Boris Pistorius visits an Air Force anti-drone unit and speaks to reporters. 21:00 - Melania Trump to preside over UN Security Council meeting</span></p><p class=\"\"><span>TUESDAY MARCH 3, 2026</span></p><p class=\"\"><span>Texas, North Carolina and Arkansas hold primary elections for US Congress - Voters in Texas, North Carolina and Arkansas vote in the first primary elections of the 2026 midterm elections that will determine control of the U.S. Congress. Marquee contests include Texas' U.S. Senate primary, where incumbent Republican Senator John Cornyn faces challenges from within his party and in North Carolina, site one one of the most competitive U.S. Senate races.</span></p><p class=\"\"><span>Russia's Lavrov to host second minister of foreign affairs of Brunei - Russian Foreign Minister Sergei Lavrov will hold talks with Second Minister of Foreign Affairs of Brunei Erywan Yusof in Moscow</span></p><p class=\"\"><span>11:25 - European Commission head Ursula von der Leyen speaks at EIB Forum conference</span></p><p class=\"\"><span>WEDNESDAY MARCH 4, 2026</span></p><p class=\"\"><span>EU lawmakers discuss whether to resume work on EU-US trade deal - European Parliament members to discuss whether to resume work on legislation to enact parts of EU-U.S. trade deal. The EU assembly suspended a planned vote on Feb 25, saying it needed clarity from the Trump administration after Washingon imposed a new \"surcharge\".</span></p><p class=\"\"><span>Kosovo parliament faces deadline to elect new president - The deadline expires for the Kosovo parliament to elect a new president, or the country will have to hold snap elections within 45 days.</span></p><p class=\"\"><span>THURSDAY MARCH 5, 2026</span></p><p class=\"\"><span>Nepal holds general elections - Nepal holds general elections after youth-led protests toppled the government of Prime Minister K.P. Sharma Oli.</span></p><p class=\"\"><span>Russian Foreign Minister Sergei Lavrov speaks at diplomatic round table on Ukrainian crisis</span></p><p class=\"\"><span>19:00 - Far-right AfD leaders address final rally ahead of state election - Far-right Alternative for Germany (AfD) leaders Alice Weidel and Tino Chrupalla address the final rally ahead of elections in the southern state of Baden-Wuerttemberg on March 8 where they come in third behind Chancellor Merz's CDU and the Greens, according to latest polls.</span></p><p class=\"\"><span>19:00 - Washington planning commission to consider blessing Trump's ballroom project - A Washington planning commission will consider approving U.S. President Donald Trump's White House East Wing ballroom project at a March 5 meeting, according to a tentative meeting agenda posted online. The National Capital Planning Commission will consider \"approval of preliminary and final site and building plans\" at the meeting, according to its website.</span></p><p class=\"\"><span>FRIDAY MARCH 6, 2026</span></p><p class=\"\"><span>17:30 - Germany’s Merz addresses final CDU rally ahead of state election - German Chancellor Friedrich Merz addresses CDU supporters at the final rally ahead of Sunday's elections in the southern state of Baden-Wuerttemberg where his conservatives lead latest polls, followed by the Greens and the far-right Alternative for Germany (AfD).</span></p><p class=\"\"><span>20:00 - Former Chancellor Merkel attends St. Matthew's Day banquet - Former German Chancellor Angela Merkel and Antonio Costa, President of the European Council, attend the St. Matthew's Day banquet (Matthiae-Mahlzeit) in Hamburg</span></p><p class=\"\"><span>SATURDAY MARCH 7, 2026</span></p><p class=\"\"><span>Trump may host Latin American leaders in Florida - U.S. President Donald Trump may host Latin American leaders in Florida.</span></p><p class=\"\"><span>SUNDAY MARCH 8, 2026</span></p><p class=\"\"><span>NO EVENTS SCHEDULED</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN1E4:0-kalender-termine-politik-vermischtes-bis-8-m-rz/",
            "pub_date": "2026-02-28 12:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZO01I:0",
            "title": "Chilean lithium miner SQM's fourth-quarter profit jumps 53%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Chilean lithium producer SQM </span><span> on Friday reported a rise in fourth-quarter net profit, as a stronger pricing environment lifted average lithium prices and boosted results.</span></p><p class=\"\"><span>The world's second-largest lithium producer said net income for the quarter was $183.8 million, up 53% from a year earlier.</span></p><p class=\"\"><span>Revenue for the quarter rose 23.3% to $1.32 billion, from $1.07 billion in the same period last year.</span></p><p class=\"\"><span>Gross profit for the quarter climbed 52.7% to $448.5 million.</span></p><p class=\"\"><span>\"Our fourth quarter 2025 results reflected record-high sales volumes across both of our lithium businesses, Nova Andino Litio (formerly SQM Salar) and our International Lithium Division,\" SQM CEO Ricardo Ramos said. \"In November 2025, we began to see early signs of an improved supply-demand balance, driven by stronger-than-expected demand from energy storage systems (ESS).\"  </span></p><p class=\"\"><span>The company is increasing refining of lithium carbonate from lithium sulfate in China through tolling agreements, Ramos said. </span></p><p class=\"\"><span>For the full year, SQM posted net income of $588.1 million, compared with a loss of $404.4 million in 2024, while revenue rose 1.0% to $4.58 billion.</span></p><p class=\"\"><span>SQM, one of only two companies producing lithium in Chile, also makes fertilizers and industrial chemicals.  </span></p><p class=\"\"><span>Lithium prices have cooled from record highs in 2022 as supply growth outpaced demand, pressuring margins for global producers including SQM and rivals such as U.S.-based Albemarle.  </span></p><p class=\"\"><span>Still, demand for the battery metal is expected to rise in the coming years in line with growth in electric vehicles and battery storage.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZO01I:0-chilean-lithium-miner-sqm-s-fourth-quarter-profit-jumps-53/",
            "pub_date": "2026-02-28 12:30:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:cd90afe0c094b:0",
            "title": "Bitcoin ETF Investors Show Diamond Hands: Only $6.5B In Outflows Since October 10",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Spot Bitcoin (BTC) Exchange-Traded Funds (ETFs) have shown strength amid the crypto market’s correction and the flagship crypto’s latest performance. Some experts have praised investors’ resilience, suggesting that the “real story” is not in the recent outflows.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ETFs Investors Hold Strong Despite Market Downturn</span></strong></p><p class=\"\"><span>On Thursday, Nate Geraci, co-founder of the ETF Institute, affirmed that Bitcoin ETF investors have “largely displayed diamond hands” during the recent crypto market downturn.</span></p><p class=\"\"><span>The flagship crypto has seen a 48.2% correction from its October 6, 2025, all-time high (ATH), recording five consecutive months of strong bleeding after the October 10 market crash.</span></p><p class=\"\"><span>Since then, spot BTC ETFs have seen about $6.5 billion in outflows, the expert observed, which he considers a “drop in the bucket” compared to the $55 billion in cumulative total net inflows that the category has seen since launching in January 2024.</span></p><p class=\"\"><span>It’s worth noting that crypto-based investment products have seen five weeks of outflows this year, with Bitcoin having the weakest sentiment among major assets amid the negative market sentiment of the past month.</span></p><p class=\"\"><span>According to SoSoValue data, BTC funds have recorded $3.81 billion in net outflows since January 23, starting the week with $203.82 million in outflows on Monday.</span></p><p class=\"\"><span>However, Geraci highlighted potential renewed demand for the investment products as the category sees a three-day streak of consistent inflows. Notably, Bitcoin ETFs have seen over $1 billion in inflows over the past three days, setting the stage for their potential biggest week since mid-January.</span></p><p class=\"\"><span>The ETF expert emphasized that 50% drawdowns “are a walk in the park for long-time BTC investors,” but observed that newer ETF investors also appear unfazed by the current market conditions.</span></p><p class=\"\"><span>“Not first time btc has experienced 50% decline &amp; likely won’t be the last. ETF investors clearly aren’t panicking, though. Apparently buying the dip,” he wrote on X.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin ETFs Strength Is The ‘Real Story’</span></strong></p><p class=\"\"><span>Bloomberg Intelligence Senior ETF Analyst Eric Balchunas backed Geraci’s comment, praising the remarkable performance of spot Bitcoin ETFs over the past two years.</span></p><p class=\"\"><span>“As an ETF watcher, you know just how absurd this strength amid a 50% drawdown,” Balchunas stated. “This is the real story, vs focusing on the $6b that came out, which most stories do.”</span></p><p class=\"\"><span>“Further, the narrative that crypto is ‘paying the price’ for getting financialized is absurd. $55b in net new cash in two years is the opposite of paying the price,” he added on X.</span></p><p class=\"\"><span>In a recent interview, the senior analyst observed that the amount of Bitcoin held by ETFs is only down around 6% despite the market pullback. He noted that these types of corrections happen to every asset, including bonds and stocks, before recovering.</span></p><div class=\"blockquote-xrkxvh37\"><span> </span><p class=\"\"><span>Stocks have the same thing. Every time stocks go down, I remind myself and then other people that stocks have a 100% perfect record of coming back to hit all-time highs from a downturn. So, why would I worry that much, right?</span></p><span> </span></div><p class=\"\"><span>Balchunas affirmed that these assets can have “really horrible streaks, but then when they come back around, the flows come back.” He concluded that the price volatility and the negative market sentiment are “the cost of the holy grail returns that most people have gotten.”</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:889.6551724137931px;aspect-ratio:1.4827586206896552\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:cd90afe0c094b-d956397ae8ea6174e6704acc92c00129-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin, btc, btcusdt\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:cd90afe0c094b-d956397ae8ea6174e6704acc92c00129-resized.webp\" style=\"background-color:#1c1d26\"/></picture></div></button></figure></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:cd90afe0c094b:0-bitcoin-etf-investors-show-diamond-hands-only-6-5b-in-outflows-since-october-10/",
            "pub_date": "2026-02-28 12:00:15",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:154785ad7094b:0",
            "title": "SQM Reports Earnings for the Twelve Months Ended December 31, 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Highlights</span></strong></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>SQM reported total revenues for the twelve months ended December 31, 2025 of US$4,576.2 million compared to total revenues of US$4,528.8 million for the same period last year.</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Net income for the twelve months ended December 31, 2025 of US$588.1 million or US$2.06 per share, compared to net loss of US$(404.4) million or US$(1.42) per share for the same period last year.</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>In </span><span>lithium:R</span><span>ecord quarterly sales volumes amidst strong market demand</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Strong price environment in iodine</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><span>SQM will hold a conference call to discuss these results on Monday, March 2, 2026 at 10:00am EST (12:00pm Chile time).</span></li><li class=\"listItem-bmN0_SHH\"><span>Participant Call link:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=xduUrYGXUX6lpd1Jvi02hd6UHO9Oygb-3XgkNFWgN28nvGmpncMPMvrQay5BzMvxdCVpWCdmBib6lna8ov3uD1eKjlHSslVMbofn0aKmuiRzDo1LYKHXEaUQXBMP45fLlnldoTHsSK6p0Dk80tHvFgOUik6Ko9RKH7Gz7KFNL3N7_88arUWXFGjfwVPv7Tja8kNQ3LmcXFAk7f0s78g-D5mcCKgrCIYoRb58igG42Snc0ZXc6gi77e10X8aXeL3IaAN-i3UcchuZrPeoDs-IdQ==\" rel=\"nofollow\" target=\"_blank\">https://register-conf.media-server.com/register/BI256bddfcaae643f591a9cfc6b2a449d6</a></li><li class=\"listItem-bmN0_SHH\"><span>Webcast:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=xduUrYGXUX6lpd1Jvi02hRmdZ5AZnjY-SCxCgIJRQenb8xz34B7nT2zsKI-AnSN-Ib8AwDeR0-8Ggx_qJxfD_4R7459q-3w8l9fxdUPhS8korRBIDa3tLcMhfkZ7mw4nGQHHcCgrzPszbwUtywAwX08kRGaIDnfSWyk3Najmj6U=\" rel=\"nofollow\" target=\"_blank\">https://edge.media-server.com/mmc/p/f6nxktxe</a></li></ul><p class=\"\"></p><p class=\"\"><span>SANTIAGO, Chile, Feb. 27, 2026 (GLOBE NEWSWIRE) -- Sociedad Química y Minera de Chile S.A. (SQM) </span><span>; Santiago Stock </span><span>Exchange:SQM</span><span>-B, SQM-A) reported today </span><strong class=\"root-Tkn6WL2y\"><span>net income for the twelve months ended December 31, 2025, </span></strong><span>of US$588.1 million or US$2.06 per share, compared to a loss of US$(404.4) million or US$(1.42) per share reported for the same period last year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross profit</span></strong><strong class=\"root-Tkn6WL2y\"><span>(</span></strong><strong class=\"root-Tkn6WL2y\"><span>1)</span></strong><span> reached US$1,352.6 million (29.6% of revenues) for the twelve months ended December 31, 2025, higher than US$1,327.1 million (29.3% of revenues) recorded for the twelve months ended December 31, 2024. </span><strong class=\"root-Tkn6WL2y\"><span>Revenues</span></strong><span> totaled US$4,576.2 million for the twelve months ended December 31, 2025, representing an increase of 1.0% compared to US$4,528.8 million reported for the twelve months ended December 31, 2024.</span></p><p class=\"\"><span>The Company also announced net income for the fourth quarter of 2025 of US$183.8 million or US$0.64 per share, an increase of 53.0% compared to US$120.1 million or US$0.42 per share for the fourth quarter of 2024. Gross profit for the fourth quarter of 2025 reached US$448.5 million, 52.7% higher than the US$293.8 million reported for the fourth quarter of 2024. Revenues totaled US$1,323.9 million for the fourth quarter of 2025, an increase of 23.3% compared to US$1,073.8 million for the fourth quarter of 2024.</span></p><p class=\"\"><span>SQM’s Chief Executive Officer, Ricardo Ramos, stated, “Our fourth quarter 2025 results reflected record-high sales volumes across both of our lithium </span><span>businesses:N</span><span>ova Andino Litio (formerly SQM Salar) and our International Lithium Division. In November 2025, we began to see early signs of an improved supply-demand balance, driven by stronger-than-expected demand from energy storage systems (ESS), as well as certain supply disruptions. This led to a tighter market environment and a shift in pricing trends. We continue to observe solid demand fundamentals, and we estimate that the lithium market could grow by approximately 25% this year, led by electric vehicles (EVs) and ESS.”</span></p><p class=\"\"><span>Mr. Ramos </span><span>continued:A</span><span>t Nova Andino Litio, we are operating at full capacity to meet our customer commitments while continuing to advance our expansion plans in the Salar de Atacama. In parallel, we are increasing refinery of lithium carbonate from lithium sulfate in China through tolling agreements.”</span></p><p class=\"\"><span>He added: “In Australia, we are also operating at full capacity in the production of spodumene concentrate. In January of this year, we celebrated our first shipment of lithium hydroxide produced in Australia at the Kwinana refinery. Notably, lithium hydroxide from Kwinana refinery has been certified under the International Lithium Association’s Life Cycle Assessment framework, demonstrating a 37% lower emissions footprint compared to traditional hard-rock production refined in China.”</span></p><p class=\"\"><span>Mr Ramos continued: “Our Iodine and Plant Nutrition division delivered solid performance, particularly in iodine, which contributed approximately 42% of SQM’s total gross profit. By year-end, we observed record iodine prices amid tight supply conditions and strong demand, particularly from the X-ray contrast media market. In the fertilizer business, we observed healthy demand and stable prices across our key markets”.</span></p><p class=\"\"><span>For media inquiries, contact: </span></p><p class=\"\"><span>Nova Andino Litio: </span></p><p class=\"\"><span>Ignacia Lopez / </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=c-SsqzvQR1qMj_d6Z_Z3rrIi0M6vlUnWUsCN2WCmUSW8KPmnPibvz_a_ZG7Usn-9KWVDWDmz7MghB9Xgo08Hr-_n_D8DM9hbGXMIQpnYias=\" rel=\"nofollow\" target=\"_blank\">ignacia.lopez@sqm.com</a></p><p class=\"\"><span>International Lithium Division: </span></p><p class=\"\"><span>Diana Wearing Smith / diana.wearingsmith@sqm.com</span></p><p class=\"\"><span>Iodine &amp; Plant Nutrition Division: </span></p><p class=\"\"><span>Carolina Guzman / carolina.guzman@sqm.com </span></p><p class=\"\"><span>Note:T</span><span>o see full press release please visit our website:https://ir.sqm.com/</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:154785ad7094b:0-sqm-reports-earnings-for-the-twelve-months-ended-december-31-2025/",
            "pub_date": "2026-02-28 11:54:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZO00Y:0",
            "title": "Rock band Radiohead urges US ICE to take down video using its song",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Kanishka Singh</span></p><p class=\"\"><span>    British rock band Radiohead said on Friday it wanted a promotional video for the U.S. Immigration and Customs Enforcement agency that used their song to be taken down.</span></p><p class=\"\"><span>ICE, whose immigration enforcement tactics have been widely condemned by human rights advocates during President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> hardline immigration crackdown, posted a video last week that used a version of Radiohead's song \"Let Down.\"</span></p><p class=\"\"><span>\"We demand that the amateurs in control of the ICE social media account take it down. It ain't funny, this song means a lot to us and other people, and you don't get to appropriate it without a fight,\" Radiohead said in a statement to media outlets.</span></p><p class=\"\"><span>ICE did not immediately respond to request for comment outside of business hours.</span></p><p class=\"\"><span>The song's version appeared as a soundtrack to the video that showed a montage of victims of violence that ICE attributed to immigrants who are in the U.S. illegally.</span></p><p class=\"\"><span>Radiohead said the song was used without the band's permission.</span></p><p class=\"\"><span>The Trump administration has used ICE in an </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/ice-has-detained-growing-share-people-with-no-criminal-record-or-charge-2026-02-27/\" rel=\"nofollow\" target=\"_blank\">immigration crackdown</a><span> and deportation drive that has been condemned by human rights advocates, especially after the January fatal shootings of two U.S. citizens by federal agents in Minnesota. Many celebrities have also previously condemned ICE.</span></p><p class=\"\"><span>Rights groups say the crackdown has created a fearful environment for both citizens and immigrants, especially for minority groups.</span></p><p class=\"\"><span>Around the country, at least eight people have died in ICE detention centers since the start of 2026, following at least 31 deaths last year.</span></p><p class=\"\"><span>Rights advocates have also raised free speech and due process concerns in ICE's detention and attempted deportations of pro-Palestinian foreign protesters who opposed U.S. ally Israel's assault on Gaza.</span></p><p class=\"\"><span>Trump has cast his crackdown as aiming to curb illegal immigration and improve domestic security.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZO00Y:0-rock-band-radiohead-urges-us-ice-to-take-down-video-using-its-song/",
            "pub_date": "2026-02-28 11:57:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO00V:0",
            "title": "Nvidia plans new chip to speed AI processing, WSJ reports",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Nvidia </span><span> plans to launch a new processor designed to help OpenAI and other customers build faster, more efficient AI systems, the Wall Street Journal reported on Friday, citing people familiar with the matter. </span></p><p class=\"\"><span>Nvidia is developing a new system for \"inference\" computing, a form of processing that allows AI models to respond to queries, the report said.</span></p><p class=\"\"><span>The new platform is set to be unveiled at Nvidia’s GTC developer conference in San Jose next month and will incorporate a chip designed by startup Groq, the report added citing people familiar.</span></p><p class=\"\"><span>Reuters could not immediately verify the report. Nvidia and OpenAI did not immediately respond to Reuters request for comment.</span></p><p class=\"\"><span>     Reuters earlier this month reported OpenAI is unsatisfied with the speed at which Nvidia’s hardware can spit out answers to ChatGPT users for specific types of problems such as software development and AI communicating with other software.</span></p><p class=\"\"><span>It needs new hardware that would eventually provide about 10% of OpenAI’s inference computing needs in the future, one of the sources told Reuters.</span></p><p class=\"\"><span>The ChatGPT maker has discussed working with startups including Cerebras and Groq to provide chips for faster inference, two sources said. But Nvidia struck a $20-billion licensing deal with Groq that shut down OpenAI’s talks, one of the sources told Reuters.</span></p><p class=\"\"><span>In September, Nvidia said it intended to pour as much as $100 billion into OpenAI as part of a deal that gave the chipmaker a stake in the startup and gave OpenAI the cash it needed to buy the advanced chips.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO00V:0-nvidia-plans-new-chip-to-speed-ai-processing-wsj-reports/",
            "pub_date": "2026-02-28 11:58:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA2J98BR:0",
            "title": "SQM Reports Reports FY Total Revenues Of $4.576 Billion For 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Sociedad Quimica y Minera de Chile SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SQM REPORTS EARNINGS FOR THE TWELVE MONTHS ENDED DECEMBER 31, 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SOCIEDAD QUIMICA Y MINERA DE CHILE SA - REPORTS FY TOTAL REVENUES OF $4.576 BILLION FOR 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SOCIEDAD QUIMICA Y MINERA DE CHILE SA - REPORTS FY NET INCOME OF $588.1 MILLION FOR 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SOCIEDAD QUIMICA Y MINERA DE CHILE SA - NET INCOME FOR Q4 OF 2025 OF US$183.8 MILLION OR US$0.64 PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA2J98BR:0-sqm-reports-reports-fy-total-revenues-of-4-576-billion-for-2025/",
            "pub_date": "2026-02-28 11:59:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012195:0",
            "title": "The Unlikely Coalition of Iranian Students Mobilizing to Confront the Regime — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Feliz Solomon and Henna Moussavi</span></p><p class=\"\"><span>Almost from the moment Iran's universities opened their gates for the start of a new term last week, it was clear the regime had another problem on its hands. Students came back dressed all in black, shouting slogans against the country's leader.</span></p><p class=\"\"><span>Activists are harnessing anger over last month's brutal crackdown to revive protests aimed at toppling the Islamic Republic. Led by a constellation of disparate groups, the new wave of dissent is ratcheting up domestic pressure on the regime just as it braces for a potential military showdown with the U.S.</span></p><p class=\"\"><span>The students are bringing a measure of cohesion to what has otherwise been a spontaneous movement fueled by frustration over a crumbling economy. Since last week, crowds have swelled on campuses in major cities as students joined memorials for peers who were killed in the crackdown. The gatherings morphed into heated rallies where students burned the country's flag and called for the death of Supreme Leader Ali Khamenei. Chaotic scuffles and fistfights erupted on several campuses when antiregime protesters were confronted by mobs of regime loyalists.</span></p><p class=\"\"><span>As the protests gathered pace, Chief Justice Gholam-Hossein Mohseni-Eje'i warned that \"certain slogans and behaviors, such as burning a flag on campus, are absolutely unacceptable.\" At least half a dozen universities in cities including Tehran, Isfahan, Shiraz and Urmia announced that courses would be held remotely for the next few weeks. Some said the move coincided with the Muslim holy month of Ramadan, though others cited stability.</span></p><p class=\"\"><span>Student associations responded by calling for a boycott of online classes and urging students to show up on campus anyway.</span></p><p class=\"\"><span>\"These protests are important, because they show Iranian society is still defiant,\" said Arash Azizi, an Iranian-American historian and author of the book \"What Iranians Want .\" \"I don't think this problem of regime versus people will be resolved unless there's fundamental change. They know they can't get out of this so easily.\"</span></p><p class=\"\"><span>Sustaining the protests hinges on a fragile alliance united by little more than outrage. Student activism in Iran has traditionally been split broadly among three camps representing left-leaning progressives, monarchists and regime loyalists. The last of these are often members of the Basij, a paramilitary group backed by the government that has branches in almost every high school and university. This group was instrumental in the violence that put down street protests in January.</span></p><p class=\"\"><span>What's emerging now, analysts say, is a coalition of convenience among progressives and monarchists on campus. Mohammad Ali Kadivar, an Iranian associate professor of sociology and international studies at Boston College, says these two camps appear to be tolerating each other as they face a shared opponent. \"For now at least, they're less hostile toward each other,\" Kadivar said. \"They agree implicitly on what they don't want, but much less on what comes next.\"</span></p><p class=\"\"><span>The broader opposition movement, much of it in exile, remains bitterly divided. Their rivalry goes back to the betrayals of the 1979 revolution, when democrats and communists helped Iran's religious clerics overthrow the monarchy. Once in power, the clerics turned on their partners, killing and imprisoning them.</span></p><p class=\"\"><span>On campuses at least, both sides are focused on a common enemy: Khamenei. Chants of \"Death to the dictator\" rumble through courtyards. A video shared with The Wall Street Journal by the citizen-journalist network Mamlekate shows demonstrators at Tehran's Shahid Beheshti University raising their hands above their heads and flinging them from side to side — a taboo gesture mocking Khamenei, whose right arm was paralyzed during an assassination attempt in 1981.</span></p><p class=\"\"><span>Elsewhere, students plastered school walls with photographs of the dead. At Sharif University of Technology, they hung toy rats from trees — a reference to Khamenei hiding from his enemies in underground bunkers — according to video footage verified by Storyful, which is owned by the Journal's parent company News Corp.</span></p><p class=\"\"><span>What has surprised some analysts is the degree to which students have rallied behind Reza Pahlavi, the exiled son of Iran's late and final shah. Pahlavi has positioned himself as a potential leader if the regime falls, and in early January he urged Iranians to join the protests that began late last year over the country's free-falling currency. Many protesters said that was why they participated.</span></p><p class=\"\"><span>On Jan. 8, the regime shut off the internet and moved to crush the snowballing movement. Human Rights Activists in Iran, a U.S.-based nonprofit, says it has confirmed the deaths of some 7,000 people during the crackdown, and the arrests of more than 50,000 others.</span></p><p class=\"\"><span>Students on several campuses have embraced symbols of the monarchy, such as the country's former flag, which has a \"Lion and Sun\" emblem on it associated with the dynasty. They frequently chant slogans like, \"Long live the shah!\"</span></p><p class=\"\"><span>The editor of a student media outlet based in Tehran said he supports having Pahlavi lead a transitional unity government until elections can be held, and hopes to get past the factional differences that have divided the opposition.</span></p><p class=\"\"><span>The editor, whose name the Journal withheld out of concern for his safety, said he founded a new coalition called the Union of Lion and Sun Universities to streamline student activism and that more than 30 student groups joined in its first few days.</span></p><p class=\"\"><span>United Students Media, a left-leaning collective of student activists across Iran, told the Journal that it doesn't support Pahlavi, whom it views as undemocratic. Its goal, it said, \"is to overthrow the Islamic Republic.\"</span></p><p class=\"\"><span>Iran's universities have long been incubators for political change. Radical students at the University of Tehran played a crucial role in the 1979 revolution. Since then, Iran's Shiite clerical leaders have tried to control schools by purging staff and replacing them with loyalists while harshly punishing dissent on campus.</span></p><p class=\"\"><span>Iran's students often have taken risks that other segments of society couldn't. In 2009, they defied threats from the regime to lead opposition rallies. In 2022, authorities violently suppressed the \"Woman, Life, Freedom\" street protests sparked by the death of Mahsa Amini, a young woman killed in police custody after being detained for improperly wearing her hijab. Students headed for the relative safety of campuses to keep momentum alive.</span></p><p class=\"\"><span>\"The question is will they be able to build political alliances, can they organize and mobilize the masses,\" said Azizi, the historian. \"What catches on is completely unpredictable, there's almost a mysterious alchemy to it. What's clear is this: The regime hasn't pacified them.\"</span></p><p class=\"\"><span>Write to Feliz Solomon at feliz.solomon@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012195:0/",
            "pub_date": "2026-02-28 12:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "bravenewcoin:0b592d854094b:0",
            "title": "Ethereum (ETH) Price Today: ETH Stabilizes Above $1,920 as $2,100 Becomes the Decisive Breakout Level",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>After defending the $1,920–$1,950 demand zone earlier this week, Ethereum stabilized and pushed back above the psychological $2,000 level. As of February 27, 2026, 14:00 UTC, the </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://bravenewcoin.com/data-and-charts/ethereum-price-eth\" rel=\"nofollow\" target=\"_blank\">Ethereum price</a><span> is fluctuating between $2,000 and $2,050 across major spot exchanges, following a volatile </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://bravenewcoin.com/insights/ethereum-eth-price-prediction-eth-forms-higher-lows-at-key-support-as-traders-eye-recovery-toward-2750\" rel=\"nofollow\" target=\"_blank\">surge toward</a><span> $2,100 that triggered significant short liquidations before partially retracing.</span></p><p class=\"\"><span>The recovery places ETH at a structural inflection area where both</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://bravenewcoin.com/insights/ethereum-eth-price-prediction-3200-support-holds-as-technical-patterns-hint-at-a-push-toward-3400\" rel=\"nofollow\" target=\"_blank\"> technical</a><span> and derivatives metrics are converging.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Short-Term Structure: Momentum Meets Overhead Resistance</span></strong></p><p class=\"\"><span>On the 4-hour timeframe, ETH rebounded from the $1,750–$1,800 higher-timeframe demand zone, an area that previously triggered aggressive spot buying in late January. The rally extended to approximately $2,148 before encountering supply pressure.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:578.9090909090909px;max-width:1200px;aspect-ratio:2.0728643216080402\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-6593040d61e67014afd57a54d381800b-resized.webp\" type=\"image/webp\"/><img alt=\"Short-Term Structure: Momentum Meets Overhead Resistance\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-6593040d61e67014afd57a54d381800b-resized.webp\" style=\"background-color:#f3efd0\"/></picture></div></button></figure><p class=\"\"><span>ETH is trading near $2,050 after reclaiming the $1,920–$1,950 support zone, with a breakout above $2,080–$2,100 potentially targeting $2,200, while a drop below $2,000 would refocus attention on $1,920 support. Source: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/BEKMx5XQ-ETH-USDT-4H-Chart-Update/\" target=\"_blank\">CryptoSanders9563</a><span> on TradingView</span></p><p class=\"\"><span>According to publicly available derivatives data from Coinglass, more than $850 million in short positions were liquidated across centralized exchanges during the rapid move toward $2,100 earlier this week. The data covers a 24-hour window during the breakout phase and reflects elevated leverage participation.</span></p><p class=\"\"><span>From a structural standpoint, the $2,080–$2,100 region carries layered technical weight:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>It aligns with the 200-day moving average on the daily chart.</span></li><li class=\"listItem-bmN0_SHH\"><span>It overlaps with the value-area high from the prior distribution range in early February.</span></li><li class=\"listItem-bmN0_SHH\"><span>It coincides with the descending trendline resistance formed from the January swing high.</span></li></ul><p class=\"\"><span>This clustering increases its </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/BEKMx5XQ-ETH-USDT-4H-Chart-Update/\" target=\"_blank\">technical</a><span> relevance beyond a simple horizontal level.</span></p><p class=\"\"><span>On lower timeframes, ETH continues to oscillate between nearby imbalance zones (fair value gaps), indicating that the market has not yet established firm acceptance above $2,100. Volume profile data shows decreasing participation as price approaches resistance — a sign that buyers may be waiting for confirmation rather than front-running the breakout.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Liquidations, Positioning, and Derivatives Context</span></strong></p><p class=\"\"><span>The recent volatility spike underscores how sensitive the current eth price remains to leveraged positioning. Following the liquidation cascade, open interest declined while funding rates normalized from positive extremes, suggesting that part of the rally was mechanically driven rather than purely spot-led.</span></p><p class=\"\"><span>This matters structurally. Breakouts supported by expanding open interest and sustained spot volume tend to be more durable. By contrast, liquidation-driven spikes often retrace once positioning resets.</span></p><p class=\"\"><span>At present, derivatives positioning appears more balanced, reducing the probability of another immediate cascade unless new leverage builds.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broader Support Structure Remains Intact</span></strong></p><p class=\"\"><span>Despite intraday swings, Ethereum continues to hold above the broader $1,800–$1,900 demand zone on the daily timeframe. That range previously marked the lower boundary of a multi-week consolidation structure.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:587.6363636363636px;max-width:1200px;aspect-ratio:2.0420792079207923\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-1a590358c5744707edf68c15124b2f4b-resized.webp\" type=\"image/webp\"/><img alt=\"Broader Support Structure Remains Intact\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-1a590358c5744707edf68c15124b2f4b-resized.webp\" style=\"background-color:#202323\"/></picture></div></button></figure><p class=\"\"><span>On the hourly chart, price has broken resistance and is now retesting the $2,000 level, with a sustained hold supporting a move toward $2,110, while a drop below $1,990 would invalidate the bullish setup. Source: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/J9ekclDx-ETH-USDT/\" target=\"_blank\">bahardiba</a><span> on TradingView</span></p><p class=\"\"><span>Holding above $1,920 preserves the current higher-low formation. A sustained daily close below $1,900 would invalidate that structure and likely shift the medium-term bias.</span></p><p class=\"\"><span>For longer-term observers evaluating an Ethereum price prediction 2025 or Ethereum price prediction 2030, structurally higher lows on higher timeframes remain foundational. Without them, extended upside projections lack</span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/J9ekclDx-ETH-USDT/\" target=\"_blank\"> technical</a><span> grounding.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Scenario Framework: What Confirms or Invalidates the Move</span></strong></p><p class=\"\"><span>Rather than focusing solely on price targets, the current setup can be broken into structured conditions:</span></p><p class=\"\"><span>Bullish Continuation Requires:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>A sustained 4H or daily close above $2,100</span></li><li class=\"listItem-bmN0_SHH\"><span>Expanding spot volume on breakout</span></li><li class=\"listItem-bmN0_SHH\"><span>Open interest rising alongside price</span></li></ul><p class=\"\"><span>Under those conditions, upside levels near $2,143 and $2,230 become technically reasonable extensions.</span></p><p class=\"\"><span>Invalidation Triggers:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Loss of $2,000 with increasing sales volume</span></li><li class=\"listItem-bmN0_SHH\"><span>A daily close below $1,920</span></li><li class=\"listItem-bmN0_SHH\"><span>Rising open interest during price decline (indicating aggressive short positioning)</span></li></ul><p class=\"\"><span>Neutral/Consolidation Case:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Continued rotation between $1,950 and $2,100</span></li><li class=\"listItem-bmN0_SHH\"><span>Flat funding rates and muted volume</span></li></ul><p class=\"\"><span>This framework provides clearer structural guidance than isolated price levels.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Ethereum and Institutional Liquidity Dynamics</span></strong></p><p class=\"\"><span>Institutional developments continue to shape Ethereum’s broader liquidity profile. Several asset managers have filed or amended applications for spot-based</span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/K5SQjXG7-ETH-USDT-Above-2100-or-below-2050-READ-THE-CAPTION/\" target=\"_blank\"> Ethereum ETF</a><span> products in the United States, including proposals from BlackRock. As of the latest public filings, these applications remain subject to regulatory review and have not yet resulted in approved spot ETFs.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:578.9090909090909px;max-width:1200px;aspect-ratio:2.0728643216080402\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-cbfdd3e62874e0259b14f5d652acf5cc-resized.webp\" type=\"image/webp\"/><img alt=\"Ethereum and Institutional Liquidity Dynamics\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-cbfdd3e62874e0259b14f5d652acf5cc-resized.webp\" style=\"background-color:#181516\"/></picture></div></button></figure><p class=\"\"><span>On the 2-hour chart, ETH surged from $1,800 to $2,148, retraced into lower FVGs, and is now trading around $2,070, with potential targets between $2,025–$2,115 depending on FVG rejection or acceptance. Source: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/chart/ETHUSDT/K5SQjXG7-ETH-USDT-Above-2100-or-below-2050-READ-THE-CAPTION/\" target=\"_blank\">AmirAliTrading</a><span> on TradingView</span></p><p class=\"\"><span>While futures-based products already exist, spot ETF approval would materially expand access for traditional capital pools. Historically, similar developments in Bitcoin markets have coincided with liquidity expansion and volatility compression phases before trend acceleration.</span></p><p class=\"\"><span>Ethereum’s sensitivity to macro liquidity conditions is increasing as institutional access broadens. Rate expectations, dollar strength, and equity market direction now play a more visible role in short-term ETH movements.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Key Levels to Watch</span></strong></p><p class=\"\"><span>Support:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>$1,920</span></li><li class=\"listItem-bmN0_SHH\"><span>$1,800–$1,900 higher-timeframe demand zone</span></li></ul><p class=\"\"><span>Immediate Resistance:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>$2,080–$2,100 cluster (200-day MA + trendline confluence)</span></p><span> </span></li></ul><p class=\"\"><span>Upside Extension if Confirmed:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>$2,143</span></li><li class=\"listItem-bmN0_SHH\"><span>$2,230</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Measured Outlook</span></strong></p><p class=\"\"><span>Ethereum remains well below its historical peak, yet it continues to defend a structurally important support band. The current setup reflects consolidation beneath resistance rather than structural breakdown.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:576px;max-width:1200px;aspect-ratio:2.0833333333333335\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-3c8d82dea6017c4b7cab5e3006a08875-resized.webp\" type=\"image/webp\"/><img alt=\"Measured Outlook\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/bravenewcoin:0b592d854094b-3c8d82dea6017c4b7cab5e3006a08875-resized.webp\" style=\"background-color:#ecebea\"/></picture></div></button></figure><p class=\"\"><span>Ethereum was trading at around $1,957.757, down 5.14% in the last 24 hours at press time. Source: Brave New Coin</span></p><p class=\"\"><span>The decisive factor now is acceptance above $2,100 with volume expansion. Without that confirmation, the market remains range-bound.</span></p><p class=\"\"><span>In the near term, the Ethereum price today sits at a technically layered zone where momentum, positioning, and macro liquidity intersect. The next sustained move, validated by participation and structure, will likely define Ethereum’s direction into early March.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/bravenewcoin:0b592d854094b:0/",
            "pub_date": "2026-02-28 11:38:46",
            "source": "Brave New Coin",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Tnw4471ry:0",
            "title": "Vanguard Mining Identifies Two New Gold-Copper Soil Anomalies at Brussels Creek as Gold Trades Higher and Copper Fundamentals Strengthen",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>Vancouver, BC – TheNewswire - February 27, 2026 – Vanguard Mining Corp.(\"Vanguard\" or the \"Company\") (CSE: UUU | OTCID:UUUFF | FSE: SL51) is pleased to announce twonew anomalous zones identified from its 127-sample soil geochemicalsurvey for its 100%-owned Brussels CreekGold-Copper-Palladium Project (“Brussels Creek”), located in the highlyprospective Kamloops Mining District of British Columbia.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 1:</span><br/><span> Brussels Creek location and proximity to New Afton Mine</span><br/></p><p class=\"\"><br/><span>With these results now in hand Hardline Exploration Ltd. (“Hardline”), a</span><br/><span>respected independent geological consulting firm, will complete an NI</span><br/><span>43-101 Technical Report on the Brussels Creek Project, as previously</span><br/><span>announced. </span><br/></p><p class=\"\"><br/><span>Brussels Creek Soil Survey</span><br/><span>Highlights</span><br/></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>A total of 127 soil samples were collected on a</span><br/><span>systematic grid over prospective ground within the Brussels Creek</span><br/><span>claim block. Samples returned between 1 -88 ppb Au and 28 – 221 ppm</span><br/><span>Cu (Figures 2, 3). </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The survey returned multiple gold and copper anomalous</span><br/><span>trends, with values in several samples falling into the 15–30 ppb Au</span><br/><span>range, a notable number in the 30–75 ppb Au range, and isolated</span><br/><span>samples exceeding 75 ppb Au. </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Two prominent anomalous zones have emerged: </span><br/></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>A western anomaly of elevated gold-in-soil samples,</span><br/><span>with the largest sample responses (e.g., 88 ppb and other upper-tier</span><br/><span>values) defining a coherent trend coincident with interpreted</span><br/><span>structural breaks and favorable lithologic contacts, which remains</span><br/><span>open to the west. </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>An eastern anomaly of 76 ppb Au on the edge of the</span><br/><span>geochemical survey which has potential to remain open in multiple</span><br/><span>directions.  </span><br/></p><br/></li></ul><br/></li></ul><p class=\"\"><br/><span>Several gold anomalies remain open along strike and to</span><br/><span>the north and south, suggesting the potential for expanded anomalous</span><br/><span>footprints with follow-up sampling and geophysical targeting.</span><br/></p><p class=\"\"><br/><span>The Fall 2025 soil geochemical</span><br/><span>results from Brussels Creek confirm the presence of robust gold</span><br/><span>anomalism across multiple structural corridors within the project</span><br/><span>area,” said David Greenway, CEO of Vanguard Mining Corp. “What is</span><br/><span>particularly encouraging is that several of the stronger gold soil</span><br/><span>trends — including our western and eastern anomalies — remain open</span><br/><span>and untested. These open-ended trends provide us with clear vectors</span><br/><span>toward potential mineralized systems and materially enhance our</span><br/><span>confidence as we move into the next phase of detailed geophysics and</span><br/><span>drill targeting.”</span><br/></p><p class=\"\"><br/><span>“Importantly, these results are</span><br/><span>emerging at a time when gold is trading near record highs, reinforcing</span><br/><span>the strategic value of advancing high-quality gold targets in tier-one</span><br/><span>jurisdictions like British Columbia. At the same time, strengthening</span><br/><span>long-term fundamentals for copper — driven by electrification, grid</span><br/><span>expansion, AI infrastructure, and global decarbonization initiatives</span><br/><span>— underscore the significance of Brussels Creek’s copper-gold</span><br/><span>porphyry setting. The project’s location within the Quesnel Terrane,</span><br/><span>adjacent to the producing New Afton Mine, positions Vanguard in one of</span><br/><span>Canada’s most proven copper-gold belts.”  </span><br/></p><p class=\"\"><br/><span>“We believe Brussels Creek has the</span><br/><span>geological ingredients necessary for a meaningful discovery, and these</span><br/><span>soil results represent a critical step in systematically unlocking</span><br/><span>that potential.”</span><br/></p><p class=\"\"><br/><span>Gold has recently traded at or near all-time highs,</span><br/><span>supported by record central bank accumulation, geopolitical</span><br/><span>instability, and investor demand for hard assets. At the same time,</span><br/><span>global copper inventories remain historically tight, while projected</span><br/><span>demand growth tied to electric vehicles, battery storage, artificial</span><br/><span>intelligence data centers, and power grid expansion continues to</span><br/><span>outpace new supply development. Major mining companies have</span><br/><span>increasingly focused on securing long-life copper-gold assets in</span><br/><span>mining-friendly jurisdictions, highlighting the strategic value of</span><br/><span>projects within established porphyry belts such as British</span><br/><span>Columbia’s Quesnel Terrane.</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 2: Soil</span><br/><span>Geochem Map - Gold</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 3: Soil</span><br/><span>Geochem Map - Copper</span><br/></p><p class=\"\"><br/><span>Next Steps</span><br/></p><p class=\"\"><br/><span>Following the soil survey results, Vanguard is</span><br/><span>initiating:</span><br/></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Detailed geological mapping and prospecting over the</span><br/><span>western and eastern anomalies, </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Follow-up Induced Polarization (IP) and resistivity</span><br/><span>geophysical surveys to constrain subsurface chargeability and</span><br/><span>structure, </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Integration of soil geochemistry with historical rock</span><br/><span>geochemistry and alteration data to refine drill-ready targets for</span><br/><span>2026. </span><br/></p><br/></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Follow Up Drill Program  </span><br/></p><br/></li></ul><p class=\"\"><br/><span>About Hardline Exploration</span><br/><span>Corp.</span><br/></p><p class=\"\"><br/><span>Hardline Exploration Corp. is a geological consulting</span><br/><span>and project management company based in Smithers, British Columbia.</span><br/><span>The company specializes in early- to advanced-stage mineral</span><br/><span>exploration, offering comprehensive services including geological</span><br/><span>mapping, geochemical and geophysical program design, data</span><br/><span>interpretation, and project management. Hardline has a strong track</span><br/><span>record of executing cost-effective, technically robust field programs</span><br/><span>across Western Canada. </span><br/></p><p class=\"\"><br/><span>QA/QC</span><br/><span>and Data Verification</span><br/></p><p class=\"\"><br/><span>All samples from Vanguard’s 2025 Brussels Creek</span><br/><span>exploration program were collected, handled, and transported in</span><br/><span>accordance with industry-standard protocols designed to ensure data</span><br/><span>integrity. Samples were placed in secure sample bags, sealed at the</span><br/><span>collection site, and maintained under a documented chain of custody</span><br/><span>from the field through transport to the analytical laboratory.</span><br/></p><p class=\"\"><br/><span>Analytical work is being conducted by SGS, an</span><br/><span>independent ISO-accredited laboratory meeting the requirements of</span><br/><span>ISO/IEC 17025:2017 and ISO 9001:2015. Gold analysis methods and</span><br/><span>multi-element assays were performed using industry-standard analytical</span><br/><span>techniques appropriate for early-stage geochemical exploration. SGS</span><br/><span>retains coarse rejects and pulps for potential future verification and</span><br/><span>re-analysis.</span><br/></p><p class=\"\"><br/><span>Vanguard maintains a rigorous internal quality</span><br/><span>assurance and quality control (“QA/QC”) program. The program</span><br/><span>includes the systematic insertion of certified reference materials</span><br/><span>(standards), blanks, and field duplicates into the sample stream at</span><br/><span>regular intervals to monitor analytical accuracy, precision, and</span><br/><span>potential contamination. Laboratory internal QA/QC results are</span><br/><span>reviewed by the Company to ensure compliance with accepted industry</span><br/><span>practices.</span><br/></p><p class=\"\"><br/><span>The Company’s Qualified Person has reviewed the QA/QC</span><br/><span>procedures and analytical results and has not identified any material</span><br/><span>issues that would impact the reliability of the reported data. The</span><br/><span>data verification procedures employed are considered appropriate for</span><br/><span>an early-stage exploration program.</span><br/></p><p class=\"\"><br/><span>Historical information referenced in this news release</span><br/><span>has been reviewed against available government assessment reports and</span><br/><span>other public disclosures; however, such information has not been</span><br/><span>verified to current NI 43-101 standards and is therefore considered</span><br/><span>historical in nature and provided solely for exploration</span><br/><span>context.</span><br/></p><p class=\"\"><br/><span>Figure 4: 2019</span><br/><span>sampling and 2023 drill hole locations.</span><br/></p><p class=\"\"><br/><span>Regional Context &amp; Indigenous</span><br/><span>Collaboration</span><br/></p><p class=\"\"><br/><span>On November 3, 2025, Coeur Mining Inc. announced a</span><br/><span>definitive agreement to acquire New Gold Inc. in a US$7 billion all-stock</span><br/><span>transaction, creating a combined US$20 billion mining company. This</span><br/><span>development further elevates the strategic importance of the region</span><br/><span>and highlights the consolidation of major copper-gold assets in</span><br/><span>British Columbia.</span><br/></p><p class=\"\"><br/><span>Brussels Creek is strategically located adjacent to New</span><br/><span>Gold Inc.’s New Afton Mine (Figure 1), a long-running copper-gold</span><br/><span>operation situated within the prolific Quesnel Terrane. This proximity</span><br/><span>to an established, high-value mining complex enhances Vanguard’s</span><br/><span>exploration potential and underscores the strategic significance of</span><br/><span>its land position within British Columbia’s Quesnel Terrane, a</span><br/><span>regional geologic belt renowned for hosting large alkalic porphyry</span><br/><span>copper-gold systems.</span><br/></p><p class=\"\"><br/><span>Vanguard acknowledges that the Brussels Creek Project</span><br/><span>lies within the Stk’emlúpsemc te Secwépemc territory, on the</span><br/><span>unceded traditional lands of the Secwépemc Nation. The Company is</span><br/><span>committed to working in close collaboration with Kempuls te</span><br/><span>Secwépemc</span><br/><span>(“TteS”) throughout the execution of current</span><br/><span>and future exploration programs. This collaboration includes a focus</span><br/><span>on local employment and training opportunities, procurement from</span><br/><span>Indigenous-owned businesses, environmental</span><br/><span>stewardship aligned with community priorities, and transparent,</span><br/><span>ongoing engagement as activities progress. </span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 5:</span><br/><span>Brussels Creek Claim Map.</span><br/></p><p class=\"\"><br/><span>Vanguard also continues ongoing First Nations</span><br/><span>consultation and an Archaeological Impact Assessment (“AIA”), required</span><br/><span>prior to accessing additional priority sites identified in the NI</span><br/><span>43-101 technical report prepared for Vanguard (formerly Le Mare Gold</span><br/><span>Corp.) dated February 19, 2021, and revised April 12, 2021, by Chris</span><br/><span>M. Healey, P.Geo., Principal Geologist, Healex Consulting Ltd. (EGBC</span><br/><span>#36477).</span><br/></p><p class=\"\"><br/><span>About Brussels Creek, Kamloops,</span><br/><span>BC</span><br/></p><p class=\"\"><br/><span>The Brussels Creek Property lies approximately 24 km</span><br/><span>west of Kamloops, and adjacent to New Gold’s New Afton Mine (Figure</span><br/><span>1). The project covers 1,350.43 hectares (17 claims, 66 cells)</span><br/><span>(Figure 5) and is hosted by a</span><br/><span>geological setting analogous to New Afton, as well as Highland Valley,</span><br/><span>Mount Polley, Kemess, and Galore Creek—all silica-saturated,</span><br/><span>copper-gold alkalic porphyry deposits, and all within the Quesnel</span><br/><span>Terrane. </span><br/></p><p class=\"\"><br/><span>Fieldwork has identified a mineralized quartz-feldspar</span><br/><span>porphyry body intruding Nicola Group volcanics. Historical sampling</span><br/><span>(1983–1984) delineated a 200 m × 400 m anomalous zone with gold</span><br/><span>values up to 3.5 g/t. Grab samples taken from the property in 2019</span><br/><span>include values of 10.1 g/t Au (with 0.7 g/t Pd), and 11.5 g/t Au,</span><br/><span>confirming high-grade surface mineralization.</span><br/></p><p class=\"\"><br/><span>Disclosure regarding New Afton: Information on New Gold</span><br/><span>Inc.’s New Afton Mine is sourced from New Gold’s publicly filed</span><br/><span>2024 annual results and provided solely to illustrate Brussels</span><br/><span>Creek’s proximity to an operating mine. The Qualified Person</span><br/><span>confirms this does not constitute restricted disclosure under NI</span><br/><span>43-101 s. 2.3(1)(a), as it refers to production from a third-party</span><br/><span>operation, not the Company’s property.</span><br/></p><p class=\"\"><br/><span>Vanguard’s management cautions</span><br/><span>that past results or discoveries on properties in proximity to</span><br/><span>Vanguard may not necessarily be indicative of the presence of</span><br/><span>mineralization on the Company’s properties.</span><br/></p><p class=\"\"><br/><span>Brussels Creek Web Page: Brussels Creek - Vanguard Mining Corp </span></p><p class=\"\"><span>About Vanguard Mining Corp.</span></p><p class=\"\"><span>Vanguard Mining Corp. is a Canadian mineral explorationcompany focused on the discovery and development of high-valuestrategic minerals. The Company is currently advancing explorationprojects in Argentina, Canada, and Paraguay, with a focus onidentifying and developing assets critical to the global energytransition. Vanguard is committed to responsible exploration and valuecreation through the acquisition and advancement of highly prospectiveuranium and precious-metal properties.</span></p><p class=\"\"><span>Qualified Person  </span></p><p class=\"\"><span>The scientific and technical information contained inthis news release has been reviewed and approved by LawrenceSegerstrom, P.Geo., M.SC., MBA, a consulting geologist who is a“Qualified Person” as such term is defined under NationalInstrument 43-101 – Standards of Disclosure for Mineral Projects(“NI 43-101”). Mr. Segerstrom is not at arm’s length to Vanguardand is therefore not independent for the purposes of NI 43-101.</span></p><p class=\"\"><span>The disclosure regarding production results from NewGold Inc.’s New Afton Mine is based on information contained in NewGold’s publicly filed 2024 annual results. This information isprovided strictly for contextual purposes to highlight the proximityof the Company’s Brussels Creek Project to an established miningoperation. The Qualified Person confirms that this disclosure does notconstitute restricted disclosure under Section 2.3(1)(a) of NI 43-101,as it refers to actual reported production from a third-party mine andnot to the Company’s property or mineralization.</span></p><p class=\"\"><span>The references to historical sampling results(1983–84) and grab samples collected in 2019 are explorationresults, not “historical estimates” as defined in Section 2.4 ofNI 43-101. Accordingly, the historical estimate disclosurerequirements of NI 43-101 do not apply. The Company cautions that grabsamples are selective by nature and may not be representative ofoverall mineralization on the property.</span></p><p class=\"\"><span>Vanguard cautions that past results or production fromproperties in proximity to Vanguard may not necessarily be indicativeof mineralization on the Company’s properties.</span></p><p class=\"\"><span>On Behalf of the Board ofDirectors</span></p><p class=\"\"><span>“David Greenway” </span></p><p class=\"\"><span>David Greenway, CEO </span></p><p class=\"\"><span>For further information, pleasecontact:</span></p><p class=\"\"><span>Vanguard Mining Corp.</span></p><p class=\"\"><span>Brent Rusin </span></p><p class=\"\"><span>Phone: +1 672-533-0348</span></p><p class=\"\"><span>E-Mail: brent@vanguardminingcorp.com</span></p><p class=\"\"><span>Website: vanguardminingcorp.com</span></p><p class=\"\"><span>Neither the Canadian SecuritiesExchange nor its Regulation Services Provider (as that term is definedin the policies of the CSE) accepts responsibility for the adequacy oraccuracy of this release.</span></p><p class=\"\"><span>Disclaimer for Forward-LookingInformation</span></p><p class=\"\"><span>Certain statements in this releaseare forward-looking statements, which reflect the expectations ofmanagement regarding Vanguard’s intention to continue to identifypotential transactions and make certain corporate changes andapplications. Forward looking statements consist of statements thatare not purely historical, including any statements regarding beliefs,plans, expectations, or intentions regarding the future. Suchstatements are subject to risks and uncertainties that may causeactual results, performance, or developments to differ materially fromthose contained in the statements. No assurance can be given that anyof the events anticipated by the forward-looking statements will occur or, if theydo occur, what benefits Vanguard will obtain from them. Theseforward-looking statements reflect managements’ current views andare based on certain expectations, estimates and assumptions which mayprove to be incorrect. A number of risks and uncertainties could causeactual results to differ materially from those expressed or implied bythe forward-looking statements, including Vanguard’s results ofexploration or review of properties that Vanguard does acquire. Theseforward-looking statements are made as of the date of this newsrelease and Vanguard assumes no obligation to update theseforward-looking statements, or to update the reasons why actualresults differed from those projected in the forward-lookingstatements, except in accordance with applicable securities laws.</span></p><p class=\"\"><span>###</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Tnw4471ry:0-vanguard-mining-identifies-two-new-gold-copper-soil-anomalies-at-brussels-creek-as-gold-trades-higher-and-copper-fundamentals-strengthen/",
            "pub_date": "2026-02-28 11:40:02",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2A8:0",
            "title": "Nvidia Plans New Chip To Speed AI Processing, Shake Up Computing Market- WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NVIDIA Corp </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NVIDIA PLANS NEW CHIP TO SPEED AI PROCESSING, SHAKE UP COMPUTING MARKET- WSJ</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NVIDIA IS DESIGNING A NEW SYSTEM FOR “INFERENCE” COMPUTING, A FORM OF PROCESSING THAT ALLOWS AI MODELS TO RESPOND TO QUERIES - WSJ</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2A8:0-nvidia-plans-new-chip-to-speed-ai-processing-shake-up-computing-market-wsj/",
            "pub_date": "2026-02-28 11:11:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO00P:0",
            "title": "OpenAI reaches deal to deploy AI models on U.S. Department of War classified network",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>OpenAI CEO Sam Altman said on Friday it has reached an agreement with the U.S. Department of War to deploy its AI models on classified cloud networks.</span></p><p class=\"\"><span>\"In all of our interactions, the DoW displayed a deep respect for safety and a desire to partner to achieve the best possible outcome,\" Altman said in a post on X.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO00P:0-openai-reaches-deal-to-deploy-ai-models-on-u-s-department-of-war-classified-network/",
            "pub_date": "2026-02-28 11:08:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012166:0",
            "title": "Dow Jones Newswires Codes - International Agencies and Organizations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>European Central Bank                          N/ECB </span><br/><span>European Investment Bank                       N/EIB </span><br/><span>European Union and Eurozone News               N/EEC </span><br/><span>Group of 20 and Group of Seven (G-7)           N/G20 </span><br/><span>International Atomic Energy Agency (IAEA)      N/IAE </span><br/><span>International Monetary Fund (IMF)              N/IMF </span><br/><span>North Atlantic Treaty Organization (NATO)      N/NTO </span><br/><span>Organization of Economic Cooperation and Dev.  N/OCD </span><br/><span>Organization of Petroleum Exporting Countries  N/OPC </span><br/><span>United Nations                                 N/UNN </span><br/><span>World Bank                                     N/WLB </span><br/><span>World Trade Organization                       N/WTO </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012166:0/",
            "pub_date": "2026-02-28 11:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012162:0",
            "title": "Dow Jones Newswires Codes - Industries",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Industries By Market Sector </span><br/><span> </span><br/><span>Basic Materials </span><br/><span> </span><br/><span>I/CHM                              Chemicals </span><br/><span>I/MNM                              Mining &amp; Metals </span><br/><span>I/MSS                              Mining Support Services </span><br/><span>I/DIA                              Diamonds &amp; Gemstones </span><br/><span>I/GLD                              Gold Mining </span><br/><span>I/PPM                              Platinum &amp; Precious Metals </span><br/><span>I/FOR                              Forest Products </span><br/><span>I/PAP                              Paper Products </span><br/><span>I/ALU                              Aluminum </span><br/><span>I/ONF                              Non-Ferrous Metals </span><br/><span>I/MNG                              Mining </span><br/><span>I/STL                              Steel and Iron </span><br/><span>                                    Manufacturers </span><br/><span> </span><br/><span>Consumer Goods </span><br/><span> </span><br/><span>I/VEH                              Motor Vehicles </span><br/><span>        I/AUT                      Automobiles </span><br/><span>I/AUP                              Motor Vehicle Parts </span><br/><span>                                   Auto Parts </span><br/><span>        I/TIR                      Tires </span><br/><span>I/FBT                              Food/Beverages/Tobacco </span><br/><span>I/BVG </span><br/><span>        I/DST                      Alcoholoic Beverages/Drinks </span><br/><span>        I/SFT                      Non-Alcoholic Beverages/Drinks </span><br/><span>I/FPR                              Fishing </span><br/><span>I/FRM                              Farming </span><br/><span>I/OFP                              Food Products </span><br/><span>I/HPR                              Home Electronics/ </span><br/><span>                                    Appliances </span><br/><span>        I/HPD                      Durable Household </span><br/><span>                                    Products </span><br/><span>        I/HPN                      Nondurable Household </span><br/><span>                                    Products </span><br/><span>        I/FTR                      Furnishings </span><br/><span>        I/HOM                      Residential Building Construction </span><br/><span>I/CSE                              Audio/Video Equipment </span><br/><span>I/REQ                              Leisure Goods </span><br/><span>        I/SGD                      Sporting Goods </span><br/><span>        I/TMF                      Toys &amp; Games </span><br/><span>I/LXG                              Luxury Goods </span><br/><span>I/TEX                              Textiles and Apparel </span><br/><span>        I/CLO                      Clothing &amp; Accessories </span><br/><span>        I/FOT                      Footwear </span><br/><span>I/WCP                              Jewelry &amp; Watches </span><br/><span>I/LTG                              Leisure/Travel Goods </span><br/><span>I/COS                              Personal Products </span><br/><span>I/TOB                              Tobacco </span><br/><span> </span><br/><span>Consumer Services </span><br/><span> </span><br/><span> </span><br/><span>I/AIR                              Passenger Airlines </span><br/><span>I/BCS                              General Services </span><br/><span>I/CNO                              Gambling </span><br/><span>I/MOV                              Film, Television, Music </span><br/><span>                                    Production </span><br/><span>I/RCS                              Recreational Services </span><br/><span>I/RLO                              Hotels/Restaurants </span><br/><span>        I/LOD                      Hotels </span><br/><span>        I/RES                      Restaurants &amp; Bars </span><br/><span>I/RTR                              Road/Rail Transport </span><br/><span>I/PSG                              Passenger Transport, Other </span><br/><span>I/TAT                              Travel &amp; Tourism </span><br/><span>I/ADV                              Media Agencies </span><br/><span>I/BRD                              Broadcasting &amp; Entertainment </span><br/><span>        I/MOV                      Film, Television &amp; Music </span><br/><span>                                   Production </span><br/><span>I/PNP                              Printing/Publishing </span><br/><span>        I/PNT                      Printing </span><br/><span>        I/PUB                      Publishing </span><br/><span>I/RTS                              Retailers </span><br/><span>        I/RTB                      Broadline Retailers </span><br/><span>        I/SAP                      Apparel Retailers </span><br/><span>        I/RTD                      Drug Retailers </span><br/><span>        I/OTS                      Specialty Retailers </span><br/><span>        I/FDR                      Food Retailers &amp; Wholesalers </span><br/><span>        I/HIM                      Home Improvement Retailers </span><br/><span>I/CSV                              Specialized Consumer Services </span><br/><span>I/SHL                              Shell Companies </span><br/><span> </span><br/><span>Health Care </span><br/><span> </span><br/><span>I/HEA                              Health Care Providers </span><br/><span>I/MDV                              Medical Equipment/Supplies </span><br/><span>I/DRG                              Pharmaceuticals </span><br/><span>I/BTC                              Biotechnology </span><br/><span>I/RHC                              Healthcare REITs </span><br/><span> </span><br/><span>Oil &amp; Gas </span><br/><span> </span><br/><span>I/FSL                              Fossil Fuels </span><br/><span>I/OIL                              Oil &amp; Gas Companies-Major </span><br/><span>I/OIS                              Oil Extraction </span><br/><span>I/EQS                              Other Oilfield </span><br/><span>                                    Equipment/Services </span><br/><span>I/PIP                              Pipeline Operators </span><br/><span> </span><br/><span>Financial </span><br/><span> </span><br/><span>I/BKS                              Banking/Credit </span><br/><span>        I/BNK                      Banks </span><br/><span>                                   Savings &amp; Loans </span><br/><span>        I/BAN                      Major International </span><br/><span>                                    Banks </span><br/><span>I/IAV                              Investing/Securities </span><br/><span>        I/FDS                      Funds </span><br/><span>I/INS                              Insurance-All </span><br/><span>        I/INF                      Full Line Insurance </span><br/><span>        I/INB                      Insurance Brokers </span><br/><span>        I/INP                      Property and Casualty </span><br/><span>                                    Insurance </span><br/><span>        I/INU                      Reinsurance </span><br/><span>        I/INL                      Life Insurance </span><br/><span>I/REA                              Real Estate </span><br/><span>        I/RED                      Real Estate Activites </span><br/><span>        I/REI                      Real Estate Investment </span><br/><span>                                    Trusts </span><br/><span>I/AMG                              Investment Advisors </span><br/><span>I/CFN                              Consumer Finance </span><br/><span>I/FIS                              Specialty Finance </span><br/><span>I/SCR                              Investment Services </span><br/><span>I/MFN                              Mortgage Finance </span><br/><span>I/CEF                              Closed End Funds </span><br/><span>I/EXT                              Exchange Traded Funds </span><br/><span>I/ZFU                              Funds </span><br/><span> </span><br/><span>Industrial </span><br/><span> </span><br/><span>I/MCH                              Machinery </span><br/><span>I/IDP                              Industrial Products </span><br/><span>I/ITC                              Electronic Equipment </span><br/><span>I/BLD                              Building Materials </span><br/><span>                                    &amp; Fixtures </span><br/><span>I/CON                              Heavy Construction </span><br/><span>I/ARO                              Aerospace and Defense </span><br/><span>       I/ASP                       Aerospace </span><br/><span>       I/DFN                       Defense </span><br/><span>I/CTR                              Containers and Packaging </span><br/><span>I/IDD                              Diversified Industrial </span><br/><span>I/ELQ                              Electronic Components </span><br/><span>                                    &amp; Equipment </span><br/><span>I/ITC                              Electronic Equipment </span><br/><span>I/TRQ                              Commercial Vehicles </span><br/><span>                                    &amp; Trucks </span><br/><span>I/FAC                              Industrial Machinery </span><br/><span> </span><br/><span>I/AIF                              Air Freight </span><br/><span>I/ATR                              Air Transport </span><br/><span>I/MAR                              Marine Transportation </span><br/><span>I/RAI                              Railroads </span><br/><span>I/TRS                              Transportation Services </span><br/><span>I/TRK                              Trucking </span><br/><span> </span><br/><span>I/SVC                              Industrial/Commercial </span><br/><span>                                    Services-All </span><br/><span>        I/POL                      Waste &amp; Disposal </span><br/><span>                                    Services </span><br/><span>        I/ICS                      Business Support </span><br/><span>                                    Services </span><br/><span>                    I/ENR          Engineering Contractors </span><br/><span>        I/EAG                      Business Training </span><br/><span>                                    &amp; Employment Agencies </span><br/><span>        I/DIB                      Industrial Suppliers </span><br/><span>        I/FAD                      Financial Administration </span><br/><span> </span><br/><span>Technology </span><br/><span> </span><br/><span>I/ETK                              Emerging Technologies </span><br/><span>I/CMT                              Telecommunications </span><br/><span>                                    Equipment </span><br/><span>I/CPR                              Computers/Consumer Electronics </span><br/><span>I/SEM                              Semiconductors </span><br/><span>I/TSX                              Computer Services </span><br/><span>I/SOF                              Software </span><br/><span>I/ISV                              Internet </span><br/><span> </span><br/><span>Telecommunications </span><br/><span> </span><br/><span>I/FTS                              Wired Telecommunications Services </span><br/><span>I/CTS                              Wireless Telecommunications Services </span><br/><span> </span><br/><span>Utilities </span><br/><span> </span><br/><span>I/EGU                              Electric/Gas Utilities </span><br/><span>         I/ELC                     Electric Utilities </span><br/><span>         I/GAS                     Gas Utilities </span><br/><span>I/MUT                              Multi-utilities </span><br/><span>I/WAT                              Water Utilities </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012162:0/",
            "pub_date": "2026-02-28 11:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012163:0",
            "title": "Dow Jones Newswires Codes - Highlights of the Service",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> P/PMDM   Exclusive News </span><br/><span> P/PMDA   Exclusive Analysis </span><br/><span> P/PMA    Private Markets </span><br/><span> P/BOND   DJ Fixed Income News </span><br/><span> P/TPOL   Trump Administration and U.S. Politics </span><br/><span> P/PACT   Actionable Content </span><br/><span> P/WJE    WSJ Events </span><br/><span> N/HOT    Hot News </span><br/><span> N/NWS    Major News Events </span><br/><span> N/ALMT   Market Talks </span><br/><span> N/HOH    News Highlights </span><br/><span> N/DTK    Data Talks </span><br/><span> P/DJNA   DJ Newswires Analysis </span><br/><span> P/CMDC   Commodity Comments </span><br/><span> N/CAL    Calendars (daily, earnings, equity) </span><br/><span> N/BBB    Bulletin Board (for subscriber news/advisories) </span><br/><span> STOCK MARKET FEATURES </span><br/><span> N/NYS    Large-Cap Market Commentary </span><br/><span> N/NDQ    Small-Cap Market Commentary </span><br/><span> N/ANL    Analysts' Comments and Ratings of Stocks </span><br/><span> N/INI    Initial Public Offerings </span><br/><span> N/STK    Stock Market News </span><br/><span> N/REG    Stock and Bond Registrations/Pricing </span><br/><span> S/ACT    Most Active Stocks </span><br/><span> CREDIT MARKET NEWS </span><br/><span> G/FED    Federal Reserve Board </span><br/><span> G/TRE    U.S. Treasury Department </span><br/><span> N/TPC    Treasury Prices &amp; Commentary </span><br/><span> N/COB    Corporate Bond News </span><br/><span> N/RTG    Bond Ratings &amp; Comments </span><br/><span> N/FIN    U.S. Interest Rate News </span><br/><span> MUTUAL FUND NEWS </span><br/><span> I/ZFU    Mutual Fund Company News </span><br/><span> N/FND    Mutual Fund News </span><br/><span> N/ETF    Exchange-Traded Funds </span><br/><span> N/HGF    Hedge Fund News </span><br/><span> BUSINESS NEWS </span><br/><span> N/ERN    Earnings Reports </span><br/><span> N/DIV    Dividends </span><br/><span> N/SPL    Stock Splits </span><br/><span> N/RSP    Reverse Stock Splits </span><br/><span> N/TNM    Takeovers, Mergers and Acquisitions </span><br/><span> N/IAT    Investor Activism </span><br/><span> N/BBK    Buybacks </span><br/><span> N/CMD    Commodities News </span><br/><span> N/PFN    Personal Finance News </span><br/><span> ESG INVESTING </span><br/><span> P/ESG    Environmental, Social and Governance Impact Investing </span><br/><span> P/EII    Environmental Impact Investing </span><br/><span> P/SII    Social Impact Investing </span><br/><span> P/GII    Governance Impact Investing </span><br/><span> WASHINGTON NEWS </span><br/><span> N/EMI    U.S. Economic Indicators </span><br/><span> N/EMJ    U.S. Economic Forecasts &amp; Analysis </span><br/><span> G/SEC    Securities and Exchange Commission News </span><br/><span> G/CNG    U.S. Congress News </span><br/><span> G/EXE    White House News </span><br/><span> G/DGE    Department of Government Efficiency (DOGE) </span><br/><span> N/TAX    Taxes </span><br/><span> INTERNATIONAL AND REGIONAL NEWS </span><br/><span> N/FRX    Foreign Exchange News </span><br/><span> N/EMU    Euro Zone News &amp; Issues </span><br/><span> N/PLT    International and Domestic Politics </span><br/><span> N/ICM    Interest Rates, International </span><br/><span> N/IEI    International Economic Indicators </span><br/><span> N/IEN    International Economic News and Analysis </span><br/><span> N/IEJ    International Economic Indicator Predictions </span><br/><span> OTHER DJ PUBLICATIONS ON NEWSWIRES </span><br/><span> P/WJN    Wall Street Journal on Newswires </span><br/><span> N/JNL    Wall Street Journal - Online Versions of Print Articles </span><br/><span> P/WSJL   WSJ Live Coverage </span><br/><span> P/WML    WSJ Markets Live </span><br/><span> N/BRN    Barron's Weekly Magazine on Newswires </span><br/><span> N/BRNO   Barrons.com Articles on Newswires </span><br/><span> P/IBDY   Investor's Business Daily on Newswires </span><br/><span> P/OPIS   OPIS on Newswires </span><br/><span> MARKET NEWS AND COMMENTARY </span><br/><span> N/SMC    Stock Market Commentary </span><br/><span> N/CRP    Cryptocurrency </span><br/><span> N/TPC    Treasury Price Commentary </span><br/><span> N/GPC    Gold Prices and Commentary </span><br/><span> N/MKT    Market News </span><br/><span> N/ALMT   Market Talks </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012163:0/",
            "pub_date": "2026-02-28 11:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227012164:0",
            "title": "Dow Jones Newswires Codes - General",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Arts &amp; Entertainment                         N/ART </span><br/><span>Biography                                    N/BIO </span><br/><span>Colleges &amp; Universities                      N/CLG </span><br/><span>Charities, Community &amp; Civic Groups          N/CMY </span><br/><span>Consumer Issues                              N/CSU </span><br/><span>Contests &amp; Awards                            N/CNT </span><br/><span>Crime, Criminal Investigations               N/CRM </span><br/><span>  and Proceedings </span><br/><span>Education                                    N/EDU </span><br/><span>Environmental News                           N/ENV </span><br/><span>Food &amp; Cooking                               N/FCG </span><br/><span>Fashion                                      N/FSH </span><br/><span>Health                                       N/HLT </span><br/><span>Law Enforcement                              N/LEN </span><br/><span>Lifestyles                                   N/LIF </span><br/><span>Lawsuits                                     N/LWS </span><br/><span>Military Action                              N/MLT </span><br/><span>Obituaries                                   N/OBT </span><br/><span>Public-Policy &amp; Regulatory Issues            N/PBP </span><br/><span>Politics                                     N/PLT </span><br/><span>Religion                                     N/RLG </span><br/><span>Reviews (Book, Movie, Art, Restaurant, Etc.) N/RVW </span><br/><span>Sports and Recreation                        N/SPT </span><br/><span>   Baseball                                  N/BSE </span><br/><span>   Basketball                                N/BKT </span><br/><span>   Football (American)                       N/FTB </span><br/><span>   Golf                                      N/GLF </span><br/><span>   Hockey                                    N/HKY </span><br/><span>   Olympics                                  N/OLY </span><br/><span>   Soccer                                    N/SOC </span><br/><span>   Tennis                                    N/TNS </span><br/><span>Transportation                               N/TSP </span><br/><span>Travel                                       N/TVL </span><br/><span>Weather &amp; Natural Disasters                  N/WTH </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227012164:0/",
            "pub_date": "2026-02-28 11:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}