{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463831:0",
            "title": "DCC Logs Growth in Fiscal Q3 Adjusted Operating Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DCC  said Wednesday that its group adjusted operating profit for the fiscal third quarter ended Dec. 31, 2024, was \"modestly ahead\" of the prior-year period on a constant currency basis. </p><p class=\"\">The British sales, marketing, and support services company affirmed its expectations for its fiscal full year's operating profit to increase.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463831:0/",
            "pub_date": "2025-02-05 15:26:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463833:0",
            "title": "GSK Posts Lower FY24 Profit; Turnover Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GSK  said Wednesday that profit for full-year 2024 fell, while turnover rose year over year. </p><p class=\"\">Profit attributable to shareholders for the 12 months ended Dec. 31, 2024, was 2.58 billion pounds sterling, compared with 4.93 billion pounds earlier. EPS moved to 0.622 pound from 1.199 pounds. </p><p class=\"\">The pharmaceutical giant's turnover was 31.38 billion pounds, compared with 30.33 billion pounds a year ago. </p><p class=\"\">Meanwhile, the board declared a fourth-quarter dividend of 0.16 pound per share, payable April 10 to shareholders on record Feb. 21. It paid 0.16 pound per share a year ago. This takes the full-year dividend to 0.61 pound per share, up from 0.58 pound per share in the previous year. </p><p class=\"\">GSK said it expects to pay a full-year dividend of 0.64 pound per share for 2025. Turnover for 2025 is expected to increase between 3% and 5%. </p><p class=\"\">The company is targeting sales of more than 40 billion pounds by 2031. It also maintained its outlook for the period from 2021 to 2026, expecting sales growth of more than 7%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463833:0/",
            "pub_date": "2025-02-05 15:26:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:8fcbfbbdf094b:0",
            "title": "Large trades totalling nearly Rs 100 crore in Rakesh Jhunjhunwala stock today; share price gains amid heavy volumes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The shares of Star Health and Allied Insurance saw heightened activity on Wednesday, February 5, with multiple large trades worth a total of Rs 96 crore executed during the session. The stock was up 1.1 percent at Rs 443.1 as of 12:30 pm, supported by heavy volumes.</p><p class=\"\">Heavy volumes, stock still way off 52-week high</p><p class=\"\">Star Health witnessed a surge in trading volumes, with activity reaching 3.6 times its 10-day average by late noon. Despite the gains, the stock remains down 31.5 percent from its 52-week high of Rs 647, recorded on September 9, 2024. However, it has recovered 4.2 percent from its 52-week low of Rs 425.5, hit on January 29, 2025.</p><p class=\"\">Over the past year, Star Health has lost 23 percent of its value, with its market capitalisation currently at Rs 26,000 crore.</p><p class=\"\">Fundamentals and valuation checkTrailing twelve-month (TTM) EPS: Rs 13.41TTM Price-to-earnings (P/E) ratio: 33.03, lower than the sector P/E of 45.8Price-to-book (P/B) ratio: 3.78</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:8fcbfbbdf094b:0-large-trades-totalling-nearly-rs-100-crore-in-rakesh-jhunjhunwala-stock-today-share-price-gains-amid-heavy-volumes/",
            "pub_date": "2025-02-05 15:26:31",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001879_20250205001879:0",
            "title": "Ferrari Cut to Equalweight From Overweight by Barclays Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001879_20250205001879:0/",
            "pub_date": "2025-02-05 15:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:83ca6c109094b:0",
            "title": "Accumulate KEC International; target of Rs 930: Prabhudas Lilladher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Prabhudas Lilladher's research report on KEC International</p><p class=\"\">We revise our EPS estimates by -8.3%/-5.2% factoring in slower margin recovery amid higher revenue mix of non-T&amp;D and upgrade the rating to ‘Accumulate’ from Hold due to recent sharp correction in the stock with a revised TP of Rs930 (Rs997 earlier). KEC International (KEC) reported a revenue growth of 6.8% YoY, while EBITDA margin expanded by 85bps YoY to 7.0%. The domestic T&amp;D opportunity pipeline remains strong, driven by increasing momentum in the power sector. Internationally, T&amp;D prospects are expanding across key regions, including the Middle East, Africa, CIS, and the Americas, with Saudi Arabia leading investments in energy transition and T&amp;D infrastructure. SAE Towers continues to witness healthy demand; however, the depreciation of the Brazilian currency against the USD has tempered growth in this segment. Meanwhile, the Oil &amp; Gas sector continues to face challenges due to tendering delays from Oil PSUs. Persistent labor shortages and collection delays in Water projects and Railways have prompted management to revise its topline growth guidance downward from ~15% to 12-14% YoY. In response, the company remains selective in Civil and Railway order bookings, prioritizing cash flow certainty and shorter execution cycles.</p><p class=\"\">Outlook</p><p class=\"\">We remain positive on KEC for the long term given its 1) strong order book, 2) healthy execution momentum, 3) robust T&amp;D outlook, especially in renewable energy, and 4) expansion of Cables business. The stock is currently trading at a P/E of 17.7x/13.8x on FY26/27E earnings. We value the stock at a PE of 18x on Sep’26E EPS (same as earlier). Upgrade to ‘Accumulate’.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">KEC International - 05022025 - prabhu</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:83ca6c109094b:0-accumulate-kec-international-target-of-rs-930-prabhudas-lilladher/",
            "pub_date": "2025-02-05 15:27:01",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463835:0",
            "title": "Zhenro Properties Group to Delist Senior Bonds Upon Maturity",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zhenro Properties Group  will delist its 7.35% senior bonds from the Hong Kong Stock Exchange upon maturity on February 5, 2025, according to a Tuesday filing with the bourse. </p><p class=\"\">The company cited liquidity constraints and ongoing discussions on liability management as reasons for its inability to settle outstanding payments.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463835:0/",
            "pub_date": "2025-02-05 15:27:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001370:0",
            "title": "GSK Expects Further Profit Growth After Beating Market Views",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:00 GMT) </strong>*GSK PLC 4Q Sales Consensus Was GBP7.83B<br/><strong class=\"root-Tkn6WL2y\">(07:00 GMT) </strong>*GSK PLC 4Q Core EPS Consensus Was 20.6p<br/><strong class=\"root-Tkn6WL2y\">(07:01 GMT) </strong>*GSK PLC Declares 4Q Dividend of 16p<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*GSK PLC Issues GBP2B Buyback<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*GSK PLC Sees 2025 Turnover Growth of 3% to 5%<br/><strong class=\"root-Tkn6WL2y\">(07:03 GMT) </strong>*GSK PLC Sees 2025 Adjusted Operating Growth of 6% - 8%<br/><strong class=\"root-Tkn6WL2y\">(07:03 GMT) </strong>*GSK PLC Sees 2025 Adjusted EPS Growth of 6%-8%<br/><strong class=\"root-Tkn6WL2y\">(07:03 GMT) </strong>*GSK PLC Raises Mid-Term View<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*GSK PLC Sees 2031 Sales Outlook at More Than GBP40B<br/><strong class=\"root-Tkn6WL2y\">(07:05 GMT) </strong>*GSK PLC Had Seen 2031 Sales Outlook at More Than GBP38B<br/><strong class=\"root-Tkn6WL2y\">(07:28 GMT) </strong>GSK Expects Further Profit Growth After Beating Market Views</p><p class=\"\">By Helena Smolak</p><p class=\"\">GSK expects its sales and profit to grow in the new year after cancer treatments lifted sales and profit ahead of analysts' expectations in the fourth quarter despite lower vaccines sales on weak demand in the U.S.</p><p class=\"\">The British pharmaceutical giant said Wednesday that for 2025 it expects sales to grow 3% to 5%. It also targets core operating profit and core earnings per share to grow between 6% and 8%. Targets are at constant exchange rates.</p><p class=\"\">This compares with 2024 sales growth of 7%, core operating profit growth of 11% and core earnings per share growth of 10%.</p><p class=\"\">Its fourth-quarter sales rose 4% at constant currencies to 8.12 billion pounds ($10.13 billion), above the 7.83 billion pounds that analysts had expected, according to a consensus polled by Visible Alpha.</p><p class=\"\">Core operating profit, closely watched by analysts and investors, fell 10% at constant currencies to 1.43 billion pounds on lower-than-anticipated vaccine sales. Analysts had expected 1.385 billion pounds.</p><p class=\"\">Its core earnings per share fell 10% at constant currencies to 23.2 pounds, above analysts' expectations of 20.6 pounds.</p><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001370:0/",
            "pub_date": "2025-02-05 15:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463836:0",
            "title": "JonDeTech Sensors CEO to Depart",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JonDeTech Sensors (JDT.ST) Chief Executive Officer Leif Borg plans to step down from the position and leave the company. </p><p class=\"\">The sensor technology company said in a Wednesday release that Borg has a six-month notice period and will remain with the company until the appointment of a successor. </p><p class=\"\">The company will commence the search for a new CEO immediately.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463836:0/",
            "pub_date": "2025-02-05 15:28:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001519:0",
            "title": "TotalEnergies Earnings Jump On Quarter",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*TotalEnergies Proposes Final Dividend for 2024 EUR0.85 a Share<br/><strong class=\"root-Tkn6WL2y\">(07:05 GMT) </strong>*TotalEnergies: Takes Full-year Dividend to EUR3.22 a Share<br/><strong class=\"root-Tkn6WL2y\">(07:06 GMT) </strong>*TotalEnergies 4Q Adj EBITDA $10.53B<br/><strong class=\"root-Tkn6WL2y\">(07:07 GMT) </strong>*TotalEnergies 4Q Net Pft $3.96B<br/><strong class=\"root-Tkn6WL2y\">(07:07 GMT) </strong>*Analysts Has Seen TotalEnergies 4Q Net Profit at $4.21B<br/><strong class=\"root-Tkn6WL2y\">(07:07 GMT) </strong>*TotalEnergies 4Q Adj Net Profit $4.41B<br/><strong class=\"root-Tkn6WL2y\">(07:08 GMT) </strong>*Analysts Has Seen TotalEnergies 4Q Adj Net Profit at $3.94B<br/><strong class=\"root-Tkn6WL2y\">(07:08 GMT) </strong>*TotalEnergies 4Q Cash Flow From Operating Activities $12.51B<br/><strong class=\"root-Tkn6WL2y\">(07:08 GMT) </strong>*TotalEnergies 4Q Adj EPS $1.90<br/><strong class=\"root-Tkn6WL2y\">(07:09 GMT) </strong>*TotalEnergies 4Q Hydrocarbon Production 2.43M BOE/D<br/><strong class=\"root-Tkn6WL2y\">(07:10 GMT) </strong>*TotalEnergies 4Q Hydrocarbon Production rose 1% vs 3Q<br/><strong class=\"root-Tkn6WL2y\">(07:10 GMT) </strong>*TotalEnergies Had Guided for 4Q Hydrocarbon at 2.4M to 2.45M BOE/D<br/><strong class=\"root-Tkn6WL2y\">(07:10 GMT) </strong>*TotalEnergies: 4Q European Refining Margin Maker Rose 68% Vs 3Q<br/><strong class=\"root-Tkn6WL2y\">(07:10 GMT) </strong>*TotalEnergies: 4Q European Refining Margin Maker $25.9 ton<br/><strong class=\"root-Tkn6WL2y\">(07:14 GMT) </strong>*TotalEnergies: Integrated LNG, Integrated Power Divisions Boosted 4Q Results<br/><strong class=\"root-Tkn6WL2y\">(07:16 GMT) </strong>*TotalEnergies Targets Buybacks of $2B a Quarter in 2025<br/><strong class=\"root-Tkn6WL2y\">(07:29 GMT) </strong>TotalEnergies Earnings Jump On Quarter</p><p class=\"\">By Adam Whittaker</p><p class=\"\">TotalEnergies reported a 72% jump on its fourth-quarter net profit, boosted by strong earnings in its integrated LNG and integrated power divisions, but still below analysts' expectations.</p><p class=\"\">Net profit for the three months ended Dec. 31 rose to $3.96 billion, compared with analysts expectations of $4.21 billion, according to a Visible Alpha consensus.</p><p class=\"\">The French oil and gas company also said it would target share buybacks worth 2 billion pounds ($2.50 billion) a quarter in 2025.</p><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001519:0/",
            "pub_date": "2025-02-05 15:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001391:0",
            "title": "SSE Renewables Output Rose; Issues EPS Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:00 GMT) </strong>*SSE PLC Sees 2025 Adj EPS 154p-Adj EPS 163p<br/><strong class=\"root-Tkn6WL2y\">(07:01 GMT) </strong>*SSE: Renewables Output Up 26% Year-On-Year for the First Three Quarters<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*SSE Renewables Generation Output Over First Nine Mos Up 26%<br/><strong class=\"root-Tkn6WL2y\">(07:29 GMT) </strong>SSE Renewables Output Rose; Issues EPS Guidance</p><p class=\"\">By Anthony O. Goriainoff</p><p class=\"\">SSE said renewables energy output over its first three fiscal quarters rose and issued adjusted earnings per share guidance for the full fiscal year.</p><p class=\"\">The U.K. energy group said Wednesday that renewables output over the nine-month period to Dec. 31 rose 26% to 9,253 gigawatt hours, reflecting a good operational performance against variable weather conditions, particularly in the third quarter.</p><p class=\"\">SSE Thermal's output in the same period rose to 12,459 GWh from 10,797 GWh in the year-prior period.</p><p class=\"\">SSE didn't provide full earnings guidance, but said that for the year ending March 31 it expects adjusted earnings per share within a range of 154 to 163 pence ($1.92-$2.03). In fiscal 2024 adjusted EPS was 158.5 pence.</p><p class=\"\">In November, SSE said it was on track to deliver fiscal 2027 adjusted EPS of between 175 pence and 200 pence.</p><p class=\"\">\"As we look to the opportunities presented by decarbonization our focus remains on capital discipline, strategic delivery and the efficient operation of our value-creating assets,\" the company said.</p><p class=\"\">Write to Anthony O. Goriainoff at anthony.orunagoriainoff@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001391:0/",
            "pub_date": "2025-02-05 15:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001897:0",
            "title": "Stronger Market Reaction Likely if U.S.-China Talks Fail to Deliver Results — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001897:0/",
            "pub_date": "2025-02-05 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001887:0",
            "title": "Arm's Earnings Could Shed Light on Tech's Big Question: What's Next for AI After DeepSeek? — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tae Kim</p><p class=\"\">Investors eager to hear what the DeepSeek moment means for the AI chip industry will be tuning in on Wednesday, when Arm Holdings discloses its quarterly results.</p><p class=\"\">Arm makes money by licensing its chip designs to semiconductor companies and smartphone makers. That means its management is in a good position to assess the impact of the Chinese AI model on the industry.</p><p class=\"\">Results for Arm's fiscal third quarter are due after the close.</p><p class=\"\">The consensus among analysts is for Arm to report December quarter revenue of $949 million with adjusted earnings per share of 34 cents. For the current quarter, analysts' consensus estimates are for revenue of $1.22 billion and earnings per share of 52 cents, according to FactSet.</p><p class=\"\">On Friday, KeyBanc analyst John Vinh reaffirmed his Overweight rating and $195 price target on Arm. The analyst believes the results won't be a disappointment.</p><p class=\"\">\"We expect ARM to post in line results and in line guidance, driven by continued strength in AI and traditional server,\" he wrote.</p><p class=\"\">Arm's latest advanced chip technology, called Armv9, generates significantly higher royalty rates than its previous Armv8. It is also making progress in high-end cloud server processors. Customers such as Microsoft and Nvidia are making chips with more than 100 \"cores\" using Arm's designs.</p><p class=\"\">Arm shares are up 128% over the past 12 months, compared with the 9% gain for the iShares Semiconductor ETF.</p><p class=\"\">Write to Tae Kim at tae.kim@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001887:0/",
            "pub_date": "2025-02-05 15:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463830:0",
            "title": "British Utility SSE Forecasts Good Operational Performance for FY25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SSE  said Wednesday that it expects adjusted EPS for fiscal 2025 to signify good operational performance against variable weather conditions. </p><p class=\"\">In its trading update for the fiscal third quarter ended Dec. 31, 2024, the British utility company said it expects adjusted EPS for the fiscal year to be between 1.54 pounds sterling and 1.63 pounds. Adjusted EPS for fiscal 2024 amounted to 1.585 pounds.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463830:0/",
            "pub_date": "2025-02-05 15:22:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463828:0",
            "title": "Happiest Minds Technologies' Consolidated Net Proifit Falls in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Happiest Minds Technologies  said its consolidated net profit dropped to 501.0 million Indian rupees in the fiscal third quarter from 596.2 million rupees a year ago, according to a Tuesday filing with the Indian exchanges by the IT company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, slipped to 3.33 rupees compared with 3.96 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 increased year on year to 5.31 billion rupees from 4.10 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463828:0/",
            "pub_date": "2025-02-05 15:22:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463825:0",
            "title": "Assa Abloy Reports Higher FY24 Net Income, Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Assa Abloy (ASSA-B.ST) said Wednesday its net income and sales for the full year 2024 jumped year over year. </p><p class=\"\">Net income attributable to shareholders for the 12 months ended Dec. 31, 2024, was 15.64 billion kronor, compared with 13.63 billion kronor a year ago. EPS moved to 14.09 kronor from 13.54 kronor. </p><p class=\"\">The Swedish access systems company's sales were 150.16 billion kronor, compared with 140.72 billion kronor earlier. </p><p class=\"\">Analysts polled by FactSet were expecting 149.62 billion kronor in sales, 15.53 billion kronor in net income, and 14.26 kronor in EPS. </p><p class=\"\">Meanwhile, the board proposed a dividend of 5.90 kronor per share to be distributed in two equal installments. It paid a dividend of 5.40 kronor per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463825:0/",
            "pub_date": "2025-02-05 15:23:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001872:0",
            "title": "Nikkei Rises 0.1%, Led by Auto Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001872:0/",
            "pub_date": "2025-02-05 15:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001875:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p><p class=\"\">0714 GMT - The impact of Trump's 10% tariff on Chinese exports on China's GDP growth this year looks manageable, Bank of Singapore chief economist Mansoor Mohi-uddin writes in a note. If the 10% levy is maintained for the rest of 2025, that would shave around 0.5% off China's GDP growth, he says. But if tariffs are raised to 20% to 30%, that would likely drag China's economic growth this year to 4.0% from 5.0% last year, he adds. That said, Beijing's retaliation, with targeted tariffs aimed at U.S. exports amounting to only $14 billion, leaves the door open for a potential deal with Washington to avert a broader trade war, he adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0704 GMT - The 'tariff can' has just been kicked down the road, with the idea of imposing levies on U.S. imports from its two closest neighbours still not off the table entirely, says Pepperstone's Michael Brown. \"In fact, this whole saga could well rumble on until the start of April, when the review ordered by President Trump into U.S. trade policy is due to report back,\" the senior research strategist says in a note. Trump agreed to postpone the tariffs on Mexico and Canada for a month after talks with the leaders of both countries. \"Perhaps, it is at that point, that we will see tariffs shift from being used as a bargaining chip to further certain political aims, to actually being used as a measure to address trade imbalances,\" Brown says. (emese.bartha@wsj.com)</p><p class=\"\">0659 GMT - Japan, South Korea and Taiwan have dodged tariff bullets for now, but they shouldn't get too comfortable, Moody's Analytics economists say. The three appear obvious targets given their hefty trade surpluses with the U.S. One possible reason is security ties with the U.S. Another is the fact that Japan is among the U.S.'s biggest foreign investors. Korean and Taiwanese firms have been ramping up investment too. That's come at China's expense, aligning with the U.S. bid to curb its influence in supply chains, they add. But the mood could shift and tariffs could come. The economies also face collateral damage. Carmakers like Toyota and Kia have plants in Mexico, and Taiwanese and Korean chip and electronics producers in the U.S. face disruptions via trade barriers or surging production costs. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0649 GMT - South Korea's benchmark Kospi rose 1.1% to close at 2509.27 amid easing fears over U.S. tariffs. Foreign and institutional investors were net buyers. LG Energy Solution and Samsung SDI gained 3.6% and 3.4%, respectively, after the government prepared a new aid plan for the EV battery industry. Memory-chip maker SK Hynix added 4.0%. Mobile internet giant Kakao climbed 5.6% after agreeing to develop AI Products with OpenAI. Meanwhile, LG CNS, an IT service affiliate of LG Group, fell 9.9% on its stock exchange debut. USD/KRW settled 1.3% lower at 1,444.30 in Seoul onshore trading. South Korea's 10-year government bond yield was down 2.3 bps at 2.821%. (kwanwoo.jun@wsj.com)</p><p class=\"\">0518 GMT - Hong Kong could see a turnaround in retail sales this year on an estimated 25% increase in visitors to the city, with CGS International analysts projecting retail sales gain at 5% for 2025. The city's retail sales by value fell 7.3% in 2024.The easing of visa policies for mainland Chinese visitors to Hong Kong and continued increase in foreign tourists have boosted Hong Kong's visitor numbers, they add. The opening of Kai Tak Sports Park in March and multiple major events including concerts and sporting events should also attract high-spending tourists in 2025 and encourage local consumption, they say. There were encouraging signs in higher visitor numbers from China and other countries over the Lunar New Year holiday, which have boosted hotel bookings and luxury spending, CGS International says. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001875:0/",
            "pub_date": "2025-02-05 15:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001874:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0657 GMT - Grab's growth drivers are intact, and its adjusted Ebita will likely surge in 2025, driven by margin expansion, HSBC analysts write in a note. Grab is likely to strengthen its leadership position in ride-hailing and deliveries, as it invests into products to help expand its total addressable market with affordable products, they say. However, as the priority will be on new product initiatives, cross-selling and lending products, HSBC trims earlier margin estimates and reduces its adjusted Ebitda projection by 2%-5% for 2025-2026. HSBC lowers its target price to $5.45 from $5.50 but upgrades its stock rating to buy from hold as the stock offers 20% upside, and valuations have become attractive after the recent price correction. (kimberley.kao@wsj.com)</p><p class=\"\">0655 GMT - Chinese AI company DeepSeek's breakthrough is unlikely to hurt demand in the short-term, although the market will likely cut multiples to price on uncertainties in the longer term, according to Julius Baer analysts in an emailed commentary. The market is debating on the long-term impact, as optimists argue that a lower entry barrier would attract new players, which should boost semiconductor demand, they write. \"We do not expect much weakness in the near-term demand,\" the analysts note. They add that long-term demand will be determined by changes in AI-driven computing needs, such as inference, noting that such demand could offset the possibly lower computing demand in training. DeepSeek's development marks a major evolution, though not entirely a revolution, in artificial intelligence, they say. (tracy.qu@wsj.com)</p><p class=\"\">0649 GMT - Thai Credit Bank appears confident in lowering credit costs in 2025, CGS International's Weerapat Wonk-Urai says, citing management commentary at an analysts' briefing. Management highlighted the bank's improving debt collection capabilities, supported by its front office staff helping with loan collections as soon as the loans become overdue, the analyst says in a research report. Also, the bank sold non-performing loans worth THB1.9 billion last year and plans to sell THB1.4 billion worth of NPLs this year, the analyst adds. The brokerage raises the stock's target price to THB26.12 from THB26.00 with an unchanged add rating. Shares are 1.0% lower at THB19.00. (ronnie.harui@wsj.com)</p><p class=\"\">0511 GMT - The U.S. Postal Services will likely need time to sort out how to implement new the tariff policy before resuming acceptance of Chinese packages, according to Chelsey Tam, senior equity analyst at Morningstar in an email. The process poses a significant challenge, given that in 2024, an estimated 4 million daily packages arrived in the U.S. under the de minimis rule, which allows low-value shipments to bypass duties and custom scrutiny, Tam says. The Trump administration revoked this exemption for China as part of broader tariff measures. Among Chinese e-commerce players, PDD Holdings will be hurt as its overseas e-commerce platform Temu has a significant exposure in the U.S., the analyst notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001874:0/",
            "pub_date": "2025-02-05 15:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463812:0",
            "title": "Market Chatter: Singapore Unlikely to be Direct Target in US-China Trade War, Says Foreign Minister",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore is unlikely to be directly targeted in the escalating trade tensions between the US and China, Bloomberg News reported Tuesday, citing Singapore's Foreign Minister Vivian Balakrishnan. </p><p class=\"\">Speaking to parliament on Tuesday, Balakrishnan highlighted the US's trade surplus with Singapore, suggesting the city-state may be shielded from direct tariff measures. </p><p class=\"\">Total trade between the US and Singapore exceeded $131 billion in 2023, the report said. </p><p class=\"\">However, Balakrishnan cautioned that the broader trade war could still have repercussions for Singapore, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463812:0/",
            "pub_date": "2025-02-05 15:25:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463832:0",
            "title": "NTN Swings to Nine-Month Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NTN  posted an attributable loss of 8.25 billion yen for the nine months ended Dec. 31, 2024, compared with an attributable profit of 7.68 billion yen in the year-ago period. </p><p class=\"\">Basic loss per share was 15.56 yen, compared with earnings per share of 14.47 yen in the corresponding period of the previous fiscal year, a Tuesday bourse filing said. </p><p class=\"\">The bearing and precision machinery manufacturer saw a decline in net sales to 615.5 billion yen from 620.5 billion yen a year prior. </p><p class=\"\">The company forecasts an attributable loss of 16 billion yen, loss per share of 30.18 yen, net sales of 815 billion yen, and a final dividend of 5.5 yen per share for the fiscal year ending March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463832:0/",
            "pub_date": "2025-02-05 15:25:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001800:0",
            "title": "DNB Bank Posts Higher Earnings on High Customer Activity",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Pierre Bertrand</p><p class=\"\">DNB Bank said earnings rose, exceeding analysts' expectations, after revenue increased in the fourth quarter of last year driven by high customer activity.</p><p class=\"\">The Norwegian bank said it made 12.675 billion Norwegian kroner ($1.13 billion) in net profit compared with 9.43 billion Norwegian kroner a year before.</p><p class=\"\">Total income came to 21.72 billion Norwegian kroner, an 8.6% on-year increase compared with 19.99 billion Norwegian kroner a year prior.</p><p class=\"\">That increase was driven by an 4.5% rise in net interest income--the difference between what lenders earn from loans and pay out on deposits, and a key revenue driver.</p><p class=\"\">The results compare with analysts' expectations of 9.51 billion Norwegian kroner in net profit on 21.54 billion Norwegian kroner of total income, according to a company-provided consensus.</p><p class=\"\">The bank said its result reflected high customer activity and added that lending grew 2.5% during the quarter. Its personal customers segment saw particularly strong activity in the second half of last year.</p><p class=\"\">DNB's common equity Tier 1 capital ratio--a measure of a bank's financial strength--stood at 19.4%.</p><p class=\"\">The bank said that it would propose a 16.75 Norwegian kroner a share dividend for 2024.</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001800:0-dnb-bank-posts-higher-earnings-on-high-customer-activity/",
            "pub_date": "2025-02-05 15:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446685:0",
            "title": "The Shangai Composite Index Closes 0.63% Lower",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In China,  the Shangai Composite Index fell 20 points or 0.63 percent on Wednesday.</p><p class=\"\">Leading the losses are Jinzhou Port (-9.52%), Air China (-4.95%) and Yonghui Superstore (-4.76%).</p><p class=\"\">Top gainers were Yonyou Soft (9.99%), Aisino (3.51%) and BAIC BluePark (2.77%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446685:0-the-shangai-composite-index-closes-0-63-lower/",
            "pub_date": "2025-02-05 15:16:10",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001825:0",
            "title": "Chinese Yuan May Still Face More Downward Pressure — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001825:0/",
            "pub_date": "2025-02-05 15:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463821:0",
            "title": "Crédit Agricole Posts Higher FY24 Net Income, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crédit Agricole SA  said Wednesday net income and revenue for 2024 grew year over year. </p><p class=\"\">Group share of net income for the 12 months ended Dec. 31, 2024, was 7.09 billion euros, compared with 6.35 billion euros earlier. EPS moved to 2.11 euros from 1.94 euros. </p><p class=\"\">The French lender's revenue was 27.18 billion euros, compared with 25.18 billion euros a year ago. </p><p class=\"\">Analysts polled by FactSet were expecting 26.67 billion euros in sales, 6.45 billion euros in net income, and 2.05 euros in EPS. </p><p class=\"\">Meanwhile, the board proposed a dividend of 1.10 euros per share. It paid 1.05 euros per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463821:0/",
            "pub_date": "2025-02-05 15:17:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463823:0",
            "title": "India Glycols Clocks Gains in Fiscal Q3 Consolidated Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India Glycols  recorded a rise in its consolidated attributable net profit to 568.1 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, against 416.3 million rupees a year ago. </p><p class=\"\">Earnings per share grew to 18.35 rupees compared with the year-ago figure of 13.45 rupees, according to a Tuesday filing to the Indian stock exchanges by the chemicals manufacturer. </p><p class=\"\">Revenue from operations in fiscal Q3 also increased to 24.2 billion rupees from 21.2 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down over 2% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463823:0/",
            "pub_date": "2025-02-05 15:17:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001834:0",
            "title": "Vestas Wind Systems to Buy Back Up to 100 Million Euros of Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ian Walker</p><p class=\"\">Vestas Wind Systems said it plans to buyback up to 100 million euros ($103.8 million) of shares as it reported a rise in 2024 revenue at the top end of its guidance.</p><p class=\"\">The Danish wind-turbine maker said Wednesday that net profit for the year ended Dec. 31 was 499 million euros compared with 77 million euros for the comparable period a year earlier.</p><p class=\"\">Earnings before interest, taxes and special items--a company-preferred metric--was 741 million euros compared with 231 million euros.</p><p class=\"\">EBIT margin before special items was 4.3% compared with a company forecast at the lower end of the 4% to 5% range.</p><p class=\"\">Revenue for the year was 17.295 billion euros compared with a company forecast of between 16.5 billion euros and 17.5 billion euros.</p><p class=\"\">For the year ahead the company had forecast revenue in the range of 18 billion euros to 20 billion euros, with an EBIT margin before special items of 4% to 7%.</p><p class=\"\">Order intake in the year was 17 gigawatts, worth 19 billion euros, and its combined order backlog across power solutions and service increased to 68.4 billion euros.</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001834:0-vestas-wind-systems-to-buy-back-up-to-100-million-euros-of-shares/",
            "pub_date": "2025-02-05 15:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001835:0",
            "title": "Novo Nordisk's Wegovy Drug Sales Miss Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dominic Chopping</p><p class=\"\">Novo Nordisk's blockbuster Wegovy weight-loss drug just missed sales expectations in the fourth quarter despite more than doubling on the year.</p><p class=\"\">The Danish pharmaceutical giant said sales of Wegovy surged to 19.87 billion Danish kroner ($2.76 billion), against a Visible Alpha consensus estimate of 20.04 billion kroner.</p><p class=\"\">Sales of diabetes drug Ozempic rose 12% on year to 33.85 billion kroner at constant exchange rates, with a Visible Alpha consensus estimate looking for 33.34 billion kroner.</p><p class=\"\">The sales performance comes after Eli Lilly, the company's biggest competitor in the booming weight-loss market, presented a disappointing fourth-quarter sales forecast for its Zepbound and Mounjaro medications. The U.S. company said it had expected faster market growth of the drugs, but wholesalers hadn't boosted their stockpiles at the end of the year as it had expected them to.</p><p class=\"\">Write to Dominic Chopping at dominic.chopping@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001835:0-novo-nordisk-s-wegovy-drug-sales-miss-expectations/",
            "pub_date": "2025-02-05 15:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463822:0",
            "title": "Fujimi's Nine-Month Profit Balloons 51%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fujimi  recorded a 51% rise in attributable profit for the nine months ended Dec. 31, 2024, to 7.27 billion yen from 4.80 billion yen in the year-ago period, a Tuesday bourse filing said. </p><p class=\"\">Basic EPS was 97.94 yen in the nine months, up from 64.67 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The abrasive and polishing compound producer saw a 24% rise in net sales to 46.8 billion yen in the period from 37.8 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 8.35 billion yen, a basic EPS of 112.56 yen, net sales of 61.1 billion yen, and a total dividend of 73.34 yen per share for the fiscal year ending March 31. </p><p class=\"\">Shares of the company were down nearly 4% at close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463822:0/",
            "pub_date": "2025-02-05 15:19:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014511:0",
            "title": "Nissan to Reject Honda's Merger Terms, Putting Deal in Peril — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sean McLain and Megumi Fujikawa</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">The two Japanese automakers said on Dec. 23 that they planned to combine under a structure in which Honda and Nissan would both be subsidiaries of a single holding company.</p><p class=\"\">In recent days, Honda presented a new proposal that would have made Nissan a subsidiary of Honda instead of the more equal structure originally planned, according to a person familiar with the negotiations. The person said Nissan found the new proposal unacceptable and planned to reject it.</p><p class=\"\">The person said Nissan and Honda would continue other cooperation that predates the merger talks, including collaboration on software and electric vehicles.</p><p class=\"\">Honda said it was continuing to discuss the potential combination with Nissan and aimed to decide on a general plan by mid-February.</p><p class=\"\">Nissan shares had jumped on the initial merger announcement in December but fell back in the following weeks. Nissan shares were up about 1% in Tokyo trading Wednesday. Honda shares rose 2.5%.</p><p class=\"\">If the automakers' plan to combine falls apart, it would raise pressure on Nissan to reassure lenders, employees and customers that it can survive amid stiff competition in the U.S. and China. Nissan has lost ground in both markets.</p><p class=\"\">Nissan said in November that it would lay off 9,000 workers and slash its factory capacity by one-fifth to cut costs.</p><p class=\"\">Write to Sean McLain at sean.mclain@wsj.com and Megumi Fujikawa at megumi.fujikawa@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511:0/",
            "pub_date": "2025-02-05 15:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205001389:0",
            "title": "Harmony Gold Reports Five Deaths at Two Separate South African Mines",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:01 GMT) </strong>*Harmony Gold Reports Loss-of-life Incidents at Doornkop and Joel Mines<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*Harmony Gold: Two Employees Died Following Incident Tuesday at Doornkop Mine<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*Harmony Gold: Three Employees Died Following Fall of Ground Incident at Joel Mine<br/><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*Harmony Gold: Causes of Unrelated Incidents Currently Under Investigation<br/><strong class=\"root-Tkn6WL2y\">(07:05 GMT) </strong>*Harmony Gold: All Blasting Operations Have Been Temporarily Suspended at Doornkop Mine<br/><strong class=\"root-Tkn6WL2y\">(07:20 GMT) </strong>Harmony Gold Reports Five Deaths at Two Separate South African Mines</p><p class=\"\">By Ian Walker</p><p class=\"\">Harmony Gold Mining said that five people died in two separate incidents in South Africa on Tuesday morning and that the causes of the accidents are currently under investigation.</p><p class=\"\">The South African gold miner said Wednesday that two employees died following a mining incident at a development end at Doornkop Mine, in Soweto, Gauteng province. All blasting operations have been temporarily suspended at the mine, it said.</p><p class=\"\">Separately a further three employees died following rock falls at Harmony's Joel Mine, near Theunissen in the Free State Province.</p><p class=\"\">The company said that the relevant authorities have been kept fully informed of the incidents, adding that investigations into the incidents will be led by the Department of Mineral Resources and Energy, supported by labour representatives and mine management at each operation.</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205001389:0/",
            "pub_date": "2025-02-05 15:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}