{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463247:0",
            "title": "HFCL Sees Drop in Fiscal Q3 Consolidated Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HFCL  recorded a decline in its attributable consolidated net profit to 736.5 million Indian rupees in the fiscal third quarter from 822.4 million rupees a year ago, according to a Monday filing with the Indian stock exchanges by the telecom infrastructure company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, dropped to 0.51 rupees from 0.58 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 also slipped to 10.1 billion rupees from 10.3 billion rupees a year earlier, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463247:0/",
            "pub_date": "2025-02-04 14:41:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001168:0",
            "title": "Tariffs Unlikely to Have Long-Term Impact on Central Bank Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001168:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001170:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0642 GMT - Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p><p class=\"\">0633 GMT - China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0629 GMT - ​The top risk for 2025 identified by ETF provider Global X was policy sequencing across taxes, tariffs and deregulation. These are now now playing out, potentially causing more volatility in rates markets, says Scott Helfstein, head of investment strategy. \"This is likely a source for increased volatility in the rate market more so than serious disruption for companies and equities, but this is early days,\" he says in a note. U.S. President Trump moved to levy tariffs on Mexico and Canada, but the leaders of the three states reached an agreement to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001170:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV071:0",
            "title": "Nintendo cuts FY profit forecast by 22%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Nintendo  cut its operating profit forecast on Tuesday by 22.2% to 280 billion yen ($1.8 billion) for the financial year ending March. </p><p class=\"\">In the April-December period, profit fell 46.7% to 247.6 billion yen.</p><p class=\"\">Nintendo remains dependent on its console business even as it has opened stores and its roster of characters feature in theme parks and film. </p><p class=\"\">The company said last month it will release a successor to the hit home-portable Switch console this year. </p><p class=\"\">The Switch 2 appears to closely follow the design of its predecessor, which transformed Nintendo's fortunes after the underperformance of the Wii U. </p><p class=\"\">($1 = 155.2900 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV071:0-nintendo-cuts-fy-profit-forecast-by-22/",
            "pub_date": "2025-02-04 14:43:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0BN:0",
            "title": "Logistics firm DSV Q4 profit lags forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Freight forwarder DSV  posted a fourth-quarter operating profit before special items below expectations on Tuesday and said the macroeconomic and geopolitical environment remains uncertain into 2025.</p><p class=\"\">\"The macroeconomic and geopolitical environment, including the situation in the Red Sea remains uncertain, and unforeseen changes may therefore impact our financial results,\" the company said in a statement. </p><p class=\"\">    \"We continue to monitor activity closely across our organisation and adjust capacity and cost base accordingly\".  </p><p class=\"\">    Its earnings before interest, tax and special items fell to 3.94 billion Danish crowns ($543.7 million) from 3.95 billion a year ago, lagging an average forecast of 4.28 billion in a     poll     of 18 analysts conducted by the company.  </p><p class=\"\">    DSV said it expects operating profit before special items this year of between 15.5 billion and 17.5 billion crowns, excluding the impact from its acquisition of Schenker, compared with 17.59 billion expected by analysts and the 16.1 billion it achieved in 2024.  </p><p class=\"\">    DSV is set to become the world's     biggest     logistics company after its $14.6 billion     acquisition     of Schenker which is expected to close in the second quarter.  </p><p class=\"\">    ($1 = 7.2467 Danish crowns)  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0BN:0-logistics-firm-dsv-q4-profit-lags-forecasts/",
            "pub_date": "2025-02-04 14:43:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001209:0",
            "title": "Mitsubishi Electric 3Q FY Infrastructure Segment Operating Profit Y30.5B, Up Y20.6B on Year>6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001209:0/",
            "pub_date": "2025-02-04 14:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cryptopotato:9ebd02c8a094b:0",
            "title": "Trump Approves US Sovereign Wealth Fund, Will it Buy Bitcoin?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On Feb. 3, President Trump announced plans to create a US sovereign wealth fund, a national investment vehicle designed to generate and distribute assets for American citizens.</p><p class=\"\">Trump signed the executive order at a White House event directing Treasury Secretary Scott Bessent and Secretary of Commerce Howard Lutnick, who are both pro-crypto, to “begin a process that will hopefully result in the creation of an American sovereign wealth fund.”</p><p class=\"\">“We’re going to create a lot of wealth for the fund,” Trump told reporters before adding, “And I think it’s about time that this country had a sovereign wealth fund.”</p><p class=\"\">The fund “will be a combination of liquid assets, assets that we have in this country as we work … to bring them out for the American people,” said Bessent, who added that it will be set up within the next 12 months, according to NBC.Bitcoin Backing?</p><p class=\"\">The fund could be potentially used to acquire strategic assets such as a potential takeover of the Chinese social media platformTikTok, alluded Lutnick. It could also leverage the US government’s massive purchasing power to gain equity in companies.</p><p class=\"\">“The extraordinary size and scale of the U.S. government and the business it does with companies … should create value for American citizens,” Lutnick said. Other countries with large sovereign wealth funds include Norway, China, Saudi Arabia, Australia, Iran, and Russia.</p><p class=\"\">In reaction to the news, Wyoming Senator Cynthia Lummis hinted that the fund could be used to buy Bitcoin.</p><p class=\"\">This is a ₿ig deal. https://t.co/ZShfQcEGwc</p><p class=\"\">— Senator Cynthia Lummis (@SenLummis) February 3, 2025</p><p class=\"\">However, if the fund does include BTC, it is likely to come from the stash that the United States already holds rather than buying more.</p><p class=\"\">According to Blockchain.com, an FBI-owned address linked toSilk Road seizuresstill holds 69,370 BTC worth around $6.8 billion at current market prices. Total US holdings exceed 207,000 BTC worth more than $20 billion, according to BiTBO.</p><p class=\"\">The US will buy Bitcoin.</p><p class=\"\">Trump just announced the creation of a US Sovereign Wealth Fund.</p><p class=\"\">It will be headed by Secretary of Commerce @howardlutnick and Treasury Secretary @ScottBessent528. Both like Bitcoin.</p><p class=\"\">I’d say there’s a 100% probability they buy Bitcoin.</p><p class=\"\">— Wayne Vaughan (@WayneVaughan) February 3, 2025</p><p class=\"\">BTC Price Recovers</p><p class=\"\">Crypto markets have recovered since the Trump tariffs weresuspendedon Monday. BTC reclaimed $102,000 in an intraday high but has since retreated back to around $99,000 at the time of writing, as the bounce may have been short-lived.</p><p class=\"\">AI and real-world asset tokenization altcoins were also surging, but Ethereum remained lackluster, failing to top $3,000 despite an endorsement from Eric Trump.</p></span></div>",
            "link": "https://www.tradingview.com/news/cryptopotato:9ebd02c8a094b:0-trump-approves-us-sovereign-wealth-fund-will-it-buy-bitcoin/",
            "pub_date": "2025-02-04 14:44:02",
            "source": "CryptoPotato",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0C5:0",
            "title": "Dassault Systemes signs strategic partnership with Volkswagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">French software group Dassault Systemes  on Tuesday announced a long-term partnership with Volkswagen  to accelerate the German carmaker's transition towards software defined vehicles.</p><p class=\"\">Dassault's flagship software platform 3DEXPERIENCE was selected by Volkswagen as its main engineering and manufacturing platform, the French company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0C5:0-dassault-systemes-signs-strategic-partnership-with-volkswagen/",
            "pub_date": "2025-02-04 14:44:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463249:0",
            "title": "Tata Chemicals Swings to Loss in Fiscal Q3; Shares Down 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tata Chemicals  posted a consolidated attributable loss of 530 million Indian rupees in the fiscal third quarter, reversing a profit of 1.58 billion rupees a year ago. </p><p class=\"\">Loss per share came in at 2.08 rupees, compared with the year-ago earnings per share of 6.20 rupees, according to a Monday filing to the Indian stock exchanges. </p><p class=\"\">Revenue in the third quarter ended Dec. 31, 2024, declined to 35.9 billion rupees from 37.3 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down over 4% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463249:0/",
            "pub_date": "2025-02-04 14:44:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001216:0",
            "title": "Mitsubishi Electric Announces Consolidated Financial Results for the Third Quarter (First 9 Months) of Fiscal 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitsubishi Electric Announces Consolidated Financial Results for the Third Quarter (First 9 Months) of Fiscal 2025</p><p class=\"\">TOKYO--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Mitsubishi Electric Corporation (TOKYO: 6503) announced today its consolidated financial results for the third quarter (first 9 months), ended December 31, 2024, of the current fiscal year ending March 31, 2025 (fiscal 2025).</p><p class=\"\">The full document on Mitsubishi Electric's financial results can be viewed at the following link:</p><p class=\"\">www.MitsubishiElectric.com/news</p><p class=\"\">Consolidated Financial Results</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Billions of yen                         Q3 FY24  Q3 FY25      YoY <br/>-------------------------------------   -------  -------  ------------ <br/>Revenue                                 1,243.9  1,356.7  +112.8  109% <br/>Operating profit                           86.4    126.8   +40.3  147% <br/>%                                          7.0%     9.4%  +2.4pt     - <br/>Profit before income taxes                 89.2    167.8   +78.6  188% <br/>Net profit attributable to Mitsubishi <br/> Electric Corp. stockholders               65.8    129.4   +63.5  197% <br/>--------------------------------------  -------  -------  ------  ---- <br/> </pre><p class=\"\">Key Points</p><p class=\"\">1. Q3(*1) FY25(*2) : Revenue Yen1,356.7 bn (+Yen112.8 bn YoY), Operating Profit Yen126.8 bn (+Yen40.3 bn YoY)</p><p class=\"\">- Both revenue and operating profit achieved a new record high for Q3 due primarily to the impact of the weaker yen, increases in the Infrastructure and Life segments, and the partial share-transfer of MD LOGIS CORPORATION shares(*3) .</p><p class=\"\">- Continuous efforts are being made to improve profitability in the Infrastructure segment, including improvements in contract terms for orders.</p><p class=\"\">2. FY25 forecast: Revenue Yen5,400.0 bn (+Yen10.0 bn compared to the previous announcement), Operating Profit Yen400.0 bn (unchanged from the previous announcement)</p><p class=\"\">- Due mainly to foreign exchange rates reconsidered in line with the weaker yen, revenue is expected to exceed the previous announcement.</p><p class=\"\">- Mitsubishi Electric Group will steadily implement ongoing initiatives to improve profitability and efficiency in each business.</p><p class=\"\">3. Q1-Q3 FY25: Free cash flow improved by Yen174.2 bn YoY</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/> <br/>(*1)  Q3: Third quarter of the fiscal year (October--December) <br/>(*2)  FY25: April 1, 2024--March 31, 2025 <br/>(*3)  As a result of the transaction, the company has recorded approximately <br/>      Yen24.0 bn as operating profit, Yen5.0 bn as market valuation of <br/>      investments accounted for using the equity method, and Yen29.0 bn as <br/>      profit before income taxes. <br/> <br/> <br/> <br/>Note:  The results forecast above is based on assumptions deemed reasonable by <br/>       Mitsubishi Electric at the present time, and actual results may differ <br/>       significantly from forecasts. Please refer to the cautionary statement <br/>       in the full document. <br/>-----  ----------------------------------------------------------------------- <br/> </pre><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250203099638/en/</p><p class=\"\">CONTACT:    Investor Relations Inquiries</p><p class=\"\">Corporate IR&amp;SR Division</p><p class=\"\">Mitsubishi Electric Corporation</p><p class=\"\">Cad.Irg@rk.MitsubishiElectric.co.jp</p><p class=\"\">Media Inquiries</p><p class=\"\">Madoka Iwanaga</p><p class=\"\">Public Relations Division</p><p class=\"\">Mitsubishi Electric Corporation</p><p class=\"\">Tel: +81-3-3218-2332</p><p class=\"\">prd.gnews@nk.MitsubishiElectric.co.jp</p><p class=\"\">www.MitsubishiElectric.com/news/</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001216:0/",
            "pub_date": "2025-02-04 14:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr31XFzs:0",
            "title": "Year-end report January - December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Inwido<p class=\"\"><strong class=\"root-Tkn6WL2y\">Strong order intake in challenging markets</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth quarter</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 2,423 million (2,273), up 7 percent. Organic growth amounted to 5 percent.</li><li class=\"listItem-bmN0_SHH\">Total order intake adjusted for currency increased by 20 percent (up 19 percent organically) and the order backlog as of December 31 rose by 29 percent to SEK 2,490 million (1,937).</li><li class=\"listItem-bmN0_SHH\">Operating EBITA rose to SEK 296 million (290) and the operating EBITA margin amounted to 12.2 percent (12.7).</li><li class=\"listItem-bmN0_SHH\">EBIT amounted to SEK 261 million (272) and the EBIT margin amounted to 10.8 percent (12.0).</li><li class=\"listItem-bmN0_SHH\">Earnings per share before and after dilution amounted to SEK 3.17 (3.20) and SEK 3.16 (3.20) respectively.</li><li class=\"listItem-bmN0_SHH\">Net debt amounted to a multiple of 1.0 in relation to operating EBITDA (0.7 excluding IFRS 16).</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">January–December 2024</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net sales amounted to SEK 8,838 million (8,970), down 1 percent. Organic growth amounted to negative 6 percent.</li><li class=\"listItem-bmN0_SHH\">Operating EBITA totaled SEK 953 million (1,027) and the operating EBITA margin amounted to 10.8 percent (11.4).</li><li class=\"listItem-bmN0_SHH\">EBIT amounted to SEK 850 million (978) and the EBIT margin amounted to 9.6 percent (10.9).</li><li class=\"listItem-bmN0_SHH\">Return on operating capital amounted to 12.7 percent (15.4).</li><li class=\"listItem-bmN0_SHH\">Earnings per share before and after dilution amounted to SEK 9.29 (11.72) and SEK 9.26 (11.72) respectively.</li><li class=\"listItem-bmN0_SHH\">The Board of Directors proposes a dividend of SEK 5.50 (6.50).</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">CEO comments:</strong></p><p class=\"\">I am pleased to say that Inwido is growing again. For the first time since the fourth quarter of 2022, we are witnessing organic sales growth. The fact that this growth is also taking place in all business areas, despite challenges in several markets, and while maintaining good margins, is a show of strength.</p><p class=\"\">During the fourth quarter of the year, net sales increased by 7 percent (up 5 percent organically) to SEK 2,423 million (2,273). Order intake remained strong and increased for the third consecutive quarter, this time organically by 19 percent, mainly driven by the project market in Business Area Western Europe. Order intake also increased in all business areas except for Scandinavia, where order intake remained unchanged. In our assessment, Inwido is continuing to win market share in its main markets. Although leading macroeconomic indicators have become more positive and demand in some market segments has started to rise, several of our business units are still facing challenges in the form of low demand and fierce price pressure, above all in Finland, Norway, and the UK. In light of this, Inwido is maintaining good margins thanks to our increasingly efficient operational platform, our leading market positions and our governance model.</p><p class=\"\">In order to provide external stakeholders with a clearer picture of the Group’s sales, order intake and order book, Inwido is introducing a new market segment split as from the fourth quarter: Consumer/Project. This change, which was announced in connection with the Capital Markets Day in December, is mainly due to the large project orders that Sidey Group in particular, within Business Area Western Europe, wins from time to time. These orders, unlike the majority of the rest of the Group, are often significant in size and run for several years. A good example is the record order for North Lanarkshire Council, initially amounting to SEK 300 million over two years, that Sidey Group won in December 2024. With the new market split, we are better able to illustrate the fluctuations that occur within Project Sales, while Consumer Sales tend to be more stable.</p><p class=\"\">The focused work aimed at reducing the Group’s climate impact and achieving the established SBTi goals is proceeding well. An important milestone has now been reached, with scope 3, greenhouse gas emissions that take place outside the company’s direct control and operations, being reported for the first time. Overall for Scope 1, 2, and 3, greenhouse gas emissions fell by 15 percent relative to the base year, 2022. All key performance indicators for Health and Safety are developing positively, which is pleasing to note. The number of accidents decreased significantly as a result of an effective and well-established process.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Scandinavia</strong> is continuing to deliver high margins. Higher sales combined with improved gross margins and cost control raised the operating EBITA margin to 17.1 percent (15.0). Our larger Danish units delivered at a high level, while the Swedish consumer market also began to show signs of a cautious recovery.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Eastern Europe</strong> is still being affected by low volumes within new build, which is the primary reason for the margins having more than halved. On the other hand, the renovation market appears to have bottomed out, as can be seen from order intake, which increased by 10 percent during the quarter. At the end of the period, the order backlog was 26 percent higher compared with the same period last year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area e-Commerce</strong> is growing and its profitability is increasing. Sales for the fourth quarter rose to SEK 270 million, up 10 percent compared with the corresponding period in the preceding year. Operating EBITA almost doubled to SEK 23 million (12) and the operating EBITA margin rose to 8.6 percent (5.0) during the quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Area Western Europe</strong> performed well in the fourth quarter, with a record order in Scotland and strong performance in Ireland. During the fourth quarter, profitability increased and operating EBITA ended up at SEK 54 million (46), while the operating EBITA margin rose to 11.6 percent (10.8).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook:</strong></p><p class=\"\">Inwido is on an exciting journey of growth towards sales of SEK 20 billion by 2030. Step by step, we are moving in the right direction, strengthened by factors such as increased sales and order intake, as well as an ever more efficient operational platform. The main external drivers of Inwido’s profitable growth, both in the short and the long term, are a normalization of demand within renovation, the management of pent-up demand within new build, and the green transition to energy-efficient housing in the EU. In addition to these external factors, the Group is focusing on product development, internal cost and sales synergies, as well as value-creating acquisitions.</p><p class=\"\">In an uncertain environment, our outlook is supported by leading macro economic indicators and the positive momentum we have enjoyed since the second quarter of last year. All in all, this gives us confidence for the year we have just started.</p><p class=\"\">MALMÖ, FEBRUARY 4, 2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fredrik Meuller, </strong>President and CEO</p><p class=\"\">This information is such that Inwido AB (publ) is obliged to publish in accordance with the EU market abuse regulation and the Swedish Securities Market Act. The information was submitted by the below contact persons for publication on February 4, 2025 at 7:45 a.m. CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fredrik Meuller, President and CEO</p><p class=\"\">Tel. +46 (0) 734 22 70 11</p><p class=\"\">Peter Welin, CFO and deputy CEO</p><p class=\"\">Tel. +46 (0) 703 24 31 90</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Inwido:</strong></p><p class=\"\">Inwido improves people's lives indoors with windows and doors. As Europe's leading window group, Inwido's business concept is to develop and sell the market's best customized window and door solutions through a decentralized structure and with a focus on the consumer-driven market in order to create long-term sustainable growth, organically and through acquisitions. Inwido consists of 35 business units with approximately 4,700 employees in twelve countries. In 2024 group sales amounted to SEK 8.8 billion with an operating EBITA margin of 10.8 percent. Inwido has been listed on Nasdaq Stockholm since 2014. Follow Inwido on LinkedIn.</p><p class=\"\">https://news.cision.com/inwido/r/year-end-report-january---december-2024%2Cc4099811</p><p class=\"\">Inwido_Q42024_ENG</p><p class=\"\">Strandhus Ålborg Danmark</p><p class=\"\">Fredrik Meuller cropped</p><p class=\"\">Peter Welin Inwido AB</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr31XFzs:0-year-end-report-january-december-2024/",
            "pub_date": "2025-02-04 14:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV00B:0",
            "title": "Unicaja Q4 Net Profit At 122 Mln Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unicaja Banco SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET PROFIT 122 MILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET INTEREST INCOME 634 MILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BAD LOAN RATIO 2.7% AT END-DEC</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CET 1 FULLY LOADED 15.1% AT END-DEC</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV00B:0-unicaja-q4-net-profit-at-122-mln-euros/",
            "pub_date": "2025-02-04 14:45:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0HG:0",
            "title": "TomTom revenue drops; sees lower 2025 earnings on automotive market slowdown",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Dutch digital mapping specialist TomTom  reported a 2% drop in its annual revenue on Tuesday, slightly above estimates and said it expects lower 2025 earnings on continued challenges due to a slowdown in the global automotive market.</p><p class=\"\">The Amsterdam-based company posted a revenue of 574.4 million euros ($591.17 million) for the year ended Dec. 31, marginally above the 573 million euros expected in a company-provided consensus.</p><p class=\"\">The company, which makes 57% of its sales from automotive location technology applications, has been impacted by a slowdown in the automotive market, with an increase of 0.9% in new car sales in Europe, compared with a 13.9% jump a year earlier.</p><p class=\"\">Due to the market headwinds, TomTom suspended its 2025 location technology revenue outlook in July 2024. </p><p class=\"\">\"Given market conditions in Automotive, we continue to have limited visibility for 2025,\" CFO Taco Titulaer said in a release on Tuesday.</p><p class=\"\">The group expects lower revenue in 2025, between 505 million euros and 565 million euros. It sees location technology revenue between 440 million euros and 490 million euros, and free-cash flow at break-even in 2025.</p><p class=\"\">($1 = 0.9716 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0HG:0-tomtom-revenue-drops-sees-lower-2025-earnings-on-automotive-market-slowdown/",
            "pub_date": "2025-02-04 14:45:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001018:0",
            "title": "Raiffeisen Bank: AO Raiffeisenbank Russia Booked EUR840M Legal Provision",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001018:0/",
            "pub_date": "2025-02-04 14:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463238:0",
            "title": "Chinese Venture Capital Firm Signs 1.1 Billion-Euro Deal to Buy Majority Stake in Audio Equipment Maker Marshall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chinese venture capital and private equity firm HongShan Capital Group or HSC agreed to acquire a majority stake in Marshall Group in a 1.1 billion euro deal, Marshall said in a Jan. 24 press release on its webpage. </p><p class=\"\">Under the deal, the Marshall family will retain over 20% of the Sweden-based audio equipment manufacturing company, the release said. </p><p class=\"\">HSC will buy the 9.6% stake in Marshall from Swedish telecommunication company Telia for 101 million euros, according to a same-dated press release on Telia's webpage.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463238:0/",
            "pub_date": "2025-02-04 14:37:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0E9:0",
            "title": "Racing Force Q4 2024 Revenues At EUR 14.8 Mln, Up 15.5% Y/Y",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Racing Force SpA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 2024 REVENUES AT EUR 14.8 MLN, UP 15.5% Y/Y</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0E9:0-racing-force-q4-2024-revenues-at-eur-14-8-mln-up-15-5-y-y/",
            "pub_date": "2025-02-04 14:37:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:7abefe19c094b:0",
            "title": "Hold IndusInd Bank; target of Rs 1031: KR Choksey",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KR Choksey's research report on IndusInd Bank</p><p class=\"\">In Q3FY25, Net Interest Income (NII) decreased by 1.3% YoY (-2.2% QoQ) to INR 52,281 Mn. The NII was lower by 3.6%. Pre-Provision Operating Profits (PPOP) declined by 10.9% YoY (flat QoQ) in Q3FY25 to INR 36,007 Mn. The PPOP was a 2.6% miss compared to our estimates. The net profit for Q3FY25 stood at INR 14,023 Mn, a decline of 39.1% YoY (+5.3% QoQ). Near-term growth remains constrained by macroeconomic stress, elevated credit costs, and cautious lending in unsecured and microfinance segments, impacting margins and asset quality.</p><p class=\"\">Outlook</p><p class=\"\">We revise our Adjusted Book Value (ABV) downward by 4.3% for FY26E and 6.0% for FY27E, factoring in multiple stress points and a slower-than-anticipated recovery in the near to medium term. Rolling forward our valuation to FY27E, we assign a P/B multiple of 0.95x to the FY27E ABVPS of INR 1,084.8, leading to a revised target price of INR 1,031 (earlier INR 1,305). Given the current risk-reward dynamics, we maintain our “HOLD” rating on IndusInd Bank.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">IndusInd Bank - 04022025 - kr</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:7abefe19c094b:0-hold-indusind-bank-target-of-rs-1031-kr-choksey/",
            "pub_date": "2025-02-04 14:37:23",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001065:0",
            "title": "Raiffeisen Bank Sees 2025 Net Interest Income at Around EUR4.15B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001065:0/",
            "pub_date": "2025-02-04 14:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000416:0",
            "title": "OMV's Net Profit Rises Despite Weak Refining Margins",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(06:04 GMT) </strong>*OMV Sees 2025 Hydrocarbon Production Around 300,000 BOE/D<br/><strong class=\"root-Tkn6WL2y\">(06:05 GMT) </strong>*OMV Sees 2025 European Refining Indicator Margin Around $6/bbl<br/><strong class=\"root-Tkn6WL2y\">(06:05 GMT) </strong>*OMV Sees 2025 Refinery Utilization Rate Europe Between 85% and 90%<br/><strong class=\"root-Tkn6WL2y\">(06:07 GMT) </strong>*OMV 4Q Sales Revenue EUR8.58B<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*OMV 4Q Clean CCS Operating Result EUR1.38B<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*Analyst Saw OMV 4Q Clean CCS Operating Result at EUR1.38B<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*OMV 4Q Clean Operating Result Energy EUR1.24B<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*Analysts Saw OMV 4Q Clean Operating Result Energy at EUR1.15B<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*OMV 4Q Clean CCS Net Income EUR555M<br/><strong class=\"root-Tkn6WL2y\">(06:08 GMT) </strong>*Analysts Saw OMV 4Q Clean CCS Net Income at EUR487M<br/><strong class=\"root-Tkn6WL2y\">(06:09 GMT) </strong>*OMV 4Q Net Pft EUR301M<br/><strong class=\"root-Tkn6WL2y\">(06:09 GMT) </strong>*OMV 4Q EPS EUR0.92<br/><strong class=\"root-Tkn6WL2y\">(06:10 GMT) </strong>*OMV 4Q Cash Flow from Operating Activities EUR1.03B<br/><strong class=\"root-Tkn6WL2y\">(06:10 GMT) </strong>*Analysts Saw OMV 4Q Cash Flow from Operating Activities at EUR1.15B<br/><strong class=\"root-Tkn6WL2y\">(06:10 GMT) </strong>*OMV 4Q Net Debt EUR3.23B<br/><strong class=\"root-Tkn6WL2y\">(06:10 GMT) </strong>*OMV 4Q Clean CCS ROACE 10%<br/><strong class=\"root-Tkn6WL2y\">(06:10 GMT) </strong>*OMV 4Q ROACE 7%<br/><strong class=\"root-Tkn6WL2y\">(06:38 GMT) </strong>OMV's Net Profit Rises Despite Weak Refining Margins</p><p class=\"\">By Adam Whittaker</p><p class=\"\">OMV's fourth-quarter net profit jumped despite weak refining margins dragging on its financial results.</p><p class=\"\">The Austrian oil-and-gas company said Tuesday that its quarterly net profit was 301 million euros ($311.4 million) compared with 236 million euros for the same quarter a year prior.</p><p class=\"\">However, net profit on a current-cost-of-supplies basis--a figure similar to the net income that U.S. oil companies report--fell to 555 million euros compared with 665 million euros the year before, but above analysts' expectations of 487 million euros.</p><p class=\"\">Its operating result adjusted for current cost of supplies fell to 1.38 billion euros, which was in line with consensus expectations as lower refining margins dragged on its financial results. The company said its refining margin fell to $5.9 a barrel in the quarter compared with $9.9 a barrel a year ago.</p><p class=\"\">OMV said it expects a slight rise in refining margins in 2025 to around $6 a barrel and it expects 2025 hydrocarbon production at around 300,000 barrels of oil-equivalent a day.</p><p class=\"\">For the fourth quarter, OMV confirmed its total hydrocarbon production was 337,000 barrels of oil-equivalent a day.</p><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000416:0/",
            "pub_date": "2025-02-04 14:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV08M:0",
            "title": "BNP Paribas beats Q4 forecast but trims 2025 profit target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">BNP reports 15.7% rise in Q4 net profit</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Investment banking revenue climbs 20%, driven by FICC trading</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cuts 2025 profitability target, flags further cost savings</li></ul></span></div><span><p class=\"\">France's BNP Paribas  reported a forecast-beating jump in net income in the fourth quarter as its investment bankers rode a surge in trading activity, but the lender lowered a key profit target for 2025 and said it would cut costs further.</p><p class=\"\">The euro zone's biggest bank by assets said group net income rose by 15.7% to 2.32 billion euros ($2.39 billion) for the three months ending in December, beating the 2.24 billion-euro average of 13 analyst estimates compiled by the company. </p><p class=\"\">Revenue over the period increased by 10.8% to 12.1 billion euros, also above the 11.6 billion-euro analyst average estimate. </p><p class=\"\">BNP has disappointed investors in recent quarters and its shares were among the worst performing of major lenders last year, losing nearly 7% while European rivals' stock (.SX7P) soared, so Tuesday's fourth-quarter and full-year results will be a relief for long-time CEO Jean-Laurent Bonnafe.</p><p class=\"\">Investment banking revenue climbed 20% in the fourth quarter, driven by revenue from trading in fixed income, currencies and commodities (FICC) soaring 34% and equity prime services' sales by 30%. </p><p class=\"\">BNP's performance in FICC trading beat the average growth among Wall Street banks, which Jefferies calculated at 26%.</p><p class=\"\">Bonnafe has bet on BNP's investment bank to fill gaps left by retreating European rivals and compete with dominant U.S. peers.</p><p class=\"\">In recent quarters, the investment bank has helped offset sluggish retail performance at BNP, as record inflows into government-regulated high-interest savings squeezed French banks' margins, while lenders elsewhere in the euro zone benefited from higher rates.</p><p class=\"\">BNP's market share in investment banking in Europe, the Middle East, and Africa rose to 4.9% in 2024 from 4.6% in 2023 in terms of revenue, according to data firm Dealogic.</p><p class=\"\">CAUTIOUS OUTLOOK</p><p class=\"\">Yet BNP also struck a cautious note on the outlook. </p><p class=\"\">The bank revised a key profitability target down for 2025, without giving a clear reason, and announced 600 million euros more in cost savings in 2026, on top of 600 million euros this year. </p><p class=\"\">These additional costs cuts would bring total cumulated savings since 2022 to 3.3 billion euros. </p><p class=\"\">BNP is now targeting a return on tangible equity (ROTE) of 11.5% for this year, down from a previous target of 11.5%-12%. </p><p class=\"\">The group expects to reach 12% ROTE in 2026, but said the number should rise, helped by its 5.1 billion-euro acquisition of AXA's asset management arm, set to close mid-year.</p><p class=\"\">BNP now expects an average annual growth of its net income of more than 7% over the 2024-2026 period, against a previous forecast of about 8% in 2022-2025. Some analysts had said that BNP could struggle to reach the 8% target.</p><p class=\"\">While having significantly improved its cost-to-income ratio, which  measures a bank's efficiency by comparing operating expenses to revenues, BNP remains above the average in Europe. </p><p class=\"\">The bank's cost-to-income ratio stood at 65% at the end of December, down from 71.4% a year earlier. That's above the European average of 53% as of June 2024 in Europe as recorded by the European Banking Authority in a report last year.   </p><p class=\"\">BNP has also been hit by political uncertainty in debt-laden France since President Emmanuel Macron called snap elections in June, resulting in a hung parliament.          </p><p class=\"\">The bank said it would propose a dividend of 4.79 euros per share, up 4.1% from 2023. It also said it planned to buy back 1.08 billion euros worth of shares. </p><p class=\"\">($1 = 0.9712 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV08M:0-bnp-paribas-beats-q4-forecast-but-trims-2025-profit-target/",
            "pub_date": "2025-02-04 14:38:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001076:0",
            "title": "Raiffeisen Bank Sees 2025 Net Fee and Commission Income at Around EUR1.95B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001076:0/",
            "pub_date": "2025-02-04 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001086:0",
            "title": "Raiffeisen Bank Sees 2025 Customer Loan Growth at 6% to 7%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001086:0/",
            "pub_date": "2025-02-04 14:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463245:0",
            "title": "Divi's Laboratories Posts Gains in Fiscal Q3 Consolidated Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Divi's Laboratories  recorded a rise in its consolidated attributable profit to 5.89 billion Indian rupees in the fiscal third quarter from 3.58 billion rupees a year ago, according to a Monday filing with the Indian stock exchanges by the pharmaceutical manufacturer. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 22.20 rupees from 13.50 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 increased to 23.2 billion rupees from 18.6 billion rupees a year ago, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463245:0/",
            "pub_date": "2025-02-04 14:39:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463243:0",
            "title": "NIO Repurchases $378 Million Worth of Bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shanghai-based electric vehicle maker NIO (, HKEX:9866) completed a repurchase of a $378.3 million offer for its 0.50% convertible senior bonds due 2027, according to a Friday filing with the Hong Kong bourse. </p><p class=\"\">Following the repurchase of the said bonds, $213,000 worth of bonds remains outstanding.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463243:0/",
            "pub_date": "2025-02-04 14:39:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001101:0",
            "title": "Raiffeisen Bank Sees 2025 Cost-Income Ratio at Around 52.5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001101:0/",
            "pub_date": "2025-02-04 14:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204001113:0",
            "title": "Raiffeisen Bank Sees 2025 Consolidated Return on Equity at Around 10%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204001113:0/",
            "pub_date": "2025-02-04 14:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000892_20250204000946:0",
            "title": "Nintendo Cuts FY Switch Console, Software Sales Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000892_20250204000946:0/",
            "pub_date": "2025-02-04 14:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000933:0",
            "title": "China's Tariff Retaliation Could Be Start of Long Process — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000933:0/",
            "pub_date": "2025-02-04 14:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_S8N3LK0CZ:0",
            "title": "Infineon Says Outlook FY 2025 Revenue Seen To Be Flat To Slightly Up (Previously To Decline Slightly)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Infineon Technologies AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q1 REVENUE EUR 3.424 BILLION, SEGMENT RESULT EUR 573 MILLION, SEGMENT RESULT MARGIN 16.7%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q1 GROSS MARGIN 39.2%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q1 ADJUSTED GROSS MARGIN 41.1%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q1 NET INCOME EUR 246 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q1 ADJUSTED EPS EUR 0.33</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK Q2 REVENUE OF AROUND EUR 3.6 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK Q2 SEGMENT RESULT MARGIN IN MID-TEENS PERCENTAGE RANGE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK FY 2025 ADJUSTED GROSS MARGIN AROUND 40%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK FY 2025 REVENUE SEEN TO BE FLAT TO SLIGHTLY UP (PREVIOUSLY: TO DECLINE SLIGHTLY)</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_S8N3LK0CZ:0-infineon-says-outlook-fy-2025-revenue-seen-to-be-flat-to-slightly-up-previously-to-decline-slightly/",
            "pub_date": "2025-02-04 14:33:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000916_20250204000964:0",
            "title": "Raiffeisen Bank 4Q Oper Result EUR1.26B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000916_20250204000964:0/",
            "pub_date": "2025-02-04 14:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}