{
    "data": [
        {
            "id": "DJN_DN20260226018960:0",
            "title": "Anthropic Refuses Pentagon's Proposal to Loosen AI Guardrails — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amrith Ramkumar</span></p><p class=\"\"><span>Anthropic said it wouldn't back down in a dispute with the Defense Department over artificial-intelligence guardrails, complicating efforts to reach a compromise ahead of a Friday deadline.</span></p><p class=\"\"><span>In a Tuesday meeting at the Pentagon, Defense Secretary Pete Hegseth gave Anthropic Chief Executive Dario Amodei until 5:01 p.m. Friday to agree to the military's right to use the technology in all lawful cases. If Anthropic declines, Hegseth has threatened to invoke the Defense Production Act to make the company do what the military wants, or to designate the company a supply-chain risk, impairing its ability to work with other government contractors.</span></p><p class=\"\"><span>Anthropic has refused to accept the military's proposal and doesn't let users deploy its Claude models in scenarios involving mass domestic surveillance or autonomous weapons.</span></p><p class=\"\"><span>Amodei reiterated the company's red lines in a public statement Thursday. \"We cannot in good conscience accede to their request,\" he said. The company said the military's latest proposal would effectively undo those guardrails.</span></p><p class=\"\"><span>Contract language the company received overnight from the Pentagon, \"made virtually no progress on preventing Claude's use for mass surveillance of Americans or in fully autonomous weapons,\" an Anthropic spokesman said. \"New language framed as compromise was paired with legalese that would allow those safeguards to be disregarded at will.\"</span></p><p class=\"\"><span>Emil Michael, the undersecretary of war for research and engineering, said in a post on X that mass surveillance is already illegal under the Fourth Amendment. Michael said the department \"won't have any big tech company decide Americans' civil liberties.\"</span></p><p class=\"\"><span>Thursday evening, he posted that Amodei, \"wants nothing more than to try to personally control the U.S. Military and is ok putting our nation's safety at risk.\"</span></p><p class=\"\"><span>The Pentagon's fight with the company escalated after an Anthropic employee asked a counterpart at data-mining company Palantir Technologies, its partner, whether Claude was used in the raid to capture former Venezuelan President Nicolás Maduro. Pentagon officials found out and viewed the question as a challenge to the military's ability to use AI as it sees fit. Anthropic has said the discussion was a routine technical conversation.</span></p><p class=\"\"><span>In preparing to label Anthropic a supply-chain risk, Pentagon officials have reached out to defense contractors including Lockheed Martin and Boeing in recent days to gauge how much they use Claude, people familiar with the outreach said.</span></p><p class=\"\"><span>Designating the company a supply-chain risk and invoking the Defense Production Act would be a nearly unprecedented escalation against a U.S. company, AI and security experts said. The threats \"are inherently contradictory: one labels us a security risk; the other labels Claude as essential to national security,\" Amodei said in his statement.</span></p><p class=\"\"><span>The threats have highlighted the Pentagon's dependence on Anthropic. It was the only company with approval for use in classified settings before the Defense Department agreed to approve Elon Musk's xAI, which agreed to the Pentagon's use of its AI in all lawful scenarios.</span></p><p class=\"\"><span>Google and ChatGPT maker OpenAI are also used by the Pentagon in unclassified settings and talking to the Defense Department about potential approval for classified work.</span></p><p class=\"\"><span>An online petition began circulating late Thursday signed by employees of both companies asking them to take the same approach as Anthropic in negotiations with the Pentagon regarding autonomous weapons and mass surveillance.</span></p><p class=\"\"><span>Write to Amrith Ramkumar at amrith.ramkumar@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226018960:0/",
            "pub_date": "2026-02-27 11:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZK0IM:0",
            "title": "China's AI labs careen towards EV-style crunch",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Robyn Mak</span></p><p class=\"\"><span>MiniMax and Zhipu are now worth some $60 bln combined after more than quadrupling this year. The hype evokes the path taken by automakers like Nio, which soared to wild valuations and then got crushed by price wars and cash guzzling. A similar fate awaits these new tech models.    </span></p><p class=\"\"><span>Full view will be published shortly.</span></p><p class=\"\"><span>Follow Robyn Mak on X.</span></p><p class=\"\"><span>CONTEXT NEWS</span></p><p class=\"\"><span>Artificial intelligence developer Anthropic said on February 23 that Chinese counterparts DeepSeek, MiniMax and Moonshot \"illicitly\" used its Claude chatbot to improve their own models.  </span></p><p class=\"\"><span>The allegation follows a memo from OpenAI in February warning U.S. lawmakers that DeepSeek is targeting its ChatGPT system and others to replicate models and use them for its own training.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZK0IM:0-china-s-ai-labs-careen-towards-ev-style-crunch/",
            "pub_date": "2026-02-27 11:42:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019797_20260226019797:0",
            "title": "India's Sensex Opens Flat at 82220.48",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019797_20260226019797:0/",
            "pub_date": "2026-02-27 11:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN03L:0",
            "title": "Gold steady as drop in US Treasury yields offsets firm dollar",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gold set for a monthly gain of over 6%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gold set for seventh straight month of gains</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Silver, platinum, palladium also on track for a monthly rise</span></li></ul></span></div><span><p class=\"\"><span>By Ishaan Arora</span></p><p class=\"\"><span>    Gold was broadly steady on Friday, as a drop in U.S. Treasury yields eased the opportunity cost of holding bullion, offsetting a firm dollar and signs of progress in U.S.-Iran talks.</span></p><p class=\"\"><span>Spot gold </span><span> held at $5,184.69 per ounce by 0301 GMT.</span></p><p class=\"\"><span>Gold was set for its seventh straight month of gains, rising more than 6% in February, as U.S. tariff uncertainty and mounting U.S.-Iran tensions boosted its safe-haven appeal.</span></p><p class=\"\"><span>U.S. gold futures </span><span> for April delivery were up 0.2% at $5,201.40.</span></p><p class=\"\"><span>\"Ten-year U.S. Treasury yields after subtracting inflation, so the real yield has plummeted and that actually is currently a supporting factor, allowing gold to hold steady regardless of the risk premiums ticking down yesterday after U.S.-Iran talks,\" said Kelvin Wong, a senior market analyst at OANDA.</span></p><p class=\"\"><span>The benchmark 10-year yield </span><span> fell to a three-month low on the day, while the dollar was set to gain 0.6% for the month, as indications of a more hawkish Federal Reserve made dollar-priced gold more expensive for holders of other currencies. </span></p><p class=\"\"><span>The U.S. and Iran made progress in Geneva on Thursday over Tehran's nuclear programme, mediator Oman said, but hours of negotiation ended without a breakthrough to avert potential U.S. strikes amid a massive military buildup.</span></p><p class=\"\"><span>Meanwhile, Fed Chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts, in alignment with President Donald Trump's expectations, could be narrowing amid emerging bullishness about the U.S. economy.</span></p><p class=\"\"><span>The number of Americans filing new applications for jobless benefits increased slightly last week, but the unemployment rate appeared to hold steady in February in a stable labour market.</span></p><p class=\"\"><span>Markets currently expect three 25-basis-point Fed rate cuts this year, according to CME's FedWatch Tool. </span></p><p class=\"\"><span>Spot silver </span><span> rose 1.6% to $89.79 per ounce, and was headed for a 6.1% gain on the month.</span></p><p class=\"\"><span>Spot platinum </span><span> added 3.9% to $2,260.09 per ounce, while palladium </span><span> gained 1.7% to $1,805.24.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN03L:0-gold-steady-as-drop-in-us-treasury-yields-offsets-firm-dollar/",
            "pub_date": "2026-02-27 11:47:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2942053:0",
            "title": "ICG: 2025 saw revenue and net income declines amid market softness and ETH volatility",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue and net income declined year-over-year due to market cyclicality, lower demand, and ETH price drops. Strategic focus remains on altcoin mining, ETH accumulation, and staking, with new product launches and margin improvement initiatives planned for 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2942053-78af525ffb0828b0ede444ff5c3ca100\" target=\"_blank\">Intchains Group Limited [ICG] Slides Release — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2942053:0-icg-2025-saw-revenue-and-net-income-declines-amid-market-softness-and-eth-volatility/",
            "pub_date": "2026-02-27 11:47:37",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0C8:0",
            "title": "Indian shares open flat, tracking subdued Asian peers",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Indian stock benchmarks opened flat on Friday, as a U.S. tech selloff and subdued Asian cues kept sentiment restrained ahead of a local GDP print later in the day.</span></p><p class=\"\"><span>The Nifty 50 </span><span> fell 0.14% to 25,459.85 and the BSE Sensex </span><span> shed 0.03% to 82,220.48 as of 9:15 a.m. IST.</span></p><p class=\"\"><span>Barring IT, all the other 15 major sectors declined. The broader small-caps </span><span> and mid-caps </span><span> opened flat.</span></p><p class=\"\"><span>The beaten-down IT stocks </span><span>, which have lost about 20% in February so far on artificial intelligence-linked disruption fears, rose 1.9% at the open.</span></p><p class=\"\"><span>The Nifty and Sensex have dropped 0.4% and 0.7% this week.</span></p><p class=\"\"><span>There is \"cautious sentiment and persistent pressure from the bears,\" said Sudeep Shah, head of technical and derivatives research at SBI Securities.</span></p><p class=\"\"><span>\"The prolonged sideways movement reflects the absence of momentum in either direction, reinforcing the ongoing consolidation phase.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0C8:0-indian-shares-open-flat-tracking-subdued-asian-peers/",
            "pub_date": "2026-02-27 11:48:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019799_20260226019800:0",
            "title": "TPG Telecom Will Discuss Options Over Coming Months, Years, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019799_20260226019800:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019799_20260226019799:0",
            "title": "TPG Telecom Still Wants to Increase Free Float, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019799_20260226019799:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019799:0",
            "title": "TPG Telecom Still Wants to Increase Free Float — Interview",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(03:49 GMT) </span></strong><span>*TPG Telecom Still Wants to Increase Free Float, CEO Says</span><br/><strong class=\"root-Tkn6WL2y\"><span>(03:49 GMT) </span></strong><span>*TPG Telecom Will Discuss Options Over Coming Months, Years, CEO Says</span><br/><strong class=\"root-Tkn6WL2y\"><span>(03:49 GMT) </span></strong><span>*TPG Telecom Scaled Back 2025 Capital Raise Aimed at Increasing Free Float</span><br/><strong class=\"root-Tkn6WL2y\"><span>(03:49 GMT) </span></strong><span>*TPG Telecom Expects to Lift Dividends With Profit, CEO Says</span><br/><strong class=\"root-Tkn6WL2y\"><span>(03:49 GMT) </span></strong><span>TPG Telecom Still Wants to Increase Free Float — Interview</span></p><p class=\"\"><span>By Stuart Condie</span></p><p class=\"\"><span>SYDNEY--TPG Telecom still wants to increase the proportion of its stock owned by minority shareholders, Chief Executive Inaki Berroeta said.</span></p><p class=\"\"><span>The Australian telecommunications provider ended 2025 with so-called free-float liquidity of 27%, up from 23% a year earlier, after a complex program of asset divestments, capital returns and equity raises.</span></p><p class=\"\"><span>However, that fell short of a 30% target after TPG Telecom scaled back its equity-raise ambitions due to uncertainty generated by an emergency service call failure and turmoil in global equity markets.</span></p><p class=\"\"><span>On Friday, Berroeta said he was satisfied with the outcome but added that the Vodafone Australia brand operator would consider options to further increase the free float.</span></p><p class=\"\"><span>\"People like companies that have more free float, obviously,\" Berroeta said.</span></p><p class=\"\"><span>\"We continue to look at ways to increase our free float and the board is quite aware of the fact that it is in the best interest of shareholders.\"</span></p><p class=\"\"><span>Berroeta declined to outline potential measures, but added that some decisions could only come from major shareholders. Four entities including U.K.-based Vodafone Group control 60% of TPG Telecom's shares.</span></p><p class=\"\"><span>Last year, TPG Telecom announced plans to raise almost 700 million Australian dollars, equivalent to US$497.4 million, from institutional and retail shareholders. It wanted them to reinvest their share of a A$3.0 billion capital distribution funded by the operator's sale of fixed-network assets.</span></p><p class=\"\"><span>In November, it scaled back the institutional component to A$300 million from A$550 million despite what it said was strong demand. It eventually raised a total A$373 million.</span></p><p class=\"\"><span>In the near term, shareholders should benefit from the debt reduction financed by the asset sale, Berroeta said. Excluding lease liabilities, TPG Telecom had A$1.36 billion in net debt at Dec. 31, down from A$4.08 billion a year earlier.</span></p><p class=\"\"><span>The company hasn't raised its interim or final dividend since 2022, but that could soon change, Berroeta said. Analysts forecast an 8% full-year increase for 2026, according to Visible Alpha.</span></p><p class=\"\"><span>\"Our view is that over time these dividends will continue to grow as cash flow and profits grow,\" he said.</span></p><p class=\"\"><span>Write to Stuart Condie at stuart.condie@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019799:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019799_20260226019801:0",
            "title": "TPG Telecom Scaled Back 2025 Capital Raise Aimed at Increasing Free Float",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019799_20260226019801:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019799_20260226019802:0",
            "title": "TPG Telecom Expects to Lift Dividends With Profit, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019799_20260226019802:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019804:0",
            "title": "Farm Fresh Likely to Post Higher 4Q Earnings — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Farm Fresh is expected to post sequentially higher 4Q earnings, Maybank IB analyst Jade Tam says in a note. The dairy producer's earnings are expected to be partly supported by stable demand for its core liquid milk products, regional contributions and new product launches. Operating margins might also widen in the near term, due to lower average selling prices for whole milk powder and a stronger ringgit. Maybank maintains its buy rating on the stock and target price of MYR2.95. Shares are 2.6% lower at MYR2.60. (amanda.lee@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019804:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019805:0",
            "title": "Chinese Tech Firms Seek Over $500 Million in Hong Kong Secondary Listings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Tracy Qu</span></p><p class=\"\"><span>Three technology companies are seeking to raise more than $500 million combined in Hong Kong, extending a wave of secondary listings by Chinese firms in the city.</span></p><p class=\"\"><span>Shenzhen Zhaowei Machinery &amp; Electronics, which makes micro-transmission and drive systems, plans to raise $1.97 billion Hong Kong dollars, equivalent to US$251.80 million, by offering 26.75 million shares, the company said in an exchange filing.</span></p><p class=\"\"><span>The company plans to use the proceeds for technology research and development, expansion of its product portfolio, and other purposes. About 33% of the shares will be taken up by cornerstone investors at the maximum offer price of HK$73.68.</span></p><p class=\"\"><span>Estun Automation, an industrial robotics company, aims to raise HK$1.64 billion. It said proceeds will fund manufacturing expansion, investments and other purposes.</span></p><p class=\"\"><span>Roughly 32% of its shares will be subscribed by cornerstone investors at the maximum offer price of HK$17.00, the company said.</span></p><p class=\"\"><span>MeiG Smart Technology, a Shenzhen-based provider of wireless data terminals for loT services, is seeking to raise HK$944.5 million in net proceeds from its Hong Kong offering.</span></p><p class=\"\"><span>All three companies are already listed in mainland China. Their shares are expected to begin trading in Hong Kong in the second week of March.</span></p><p class=\"\"><span>Hong Kong was among the world's most active listing venues last year. Companies raised HK$285.8 billion through listings in 2025, more than triple the amount raised a year earlier, according to data from Hong Kong Exchanges &amp; Clearing.</span></p><p class=\"\"><span>Write to Tracy Qu at tracy.qu@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019805:0/",
            "pub_date": "2026-02-27 11:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN03F:0",
            "title": "Oil heads for weekly decline as US, Iran extend talks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US-Iran talks end with no deal but potential signs of progress</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OPEC+ mulls 137,000 bpd oil output hike for April, sources say</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>OPEC+ meets on March 1</span></li></ul></span></div><span><p class=\"\"><span>By Florence Tan and Nicole Jao</span></p><p class=\"\"><span>    Oil prices inched down on Friday and were on track for a weekly decline after the United States and Iran extended nuclear talks, easing concerns about potential hostilities that could disrupt supply, while OPEC+ may resume output hike at its Sunday meeting.</span></p><p class=\"\"><span>Brent crude futures </span><span> lost 5 cents to $70.70 a barrel by 0331 GMT. U.S. West Texas Intermediate crude </span><span> fell 1 cent to $65.20.</span></p><p class=\"\"><span>For the week, Brent was heading for a 1.8% decline, while WTI was set to fall around 2.2%, reversing some of the previous week's gains.</span></p><p class=\"\"><span>    \"Traders are in wait-and-see mode heading into the weekend with Iran tensions mounting on one hand, and the OPEC+ meeting on Sunday with a likely production hike on the other hand,\" said June Goh, a senior analyst at Sparta Commodities.  </span></p><p class=\"\"><span>The United States and Iran held indirect talks in Geneva on Thursday over their long-running nuclear dispute to avert a conflict after U.S. President Donald Trump ordered a military build-up in the region.</span></p><p class=\"\"><span>During the talks, oil prices gained more than a dollar a barrel after media reports indicated the discussions had stalled over U.S. insistence on zero enrichment of uranium by Iran, as well as a demand for the delivery of all 60% enriched uranium to the United States.</span></p><p class=\"\"><span>However, prices eased after the Omani mediator said the two sides had made progress in their talks.</span></p><p class=\"\"><span>They plan to resume negotiations with technical-level discussions scheduled next week in Vienna, Omani Foreign Minister Sayyid Badr Albusaidi said in a post on X after the meetings in Geneva.</span></p><p class=\"\"><span>\"While this initially allayed concerns of imminent U.S. military action, it leaves little time to reach a deal before President Trump’s deadline of 1–6 March,\" said Daniel Hynes, an analyst at ANZ.</span></p><p class=\"\"><span>Sparta's Goh said the tone from the talks indicated an unwillingness from both parties to concede, adding that the chance of a U.S. strike on Iran is growing but any military action would likely be limited.</span></p><p class=\"\"><span>    To cushion the impact from a possible strike,     Saudi Arabia     is increasing its oil production and exports as part of a contingency plan, two sources familiar with the plan had told Reuters.  </span></p><p class=\"\"><span>Also, the Organization of the Petroleum Exporting Countries and their allies, a group known as OPEC+, is likely to consider raising its oil output by 137,000 barrels per day for April at the March 1 meeting, sources said, after suspending production hikes in the first quarter.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN03F:0-oil-heads-for-weekly-decline-as-us-iran-extend-talks/",
            "pub_date": "2026-02-27 11:50:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:528884:0",
            "title": "Indonesia Shares Fall Again, Second Monthly Decline in Sight",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Indonesian stocks fell 58 points, or 0.7%, to 8,174 in Friday morning trade, marking a second straight loss amid weakness in U.S. futures after Wall Street closed mostly lower overnight, with Nvidia’s strong earnings results failing to lift investors' sentiment.</span></p><p class=\"\"><span>Caution also persisted ahead of key domestic releases next week, including February inflation and January trade data, while China’s upcoming PMI readings added concern that the week-long Spring Festival may weigh on factory and services activity.</span></p><p class=\"\"><span>On the trade front, U.S. President Trump imposed a 104% tariff on Indonesian solar products, citing subsidies that hurt U.S. producers.</span></p><p class=\"\"><span>Most sectors slipped, led by energy, financials, and transport.</span></p><p class=\"\"><span>Notable laggards included United Tractor (-3.5%), Indofood Sukses Makmur (-2.6%), and Barito Pacific (-1.5%).</span></p><p class=\"\"><span>The market is heading for its first weekly drop in three, contributing to a second consecutive monthly decline of about 1.7% so far.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:528884:0-indonesia-shares-fall-again-second-monthly-decline-in-sight/",
            "pub_date": "2026-02-27 11:21:15",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:528888:0",
            "title": "Offshore Yuan Snaps 4-Session Gains",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The offshore yuan weakened to around 6.85 per dollar on Friday, snapping a four-session rally and retreating from a more than two-year high reached in the previous session, after the People's Bank of China adjusted policy settings to lower the cost of dollar forwards.</span></p><p class=\"\"><span>The central bank announced it would slash the foreign-exchange risk reserve requirement ratio to zero from 20%, starting March 2.</span></p><p class=\"\"><span>The latest move marks a shift from a September 2022 decision, when the PBOC raised the ratio to stem sharp yuan depreciation and curb capital outflows.</span></p><p class=\"\"><span>Further weighing on the yuan were continued efforts by the PBOC to temper the currency’s rapid appreciation.</span></p><p class=\"\"><span>The central bank set the daily midpoint fixing at 6.9228 per dollar, 800 pips weaker than Reuters’ estimate, marking the largest deviation on record.</span></p><p class=\"\"><span>Despite Friday’s pullback, the offshore yuan remains on track for its strongest weekly performance since April 2023.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:528888:0-offshore-yuan-snaps-4-session-gains/",
            "pub_date": "2026-02-27 11:23:27",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN04S:0",
            "title": "Japan finance minister signals greater vigilance over the yen's weakness",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Japanese Finance Minister Satsuki Katayama on Friday signalled heightened vigilance over currency moves, telling parliament the government is monitoring the yen's recent slide with a strong sense of urgency.</span></p><p class=\"\"><span>\"We are watching recent movements very closely, with a strong sense of urgency,\" Katayama told parliament, when asked if the yen's depreciation may be hampering wage growth by pushing up import costs.</span></p><p class=\"\"><span>\"We are also maintaining extremely close communication with the United States, and will continue engaging in dialogue to ensure that the concerns you raise do not materialise,\" she said.     </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN04S:0-japan-finance-minister-signals-greater-vigilance-over-the-yen-s-weakness/",
            "pub_date": "2026-02-27 11:37:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN0AE:0",
            "title": "Nuscale Power Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nuscale Power Corp </span><span> reported a quarterly adjusted loss of 31 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of -77 cents.  The mean expectation of twelve analysts for the quarter was for a loss of 12 cents per share. Wall Street expected results to range from -23 cents to -4 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 94.7% to $1.81 million from a year ago; analysts expected $8.57 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nuscale Power Corp's reported EPS for the quarter was a loss of 31 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $50.83 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nuscale Power Corp shares had fallen by 7.0% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 11.3% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 9 \"hold\" and 2 \"sell\" or \"strong sell.\" The average consensus recommendation for the electric utilities peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Nuscale Power Corp is $24.00, about 44.5% above its last closing price of $13.33</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 03:38 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.12</span></p></td><td><p class=\"\"><span>-0.31</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.14</span></p></td><td><p class=\"\"><span>-1.85</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-0.11</span></p></td><td><p class=\"\"><span>-0.13</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>-0.15</span></p></td><td><p class=\"\"><span>-0.11</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN0AE:0-nuscale-power-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 11:38:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:e7ec0cedc094b:0",
            "title": "SoundHound Stock Offers ‘Excellent Value’ Now? Why Retail Traders Are More Bullish After Q4 Earnings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>SoundHound forecast 2026 revenue between $225 million and $260 million, higher than analysts’ expectations of $230.2 million.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The company’s revenue doubled in 2025.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Although the stock remained muted post the results, Stocktwits sentiment climbed higher in the ‘extremely bullish’ zone. </span></li></ul></span></div><span><p class=\"\"><span>SoundHound AI, Inc. issued an upbeat 2026 revenue forecast after more than doubling sales last year, drawing renewed interest from retail traders who said the recent pullback has made the stock increasingly attractive following a strong earnings report.</span></p><p class=\"\"><span>Traders also anticipated a massive short squeeze, speculating that current market action is due to heavy short interest preparing to cover. Short trades rose sharply over the past months, climbing to 29.4% of the stock’s float as of Thursday from 24.5% in mid-November.</span></p><p class=\"\"><span>With its stock under $9 and market capitalization under $4 billion, SoundHound AI has gained traction with retail investors as a lower-priced AI play with rapid revenue growth, offering high-upside exposure to the AI theme after bigger names became crowded trades.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Soundhound Q4 Results</span></strong></strong></p><p class=\"\"><span>The company, which sells voice AI systems to a range of industries, including retail and automobiles, said its fourth-quarter revenue increased 59% to $55.1 million. That came in slightly higher than analysts’ $54 million estimate. Adjusted net loss in Q4 narrowed to $0.02 per share from $0.05, in line with estimates. </span></p><p class=\"\"><span>For the full-year, revenue increased by nearly 100% to $169 Million. </span></p><p class=\"\"><span>For 2026, the company expects revenue of $225 million to $260 million. Analysts expect $230.2 million.</span></p><p class=\"\"><span>“As traditional software faces massive AI disruption, businesses are looking to partner with AI natives that can help them achieve success in a new era. This is creating strong tailwinds for SoundHound,” CEO Keyvan Mohajer said in a statement.</span></p><p class=\"\"><span>The company detailed a range of new order wins in its earnings report.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Retail’s Reaction To SOUN</span></strong></strong></p><p class=\"\"><span>On Stocktwits, the retail sentiment for SOUN jumped multiple points higher in the ‘extremely bullish’ zone, with members advising buying shares at current levels.</span></p><p class=\"\"><span>“$SOUN Solid earnings, great outlook and excellent value at these levels,” said a user, while another </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/Dj68/message/646049563\" rel=\"nofollow\" target=\"_blank\">said</a><span> they would be “doubling my position, any pull-backs I'll load.”</span></p><p class=\"\"><span>https://stocktwits.com/bas575/message/646042657</span></p><p class=\"\"><span>Some traders expressed frustration at the muted stock reaction – SOUN rose a mere 0.1% in the after-market session – and speculated on manipulation by large investors and options traders. Still, they </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/Say_Wen/message/646048163\" rel=\"nofollow\" target=\"_blank\">expected</a><span> SOUN to rally strongly over the company days.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/SOUN\" rel=\"nofollow\" target=\"_blank\">SoundHound shares</a><span> are down about 66% from their recent peak in October 2025. Before Thursday's earnings report, they climbed for five straight sessions, rising 27%.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:e7ec0cedc094b:0/",
            "pub_date": "2026-02-27 11:40:00",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:528883:0",
            "title": "Philippine Peso Hovers Near 5-Month High",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Philippine peso held around 57.5 per dollar, hovering near a five-month high, supported by sustained foreign inflows into the equity market and a softer US dollar.</span></p><p class=\"\"><span>Investors have channeled funds into local stocks for two consecutive months following nearly eight years of persistent outflows.</span></p><p class=\"\"><span>The peso also benefitted from a weaker US dollar amid renewed uncertainty over President Trump’s tariff policy.</span></p><p class=\"\"><span>However, gains in the peso were capped by expectations of further monetary easing by the Bangko Sentral ng Pilipinas.</span></p><p class=\"\"><span>Last week, the BSP delivered its sixth consecutive rate cut to support an economy still recovering from last year’s corruption scandal.</span></p><p class=\"\"><span>Analysts currently expect an additional 25-basis-point reduction by year-end.</span></p><p class=\"\"><span>So far this year, the peso has risen nearly 2%, its strongest performance since early 2012, as it continues to rebound from its record low in January.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:528883:0-philippine-peso-hovers-near-5-month-high/",
            "pub_date": "2026-02-27 11:16:49",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:23c29bb8c094b:0",
            "title": "TeraWulf posts higher revenue, wider loss in 2025 as AI, HPC pivot accelerates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin miner TeraWulf reported higher revenue for full-year 2025, alongside a widened loss, as the company accelerated its shift toward high-performance computing (HPC) and artificial intelligence infrastructure.</span></p><p class=\"\"><span>The Nasdaq-listed firm said its total revenue reached $168.5 million in 2025, up 20.3% from the prior year, according to its latest earnings report released Thursday. Its 2025 figure included $16.9 million from newly launched HPC leasing operations.</span></p><p class=\"\"><span>The company posted a non-GAAP adjusted EBITDA loss of $23.1 million for the year, while net loss widened to $661.4 million from $72.4 million in 2024.</span></p><p class=\"\"><span>TeraWulf described 2025 as an \"inflection point,\" highlighting long-term data-center lease agreements covering 522 megawatts of critical IT load and more than $12.8 billion in contracted customer revenue, supported by $6.5 billion in financing tied to its HPC platform build-out.</span></p><p class=\"\"><span>Meanwhile, its fourth-quarter revenue declined sequentially as bitcoin mining weakened. Digital asset revenue fell to $26.1 million in the fourth quarter from $43.4 million in the third quarter, \"primarily driven by lower bitcoin production and price of bitcoin during the fourth quarter.\"</span></p><p class=\"\"><span>That decline was partly offset by growth in the company's hosting segment. HPC lease revenue rose to $9.7 million in the fourth quarter from $7.2 million in the third quarter.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI, HPC pivot</span></strong></p><p class=\"\"><span>The company's strategy increasingly centers on long-term AI and cloud compute customers anchored at its Lake Mariner campus in New York and the Abernathy HPC campus in Texas. </span></p><p class=\"\"><span>\"We enter 2026 with 522 critical IT MW of contracted HPC capacity and a gross 2.9-GW multi-regional platform designed for long-term expansion,” said CEO Paul Prager in the earnings statement. \"Our focus remains on disciplined execution, transparent capital allocation, and converting energy-advantaged infrastructure into durable, long-term cash flow.\"</span></p><p class=\"\"><span>Earlier this month, TeraWulf announced the acquisitions of brownfield infrastructure sites in Kentucky and Maryland, adding about 1.5 GW of capacity to its portfolio.</span></p><p class=\"\"><span>The shift mirrors a broader trend among U.S. miners seeking stable cash flows from AI infrastructure amid volatile crypto economics. MARA Holdings, for instance, reported a $1.7 billion net loss in the fourth quarter and has unveiled a joint venture with Starwood Capital Group to develop AI-focused data centers.</span></p><p class=\"\"><span>Shares of TeraWulf closed down 0.22% at $17.88 on Thursday, though the stock has climbed 29.66% over the past month.</span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:23c29bb8c094b:0-terawulf-posts-higher-revenue-wider-loss-in-2025-as-ai-hpc-pivot-accelerates/",
            "pub_date": "2026-02-27 11:28:57",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019779:0",
            "title": "Japan 2-Yr: 1.3% Cpn At 100.10 Lowest Price To Yld 1.251%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TOKYO--Japan's Ministry of Finance said Friday it auctioned Y2.146 trillion 1.3% 2-year bonds with the lowest price of 100.10 to yield 1.251%.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Issue                           2-year govt bond (No 48) </span><br/><span>Coupon                                              1.3% </span><br/><span>Settlement Date                              Mar 2, 2026 </span><br/><span>Maturity Date                                Mar 1, 2028 </span><br/><span>Total Bids                               Y7.121 Trillion </span><br/><span>Total Sold                               Y2.146 Trillion </span><br/><span>Bid-To-Cover Ratio                                  3.32 </span><br/><span>Lowest Price                                      100.10 </span><br/><span>Yield At Lowest Price                             1.251% </span><br/><span>Percentage Of Planned Buys </span><br/><span>Lowest Bidder Able to Buy                       41.7753% </span><br/><span>Average Price                                     100.11 </span><br/><span>Yield At Average Price                            1.244% </span><br/><span> </span><br/><span>Tail                                                0.01 </span><br/><span> (Average Minus Lowest Price) </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019779:0/",
            "pub_date": "2026-02-27 11:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:b42fb4a6a094b:0",
            "title": "Asian markets fall after Wall Street tech selloff; GIFT Nifty signals weak start for India",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The Nifty remains range-bound between 25,400 and 25,650, while Bank Nifty shows lower highs despite holding key support levels. Broader markets, including midcaps and select pharma and defence stocks, continue to show relative strength.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:b42fb4a6a094b:0/",
            "pub_date": "2026-02-27 11:13:02",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:528882:0",
            "title": "Japan 10-Year Yield Eases on BOJ Uncertainty",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Japan’s 10-year government bond yield fell to around 2.13% on Friday, ending a three-day advance amid uncertainty over Bank of Japan policy.</span></p><p class=\"\"><span>Earlier this week, the Japanese government appointed two reflationist academics to the BOJ’s policy board, while Prime Minister Sanae Takaichi reportedly expressed concerns about further rate hikes during a meeting with Governor Kazuo Ueda last week.</span></p><p class=\"\"><span>Hawkish board member Hajime Takata reiterated calls for additional rate increases and guidance signaling that the price stability target is nearly achieved.</span></p><p class=\"\"><span>Governor Ueda also reportedly said the central bank would carefully evaluate economic data at its March and April meetings before making rate decisions, leaving the possibility of a near-term hike open.</span></p><p class=\"\"><span>On the data front, Tokyo’s inflation slowed to the lowest pace in over a year, as government utility subsidies helped curb household energy costs, bolstering expectations that the BOJ may delay immediate rate increases.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/te_news:528882:0-japan-10-year-yield-eases-on-boj-uncertainty/",
            "pub_date": "2026-02-27 11:14:20",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019762_20260226019762:0",
            "title": "Hitachi Energy India Target Price Set at INR28,500 by Ambit Capital >543187.BY",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019762_20260226019762:0/",
            "pub_date": "2026-02-27 11:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019762_20260226019763:0",
            "title": "Hitachi Energy India Started at Buy by Ambit Capital >543187.BY",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019762_20260226019763:0/",
            "pub_date": "2026-02-27 11:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZL19Z:0",
            "title": "Nintendo plans around $1.9 billion share sale by Kyoto bank and others, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Miho Uranaka and Sam Nussey</span></p><p class=\"\"><span>    Nintendo </span><span> plans an unwinding of strategic shareholdings that would see companies including MUFG Bank and the Bank of Kyoto selling shares of the \"Super Mario\" maker, according to three sources familiar with the situation. </span></p><p class=\"\"><span>The sale is expected to total roughly 300 billion yen ($1.9 billion) and Nintendo could make a decision as soon as Friday, two of the sources said. The Kyoto-based gaming company also plans a buyback, the sources said.</span></p><p class=\"\"><span>Reuters is reporting Nintendo's plan for the first time. </span></p><p class=\"\"><span>Nintendo did not respond to a request for comment. The sources declined to be identified as the information is not public. </span></p><p class=\"\"><span>Both banks have set out policies to reduce cross-shareholdings. A 2019 sale of Nintendo's shares, in which they and others participated, totalled some 71 billion yen. </span></p><p class=\"\"><span>The Bank of Kyoto, a regional lender, held a 4.19% stake in Nintendo as of September last year. MUFG Bank, Japan's largest, had a 3.62% stake, which is held by a trust bank. </span></p><p class=\"\"><span>Mitsubishi UFJ Financial Group </span><span> declined to comment and Kyoto Financial Group </span><span> did not respond to a request for comment.</span></p><p class=\"\"><span>Regulators and the Tokyo Stock Exchange have been encouraging Japanese companies to unwind their cross-shareholdings.</span></p><p class=\"\"><span>Toyota </span><span> is planning an unwinding of strategic shareholdings that would involve banks and insurers selling around $19 billion of its shares, Reuters reported on Thursday. </span></p><p class=\"\"><span>The practice, which involves firms holding shares in each other to cement business ties, has been criticised by governance experts and overseas investors as insulating management from shareholders. Although the practice has been widespread in Japan for decades, it is less common in the West.   </span></p><p class=\"\"><span>($1 = 156.0200 yen)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZL19Z:0-nintendo-plans-around-1-9-billion-share-sale-by-kyoto-bank-and-others-sources-say/",
            "pub_date": "2026-02-27 11:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZL0C9:0",
            "title": "NTT Data to boost India headcount by 5,000 this year, exec says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Sai Ishwarbharath B and Abhirami  G</span></p><p class=\"\"><span>    Japanese technology firm NTT Data plans to raise its India headcount by 5,000 employees this year across software programming, consulting and IT support, a senior executive told Reuters.        </span></p><p class=\"\"><span>Large IT contracts of more than $100 million have doubled in the last 12 months, with deals stemming from manufacturing, logistics and public sector, Sudhir Chaturvedi, chief growth officer and CEO of North America, said on Tuesday. \"North America is back to growth, and we expect strong growth next financial year.\"      </span></p><p class=\"\"><span>The company, a subsidiary of telecom giant NTT Group </span><span>, is building out four data centers in India as part of a $1.5 billion investment and currently employs 40,000 in the country.</span></p><p class=\"\"><span>Global and local firms are increasingly looking to boost data center capacities in Asia's third-largest economy. </span></p><p class=\"\"><span>India hosts 20% of the world's data but has less than 6% of global data center capacity, according to ratings agency ICRA, making investments in the sector an attractive bet. The government has granted a tax holiday for foreign companies using local data centers.</span></p><p class=\"\"><span>Chaturvedi said clients' tech budgets are expected to rise 7% to 9% this year on account of investments beyond AI compared to 6% to 7% last year. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZL0C9:0-ntt-data-to-boost-india-headcount-by-5-000-this-year-exec-says/",
            "pub_date": "2026-02-27 11:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019768:0",
            "title": "Japan 13-Wk TD-Bill 99.8050 Lowest Price To Yld 0.7836%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TOKYO--Japan's Ministry of Finance said Friday it auctioned Y3.67 trillion of 13-week treasury discount bills with the lowest price of 99.8050 to yield 0.7836%.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Issue                           13-week TD-Bill (No 136) </span><br/><span>Settlement Date                              Mar 2, 2026 </span><br/><span>Maturity Date                                Jun 1, 2026 </span><br/><span>Total Bids                              Y10.684 Trillion </span><br/><span>Total Sold                                Y3.67 Trillion </span><br/><span>Bid-To-Cover Ratio                                  2.91 </span><br/><span>Lowest Price                                     99.8050 </span><br/><span>Yield At Lowest Price                            0.7836% </span><br/><span>Percentage Of Planned Buys </span><br/><span>Lowest Bidder Able to Buy                        4.5253% </span><br/><span>Average Price                                    99.8080 </span><br/><span>Yield At Average Price                           0.7715% </span><br/><span> </span><br/><span>Tail                                              0.0030 </span><br/><span> (Average Minus Lowest Price) </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019768:0/",
            "pub_date": "2026-02-27 11:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:91b443764094b:0",
            "title": "SpiceJet Block Deal: Authum Investment clarifies selling part of promoter pledge",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Shares of SpiceJet Ltd. are expected to remain in focus on Friday, February 27, after Authum Investment invoked pledged shares amounting to a 6.8% stake in the airline.</span></p><p class=\"\"><span> In a stock exchange filing, Authum said it acquired 10.37 crore equity shares of SpiceJet on February 25 through the invocation of pledged shares tied to outstanding dues of Spice Healthcare Pvt. Ltd.</span></p><p class=\"\"><span> The shares, originally held by promoter Ajay Singh, were pledged as security against the borrower’s obligations. Following the invocation, the entire 10.37 crore shares were transferred to Authum’s demat account.</span></p><p class=\"\"><span> Of these, 6 crore shares have already been sold, while 4.37 crore shares, representing a 2.86% stake, continue to remain in the dematerialised account as ongoing security.</span></p><p class=\"\"><span> SpiceJet, incorporated in December 1984, operates domestic and international passenger and cargo services. The airline reported a turnover of ₹5,326 crore for FY25.</span></p><p class=\"\"><span> The stock ended 9.81% higher at ₹15.90 on Thursday. However, despite the recent uptick, shares are still down 47% so far in 2026.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:91b443764094b:0/",
            "pub_date": "2026-02-27 11:04:00",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        }
    ]
}