{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309216:0",
            "title": "Sector Update: Health Care",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Health care stocks fell late Tuesday afternoon with the NYSE Health Care Index down 0.3% and the Health Care Select Sector SPDR Fund (XLV) shedding 0.4%. </p><p class=\"\">The iShares Biotechnology ETF (IBB) rose 0.3%. </p><p class=\"\">In corporate news, Quantum BioPharma  shares more than doubled. The company said a trial of its dietary supplement Unbuzzd confirmed it accelerates alcohol metabolism, speeds the reduction of blood alcohol concentration and reduces symptoms of intoxication, impairment and hangover.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309216:0-sector-update-health-care/",
            "pub_date": "2025-02-05 04:26:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009912:0",
            "title": "Michigan School District to Sell $81.3M in Bonds for School Projects",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paulo Trevisani</p><p class=\"\">Michigan's Traverse City Area Public Schools plans to issue $81.3 million in municipal bonds to finance school improvements and new facility construction.</p><p class=\"\">Proceeds from the 2025 School Building and Site Bonds (General Obligation - Unlimited Tax) will be used for building renovations, new school facilities, technology upgrades, bus purchases, and improvements to athletic fields and playgrounds, according to a document posted Monday on MuniOS.</p><p class=\"\">The school district includes the entire city of Traverse and all or part of 13 townships in Grand Traverse, Leelanau and Benzie counties.</p><p class=\"\">The bonds will be repaid through local taxes. They have been assigned an AA- rating by S&amp;P Global Ratings.</p><p class=\"\">Maturities range from 2026 to 2035. The maximum interest rate is 5.5%, with the purchase price set between 100% and 120% of par value.</p><p class=\"\">PFM Financial Advisors is the municipal advisor for the deal. The sale is scheduled for Feb. 12.</p><p class=\"\">The bonds aren't subject to early redemption.</p><p class=\"\">Write to Paulo Trevisani at paulo.trevisani@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009912:0/",
            "pub_date": "2025-02-05 04:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309199:0",
            "title": "PyroGenesis Expects To Be \"Relatively Unaffected\" By Potential U.S. Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PyroGenesis , a high-tech company, looks set for modest losses Tuesday after saying it expects to be \"relatively unaffected\" by proposed U.S. tariffs, if they are still introduced after a 30 day pause put on them yesterday is removed. </p><p class=\"\">\"Management is happy to see that any possible tariff implementation has been delayed by a month to allow for further dialogue. Nevertheless, management is of the opinion that the contemplated tariffs will have little to no direct negative impact on PyroGenesis' bottom line,\" the company said in a statement. </p><p class=\"\">\"On the contrary, management believes that the company is in a unique position to benefit from many of the Trump administration's stated goals for their economy.\"</p><p class=\"\">The company noted it manufactures and assembles many of its key systems outside of Canada, including its Drosrite aluminum metal dross recovery systems, which are manufactured in the U.S. In fact, most of the components used in PyroGenesis systems are manufactured outside of Canada, the company said. </p><p class=\"\">\"More importantly,\" it said, \"outside of clients in the U.S. defense sector (which often benefits from exemptions or waivers from U.S. tariffs), the bulk of the company's current and prospective clients are located outside of the United States, specifically in Europe, Canada, and the Middle East. </p><p class=\"\">\"On that note, it is also important to point out that the majority of the company's contracts are denominated in US dollars or Euros, and the current exchange rate environment could enhance the value of our foreign-denominated contracts.\"</p><p class=\"\">PyroGenesis views the benefits from President Trump's campaign promises to \"bode well\" for the company. In particular, it cited his commitments to lower corporate taxation to stimulate business growth; reduce regulatory burdens and bureaucracy to accelerate project approvals; and expand the energy sector. </p><p class=\"\">According to Tuesday's statement the company provided the comments in response to investor questions about the impact from the recent trade policy disagreements between the U.S. and Canada, specifically with regards to potential U.S. tariffs imposed on Canadian products. </p><p class=\"\">PYR was at last look down $0.01 at $0.56.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309199:0/",
            "pub_date": "2025-02-05 04:27:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV17Z:0",
            "title": "PREVIEW: Disney seen reporting increase in rev in results before the bell",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Walt Disney  were down 0.6% in afternoon trading, with the co expected to report an increase in rev in its qtrly results to be released before the opening bell Wed</p><p class=\"\">** Analysts expect qtrly rev to rise to $24.62 bln vs $23.55 bln a yr ago and earnings of $1.45/shr vs $1.22 a yr ago, according to LSEG</p><p class=\"\">** Jefferies analysts earlier this week wrote they see risks to the co's fiscal year 2025 guidance \"due to the launch of Epic Universe\"</p><p class=\"\">** In November, DIS offered robust multi-year guidance</p><p class=\"\">** Of the 34 analysts who cover DIS, 24 recommend a \"strong buy\" or \"buy,\" nine recommend a \"hold\" and one recommends a \"sell\"</p><p class=\"\">** The median 12-mth PT is $125.55; the stock was last at $113.29</p><p class=\"\">** Last week, Nielsen's latest report showed that Walt Disney maintained its lead in U.S. TV viewing share in December, bolstered by holiday movie marathons and strong performances across its cable networks</p><p class=\"\">** Including the session move, DIS shares are up 1.7% YTD while the Dow Jones industrial average  is up 4.8%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV17Z:0-preview-disney-seen-reporting-increase-in-rev-in-results-before-the-bell/",
            "pub_date": "2025-02-05 04:27:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309214:0",
            "title": "McCormick & Co Insider Sold Shares Worth $3,840,320, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lawrence Erik Kurzius, Director, on February 03, 2025, sold 50,000 shares in McCormick &amp; Co  for $3,840,320. Following the Form 4 filing with the SEC, Kurzius has control over a total of 330,364 common shares of the company, with 276,895 shares held directly and 53,469 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/63754/000106299325001602/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/63754/000106299325001602/xslF345X05/form4.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309214:0/",
            "pub_date": "2025-02-05 04:27:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b8dea069820e5:0",
            "title": "SILICON LABORATORIES INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Silicon Laboratories Inc., a leading player in the semiconductor industry specializing in secure, intelligent wireless technology for IoT applications, has released its Form 10-K report for fiscal 2024. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in a highly competitive market.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Silicon Laboratories Inc. reported the following key financial metrics for fiscal 2024:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenues:</strong> $584.4 million, a decrease of $197.9 million or 25.3% compared to fiscal 2023, primarily due to reduced revenues from both Industrial &amp; Commercial and Home &amp; Life products.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit:</strong> $312.2 million, down by $148.4 million from fiscal 2023, with a gross margin of 53.4%, a decline from 58.9% in the previous year, mainly due to variations in customer and product mix.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income (Loss):</strong> $(165.5) million, compared to an operating loss of $24.2 million in fiscal 2023, indicating a significant increase in operating loss.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (Loss):</strong> $(191.0) million, reflecting a substantial decline from fiscal 2023, primarily due to decreased revenues and increased provision for income taxes.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\">In fiscal 2024, Silicon Laboratories Inc. achieved the following business milestones:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong> The company generated revenues primarily from its Industrial &amp; Commercial and Home &amp; Life product lines. The Industrial &amp; Commercial segment includes products like industrial automation and control, smart metering, and smart street lighting, while the Home &amp; Life segment covers smart home devices and connected health solutions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> A significant portion of the company's revenues, 90% in fiscal 2024, was derived from outside the United States, indicating a strong international market presence. The company maintains sales offices in Asia, the Americas, and Europe to support its global operations.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sales Units:</strong> The company experienced a decrease in unit volumes and average selling prices of its products in fiscal 2024 compared to fiscal 2023, reflecting a softening demand environment as customers reduced inventory levels.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches:</strong> The company introduced its Series 2 portfolio, which focuses on updatable device security, a critical feature for the evolving IoT market. This portfolio enhances the capability to protect user data and system keys from threats.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company anticipates continued challenges due to macroeconomic conditions, including geopolitical tensions and potential trade policies. However, it remains focused on leveraging its expertise in secure, intelligent wireless technology to drive growth in the IoT market.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <p class=\"\">Silicon Laboratories Inc. has undertaken several strategic initiatives to strengthen its market position and financial stability:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Liquidity and Cost Management:</strong> The company is focused on maintaining a strong liquidity position and has implemented cost containment measures to manage operating expenses. It has also reduced inventory levels in response to decreased demand, reflecting a strategic initiative to optimize supply chain management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Capital Management:</strong> The company ended fiscal 2024 with $382.2 million in cash, cash equivalents, and short-term investments. It has a $400 million revolving credit facility with no outstanding amounts as of December 28, 2024. The company did not repurchase any shares in the last quarter of fiscal 2024, although it has an authorized share repurchase program of up to $100 million through December 2024. The company has not declared or paid any cash dividends and does not intend to pay dividends in the near future.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> The company plans to maintain its liquidity and capital resources to support its operations and potential strategic acquisitions. It intends to continue managing its capital structure prudently, with a focus on sustaining its cash position and exploring opportunities for growth and expansion. The company may seek additional funding if necessary to support strategic initiatives or acquisitions.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <p class=\"\">Silicon Laboratories Inc. faces several challenges and risks in its operations:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Industry Competition:</strong> The company operates in the highly competitive semiconductor industry, focusing on secure, intelligent wireless technology for IoT applications. It faces challenges in maintaining its competitive edge due to rapid technological changes and the need for continuous innovation in mixed-signal IC design.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Supply Chain Risks:</strong> The reliance on third-party manufacturers for production introduces risks related to supply chain disruptions, geopolitical tensions, and capacity constraints.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Fluctuations:</strong> The semiconductor industry is cyclical, with significant fluctuations in supply and demand, impacting the company's ability to forecast and plan. Economic downturns can lead to reduced demand, high inventory levels, and price erosion.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity Threats:</strong> Cybersecurity threats, including potential attacks due to geopolitical tensions, pose risks to operations and reputation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Global Operations:</strong> The company faces challenges related to global operations, including currency fluctuations, political instability, and compliance with diverse regulatory environments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Volatility:</strong> The reliance on a few key customers and distributors for a significant portion of revenue increases the risk of revenue volatility.</li></ul><p class=\"\">Management acknowledges the need to address supply chain vulnerabilities and enhance cybersecurity measures. The company is investing in research and development to maintain technological leadership and expand its product portfolio. Efforts are being made to diversify the customer base and reduce dependency on key distributors. The company is also focusing on improving operational efficiencies and managing costs to mitigate the impact of market fluctuations.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1038074/000103807425000003/slab-20241228.htm\" rel=\"nofollow\" target=\"_blank\">SILICON LABORATORIES INC. [ SLAB ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:b8dea069820e5:0-silicon-laboratories-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 04:28:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0V4:0",
            "title": "US dollar edges lower as China tariffs kick in",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets see Trump's tariff threats as a negotiating tool</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. dollar index down 0.56% amid tariff tensions</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China imposes tariffs on U.S. imports in response</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro and Australian dollar rise</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Canadian dollar down after Monday rebound</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">President Trump granted Canada, Mexico 30-day reprieve</li></ul></span></div><span><p class=\"\">    The U.S. dollar edged lower on Tuesday as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal, a day after he suspended planned measures against Mexico and Canada.</p><p class=\"\">However, the new Trump administration imposed additional 10% tariffs on imports from China effective from early Tuesday and currency analysts said they expected high sensitivity to tariff developments and volatility to persist.</p><p class=\"\">The U.S. dollar index , a measure of the value of the greenback relative to a weighted basket of six major foreign currencies, was down 0.56% at 107.97 while the Canadian dollar was weaker and the Mexican peso was stronger.</p><p class=\"\">\"We're still looking at these 10% tariffs on China and China's retaliation, which is going to add some risk premium back into the market,\" said Helen Given, FX trader at Monex USA. \"We'll see if there's any sort of negotiation on the back end that might tamp these down as we saw with Mexico and Canada. But as it looks right now, the trade war with China is back up and running.\"</p><p class=\"\">The euro rose slightly, with Washington warning that the European Union may be next in line for trade levies, which are widely expected to push up U.S. inflation, supporting the dollar by keeping U.S. interest rates higher for longer.</p><p class=\"\">Beijing on Tuesday imposed tariffs on some U.S. imports in a swift response to new U.S. duties on Chinese goods, raising the stakes in a showdown between the world's top two economies. </p><p class=\"\">\"It suggests that China is wary of pushing back too hard against Trump's latest tariffs and is leaving the door open for future negotiations,\" said Lee Hardman, senior currency analyst at MUFG.</p><p class=\"\">The Chinese yuan edged up 0.23% to 7.287 per dollar in offshore trading . There is no official yuan trading until Wednesday, with mainland markets still closed for Lunar New Year festivities.</p><p class=\"\">The Australian dollar , which often acts as a liquid proxy for the yuan because the Australian economy is highly exposed to China, rose 0.5% to $0.626, well above Monday's low of $0.6085, the weakest level since April 2020.</p><p class=\"\">EURO LOWER</p><p class=\"\">The euro  rose 0.37% to $1.038, with market participants watching parity.</p><p class=\"\">Several analysts recently said that U.S. tariffs would have a deflationary effect on the euro area.</p><p class=\"\">\"While the prospects for wider across-the-board tariffs on the EU (are) now highly uncertain, to the extent that tariff back-and-forth continues, an environment of prolonged trade uncertainty should weigh on the Euro in and of itself,\" Goldman Sachs analysts said in a research note. </p><p class=\"\">The Canadian dollar  lost 0.81% to C$1.43 against its U.S. counterpart, following a sharp rebound from a low of C$1.4792 on Monday, the weakest level since 2003.</p><p class=\"\">The Mexican peso  rose 1.06% to 20.546, after jumping over 1.5% the day before.</p><p class=\"\">The U.S. dollar was nearly up 0.3% at 154.290 yen , with the Japanese currency seen as a safe-haven currency and the greenback less appealing after recent rises.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0V4:0-us-dollar-edges-lower-as-china-tariffs-kick-in/",
            "pub_date": "2025-02-05 04:28:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309218:0",
            "title": "Sector Update: Energy Stocks Rise Late Afternoon",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were higher late Tuesday afternoon, with the NYSE Energy Sector Index adding 2.1% and the Energy Select Sector SPDR Fund (XLE) up 2%. </p><p class=\"\">The Philadelphia Oil Service Sector index climbed 2.5%, while the Dow Jones US Utilities index was down 0.6%. </p><p class=\"\">In sector news, China plans to impose 15% tariffs on US coal and liquefied natural gas imports and a 10% tariff on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. The move follows the Trump administration's announcement of a 10% additional tariff on imports from China late Friday. </p><p class=\"\">Front-month West Texas Intermediate crude oil was declining 0.7% to $72.63 a barrel while the global benchmark Brent crude contract was up 0.1% at $76.06 a barrel. Henry Hub natural gas futures fell 3% to $3.25 per 1 million BTU. </p><p class=\"\">In corporate news, WEC Energy  reported Q4 earnings Tuesday of $1.43 per diluted share, up from $0.69 a year earlier. Analysts polled by FactSet expected $1.44. Its shares shed 0.6%. </p><p class=\"\">BP  is poised to spend up to $25 billion over the lifetime of a project to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday. Separately, BP is delaying plans to convert its former Kwinana oil refinery in Australia to produce renewable fuels, Bloomberg said Tuesday. BP shares rose 2.1%. </p><p class=\"\">Shell  said Tuesday it has resumed production at the Penguins field in the UK North Sea with a floating production, storage, and offloading facility. Its shares added 1.8%. </p><p class=\"\">SolarBank  shares jumped nearly 9%. The company said Tuesday that construction of its first battery energy storage system project in Ontario is expected to begin next week.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309218:0-sector-update-energy-stocks-rise-late-afternoon/",
            "pub_date": "2025-02-05 04:29:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009946:0",
            "title": "Trump's Trade Tactics Expose Canada's Need to Reshape Economy - Analysis",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul Vieira</p><p class=\"\">OTTAWA--The threat of prolonged uncertainty hovering over Canadian businesses from President Trump's trade policy is fueling calls for Canada to make its economy more resilient and innovative and less reliant on its southern neighbor.</p><p class=\"\">Canadian executives, former officials and economists say the country requires a fresh policy rethink to mitigate the trade risk Trump poses, and counter his promise to unleash business investment and energy production in his country. About 80% of Canadian exports are U.S.-bound.</p><p class=\"\">Canada on Monday avoided a hefty 25% tariff on its U.S. imports for a 30-day period, which Trump said will be used to see if a new economic deal with Canada can be reached. The hefty tariff could be revived without a deal.</p><p class=\"\">\"The worst-case scenario is a giant U.S. tariff. The second worst scenario is ongoing uncertainty. So we have the second-worst scenario,\" said Dan Kelly, president of the Canadian Federation of Independent Business. \"Canadian businesses now have to sleep with one eye open.\"</p><p class=\"\">Business leaders and economists say Canada should pursue lower taxes to encourage investment and innovation, accelerated approvals for resource and infrastructure projects, and perhaps resurrected plans for new oil-and-gas pipelines in the west and east to sell the country's energy to non-U.S. markets.</p><p class=\"\">Failing to do so leaves Canada too exposed to continued trade conflicts with Trump and an increasingly protectionist U.S. Congress. Without predictable U.S. trade, Canada's economy needs other engines of growth other than housing, immigration and public-sector expansion, economists and business leaders argue.</p><p class=\"\">A survey from KPMG Canada late last month indicated that nearly half of the business leaders contacted said they plan to shift investments to the U.S. or set up production operations to secure tariff-free access to the U.S. market and reduce costs.</p><p class=\"\">Among those leading the call for a new Canadian economic vision is the chief executive of the country's largest bank. \"This is the moment to unite the country behind a long-term economic agenda-one that boosts competitiveness and drives prosperity for all,\" Dave McKay of Royal Bank of Canada said in a post on the social-networking site, LinkedIn. \"To do this, Canada must build a more resilient economy that leverages its strengths.\"</p><p class=\"\">Canadian policymakers might be listening. Canada's Liberal government decided last week to defer implementation, until 2026, of an increase in the country's capital-gains tax--a measure that business groups and executives criticized heavily as dissuading investment at an inopportune time.</p><p class=\"\">The Conservative Party, which holds a sizable lead in public-opinion polls, has vowed to scrap that tax, and pledged broadly to lower tax rates, cut the public sector and repeal environmental regulations that thwart the country's resource sector.</p><p class=\"\">Former Canadian and U.K. central banker Mark Carney, the perceived front-runner to succeed Justin Trudeau as prime minister and Liberal Party leader, is also signaling a shift in economic policy for the current governing party.</p><p class=\"\">\"The federal government spends too much, but it invests too little. Middle class taxes are too high,\" he said last month in announcing his bid to be Canada's next prime minister.</p><p class=\"\">Any tax cutting effort by Canada may further strain its public finances, with the budget deficit at historically elevated levels and debt-financing costs up 10% from a year ago, as of the third quarter of last year.</p><p class=\"\">Outgoing Canadian Prime Minister Justin Trudeau has often bragged Canada is the only Group of Seven country with free-trade agreements with all other G7 members. Economists say it's time to capitalize and diversify.</p><p class=\"\">\"There will, or should be in any event, a greater awareness in Canada that it does not have a trusted partner south of the border,\" said David Rosenberg, an economist and head of market-strategy firm Rosenberg Research.</p><p class=\"\">Write to Paul Vieira at paul.vieira@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009946:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928_20250204009953:0",
            "title": "Otter Tail Raises Qtr Dividend to 52.5c >OTTR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928_20250204009953:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928:0",
            "title": "Otter Tail Corporation Increases Quarterly Dividend by 12 Percent",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>*Otter Tail Corporation Increases Quarterly Dividend By 12 Percent &gt;OTTR<br/><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>Press Release: Otter Tail Corporation Increases Quarterly Dividend by 12 Percent</p><p class=\"\">Otter Tail Corporation Increases Quarterly Dividend by 12 Percent</p><p class=\"\">FERGUS FALLS, Minn.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Otter Tail Corporation  announced today that its Board of Directors increased the company's quarterly common stock dividend to $0.525 per share. The increase brings the annual indicated dividend rate to $2.10 per share, a $0.23, or 12.3 percent, increase over the 2024 rate.</p><p class=\"\">\"Otter Tail Corporation ended 2024 in a position of financial strength, and the double-digit increase to our dividend reflects our commitment to delivering shareholder value,\" said President and CEO Chuck MacFarlane. \"Going forward, we expect our annual dividend increase to approximate our long-term earnings per share growth rate target.\"</p><p class=\"\">2025 will mark the 87th consecutive year dividends will be paid on common stock. The first quarter dividend is payable on March 10, 2025 to shareholders of record on February 14, 2025.</p><p class=\"\">The corporation will issue a news release announcing 2024 financial results on Monday, February 17, 2025 and has scheduled an earnings call for Tuesday, February 18, 2025 at 10:00 a.m. CT.</p><p class=\"\">About Otter Tail Corporation: Otter Tail Corporation has interests in diversified operations that include an electric utility and manufacturing businesses. Otter Tail Corporation stock trades on the NASDAQ Global Select Market under the symbol OTTR. The latest investor and corporate information is available at www.ottertail.com. Corporate offices are located in Fergus Falls, Minnesota, and Fargo, North Dakota.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204422675/en/</p><p class=\"\">CONTACT:    Media Contact: Stephanie Hoff, Director of Corporate Communications,</p><p class=\"\">(218) 739-8535</p><p class=\"\">Investor Contact: Beth Eiken, Manager of Investor Relations, (701) 451-3571</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(20:30 GMT) </strong>*Otter Tail Raises Qtr Dividend to 52.5c &gt;OTTR</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009928_20250204009928:0",
            "title": "Otter Tail Corporation Increases Quarterly Dividend By 12 Percent >OTTR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009928_20250204009928:0/",
            "pub_date": "2025-02-05 04:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr9kTg7f:0",
            "title": "Nordea Bank Abp: Repurchase of own shares on 04.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Nordea<p class=\"\">Nordea Bank Abp</p><p class=\"\">Stock exchange release – Changes in company’s own shares</p><p class=\"\">04.02.2025 at 22.30 EET</p><p class=\"\">Nordea Bank Abp (LEI: 529900ODI3047E2LIV03) has on 04.02.2025 completed repurchases of own shares (ISIN: FI4000297767) as follows:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><p class=\"\">Trading venue (MIC Code)</p></th><th><p class=\"\">Number of shares</p></th><th><p class=\"\">Weighted average price / share, EUR* **</p></th><th><p class=\"\">Total cost, EUR* **</p></th></tr></thead><tbody><tr><td><p class=\"\">XHEL</p></td><td><p class=\"\">134,713</p></td><td><p class=\"\">11.27</p></td><td><p class=\"\">1,518,148.15</p></td></tr><tr><td><p class=\"\">XSTO</p></td><td><p class=\"\">106,581</p></td><td><p class=\"\">11.24</p></td><td><p class=\"\">1,198,010.66</p></td></tr><tr><td><p class=\"\">XCSE</p></td><td><p class=\"\">26,423</p></td><td><p class=\"\">11.27</p></td><td><p class=\"\">297,661.95</p></td></tr><tr><td><p class=\"\">Total</p></td><td><p class=\"\">267,717</p></td><td><p class=\"\">11.26</p></td><td><p class=\"\">3,013,820.76</p></td></tr></tbody></table></div><p class=\"\">* FX rate used: SEK to EUR 11.4470 and DKK to EUR 7.4610 </p><p class=\"\">** Rounded to two decimals</p><p class=\"\">On 17 October 2024, Nordea announced a share buy-back programme of up to a maximum of EUR 250 million based on the authorisation granted by Nordea’s Annual General Meeting 2024. The repurchase of own shares is executed in public trading in accordance with Regulation No. 596/2014 of the European Parliament and Council of 16 April 2014 (MAR) and the Commission Delegated Regulation (EU) 2016/1052.</p><p class=\"\">After the disclosed transactions, Nordea holds 3,822,436 treasury shares for capital optimisation purposes and 11,513,966 treasury shares for remuneration purposes.</p><p class=\"\">Details of each transaction are included as an appendix to this announcement.</p><p class=\"\">On behalf of Nordea Bank Abp,</p><p class=\"\">Morgan Stanley Europe SE</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information:</strong></p><p class=\"\">Ilkka Ottoila, Head of Investor Relations, +358 9 5300 7058</p><p class=\"\">Media inquiries, +358 10 416 8023 or press@nordea.com</p><p class=\"\">https://news.cision.com/nordea/r/nordea-bank-abp--repurchase-of-own-shares-on-04-02-2025%2Cc4100652</p><p class=\"\">Nordea-statement-of-transactions-in-own-shares-20250204</p><p class=\"\">Nordea-statement-of-transactions-in-own-shares-20250204</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr9kTg7f:0-nordea-bank-abp-repurchase-of-own-shares-on-04-02-2025/",
            "pub_date": "2025-02-05 04:30:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009896:0",
            "title": "NYSE New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 63 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Acres Commercial Realty      ACR         18.20         18,907 <br/>ASA Gold &amp; Prec Metals       ASA         24.47         27,601 <br/>A10 Networks                 ATEN        20.49        488,134 <br/>Accenture Cl A               ACN        392.45      1,866,888 <br/>Agnico-Eagle Mines           AEM         97.01      1,810,039 <br/>Air Products &amp; Chemicals     APD        341.14        785,199 <br/>Alaska Air Group             ALK         75.88      1,598,158 <br/>Algonquin Pwr Nts 2079       AQNB        25.85          7,933 <br/>Angel Oak Finl Strat         FINS        13.49         74,684 <br/>Ares Management              ARES       200.49      1,263,888 <br/>Athene Holding Deb. 2064     ATHS        26.25        255,797 <br/>AutoZone                     AZO       3472.03         76,485 <br/>BJ's Wholesale Club          BJ         103.06      1,140,893 <br/>BlackBerry                   BB           4.66     19,078,588 <br/>BlackSky Technology          BKSY        18.30      2,444,137 <br/>BlackSky Technology Wt       BKSY.WS    0.3500        197,004 <br/>Brinker International        EAT        192.22        718,780 <br/>British Amer Tobacco ADR     BTI         40.25      3,544,848 <br/>Broadridge Finl Solutions    BR         242.03        307,013 <br/>Butterfly Network            BFLY         4.71      8,687,816 <br/>Butterfly Network Wt         BFLY.WS    0.5000        155,871 <br/>Cheniere Energy Ptnr         CQP         66.47        212,281 <br/>Darden Restaurants           DRI        200.90        492,807 <br/>Dover Corp                   DOV        222.31        505,993 <br/>Dutch Bros                   BROS        64.89        973,839 <br/>Embotell Andina B ADR        AKO.B       20.75          5,475 <br/>Fst Tr Splty Fin             FGB          4.49         17,172 <br/>Franco-Nevada                FNV        139.68        441,217 <br/>Gartner Inc                  IT         584.01        640,544 <br/>Genpact                      G           49.46        439,661 <br/>Guidewire Software           GWRE       217.43        513,285 <br/>Hims &amp; Hers Health           HIMS        41.65     13,277,322 <br/>Intercorp Finl Svcs          IFS         30.65        257,501 <br/>IBM                          IBM        264.18      2,917,118 <br/>Kayne Anderson BDC           KBDC        17.34         41,335 <br/>Klaviyo                      KVYO        48.73        801,565 <br/>Kroger                       KR          64.90      2,870,730 <br/>Kyndryl Holdings             KD          39.80      2,919,329 <br/>Live Nation Ent              LYV        148.36      1,564,468 <br/>MBIA Inc                     MBI          7.30        275,594 <br/>MP Materials                 MP          24.78      6,711,033 <br/>MSC Income Fund              MSIF        16.74        120,027 <br/>Markel Group                 MKL       1847.92         28,350 <br/>Oklo                         OKLO        48.02     18,025,479 <br/>OppFi                        OPFI        15.12      1,882,857 <br/>OppFi Wt                     OPFI.WS      4.94        151,650 <br/>PJT Partners                 PJT        190.28        446,007 <br/>Planet Labs PBC              PL           6.55      7,714,032 <br/>Reddit                       RDDT       218.25      4,388,989 <br/>Roblox                       RBLX        73.27      5,695,316 <br/>Similarweb                   SMWB        17.50        400,062 <br/>Sixth Street Spc Lending     TSLX        22.47        110,638 <br/>Skeena Resources             SKE         10.37        246,224 <br/>Spotify Technology           SPOT       618.55      5,297,353 <br/>Stride                       LRN        140.41        634,325 <br/>Tuya ADR                     TUYA         2.94      4,329,433 <br/>UGI                          UGI         31.24        605,892 <br/>Universal Tech Institute     UTI         28.73        428,564 <br/>Walmart                      WMT        100.87     10,151,521 <br/>Wells Fargo                  WFC         79.85      8,367,934 <br/>Westlake Chem Partners       WLKP        24.84         29,652 <br/>Wyndham Hotels &amp; Resorts     WH         107.18        270,872 <br/>XPeng ADR                    XPEV        17.30     13,693,434 <br/> <br/> <br/> <br/>New Lows 44 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>ADC Therapeutics             ADCT         1.55        423,996 <br/>AES                          AES         10.33      8,370,441 <br/>Alexandria Real Estate       ARE         93.80        522,032 <br/>Annovis Bio                  ANVS         2.99      1,178,837 <br/>Archer Daniels Midland       ADM         47.46      4,383,129 <br/>Atkore                       ATKR        62.62      3,372,244 <br/>BRC                          BRCC         2.48      1,146,102 <br/>Ball Corp                    BALL        50.81      4,401,065 <br/>Bally's                      BALY/T      15.43          7,578 <br/>Boston Beer Cl A             SAM        243.14        100,727 <br/>Bunge Global                 BG          73.74      1,339,607 <br/>Cable One                    CABO       276.12         76,961 <br/>Conagra Brands               CAG         24.85      2,961,419 <br/>Danaher                      DHR        210.04      5,115,025 <br/>e.l.f. Beauty                ELF         86.14      4,344,228 <br/>Edgewell Personal Care       EPC         30.87        287,919 <br/>Entergy LA Mtg Bds           ELC         20.50          9,977 <br/>Enzo Biochem                 ENZ        0.5677        165,817 <br/>Everest Group                EG         336.50        492,008 <br/>Foot Locker                  FL          18.62      1,105,676 <br/>Forestar Group               FOR         22.67         61,724 <br/>Guess?                       GES         12.19        438,275 <br/>Halliburton                  HAL         25.21      7,859,428 <br/>Herbalife                    HLF          5.18        927,303 <br/>Hershey                      HSY        143.95      1,302,282 <br/>Infinity Natrl Rscs          INR         20.00        358,081 <br/>Koppers Holdings             KOP         28.57         41,974 <br/>Maiden Holdings Nts 2046     MHLA        14.55            105 <br/>Merck                        MRK         87.33     38,822,747 <br/>Murphy Oil                   MUR         25.26      2,153,676 <br/>Offerpad Solutions Cl A      OPAD         2.18         24,159 <br/>PG&amp;E 6% Pfd. A               PCGpX       40.27         27,004 <br/>PG&amp;E                         PCG         14.99     10,210,354 <br/>PVH Corp.                    PVH         80.25      1,163,804 <br/>Peabody Energy               BTU         17.10      1,260,009 <br/>Quanex Building Products     NX          19.57        177,376 <br/>SCE Trust IV Pfd. J          SCEpJ       21.86         26,574 <br/>Seritage Growth Prop A       SRG          3.61         80,489 <br/>Solo Brands                  DTC        0.9401        106,979 <br/>Stoneridge                   SRI          4.21        290,875 <br/>USANA Health Sciences        USNA        30.92         92,360 <br/>Utz Brands                   UTZ         12.71        860,885 <br/>Worthington Steel            WS          27.85         85,747 <br/>XPLR Infrastructure          XIFR         9.37      2,324,954 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009896:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009892:0",
            "title": "NYSE American New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 2 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Collective Mining            CNL          5.58          7,055 <br/>Orla Mining                  ORLA         6.47        387,869 <br/> <br/> <br/> <br/>New Lows 5 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>Mixed Martial Arts Group     MMA          1.10         12,783 <br/>Pacific Gas &amp; Elec 4.5%      PCGpH       16.08            489 <br/>Pacific G&amp;E 5.5% Cum pfd     PCGpB       19.54            862 <br/>Scorpius Holdings            SCPX       0.2275        403,565 <br/>Toppoint Holdings            TOPP         1.63         51,996 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009892:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009893:0",
            "title": "NASDAQ New 52-Week Highs And Lows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">New Highs 92 <br/> <br/>COMPANY                      SYMBOL       HIGH         VOLUME <br/>-------                      ------       ----         ------ <br/>Allot                        ALLT         8.93        698,211 <br/>Alphabet Cl A                GOOGL      206.68     21,584,209 <br/>Alphabet Cl C                GOOG       208.23     13,809,470 <br/>Amazon.com                   AMZN       242.52     18,944,995 <br/>Ascentage Pharma ADR         AAPG        18.91        332,322 <br/>Avid Bioservices             CDMO        12.51      2,121,751 <br/>Axsome Therapeutics          AXSM       112.48        457,162 <br/>Baker Hughes                 BKR         47.83      4,983,343 <br/>Bellevue Life Sciences Rt    BLACR      0.2500         45,533 <br/>Cellebrite DI                CLBT        25.95      1,631,840 <br/>Charlton Aria Acquisition    CHARU       10.30            436 <br/>Charlton Aria Acqn Rt        CHARR      0.2365          1,717 <br/>Cheesecake Factory           CAKE        57.32        881,519 <br/>Clean Energy Fuels           CLNE         3.49      2,955,480 <br/>Cognizant Tech Solutions     CTSH        83.97      2,155,056 <br/>Costco Wholesale             COST      1024.11      1,251,668 <br/>CyberArk Software            CYBR       378.78        425,688 <br/>Direxion Dly AMZN Bl 2X      AMZU        50.61        713,749 <br/>Direxion Dly GOOGL Bl 2x     GGLL        53.52      1,967,449 <br/>Direxion Dly NFLX Bull 2X    NFXL        46.29        394,065 <br/>Direxion Dly PLTR Bull 2X    PLTU        50.92      2,439,250 <br/>DoorDash                     DASH       194.22      1,408,264 <br/>Duolingo                     DUOL       383.06        483,310 <br/>Eton Pharmaceuticals         ETON        18.03        272,389 <br/>Eureka Acquisition Cl A      EURK        10.20          1,959 <br/>ExlService Holdings          EXLS        51.25        385,399 <br/>First Seacoast Bancorp       FSEA        11.30         24,710 <br/>FT Gl Tactical Commodity     FTGC        25.25        760,243 <br/>Fox Corp Cl B                FOX         52.54      1,112,188 <br/>Fox Corp Cl A                FOXA        55.56      4,794,125 <br/>Franklin Financial Svcs      FRAF        34.87         10,035 <br/>Freedom Holding              FRHC       143.16         39,617 <br/>GSR III Acquisition          GSRT         9.94         87,361 <br/>Gl X Social Media ETF        SOCL        47.61          9,710 <br/>Goldenstone Acquisition      GDSTU       12.89         17,892 <br/>GrShr 2x Long AMZN Daily     AMZZ        41.70        186,431 <br/>GrShr 2x Long PLTR Daily     PTIR       240.30      1,618,924 <br/>HealthEquity                 HQY        113.23        370,011 <br/>Horizon Space Acqn II        HSPTU       10.15          4,200 <br/>IF Bancorp                   IROQ        25.00          3,198 <br/>Inari Medical                NARI        79.89      1,330,900 <br/>Inflection Point II Wt       IPXXW        1.34        558,044 <br/>Insmed                       INSM        81.25        836,921 <br/>Intapp                       INTA        75.90        912,717 <br/>iSh BBB-B CLO Active         BCLO        50.42            962 <br/>JVSPAC Acquisition Cl A      JVSA        10.60          1,001 <br/>KORU Medical Systems         KRMD         5.05      1,084,659 <br/>Kingstone                    KINS        18.15        413,565 <br/>Kolibri Global Energy        KGEI         7.91         82,336 <br/>Liberty Formula One A        FWONA       89.13         49,116 <br/>Liberty Live C               LLYVK       75.68        176,901 <br/>Liberty Live A               LLYVA       74.06         75,957 <br/>Locafy Wt                    LCFYW      109.00         11,044 <br/>MIND Technology              MIND        10.13        296,503 <br/>M3-Brigade Acqn V Wt         MBAVW      0.2200         10,050 <br/>Matterport                   MTTR         5.36      6,299,100 <br/>Mesa Laboratories            MLAB       152.75         27,061 <br/>Mirum Pharmaceuticals        MIRM        50.34        193,273 <br/>Monopar Therapeutics         MNPR        49.98         67,249 <br/>NSTS Bancorp                 NSTS        12.96          1,850 <br/>Nabors Energy II Cl A        NETD        10.90          1,213 <br/>Nayax                        NYAX        39.28          2,725 <br/>Netflix                      NFLX      1008.00      4,772,107 <br/>News Corp Cl B               NWS         33.00        741,793 <br/>Nutex Health                 NUTX        49.75         29,476 <br/>O'Reilly Automotive          ORLY      1336.63        178,102 <br/>Oak Woods Acquisition Wt     OAKUW      0.1450         50,256 <br/>Oportun Financial            OPRT         5.22        234,657 <br/>Palantir Technologies        PLTR       106.91    201,842,762 <br/>Playa Hotels &amp; Resorts       PLYA        12.98      1,287,987 <br/>ProShares Nasdaq-100 DW      QQQA        50.67          2,297 <br/>Pulse Biosciences            PLSE        23.74        135,901 <br/>RF Industries                RFIL         5.67         48,713 <br/>Remitly Global               RELY        24.18      1,443,274 <br/>Roman DBDR Acquisition II    DRDB         9.93        505,800 <br/>Sanmina                      SANM        86.69        356,475 <br/>Sprouts Farmers Market       SFM        165.63        796,415 <br/>Starbucks                    SBUX       110.75      6,377,629 <br/>Stellar V Capital            SVCCU       10.09        213,981 <br/>Sun Country Airlines         SNCY        17.75        793,590 <br/>Supernus Pharmaceuticals     SUPN        40.24        377,250 <br/>Texas Community Bcshs        TCBS        15.92            417 <br/>ThredUp                      TDUP         2.61        908,241 <br/>Translational Dev Acqn Un    TDACU       10.06        183,255 <br/>Trinity Capital              TRIN        15.51        397,661 <br/>TruBridge                    TBRG        25.90        169,700 <br/>Unity Bancorp                UNTY        49.40         56,231 <br/>VanEck Retail ETF            RTH        242.60          4,936 <br/>VeriSign                     VRSN       219.57        417,390 <br/>Viant Technology             DSP         22.67        191,078 <br/>Wang &amp; Lee Group             WLGS         7.90        153,439 <br/>Willamette Valley            WVVI         6.00         12,074 <br/> <br/> <br/> <br/>New Lows 111 <br/> <br/>COMPANY                      SYMBOL       LOW          VOLUME <br/>-------                      ------       ----         ------ <br/>Aditxt                       ADTX       0.0905     11,661,441 <br/>AgriFORCE Growing Sys        AGRI         2.00        120,371 <br/>Allogene Therapeutics        ALLO         1.62      2,078,614 <br/>Alternus Clean Energy        ALCE       0.2751        158,201 <br/>American Woodmark            AMWD        72.93         78,588 <br/>Amphastar Pharm              AMPH        32.25        276,772 <br/>Annexon                      ANNX         3.44        717,314 <br/>Applied Therapeutics         APLT       0.5439      2,051,462 <br/>Artiva Biotherapeutics       ARTV         4.58        169,109 <br/>Ascent Solar Technologies    ASTI         1.90         30,636 <br/>Aspira Women's Health        AWH        0.2900        579,128 <br/>Baijiayun Group              RTC        0.6450        794,042 <br/>Beta Bionics                 BBNX        21.72        476,954 <br/>Bolt Biotherapeutics         BOLT       0.4631        286,675 <br/>Boundless Bio                BOLD         2.15         15,411 <br/>Bowen Acquisition            BOWN         3.80         15,289 <br/>BriaCell Therapeutics        BCTX         3.92        797,136 <br/>BriaCell Therapeutics Wt     BCTXW      0.0819        180,404 <br/>CN Energy Group              CNEY       0.2212      1,475,017 <br/>Campbell's                   CPB         37.16      2,135,359 <br/>Celsius Holdings             CELH        23.03      6,463,345 <br/>Chord Energy                 CHRD       109.22        727,327 <br/>ClearOne                     CLRO       0.4500        170,640 <br/>Cloudastructure Cl A         CSAI        12.50         49,789 <br/>Conduit Pharmaceuticals      CDT          1.75        458,525 <br/>Contineum Therapeutics       CTNM         8.96         47,223 <br/>Cyngn                        CYN        0.0730     91,206,165 <br/>Defiance Oil Enh Opt Incm    USOY        13.14        223,002 <br/>Digital Ally                 DGLY       0.1761        819,285 <br/>Direxion Dly AMZN Bear 1X    AMZD        10.44         52,841 <br/>Direxion Dly GOOGL Br 1X     GGLS        11.16        688,631 <br/>Direxion Dly PLTR Bear 1X    PLTD        14.83      7,334,671 <br/>Establishment Labs Hldgs     ESTA        29.59        323,238 <br/>Expion360                    XPON         1.32         54,888 <br/>Fathom Holdings              FTHM         1.19         73,726 <br/>FT Nasdaq Food &amp; Bev         FTXG        21.86         10,358 <br/>Fluence Energy               FLNC        12.01      1,485,700 <br/>Fractyl Health               GUTS         1.55        496,484 <br/>GlucoTrack                   GCTK       0.7400     45,699,550 <br/>Green Plains                 GPRE         8.42        463,650 <br/>Greenidge Generation         GREE         1.24        216,856 <br/>Greenlane Holdings           GNLN         1.34         36,033 <br/>Huadi International          HUDI         1.47          4,903 <br/>Icon Energy                  ICON       0.3050      2,162,120 <br/>Immunovant                   IMVT        20.42        683,568 <br/>Interactive Strength         TRNR         1.85        166,456 <br/>iSpecimen                    ISPC         1.82        101,161 <br/>J&amp;J Snack Foods              JJSF       116.60        370,944 <br/>Johnson Outdoors Cl A        JOUT        28.19         60,888 <br/>Kyverna Therapeutics         KYTX         3.02        243,960 <br/>LanzaTech Global             LNZA       0.8200      1,138,600 <br/>Lexaria Bioscience Wt        LEXXW      0.2500          1,110 <br/>Liberty Lat America Cl C     LILAK        5.88        282,842 <br/>Lightwave Logic              LWLG         1.67        480,858 <br/>LogicMark                    LGMK         1.06        550,037 <br/>MGP Ingredients              MGPI        33.53        203,361 <br/>MKDWELL Tech                 MKDW       0.4521        103,539 <br/>Macrogenics                  MGNX         2.79        334,929 <br/>Maiden Holdings              MHLD       0.9500         54,194 <br/>Manhattan Associates         MANH       196.04        406,614 <br/>Maze Therapeutics            MAZE        13.77        462,864 <br/>Moleculin Biotech            MBRX         1.24        100,158 <br/>Mondelez Intl Cl A           MDLZ        55.88      8,095,965 <br/>Monro                        MNRO        18.29        397,245 <br/>Mustang Bio                  MBIO         3.56        117,742 <br/>NIP Group ADR                NIPG         3.31        129,511 <br/>NWTN Wt                      NWTNW      0.0110        137,926 <br/>National Beverage            FIZZ        40.41         65,340 <br/>Neogen                       NEOG        10.61      1,341,818 <br/>ODP                          ODP         20.84        135,164 <br/>Oatly Group ADR              OTLY       0.5424      3,844,956 <br/>Ocean Biomedical             OCEA       0.1560      3,165,648 <br/>Omega Therapeutics           OMGA       0.1423      8,559,822 <br/>OneConstruction Group        ONEG         2.07         16,552 <br/>Ovid Therapeutics            OVID       0.6500        276,038 <br/>Pasithea Therapeutics        KTTA         2.03          8,835 <br/>Performance Shipping         PSHG         1.53         99,726 <br/>Phathom Pharmaceuticals      PHAT         5.42        896,165 <br/>PowerUp Acquisition          PWUPU        9.81          9,678 <br/>PowerUp Acquisition          PWUP         9.00          3,037 <br/>Prime Medicine               PRME         2.53      1,105,788 <br/>Primega Group Holdings       PGHL       0.7688        268,276 <br/>Professional Diversity       IPDN       0.3300         28,498 <br/>Profound Medical             PROF         6.17         26,541 <br/>Protagenic Therapeutics      PTIX       0.3475         73,369 <br/>RF Acquisition               RFACU        5.16          5,001 <br/>Regeneron Pharmaceuticals    REGN       642.00      1,208,583 <br/>SAG Holdings                 SAG          2.00         82,212 <br/>SBC Medical Group Hldgs      SBC          4.82         17,164 <br/>SMX (Security Matters)       SMX          3.00        467,144 <br/>SRM Entertainment            SRM        0.3140        121,623 <br/>SaverOne 2014 ADR            SVRE       0.3610      3,126,387 <br/>Septerna                     SEPN        14.10        172,228 <br/>Sera Prognostics             SERA         4.61        120,010 <br/>SharpLink Gaming             SBET       0.3317        458,592 <br/>Spero Therapeutics           SPRO       0.7800        309,185 <br/>Starbox Group Cl A           STBX       0.3563        321,781 <br/>Stardust Power               SDST       0.7624      4,202,259 <br/>Steven Madden                SHOO        36.91        939,770 <br/>TNF Pharmaceuticals          TNFA       0.6400        194,319 <br/>TTEC Holdings                TTEC         3.50        103,444 <br/>Third Harmonic Bio           THRD         4.89         82,219 <br/>374Water                     SCWO       0.4401        199,203 <br/>Universe Pharmaceuticals     UPC        0.2723      1,608,501 <br/>Upstream Bio                 UPB          8.36        296,705 <br/>Utah Medical Products        UTMD        59.74         16,596 <br/>Vision Marine Techs          VMAR         1.12      1,213,618 <br/>Vodafone Group ADR           VOD          8.00     25,411,851 <br/>Windtree Therapeutics        WINT       0.1064      3,101,819 <br/>XBiotech                     XBIT         3.25         37,405 <br/>Zentalis Pharmaceuticals     ZNTL         1.61      1,334,389 <br/> <br/> <br/> <br/> <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009893:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009897:0",
            "title": "Houston Ship Channel Congested as Fog Continues to Hamper Vessel Movements — OPIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marine vessel traffic congestion was reported in the Houston Ship Channel as the region experienced fog and reduced visibility, which has hampered vessel movements over the past week.</p><p class=\"\">\"Areas of traffic congestion in the upper channel have developed following extended reduced visibility fog conditions,\" the U.S. Coast Guard on Tuesday, adding that it would \"meter traffic check in the upper channel and departing the Intracoastal Waterway.\"</p><p class=\"\">Houston and Galveston pilots have suspended and resumed boardings off and on starting at the end of January and into the start of February with dense fog hitting the region.</p><p class=\"\">Marine fuel suppliers in the U.S. Gulf Coast have warned that the fog season could result in delays for ships bunkering in the region and put days of notice between five to seven for very low sulfur fuel oil and high sulfur fuel oil.</p><p class=\"\">This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Reporting by Eric Wieser, ewieser@opisnet.com; Editing by Tom Sosnowski,   tsosnowski@opisnet.com and Editing by Michael Kelly, mkelly@opisnet.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009897:0/",
            "pub_date": "2025-02-05 04:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309215:0",
            "title": "Sector Update: Tech",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tech stocks were higher late Tuesday afternoon, with the Technology Select Sector SPDR Fund (XLK) climbing 1.3% and the SPDR S&amp;P Semiconductor ETF (XSD) rising 2.2%. </p><p class=\"\">The Philadelphia Semiconductor index added 0.8%. </p><p class=\"\">In corporate news, Spotify  on Tuesday issued an upbeat revenue outlook for Q1 after closing out its first full year of profitability. Its shares jumped 12%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309215:0-sector-update-tech/",
            "pub_date": "2025-02-05 04:22:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Tnw92rnWd:0",
            "title": "Focus Graphite Advanced Materials Progresses Tetepisca Project with Shipment of Ore for Processing at American Energy Technologies Co. Graphite Processing Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">February 4th, 2025 – TheNewswire - Ottawa, Ontario – Focus Graphite Inc. (TSX.V: FMS | OTCQX:FCSMF | FSE: FKC) (“Focus” or the“Company”), a developer of high-purity graphite resources,is pleased to announce that as part of its strategic focus on advancedmaterials and their capabilities, the Company has shipped multipledrums of ore from its second project called Tétepisca to AmericanEnergy Technologies Company (AETC) in Illinois for downstreamprocessing and analysis.</p><p class=\"\">The Tétepisca project, a graphite deposits in Quebec, has recentlyreceived significant effort from  Focus Graphite Advanced Materials.The Company has invested extensive time and resources into the mineralresource, completing 74 drill holes totaling 14,900.5 meters,including 27 definition holes along the strike of the deposit. Thisrobust dataset will be incorporated into an updated NI 43-101 MineralResource Estimate (MRE), scheduled for release later this year.</p><p class=\"\">The potential of Tétepisca to be a player in the North Americancritical minerals lies in its size and resource quality. The materialhas never been tested for processing, making this shipment to AETC acritical step in unlocking its full value. The sample drums, totalingapproximately two tons of ore, will be processed through AETC’sstate-of-the-art upstream and downstream graphite processing pilotplant to evaluate recoveries and gain critical insights into flakesize, purity, and mesh quality.</p><p class=\"\">Focus graphite will hire an independent Qualified Person to overseethe ore being processed through the pilot plant to ensure it meets theregulatory code and requirements under NI 43101 guidelines.</p><p class=\"\">Why AETC?  </p><p class=\"\">Located in Illinois, AETC is a leading small business specializing inadvanced materials processing. Its newly built Wheeling, Illinoisfacility is a fully functional pilot and graphite production plantequipped with advanced grinding, sizing, and processing equipment, aswell as high-temperature graphite-refining reactors. This plantreplicates the capabilities of a full-scale production facility,allowing Focus Graphite to gain detailed data at a fraction of thecost of building an on-site plant.</p><p class=\"\">With a reputation for collaborating with major industry players andthe U.S. military, AETC is uniquely positioned to provide valuableinsights into Tétepisca's potential as a critical supplier ofhigh-purity graphite for advanced technologies. AETC’s expertise inadvanced carbon materials, combined with its vertically integratedprocesses, ensures that the testing will deliver comprehensive data onthe quality and capabilities of Tétepisca’s graphite.</p><p class=\"\">A Strategic Step Forward  </p><p class=\"\">Dean Hanisch, CEO of Focus Graphite, stated:  </p><p class=\"\">“We have invested substantialresources into understanding the geology of the Tétepisca deposit,and now the focus shifts to determining what type of material can beproduced and how it performs during processing. This is an importantstep in evaluating the potential of Tétepisca to deliver high-puritygraphite at commercially viable levels. By partnering with AETC andleveraging their advanced processing capabilities, we’re not justtesting recoveries—we’re conducting multiple steps in oneintegrated process, including metallurgy, processing techniques, and afull characterization of the mesh sizes and their potential uses. Ifthe results meet our expectations, it may add significant value to thecompany, positioning Tétepisca as a player in the graphitemarket.”</p><p class=\"\">AETC’s Manager of Government Relations, Ms. Anna Doninger, wasquoted in saying: “We are very excited to open a new chapter in ourrelationship with Focus Graphite, Inc., now operated under the newmanagement and having set an ambitious graphite commercializationagenda for its Lac Knife and Tétepisca natural resources in Quebec.AETC has had the pleasure of getting to know Focus Graphite throughnumerous joint projects, beginning collaboration in2010. The Lac Knifeproject in Quebec is a high-grade open pit natural resource whichproduces a high-purity 98.2 wt%TGC mine-gate product. The company wasone of the first movers in the space with its first 2013 bindingofftake ahead of a 2014 DFS. Focus Graphite has completed some of themost detailed battery testing to date, reporting very high reversiblecapacity, along with excellent cycling performance for its Lac Knifeproducts, which studies will now be extended to include the vastTétepisca deposit, potentially making Focus the owner of the largestnatural graphite reserve in North America, to include well exceedingnatural graphite reserves of Alaska. We are glad that Focus Graphitehas partnered with AETC, looking to become a specialty graphitedownstream processor and a supplier of value-added graphite to OEMs.The capabilities of AETC’s newly built, state-of-the-art, dedicatedenergy systems and industrial graphite &amp; carbon processingfacility located in Wheeling, IL offer perfect alignment with theprocessing goals of Focus Graphite, Inc. It is inspiring to thinkwhere this new collaboration can lead our companies.”</p><p class=\"\">Focus Graphite remains dedicated to advancing its projects andexploring opportunities to partner with industry leaders in advancedmaterials and critical technologies.</p><p class=\"\">About Focus GraphiteInc.</p><p class=\"\">Focus Graphite Inc. is an advanced materials companydeveloping sustainable mining and technology innovations. At the heartof our operations is the Lac Knife flake graphite deposit, known forits  high purity and grade—ideal for applications in the military,defense, and green energy revolutions. Currently advancing throughCanada’s mine permitting process, Focus Graphite is on the verge oftransforming this resource into a viable supplier of criticalmineral.</p><p class=\"\">Our proprietary, environmentally sustainable processingtechnologies ensure a green, chemical-free pathway from mine tomarket. The Company’s proprietary silicon-enhanced spheroidizedgraphite patent technology is aimed at improving battery performance. We specialize in producing advanced, high-purity graphite materialstailored for diverse industries, including EV batteries, militaryapplications, and high-tech manufacturing.</p><p class=\"\">Focus Graphite’s commitment extends beyond resourceextraction—we are actively seeking partnerships with industryleaders, academic institutions, and government bodies to try andaccelerate the commercialization of advanced materials andtechnologies derived from our flagship project. As a proud Canadiancompany, we are dedicated to contributing to North America’s secureand sustainable critical minerals supply chain.</p><p class=\"\">For more information on Focus Graphite Inc. pleasevisit https://focusgraphite.com/  </p><p class=\"\">About American Energy TechnologiesCompany (AETC)  </p><p class=\"\">AETC is a U.S.-based leader in the research, development, andprocessing of advanced carbon materials for batteries, coatings,electronics, and other applications. Operating from its ArlingtonHeights, IL facility, AETC works with global partners to providecutting-edge solutions in advanced materials processing.</p><p class=\"\">Investors Contact: </p><p class=\"\">Dean Hanisch</p><p class=\"\">CEO, Focus Graphite Inc.</p><p class=\"\">dhanisch@focusgraphite.com </p><p class=\"\">613-612-6060 </p><p class=\"\">Cautionary NoteRegarding Forward-Looking Statements</p><p class=\"\">Certain statements contained in thispress release constitute forward-looking information. These statementsrelate to future events or future performance. The use of any of thewords “could,” “intend,” “expect,” “believe,”“will,” “projected,” “estimated,” and similar expressions,as well as statements relating to matters that are not historicalfacts, are intended to identify forward-looking information and arebased on the Company’s current beliefs or assumptions as to theoutcome and timing of such future events.</p><p class=\"\">In particular, this press releasecontains forward-looking information relating to, among other things,the Company’s plans to advance its Lac Knife and Tétépiscaprojects through permitting, resource development, andcommercialization efforts; the anticipated completion of an updated NI43-101 Mineral Resource Estimate for Tétépisca; the potential forLac Knife to become a key supplier of high-purity flake graphite; theCompany’s ability to secure off-take agreements and strategicpartnerships; the anticipated performance and scalability of theCompany’s proprietary silicon-enhanced spheroidized graphitetechnology; the expected benefits of its environmentally friendlypurification process; and the Company’s positioning as a key playerin securing North American critical mineral supply chains.</p><p class=\"\">Various assumptions or factors aretypically applied in drawing conclusions or making the forecasts orprojections set out in forward-looking information, including, inrespect of the forward-looking information included in this pressrelease, assumptions regarding the Company’s ability to obtainnecessary permits and approvals on anticipated timelines, thesuccessful execution of exploration and development programs, theviability and scalability of its proprietary graphite processingtechnologies, the ability to attract commercial partners, and thecontinuation of favorable market conditions for graphite demand inenergy storage, electric vehicles, and other advanced industrialapplications.</p><p class=\"\">Although forward-looking informationis based on reasonable assumptions made by the Company’s management,there can be no assurance that any forward-looking information willprove to be accurate. Forward-looking information involves known andunknown risks, uncertainties, and other factors which may cause actualresults, performance, or achievements to be materially different fromany future results, performance, or achievements expressed or impliedby such forward-looking information. Such factors include, amongothers, risks related to permitting and regulatory approvals; delaysor challenges in the exploration, development, or commercialization ofthe Company’s projects and technologies; changes in graphite marketdemand and pricing; technological and operational challenges in scaling up proprietaryprocessing technologies; financing risks; and the general risksinherent in the exploration and development of mineraldeposits.</p><p class=\"\">The forward-looking informationcontained in this release is made as of the date hereof, and theCompany is not obligated to update or revise any forward-lookinginformation, whether as a result of new information, future events, orotherwise, except as required by applicable securities laws. Becauseof the risks, uncertainties, and assumptions contained herein,investors should not place undue reliance on forward-lookinginformation.</p><p class=\"\">The TSX Venture Exchange and OTCQXhave not reviewed, approved, or disapproved the contents of this pressrelease.</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Tnw92rnWd:0-focus-graphite-advanced-materials-progresses-tetepisca-project-with-shipment-of-ore-for-processing-at-american-energy-technologies-co-graphite-processing-facility/",
            "pub_date": "2025-02-05 04:22:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSWphZVa:0",
            "title": "ToolsGroup Welcomes Supply Chain Leader Sean Elliott as Chief Executive Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">20-year industry veteran brings deep technical expertise and leadership to guide ToolsGroup's next phase of growth</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BOSTON, MA / ACCESS Newswire / February 4, 2025 /</strong> ToolsGroup, a global leader in supply chain and retail planning and optimization software, today announced the appointment of Sean Elliott as its new Chief Executive Officer, effective immediately.</p><p class=\"\">Elliott brings more than two decades of strategic leadership and technical expertise in supply chain software development and leadership to ToolsGroup. Most recently, he served as Co-CEO at Körber Supply Chain Software.</p><p class=\"\">At ToolsGroup, Elliott will focus on accelerating innovation, driving strategic business expansion, and strengthening its partnerships and ecosystem to deliver a best-in-class customer outcome and experience.</p><p class=\"\">\"We are thrilled to welcome Sean to ToolsGroup,\" said Andrew Zbella, Principal at Accel-KKR and member of the Board of Directors. \"His proven leadership, deep technical background and continued commitment to customer-centric innovation make him the ideal leader to lead ToolsGroup into its next chapter of growth and transformation.\"</p><p class=\"\">Over his 17-year tenure at Körber Supply Chain Software, Elliott held multiple leadership positions and spearheaded the development of innovative solutions to address the industry's most complex challenges. Before joining Körber Supply Chain Software, Elliott was the CTO at HighJump, a global supply chain software provider later acquired by Körber.</p><p class=\"\">\"I am honored to join ToolsGroup at this exciting moment in its journey,\" said Sean Elliott, CEO of ToolsGroup. \"The company has a remarkable heritage as a global leader in supply chain planning and is a pioneer in leveraging data science and AI to improve business performance. Our recent innovations in simulation, scenario planning, and global inventory rebalancing highlight ToolsGroup's continued commitment to providing category-leading solutions that address our customers' most significant needs and opportunities. I look forward to collaborating with our talented team to drive our vision and deliver exceptional value to our customers, partners, and stakeholders.\"</p><p class=\"\">Zbella added, \"We thank Inna Kuznetsova for her leadership over the last three years. In leading ToolsGroup, she made important strides in the company's journey by creating a customer-centric organization and integrating a global team. We are excited to see what the future holds for ToolsGroup under Sean's leadership.\"</p><p class=\"\">Kuznetsova expressed confidence in the transition, stating, \"It has been an incredible honor to lead ToolsGroup through three consecutive years of ARR and profitability growth, business transformation and innovation. I am very proud of what we have achieved together and have full confidence in the executive team's ability to continue driving the company forward to continued success in the years ahead.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ToolsGroup:</strong></p><p class=\"\">ToolsGroup's innovative AI-powered solutions enable retailers, distributors and manufacturers to navigate through supply chain uncertainty. Our retail and supply chain planning suites empower a new level of intelligent decision-making and unlock powerful business improvements in forecast accuracy, service levels and inventory - delighting customers and achieving financial and sustainability KPIs. Stay in touch with ToolsGroup on LinkedIn, and YouTube, or visit www.toolsgroup.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">Escalate PR for ToolsGroup</p><p class=\"\">toolsgroup@escalatepr.com</p><p class=\"\">1-914-610-0221</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> ToolsGroup</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSWphZVa:0/",
            "pub_date": "2025-02-05 04:16:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSP43XQa:0",
            "title": "Trane Expands Thermal Management System Capabilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Addition of advanced liquid cooling enhances Trane's thermal management systems portfolio</p><p class=\"\">DAVIDSON, NC / ACCESS Newswire / February 4, 2025 / Trane®- by Trane Technologies , a global climate innovator, proudly announces the expansion of its advanced thermal management systems tailored for mission critical environments. A global leader and trusted advisor in sustainable thermal management systems for commercial buildings and mission critical infrastructure, Trane is bolstering its data center thermal management systems with new liquid cooling capabilities and introducing the Trane Coolant Distribution Unit (CDU).</p><p class=\"\">\"We're excited to extend our thermal management systems offerings, testing, modeling and service leadership to include liquid cooling for our mission critical customers\" said Steve Obstein, Vice President and General Manager, Data Centers &amp; High-Tech, Trane Technologies. \"We are redefining thermal management systems and optimization to deliver consistent and reliable thermal management tailored for mission critical environments.\"</p><p class=\"\">Trane liquid cooling solutions are engineered to provide precise thermal management by helping to control the delivery and return of coolant to IT racks and are specifically designed to handle high-performance workloads while significantly reducing energy consumption. Tested, validated, and certified, Trane's thermal management systems deliver optimized performance, driving energy efficiency and lowering operational costs.</p><p class=\"\">Trane's 1MW Coolant Distribution Unit (CDU) with up to 1350kWs is an ideal solution for data center environments seeking to implement direct-to-chip solutions as they shift to hybrid cooling. The Trane CDU leverages proven LiquidStack® technology to enhance Trane's comprehensive thermal management capabilities. This advanced system not only provides precise thermal management by controlling the delivery and return of coolant to IT racks but also integrates seamlessly with Trane's high-efficiency chillers. This integration optimizes performance for one of the key consumers of utility within the thermal management system, ensuring optimal energy efficiency. By combining cutting-edge liquid cooling technology with advanced system design, Trane is setting a new standard in sustainable and efficient thermal management for mission-critical environments.</p><p class=\"\">\"I'm thrilled that Trane is bringing LiquidStack high-performance CDU technology to its global network of customers seeking to uplevel their cooling strategies to meet the extraordinary heat rejection needs of AI,\" said Joe Capes, CEO, LiquidStack.</p><p class=\"\"># # #</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Trane</strong></p><p class=\"\">Trane - by Trane Technologies , a global climate innovator - creates comfortable, energy efficient indoor environments through a broad portfolio of heating, ventilating and air conditioning systems and controls, services, parts and supply. For more information, please visit www.trane.com or www.tranetechnologies.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Trane Technologies</strong></p><p class=\"\">Trane Technologies is a global climate innovator. Through our strategic brands Trane® and Thermo King®, and our portfolio of environmentally responsible products and services, we bring efficient and sustainable climate solutions to buildings, homes and transportation. For more on Trane Technologies, visit tranetechnologies.com.</p><p class=\"\">© 2025 Trane. All Rights Reserved.​​​​​​​</p><p class=\"\">All trademarks referenced in this document are the trademarks of their respective owners.</p><p class=\"\">View additional multimedia and more ESG storytelling from Trane Technologies on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Trane Technologies</p><p class=\"\">Website: https://www.3blmedia.com/profiles/trane-technologies</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Trane Technologies</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSP43XQa:0/",
            "pub_date": "2025-02-05 04:16:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009875:0",
            "title": "Oil Futures Mixed as China Plans Retaliatory Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009875:0/",
            "pub_date": "2025-02-05 04:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009876:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">1252 ET - Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p><p class=\"\">1149 ET - Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p><p class=\"\">1141 ET - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1010 ET - Lean hog futures on the CME are higher in early trading, with the most-active contract up 0.8%. Traders appear to be pulling back from the steep selling seen to start the week, with contract limits in today's session extended to 6 cents a pound after the limit-down close Monday, following a drop of 4 cents a pound. While the hog market recalibrates amid tariff turmoil, there exists fundamental pressure points for hog demand. Pork carcass cutout prices shed 94 cents per hundredweight on Monday, according to USDA data, following a strong start to 2025 pricewise. Live cattle futures are down 0.2%. (kirk.maltais@wsj.com)</p><p class=\"\">1008 ET - The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole says in a note. Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he says. Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat sceptical that the euro is bound for a major rally.\" The euro rises 0.2% to $1.0364. (renae.dyer@wsj.com)</p><p class=\"\">0956 ET - As the threat of U.S. tariffs on imports from Canada continues to loom, the ongoing uncertainty makes it challenging for small business owners to plan and make decisions on their operations, warns the Canadian Federation of Independent Business. The association, which represents about 100,000 members, said that as both countries catch their breath Canada still needs to focus on critical changes needed to prepare for the future. This, the federation suggests, means taking the opportunity now to bring in policies that improve the investment climate, reduce taxes, slash red tape and break down internal trade barriers in the country to ensure Canada is prepared no matter what external threats come its way. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0952 ET - CBOT grain futures are mixed, with traders maintaining a reserved approach as China responds to Trump tariffs with retaliatory measures of its own targeting energy exports among other things. The tariffs make no mention of raw soybeans, but traders are wondering nonetheless about whether China will curb its purchases. \"Remember, we are looking to see if there is any new commodity buying by China, versus just 'maneuvering to avoid tariffs,\" says Naomi Blohm of Total Farm Marketing in a note. The USDA announced a new flash sale of corn to South Korea for 132,000 metric tons. (kirk.maltais@wsj.com)</p><p class=\"\">0940 ET - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009876:0/",
            "pub_date": "2025-02-05 04:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009882:0",
            "title": "Tri-County Financial Group, Inc. Reports Fourth Quarter 2024 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tri-County Financial Group, Inc. Reports Fourth Quarter 2024 Financial Results</p><p class=\"\">PR Newswire</p><p class=\"\">MENDOTA, Ill., Feb. 4, 2025</p><p class=\"\">MENDOTA, Ill., Feb. 4, 2025 /PRNewswire/ — Tri-County Financial Group, Inc. (The Company)  today announced financial results for the fourth quarter of 2024.</p><p class=\"\">Net income for the fourth quarter of 2024 was $2.4 million ($1.00 per share), compared to $2.3 million ($0.94 per share) during the fourth quarter of 2023.  Net income was $10.4 million ($4.33 per share) for the twelve-month period ending December 31, 2024, compared to $10.0 million ($4.10 per share) during the same twelve-month period a year ago.</p><p class=\"\">Net interest income was $10.9 million during the quarter ended December 31, 2024, compared to $10.7 million in the same period of 2023, or a 2% increase.</p><p class=\"\">Non-interest income was $4.0 million for the fourth quarter of 2024, an increase of $0.2 million, or 5%, compared to $3.8 million during the quarter ended December 31, 2023.</p><p class=\"\">Non-interest expense was $11.9 million during the quarter ended December 31, 2024, compared to $11.6 million in the same period of 2023, an increase of $0.3 million, or 2.6%.</p><p class=\"\">Our investment portfolio consists entirely of debt securities classified as available-for-sale; therefore, unrealized gains and losses are fully reported on our balance sheet.  None of our securities are classified as held-to-maturity.  The investment portfolio decreased $31.1 million or 18% year over year and totaled $143.7 million at December 31, 2024.  The reduction of the securities portfolio in 2024 helped to reduce borrowings.</p><p class=\"\">Total loans slightly increased $1.6 million, or 0.1%, to $1.285 billion at December 31, 2024, from $1.284 billion at December 31, 2023. Nonperforming loans as a percent of total loans were 0.33% as of December 31, 2024, compared to 0.55% at December 31, 2023.</p><p class=\"\">The provision for credit loss had a provision of $0.1 million for the quarter ended December 31, 2024.  The allowance for credit loss ended at $14.4 million at December 31, 2024 and represented 1.12% of gross loans.  Asset quality continues to remain solid and charge offs remain low.</p><p class=\"\">Total deposits increased $26.6 million, or 2%, year-over-year. Approximately $49 million and $71 million consisted of brokered deposits at December 31, 2024 and 2023, respectively.  Federal Home Loan Bank (FHLB) advances were $67.9 million and $116 million at December 31, 2024 and 2023, respectively.</p><p class=\"\">The Company's capital levels remain solid as of December 31, 2024, with a Tier 1 leverage ratio of 10.26%.</p><p class=\"\">On December 10, 2024, the Board of Directors declared a regular dividend of $0.25 per share, payable January 9, 2025, to shareholders of record on December 31, 2024.</p><p class=\"\">In announcing the results, Tri-County Financial Group, Inc. President and CEO Tim McConville, stated, \"Our fourth quarter numbers reflected solid earnings with slight improvement in margins, which can be attributed to the Federal Reserve easing short-term interest rates in the latter part of 2024 and the yield curve finally returning to a more normal state.  Despite the challenging economic environment for financial institutions for the majority of 2024, solid earnings performance existed as we remain attentive to our loan and deposit strategies.  We remain diligent in monitoring our local competition to offer competitive rates while continuing to provide exceptional community banking services.  Our loan portfolio continues to remain strong with minimal charge-offs and we believe that our diversified balance sheet and lines of business continue to be well-positioned. Asset quality as measured by nonperforming loans to total loans is stable as we continue to see solid performance with our borrowers.\"</p><p class=\"\">Tri-County Financial Group, Inc. is the parent holding company for First State Bank, with offices in Mendota, Batavia, Bloomington, Champaign, Geneva, LaMoille, McNabb, North Aurora, Ottawa, Peru, Princeton, Rochelle, Shabbona, St. Charles, Streator, Sycamore, Waterman and West Brooklyn. First State Bank is the parent company of First State Mortgage Services, LLC and First State Insurance. Tri-County Financial Group, Inc. shares are quoted under the symbol TYFG and traded on OTCQX.</p><p class=\"\">Note:  This press release may contain forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995.  Actual results and trends could differ materially from those set forth in such statements due to various factors, including operating; legal and regulatory risks; changing economic and competitive conditions; and other risks and uncertainties.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>            TRI COUNTY FINANCIAL GROUP, INC. &amp; SUBSIDIARIES <br/>                   CONSOLIDATED STATEMENTS OF INCOME <br/>                      QUARTER ENDED DECEMBER 31ST <br/>              (Unaudited, 000s omitted, except share data) <br/> <br/>                                                  2024          2023 <br/> <br/>Interest Income                                 $   19,531    $   18,704 <br/>Interest Expense                                     8,584         8,048 <br/>--------------------------------------------  ------------  ------------ <br/>Net Interest Income                                 10,947        10,656 <br/>Provision for Credit Losses                             74          (76) <br/>--------------------------------------------  ------------  ------------ <br/>Net Interest Income After Provision for <br/> Credit Losses                                      10,873        10,732 <br/> <br/>Non-Interest Income                                  4,021         3,803 <br/>FDIC Assessments                                       170           173 <br/>Non-Interest Expenses                               11,680        11,425 <br/>--------------------------------------------  ------------  ------------ <br/>Income Before Income Taxes                           3,044         2,937 <br/> <br/>Applicable Income Taxes                                653           665 <br/>Security Gains (Losses)                                  -             - <br/>------------------------------------------    ------------  ------------ <br/>Net Income (Loss)                              $     2,391   $     2,272 <br/>                                              ============  ============ <br/> <br/>Basic Net Income Per Share                    $       1.00  $       0.94 <br/>Weighted Average Shares Outstanding              2,396,410     2,426,368 <br/> <br/> <br/>             TRI-COUNTY FINANCIAL GROUP, INC. &amp; SUBSIDIARIES <br/>                       CONSOLIDATED BALANCE SHEETS <br/>               (Unaudited, 000s omitted, except share data) <br/> <br/>ASSETS                                12/31/2024           12/31/2023 <br/>                                  -------------------  ------------------- <br/>Cash and Due from Banks           $            42,418  $            26,905 <br/>Federal Funds Sold                              2,558                1,113 <br/>Debt Securities <br/> Available-for-Sale                           143,735              174,846 <br/>Loans and Leases                            1,285,419            1,283,792 <br/> Less: Allowance for Credit <br/>  Losses                                     (14,444)             (15,990) <br/>                                  -------------------  ------------------- <br/>Loans, Net                                  1,270,975            1,267,802 <br/>Premises &amp; Equipment                           25,344               25,785 <br/>Intangibles                                     8,700                8,723 <br/>Other Real Estate Owned                           920                  101 <br/>Accrued Interest Receivable                     7,475                7,572 <br/>Other Assets                                   37,160               40,048 <br/>                                  -------------------  ------------------- <br/> <br/>       TOTAL ASSETS                 $       1,539,285    $       1,552,895 <br/>                                  -------------------  ------------------- <br/> <br/>LIABILITIES <br/>Demand Deposits                               170,545              172,986 <br/>Interest-bearing Demand Deposits              399,103              407,305 <br/>Savings Deposits                              202,410              206,446 <br/>Time Deposits                                 501,239              459,994 <br/>                                  -------------------  ------------------- <br/>       Total Deposits                       1,273,297            1,246,731 <br/>Repurchase Agreements                          22,679               22,488 <br/>FHLB and Other Borrowings                      67,917              116,000 <br/>Interest Payable                                   73                   73 <br/>Subordinated Debt                               9,834                9,810 <br/>                                  -------------------  ------------------- <br/>        Total Repos &amp; Borrowings              100,503              148,371 <br/>Other Liabilities                              21,680               20,914 <br/>Dividends Payable                                 611                  736 <br/>                                  -------------------  ------------------- <br/>          TOTAL LIABILITIES         $       1,396,091    $       1,416,752 <br/> <br/>STOCKHOLDERS' EQUITY <br/>Common Stock                                    2,394                2,422 <br/>Additional Paid-in-Capital                     21,212               22,456 <br/>Retained Earnings                             129,793              121,414 <br/>Accumulated Other Comprehensive <br/> Loss                                        (10,205)             (10,149) <br/>                                  -------------------  ------------------- <br/>          TOTAL STOCKHOLDERS' <br/>           EQUITY                             143,194              136,143 <br/> <br/>TOTAL LIABILITIES AND <br/> STOCKHOLDERS' EQUITY               $       1,539,285    $       1,552,895 <br/>                                  -------------------  ------------------- <br/> <br/>Book Value Per Share                   $        59.81       $        56.20 <br/>Tangible Book Value Per Share          $        56.18       $        52.60 <br/>Bid Price                              $        45.50       $        44.00 <br/>Period End Outstanding Shares               2,394,193            2,422,358 <br/> </pre><p class=\"\">View original content:https://www.prnewswire.com/news-releases/tri-county-financial-group-inc-reports-fourth-quarter-2024-financial-results-302368022.html</p><p class=\"\">SOURCE Tri-County Financial Group, Inc.</p><p class=\"\">/CONTACT: Lana Eddy, Secretary, leddy@firststatebank.biz, 815.538.2265</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009882:0/",
            "pub_date": "2025-02-05 04:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1XH:0",
            "title": "Citi trims Australia's NextDC PT on DeepSeek threat, lack of contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Citi sees the threat of lower spending arising from China's DeepSeek and an absence of new contracts to weigh on NextDC's  share price </p><p class=\"\">** Brokerage cuts PT on data centre landlord to A$18.70 from A$20.00. NXT closed at A$14.74 on Tuesday</p><p class=\"\">** Last month, Chinese startup DeepSeek launched a free AI assistant that it says uses less data at a fraction of the cost of incumbent services</p><p class=\"\">** The key concern/question is whether DeepSeek's algorithmic and engineering improvements have changed the long term demand for compute - Citi</p><p class=\"\">** Brokerage also calls a lack of large contract announcements a key reason for share price weakness</p><p class=\"\">** 15 analysts rate the stock \"buy\" or higher; their median PT is A$20.00 – LSEG data</p><p class=\"\">** Stock down 2.2% this year, as of last close</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1XH:0-citi-trims-australia-s-nextdc-pt-on-deepseek-threat-lack-of-contracts/",
            "pub_date": "2025-02-05 04:19:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309211:0",
            "title": "Sector Update: Financial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Financial stocks were mixed in late Tuesday afternoon trading with the NYSE Financial Index up 0.2% and the Financial Select Sector SPDR Fund (XLF) easing 0.2%. </p><p class=\"\">The Philadelphia Housing Index gained 0.9%, and the Real Estate Select Sector SPDR Fund (XLRE) fell 0.1%. </p><p class=\"\">Bitcoin (BTC/USD) declined 2.8% to $98,543, and the yield of 10-year US Treasuries dropped 3 basis points to 4.51%. </p><p class=\"\">In economic news, China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. </p><p class=\"\">US job openings fell to 7.6 million in December, according to the Bureau of Labor Statistics, lower than the 8 million expected in a Bloomberg survey. </p><p class=\"\">In corporate news, a group of banks led by Morgan Stanley  is prepared to boost a sale of loans tied to social media platform X after receiving stronger-than-expected demand from investors, Bloomberg reported. Morgan Stanley shares fell 0.2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309211:0-sector-update-financial/",
            "pub_date": "2025-02-05 04:19:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0WT:0",
            "title": "US yields dip on tariff uncertainty; investors want policy clarity",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US JOLTS report shows lower job openings</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US factory orders drop</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US yield curve slightly flattens as bond market stabilizes</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Long-dated sell-off due to higher term premium -analyst</li></ul></span></div><span><p class=\"\">    U.S. Treasury yields slipped on Tuesday in volatile trading, weighed down by persistent uncertainty surrounding the administration's trade policy after a slew of headlines on tariffs ended up with Canada and Mexico getting 30-day reprieves on those duties.</p><p class=\"\">U.S. President Donald Trump on Monday suspended his threat of 25% tariffs on Mexico and Canada at the last minute, agreeing to a 30-day pause in return for concessions on border and crime enforcement.</p><p class=\"\">China, on the other hand, imposed targeted tariffs on American imports on Tuesday and put several companies, including Google, on notice for possible sanctions, in what market participants described as a measured response to an additional 10% U.S. tariff on Chinese exports.</p><p class=\"\">China's new tariffs will not take effect until Feb. 10, giving Washington and Beijing time to try to seek a deal that Chinese policymakers have indicated they hope to reach with Trump.</p><p class=\"\">\"There's going to be that push and pull throughout the next couple of quarters as the market gets used to the tariffs and threats: what's actionable and what's just bluster,\" said Lawrence Gillum, chief fixed income strategist, at LPL Financial in Fort Mill, South Carolina.</p><p class=\"\">    Treasury yields earlier fell after data showing U.S. job openings dropped sharply in December. The Bureau of Labor Statistics' Job Openings and Labor Turnover Survey, or JOLTS report showed that job openings, a measure of labor demand, slid to 7.6 million on the last day of December. </p><p class=\"\">In afternoon trading, the benchmark 10-year yield was last down 2.8 basis points (bps) at 4.515% , after dropping on Monday to its lowest since mid-December.</p><p class=\"\">    \"I still think the 10-year yield could hit below 4% later this year, but that's really predicated on a slowing economy,\" said Gillum. \"If data continues to hold up, there's no reason that we can't trade between 4.50% to 5%.\"  </p><p class=\"\">    U.S. 30-year yields also slid to 4.751%, down 2 bps (US30YT=RR).  </p><p class=\"\">    On the short end of the curve, U.S. two-year yields, which are tied to the Federal Reserve's policy moves, fell 5.1 bps to 4.214% (US2YT=RR).</p><p class=\"\">Also helping push the two-year yield down was a report showing new orders for U.S.-manufactured goods dropped 0.9% in December after a revised 0.8% decline in November. Economists polled by Reuters had forecast factory orders would fall 0.7% after a previously reported 0.4% drop in November.</p><p class=\"\">The yield curve, meanwhile, flattened modestly on Tuesday, with the gap between two-year and 10-year yields at 29.7 bps (US2US10=TWEB), from 30.2 bps in the previous session. The curve hit its narrowest since late December on Monday after the initial tariff announcements.</p><p class=\"\">Investors have been selling the long end of the curve, demanding higher compensation, or the so-called \"term premium,\" in exchange for dealing with policy uncertainty over a longer time horizon. The current term premium for U.S. 10-year notes stood at 72 bps, according to estimates from the St. Louis Fed, compared with about 45 bps in early December.</p><p class=\"\">\"You expect yields to fall further, but that lack of clarity on policy is really giving intermediate and long-term investors more pause,\" said Chip Hughey, managing director of fixed income, at Truist Advisory Services in Richmond, Virginia.</p><p class=\"\">U.S. rate futures, meanwhile, have priced in about 46 bps of easing this year, or nearly two rate cuts of 25 bps each. That was up from 41 bps late on Monday, according to LSEG calculations, with the first rate cut likely happening at the Fed's June or July policy meeting.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:852.0000000000001px;aspect-ratio:1.4200000000000002\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0WT-1b2c688746dc6282bf8dbbfb9333c3db-resized.webp\" type=\"images/webp\"/><img alt='A line chart titled \"US yield curve\" that tracks the metric over time.' class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0WT-1b2c688746dc6282bf8dbbfb9333c3db-resized.jpeg\" style=\"background-color:#fafafb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">US yield curve</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0WT:0-us-yields-dip-on-tariff-uncertainty-investors-want-policy-clarity/",
            "pub_date": "2025-02-05 04:19:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8b81f881d1e8a:0",
            "title": "Williams Companies Officer Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Wilson Terrance Lane</td></tr><tr><td>Relationship</td><td>SVP &amp; General Counsel</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$109,840</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1703388/000010726325000002/xslF345X05/wk-form4_1738700186.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Wilson Terrance Lane, SVP &amp; General Counsel of Williams Companies, sold 2,000 shares of Common Stock on February 3, 2025, at a price of $54.92 per share, totaling $109,840. Following the transaction, Lane directly owns 296,200 shares of the company. The sale was executed under a 10b5-1 Sales Plan established on June 14, 2024.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1703388/000010726325000002/xslF345X05/wk-form4_1738700186.xml\" rel=\"nofollow\" target=\"_blank\">WILLIAMS COMPANIES, INC. [ WMB ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:8b81f881d1e8a:0-williams-companies-officer-sells-shares/",
            "pub_date": "2025-02-05 04:20:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009882_20250204009887:0",
            "title": "Tri County Financial 4Q Net $2.39M >TYFG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009882_20250204009887:0/",
            "pub_date": "2025-02-05 04:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009882_20250204009886:0",
            "title": "Tri County Financial 4Q Basic EPS $1.00 >TYFG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009882_20250204009886:0/",
            "pub_date": "2025-02-05 04:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}