{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463416:0",
            "title": "Mitsubishi Heavy Industries' Nine Month Profit Soars 25%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitsubishi Heavy Industries  profit attributable to owners of the parent rose 24.7% to 172.1 billion yen in the fiscal nine months ended Dec. 31, 2024 from 138.0 billion yen a year ago. </p><p class=\"\">The engineering firm's earnings per share (EPS) increased to 51.21 yen from 41.08 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Revenue grew 8.8% to 3.548 trillion yen from 3.261 trillion yen a year earlier. Order intake increased 10.5% year-on-year to 4.969 trillion yen in the three quarters under review. </p><p class=\"\">The group raised its full-year profit outlook, citing solid business performance. </p><p class=\"\">It forecasted attributable profit to grow 8.1% to 240 billion yen or 71.40 yen per share and net sales to gain 7.4% to 5 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a year-end dividend of 11.00 yen per share for the current fiscal year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463416:0/",
            "pub_date": "2025-02-04 18:27:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002880:0",
            "title": "Steven Madden Is Maintained at Market Perform by Telsey Advisory Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:29 GMT) </strong>Steven Madden Price Target Cut to $44.00/Share From $50.00 by Telsey Advisory Group</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002880:0/",
            "pub_date": "2025-02-04 18:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002882:0",
            "title": "BOE Could Signal A Rate Cut in March at Thursday's Decision — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of England is widely expected to cut interest rates when it announces a decision Thursday, and it could hint at another interest-rate cut in March, Berenberg's senior economist Andrew Wishart says in a note. \"Until now, the BOE has cut at alternate meetings, but a stagnating economy and declining employment argue for more urgent action,\" he says. Markets price in a total of 30 basis points of interest-rate cuts in February and March, LSEG Refinitiv data show. \"It is sensible for the BOE to lower interest rates to prevent a larger drop in [U.K.] employment,\" Wishart says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002882:0/",
            "pub_date": "2025-02-04 18:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308421:0",
            "title": "China Renaissance Adjusts Price Target on Meta Platforms to $800 From $660, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms  has an average rating of buy and mean price target of $749.49, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308421:0/",
            "pub_date": "2025-02-04 18:29:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308422:0",
            "title": "Daiwa Securities Adjusts Price Target on Meta Platforms to $800 From $670, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms  has an average rating of buy and mean price target of $749.49, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308422:0/",
            "pub_date": "2025-02-04 18:29:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308423:0",
            "title": "New Street Adjusts Price Target on Meta Platforms to $790 From $685, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms  has an average rating of buy and mean price target of $749.49, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308423:0/",
            "pub_date": "2025-02-04 18:29:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002887:0",
            "title": "Are Markets Underestimating the Tariff Problem? — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jon Sindreu</p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\">Midmorning on Monday, Mexican President Claudia Sheinbaum said that the U.S. had agreed to a one-month delay before slapping a 25% tariff on its goods. Then, after the stock market had closed, Canada's Prime Minister Justin Trudeau announced a similar reprieve. Both countries have agreed to reinforce their borders and crack down on fentanyl smuggling.</p><p class=\"\">The S&amp;P 500 ended the day down 0.8%. The Stoxx Europe 600 lost only 0.9%, though it inched lower again early on Tuesday, probably spooked by China's unveiling of its own retaliatory tariffs.</p><p class=\"\">Even before the detente was announced, however, Monday's selling hadn't gotten too dramatic. With the truce in place, shares in many of the companies directly affected by the tariffs ended up only slightly lower than where they had started. These included Ford and General Motors, which make cars in Mexico that they then sell to American consumers. The Canadian dollar and the Mexican peso rebounded and ended up rising against the U.S. dollar.</p><p class=\"\">This served as validation for the optimists on Wall Street, who have insisted on seeing Trump's tariff threats to nations other than China as mere negotiating tactics to extract concessions on issues such as illegal migration and drug trafficking.</p><p class=\"\">Such a view is mainstream in financial markets, as suggested by the peso not underperforming peer currencies since the Nov. 5 election, or the Stoxx Europe 600 rising about 5% since the start of the year, despite the threat of duties being levied on goods coming from the European Union.</p><p class=\"\">Trump's negotiating style is indeed predicated on an initial display of strength. Last month, Colombia agreed to repatriate migrants in exchange for escaping tariffs and economic sanctions, and something similar may play out this time.</p><p class=\"\">But it could be dangerous to blindly trust that it always will.</p><p class=\"\">It has now become obvious that Trump's current protectionist policies are significantly more extreme than the ones he introduced in his first term. Back then, he focused on unfair trade practices and national security, with tariffs primarily levied on China and beyond that largely limited to specific goods and industries such as steel, aluminum and household appliances. They were also gradually introduced, giving businesses time to adapt. Yes, global manufacturing output came under pressure in 2019, but it had gotten a small boost in 2018 as firms stockpiled inventories.</p><p class=\"\">This time, if targeted countries refuse to yield, U.S. effective tariff rates could suddenly become the highest since the late 1930s. On top of hitting domestic growth and spurring inflation, this could derail a network of complex supply chains which, as the pandemic showed, can have unpredictable effects.</p><p class=\"\">Worse, the chances of this happening seem higher when trying to strong-arm long-term allies with robust democratic systems than when dealing with the likes of China, since it is unclear how much public-facing leaders will be allowed to back down.</p><p class=\"\">Take Canada, which despite being knee-deep in a political crisis has responded to the threat of tariffs with newfound unity across the political spectrum, from Trudeau's center-left party to those on the right formerly seen as close to Trump's positions, such as Ontario Premier Doug Ford. He has pledged to pull U.S.-made alcohol from shelves in his province, and scrapped a high-speed internet contract he had signed with Elon Musk's Starlink.</p><p class=\"\">Regardless of the final policy outcomes, U.S. producers could face a long-lasting backlash from consumers in impacted countries. Furthermore, the experience of the U.K. post-Brexit also shows that the mere uncertainty of on-again-off-again disruptions, and extended negotiations, forces firms into a defensive mode and weighs on business investment.</p><p class=\"\">This would be done for no long-term economic benefit. Contrary to usual textbook claims, shifting the site of production of complex tradable goods through tariffs can have positive effects, if done selectively while supporting investment by export-oriented firms — as opposed to the pure \"import substitution\" pursued by Latin America in the 1950s and 1960s. Promoting U.S.-made electric vehicles relative to cheaper Chinese competitors, for example, is one of their present reasonable uses.</p><p class=\"\">But the new slate of proposed tariffs has no such concrete economic goals in mind: It is just designed to shock. Canada, for one, buys more goods from the U.S. than it sells — including cars — not accounting for energy. Other tariffs proposed by Trump, such as on intermediate goods like semiconductors, could be even more damaging to U.S. industry.</p><p class=\"\">Finally, consider this: By being too blasé about tariffs, investors have already raised the chances that the U.S. administration will step closer to the edge, confident that markets have signaled that the outcome won't be too punishing. With the S&amp;P 500 trading at a steep 22 times earnings, the shift from \"America first\" to \"tariffs first\" is something to be very weary about.</p><p class=\"\">Write to Jon Sindreu at jon.sindreu@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002887:0/",
            "pub_date": "2025-02-04 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002886:0",
            "title": "Amazon, King of Online Retail, Can't Seem to Make Its Physical Stores Work — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kate King</p><p class=\"\">Amazon.com, the largest e-commerce retailer in the U.S., is stumbling in its efforts to compete in the bricks-and-mortar world.</p><p class=\"\">The company in 2018 launched the Amazon Go convenience store, where customers can grab a latte, bagel or turkey sandwich and walk out without waiting in line to pay. Amazon charges them electronically.</p><p class=\"\">But with the Amazon Go store in Woodland Hills, Calif., closing this month, the retailer has shrunk its Go portfolio by about half since early 2023, to 16 stores in four states. Instead, Amazon is focusing on licensing its \"Just Walk Out\" technology to other retailers.</p><p class=\"\">This is hardly Amazon's only misfire in the physical-store universe. It has closed dozens of its other branded retail stores in recent years, including bookstores, fashion outlets and its \"4-star\" locations stocked with bestselling items from its website.</p><p class=\"\">After a decadelong experiment with bricks-and-mortar stores, Amazon's dominance online has yet to translate into a successful strategy for connecting with shoppers in the real world, retail brokers and landlords said.</p><p class=\"\">\"They keep testing these concepts thinking one of them is going to connect with the consumer in a big way,\" said Jeff Edison, chief executive of Phillips Edison &amp; Co., a real-estate investor that owns grocery-anchored shopping centers. \"But can you think of any examples where they've actually done the bricks-and-mortar retail well? I can't.\"</p><p class=\"\">Amazon Go stores were launched to develop technology that speeds up the buying process while saving on labor costs. They use cameras and sensors to track customer purchases instead of a traditional checkout counter.</p><p class=\"\">But reducing the number of employees available to help customers and giving priority to credit-card payments over cash limits sales and makes the shopping experience more cumbersome, said Nick Egelanian, president of retail-advisory firm SiteWorks Retail.</p><p class=\"\">\"I don't think they really understand retail,\" Egelanian said. \"Running warehouses and shipping stuff efficiently is not the same as greeting a customer and saying, 'May I help you?'\"</p><p class=\"\">An Amazon spokeswoman said Go store employees greet customers at the door, restock shelves and are available to answer questions.</p><p class=\"\">While certain locations work better than others, the company continues to invest in its Go stores, including a recent redesign of its suburban store in Mill Creek, Wash., where it added more items such as made-to-order pizza. Amazon also opened a new Go store in Bellevue, Wash., last summer.</p><p class=\"\">\"Amazon aims to provide customers outstanding selection, value, and convenience when shopping for groceries and everyday essentials both online and in physical stores,\" Amazon spokeswoman Jessica Martin said.</p><p class=\"\">And while Amazon is tops for online revenue, its sales at bricks-and-mortar stores, including Whole Foods Market, have grown annually since 2021 as well as in the first nine months of 2024, according to the company's financial filings. Net sales in the third quarter of 2024 topped $5.2 billion, compared with about $61.4 billion at Amazon's online store.</p><p class=\"\">But Amazon Go competes in a crowded field. There are more than 152,000 convenience stores in the U.S., according to industry group NACS, many of which also sell coffee, alcohol and freshly prepared food.</p><p class=\"\">Amazon seemed to hedge its bets on Go from the start, making sure it wasn't locked into locations long term.</p><p class=\"\">The company negotiated hard for short-term leases or those with early-exit provisions, said Ed Coury, senior managing director at retail-advisory firm RCS Real Estate Advisors, who worked on a deal to open a 4-Star location at the Westfield Topanga mall in California. He calls that a \"risk averse\" approach to real estate.</p><p class=\"\">Developing and testing its Just Walk Out technology capabilities was a driving reason behind Amazon's rollout of its Go concept, Coury said, and as the technology improved the stores were less necessary.</p><p class=\"\">Amazon now licenses its Just Walk Out technology to more than 200 retailers, including colleges and universities, sports arenas, hospitals and airports. This allows it to profit by marketing the technology without the cost burden of operating a store.</p><p class=\"\">\"It was an investment well spent in developing technology,\" Coury said. \"But the growth plans that they had for that brand are over.\"</p><p class=\"\">Amazon's bricks-and-mortar retail strategy now seems to be focused on its grocery portfolio.</p><p class=\"\">The company acquired Whole Foods Market for roughly $13.5 billion in 2017 and last week announced that the grocer's chief executive, Jason Buechel, is now in charge of all grocery operations for Amazon, including its Fresh and Go stores.</p><p class=\"\">Amazon is moving forward with plans to open more locations for Amazon Fresh, which offers a more mass-market selection with often cheaper prices than upscale Whole Foods, after pausing expansion to overhaul the in-store experience. The stores have replaced its Just Walk Out technology with \"dash carts,\" where shoppers scan items before placing them in the cart.</p><p class=\"\">Amazon's changes to its Fresh stores have improved the shopping experience there, Egelanian said, though he feels the banner is still searching for a niche in the crowded grocery landscape.</p><p class=\"\">Write to Kate King at kate.king@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002886:0/",
            "pub_date": "2025-02-04 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308424:0",
            "title": "Invivyd Shares Soar Premarket After Tripling Monday Following Initial Results From COVID-19 Vaccination Alternative",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Invivyd  shares extended gains in premarket activity Tuesday after the company disclosed \"positive\" data from an ongoing phase 1/2 trial of a monoclonal antibody candidate designed to be a \"superior alternative\" to COVID-19 vaccination for the broad population. </p><p class=\"\">Phase 1/2 clinical data for VYD2311 to date were \"positive\" for both safety and pharmacokinetics and supported by antiviral activity, the company said Monday. Pooled, blinded adverse events to date were \"mild or moderate.\" As of Day 65, serum concentrations remained high with a half-life not yet reached, indicating the potential long clinical dosing interval. </p><p class=\"\">Invivyd said the trial has fully enrolled, and all planned doses have been administered, with only long-term follow-up remaining. </p><p class=\"\">The company added that VYD2311 is designed to be \"frontline\" protection in a convenient form while providing a \"potent, long-acting option for the treatment of COVID-19.\"</p><p class=\"\">Invivyd shares traded 26% higher in premarket activity after almost tripling in Monday's regular trading session.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308424:0/",
            "pub_date": "2025-02-04 18:30:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr7Y6fWk:0",
            "title": "Cessatech receives positive Notified Body opinion under MDR for CT001",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Cessatech<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">CT001 receives positive opinion during the Medical Device Regulation (MDR) approval process.</li><li class=\"listItem-bmN0_SHH\">Confirms that CT001 meets the General Safety and Performance Requirements of the MDR.</li><li class=\"listItem-bmN0_SHH\">An important milestone for Cessatech's EMA filing, planned for later this year - and highlights Cessatech's commitment to quality and evidence-based treatments.</li></ul><p class=\"\">On 4 February (11.30) – Cessatech A/S (“Cessatech” or “the Company”) announces that the Company has received a positive Notified Body Opinion under Article 117 of the Medical Devices Regulation (EU) 2017/745 (MDR) for its lead asset CT001. The technical documentation for CT001 was reviewed in accordance with Annex I of Regulation (EU) 2017/745. The assessment has been performed for the purpose of an initial application – and the objectives of this assessment were found to have been met. Technical documentation for the device is considered adequate to support compliance with the General Safety and Performance Requirements of the MDR.</p><p class=\"\">The MDR opinion ensures medical devices with a drug component are safe and effective. The EMA reviews the drug part, while a Notified Body evaluates the device. Together, they ensure the product meets EU efficacy and safety standards.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Martin Juhl, CSO, Cessatech</strong></p><p class=\"\">We are very proud to have received this positive opinion from the Notified Body. It is a testament to the team’s dedication to scientific rigor and quality in meeting MDR requirements. We are pleased that the quality of our technical documentation and approach has been recognized through this positive opinion. As a side note, this marks the first time a company has used the Interactive Online Review Process through the selected Notified Body organization for Article 117, which underscores our commitment to innovation and improved efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jes Trygved, CEO, Cessatech</strong></p><p class=\"\">The MDR assessment is a major achievement for the Company and is an integrated part of the EMA approval process of CT001. We are now one important step closer to getting CT001 approved in Europe for children aged 1-17 years old, together with our commercial partner Proveca. Since the introduction of the MDR process in 2021, it is estimated that some +3,000 certificates and opinions have been completed in Europe, while there is still a large backlog of some 3-4000 pending – it is an amazing effort that we completed our assessment within the estimated timeframe. Thanks to all for an amazing effort.</p><p class=\"\">For more information about Cessatech, please contact:</p><p class=\"\">Jes Trygved, CEO</p><p class=\"\">Phone: +45 9387 2309</p><p class=\"\">E-mail: jes.trygved@cessatech.com</p><p class=\"\">www.cessatech.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cessatech</strong></p><p class=\"\">Cessatech A/S is a Danish pharmaceutical company committed to developing and commercializing evidence-based and innovative medicines for children for the treatment of paediatric acute pain. Its lead asset (CT001) is an analgesic nasal spray for the treatment of acute and planned painful procedures in children. The advantages include needle-free administration, easy administration, a fast-acting therapeutic effect, and being medically approved for children. CT001 is at its pivotal stage of clinical development, and CT002 is at the early development phase.</p><p class=\"\">https://news.cision.com/cessatech/r/cessatech-receives-positive-notified-body-opinion-under-mdr-for-ct001%2Cc4100160</p><p class=\"\">250204 - MDR assesment</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr7Y6fWk:0-cessatech-receives-positive-notified-body-opinion-under-mdr-for-ct001/",
            "pub_date": "2025-02-04 18:30:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr2Q6V9r:0",
            "title": "Nokian Tyres plc: Management Team as of March 1, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Nokian Tyres<p class=\"\">Nokian Tyres plc Stock Exchange Release February 4, 2025, at 12:30 p.m. EET</p><p class=\"\">Nokian Tyres is making changes to the Management Team to increase consumer focus, global synergies and operational excellence. New members joining the Management Team are Tommi Alhola (Passenger Car Tyres, Central Europe) and Lauri Halme (Passenger Car Tyres, North America). The new Management Team will take effect as of March 1, 2025.</p><p class=\"\">\"To shape the future of our company, we are reorganizing our operations to create a more customer-centric organization while strengthening our central functions,\" says Paolo Pompei, President and CEO of Nokian Tyres.</p><p class=\"\">While maintaining its leading position in the Nordics, Nokian Tyres' strategic growth markets are in Central Europe and North America.</p><p class=\"\">\"The new Management Team structure will enable a dedicated focus on these growth regions to achieve our long-term objectives. The investments made in recent years will enable us to adopt a local-for-local business model, with dedicated manufacturing facilities closer to our customers and consumers.\"</p><p class=\"\">\"Our clear target is to achieve global synergies and operational excellence in everything we do. As part of this, we will reorganize all manufacturing facilities under one leadership and combine Marketing and Communications in one strategic global function,\" Pompei continues. <strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nokian Tyres' Management Team as of March 1, 2025:</strong></p><p class=\"\">Paolo Pompei, President and CEO</p><p class=\"\">Niko Haavisto, CFO</p><p class=\"\">Tommi Alhola, SVP, Passenger Car Tyres, Central Europe</p><p class=\"\">Elisa Erkkilä, SVP, Legal and Compliance, General Counsel</p><p class=\"\">Lauri Halme, SVP, Passenger Car Tyres, North America</p><p class=\"\">Adrian Kaczmarczyk, SVP, Operations</p><p class=\"\">Jukka Kasi, SVP, Products and Innovations</p><p class=\"\">Päivi Leskinen, SVP, Human Resources</p><p class=\"\">Manu Salmi, EVP, Heavy Tyres; SVP, Manufacturing (interim) </p><p class=\"\">Päivi Antola, SVP, Communications, Investor Relations and Brand, is leaving Nokian Tyres to join another company. A search for SVP, Marketing and Communications is in progress.</p><p class=\"\">CVs of the Management Team members can be found: company.nokiantyres.com/investors/corporate-governance/group-management-team/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information and interview requests:</strong></p><p class=\"\">media@nokinatyres.com or tel. +358 10 401 7361</p><p class=\"\">investors@nokiantyres.com</p><p class=\"\">Nokian Tyres' purpose is to make the world safer by reinventing tires, and how they are made, over and over again - a safer place to drive, work and live now and for generations to come. Inspired by our northern heritage, we develop and manufacture premium tires for passenger cars, trucks and heavy machinery with sustainability at the heart of all our operations. Our Vianor chain provides tire and car services. We are some 3,400 people with net sales of EUR 1.2 billion in 2023, and together we lead the journey to smarter driving for people and for businesses. Nokian Tyres is listed on Nasdaq Helsinki. Further information:<em> </em><em>company.nokiantyres.com</em></p><p class=\"\">https://news.cision.com/nokian-tyres/r/nokian-tyres-plc--management-team-as-of-march-1--2025%2Cc4100134</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr2Q6V9r:0-nokian-tyres-plc-management-team-as-of-march-1-2025/",
            "pub_date": "2025-02-04 18:30:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446527:0",
            "title": "The SENSEX Index Closes 1.76% Higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In Mumbai,  the SENSEX Index rose 1357 points or 1.76 percent on Tuesday.</p><p class=\"\">Leading the gains are Larsen &amp; Toubro (4.56%), Indusind Bank (3.40%) and Reliance Industries (3.15%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446527:0-the-sensex-index-closes-1-76-higher/",
            "pub_date": "2025-02-04 18:30:16",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308426:0",
            "title": "China Renaissance Adjusts Price Target on Microsoft to $511 From $506, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Microsoft  has an average rating of buy and mean price target of $508.60, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308426:0/",
            "pub_date": "2025-02-04 18:30:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002842:0",
            "title": "Crest Nicholson Plans New Strategy for Growth, Shareholder Returns — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony O. Goriainoff</p><p class=\"\">Crest Nicholson is planning new strategic priorities to deliver sustainable growth and shareholder returns, but warned that slower-than-expected interest-rate cuts are weighing on the housing market.</p><p class=\"\">The London-listed housebuilder said Tuesday that it saw an improvement in sales in recent weeks but higher-for-longer interest rates are affecting the conversion of interest into sales.</p><p class=\"\">Chief Executive Martyn Clark, who has been reviewing the business since he started the role in June, said that despite current economic and political challenges, he is cautiously optimistic about the year ahead with pent-up demand from customers.</p><p class=\"\">Clark said he plans to set out a new strategic focus for the group in March, designed to \"optimize the company for sustainable growth with an appropriately scaled cost base that will enhance profitability and consistent shareholder value creation.\"</p><p class=\"\">For the year ended Oct. 31, the company reported a pretax loss of 143.7 million pounds ($178.9 million), compared with a loss of 23.1 million pounds the year before. The company booked an exceptional pretax charge of 166.1 million pounds related to fire-remediation provisions.</p><p class=\"\">Revenue fell to 618.2 million pounds from 657.5 million pounds, as home completions fell to 1,873 from 2,020 the year prior. The company said this was due to a weak order book at the start of the fiscal year on low levels of confidence in the housing market.</p><p class=\"\">For the year ahead, the company is forecasting a pretax profit of 28 million to 38 million pounds.</p><p class=\"\">It said the forward order book at the end of January stood at 1,051 units.</p><p class=\"\">The board proposed a final dividend of 1.2 pence a share, down from 11.5 pence a share for fiscal 2023, taking the total for the year to 2.2 pence, down from 17 pence.</p><p class=\"\">Shares were down 0.40 pence, or 0.2%, at 174.70 pence in late morning European trading. They are currently up 3.4% in the year to date and 4% higher over the past three months.</p><p class=\"\">Write to Anthony O. Goriainoff at anthony.orunagoriainoff@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002842:0/",
            "pub_date": "2025-02-04 18:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463412:0",
            "title": "Helix Exploration to Begin Well Acidization at Ingomar Dome Project in US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Helix Exploration  is set to start the acidization at its Clink #1 well at its Ingomar Dome project in the US, according to a Tuesday release. </p><p class=\"\">The UK-based helium exploration company will begin the 10-day test in mid-February, with Petroleum Consultants managing contractors at the site. The test will be conducted to trigger and flow test the project's Charles Formation limestone reservoir. </p><p class=\"\">Meanwhile, the company will conduct drilling activities for more wells at its Rudyard project in the second quarter. The additional wells aim to improve raw helium gas supplies to its processing plant.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463412:0/",
            "pub_date": "2025-02-04 18:22:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204005053:0",
            "title": "Palantir bear Morgan Stanley upgrades rating but still doesn't call AI firm a buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Goldstein</p><p class=\"\">Morgan Stanley has finally conceded that Palantir Technologies is not a stock to sell, but its analysts aren't quite ready to call it a buy either.</p><p class=\"\">Analysts led by Sanjit Singh lifted Palantir's rating to equal weight from underweight and boosted the price target to $95 from $60, following the company's fourth-quarter results and 2025 outlook.</p><p class=\"\">Palantir shares (PLTR) jumped 18% to $99.10 in premarket trade. The stock has surged over the last year.</p><p class=\"\">Read: Palantir's stock surges as AI traction drives huge earnings beats across the board</p><p class=\"\">\"One of the key principles of growth investing in software is before looking to valuation, to first assess whether the business is getting better or worse and, if getting better, to ask how durable that improvement is going forward,\" the analysts said.</p><p class=\"\">Palantir's revenue growth accelerated, to 36% from 30% in the third quarter, as several key performance indicators also improved. The company also guided for fiscal-year revenue growth of 31%, which was well ahead of consensus expectations of mid-20% growth.</p><p class=\"\">\"Surprising to us was the strength of the 2025 outlook, despite the tough compares next year particularly in the government business. Management highlighted that it expects another good year in government and should prove to be an ultimate beneficiary of the ongoing government efficiency initiatives,\" said the analysts.</p><p class=\"\">Valuation, however, is still a concern, at an estimated 52 times calendar 2026 sales and 120 times 2026 free cash flow.</p><p class=\"\">Another bear, RBC's Rishi Jaluria, kept an underperform but lifted Palantir's price target to $40 from $11.</p><p class=\"\">\"Overall, both government and commercial results were better than expectations, but our concerns about the runway for growth and product differentiation remain,\" he said.</p><p class=\"\">-Steve Goldstein</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204005053:0/",
            "pub_date": "2025-02-04 18:24:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463413:0",
            "title": "S&P Rates Korea Electric Power's Proposed Notes AA",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">S&amp;P Global Ratings has given an AA long-term issue rating to Korea Electric Power's  proposed US dollar senior unsecured notes, according to a Tuesday release. </p><p class=\"\">The notes' rating is in line with the power company's long-term issuer credit rating, with S&amp;P seeing limited structural or contractual subordination risks in the capital structure. </p><p class=\"\">Meanwhile, S&amp;P aligns the company's ratings and outlooks with those of South Korea, given its role in the government's electricity policy. </p><p class=\"\">The rating agency also expects the company to see positive earnings from 2024 to 2025 due to reduced wholesale electricity prices and a slight rise in tariffs. </p><p class=\"\">Still, the company's debt burden will remain elevated, with an adjusted debt-to-EBITDA ratio of between 6.4x and 6.8x, due to higher adjusted debt in past years and large capital spending.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463413:0/",
            "pub_date": "2025-02-04 18:25:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308425:0",
            "title": "China Retaliates Against US Tariffs, Opens Antitrust Probe Into Google",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308425:0/",
            "pub_date": "2025-02-04 18:25:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Nvidia, Super Micro, Synaptics, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stock futures declined Tuesday as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were poised to make moves Tuesday:</p><p class=\"\">Palantir Technologies soared 18% in premarket trading after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla was down 0.5% in premarket trading after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in Mexico but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were rising 0.7%. Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 6% in premarket trading. The maker of AI servers said it would be providing a fiscal second-quarter \"business update\" on Feb. 11. The  Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">Semiconductor design company Synaptics fell 5% after announcing CEO Michael Hurlston would be stepping down to become chief executive and president of Lumentum, the maker of products for cloud and AI applications. Lumentum shares rose 1.7%.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 1.3% in premarket trading.</p><p class=\"\">Kyndryl Holdings, the provider of information-technology services, swung to a profit in its fiscal third quarter and raised its 2025 guidance. The stock declined 1.7% in premarket trading.</p><p class=\"\">Earnings reports are expected Tuesday from Alphabet, Merck, Advanced Micro Devices, Chipotle Mexican Grill,  PayPal Holdings,  Pfizer, PepsiCo,  Amgen, and  Spotify Technology.</p><p class=\"\">Alphabet rose 0.2% in premarket trading ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-04 18:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Obim4lNJa:0",
            "title": "Hafslund - Approval of Base Prospectus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On 4 February 2025, the Financial Supervisory Authority of Norway approved thebase prospectus prepared by Hafslund AS.</p><p class=\"\">The prospectus is available on the company's website:https://www.hafslund.no/en/investor/lanedokumentasjon</p><p class=\"\">Hafslund ASOslo, 4 February 2025</p><p class=\"\">For further information: Andreas Wik, Head of Treasury, tel: +47 924 97 255 or e-mail:andreas.wik@hafslund.no</p><p class=\"\">https://newsweb.oslobors.no/message/637666</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Obim4lNJa:0-hafslund-approval-of-base-prospectus/",
            "pub_date": "2025-02-04 18:16:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002822:0",
            "title": "European Midday Briefing: Stocks Drop as China Retaliates Against Trump Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Stocks:</p><p class=\"\">European stocks fell on Tuesday after Trump agreed to postpone his threatened 25% tariffs on Canada and Mexico , however, a new 10% tariff on China took effect.</p><p class=\"\">China has retaliated with new tariffs on select U.S. imports  and said it was opening an antitrust probe into Google.</p><p class=\"\">\"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies said. \"Our view remains that eventually tariffs will end up not as bad as feared.\"</p><p class=\"\">Hargreaves Lansdown said U.K. investors were on edge as trade jitters continued.</p><p class=\"\">Trade tensions are dictating the market mood, especially in Europe where Trump keeps the continent guessing with lingering threats, it said.</p><p class=\"\">With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, Hargreaves said.</p><p class=\"\">Stocks to Watch</p><p class=\"\">Novartis is set to overcome a wave of patent expirations during 2025, Deutsche Bank said.</p><p class=\"\">The Swiss pharma giant surprised with its margin performance in the last quarter and its 2025 outlook that came ahead of analysts expectations, Deutsche Bank said.</p><p class=\"\">While some of the 4Q revenue beat was attributed to rebates, Novartis appears well-positioned to continue exceeding market expectations, it said.</p><p class=\"\">Deutsche Bank lifted back the stock rating to buy from hold, which had been previously nudged down due to patent expiry worries.</p><p class=\"\">U.S. Markets:</p><p class=\"\">Stock futures fell after China struck back against the new U.S. tariffs. Its measures will go into effect on Feb. 10.</p><p class=\"\">Trump said the tariffs on China were just \"an opening salvo.\" He added: \"If we can't make a deal with China, then the tariffs would be very, very substantial.\"</p><p class=\"\">Forex:</p><p class=\"\">The euro remained under pressure as tariff risks remained heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank said.</p><p class=\"\">Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, it said.</p><p class=\"\">Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range.</p><p class=\"\">\"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Danske Bank said.</p><p class=\"\">The dollar fell after Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank said.</p><p class=\"\">There is a risk of new tariff announcements coming at any time, Commerzbank said.</p><p class=\"\">\"The next shock is bound to come, and this will probably be dollar-positive again.\"</p><p class=\"\">Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, it said.</p><p class=\"\">Bonds:</p><p class=\"\">Eurozone 10-year government bond yields edged higher, tracking Treasury yields after the latest twist in Trump's tariff policy.</p><p class=\"\">Eurozone rates are likely to continue to be sensitive to growth risks, ING said. \"Especially the front end may find itself even lower in the near term.\"</p><p class=\"\">Danske Bank said being long in French bonds still carries some risks.</p><p class=\"\">French Prime Minister Francois Bayrou pushed the 2025 budget bill without a vote by lawmakers, and faces a no-confidence vote. Using a constitutional tool to pass the bill \"was what led to fall of the previous French government,\" Danske said.</p><p class=\"\">\"Hence, there is still some considerable risks to being long France even at spread of some 75 basis points in the 10-year area to Germany.\"</p><p class=\"\">Energy:</p><p class=\"\">Oil prices fell more than 1% as immediate concerns over supply disruptions eased after Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude.</p><p class=\"\">Meanwhile, as a tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday.</p><p class=\"\">The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices.</p><p class=\"\">Metals:</p><p class=\"\">Gold futures slid, correcting after the Canada and Mexico made a deal that will postpone U.S. tariffs by at least a month, but ING said uncertainty over trade should keep the price relatively well supported.</p><p class=\"\">Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING said.</p><p class=\"\">Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING added.</p><p class=\"\">Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research said.</p><p class=\"\">Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800 level, leaving its bullish bias intact, RHB said.</p><p class=\"\">The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900 level, it said.</p><p class=\"\">The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, RHB added.</p><p class=\"\">EMEA HEADLINES</p><p class=\"\">UBS Aims to Boost Buybacks as Net Profit Beats Expectations</p><p class=\"\">UBS Group reported a fourth-quarter net profit that came in ahead of analysts' expectations, and said it aims to buy back shares valued at up to $3 billion this year.</p><p class=\"\">The Zurich-based bank said Tuesday that net profit for the quarter was $770 million compared with a loss of $279 million in the year-earlier period, when its results were hit by costs related to the integration of Credit Suisse.</p><p class=\"\">BNP Paribas Raises Shareholder Returns After Posting Higher Earnings</p><p class=\"\">BNP Paribas raised its dividend and intends to buy back more than 1 billion euros worth of shares from the second quarter, after posting an earnings rise.</p><p class=\"\">The French lender said it made 2.32 billion euros ($2.40 billion) in net profit for the fourth quarter, up from 1.07 billion euros a year prior, on revenue that grew 11% to 12.14 billion euros.</p><p class=\"\">Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets</p><p class=\"\">U.K. spirits maker Diageo scrapped its midterm outlook, citing macroeconomic and geopolitical uncertainty in key markets affecting the pace of recovery.</p><p class=\"\">The owner of Johnnie Walker, Guinness and Smirnoff said Tuesday that it has withdrawn its target of organic net sales growth between 5% and 7%.</p><p class=\"\">Infineon Shares Surge After Guidance Raise, Better-Than-Expected Quarter</p><p class=\"\">Infineon Technologies shares jumped after the group raised its sales forecasts for the fiscal year as it expects to benefit from a stronger U.S. dollar, while sales in the December quarter fell less than feared amid solid demand for artificial-intelligence chips.</p><p class=\"\">The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros ($15.94 billion) it reported for fiscal 2024. Infineon had previously forecast a slight decline. Meanwhile, Infineon's segment result margin-a key profitability measure-is still expected in the mid-to-high-teens percentage range.</p><p class=\"\">GLOBAL NEWS</p><p class=\"\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</p><p class=\"\">BRUSSELS-European leaders, bracing for a fight with President Trump over the world's most valuable trading relationship, said they are ready to strike back but prefer cooperation.</p><p class=\"\">Trump over the weekend announced punishing tariffs on Canada and Mexico and made clear that U.S. allies across the Atlantic were high on his target list. He later agreed to pause tariffs on Canada and Mexico for one month.</p><p class=\"\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</p><p class=\"\">Bitcoin was struggling for direction Tuesday as investors weighed up how President Donald Trump's trade policies will affect cryptocurrency prices.</p><p class=\"\">The world's largest token climbed when Trump paused plans for 25% tariffs on goods from Mexico and Canada, then slid after China said it would hit back with levies of its own.</p><p class=\"\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</p><p class=\"\">The Treasury Department said it needs to borrow less money than originally expected in the current quarter because it kicked off the year with more cash on hand than planned.</p><p class=\"\">The department, which is responsible for the government's borrowing, said Monday afternoon that in the January to March quarter, it expects to borrow $815 billion. The previous estimate, shared in October, was for $823 billion.</p><p class=\"\">Netanyahu, Trump to Hold Talks on Gaza Cease-Fire and Wider Middle-East Strategy</p><p class=\"\">WASHINGTON-The future of the precarious Gaza cease-fire is expected to dominate much of the closed-door discussion when President Trump and Israeli Prime Minister Benjamin Netanyahu meet in the Oval Office Tuesday.</p><p class=\"\">A commitment from Netanyahu to negotiate an extension and potentially a long-term cessation of hostilities would give Trump a diplomatic win, and could secure the release of remaining hostages, including some Americans.</p><p class=\"\">El Salvador Offers to Take U.S. Deportees of Any Nationality Including Imprisoned Americans</p><p class=\"\">SAN SALVADOR, El Salvador-U.S. Secretary of State Marco Rubio said on Monday that El Salvador has offered to accept deportees of any nationality from the U.S., including incarcerated American citizens who would be held in the country's maximum-security prison.</p><p class=\"\">El Salvador President Nayib Bukele offered to \"house in his jails dangerous American criminals in custody in our country,\" Rubio said in San Salvador, the second stop on his first foreign trip, after meeting with Bukele. \"No country has ever made an offer of friendship such as this,\" he said, calling it the \"most unprecedented and extraordinary, extraordinary migratory agreement anywhere in the world.\"</p><p class=\"\">Trump Hints at Curbs on Musk's Powers After Billionaire Shakes Up Washington</p><p class=\"\">WASHINGTON-President Trump on Monday said there were curbs in place to prevent Elon Musk from doing anything in the government without the White House's blessing, responding to growing confusion about who was overseeing Musk's push to dismantle multiple agencies.</p><p class=\"\">Trump described Musk's role as advisory. \"Elon can't do-and won't do-anything without our approval and we'll give him the approval where appropriate. Where not appropriate, we won't,\" Trump said.</p><p class=\"\">Write to ina.kreutz@wsj.com</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002822:0/",
            "pub_date": "2025-02-04 18:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0OJ:0",
            "title": "Indian shares buck global trade war fears to log best day in a month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indian shares posted their biggest one-day gain in a month on Tuesday, shrugging off the China-U.S. trade war fears that weighed on global stocks and focusing instead on the chance for a trade truce with the U.S., similar to Mexico and Canada.</p><p class=\"\">The Nifty 50  added 1.62% to 23,739.25, while the BSE Sensex  gained 1.81% to 78,583.81, with both logging their biggest single-session gains in a month.</p><p class=\"\">Asian and European stocks were hauled back by fears of a global trade war after the U.S. and China slapped retaliatory tariffs on each other, rekindling fears that were doused on Monday after U.S. President Donald Trump suspended tariffs on Mexico and Canada.</p><p class=\"\">Trump has also threatened to impose 100% tariffs on the BRICS member countries, which include India, if they replaced the dollar as a reserve currency.</p><p class=\"\">\"The real trigger for Indian markets today was the tariff pause on Mexico and Canada, which signalled that the U.S. is ready to negotiate,\" said G Chokkalingam, founder and head of research at Equinomics Research.      </p><p class=\"\">Compared to Mexico, Canada and China, India's exports to the U.S. are relatively smaller and hence investors are optimistic that they may not attract Trump's scrutiny, Chokkalingam said.</p><p class=\"\">The Nifty started February on a weak note after a mixed federal budget and the trade war fears, threatening to extend a four-month losing streak. That, however, has made stock prices relatively cheaper.    </p><p class=\"\">High-weight financials  rose 2.11%, led by a 2.6% jump in top private lender HDFC Bank .</p><p class=\"\">The small-caps  and mid-caps  rose 1.1% and 1.6%, respectively.</p><p class=\"\">State-owned firms (.NIFTYPSE) rose 2.7% after dropping 6.3% in the previous two sessions, led by oil marketing companies on softer crude prices and defence firms on a potential jump in orders.</p><p class=\"\">Divi's Laboratories  jumped 3.6%, taking its two-session gains to 8.3% since beating quarterly profit estimates.</p><p class=\"\">Asian Paints  climbed 2.7% due to stronger-than-expected volume growth in the third quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0OJ:0-indian-shares-buck-global-trade-war-fears-to-log-best-day-in-a-month/",
            "pub_date": "2025-02-04 18:18:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0R9:0",
            "title": "Higher wind output weighs on German spot prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Germany's spot power prices fell on Tuesday as wind power generation is expected to increase in the country.</p><p class=\"\">German day-ahead (TRDEBD1) power was down 1.7% to 142.0 euros per megawatt hour at 0902 GMT.</p><p class=\"\">French baseload for the day ahead (TRFRBD1) was at 143.5 euros/MWh, down 0.4%, LSEG data showed.</p><p class=\"\">On the supply side, Germany was seen increasing wind output by 3.9 gigawatts to 16.2 GW. French wind output was expected to shed 230 megawatts to 2.8 GW day-on-day.</p><p class=\"\">In Germany, solar power output was forecast to fall 1.7 GW on Wednesday to 4.0 GW, LSEG data showed.</p><p class=\"\">French nuclear availability fell by two percentage points to 81% of total capacity. </p><p class=\"\">Power consumption in Germany is expected to increase by 0.4 gigawatts (GW) to 63.1 GW on Wednesday while demand in France is seen falling 3.6 GW to 66.9 GW, LSEG data also showed.</p><p class=\"\">Average temperatures in France and Germany will ease by 2.3 degrees Celsius and 1 degree Celsius respectively up to Wednesday.</p><p class=\"\">The German year-ahead baseload contract (TRDEBYZ6) was down 0.9% at 96.0 euros/MWh, while the French year-ahead position (TRFRBYZ6) shed 2.4% to 68.0 euros/MWh.</p><p class=\"\">The European carbon market's benchmark 2025 contract (CFI2Zc1) was down 0.6% at 80.48 euros per metric ton.</p><p class=\"\">Carbon prices are under pressure from the potential impact on Europe of a trade war with the U.S., Energi Danmark analysts said.</p><p class=\"\">Belgium's new government is looking to double its nuclear power capacity from 4 GW to 8 GW by building new reactors, Energy Minister Mathieu Bihet was quoted as saying by financial daily Tijd on Tuesday. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0R9:0-higher-wind-output-weighs-on-german-spot-prices/",
            "pub_date": "2025-02-04 18:18:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0SP:0",
            "title": "India stocks, rupee, swaps, call at 3:30 p.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was up 1.8% to 78,583.81, while the broader NSE index  advanced 1.6% to 23,739.25, shrugging off the China-U.S. trade war fears that weighed on global stocks and focusing instead on the chance for a trade truce with the U.S., as struck with Mexico and Canada. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  ended higher at 87.0675 versus the U.S. dollar, against 87.1850 in the previous session, mirroring gains in regional currencies, but concerns over an escalating U.S.-China trade war kept investors on edge.  </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN071034G=CC) was quoted at 100.815 rupees, with the yield little changed at 6.6725%, as traders  awaited the central bank's monetary policy decision. </p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) was down 2 basis points at 6.3075%, while the five-year swap rate (INR5YMIBROIS=CC) was largely unchanged at 6.0775%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 6% and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.28%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0SP:0-india-stocks-rupee-swaps-call-at-3-30-p-m-ist/",
            "pub_date": "2025-02-04 18:18:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002767:0",
            "title": "U.K. Sells 4.25 Billion Pounds in March 2030 Gilt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Miriam Mukuru</p><p class=\"\">The U.K's Debt Management Office sold 4.25 billion pounds ($5.29 billion) in March 2030-dated gilts at an auction on Tuesday, it said.</p><p class=\"\">The following are results of the auction, with amounts in pounds. Figures in brackets are data from the previous auction, held on Jan. 8, 2025.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Issue              4.375% March 7 2030 gilt <br/>Amount on offer    4.25  bln <br/>Bids received      12.95 bln <br/>Bids accepted      4.25  bln <br/>Bid-to-cover ratio 3.05    (3.00) <br/>Average yield      4.276%  (4.490%) <br/>Average price      100.43  (99.46) <br/>Maximum yield      4.281%  (4.496%) <br/>Settlement date    February 5, 2025 <br/> </pre><p class=\"\">Write to Miriam Mukuru at miriam.mukuru@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002767:0/",
            "pub_date": "2025-02-04 18:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACN95760a:0",
            "title": "Mallia Therapeutics and Northway Biotech Announce Partnership for the Manufacturing of Soluble CD83 Protein for Hair Loss Treatment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ERLANGEN, GERMANY AND VILNIUS, LITHUANIA, Feb 4, 2025 - (ACN Newswire) - Mallia Therapeutics (\"Mallia\"), a biopharmaceutical company developing novel treatments for hair loss, and Northway Biotech (\"NBT\"), a biologics Contract Development and Manufacturing Organization (CDMO), have announced a partnership for the development of the production process and manufacturing of Mallia's soluble CD83 protein (sCD83), a treatment aimed at promoting hair follicle formation and growth.</p><p class=\"\">Under the agreement, Northway Biotech will leverage its expertise in biologics manufacturing to develop the production process for the recombinant sCD83 protein for large-scale production, utilizing the Pichia pastoris expression system. This collaboration includes the development of analytical methods, technology scale-up, and the manufacturing of a cGMP Drug Substance.</p><p class=\"\">Dr. Manfred Groeppel, co-founder and Managing Director of Mallia Therapeutics, said: \"With this partnership, we are advancing the development of sCD83 to turn our research into a scalable treatment for patients.\"</p><p class=\"\">\"Interestingly, sCD83's mode of action induces both the formation of new hair follicles and thus hair growth, and has the potential to redefine treatment approaches for hormone-induced androgenetic alopecia as well as immune-mediated alopecia areata,\" emphasizes Prof. Dr. Alexander Steinkasserer, co-founder and Managing Director of Mallia. \"By developing a robust production process, we are ensuring the quality required for future clinical as well as commercial applications.\"</p><p class=\"\">Prof. Vladas Algirdas Bumelis, CEO and Chairman of Northway Biotech, expressed, \"We are excited to be working with Mallia on developing the manufacturing process of sCD83. Our priority is to ensure the highest manufacturing standards and maintain clear, open communication as we collaborate every step of the way.\"</p><p class=\"\">\"Mallia's team and their innovative solution make this project particularly appealing to us given its huge potential and the large need from people all over the world for treatment. The strong and transparent collaboration we have established allows us to support Mallia with confidence as we move forward together quickly,\"added Andre Markmann, PhD, VP of Business Development at Northway Biotech.</p><p class=\"\">About Mallia Therapeutics GmbH</p><p class=\"\">Mallia Therapeutics GmbH is a biopharmaceutical company focused on developing novel treatments for patients suffering from hair loss. The Company was founded in 2023 in Erlangen, Germany, and is led by an experienced management team and worldwide leading experts in the field of CD83, with more than 60 CD83-related publications and 20 years of experience in the field.</p><p class=\"\">With sCD83, a potential treatment for hair loss in preclinical development, Mallia aims to enter the multi-billion-dollar alopecia market and provide patients with a safe and effective topical treatment.</p><p class=\"\">Connect with us on LinkedIn or find out more here: https://mallia-therapeutics.com/</p><p class=\"\">About Northway Biotech</p><p class=\"\">Northway Biotech is a leading contract development and manufacturing organization (CDMO) supporting customers worldwide. Its highly experienced and professional team executes projects at every stage, from cell line construction and process development to cGMP manufacturing of biopharmaceutical products. The company's extensive expertise and vertically integrated service offering enable rapid execution of multiple projects from its state-of-the-art GMP facilities while ensuring full process and product compliance at all stages of research, development, and commercial manufacturing. Northway Biotech is a privately owned company founded in 2004 and operates locations in Vilnius, Lithuania; London, United Kingdom; and Waltham, MA, USA. For more information, please visit www.northwaybiotech.com.</p><p class=\"\">Mallia Therapeutics Contact:</p><p class=\"\">Mallia Therapeutics GmbH</p><p class=\"\">info@mallia-therapeutics.com</p><p class=\"\">International Media Contact:</p><p class=\"\">MC Services AG</p><p class=\"\">Dr. Regina Lutz / Katja Arnold</p><p class=\"\">Tel.: +49 (0)89 210 228 0</p><p class=\"\">E-Mail: mallia-therapeutics@mc-services.eu</p><p class=\"\">Contact Information</p><p class=\"\">Vladas Bumelis</p><p class=\"\">CEO and Chairman of the Board</p><p class=\"\">vladas.bumelis@northwaybiotech.com</p><p class=\"\">SOURCE: Northway Biotech</p><p class=\"\">Source: Northway Biotech</p><p class=\"\">Copyright 2025 ACN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACN95760a:0-mallia-therapeutics-and-northway-biotech-announce-partnership-for-the-manufacturing-of-soluble-cd83-protein-for-hair-loss-treatment/",
            "pub_date": "2025-02-04 18:12:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463394:0",
            "title": "The San-in Godo Bank's Nine-Month Profit Rises 26%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The San-in Godo Bank  recorded a 26% rise in attributable profit for the nine months ended Dec. 31, 2024, to 13.1 billion yen from 10.4 billion yen in the year-ago period. </p><p class=\"\">Earnings per share were 86.15 yen, up from 67.30 yen a year earlier, a Jan. 31 bourse filing said. </p><p class=\"\">The lender saw an 8.7% rise in ordinary income to 96.3 billion yen from 88.6 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 18.2 billion yen, basic EPS of 119.36 yen, an ordinary income of 131.9 billion yen, and total dividend of 48 yen per share for the fiscal year ending March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463394:0/",
            "pub_date": "2025-02-04 18:13:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463410:0",
            "title": "LG Chem Widens Loss in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LG Chem  widened its fourth-quarter 2024 net attributable loss to shareholders of parent company to 1.055 trillion won from 81.4 billion won a year earlier, according to a Monday filing with KIND. </p><p class=\"\">The company's sales declined 6.1% year over year to 12.3 trillion won from 13.1 trillion won. </p><p class=\"\">Shares of LG Chem fell more than 4% at market close on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463410:0/",
            "pub_date": "2025-02-04 18:13:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1A7:0",
            "title": "Arab Company For Investment Projects FY Attributable Income 273,889 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab Company for Investment Projects Psc (APCT.AM):</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ARAB COMPANY FOR INVESTMENT PROJECTS FY ATTRIBUTABLE INCOME 273,889 DINARS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1A7:0-arab-company-for-investment-projects-fy-attributable-income-273-889-dinars/",
            "pub_date": "2025-02-04 18:13:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463411:0",
            "title": "Volvo Cars Logs Lower Car Sales in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volvo Car (VOLCAR-B.ST, VOLCAR-B.ST VOLCAR-B.ST), d/b/a Volvo Cars, said Tuesday its car sales dropped 5% year over year in January. </p><p class=\"\">The Swedish automaker sold 50,820 cars, compared with 53,402 vehicles in the year-ago period.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463411:0/",
            "pub_date": "2025-02-04 18:13:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}