{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0CP:0",
            "title": "Infineon Technologies Closes EUR 2.0 Bln Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">INFINEON TECHNOLOGIES AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLOSES €2.0 BILLION REVOLVING CREDIT FACILITY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0CP:0-infineon-technologies-closes-eur-2-0-bln-revolving-credit-facility/",
            "pub_date": "2025-02-05 16:32:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463872:0",
            "title": "Vinati Organics Infuses Additional INR488 Million in Wholly Owned Unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vinati Organics  has invested an additional 488.1 million Indian rupees in its wholly owned subsidiary, Veeral Organics, according to a filing to the stock exchanges on Wednesday. </p><p class=\"\">The company has subscribed to an additional 48,810,200 fully paid-up equity shares of the face value of 10 rupees each through subscription towards the rights issue of Veeral Organics. </p><p class=\"\">Veeral Organics manufactures organics fine specialty chemicals. </p><p class=\"\">Shares of the company were down over 1% in recent trade</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463872:0/",
            "pub_date": "2025-02-05 16:32:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002398_20250205002398:0",
            "title": "Infineon Technologies Signs EUR2.0B Revolving Credit Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002398_20250205002398:0/",
            "pub_date": "2025-02-05 16:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463873:0",
            "title": "Tokai Tokyo Upgrades Fujicco to Neutral from Underperform; Price Target is 1,670 Yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463873:0/",
            "pub_date": "2025-02-05 16:33:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463870:0",
            "title": "Force Motors Posts 20% Rise in Total Sales in January, Shares Jump 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Force Motors  recorded a 20% rise in its total sales to 3,597 units in January against 2,989 units a year ago, according to a Wednesday filing to the Indian stock exchanges. </p><p class=\"\">The units sold comprised small commercial vehicles, light commercial vehicles, and utility vehicles. </p><p class=\"\">Domestic sales in January were down up 39% year-on-year to 3,493 units, while exports were down 78% to 104 units, the filing stated. </p><p class=\"\">Shares of the company were up nearly 6% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463870:0/",
            "pub_date": "2025-02-05 16:33:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463878:0",
            "title": "Abu Dhabi Airports Logs Higher FY24 Passenger Numbers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Abu Dhabi Airports logged 29.4 million passengers in the Emirate's five airports in 2024, up from 22.9 million passengers in 2023. </p><p class=\"\">Aircraft movements also rose during the period to 249,747, compared with 226,362 a year ago, according to a Wednesday release. </p><p class=\"\">Meanwhile, cargo traffic saw a 21% year-over-year increase to 678,990 tonnes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463878:0/",
            "pub_date": "2025-02-05 16:33:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0TW:0",
            "title": "Valneva jumps on UK approval of chikungunya vaccine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Valneva  rise 8% after the French biotech company received a marketing authorization in the UK for its chikungunya vaccine Ixchiq on adults</p><p class=\"\">** \"The marketing approval (MA) in the UK completes the range of MA in regions where the vaccine has the highest added value. This is therefore positive news from the point of view of the company's future revenues,\" Portzamparc analysts say</p><p class=\"\">** Valneva expects to receive marketing approval in Brazil in Q1 2025 and has submitted label extension applications to the U.S., Canadian and European health authorities for extending the use of Ixchiq to adolescents, the company says</p><p class=\"\">** Including Wednesday's rise, the stock has gained around 32% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0TW:0-valneva-jumps-on-uk-approval-of-chikungunya-vaccine/",
            "pub_date": "2025-02-05 16:33:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002400:0",
            "title": "Temu Expected to Navigate U.S. Shipping Rule Changes, But Risks Remain — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The cancellation of the \"de minimis\" rule, which allowed low-value shipments to bypass duties and custom scrutiny, as well as the subsequent suspension of Chinese goods shipments by the U.S. Postal Services, should be manageable for PDD Holdings' Temu, says Nomura analyst Jialong Shi tells Dow Jones Newswires. Temu has been preparing for this change in the past year, Shi notes, pointing to the company introducing a half consignment model in early 2024. Under this model, merchants typically ship products to the U.S. in bulk rather than relying on the so-called \"de minimis\" exemption, which was recently revoked by President Trump, Shi notes. While Temu still has significant growth potential in the U.S. market at this stage, uncertainties remain over whether the U.S. government will introduce new regulations to these Chinese companies, he says. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002400:0/",
            "pub_date": "2025-02-05 16:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002402:0",
            "title": "Embla Medical hf: Interim Report Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Embla Medical hf: Interim Report Q4 2024</p><p class=\"\">PR Newswire</p><p class=\"\">COPENHAGEN, Denmark, Feb. 5, 2025</p><p class=\"\">Announcement no. 1/2025</p><p class=\"\">5 February 2025</p><p class=\"\">Interim report Q4 2024</p><p class=\"\">COPENHAGEN, Denmark, Feb. 5, 2025 /PRNewswire/ --</p><p class=\"\">Sveinn Sölvason, President and CEO, comments:</p><p class=\"\">\"Sales in Q4 2024 amounted to USD 225 million, where our organic sales growth was 5% for the quarter and local currency growth was 8%. The continued strong momentum we have seen throughout the year in our Prosthetics &amp; Neuro Orthotics business continued to drive our growth, supported by good growth contribution across all our regions. Bracing &amp; Supports sales growth was modest for the quarter while sales in Patient Care declined, impacted by a strong comparison. For the full year 2024, our organic sales growth was 6%, driven by a strong performance in EMEA and our Prosthetics &amp; Neuro Orthotics and Patient Care segments.</p><p class=\"\">EBITDA margin (before special items) came in strong at 21% for Q4 and 20% for the full year. We continue to see the positive effects from the cost reduction initiatives implemented in manufacturing during Q1 2024 as well as positive contributions from product mix and cost control in SG&amp;A. In addition, we also saw strong cash flow generated for the quarter with USD 34 million or equivalent to 15% of sales.</p><p class=\"\">We are very pleased with the progress on our Growth'27 strategy and ability to execute on our ambitious targets and priorities such as the Fior &amp; Gentz acquisition we completed in January 2024, unifying our Patient Care business under the ForMotion brand and delivering exciting new innovation. These initiatives are all enabling us to reach even more people with our mobility solutions. Lastly, we have issued new guidance for 2025 of 5-8% organic sales growth and 20-21% EBITDA margin.\"</p><p class=\"\">Highlights Q4 2024</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Sales amounted to USD 225 million and organic growth was 5%, compared to   9% in Q4 2023. Local currency sales growth was 8% including acquisitions   and 7% reported growth in USD. For FY 2024, organic sales growth was 6%.   </li><li class=\"listItem-bmN0_SHH\">Prosthetics &amp; Neuro Orthotics sales grew by 12% organic, Bracing &amp;   Supports sales grew by 2% organic, while Patient Care sales declined by   1% organic in Q4 2024 due to a strong comparison in Q4 2023. For FY 2024,   Prosthetics &amp; Neuro Orthotics sales grew by 9% organic, Bracing &amp;   Supports sales grew by 1% organic and Patient Care sales grew by 5%   organic. Growth is attributed to solid volume growth and positive product   mix supported by strong performance in our high-end solutions.   </li><li class=\"listItem-bmN0_SHH\">Gross profit was USD 142 million and gross profit margin was 63%,   compared to 61% in Q4 2023. For FY 2024, the gross profit margin was 63%   compared to 62% in 2023. The gross profit margin was positively impacted   by cost reduction initiatives in manufacturing implemented during the   first quarter of 2024, as well as favorable product mix and manufacturing   efficiency.   </li><li class=\"listItem-bmN0_SHH\">EBITDA amounted to USD 47 million and EBITDA margin was 21% of sales,   compared to 18% in Q4 2023. In FY 2024, EBITDA margin before special   items increased to 20% compared to 18% for FY 2023. The EBITDA margin   expansion was driven by strong sales performance, cost savings and   efficiency in manufacturing, and effective cost control in SG&amp;A.   </li><li class=\"listItem-bmN0_SHH\">Net profit was USD 19 million and net profit margin was 8% of sales,   compared to 9% of sales in Q4 2023. While stronger operating profit   contributed positively to net profit in Q4 2024, financial expenses and   net exchange rate differences due to currency fluctuations impacted net   profit negatively. In FY 2024, net profit grew by 17% and the net profit   margin increased to 8% compared to 7% in FY 2023.   </li><li class=\"listItem-bmN0_SHH\">Free cash flow amounted to USD 34 million or 15% of sales, compared to   13% of sales in Q4 2023. In FY 2024, free cash flow amounted to 9% of   sales compared to 7% of sales in FY 2023, with the increase driven by   stronger operation profit.   </li><li class=\"listItem-bmN0_SHH\">NIBD/EBITDA before special items was 2.4x at the end of Q4 2024, within   our target range of 2-3x EBITDA in line with our capital structure and   capital allocation policy. Therefore, the share buyback program is to be   reinitiated shortly. </li></ul><p class=\"\">Other highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">In December 2024 Embla Medical (Össur) was ranked #41 and   highlighted as one of the World's Best Companies in Sustainable Growth   2025 by TIME Magazine. The ranking, developed by TIME and Statista, a   leading data analytics platform, names 500 companies pairing growth with   environmental stewardship. The survey evaluated companies based on their   environmental disclosure and scored them according to their revenue   growth, financial stability, and environmental impact. </li></ul><p class=\"\">2025 outlook</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Organic sales growth guidance of 5-8%, driven by strong volume growth and   moderate price increases.   </li><li class=\"listItem-bmN0_SHH\">EBITDA margin guidance of 20-21% driven by scale and efficiency coupled   with continued focus on cost control in SG&amp;A. </li></ul><p class=\"\">Conference call details</p><p class=\"\">Embla Medical will host a conference call February 5, 2025, at 9:00 CET / 7:00 GMT / 3:00 EST.</p><p class=\"\">The event will be hosted by Sveinn Solvason, President and CEO, and G. Arna Sveinsdottir, CFO. The call will include a review of the quarterly and full year results and will be held in English.</p><p class=\"\">Slides used in the presentation will be made available on the company website at the following link: https://www.emblamedical.com/investors</p><p class=\"\">To participate in the telephone conference, please use the dial-in details provided below:</p><p class=\"\">DK: +45 78 76 84 90</p><p class=\"\">SE: +46 31-311 50 03</p><p class=\"\">UK: +44 20 3769 6819</p><p class=\"\">US: +1 646 787 0157</p><p class=\"\">Participant access code: 274982</p><p class=\"\">The webcast will be available through following link:  Embla Medical Q4/FY 2024 webcast</p><p class=\"\">Further information</p><p class=\"\">Klaus Sindahl, Head of Investor Relations, KSindahl@emblamedical.com, +45 5363 0134</p><p class=\"\">Embla Medical press releases by e-mail</p><p class=\"\">If you wish to receive Embla Medical press releases by e-mail, please register at http://www.emblamedical.com/investors</p><p class=\"\">About Embla Medical</p><p class=\"\">Embla Medical (Nasdaq Copenhagen: EMBLA) was founded in Reykjavik in 1971 with the mission to improve people's mobility. Embla Medical is home to several brands renowned for positively impacting people's health and well-being. They include Össur, a leading global provider of prosthetics and bracing and supports solutions; FIOR &amp; GENTZ, an innovative developer of neuro orthotics; and College Park Industries, creators of custom-built prosthetic solutions. Embla Medical also provides patients with world-class care through a global network of Orthotic and Prosthetic (O&amp;P) facilities. Embla Medical is committed to sustainable business practices and is signatory to the UN Global Compact, UN Women's Empowerment Principles, and contributes to the UN Sustainable Development Goals. The company's climate targets have been verified by the Science Based Targets initiative. Embla Medical operates globally and has more than 4,000 employees. www.emblamedical.com</p><p class=\"\">Embla Medical was formerly listed as Össur (OSSR) on Nasdaq Copenhagen until 8 April 2024.</p><p class=\"\">This information was brought to you by Cision http://news.cision.com</p><p class=\"\">https://news.cision.com/embla-medical-hf-/r/embla-medical-hf--interim-report-q4-2024,c4100604</p><p class=\"\">The following files are available for download:</p><p class=\"\">https://mb.cision.com/Main/18404/41006  20250205 Embla Medical Company <br/>04/3246107.pdf                          Announcement Q4 2024 FINAL</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/embla-medical-hf-interim-report-q4-2024-302368614.html</p><p class=\"\">SOURCE Embla Medical hf.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002402:0/",
            "pub_date": "2025-02-05 16:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0KS:0",
            "title": "Italy's Fincantieri gets Norwegian Line cruise ship order worth $9 billion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Norwegian Line Holdings (NCL)  and Italian shipbuilder Fincantieri  said on Wednesday they had agreed a deal for four new cruise liners, which a source close to the matter said was worth around 9 billion euros ($9.34 billion).</p><p class=\"\">Fincantieri has already built two ships for NCL and a third, called the Norwegian Aqua, will be delivered in the coming months. The four new vessels are the single largest order ever signed by the Italian shipbuilder, the source said.</p><p class=\"\">\"The value of this agreement, subject to financing and other typical terms and conditions, is considered very important,\" Fincantieri said in a statement on the order, adding that an original letter of intent was signed in April 2024. </p><p class=\"\">The ships will be built at Fincantieri's Monfalcone shipyard in north-eastern Italy and the first will be delivered in 2030, it said. The others will be finished in 2032, 2034 and 2036. </p><p class=\"\">Each will be around 226,000 tonnes and will be able to accommodate more than 8,300 people, including crew, said Fincantieri, which in November raised its full-year revenue forecast to above 8 billion euros.</p><p class=\"\">While steadily pursuing its core shipbuilding business, the group is also pushing into the defence and underwater segments.</p><p class=\"\">In May it bought Leonardo's  UAS in a deal giving the submarine business an enterprise value of 415 million euros.  </p><p class=\"\">CEO Pierroberto Folgiero also said that Fincantieri was open to all types of collaboration with the warship division of conglomerate Thyssenkrupp .</p><p class=\"\">Fincantieri shares have been the fourth-best performer on the Milan bourse over the past 12 months, rising 106%. The stock rose as much as 5.6% on the Milan bourse in early trade, and was up by 2.83% at 0821 GMT. </p><p class=\"\">($1 = 0.9632 euros) </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0KS:0-italy-s-fincantieri-gets-norwegian-line-cruise-ship-order-worth-9-billion/",
            "pub_date": "2025-02-05 16:34:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFNbLtz6f:0",
            "title": "Acarix Partners with Geo-Med to Extend the Availability of the CADScor System for Veterans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OKLAHOMA CITY — Acarix, a pioneer in the development of groundbreaking acoustic-based cardiac diagnostic solutions, is proud to announce a new strategic partnership with Geo-Med, LLC, a renowned Service-Disabled Veteran-Owned Small Business that specializes in medical and surgical products for the Department of Veterans Affairs and Department of Defense.</p><p class=\"\">This partnership signifies Acarix’s dedication towards enhancing the availability of advanced medical technologies to America's veterans. Geo-Med’s deep expertise in providing high-quality medical products to the VA and Department of Defense, along with their insight into VA procurement, will be instrumental in ensuring that the CADScor System by Acarix reaches the veterans who need it most.</p><p class=\"\">Aamir Mahmood, President and CEO of Acarix, remarked, “This is a monumental win for Acarix as we unite with Geo-Med's considerable capabilities and reach. Together, we are set to drive forward the presence of innovative and life-saving cardiac diagnostic tools such as the CADScor® System, enhancing the quality of care available to these brave veterans.”</p><p class=\"\">Mike Locke, CEO of Geo-Med, added, “Our mission has always focused on delivering the best medical solutions to our servicemen and women. Partnering with Acarix aligns perfectly with our goal, leveraging their pioneering CADScor System to add exceptional value to our product offerings and ultimately to the healthcare of our veterans.”</p><p class=\"\">The CADScor System by Acarix, known for its efficiency and accurate low-risk stratification in assessing coronary artery disease (CAD) at the point of care, will now be more readily accessible within federal medical facilities, ensuring critical advancements in medical technology are within reach for the men and women who have served the United States.</p><p class=\"\">For further details about Geo-Med, please visit www.geomedsdvo.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFNbLtz6f:0-acarix-partners-with-geo-med-to-extend-the-availability-of-the-cadscor-system-for-veterans/",
            "pub_date": "2025-02-05 16:35:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463871:0",
            "title": "Fujairah Building Industries to Halt Trading in Abu Dhabi",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fujairah Building Industries (ADX:FBI) shares will temporarily pause trading on the Abu Dhabi Securities Exchange from 11 am local time on Feb. 17 due to a board meeting. </p><p class=\"\">The Abu Dhabi-listed building materials company will resume trading after it publishes the results of its meeting, according to a Wednesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463871:0/",
            "pub_date": "2025-02-05 16:35:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_APN2MRL3B:0",
            "title": "Iceland central bank cuts policy interest rate to 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Iceland's central bank on Wednesday cut its key policy interest rate to 8.0% from 8.5%, and said inflation has continued to fall.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_APN2MRL3B:0-iceland-central-bank-cuts-policy-interest-rate-to-8/",
            "pub_date": "2025-02-05 16:35:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0P7:0",
            "title": "Novo Nordisk shares shine after Q4 profit, sales beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Novo Nordisk's  rise 4.5% after the Danish drugmaker's Q4 sales and EBIT beat expectations</p><p class=\"\">** Q4 net sales amounted to DKK 85.68 billion vs DKK 81.49 billion estimate seen in a company-compiled consensus</p><p class=\"\">** Q4 EBIT of DKK 36.74 billion beat the 33.60 billion seen in the consensus</p><p class=\"\">** The maker of Wegovy obesity drug forecast sales growth in local currencies in a range of 16%-24% for 2025 vs 26% in 2024, compared to analysts expectations of just under 20%</p><p class=\"\">** The guidance implies significant upgrades to consensus beyond 2025, which should lead to significant share outperformance, J.P.Morgan analyst says</p><p class=\"\">    ** Shares of Novo and its domestic rival Zealand Pharma  (+4%) are among best performers on STOXX 600 index  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0P7:0-novo-nordisk-shares-shine-after-q4-profit-sales-beat/",
            "pub_date": "2025-02-05 16:26:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463858:0",
            "title": "Japan Services Sector Expansion Extends in January: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's services industries expanded in January, and boosted hiring to handle additional business, reported S&amp;P Global on Wednesday. </p><p class=\"\">The Japan services purchasing managers index (PMI) rose to 53.0 in January, up from 50.9 in December 2024, and rising further above the 50-marker that separates growth from contraction, reported S&amp;P Global, citing its monthly survey. </p><p class=\"\">The survey covers the consumer (excluding retail), transport, information, communication, finance, insurance, real estate and business services sectors. </p><p class=\"\">\"Rising services business activity has now been recorded in each of the last three months (including January),\" said S&amp;P Global. \"Sub-sector data indicated that the strongest growth was in transport and storage and finance and insurance.\"</p><p class=\"\">Facing rising demand, managers were hiring in January. \"Service providers increased staffing levels again in the latest</p><p class=\"\">survey period, extending the current run of job creation to 16</p><p class=\"\">months,\" noted S&amp;P Global. </p><p class=\"\">Japan's service sector managers became more optimistic in the first month of the year. \"Concurrently, business optimism remained elevated in January, and the degree of confidence ticked higher from that in December,\" advised S&amp;P Global. </p><p class=\"\">However, Japan's service sector reported experiencing higher costs and raised prices in January. \"Input price inflation strengthened since the end of 2024, and was the most pronounced since last August. Firms linked higher costs to rising wages, as well as increasing fuel and raw material prices,\" said S&amp;P Global. \"Latest data also signaled a sharp increase in average prices charged at the start of 2025.\"</p><p class=\"\">The Japan services PMI was compiled by S&amp;P Global from surveys sent to 400 service sector companies from January 9 through January 25. </p><p class=\"\">In addition, the Japan composite PMI, a combination of the services and manufacturing sectors, rose to 51.1 in January, up from 50.5 in December and above the neutral marker for the third consecutive month, reported S&amp;P Global.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463858:0/",
            "pub_date": "2025-02-05 16:26:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446700:0",
            "title": "Spain Private Sector Growth Remains Strong",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HCOB Spain Composite PMI eased to 54 in January 2025, compared to an over 1-1/2-year high of 56.8 in December, pointing to a solid pace of expansion in the country's private sector, albeit slower than in the preceding month.</p><p class=\"\">A notable slowdown in manufacturing expansion (PMI at 50.9 vs 53.3 in December) was accompanied by milder growth in the service sector (PMI at 54.9 vs 57.3).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446700:0-spain-private-sector-growth-remains-strong/",
            "pub_date": "2025-02-05 16:27:14",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463857:0",
            "title": "Malaysia Adjusts Anti-Dumping Duties on Chinese Steel Wires",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysia's trade ministry revised the anti-dumping tariffs on stranded steel wires used for prestressing concrete following an administrative review. </p><p class=\"\">The new rate for Chinese general producers and exporters is set at 21.72%, according to a Malaysian government filing released Wednesday. </p><p class=\"\">The duties were set at 9.07% for Silvery Dragon Prestressed Materials Tianjin and 3.12% for Tianjin Dalu Steel Strand For Prestressed. </p><p class=\"\">The duties are effective until Dec. 24, 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463857:0/",
            "pub_date": "2025-02-05 16:27:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:8216d38c6094b:0",
            "title": "Ethereum supply climbs to pre-Merge upgrade levels; analysts point to Dencun ‘blob’ update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ethereum’s token supply has climbed to its highest since January 2023, matching levels seen before The Merge update that took place on Sept. 15, 2022.</p><p class=\"\">According to data from ultrasound.money, ether supply currently stands at 120,521,523 ETH, which is around 383 ETH higher than the supply seen on the day of the Merge upgrade. Justin Bram, co-founder and CEO at Astaria, brought the matter to attention on social media platform X.</p><p class=\"\">Presto Research analyst Jaehyun Ha told The Block that the ether’s inflation followed last year’s Dencun upgrade, and that Ethereum’s status as the “Ultrasound money” — a deflationary asset that makes it a superior store of value compared to bitcoin — may be at risk.</p><p class=\"\">Prior to Dencun, Ethereum users sending transactions would pay a fee calculated as gas price multiplied by gas amount, and a considerable part of that fee was removed by burning, Ha said.</p><p class=\"\">“With the introduction of the Dencun upgrade, Ethereum added support for blob transactions designed to handle large data payloads (especially, L2s) more efficiently,” Ha told The Block. “These transactions utilize a separate fee unit known as 'blob gas,' which is distinct from the standard gas fee applied to regular transactions.”</p><p class=\"\">Ha noted that this change resulted in a decline in the proportion of fees being burned, as a large amount of transaction activity moved to blob transactions.</p><p class=\"\">“This reduction in the burning of fees means that even if overall network activity remains high or grows, the counterbalancing effect that previously limited the net ETH supply is now less pronounced,” Ha said.</p><p class=\"\">Since the 2022 Merge upgrade, Ethereum supply had been moving downwards to a low of around 120,064,500 ETH in April 2024, but soon rebounded and began to surge steadily afterward. The Dencun upgrade took place in March of that year.</p><p class=\"\">Byoungjoon Kim, researcher at DeSpread Research, who also saw Dencun as a primary factor in ether’s inflation, mentioned that many users and liquidity have migrated to the Solana network with the ongoing memecoin rally and numerous Layer 2s that emerged after Dencun.</p><p class=\"\">Nonetheless, Ha of Presto explained that the supply surge is not an immediate cause for concern, as Ethereum has yet to see a decline in network activity despite the supply surge.</p><p class=\"\">“However, the key narrative of 'ultrasound money' could face a threat,” Ha said. “The upcoming Pectra upgrade scheduled for the first half of this year is expected to include an EIP that will further increase both the blob target and the maximum limit, which could lead to even greater inflation.”</p><p class=\"\">DeSpread researcher Kim, on the other hand, said that a continued increase in ether supply may negatively impact the network’s security in the long run, as the price of ether and the network’s security share a direct relationship under the PoS mechanism.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Time of change</strong></strong></p><p class=\"\">Meanwhile, Ethereum reached a consensus on Tuesday to increase the network’s gas limit for the first time since 2021, from a 30 million limit to over 31 million gas units. Raising the gas limit, which is the maximum amount of gas transactions can consume within a single block, aimed to boost the network’s scalability. </p><p class=\"\">The Ethereum Foundation has also been dealing with the contentious debate surrounding its leadership with concerns of inefficiencies, with a recent unofficial vote pushing for former Ethereum researcher Danny Ryan to lead the foundation instead of current executive director Aya Miyaguchi.</p><p class=\"\">As Ethereum co-founder Vitalik Buterin dismissed the requests for the leadership change, several core developers, including Eric Conner, left the Ethereum community.</p><p class=\"\">Ether’s price rose 1% in the past 24 hours to trade at $2,744, while falling 12% in the last seven days, according to The Block’s ether price page.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:8216d38c6094b:0-ethereum-supply-climbs-to-pre-merge-upgrade-levels-analysts-point-to-dencun-blob-update/",
            "pub_date": "2025-02-05 16:28:21",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW08P:0",
            "title": "UAE non-oil foreign trade hits $817 billion by end of 2024, PM says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The United Arab Emirates' non-oil trade in goods touched a record 3 trillion dirhams ($816.86 billion) by the end of 2024, Prime Minister Sheikh Mohammed bin Rashid Al Maktoum said in a post on X on Wednesday.</p><p class=\"\">The Gulf state's non-oil foreign trade increased by 14.6% last year from the previous year, the post on X noted.</p><p class=\"\">The UAE is widely considered to be the Gulf region's tourism and business hub and has invested heavily in trade and logistics infrastructure, as well as policy, to bolster long-term economic growth.</p><p class=\"\">Since 2021, it has initiated a raft of bilateral trade, investment and cooperation deals - called Comprehensive Economic Partnership Agreements (CEPAs), and has so far negotiated deals with countries ranging from India and Indonesia to previous political foes Israel and Turkey, as well as smaller states.</p><p class=\"\">\"The UAE is different from the global economic flock... and different from the traditional global trade growth flock... because the economy comes before politics...,\" the prime minister, who is also the ruler of Dubai, said in his post.</p><p class=\"\"> ($1 = 3.6726 UAE dirham)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW08P:0-uae-non-oil-foreign-trade-hits-817-billion-by-end-of-2024-pm-says/",
            "pub_date": "2025-02-05 16:28:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0TT:0",
            "title": "Equinor resumes output at giant Sverdrup oilfield after outage",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Norway's Equinor  has resumed output at its giant Johan Sverdrup oilfield in the North Sea following a power outage and is working to reach full production, a company spokesperson said on Wednesday.</p><p class=\"\">Equinor on Tuesday halted all output from Sverdrup, western Europe's largest producing field, due to an outage in the offshore power system.</p><p class=\"\">    \"Preparations for a safe restart began in the afternoon, and parts of the facility resumed production around midnight (2300 GMT),\" the company spokesperson said in an emailed statement.  </p><p class=\"\">    \"We are now working to reach full production,\" he added.  </p><p class=\"\">    Sverdrup has a capacity to produce up to 755,000 barrels of oil per day, Equinor has previously said.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0TT:0-equinor-resumes-output-at-giant-sverdrup-oilfield-after-outage/",
            "pub_date": "2025-02-05 16:28:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TQ:0",
            "title": "UK's James Fisher and Sons gains on upbeat FY profit forecast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of James Fisher and Sons  up 6.5% at 326p</p><p class=\"\">** The oil &amp; gas and marine services provider expects FY24  underlying operating profit of about 29 mln pounds ($36.25 mln), ahead of current market expectations</p><p class=\"\">** Says it saw solid overall trading performance through the H2 supported by end markets</p><p class=\"\">** Brokerage Peel Hunt raises its 2024 operating profit estimate to 29 mln pounds</p><p class=\"\">** \"We expect conditions in key end markets to remain supportive, underpinned by structural drivers\" - Peel Hunt</p><p class=\"\">** FSJ rose about 5% YTD</p><p class=\"\">($1 = 0.8001 pounds)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TQ:0-uk-s-james-fisher-and-sons-gains-on-upbeat-fy-profit-forecast/",
            "pub_date": "2025-02-05 16:29:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446701:0",
            "title": "Hang Seng Trims Losses at Close",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Hang Seng Index slipped 193 points or 0.9% to finish at 20,597 on Wednesday, giving up some gains from the prior day as US futures dropped markedly after Google-parent Alphabet reported a revenue miss.</p><p class=\"\">Markets backed away from their near two-month highs, tracking a decline in mainland markets as trading resumed from a Spring Festival break amid a mounting trade row between China and the US. Meanwhile, the White House said that a call between President Trump and Chinese leader Xi Jinping had yet to be scheduled, adding to market uncertainty.</p><p class=\"\">In other news, US Postal Services temporarily suspended inbound packages from China and Hong Kong \"until further notice.\" Turning to fresh data, the Caixin Services PMI hit a 4-month low in January, in line with official data released last week.</p><p class=\"\">Still, the index pared its early losses, on enthusiasm around China's AI company DeepSeek.</p><p class=\"\">Some decliners included Nongfu Spring (-6.9%), Trip.com(-6.4%), Li Auto (-4.0%), and Galaxy Ent. (-3.7%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446701:0-hang-seng-trims-losses-at-close/",
            "pub_date": "2025-02-05 16:29:48",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002382:0",
            "title": "TotalEnergies Plans $2 Billion Quarterly Buyback After Earnings Jump Sequentially — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Whittaker</p><p class=\"\">TotalEnergies set out a $2 billion quarterly share buyback target for 2025 after net profit jumped on higher gas prices and an increased refining margins.</p><p class=\"\">The French oil and gas company reported a fourth-quarter net profit of $3.96 billion, up 72% on the prior quarter after strong earnings in its integrated LNG and integrated power divisions. Despite this, it missed the $4.21 billion analysts had expected according to a Visible Alpha consensus.</p><p class=\"\">Adjusted net profit--a company preferred metric--rose to $4.41 billion from $4.07 billion the previous quarter. This compares with the $3.94 billion analysts had expected.</p><p class=\"\">Cash flow from operations rose to $12.51 billion, a 74% increase on quarter. It said it would target share buy backs worth 2 billion pounds a quarter in 2025.</p><p class=\"\">The company also hiked its full-year dividend 7% to 3.22 euros a share.</p><p class=\"\">During the period, oil prices declined 5% on quarter but this was partially offset by higher gas prices. Downstream division's refining margins remained weak but increased on quarter.</p><p class=\"\">TotalEnergies upstream division reported adjusted net operating profit of $2.31 billion while earnings from its LNG division jumped 35% on quarter, boosted by 6% production growth and average LNG prices above $10 per million British thermal unit.</p><p class=\"\">Meanwhile, TotalEnergies integrated power division reported adjusted net operating profit of $575 million adjusted net operating profit, an increase of 19% compared with the prior quarter.</p><p class=\"\">Within its downstream division, adjusted net operating profit rose 12% on quarter to $680 million as it benefited from a jump in its refining margin to $25.9 a metric ton, an increase from $15.4 a ton in the prior quarter.</p><p class=\"\">Hydrocarbon production was 2.43 million of oil-equivalent barrels per day, in line with its guidance of between 2.4 million and 2.45 million oil-equivalent barrels a day.</p><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002382:0-totalenergies-plans-2-billion-quarterly-buyback-after-earnings-jump-sequentially-update/",
            "pub_date": "2025-02-05 16:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002379:0",
            "title": "Novo Nordisk Sales Guidance Materially Ahead of Expectations — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novo Nordisk's sales guidance is materially ahead of expectations, Intron Health's Naresh Chouhan writes. The company expects sales to grow 16%-24% this year with EBIT growing 19%-27%. Fourth-quarter EBIT beat expectations by 9% as the gross margin beat by 140 basis points and the EBIT margin beat by 170 basis points. \"Given recent concerns on growth, we expect the shares to be up strongly this morning given the sales guidance is materially higher than consensus was expecting and Wegovy was in-line,\" Chouhan says. Shares trade 4.3% higher at 617.90 Danish kroner. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002379:0/",
            "pub_date": "2025-02-05 16:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002387:0",
            "title": "Gilt Yields Fall Ahead of BOE Rate Decision on Thursday — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yields on U.K. government bonds, or gilts, fall ahead of an anticipated interest-rate cut by the Bank of England this week. Markets price in a 98% probability of a 25 basis-point cut to 4.5% on Thursday, LSEG Refinitiv data show. \"I suspect this Thursday's BOE will be sufficiently dovish to strongly raise odds of another cut already at the March meeting,\" Saxo's John Hardy says in a note. The 10-year gilt yield falls 3 basis points to 4.488%, Tradeweb data show. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002387:0/",
            "pub_date": "2025-02-05 16:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Ind4XtpTH:0",
            "title": "Endomines Finland Plc will publish its Financial Statements Release from 2024 on 13/2/2025 – an invitation to a webcast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Endomines Finland Plc – Press Release, Investor News, 5/2/2025, at 10:30 EET</p><p class=\"\">Endomines Finland Plc will publish its Financial Statements Release from 2024 on 13/2/2025 – an invitation to a webcast</p><p class=\"\">Endomines Finland Plc will publish its Financial Statements Release for 2024 on Thursday 13th of February 2025, at approximately 10:00 EET.</p><p class=\"\">Webcast on Thursday 13/2/2025 at 14:00 EET</p><p class=\"\">At the event, CEO Kari Vyhtinen and CFO Minni Lempinen from Endomines Finland Plc will present the 2024 Financial Review to investors, analysts, and the media. The event can be viewed live at . There will be an open Q&amp;A session via chat. https://endomines.events.inderes.com/q4-2024/register</p><p class=\"\">A recording of the presentation will be available after the event on the Endomines website, and the presentation material will be available after the event at: . https://endomines.com/en/for-investors/reports-and-presentations/</p><p class=\"\">Anni Turpeinen Communications Manager+358 50 554 1543  <strong class=\"root-Tkn6WL2y\">Further information:</strong></p><p class=\"\">anni.turpeinen@endomines.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Endomines Finland Plc</em></strong> <!-- -->is a Finnish forerunner in sustainable mining. Our operations are focused on gold production and exploration in the Karelian Gold Line in Eastern Finland. We also own the rights to seven gold deposits in the US. We produce gold for the jewellery and electronics industries and create value by turning natural resources into wealth, and we also create value by transforming natural resources into wealth, an investment that can withstand the volatility of global politics. Our vision is to develop the Karelian gold line into one of the most important and sustainable gold-producing regions in the world. Endomines is listed on the OMX Helsinki main list (PAMPALO). www.endomines.com.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Ind4XtpTH:0-endomines-finland-plc-will-publish-its-financial-statements-release-from-2024-on-13-2-2025-an-invitation-to-a-webcast/",
            "pub_date": "2025-02-05 16:30:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463869:0",
            "title": "HSBC Downgrades H World Group to Hold from Buy; Price Target is HK$25.27",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463869:0/",
            "pub_date": "2025-02-05 16:23:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0MH:0",
            "title": "South Africa's Harmony Gold reports five deaths at two mines",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Five people were killed in incidents at two of Harmony Gold's  South African mines, the company reported on Wednesday.</p><p class=\"\">Three employees died on Tuesday after a collapse at Joel Mine in the Free State province, about 290 km (180 miles) southwest of Johannesburg, Harmony said in a statement. </p><p class=\"\">Two other employees died in another incident on Tuesday morning at Doornkop Mine, 30 km (19 miles) west of Johannesburg, the company said.</p><p class=\"\">Harmony, South Africa's top gold producer, said the causes of the two incidents were being investigated.</p><p class=\"\">South Africa's mining industry reported 42 deaths last year, the lowest number to date and a 24% improvement on the previous year, according to official statistics released last month.</p><p class=\"\">In January, the bodies of 78 miners were pulled from an illegal gold mine after a heavily-criticised police operation lasting several months that tried to force them to the surface.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0MH:0-south-africa-s-harmony-gold-reports-five-deaths-at-two-mines/",
            "pub_date": "2025-02-05 16:23:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TS:0",
            "title": "TSMC Says Unit TSMC Global Acquires Fixed-Income Securities For $14.4 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Taiwan Semiconductor Manufacturing Co Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS UNIT TSMC GLOBAL LTD. ACQUIRES FIXED-INCOME SECURITIES FOR $14.4 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TS:0-tsmc-says-unit-tsmc-global-acquires-fixed-income-securities-for-14-4-mln/",
            "pub_date": "2025-02-05 16:23:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002338:0",
            "title": "Toyota Boosts Earnings Guidance, to Set Up China EV Unit — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after posting higher third-quarter net profit and said it will establish an electric-vehicle unit in China, seeking to shore up its operations in the world's largest auto market.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed from a year earlier for the three months ended December, beating analysts' estimates, as revenue grew.</p><p class=\"\">Toyota said the new Shanghai-based subsidiary will develop and produce Lexus-branded battery EVs. The unit will also make batteries for the group's businesses.</p><p class=\"\">The wholly owned unit is expected to make 100,000 vehicles annually, with production scheduled to begin in 2027 or later, the company said.</p><p class=\"\">Toyota Motor remained the world's biggest carmaker in 2024, with sales of 10.8 million vehicles globally, as it benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles.</p><p class=\"\">But like many other global carmakers, it struggled in China as a cutthroat price war and consumers' shift away from conventional gas-powered vehicles disrupted the world's largest auto market.</p><p class=\"\">Toyota shares rose Wednesday after it boosted its outlook and reported better-than-expected quarterly results. The stock ended 3.1% higher, virtually recouping losses made earlier this week following the U.S. tariff announcement.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">Toyota said Wednesday that third-quarter net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion. That exceeded the estimate of Y1.175 trillion in a poll of analysts by data provider Quick. Revenue rose 2.9% to Y12.391 trillion despite lower vehicle sales.</p><p class=\"\">The bottom line was also helped by one-off gains related to a change in the way it holds foreign-currency-denominated assets, the company said.</p><p class=\"\">For the fiscal year ending March, Toyota expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously forecast Y3.570 trillion in net profit on Y46.000 trillion in revenue.</p><p class=\"\">The company left its fiscal-year group sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002338:0-toyota-boosts-earnings-guidance-to-set-up-china-ev-unit-update/",
            "pub_date": "2025-02-05 16:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}