{
    "data": [
        {
            "id": "DJN_DN20260227007707:0",
            "title": "Lineage Is Maintained at Neutral by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007707:0/",
            "pub_date": "2026-02-28 00:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7903Ua:0",
            "title": "REG - Schroder BSC Social - Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7903U  Schroder BSC Social Impact Trust  27 February 2026   </span><p class=\"\"><span>Transaction in own shares</span></p><p class=\"\"><span>Schroder BSC Social Impact Trust plc (the \"Company\") announces that on Friday 27 February 2026 it purchased 40,000 of its ordinary shares at a price of 63 pence per share, to be held in treasury.</span></p><p class=\"\"><span>Following this purchase, the Company's issued share capital consists of 85,316,586 ordinary shares of 1p each, the total number of shares in treasury is 6,345,060 and the total number of voting rights in the Company is 78,971,526.</span></p><p class=\"\"><span>The above figure may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the Financial Conduct Authority's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><span>Enquiries:</span></p><p class=\"\"><span>Schroder Investment Management Limited</span></p><p class=\"\"><span>Tel: 020 7658 6000</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  POSFLFERFSIDFIR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7903Ua:0-reg-schroder-bsc-social-transaction-in-own-shares/",
            "pub_date": "2026-02-28 00:54:35",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947397:0",
            "title": "MAIN: Net investment income rose 3% to $352.7M, with robust asset quality and higher dividends",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net investment income grew 3% to $352.7M in 2025, with strong portfolio quality and a NAV per share of $33.33. Expanded credit facilities and increased dividends signal confidence in continued growth and liquidity.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947397-44d57bbd717b9d2577e2e1092fb04bf9\" target=\"_blank\">Main Street Capital Corporation [MAIN] SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947397:0-main-net-investment-income-rose-3-to-352-7m-with-robust-asset-quality-and-higher-dividends/",
            "pub_date": "2026-02-28 00:54:39",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007719:0",
            "title": "How Tech Firms Are Enforcing AI Use — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Conor Grant</span></p><p class=\"\"><span>This is an edition of The Future of Everything newsletter, a look at how innovation and technology are transforming the way we live, work and play. If you're not subscribed, sign up here .</span></p><p class=\"\"><span>AI use is no longer optional if you work in tech.</span></p><p class=\"\"><span>While many sectors are still experimenting with artificial intelligence, the tech industry has moved to the next phase: tracking their workers' use of AI tools — and enforcing it if they have to.</span></p><p class=\"\"><span>This week, Katherine Bindley and Katherine Blunt report on tech companies that are factoring AI use into performance reviews and trying to track productivity gains.</span></p><p class=\"\"><span>From small startups to giants including Amazon, Alphabet's Google and Meta, tech companies are measuring it and in certain cases factoring it into performance reviews. For some jobs, candidates aren't even considered unless they can demonstrate AI fluency.</span></p><p class=\"\"><span>The approximate share of tech-industry workers who said their direct manager expects AI use in day-to-day work as of last October, up from 32% just eight months before, according to a survey from AI consulting firm Section</span></p><p class=\"\"><span>Even in an industry that tends to drive workplace trends, AI adoption hasn't been easy. Tech workers have many of the same feelings about AI as the broader population, including skepticism about how much time it's actually saving them. There's also the added anxiety of hearing their own CEOs talking about how AI will ultimately lead to smaller workforces.</span></p><p class=\"\"><span>More on this topic:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>What AI executives tell their own kids about the jobs of the future.   (Read)   </span></li><li class=\"listItem-bmN0_SHH\"><span>The do's and don'ts of using AI to write performance reviews. (Read)   </span></li><li class=\"listItem-bmN0_SHH\"><span>WSJ's Callum Borchers shares ways to stay sane in the AI skills race.   (Read) </span></li></ul><p class=\"\"><span>&amp;#129300; What are your thoughts on AI enforcement in the workplace? Send me your thoughts, questions and predictions at future@wsj.com (if you're reading this in your inbox, you can just hit reply).</span></p><p class=\"\"><span>More of What's Next: Apple's American Chip Push; Keeping Tabs on Grandma; a 'Fitbit for Farts'</span></p><p class=\"\"><span>Apple is pushing to build an all-American chip. Under pressure to diversify its supply chain away from Taiwan, the company is investing in domestic suppliers. To find out how far Apple still has to go, Rolfe Winkler went on an exclusive visit to several suppliers.</span></p><p class=\"\"><span>Personal Tech columnist  Nicole Nguyen says Apple should copy Samsung's new security screen ASAP. She tested a new smartphone feature called Privacy Display, which obscures mobile screens from people nearby — and says this new tech could keep us safer.</span></p><p class=\"\"><span>You can monitor mom and dad without becoming Big Brother. Devices ranging from in-home sensors to location trackers can help families keep tabs on their aging loved ones while also respecting their privacy, writes Julie Jargon.</span></p><p class=\"\"><span>It's called the \"Fitbit for farts,\" and it's no joke, writes Christopher Mims. Researchers have developed a tiny, battery-powered hydrogen sensor that continuously monitors a wearer's flatulence, with the aim of collecting data to improve digestive health.</span></p><p class=\"\"><span>Future Feedback</span></p><p class=\"\"><span>Last week, we reported on companies that are using converted jet engines to power data centers. Readers shared their thoughts on how these conversions will affect the power generation business:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>\"Airport noise next to landowners -- on top of the hum of the data   centers and emergency diesel backup?! We have several data centers being   built within five miles from our 'rural' houses -- some literally a few   hundred feet away. We're not happy as is. The proposed pace of   construction is not considering the real 'human' impact to neighbors.   County commissioners are only looking at dollar signs, and not human   impacts.\" -- Mark Slivka, Georgia   </span></li><li class=\"listItem-bmN0_SHH\"><span>\"This may be a godsend energy stopgap. Ultimately, more nuclear power is   the long-term solution -- but it is a long-term solution.\" -- T.G. Nelson,   Wisconsin   </span></li><li class=\"listItem-bmN0_SHH\"><span>\"This is a perfect example of how our capitalist economy operates. When   supply and demand are out of balance, increasing prices and lack of   supply bring new manufacturers and technologies into the market. 'The   invisible hand' is alive and well.\" -- Joseph Messino, New York   </span></li><li class=\"listItem-bmN0_SHH\"><span>\"If you think residential neighbors are upset about having data centers   built nearby in the latest version of Nimbyism, just wait to see the huge   'stink' (pun intended) they'll make about jet engine exhaust engulfing   their neighborhoods!\" -- Joseph Subits, Georgia </span></li></ul><p class=\"\"><span>(Responses have been condensed and edited.)</span></p><p class=\"\"><span>Elsewhere in the Future</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Women are falling in love with AI, and it's a problem for Beijing. (The   New York Times)   </span></li><li class=\"listItem-bmN0_SHH\"><span>America was winning the race to find Martian life. Then China jumped in.   (MIT Technology Review)   </span></li><li class=\"listItem-bmN0_SHH\"><span>Employers to job seekers: Your AI résumé isn't fooling anyone.   (The Washington Post) </span></li></ul><p class=\"\"><span>About Us</span></p><p class=\"\"><span>Thanks for reading The Future of Everything. We cover the innovation and tech transforming the way we live, work and play. This newsletter was written by Conor Grant. Get in touch with us at future@wsj.com. Got a tip for us? Here's how to submit.</span></p><p class=\"\"><span>See more from The Future of Everything at wsj.com/future-of-everything.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007719:0/",
            "pub_date": "2026-02-28 00:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2IB:0",
            "title": "BMW launches fresh recall over potential cable issue",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>German premium carmaker BMW </span><span> has launched a fresh recall affecting hundreds of thousands of vehicles worldwide over a potential fire hazard, according to KBA, Germany's motor vehicle authority.</span></p><p class=\"\"><span>The authority said on its website that 337,374 vehicles of the i7, i5, 5, 7 and M5 series were potentially affected, with manufacture dates between 2022 and 2025.</span></p><p class=\"\"><span>It warned that an improper installation of the cockpit wiring harness could cause damage to cables when replacing the microfilter, resulting in a short circuit with smoke development and fire.</span></p><p class=\"\"><span>\"No accidents are known to have occurred in connection with this fault pattern\", a BMW spokesperson was quoted as saying by local news agency dpa.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2IB:0-bmw-launches-fresh-recall-over-potential-cable-issue/",
            "pub_date": "2026-02-28 00:55:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EduSpL6ka:0",
            "title": "REG - Euronext Dublin - GEM Cancellation Notice (EURONEXT DUBLIN) [89321]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89321</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EduSpL6ka:0-reg-euronext-dublin-gem-cancellation-notice-euronext-dublin-89321/",
            "pub_date": "2026-02-28 00:55:31",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947398:0",
            "title": "CUERVO: Disciplined execution and U.S. distributor realignment set the stage for long-term growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tequila leadership was maintained despite industry contraction, with disciplined pricing and inventory management supporting margins. 2026 will be a transition year due to U.S. distributor realignment, with growth expected to resume in 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947398:0-cuervo-disciplined-execution-and-u-s-distributor-realignment-set-the-stage-for-long-term-growth/",
            "pub_date": "2026-02-28 00:55:31",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN10A:0",
            "title": "Bund yields head for steepest monthly drop since April as flight to safety gathers pace",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>AI-driven investment reassessment cools risk appetite</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>German Bunds seen as transitory safe asset</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gap between French and German yields narrowest since June</span></li></ul></span></div><span><p class=\"\"><span>By Niket  Nishant</span></p><p class=\"\"><span>    Germany's 10-year yield was set on Friday for its biggest monthly drop since last April's tariff turmoil, as government bonds globally benefit from investor anxiety over artificial intelligence and geopolitical tensions.</span></p><p class=\"\"><span>A burst of AI-driven investment has prompted investors to reassess both the durability of the spending spree and the scale of disruption that the technology could unleash on labour markets. </span></p><p class=\"\"><span>The reassessment has cooled risk appetite and triggered a flight to safe-haven assets such as government bonds. </span></p><p class=\"\"><span>Bond yields move inversely to prices. </span></p><p class=\"\"><span>The yield on 10-year Bunds, the euro zone benchmark, dipped 4.5 basis points to 2.649%, their lowest since November 13. It was on course to finish the month roughly 19 bps lower. (DE10YT=RR) </span></p><p class=\"\"><span>\"Capital flows are shifting to Europe and European debt is emerging as a transitory safe asset,\" said Ludovic Subran, chief economist at Allianz Investment Management. \"Global investors are increasingly using Europe, and particularly core markets like the German Bund, as a global safe asset substitute.\"</span></p><p class=\"\"><span>Investors are also tracking developments in the U.S.-Iran standoff. Talks on the longstanding nuclear dispute ended on Thursday without a breakthrough, though there were some signs of progress, according to mediating country Oman.</span></p><p class=\"\"><span>INFLATION DATA IN THE SPOTLIGHT</span></p><p class=\"\"><span>European Central Bank President Christine Lagarde said earlier this week that policymakers expect inflation to settle near their 2% target in the medium term.</span></p><p class=\"\"><span>Data released on Friday showed that inflation eased in several German states in February, while preliminary figures showed consumer prices in France rising more than expected, underscoring that the disinflation trend could be uneven across the bloc.</span></p><p class=\"\"><span>\"This does not, however, signal a marked resurgence in inflationary pressures,\" said ING's senior economist Charlotte de Montpellier.</span></p><p class=\"\"><span>\"France should therefore continue to be among the countries with the lowest inflation rates in the euro area.\"</span></p><p class=\"\"><span>The yield on France's 10-year OAT government bond was 3 bps lower at 3.22%, marking the sixth consecutive day of declines and hovering at its lowest since June. (FR10YT=RR). French bonds outperformed Bunds, with yields falling 20 bps in February.</span></p><p class=\"\"><span>The gap between French and German yields (DE10FR10=RR) was 54 bps on Friday, the lowest since June 10. It has shrunk in recent weeks after climbing to 71.6 bps in January.</span></p><p class=\"\"><span>Separately, the ECB's monthly survey showed euro zone consumers trimmed their inflation expectations last month. </span></p><p class=\"\"><span>The central bank is expected to hold rates at least through the end of the year, according to a Reuters poll of economists earlier this month. </span></p><p class=\"\"><span>The German two-year yield (DE2YT=RR), which is more sensitive to interest-rate expectations, was 4 bps lower at 2.01%.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN10A:0-bund-yields-head-for-steepest-monthly-drop-since-april-as-flight-to-safety-gathers-pace/",
            "pub_date": "2026-02-28 00:55:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7882Ua:0",
            "title": "REG - Polar Capital Hldgs Beazley PLC - Form 8.3 - Beazley PLC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7882U  Polar Capital Holdings PLC  27 February 2026   </span><p class=\"\"><span>FORM 8.3</span></p><p class=\"\"><span>PUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY</span></p><p class=\"\"><span>A PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE</span></p><p class=\"\"><span>Rule 8.3 of the Takeover Code (the \"Code\")</span></p><p class=\"\"><span>1.         KEY INFORMATION</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>(a) Full name of discloser:</span></p></td><td><p class=\"\"><span>Polar Capital LLP, the Investment Manager, disclosing on behalf of:</span></p><p class=\"\"><span>Polar Capital Funds PLC - UK Value Opportunities Fund</span></p><p class=\"\"><span>Barclays Multi-Manager Fund (UK) - Barclays UK Alpha Fund Polar</span></p><p class=\"\"><span>Polar Capital Funds PLC - Global Insurance Fund</span></p></td></tr><tr><td><p class=\"\"><span>(b) Owner or controller of interests and short positions disclosed, if different from 1(a):</span></p><p class=\"\"><span>     The naming of nominee or vehicle companies is insufficient.  For a trust, the trustee(s), settlor and beneficiaries must be named.</span></p></td><td></td></tr><tr><td><p class=\"\"><span>(c) Name of offeror/offeree in relation to whose relevant securities this form relates:</span></p><p class=\"\"><span>     Use a separate form for each offeror/offeree</span></p></td><td><p class=\"\"><span>Beazley PLC</span></p></td></tr><tr><td><p class=\"\"><span>(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:</span></p></td><td></td></tr><tr><td><p class=\"\"><span>(e) Date position held/dealing undertaken:</span></p><p class=\"\"><span>     For an opening position disclosure, state the latest practicable date prior to the disclosure</span></p></td><td><p class=\"\"><span>27/02/2026</span></p></td></tr><tr><td><p class=\"\"><span>(f)  In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?</span></p><p class=\"\"><span>     If it is a cash offer or possible cash offer, state \"N/A\"</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><p class=\"\"><span>2.         POSITIONS OF THE PERSON MAKING THE DISCLOSURE</span></p><p class=\"\"><span>If there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.</span></p><p class=\"\"><span>(a)        Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security:</span></p></td><td colspan=\"4\"><p class=\"\"><span>0.05 GBP Ordinary Shares</span></p></td></tr><tr><td></td><td colspan=\"2\"><p class=\"\"><span>Interests</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short positions</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td></tr><tr><td><p class=\"\"><span>(1) Relevant securities owned and/or controlled:</span></p></td><td><p class=\"\"><span>12,529,777</span></p></td><td><p class=\"\"><span>2.09</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(2) Cash-settled derivatives:</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(3) Stock-settled derivatives (including options) and agreements to purchase/sell:</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>     TOTAL:</span></p></td><td><p class=\"\"><span>12,529,777</span></p></td><td><p class=\"\"><span>2.09</span></p></td><td></td><td></td></tr></tbody></table></div><p class=\"\"><span>All interests and all short positions should be disclosed.</span></p><p class=\"\"><span>Details of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8 (Open Positions).</span></p><p class=\"\"><span>(b)        Rights to subscribe for new securities (including directors' and other employee options)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security in relation to which subscription right exists:</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details, including nature of the rights concerned and relevant percentages:</span></p></li></ul><p class=\"\"><span>3.         DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE</span></p><p class=\"\"><span>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.</span></p><p class=\"\"><span>The currency of all prices and other monetary amounts should be stated.</span></p><p class=\"\"><span>(a)        Purchases and sales</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>Purchase/sale</span></p></td><td><p class=\"\"><span>Number of securities</span></p></td><td><p class=\"\"><span>Price per unit</span></p></td></tr><tr><td><p class=\"\"><span>0.05 GBP Ordinary Shares</span></p></td><td><p class=\"\"><span>Sale</span></p></td><td><p class=\"\"><span>75,000</span></p></td><td><p class=\"\"><span>1,245.00 GBp</span></p></td></tr><tr><td><p class=\"\"><span>0.05 GBP Ordinary Shares</span></p></td><td><p class=\"\"><span>Sale</span></p></td><td><p class=\"\"><span>125,000</span></p></td><td><p class=\"\"><span>1,249.00 GBp</span></p></td></tr><tr><td><p class=\"\"><span>0.05 GBP Ordinary Shares</span></p></td><td><p class=\"\"><span>Sale</span></p></td><td><p class=\"\"><span>300,000</span></p></td><td><p class=\"\"><span>1,247.03 GBp</span></p></td></tr></tbody></table></div><p class=\"\"><span>(b)        Cash-settled derivative transactions</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. CFD</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. opening/closing a long/short position, increasing/reducing a long/short position</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of reference securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit</span></p></li></ul><p class=\"\"><span>(c)        Stock-settled derivative transactions (including options)</span></p><p class=\"\"><span>(i)         Writing, selling, purchasing or varying</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product description e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, purchasing, selling, varying etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities to which option relates</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price per unit</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Type</span></p><p class=\"\"><span>e.g. American, European etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Expiry date</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Option money paid/ received per unit</span></p></li></ul><p class=\"\"><span>(ii)        Exercise</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. call option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercising/ exercised against</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise price per unit</span></p></li></ul><p class=\"\"><span>(d)        Other dealings (including subscribing for new securities)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. subscription, conversion</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit (if applicable)</span></p></li></ul><p class=\"\"><span>4.         OTHER INFORMATION</span></p><p class=\"\"><span>(a)        Indemnity and other dealing arrangements</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:</span></p><p class=\"\"><span>Irrevocable commitments and letters of intent should not be included.  If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><p class=\"\"><span>(b)        Agreements, arrangements or understandings relating to options or derivatives</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:</span></p><p class=\"\"><span>(i)  the voting rights of any relevant securities under any option; or</span></p><p class=\"\"><span>(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:</span></p><p class=\"\"><span>If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><p class=\"\"><span>(c)        Attachments</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Is a Supplemental Form 8 (Open Positions) attached?</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NO</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Date of disclosure:</span></td><td><p class=\"\"><span>27/02/2026</span></p></td></tr><tr><td><span>Contact name:</span></td><td><p class=\"\"><span>Ellie Martin</span></p></td></tr><tr><td><span>Telephone number*:</span></td><td><p class=\"\"><span>+44 20 3862 2578</span></p></td></tr></tbody></table></div><p class=\"\"><span>Public disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.</span></p><p class=\"\"><span>The Panel's Market Surveillance Unit is available for consultation in relation to the Code's disclosure requirements on +44 (0)20 7638 0129.</span></p><p class=\"\"><span>*If the discloser is a natural person, a telephone number does not need to be included, provided contact information has been provided to the Panel's Market Surveillance Unit.</span></p><p class=\"\"><span>The Code can be viewed on the Panel's website at www.thetakeoverpanel.org.uk.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  RETUBSNRNSUUUAR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7882Ua:0-reg-polar-capital-hldgs-beazley-plc-form-8-3-beazley-plc/",
            "pub_date": "2026-02-28 00:56:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2FG:0",
            "title": "GM Leather Completes Capital Increase Of EUR 4.5 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>GM Leather SpA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COMPLETES CAPITAL INCREASE OF EURO 4.5 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ADDITIONAL SHARES SUBSCRIBED FOR EURO 2.1 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CAPITAL INCREASE WAS COMPLETED AT PRICE OF 0.76 EURPER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2FG:0-gm-leather-completes-capital-increase-of-eur-4-5-mln/",
            "pub_date": "2026-02-28 00:56:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2ID:0",
            "title": "Talgo FY Net Loss 98.2 Mln Euros",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Talgo SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET LOSS 98.2 MILLION EUROS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET SALES 618.2 MILLION EUROS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2ID:0-talgo-fy-net-loss-98-2-mln-euros/",
            "pub_date": "2026-02-28 00:56:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7904Ua:0",
            "title": "REG - Altona Rare Earths - TR1 - Notification of Holdings in Company",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7904U  Altona Rare Earths PLC  27 February 2026   </span><p class=\"\"><span>TR-1: Standard form for notification of major holdings</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"7\"><p class=\"\"><span>NOTIFICATION OF MAJOR HOLDINGS (to be sent to the relevant issuer and to the FCA in Microsoft Word format if possible)i</span></p></td></tr><tr><td colspan=\"7\"></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>1a. Identity of the issuer or the underlying issuer of existing shares to which voting rights are attachedii:</span></p></td><td colspan=\"4\"><p class=\"\"><span>Altona Rare Earths PLC</span></p></td></tr><tr><td colspan=\"7\"><p class=\"\"><span>1b. Please indicate if the issuer is a non-UK issuer (please mark with an \"X\" if appropriate)</span></p></td></tr><tr><td colspan=\"6\"><p class=\"\"><span>Non-UK issuer</span></p></td><td></td></tr><tr><td colspan=\"7\"><p class=\"\"><span>2. Reason for the notification (please mark the appropriate box or boxes with an \"X\")</span></p></td></tr><tr><td colspan=\"6\"><p class=\"\"><span>An acquisition or disposal of voting rights</span></p></td><td><p class=\"\"><span>  X</span></p></td></tr><tr><td colspan=\"6\"><p class=\"\"><span>An acquisition or disposal of financial instruments</span></p></td><td><p class=\"\"><span>X</span></p></td></tr><tr><td colspan=\"6\"><p class=\"\"><span>An event changing the breakdown of voting rights</span></p></td><td><p class=\"\"><span>X</span></p></td></tr><tr><td colspan=\"6\"><p class=\"\"><span>Other (please specify)iii: Placing diluting interest and new stock issuance</span></p></td><td></td></tr><tr><td colspan=\"7\"><p class=\"\"><span>3. Details of person subject to the notification obligationiv</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Name</span></p></td><td colspan=\"4\"><p class=\"\"><span>R S &amp; C A JENNINGS &amp; RELATED PARTY CATALYSE CAPITAL LTD</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>City and country of registered office (if applicable)</span></p></td><td colspan=\"4\"><p class=\"\"><span>York, UK</span></p></td></tr><tr><td colspan=\"7\"><p class=\"\"><span>4. Full name of shareholder(s) (if different from 3)v</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Name</span></p></td><td colspan=\"4\"></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>City and country of registered office (if applicable)</span></p></td><td colspan=\"4\"></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>5. Date on which the threshold was crossed or reachedvi:</span></p></td><td colspan=\"4\"><p class=\"\"><span>27 Feb 2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>6. Date on which issuer notified (DD/MM/YYYY):</span></p></td><td colspan=\"4\"><p class=\"\"><span>27 Feb 2026</span></p></td></tr><tr><td colspan=\"7\"><p class=\"\"><span>7. Total positions of person(s) subject to the notification obligation</span></p></td></tr><tr><td></td><td><p class=\"\"><span>% of voting rights attached to shares (total of 8. A)</span></p></td><td colspan=\"2\"><p class=\"\"><span>% of voting rights through financial instruments</span></p><p class=\"\"><span>(total of 8.B 1 + 8.B 2)</span></p></td><td><p class=\"\"><span>Total of both in % (8.A + 8.B)</span></p></td><td colspan=\"2\"><p class=\"\"><span>Total number of voting rights of issuervii</span></p></td></tr><tr><td><p class=\"\"><span>Resulting situation on the date on which threshold was crossed or reached</span></p></td><td><p class=\"\"><span>5.4%</span></p></td><td colspan=\"2\"><p class=\"\"><span>9.87%</span></p></td><td><p class=\"\"><span>15.27%</span></p></td><td colspan=\"2\"><p class=\"\"><span>374,682,301</span></p></td></tr><tr><td><p class=\"\"><span>Position of previous notification (if</span></p><p class=\"\"><span>applicable)</span></p></td><td><p class=\"\"><span>8.95%</span></p></td><td colspan=\"2\"><p class=\"\"><span>10.76%</span></p></td><td><p class=\"\"><span>23.07%</span></p></td><td colspan=\"2\"></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"10\"><p class=\"\"><span>8. Notified details of the resulting situation on the date on which the threshold was crossed or reachedviii</span></p></td></tr><tr><td colspan=\"10\"><p class=\"\"><span>A: Voting rights attached to shares</span></p></td></tr><tr><td colspan=\"2\" rowspan=\"2\"><p class=\"\"><span>Class/type of</span></p><p class=\"\"><span>shares</span></p><p class=\"\"><span>ISIN code (if possible)</span></p></td><td colspan=\"5\"><p class=\"\"><span>Number of voting rightsix</span></p></td><td colspan=\"3\"><p class=\"\"><span>% of voting rights</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Direct</span></p><p class=\"\"><span>(Art 9 of Directive 2004/109/EC) (DTR5.1)</span></p></td><td colspan=\"3\"><p class=\"\"><span>Indirect</span></p><p class=\"\"><span>(Art 10 of Directive 2004/109/EC) (DTR5.2.1)</span></p></td><td colspan=\"2\"><p class=\"\"><span>Direct</span></p><p class=\"\"><span>(Art 9 of Directive 2004/109/EC) (DTR5.1)</span></p></td><td><p class=\"\"><span>Indirect</span></p><p class=\"\"><span>(Art 10 of Directive 2004/109/EC) (DTR5.2.1)</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>GB00BFZNKV91</span></p></td><td colspan=\"2\"><p class=\"\"><span>20,382,304</span></p></td><td colspan=\"3\"><p class=\"\"><span>n/a</span></p></td><td colspan=\"2\"><p class=\"\"><span>5.4%</span></p></td><td><p class=\"\"><span>n/a</span></p></td></tr><tr><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"3\"></td><td colspan=\"2\"></td><td></td></tr><tr><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"3\"></td><td colspan=\"2\"></td><td></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>SUBTOTAL 8. A</span></p></td><td colspan=\"5\"><p class=\"\"><span>20,382,304</span></p></td><td colspan=\"3\"><p class=\"\"><span>5.4%</span></p></td></tr><tr><td colspan=\"10\"></td></tr><tr><td colspan=\"10\"><p class=\"\"><span>B 1: Financial Instruments according to Art. 13(1)(a) of Directive 2004/109/EC (DTR5.3.1.1 (a))</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Type of financial instrument</span></p></td><td><p class=\"\"><span>Expiration</span></p><p class=\"\"><span>datex</span></p></td><td colspan=\"3\"><p class=\"\"><span>Exercise/</span></p><p class=\"\"><span>Conversion Periodxi</span></p></td><td colspan=\"3\"><p class=\"\"><span>Number of voting rights that may be acquired if the instrument is</span></p><p class=\"\"><span>exercised/converted.</span></p></td><td><p class=\"\"><span>% of voting rights</span></p></td></tr><tr><td colspan=\"2\"></td><td></td><td colspan=\"3\"></td><td colspan=\"3\"></td><td></td></tr><tr><td colspan=\"2\"></td><td></td><td colspan=\"3\"></td><td colspan=\"3\"></td><td></td></tr><tr><td colspan=\"2\"></td><td></td><td colspan=\"3\"></td><td colspan=\"3\"></td><td></td></tr><tr><td colspan=\"2\"></td><td></td><td colspan=\"3\"><p class=\"\"><span>SUBTOTAL 8. B 1</span></p></td><td colspan=\"3\"></td><td></td></tr><tr><td colspan=\"10\"></td></tr><tr><td colspan=\"10\"><p class=\"\"><span>B 2: Financial Instruments with similar economic effect according to Art. 13(1)(b) of Directive 2004/109/EC (DTR5.3.1.1 (b))</span></p></td></tr><tr><td><p class=\"\"><span>Type of financial instrument</span></p></td><td colspan=\"2\"><p class=\"\"><span>Expiration</span></p><p class=\"\"><span>datex</span></p></td><td colspan=\"2\"><p class=\"\"><span>Exercise/</span></p><p class=\"\"><span>Conversion Period xi</span></p></td><td colspan=\"3\"><p class=\"\"><span>Physical or cash</span></p><p class=\"\"><span>settlementxii</span></p></td><td><p class=\"\"><span>Number of voting rights</span></p></td><td><p class=\"\"><span>% of voting rights</span></p></td></tr><tr><td><p class=\"\"><span>Warrant</span></p></td><td colspan=\"2\"><p class=\"\"><span>Dec 2027</span></p></td><td colspan=\"2\"><p class=\"\"><span>1 pence</span></p></td><td colspan=\"3\"><p class=\"\"><span>Physical</span></p></td><td><p class=\"\"><span>12,000,000</span></p></td><td><p class=\"\"><span>3.20%</span></p></td></tr><tr><td><p class=\"\"><span>Warrant</span></p></td><td colspan=\"2\"><p class=\"\"><span>Jun 2028</span></p></td><td colspan=\"2\"><p class=\"\"><span>1.5 pence</span></p></td><td colspan=\"3\"><p class=\"\"><span>Physical</span></p></td><td><p class=\"\"><span>25,000,000</span></p></td><td><p class=\"\"><span>6.67%</span></p></td></tr><tr><td></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"3\"></td><td></td><td></td></tr><tr><td></td><td colspan=\"2\"></td><td colspan=\"2\"></td><td colspan=\"3\"><p class=\"\"><span>SUBTOTAL 8.B.2</span></p></td><td></td><td><p class=\"\"><span>10.32%</span></p></td></tr><tr><td colspan=\"10\"></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"5\"><p class=\"\"><span>9. Information in relation to the person subject to the notification obligation (please mark the</span></p><p class=\"\"><span>applicable box with an \"X\")</span></p></td></tr><tr><td colspan=\"4\"><p class=\"\"><span>Person subject to the notification obligation is not controlled by any natural person or legal entity and does not control any other undertaking(s) holding directly or indirectly an interest in the (underlying) issuerxiii</span></p></td><td><p class=\"\"><span>X</span></p></td></tr><tr><td colspan=\"4\"><p class=\"\"><span>Full chain of controlled undertakings through which the voting rights and/or the</span></p><p class=\"\"><span>financial instruments are effectively held starting with the ultimate controlling natural person or legal entityxiv (please add additional rows as necessary)</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Namexv</span></p></td><td><p class=\"\"><span>% of voting rights if it equals or is higher than the notifiable threshold</span></p></td><td><p class=\"\"><span>% of voting rights through financial instruments if it equals or is higher than the notifiable threshold</span></p></td><td colspan=\"2\"><p class=\"\"><span>Total of both if it equals or is higher than the notifiable threshold</span></p></td></tr><tr><td></td><td></td><td></td><td colspan=\"2\"></td></tr><tr><td></td><td></td><td></td><td colspan=\"2\"></td></tr><tr><td></td><td></td><td></td><td colspan=\"2\"></td></tr><tr><td></td><td></td><td></td><td colspan=\"2\"></td></tr><tr><td></td><td></td><td></td><td colspan=\"2\"></td></tr><tr><td colspan=\"5\"></td></tr><tr><td colspan=\"5\"><p class=\"\"><span>10. In case of proxy voting, please identify:</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Name of the proxy holder</span></p></td><td colspan=\"3\"><p class=\"\"><span>n/a</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>The number and % of voting rights held</span></p></td><td colspan=\"3\"><p class=\"\"><span>n/a</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>The date until which the voting rights will be held</span></p></td><td colspan=\"3\"><p class=\"\"><span>n/a</span></p></td></tr><tr><td colspan=\"5\"></td></tr><tr><td colspan=\"5\"><p class=\"\"><span>11. Additional informationxvi</span></p></td></tr><tr><td colspan=\"5\"></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Place of completion</span></p></td><td><p class=\"\"><span>UK</span></p></td></tr><tr><td><p class=\"\"><span>Date of completion</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  HOLEAKAXASLKEFA</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7904Ua:0-reg-altona-rare-earths-tr1-notification-of-holdings-in-company/",
            "pub_date": "2026-02-28 00:56:24",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7887Ua:0",
            "title": "REG - Baillie Gifford UK - Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7887U  Baillie Gifford UK Growth Trust PLC  27 February 2026   </span><p class=\"\"><span>Baillie Gifford UK Growth Trust plc (BGUK)</span></p><p class=\"\"><span>Legal Entity Identifier: 549300XX386SYWX8XW22</span></p><p class=\"\"><span>Purchase of Own Securities</span></p><p class=\"\"><span>On 27 February 2026, the Company announces the purchase of 121,000 Ordinary Shares at a price of 205.50p. The shares purchased will be held in Treasury.</span></p><p class=\"\"><span>Following the transaction there will be 48,355,009 shares held in Treasury.</span></p><p class=\"\"><span>The shares in issue less the total number of shares in Treasury are 112,562,175.</span></p><p class=\"\"><span>The above figure (112,562,175) may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the FCA's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><span>Baillie Gifford &amp; Co Limited</span></p><p class=\"\"><span>Company Secretaries</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Regulated Information Classification: Acquisition or disposal of the issuer's own shares</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  POSSEMFMWEMSELE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7887Ua:0-reg-baillie-gifford-uk-transaction-in-own-shares/",
            "pub_date": "2026-02-28 00:48:19",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7890Ua:0",
            "title": "REG - Puma AIM VCT PLC - Total Voting Rights",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7890U  Puma AIM VCT PLC  27 February 2026   </span><p class=\"\"><span>Puma AIM VCT plc (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\")</span></p><p class=\"\"><span>Total Voting Rights</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Puma AIM VCT plc announces that as at 27 February 2026 its issued share capital consists of 8,069,950 Ordinary Shares. The Company holds no shares in treasury and the total number of voting rights in the Company is 8,069,950.</span></p><p class=\"\"><span>The above figure of 8,069,950 may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the Financial Conduct Authority's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><span>For further information please contact:</span></p><p class=\"\"><span>Amy Coburn</span></p><p class=\"\"><span>Company Secretary</span></p><p class=\"\"><span>Puma AIM VCT plc</span></p><p class=\"\"><span>020 3893 1838</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  TVRQDLFLQLLZBBD</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7890Ua:0-reg-puma-aim-vct-plc-total-voting-rights/",
            "pub_date": "2026-02-28 00:48:58",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7884Ua:0",
            "title": "REG - B&M European - Migration Completion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7884U  B&amp;M European Value Retail S.A.  27 February 2026   </span><p class=\"\"><span>NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION, IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN OR INTO OR FROM ANY JURISDICTION WHERE TO DO SO WOULD CONSTITUTE A VIOLATION OF THE RELEVANT LAWS OR REGULATIONS OF SUCH JURISDICTION</span></p><p class=\"\"><span>FOR IMMEDIATE RELEASE</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Completion of Migration</span></p><p class=\"\"><span>Further to the announcement on 25 February 2026 in relation to the approval and publication of its prospectus (the \"Prospectus\"), the Company is pleased to announce that all of the conditions to completion of the Migration have now been satisfied, and the Migration has become effective.</span></p><p class=\"\"><span>As a result of the Migration having been completed, the Company is now registered in Jersey as B&amp;M European Value Retail plc under company number 164498. The new registered address for B&amp;M Jersey is 26 New Street, St Helier, Jersey JE2 3RA. Notwithstanding that it is now registered as a public limited company under the laws of Jersey, the Company has continuity of legal personality pursuant to the Migration.</span></p><p class=\"\"><span>An application has been made to the Financial Conduct Authority (\"FCA\") for the admission of 1,005,038,256 ordinary shares of £0.10 each in the capital of B&amp;M Jersey (the \"B&amp;M Jersey Shares\") to the Equity Shares (Commercial Companies) Category of the FCA and to trading on the main market for listed security of London Stock Exchange plc (the \"Admission\"). It is expected that Admission will occur at 8:00 a.m. on 2 March 2026.</span></p><p class=\"\"><span>B&amp;M Jersey Shares held in uncertificated form will be credited to the relevant CREST accounts upon admission which will occur at 8:00 a.m. on 2 March 2026. A small number of shareholders with suspended voting rights will receive a letter from B&amp;M Jersey outlining the information such shareholders will be required to provide in order to receive their share certificates. Upon receipt of the requested information, the share certificates in respect of B&amp;M Jersey Shares held in certificated form will be despatched to such shareholders. For further information please refer to the FAQ document here.</span></p><p class=\"\"><span>The new ISIN for B&amp;M Jersey is JE00BVSYJW51. The ticker for B&amp;M Jersey is unchanged and will therefore remain as BME.</span></p><p class=\"\"><span>Capitalised terms used but not defined herein have the meanings given to them in the Prospectus published by the Company on 25 February 2026.</span></p><p class=\"\"><span>Merrill Lynch International (\"BofA Securities\") is acting as sponsor under the UK Listing Rules in relation to Admission.</span></p><p class=\"\"><span>Enquiries</span></p><p class=\"\"><span>B&amp;M European Value Retail plc</span></p><p class=\"\"><span>Alexander Simpson (Group General Counsel)</span></p><p class=\"\"><span>+44 (0) 151 728 5400 Ext. 6363</span></p><p class=\"\"><span>Andrew Orchard (Head of Investor Relations)</span></p><p class=\"\"><span>Investor.relations@bandmretail.com</span></p><p class=\"\"><span>Important Notice</span></p><p class=\"\"><span>The release, publication or distribution of this announcement in jurisdictions other than the United Kingdom may be restricted by law and therefore any persons who are subject to the laws of any jurisdiction other than the United Kingdom should inform themselves about, and observe, any applicable requirements. The information disclosed in this announcement may not be the same as that which would have been disclosed if this announcement had been prepared in accordance with the laws and regulations of any jurisdiction outside of the United Kingdom.</span></p><p class=\"\"><span>This announcement is not intended to, and does not constitute, or form part of, an offer to sell or an invitation to purchase or subscribe for any securities or a solicitation of any vote or approval in any jurisdiction. This announcement does not constitute a prospectus or a prospectus equivalent document.</span></p><p class=\"\"><span>Disclaimer</span></p><p class=\"\"><span>BofA Securities, which is authorised in the United Kingdom by the Prudential Regulation Authority (\"PRA\") and regulated in the United Kingdom by the FCA and the PRA, is acting exclusively for the Company and no one else in connection with the Admission, and will not be responsible to anyone other the Company for providing the protections afforded to its clients or for providing advice in relation to the Admission or any transaction, matter, or arrangement referred to in this announcement.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  MSCAKOBQABKDPBB</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7884Ua:0-reg-b-m-european-migration-completion/",
            "pub_date": "2026-02-28 00:48:59",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007678:0",
            "title": "Brink's Stock Slides on Plans to Acquire NCR Atleos",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Kelly Cloonan</span></p><p class=\"\"><span>Shares of Brink's Company declined on plans to acquire NCR Atleos for about $4 billion in cash and stock in a deal that combines two major players in the ATM business.</span></p><p class=\"\"><span>Brink's stock slid 17% to $113.20 on Friday. Shares have gained 23% in the past year</span></p><p class=\"\"><span>Truist Securities analysts said the share weakness is likely driven in part by Brink's increased leverage under the deal. Under the transaction, Brink's would assume about $2.6 billion of NCR Atleos' debt. The company also secured $4.5 billion in new bridge financing to pay for part of the cash portion of the deal.</span></p><p class=\"\"><span>Investors may also have concerns that the deal could pose a distraction given the company expects it will take about a year to close, the analysts said.</span></p><p class=\"\"><span>Still, the analysts said they are optimistic the deal should benefit Brink's, forecasting combined revenue of $11.8 billion in 2029, up from Brink's revenue of $5.26 billion in 2025.</span></p><p class=\"\"><span>\"We embrace the combination,\" the analysts said. \"The ATM Outsourcing market is thriving as banks focus on core internal ops.\"</span></p><p class=\"\"><span>Both Brink's and NCR Atleos operate a vast number of ATMs around the globe. Brink's is also known for securely transporting cash, as well as stocking it into ATMs through their ubiquitous Brink's trucks.</span></p><p class=\"\"><span>Brinks said the deal would boost its scale and geographic footprint, adding 78,000 owned-and-operated ATMs to its own network. Brinks fully operates 135,000 ATMs. Both companies also service a much broader footprint of cash-dispensing machines.</span></p><p class=\"\"><span>The deal includes 13.3 million shares of Brink's common stock and $2.2 billion in cash, plus the assumption of about $2.6 billion of NCR Atleos' debt.</span></p><p class=\"\"><span>Under the deal, Brink's will acquire each outstanding share of NCR Atleos for $30 in cash and about 0.16 share of Brink's common stock. Upon closing, Brink's shareholders would own about 78% and NCR Atleos shareholders would own about 22% of the outstanding shares of Brink's common stock, the companies said.</span></p><p class=\"\"><span>The cash portion of the purchase price will be financed with cash as well as new debt raised.</span></p><p class=\"\"><span>The transaction has been approved by the boards of both companies. It is expected to close in the first quarter of 2027.</span></p><p class=\"\"><span>Write to Kelly Cloonan at kelly.cloonan@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007678:0/",
            "pub_date": "2026-02-28 00:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947383:0",
            "title": "Braemar Hotels & Resorts: Resort-driven growth and asset sales offset renovation impacts as the company pursues a sale",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Q4 and full-year 2025 saw modest revenue and EBITDA growth, led by strong resort performance and strategic asset sales. Renovations and weather disruptions impacted results, but the portfolio remains resilient as the company explores a potential sale and continues deleveraging.</span></p><p class=\"\"><span>Based on Braemar Hotels &amp; Resorts Q4 2025 Audio Transcript — Feb. 27 2026</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947383:0-braemar-hotels-resorts-resort-driven-growth-and-asset-sales-offset-renovation-impacts-as-the-company-pursues-a-sale/",
            "pub_date": "2026-02-28 00:49:12",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0NP:0",
            "title": "Individual investor bears hit 3-month high - AAII ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Main US indexes red; Dow down most</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Financials weakest S&amp;P 500 sector; Staples leads gainers</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Euro STOXX 600 index up ~0.2%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Dollar slips; bitcoin down &gt;2%; gold up 1%; crude up &gt;2%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US 10-Year Treasury yield falls to ~3.97%</span></li></ul></span></div><span><p class=\"\"><span>INDIVIDUAL INVESTOR BEARS HIT 3-MONTH HIGH - AAII</span></p><p class=\"\"><span>Pessimism among individual investors about the short-term outlook for the U.S. stock market rose in the latest American Association of Individual Investors (AAII) Sentiment Survey. With this, both optimism and neutral sentiment retreated.</span></p><p class=\"\"><span>Meanwhile, nearly half of investors surveyed described earnings guidance given by companies during the fourth-quarter 2025 earnings season as \"approximately what I expected.\"</span></p><p class=\"\"><span>AAII reported that bearish sentiment, or expectations that stock prices will fall over the next six months, added 2.8 percentage points to 39.8% (highest since 42.7% on November 26, 2025). Bearish sentiment is above its historical average of 31.0% for the sixth time in 13 weeks.</span></p><p class=\"\"><span>Bullish sentiment, or expectations that stock prices will rise over the next six months, dipped 1.3 percentage points to 33.2%. Bullish sentiment is below its historical average of 37.5% for the second time in 13 weeks.  </span></p><p class=\"\"><span>Neutral sentiment, or expectations that stock prices will stay essentially unchanged over the next six months,  declined 1.5 percentage points to 27.0%. Neutral sentiment is below its historical average of 31.5% for the 84th time in 86 weeks.</span></p><p class=\"\"><span>The bull-bear spread lost 4.2 percentage points to about –6.6% from around –2.4% last week. The bull-bear spread is below its historical average of 6.5% for just the third time in 13 weeks.</span></p><p class=\"\"><span>In this week's special question, AAII asked its members how they would describe the earnings guidance given by companies during the Q4 2025 earnings season.</span></p><p class=\"\"><span>Here is AAII's graphic showing how they responded:</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1100px;aspect-ratio:1.8333333333333335\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZN0NP-bd561e685dcea2488e2593697c9c7705-resized.webp\" type=\"image/webp\"/><img alt=\"AAIISQ02272026\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZN0NP-bd561e685dcea2488e2593697c9c7705-resized.webp\" style=\"background-color:#faf6f5\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">AAIISQ02272026</span></figcaption></figure></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0NP:0-individual-investor-bears-hit-3-month-high-aaii/",
            "pub_date": "2026-02-28 00:49:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACShV3n7a:0",
            "title": "Rue & Ziffra Opens Deltona Office to Expand Personal Injury Services in West Volusia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>New location on Providence Boulevard is now serving clients</span></p><p class=\"\"><span>DELTONA, FLORIDA / ACCESS Newswire / February 27, 2026 / Rue &amp; Ziffra, a Central Florida personal injury law firm, has opened a new office at 1676 Providence Blvd., Deltona, FL 32725. This office will help its legal team handle local personal injury cases, including vehicle crashes, negligence claims and related matters.</span></p><p class=\"\"><span>The expansion enhances legal access for West Volusia residents recovering from serious accidents and builds on the firm's established presence in the region. Founded in 1976 by John D. Rue and Allan L. Ziffra, the firm has multiple offices serving Volusia and Flagler counties.</span></p><p class=\"\"><span>\"Deltona is a growing community, and when families get hurt, they should not have to travel far to get answers,\" said Allan Ziffra, president and founding partner of Rue &amp; Ziffra. \"This office puts our team closer to the people who need help navigating medical bills, missed work and the insurance process after a crash or other injury.\"</span></p><p class=\"\"><span>Rue &amp; Ziffra focuses on personal injury law, representing clients in cases involving automobile and motorcycle collisions, medical malpractice, workers' compensation, wrongful death and other injury-related claims. The firm also handles social security disability cases, led by attorney Luis Gracia, a Board-Certified Social Security Disability Lawyer, this department is dedicated to guiding individuals through the complexities of the SSD application or appeals process.</span></p><p class=\"\"><span>The firm maintains strong community ties in Volusia and Flagler counties through their RZCares initiative, as they participate and sponsor local events and organizations, Rue &amp; Ziffra is dedicated to giving back.</span></p><p class=\"\"><span>Residents seeking a consultation can contact the Deltona office directly or visit the firm's website at https://rueziffra.com/.</span></p><p class=\"\"><span>###</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Rue &amp; Ziffra</span></strong></p><p class=\"\"><span>Founded by John D. Rue and Allan L. Ziffra, the personal-injury law firm of Rue &amp; Ziffra has served the Central Florida community for more than 50 years. The firm's commitment to its</span></p><p class=\"\"><span>profession and its clients has earned it a reputation as one of the top personal-injury law firms in Central Florida. Known for handling everything from automobile and motorcycle accidents to medical malpractice, wrongful death, and social security and disability cases, Rue &amp; Ziffra has recovered millions of dollars for injured clients and their families. With a staff of ten attorneys, the firm maintains offices in Port Orange, DeLand, Palm Coast, Daytona Beach, Winter Park, Deltona and Lake Mary. For more information, visit www.rueziffra.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media contact:</span></strong></p><p class=\"\"><span>Lisa Viccaro</span></p><p class=\"\"><span>LisaV@RueZiffra.com</span></p><p class=\"\"><span>(386) 788-7700</span></p><p class=\"\"><span>https://rueziffra.com/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Rue &amp; Ziffra</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACShV3n7a:0/",
            "pub_date": "2026-02-28 00:50:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw1mYNrn:0",
            "title": "Mission Critical Metals Corp. Acquires the Medvedi Potok Tin Project (Bear Creek Tin Property), Slovakia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>Vancouver, British Columbia –TheNewswire - February 27, 2026 – MissionCritical Metals Corp. (“Mission” or the “Company”), a BritishColumbia incorporated company, is pleased to announce that it hasacquired the Medvedi Potok TinProject, also known as the Bear Creek Tin Property (the “Project”), located innorthern Slovakia.</span></p><p class=\"\"><span>The Project was previously held by Military Metals Corp., (TSX: MILI) which in January 2026 transferred the asset to Hallgarten &amp;Company Limited in exchange for a 1% royalty on future production,subject to a buyback right of CAD$210,000.</span></p><p class=\"\"><span>Hallgarten &amp; Company Limited acquired the Medvedi Potok TinProject on January 6, 2026.Subsequently, on January 13,2026, Hallgarten transferred and assigned 100% of its interestin the Project to Mission Critical Metals Corp.</span></p><p class=\"\"><span>Previously, on January 8,2026, Military Metals announced it had exercised its buybackright to retire a 1% net smelter royalty (“NSR”) covering itsSlovakian portfolio, including the Medvedi Potok Tin Project. As aresult, the Project was rendered royalty-free prior to its transfer toHallgarten.</span></p><p class=\"\"><span>The Medvedi Potok Tin Project is considered prospective for tinmineralization within a historically active mining jurisdiction. Tinis classified as a critical mineral due to its essential role inelectronics, semiconductors, renewable energy systems, and advancedmanufacturing technologies.</span></p><p class=\"\"><span>Christopher Ecclestone, President of Mission Critical Metals Corp.,commented:</span></p><p class=\"\"><span>“The acquisition of the Medvedi Potok Tin Project represents asignificant step forward in our strategy to build a portfolio ofhigh-quality critical metals assets in stable European jurisdictions.With global demand for tin continuing to grow — particularly in theelectronics and energy transition sectors — we believe this projectoffers compelling long-term potential.”</span></p><p class=\"\"><span>Mission Critical Metals Corp. intends to review all historical datarelated to the Project and develop a staged exploration andadvancement plan in accordance with applicable Slovakian regulatoryrequirements.</span></p><p class=\"\"><span>Transaction Disclosure</span></p><p class=\"\"><span>The acquisition of the Project was negotiated at arm’s length. Noneof the vendors are non-arm’s length parties to the Company (as suchterm is defined under the policies of the Canadian Securities Exchangeor the TSX Venture Exchange). The transaction does not constitute afundamental change, reverse takeover, or change of business for theCompany.</span></p><p class=\"\"><span>About Mission Critical MetalsCorp.</span></p><p class=\"\"><span>Mission Critical Metals Corp. is a British Columbia-based mineralexploration company focused on the acquisition, exploration, anddevelopment of critical mineral projects in strategic jurisdictions.The Company’s objective is to build shareholder value throughdisciplined asset selection and responsible project development.</span></p><p class=\"\"><span>For further information, pleasecontact:</span></p><p class=\"\"><span>Mission Critical Metals Corp.</span></p><p class=\"\"><span>Joseph Miller, Director.</span></p><p class=\"\"><span>joseph.miller@intrapax.com</span></p><p class=\"\"><span>www.missioncriticalmetals.com</span></p><p class=\"\"><span>Forward-Looking Statements</span></p><p class=\"\"><span>This news release contains forward-looking statements within themeaning of applicable securities laws. Forward-looking statementsinvolve known and unknown risks, uncertainties, and other factors thatmay cause actual results to differ materially from those anticipatedin such statements. Readers are cautioned not to place undue relianceon forward-looking statements.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw1mYNrn:0-mission-critical-metals-corp-acquires-the-medvedi-potok-tin-project-bear-creek-tin-property-slovakia/",
            "pub_date": "2026-02-28 00:50:02",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947388:0",
            "title": "PSI: 2025 revenue rose 1% and free cash flow 17%, with strong returns to shareholders",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 1% to CAD 419 million in 2025 despite industry declines, with strong performance in Solar and Energy Storage and record Revenue per Industry Day in North American Drilling. Free cash flow rose 17% and nearly all was returned to shareholders.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947388:0-psi-2025-revenue-rose-1-and-free-cash-flow-17-with-strong-returns-to-shareholders/",
            "pub_date": "2026-02-28 00:50:10",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947389:0",
            "title": "ESCA: Improved margins and cash flow in Q4 2025 set the stage for growth-focused 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw improved margins and cash flow despite a 2.2% sales decline, driven by operational discipline and accretive acquisitions. The outlook for 2026 is cautious, with increased capital investment and a focus on profitable growth amid ongoing tariff and consumer demand uncertainties.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947389:0-esca-improved-margins-and-cash-flow-in-q4-2025-set-the-stage-for-growth-focused-2026/",
            "pub_date": "2026-02-28 00:50:14",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7891Ua:0",
            "title": "REG - VPC Specialty - Dividend Declaration",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7891U  VPC Specialty Lending Invest. PLC  27 February 2026   </span><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>VPC Specialty Lending Investments PLC</span></p><p class=\"\"><span>(the \"Company\")</span></p><p class=\"\"><span>DIVIDEND DECLARATION</span></p><p class=\"\"><span>The Board of Directors of the Company has declared an interim dividend of 1.70 pence per share in respect of the period to 31 December 2025. The dividend will be paid on 9 April 2026 to shareholders on the register as at 13 March 2026. The ex-dividend date is 12 March 2026. The 1.70 pence per share dividend represents the net revenue return earned by the Company for the period ended 31 December 2025.</span></p><p class=\"\"><span>The next dividend declaration is likely to be announced in February 2027, then every year thereafter. The dividends will not be less than 85% of net revenue return of the period distributed, as previously disclosed.</span></p><p class=\"\"><span>The Company has elected to designate all of the interim dividend as an interest distribution to its shareholders, thereby \"streaming\" income from interest-bearing investments into dividends that will be taxed in the hands of shareholders as interest income.  No income tax will therefore be deducted at source from this, or from future interest distributions.</span></p><p class=\"\"><span>Enquiries</span></p><p class=\"\"><span>For further information, please contact:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Victory Park Capital</span></p><p class=\"\"><span>Gordon Watson</span></p><p class=\"\"><span>Sora Monachino</span></p></td><td><p class=\"\"><span>via Winterflood (below)</span></p><p class=\"\"><span>info@vpcspecialtylending.com</span></p></td></tr><tr><td><p class=\"\"><span>Winterflood Securities Limited</span></p></td><td><p class=\"\"><span>Tel: +44 20 3100 0000</span></p></td></tr><tr><td><p class=\"\"><span>Joe Winkley</span></p></td><td></td></tr><tr><td><p class=\"\"><span>MUFG Corporate Governance Limited (Company</span></p><p class=\"\"><span>Secretary</span></p></td><td><p class=\"\"><span>Tel: +44 20 7954 9567</span></p><p class=\"\"><span>Email: VPC@cm.mpms.mufg.com</span></p></td></tr></tbody></table></div><p class=\"\"><span>About VPC Specialty Lending Investments PLC</span></p><p class=\"\"><span>VPC Specialty Lending Investments PLC (Company No. 9385218) is a UK listed investment trust focused on realising the Company's investments in an orderly manner, that is, with a view to achieving a balance between returning cash to Shareholders promptly and maximising value.</span></p><p class=\"\"><span>Further information on VPC Specialty Lending Investments PLC is available at: http://vpcspecialtylending.com.</span></p><p class=\"\"><span>LEI: 549300UPEXC5DQB81P34</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  DIVSEAFMWEMSELE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7891Ua:0-reg-vpc-specialty-dividend-declaration/",
            "pub_date": "2026-02-28 00:50:18",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7889Ua:0",
            "title": "REG - Inter-American Dev - Issue of Debt",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><span>RNS Number : 7889U  Inter-American Development Bank  27 February 2026   </span><p class=\"\"><span>PRICING SUPPLEMENT</span></p><p class=\"\"><span>Inter-American Development Bank</span></p><p class=\"\"><span>Global Debt Program</span></p><p class=\"\"><span>Series No.:  980</span></p><p class=\"\"><span>Tranche No.: 7</span></p><p class=\"\"><span>USD100,000,000 Floating Rate Notes due March 13, 2030 (the \"Notes\") as from February 27, 2026, to be consolidated and form a single series with the Bank's USD600,000,000 Floating Rate Notes due March 13, 2030, issued on March 13, 2025 (the \"Series 980 Tranche 1 Notes\"), the Bank's USD200,000,000 Floating Rate Notes due March 13, 2030, issued on May 22, 2025 (the \"Series 980 Tranche 2 Notes\"), the Bank's USD600,000,000 Floating Rate Notes due March 13, 2030, issued on June 10, 2025 (the \"Series 980 Tranche 3 Notes\"), the Bank's USD100,000,000 Floating Rate Notes due March 13, 2030, issued on August 12, 2025 (the \"Series 980 Tranche 4 Notes\"), the Bank's USD200,000,000 Floating Rate Notes due March 13, 2030, issued on August 28, 2025 (the \"Series 980 Tranche 5 Notes\") and the Bank's USD100,000,000 Floating Rate Notes due March 13, 2030, issued on January 30, 2026 (the \"Series 980 Tranche 6 Notes\")</span></p><p class=\"\"><span>Issue Price:  100.641 percent plus 74 days' accrued interest</span></p><p class=\"\"><span>Application has been made for the Notes to be admitted to the</span></p><p class=\"\"><span>Official List of the Financial Conduct Authority and</span></p><p class=\"\"><span>to trading on the London Stock Exchange plc's</span></p><p class=\"\"><span>UK Regulated Market</span></p><p class=\"\"><span>Barclays</span></p><p class=\"\"><span>The date of this Pricing Supplement is February 25, 2026.</span></p><p class=\"\"><span>Terms used herein shall be deemed to be defined as such for the purposes of the Terms and Conditions (the \"Conditions\") set forth in the Prospectus dated July 28, 2020 (the \"Prospectus\") (which for the avoidance of doubt does not constitute a base prospectus for the purposes of Regulation (EU) 2017/1129 (as amended, the \"Prospectus Regulation\"), the Public Offers and Admissions to Trading Regulations 2024, or the Prospectus Rules: Admission to Trading on a Regulated Market sourcebook).  This Pricing Supplement must be read in conjunction with the Prospectus.  This document is issued to give details of an issue by the Inter-American Development Bank (the \"Bank\") under its Global Debt Program and to provide information supplemental to the Prospectus.  Complete information in respect of the Bank and this offer of the Notes is only available on the basis of the combination of this Pricing Supplement and the Prospectus.</span></p><p class=\"\"><span>UK MiFIR product governance / Retail investors, professional investors and ECPs target market - See \"General Information-Additional Information Regarding the Notes-Matters relating to UK MiFIR\" below.</span></p><p class=\"\"><span>Terms and Conditions</span></p><p class=\"\"><span>The following items under this heading \"Terms and Conditions\" are the particular terms which relate to the issue the subject of this Pricing Supplement.  Together with the applicable Conditions (as defined above), which are expressly incorporated hereto, these are the only terms that form part of the form of Notes for such issue. The Uniform Fiscal Agency Agreement, dated as of July 20, 2006, as may be amended, restated, superseded or otherwise modified from time to time, between the Bank and the Federal Reserve Bank of New York, as fiscal and paying agent, has been superseded by the Uniform Fiscal Agency Agreement, dated as of December 19, 2024 (the \"New Fiscal Agency Agreement\"), as may be amended, restated, superseded or otherwise modified from time to time, between the Bank and the 12 Federal Reserve Banks. All references to the \"Fiscal Agency Agreement\" under the heading \"Terms and Conditions of the Notes\" and elsewhere in the Prospectus shall be deemed references to the New Fiscal Agency Agreement.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>1. </span></p></td><td><p class=\"\"><span>Series No.:</span></p></td><td><p class=\"\"><span>980</span></p></td></tr><tr><td><p class=\"\"><span>2. </span></p></td><td><p class=\"\"><span>Tranche No.:</span></p></td><td><p class=\"\"><span>7</span></p></td></tr><tr><td><p class=\"\"><span>3.     </span></p></td><td><p class=\"\"><span>Aggregate Principal Amount:</span></p></td><td><p class=\"\"><span>USD100,000,000</span></p><p class=\"\"><span>As from the Issue Date, the Notes will be consolidated and form a single series with the Series 980 Tranche 1 Notes, Series 980 Tranche 2 Notes, Series 980 Tranche 3 Notes, Series 980 Tranche 4 Notes, Series 980 Tranche 5 Notes, and Series 980 Tranche 6 Notes.</span></p></td></tr><tr><td><p class=\"\"><span>4.     </span></p></td><td><p class=\"\"><span>Issue Price:</span></p></td><td><p class=\"\"><span>USD101,482,000 which amount represents the sum of (a) 100.641 percent of the Aggregate Principal Amount plus (b) the amount of USD841,000 representing 74 days' accrued interest, inclusive.</span></p></td></tr><tr><td><p class=\"\"><span>5.     </span></p></td><td><p class=\"\"><span>Issue Date:</span></p></td><td><p class=\"\"><span>February 27, 2026</span></p></td></tr><tr><td><p class=\"\"><span>6.     </span></p></td><td><p class=\"\"><span>Form of Notes</span></p><p class=\"\"><span>(Condition 1(a)):</span></p></td><td><p class=\"\"><span> Book-entry only</span></p></td></tr><tr><td><p class=\"\"><span>7.     </span></p></td><td><p class=\"\"><span>Authorized Denomination(s)</span></p><p class=\"\"><span>(Condition 1(b)):</span></p></td><td><p class=\"\"><span>USD1,000 and integral multiples thereof</span></p></td></tr><tr><td><p class=\"\"><span>8.     </span></p></td><td><p class=\"\"><span>Specified Currency</span></p><p class=\"\"><span>(Condition 1(d)):</span></p></td><td><p class=\"\"><span>United States Dollars (USD) being the lawful currency of the United States of America</span></p></td></tr><tr><td><p class=\"\"><span>9.     </span></p></td><td><p class=\"\"><span>Specified Principal Payment Currency</span></p><p class=\"\"><span>(Conditions 1(d) and 7(h)):</span></p></td><td><p class=\"\"><span>USD</span></p></td></tr><tr><td><p class=\"\"><span>10.   </span></p></td><td><p class=\"\"><span>Specified Interest Payment Currency</span></p><p class=\"\"><span>(Conditions 1(d) and 7(h)):</span></p></td><td><p class=\"\"><span>USD</span></p></td></tr><tr><td><p class=\"\"><span>11.   </span></p></td><td><p class=\"\"><span>Maturity Date</span></p><p class=\"\"><span>(Condition 6(a)):</span></p></td><td><p class=\"\"><span>March 13, 2030</span></p></td></tr><tr><td><p class=\"\"><span>12.   </span></p></td><td><p class=\"\"><span>Interest Basis</span></p><p class=\"\"><span>(Condition 5):</span></p></td><td><p class=\"\"><span>Floating Interest Rate (Condition 5(II))</span></p></td></tr><tr><td><p class=\"\"><span>13.   </span></p></td><td><p class=\"\"><span>Interest Commencement Date</span></p><p class=\"\"><span>(Condition 5(III)):</span></p></td><td><p class=\"\"><span>December 15, 2025</span></p></td></tr><tr><td><p class=\"\"><span>14.   </span></p></td><td><p class=\"\"><span>Floating Rate (Condition 5(II)):</span></p></td><td></td></tr><tr><td></td><td><p class=\"\"><span>(a)           Calculation Amount (if different than Principal Amount of the Note):</span></p></td><td><p class=\"\"><span>Not Applicable</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(b)           Business Day Convention:</span></p></td><td><p class=\"\"><span>Following Business Day Convention</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(c)           Specified Interest Period:</span></p></td><td><p class=\"\"><span>The period beginning on, and including, the Interest Commencement Date to, but excluding, the first Interest Payment Date and each successive period beginning on, and including, an Interest Payment Date to, but excluding, the next succeeding Interest Payment Date, in each case, as adjusted in accordance with the relevant Business Day Convention.</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(d)          Interest Payment Date:</span></p></td><td><p class=\"\"><span>Quarterly in arrear on March 13, June 13, September 13, and December 13 in each year, commencing on March 13, 2026, up to and including the Maturity Date.</span></p><p class=\"\"><span>Each Interest Payment Date is subject to adjustment in accordance with the Business Day Convention (but, with respect to the Maturity Date, with no adjustment to the amount of interest otherwise calculated).</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(e)           Interest Period Date:</span></p></td><td><p class=\"\"><span>Each Interest Payment Date</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(f)           Reference Rate:</span></p></td><td><p class=\"\"><span>Subject to the Compounded SOFR Fallback Provisions below, for any Interest Period, \"Compounded SOFR\" will be calculated by the Calculation Agent on each Interest Determination Date as follows and the resulting percentage will be rounded, if necessary, to the fourth decimal place of a percentage point, 0.00005 being rounded upwards:</span></p><p class=\"\"><span>where:</span></p><p class=\"\"><span>\"Observation Period\" means, in respect of each Interest Period, the period from, and including, the date which is five U.S. Government Securities Business Days preceding the first date of such Interest Period to, but excluding, the date which is five U.S. Government Securities Business Days preceding the Interest Payment Date for such Interest Period (or in the final Interest Period, the Maturity Date).</span></p><p class=\"\"><span>\"SOFR IndexStart\" means the SOFR Index value on the day which is five U.S. Government Securities Business Days preceding the first date of the relevant Interest Period.</span></p><p class=\"\"><span>\"SOFR IndexEnd\" means the SOFR Index value on the day which is five U.S. Government Securities Business Days preceding the Interest Payment Date relating to such Interest Period (or in the final Interest Period, the Maturity Date).</span></p><p class=\"\"><span>\"dc\" means the number of calendar days in the Observation Period relating to such Interest Period.</span></p><p class=\"\"><span>\"SOFR Administrator\" means the Federal Reserve Bank of New York (\"NY Fed\") as administrator of the secured overnight financing rate (\"SOFR\") (or a successor administrator of SOFR)</span></p><p class=\"\"><span>\"SOFR Index\" in relation to any U.S. Government Securities Business Day shall be the value published by the SOFR Administrator on its website (on or about 3:00 p.m. (New York Time) on such U.S. Government Securities Business Day (the \"SOFR Index Determination Time\"). Currently, the SOFR Administrator publishes the SOFR Index on its website at https://apps.newyorkfed.org/markets/autorates/sofr-avg-ind. In the event that the value originally published by the SOFR Administrator on or about 3:00 p.m. (New York Time) on any U.S. Government Securities Business Day is subsequently corrected and such corrected value is published by the SOFR Administrator on the original date of publication, then such corrected value, instead of the value that was originally published, shall be deemed the SOFR Index as of the SOFR Index Determination Time in relation to such U.S. Government Securities Business Day.</span></p><p class=\"\"><span>Compounded SOFR Fallback Provisions:</span></p><p class=\"\"><span>SOFR Index Unavailable:</span></p><p class=\"\"><span>If a SOFR IndexStart or SOFR IndexEnd is not published on the associated Interest Determination Date and a Benchmark Transition Event and its related Benchmark Replacement Date have not occurred with respect to SOFR Index or SOFR, \"Compounded SOFR\" means, for the applicable Interest Period for which such index is not available, the rate of return on a daily compounded interest investment calculated by the Calculation Agent in accordance with the formula for SOFR Averages, and definitions required for such formula, published on the SOFR Administrator's website at https://www.newyorkfed.org/markets/treasury-repo-reference-rates-information. For the purposes of this provision, references in the SOFR Averages compounding formula and related definitions to \"calculation period\" shall be replaced with \"Observation Period\" and the words \"that is, 30-, 90-, or 180- calendar days\" shall be removed. If the daily SOFR (\"SOFRi\") does not so appear for any day, \"i\" in the Observation Period, SOFRi for such day \"i\" shall be SOFR published in respect of the first preceding U.S. Government Securities Business Day for which SOFR was published on the SOFR Administrator's website.</span></p><p class=\"\"><span>Effect of a Benchmark Transition Event: </span></p><p class=\"\"><span>If the Issuer determines on or prior to the relevant Reference Time that a Benchmark Transition Event and its related Benchmark Replacement Date have occurred with respect to the then-current Benchmark, the Benchmark Replacement will replace the then-current Benchmark for all purposes relating to the Notes in respect of all determinations on such date and for all determinations on all subsequent dates.</span></p><p class=\"\"><span>In connection with the implementation of a Benchmark Replacement, the Issuer will have the right to make Benchmark Replacement Conforming Changes from time to time.</span></p><p class=\"\"><span>Any determination, decision or election that may be made by the Issuer pursuant to this section, including any determination with respect to a tenor, rate or adjustment or of the occurrence or non-occurrence of an event, circumstance or date and any decision to take or refrain from taking any action or any selection:</span></p><p class=\"\"><span>(1) will be conclusive and binding absent manifest error;</span></p><p class=\"\"><span>(2) will be made in the sole discretion of the Issuer; and</span></p><p class=\"\"><span>(3) notwithstanding anything to the contrary in the documentation relating to the Notes described herein, shall become effective without consent from the holders of the Notes or any other party.</span></p><p class=\"\"><span>\"Benchmark\" means, initially, SOFR Index; provided that if the Issuer determines on or prior to the Reference Time that a Benchmark Transition Event and its related Benchmark Replacement Date have occurred with respect to SOFR Index (or the published daily SOFR used in the calculation thereof) then \"Benchmark\" means the applicable Benchmark Replacement for the SOFR Index; and provided further that if the Issuer determines on or prior to the Reference Time that a Benchmark Transition Event and its related Benchmark Replacement Date have occurred with respect to the then-current Benchmark (or the daily published component used in the calculation thereof), then \"Benchmark\" means the applicable Benchmark Replacement for the then-current Benchmark.</span></p><p class=\"\"><span>\"Benchmark Replacement\" means the first alternative set forth in the order below that can be determined by the Issuer as of the Benchmark Replacement Date.</span></p><p class=\"\"><span>(1) the sum of: (a) the alternate rate of interest that has been selected or recommended by the Relevant Governmental Body as the replacement for the then-current Benchmark and (b) the Benchmark Replacement Adjustment;</span></p><p class=\"\"><span>(2) the sum of: (a) the ISDA Fallback Rate and (b) the Benchmark Replacement Adjustment; or</span></p><p class=\"\"><span>(3) the sum of: (a) the alternate rate of interest that has been selected by the Issuer as the replacement for the then-current Benchmark giving due consideration to any industry-accepted rate of interest as a replacement for the then-current Benchmark for U.S. dollar-denominated floating rate notes at such time and (b) the Benchmark Replacement Adjustment;</span></p><p class=\"\"><span>Provided that, if a Benchmark Replacement Date has occurred with regard to the daily published component used in the calculation of a Benchmark, but not with regard to the Benchmark itself, \"Benchmark Replacement\" means the references to the alternatives determined in accordance with clauses (1), (2) or (3) above for such daily published components.</span></p><p class=\"\"><span>\"Benchmark Replacement Adjustment\" means the first alternative set forth in the order below that can be determined by the Issuer as of the Benchmark Replacement Date:</span></p><p class=\"\"><span>(1) the spread adjustment, or method for calculating or determining such spread adjustment, (which may be a positive or negative value or zero) that has been selected or recommended by the Relevant Governmental Body for the applicable Unadjusted Benchmark Replacement;</span></p><p class=\"\"><span>(2) if the applicable Unadjusted Benchmark Replacement is equivalent to the ISDA Fallback Rate, the ISDA Fallback Adjustment; or</span></p><p class=\"\"><span>(3) the spread adjustment (which may be a positive or negative value or zero) that has been selected by the Issuer giving due consideration to any industry-accepted spread adjustment, or method for calculating or determining such spread adjustment, for the replacement of the then-current Benchmark (or the daily published component used in the calculation thereof) with the applicable Unadjusted Benchmark Replacement for U.S. dollar-denominated floating rate notes at such time.</span></p><p class=\"\"><span>\"Benchmark Replacement Conforming Changes\" means, with respect to any Benchmark Replacement, any technical, administrative or operational changes (including changes to the timing and frequency of determining rates and making payments of interest, rounding of amounts or tenors, and other administrative matters) that the Issuer decides may be appropriate to reflect the adoption of such Benchmark Replacement in a manner substantially consistent with market practice (or, if the Issuer decides that adoption of any portion of such market practice is not administratively feasible or if the Issuer determines that no market practice for use of the Benchmark Replacement exists, in such other manner as the Issuer determines is reasonably necessary); provided that, for the avoidance of doubt, if a Benchmark Replacement Date has occurred with regard to the daily published component used in the calculation of a Benchmark, but not with regard to the Benchmark itself, \"Benchmark Replacement Conforming Changes\" shall also mean that the Issuer may calculate the Benchmark Replacement for such Benchmark in accordance with the formula for and method of calculating such Benchmark last in effect prior to Benchmark Replacement Date affecting such component, substituting the affected component with the relevant Benchmark Replacement for such component.</span></p><p class=\"\"><span>\"Benchmark Replacement Date\" means the earliest to occur of the following events with respect to the then-current Benchmark (or the daily published component used in the calculation thereof):</span></p><p class=\"\"><span>(1) in the case of clause (1) or (2) of the definition of \"Benchmark Transition Event,\" the later of (a) the date of the public statement or publication of information referenced therein and (b) the date on which the administrator of the Benchmark permanently or indefinitely ceases to provide the Benchmark (or such component); or</span></p><p class=\"\"><span>(2) in the case of clause (3) of the definition of \"Benchmark Transition Event,\" the later of (x) the date of the public statement or publication of information referenced therein and (y) the first date on which such Benchmark (or such component) is no longer representative per such statement or publication.</span></p><p class=\"\"><span>For the avoidance of doubt, if the event that gives rise to the Benchmark Replacement Date occurs on the same day as, but earlier than, the Reference Time in respect of any determination, the Benchmark Replacement Date will be deemed to have occurred prior to the Reference Time for such determination.</span></p><p class=\"\"><span>\"Benchmark Transition Event\" means the occurrence of one or more of the following events with respect to the then-current Benchmark (or the daily published component used in the calculation thereof):</span></p><p class=\"\"><span>(1) a public statement or publication of information by or on behalf of the administrator of the Benchmark (or such component) announcing that such administrator has ceased or will cease to provide the Benchmark (or such component), permanently or indefinitely, provided that, at the time of such statement or publication, there is no successor administrator that will continue to provide the Benchmark (or such component); or</span></p><p class=\"\"><span>(2) a public statement or publication of information by the regulatory supervisor for the administrator of the Benchmark (or such component), the central bank for the currency of the Benchmark (or such component), an insolvency official with jurisdiction over the administrator for the Benchmark (or such component), a resolution authority with jurisdiction over the administrator for the Benchmark (or such component) or a court or an entity with similar insolvency or resolution authority over the administrator for the Benchmark, which states that the administrator of the Benchmark (or such component) has ceased or will cease to provide the Benchmark (or such component) permanently or indefinitely, provided that, at the time of such statement or publication, there is no successor administrator that will continue to provide the Benchmark (or such component); or</span></p><p class=\"\"><span>(3) a public statement or publication of information by the regulatory supervisor for the administrator of the Benchmark announcing (A) that such Benchmark (or its component) is no longer, or as of a specified future date will no longer be, capable of being representative, or is non-representative, of the underlying market and economic reality that such Benchmark (or its component) is intended to measure as required by applicable law or regulation and as determined by the regulatory supervisor in accordance with applicable law or regulation and (B) that the intention of that statement or publication is to engage contractual triggers for fallbacks activated by pre-cessation announcements by such supervisor (howsoever described) in contracts.</span></p><p class=\"\"><span>\"ISDA Definitions\" means the 2006 ISDA Definitions published by the International Swaps and Derivatives Association, Inc. or any successor thereto, as amended or supplemented from time to time, or any successor definitional booklet for interest rate derivatives published from time to time.</span></p><p class=\"\"><span>\"ISDA Fallback Adjustment\" means the spread adjustment (which may be a positive or negative value or zero) that would apply for derivatives transactions referencing the ISDA Definitions to be determined upon the occurrence of an index cessation event with respect to the Benchmark (or the daily published component used in the calculation thereof).</span></p><p class=\"\"><span>\"ISDA Fallback Rate\" means the rate that would apply for derivatives transactions referencing the ISDA Definitions to be effective upon the occurrence of an index cessation date with respect to the Benchmark (or the daily published component used in the calculation thereof) for the applicable tenor excluding the applicable ISDA Fallback Adjustment.</span></p><p class=\"\"><span>\"Reference Time\" with respect to any determination of the Benchmark (or the daily published component used in the calculation thereof) means (1) if the Benchmark is SOFR Index, the SOFR Index Determination Time, and (2) if the Benchmark is not SOFR Index, the time determined by the Issuer after giving effect to the Benchmark Replacement Conforming Changes.</span></p><p class=\"\"><span>\"Relevant Governmental Body\" means the Federal Reserve Board and/or the Federal Reserve Bank of New York, or a committee officially endorsed or convened by the Federal Reserve Board and/or the Federal Reserve Bank of New York or any successor thereto.</span></p><p class=\"\"><span>\"Unadjusted Benchmark Replacement\" means the Benchmark Replacement excluding the Benchmark Replacement Adjustment.</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(g)           Calculation Agent:</span></p></td><td><p class=\"\"><span>Citibank, N.A., London Branch</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(h)           Interest Determination Date:</span></p></td><td><p class=\"\"><span>The date five U.S. Government Securities Business Days prior to the end of each Interest Period.</span></p></td></tr><tr><td><p class=\"\"><span>15.   </span></p></td><td><p class=\"\"><span>Other Floating Rate Terms (Conditions 5(II) and (III)):</span></p></td><td></td></tr><tr><td></td><td><p class=\"\"><span>(a)          Minimum Interest Rate:</span></p></td><td><p class=\"\"><span>0 percent per annum</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(b)           Spread:</span></p></td><td><p class=\"\"><span>plus (+) 0.39 percent per annum</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(c)           Floating Rate Day Count Fraction if not actual/360:</span></p></td><td><p class=\"\"><span>Actual/360</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(d)          Relevant Banking Center:</span></p></td><td><p class=\"\"><span>New York</span></p></td></tr><tr><td><p class=\"\"><span>16.   </span></p></td><td><p class=\"\"><span>Relevant Financial Center:</span></p></td><td><p class=\"\"><span>New York</span></p></td></tr><tr><td><p class=\"\"><span>17.   </span></p></td><td><p class=\"\"><span>Relevant Business Day:</span></p></td><td><p class=\"\"><span>A day which is a U.S. Government Securities Business Day and a New York Business Day.</span></p></td></tr><tr><td><p class=\"\"><span>18.   </span></p></td><td><p class=\"\"><span>Issuer's Optional Redemption (Condition 6(e)):</span></p></td><td><p class=\"\"><span>No</span></p></td></tr><tr><td><p class=\"\"><span>19.   </span></p></td><td><p class=\"\"><span>Redemption at the Option of the Noteholders (Condition 6(f)):</span></p></td><td><p class=\"\"><span>No</span></p></td></tr><tr><td><p class=\"\"><span>20.   </span></p></td><td><p class=\"\"><span>Early Redemption Amount (including accrued interest, if applicable) (Condition 9):</span></p></td><td><p class=\"\"><span>In the event the Notes become due and payable as provided in Condition 9 (Default), the Early Redemption Amount with respect to the minimum Authorized Denomination will be USD1,000 plus accrued interest, if any, as determined in accordance with \"13. Floating Rate (Condition 5(II)) and \"14. Other Floating Rate Terms (Conditions 5(II) and (III)).</span></p></td></tr><tr><td><p class=\"\"><span>21.   </span></p></td><td><p class=\"\"><span>Governing Law:</span></p></td><td><p class=\"\"><span>New York</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>Other Relevant Terms</span></p></td><td></td></tr><tr><td><p class=\"\"><span>1.  </span></p></td><td><p class=\"\"><span>Listing (if yes, specify Stock</span></p><p class=\"\"><span>Exchange):</span></p></td><td><p class=\"\"><span>Application has been made for the Notes to be admitted to the Official List of the Financial Conduct Authority and to trading on the London Stock Exchange plc's UK Regulated Market</span></p></td></tr><tr><td><p class=\"\"><span>2.  </span></p></td><td><p class=\"\"><span>Details of Clearance System Approved by the Bank and the</span></p><p class=\"\"><span>Global Agent and Clearance and</span></p><p class=\"\"><span>Settlement Procedures:</span></p></td><td><p class=\"\"><span>Federal Reserve Bank of New York; Euroclear Bank SA/NV; Clearstream Banking S.A.</span></p></td></tr><tr><td><p class=\"\"><span>3.  </span></p></td><td><p class=\"\"><span>Syndicated:</span></p></td><td><p class=\"\"><span>No</span></p></td></tr><tr><td><p class=\"\"><span>4.  </span></p></td><td><p class=\"\"><span>Commissions and Concessions:</span></p></td><td><p class=\"\"><span>0.00% of the Aggregate Principal Amount</span></p></td></tr><tr><td><p class=\"\"><span>5.     </span></p></td><td><p class=\"\"><span>Estimated Total Expenses:</span></p></td><td><p class=\"\"><span>The Issuer has agreed to pay for all material expenses related to the issuance of the Notes, including legal expenses of the Dealer.</span></p></td></tr><tr><td><p class=\"\"><span>6.     </span></p></td><td><p class=\"\"><span>Codes:</span></p></td><td></td></tr><tr><td></td><td><p class=\"\"><span>(a)        Common Code:</span></p></td><td><p class=\"\"><span>302519889</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(b)        ISIN:</span></p></td><td><p class=\"\"><span>US4581X0ET13</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(c)        CUSIP:</span></p></td><td><p class=\"\"><span>4581X0ET1</span></p></td></tr><tr><td><p class=\"\"><span>7.     </span></p></td><td><p class=\"\"><span>Identity of Dealer:</span></p></td><td><p class=\"\"><span>Barclays Bank PLC</span></p></td></tr><tr><td><p class=\"\"><span>8.     </span></p></td><td><p class=\"\"><span>Additional Risk Factors:</span></p></td><td><p class=\"\"><span>As set forth in the Supplemental Prospectus Information</span></p></td></tr><tr><td><p class=\"\"><span>9.     </span></p></td><td><p class=\"\"><span>Selling Restrictions:</span></p><p class=\"\"><span>(a)        United States:</span></p></td><td><p class=\"\"><span>Under the provisions of Section 11(a) of the Inter-American Development Bank Act, the Notes are exempted securities within the meaning of Section 3(a)(2) of the U.S. Securities Act of 1933, as amended, and Section 3(a)(12) of the U.S. Securities Exchange Act of 1934, as amended.</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(b)        United Kingdom:</span></p></td><td><p class=\"\"><span>The Dealer represents and agrees that (a) it has only communicated or caused to be communicated and will only communicate or cause to be communicated an invitation or inducement to engage in investment activity (within the meaning of Section 21 of the Financial Services and Markets Act 2000 (the \"FSMA\")) received by it in connection with the issue or sale of the Notes in circumstances in which Section 21(1) of the FSMA does not apply to the Bank, and (b) it has complied and will comply with all applicable provisions of the FSMA with respect to anything done by it in relation to such Notes in, from or otherwise involving the UK.</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(c)       Singapore:</span></p></td><td><p class=\"\"><span>The Dealer represents, warrants and agrees, that it has not offered or sold any Notes or caused the Notes to be made the subject of an invitation for subscription or purchase and will not offer or sell any Notes or cause the Notes to be made the subject of an invitation for subscription or purchase, and has not circulated or distributed, nor will it circulate or distribute the Prospectus, this Pricing Supplement or any other document or material in connection with the offer or sale, or invitation for subscription or purchase, of the Notes, whether directly or indirectly, to any person in Singapore other than: (i) to an institutional investor (as defined in Section 4A of the SFA) pursuant to Section 274 of the SFA or (ii) to an accredited investor (as defined in Section 4A of the SFA) pursuant to and in accordance with the conditions specified in Section 275 of the SFA and (where applicable) Regulation 3 of the Securities and Futures (Classes of Investors) Regulations 2018 of Singapore.</span></p><p class=\"\"><span>Investors should note that there may be restrictions on the secondary sale of the Notes under Section 276 of the SFA.</span></p><p class=\"\"><span>Any reference to the SFA is a reference to the Securities and Futures Act 2001 of Singapore and a reference to any term that is defined in the SFA or any provision in the SFA is a reference to that term or provision as amended or modified from time to time including by such of its subsidiary legislation as may be applicable at the relevant time.</span></p><p class=\"\"><span>In the case of the Notes being offered into Singapore in a primary or subsequent distribution, and solely for the purposes of its obligations pursuant to Section 309B of the SFA, the Issuer has determined, and hereby notifies all relevant persons (as defined in Section 309A of the SFA) that the Notes are \"prescribed capital markets products\" (as defined in the Securities and Futures (Capital Markets Products) Regulations 2018 of Singapore) and Excluded Investment Products (as defined in MAS Notice SFA 04-N12: Notice on the Sale of</span></p></td></tr><tr><td></td><td></td><td><p class=\"\"><span>Investment Products and MAS Notice FAA-N16: Notice on Recommendations on Investment Products).</span></p></td></tr><tr><td></td><td><p class=\"\"><span>(d)       General:</span></p></td><td><p class=\"\"><span>No action has been or will be taken by the Issuer that would permit a public offering of the Notes, or possession or distribution of any offering material relating to the Notes in any jurisdiction where action for that purpose is required.  Accordingly, the Dealer agrees that it will observe all applicable provisions of law in each jurisdiction in or from which it may offer or sell Notes or distribute any offering material.</span></p></td></tr></tbody></table></div><p class=\"\"><span>General Information</span></p><p class=\"\"><span>Additional Information Regarding the Notes</span></p><p class=\"\"><span>1.         Matters relating to UK MiFIR</span></p><p class=\"\"><span>The Bank does not fall under the scope of application of the UK MiFIR regime.  Consequently, the Bank does not qualify as an \"investment firm\", \"manufacturer\" or \"distributor\" for the purposes of UK MiFIR.</span></p><p class=\"\"><span>UK MiFIR product governance / Retail investors, professional investors and ECPs target market - Solely for the purposes of the UK manufacturer's product approval process, the target market assessment in respect of the Notes has led to the conclusion that: (i) the target market for the Notes is retail clients and eligible counterparties, each as defined in COBS, and professional clients, as defined in UK MiFIR; and (ii) all channels for distribution of the Notes are appropriate. Any person subsequently offering, selling or recommending the Notes (a \"distributor\") should take into consideration the UK manufacturer's target market assessment; however, a distributor subject to the UK MiFIR Product Governance Rules is responsible for undertaking its own target market assessment in respect of the Notes (by either adopting or refining the UK manufacturer's target market assessment) and determining appropriate distribution channels.</span></p><p class=\"\"><span>For the purposes of this provision, (i) the expression \"UK manufacturer\" means the Dealer, (ii) the expression \"COBS\" means the FCA Handbook Conduct of Business Sourcebook, (iii) the expression \"UK MiFIR\" means Regulation (EU) No 600/2014 as it forms part of UK domestic law by virtue of the European Union (Withdrawal) Act 2018, as amended, and (iv) the expression \"UK MiFIR Product Governance Rules\" means the FCA Handbook Product Intervention and Product Governance Sourcebook.</span></p><p class=\"\"><span>2.           Supplemental Prospectus Information</span></p><p class=\"\"><span>            The Prospectus is hereby supplemented with the following information, which shall be deemed to be incorporated in, and to form part of, the Prospectus.</span></p><p class=\"\"><span>The Prospectus and this Pricing Supplement do not describe all of the risks and other ramifications of an investment in the Notes.  An investment in the Notes entails risks not associated with an investment in a conventional fixed rate or floating rate debt security.  Investors should consult their own financial and legal advisors about the risks associated with an investment in the Notes and the suitability of investing in the Notes in light of their particular circumstances, and possible scenarios for economic, interest rate and other factors that may affect their investment.</span></p><p class=\"\"><span>The Secured Overnight Financing Rate is a Relatively New Reference Rate and its Composition and Characteristics are Not the Same as LIBOR.</span></p><p class=\"\"><span>On June 22, 2017, the Alternative Reference Rates Committee (\"ARRC\") convened by the Board of Governors of the Federal Reserve System and the Federal Reserve Bank of New York identified the Secured Overnight Financing Rate (\"SOFR\") as the rate that, in the consensus view of the ARRC, represented best practice for use in certain new U.S. dollar derivatives and other financial contracts.  SOFR is a broad measure of the cost of borrowing cash overnight collateralized by U.S. treasury securities, and has been published by the Federal Reserve Bank of New York since April 2018.  The Federal Reserve Bank of New York has also begun publishing historical indicative SOFR from 2014.  Investors should not rely on any historical changes or trends in SOFR as an indicator of future changes in SOFR.</span></p><p class=\"\"><span>The composition and characteristics of SOFR are not the same as those of LIBOR, and SOFR is fundamentally different from LIBOR for two key reasons.  First, SOFR is a secured rate, while LIBOR is an unsecured rate.  Second, SOFR is an overnight rate, while LIBOR is a forward-looking rate that represents interbank funding over different maturities (e.g., three months).  As a result, there can be no assurance that SOFR (including Compounded SOFR) will perform in the same way as LIBOR would have at any time, including, without limitation, as a result of changes in interest and yield rates in the market, market volatility or global or regional economic, financial, political, regulatory, judicial or other events.</span></p><p class=\"\"><span>SOFR May be More Volatile Than Other Benchmark or Market Rates.</span></p><p class=\"\"><span>Since the initial publication of SOFR, daily changes in SOFR have, on occasion, been more volatile than daily changes in other benchmark or market rates, such as USD LIBOR.  Although changes in Compounded SOFR generally are not expected to be as volatile as changes in daily levels of SOFR, the return on and value of the Notes may fluctuate more than floating rate securities that are linked to less volatile rates.  In addition, the volatility of SOFR has reflected the underlying volatility of the overnight U.S. Treasury repo market.  The Federal Reserve Bank of New York has at times conducted operations in the overnight U.S. Treasury repo market in order to help maintain the federal funds rate within a target range.  There can be no assurance that the Federal Reserve Bank of New York will continue to conduct such operations in the future, and the duration and extent of any such operations is inherently uncertain.  The effect of any such operations, or of the cessation of such operations to the extent they are commenced, is uncertain and could be materially adverse to investors in the Notes.</span></p><p class=\"\"><span>Any Failure of SOFR to Gain Market Acceptance Could Adversely Affect the Notes.</span></p><p class=\"\"><span>According to the ARRC, SOFR was developed for use in certain U.S. dollar derivatives and other financial contracts as an alternative to USD LIBOR in part because it is considered a good representation of general funding conditions in the overnight U.S. Treasury repurchase agreement market. However, as a rate based on transactions secured by U.S. Treasury securities, it does not measure bank-specific credit risk and, as a result, is less likely to correlate with the unsecured short-term funding costs of banks. This may mean that market participants would not consider SOFR a suitable replacement or successor for all of the purposes for which USD LIBOR historically has been used (including, without limitation, as a representation of the unsecured short-term funding costs of banks), which may, in turn, lessen market acceptance of SOFR. Any failure of SOFR to gain market acceptance could adversely affect the return on and value of the Notes and the price at which investors can sell the Notes in the secondary market.</span></p><p class=\"\"><span>In addition, if SOFR does not prove to be widely used as a benchmark in securities that are similar or comparable to the Notes, the trading price of the Notes may be lower than those of securities that are linked to rates that are more widely used. Similarly, market terms for floating-rate debt securities linked to SOFR, such as the spread over the base rate reflected in interest rate provisions or the manner of compounding the base rate, may evolve over time, and trading prices of the Notes may be lower than those of later-issued SOFR-based debt securities as a result. Investors in the Notes may not be able to sell the Notes at all or may not be able to sell the Notes at prices that will provide them with a yield comparable to similar investments that have a developed secondary market, and may consequently suffer from increased pricing volatility and market risk.</span></p><p class=\"\"><span>The Rate of Interest on the Notes is Based on a Compounded SOFR Rate and the SOFR Index, which is Relatively New in the Marketplace.</span></p><p class=\"\"><span>For each Interest Period, the Rate of Interest on the Notes is based on Compounded SOFR, which is calculated using the SOFR Index published by the Federal Reserve Bank of New York according to the specific formula described in paragraph 13 under \"Terms and Conditions\" above (the \"Floating Rate Note Provisions\"), not the SOFR rate published on or in respect of a particular date during such Interest Period or an arithmetic average of SOFR rates during such period. For this and other reasons, the Rate of Interest on the Notes during any Interest Period will not necessarily be the same as the Rate of Interest on other SOFR-linked investments that use an alternative basis to determine the applicable interest rate. Further, if the SOFR rate in respect of a particular date during an Interest Period is negative, its contribution to the SOFR Index will be less than one, resulting in a reduction to Compounded SOFR used to calculate the interest payable on the Notes on the Interest Payment Date for such Interest Period.</span></p><p class=\"\"><span>Very limited market precedent exists for securities that use SOFR as the interest rate and the method for calculating an interest rate based upon SOFR in those precedents varies. In addition, the Federal Reserve Bank of New York only began publishing the SOFR Index on March 2, 2020. Accordingly, the use of the SOFR Index or the specific formula for the Compounded SOFR rate used in the Notes may not be widely adopted by other market participants, if at all. If the market adopts a different calculation method, that would likely adversely affect the market value of the Notes.</span></p><p class=\"\"><span>Compounded SOFR with Respect to a Particular Interest Period Will Only be Capable of Being Determined Near the End of the Relevant Interest Period.</span></p><p class=\"\"><span>The level of Compounded SOFR applicable to a particular Interest Period and, therefore, the amount of interest payable with respect to such Interest Period will be determined on the Interest Determination Date for such Interest Period. Because each such date is near the end of such Interest Period, you will not know the amount of interest payable with respect to a particular Interest Period until shortly prior to the related Interest Payment Date and it may be difficult for you to reliably estimate the amount of interest that will be payable on each such Interest Payment Date. In addition, some investors may be unwilling or unable to trade the Notes without changes to their information technology systems, both of which could adversely impact the liquidity and trading price of the Notes.</span></p><p class=\"\"><span>The SOFR Index May be Modified or Discontinued and the Notes May Bear Interest by Reference to a Rate Other than Compounded SOFR, which Could Adversely Affect the Value of the Notes.</span></p><p class=\"\"><span>The SOFR Index is published by the Federal Reserve Bank of New York based on data received by it from sources other than the Issuer, and the Issuer has no control over its methods of calculation, publication schedule, rate revision practices or availability of the SOFR Index at any time.  There can be no guarantee, particularly given its relatively recent introduction, that the SOFR Index will not be discontinued or fundamentally altered in a manner that is materially adverse to the interests of investors in the Notes. If the manner in which the SOFR Index is calculated, including the manner in which SOFR is calculated, is changed, that change may result in a reduction in the amount of interest payable on the Notes and the trading prices of the Notes.  In addition, the Federal Reserve Bank of New York may withdraw, modify or amend the published SOFR Index or SOFR data in its sole discretion and without notice. The Rate of Interest for any Interest Period will not be adjusted for any modifications or amendments to the SOFR Index or SOFR data that the Federal Reserve Bank of New York may publish after the Rate of Interest for that Interest Period has been determined.</span></p><p class=\"\"><span>If the Issuer determines that a Benchmark Transition Event and its related Benchmark Replacement Date have occurred in respect of the SOFR Index or SOFR itself, then the Rate of Interest on the Notes will no longer be determined by reference to the SOFR Index, but instead will be determined by reference to a different rate, plus a spread adjustment, which we refer to as a \"Benchmark Replacement,\" as further described in the Floating Rate Note Provisions.</span></p><p class=\"\"><span>If a particular Benchmark Replacement or Benchmark Replacement Adjustment cannot be determined, then the next-available Benchmark Replacement or Benchmark Replacement Adjustment will apply. These replacement rates and adjustments may be selected, recommended or formulated by (i) the Relevant Governmental Body (such as the ARRC), (ii) the International Swaps and Derivatives Association (\"ISDA\") or (iii) in certain circumstances, the Issuer itself. In addition, the terms of the Notes expressly authorize the Issuer to make Benchmark Replacement Conforming Changes with respect to, among other things, changes to the definition of \"Interest Period\", the timing and frequency of determining rates and making payments of interest and other administrative matters. The determination of a Benchmark Replacement, the calculation of the Rate of Interest on the Notes by reference to a Benchmark Replacement (including the application of a Benchmark Replacement Adjustment), any implementation of Benchmark Replacement Conforming Changes and any other determinations, decisions or elections that may be made under the terms of the Notes in connection with a Benchmark Transition Event, could adversely affect the value of the Notes, the return on the Notes and the price at which you can sell such Notes.</span></p><p class=\"\"><span>In addition, (i) the composition and characteristics of the Benchmark Replacement will not be the same as those of Compounded SOFR, the Benchmark Replacement may not be the economic equivalent of Compounded SOFR, there can be no assurance that the Benchmark Replacement will perform in the same way as Compounded SOFR would have at any time and there is no guarantee that the Benchmark Replacement will be a comparable substitute for Compounded SOFR (each of which means that a Benchmark Transition Event could adversely affect the value of the Notes, the return on the Notes and the price at which you can sell the Notes), (ii) any failure of the Benchmark Replacement to gain market acceptance could adversely affect the Notes, (iii) the Benchmark Replacement may have a very limited history and the future performance of the Benchmark Replacement may not be predicted based on historical performance, (iv) the secondary trading market for Notes linked to the Benchmark Replacement may be limited and (v) the administrator of the Benchmark Replacement may make changes that could change the value of the Benchmark Replacement or discontinue the Benchmark Replacement and has no obligation to consider your interests in doing so.</span></p><p class=\"\"><span>The Calculation Agent Will Make Determinations with respect to the Notes, and the Issuer May Exercise Subjective Discretion with respect to Compounded SOFR or Replacements Thereof.</span></p><p class=\"\"><span>The Calculation Agent will make certain determinations with respect to the Notes as further described under the Floating Rate Note Provisions, some of which determinations are in the Calculation Agent's sole discretion. Any determination, decision or election pursuant to the benchmark replacement provisions will be made by the Issuer. Any of these determinations may adversely affect the value of the Notes, the return on the Notes and the price at which you can sell such Notes. Moreover, certain determinations to be made by the Issuer may require the exercise of discretion and the making of subjective judgments, such as with respect to Compounded SOFR or the occurrence or non-occurrence of a Benchmark Transition Event and any Benchmark Replacement Conforming Changes. These potentially subjective determinations may adversely affect the value of the Notes, the return on the Notes and the price at which you can sell such Notes.</span></p><p class=\"\"><span>INTER-AMERICAN DEVELOPMENT BANK</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  IODUBSNRNBUUUAR</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7889Ua:0-reg-inter-american-dev-issue-of-debt/",
            "pub_date": "2026-02-28 00:50:40",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7892Ua:0",
            "title": "REG - Baillie Gifford Euro - Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7892U  Baillie Gifford European Growth Tst  27 February 2026   </span><p class=\"\"><span>Baillie Gifford European Growth Trust plc (BGEU)</span></p><p class=\"\"><span>Legal Entity Identifier: 213800QNN9EHZ4SC1R12</span></p><p class=\"\"><span>Purchase of Own Securities</span></p><p class=\"\"><span>On 27 February 2026, the Company announces the purchase of 140,000 Ordinary Shares at a price of 105.50p. The shares purchased will be held in Treasury.</span></p><p class=\"\"><span>Following the transaction there will be 103,338,323 shares held in Treasury.</span></p><p class=\"\"><span>The shares in issue less the total number of shares in Treasury are 299,105,367.</span></p><p class=\"\"><span>The above figure (299,105,367) may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the FCA's Disclosure Guidance and Transparency Rules.</span></p><p class=\"\"><span>Baillie Gifford &amp; Co Limited</span></p><p class=\"\"><span>Company Secretaries</span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Regulated Information Classification: Acquisition or disposal of the issuer's own shares</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  POSQDLFLQLLZBBK</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7892Ua:0-reg-baillie-gifford-euro-transaction-in-own-shares/",
            "pub_date": "2026-02-28 00:50:41",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0UZ:0",
            "title": "Gold nears one-month high, set for seventh straight monthly rise",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gold set for a monthly gain of more than 7%</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>China's January gold imports via Hong Kong rose 69% MoM</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US producer prices increase more than expected in January</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Silver, platinum, palladium also set for monthly rise</span></li></ul></span></div><span><p class=\"\"><span>By Anmol Choubey</span></p><p class=\"\"><span>    Gold rose to near a one-month high on Friday and was headed for a seventh straight month of gains, supported by geopolitical tensions after the United States and Iran extended nuclear talks, while softer U.S. Treasury yields further boosted bullion.</span></p><p class=\"\"><span>Spot gold </span><span> was up 1% at $5,238.75 an ounce by 11:31 a.m. ET (1631 GMT), hitting its highest level since January 30. Prices climbed 7.6% so far in February.</span></p><p class=\"\"><span>U.S. gold futures </span><span> for April delivery rose 1.1% to $5,254.</span></p><p class=\"\"><span>\"There's a lot of nervousness surrounding geopolitics, you have all the set-up for a high probability of a military operation over the weekend, so it's a risk-off in a flight to safety,\" said Phillip Streible, chief market strategist at Blue Line Futures.</span></p><p class=\"\"><span>The United States and Iran made progress in Thursday's nuclear talks, mediator Oman said, but hours of negotiations ended without a breakthrough that could avert possible U.S. strikes amid a major military buildup. </span></p><p class=\"\"><span>Meanwhile, the U.S. Embassy in Jerusalem also permitted non‑emergency staff and families to leave Israel citing safety risks.</span></p><p class=\"\"><span>U.S. 10‑year Treasury yields </span><span> slipped to a three-month low, making non-yielding gold more attractive by lowering its opportunity cost.</span></p><p class=\"\"><span>Gold's next likely upside target is $5,450, with key support near $5,120, Streible said. </span></p><p class=\"\"><span>Data showed that U.S. producer prices increased more than expected in January, suggesting inflation could pick up in the months ahead.</span></p><p class=\"\"><span>Markets are pricing in about a 42% chance of a 25‑basis‑point U.S. Federal Reserve rate cut in June, as per the CME FedWatch tool.</span></p><p class=\"\"><span>Elsewhere, top consumer China's net gold imports via Hong Kong in January rose by 68.7% from December, Hong Kong Census and Statistics Department data showed.</span></p><p class=\"\"><span>China's central bank moved to curb the yuan's rise by removing risk-reserve rules for forex forwards, encouraging more dollar buying.</span></p><p class=\"\"><span>Spot silver </span><span> rose 6% to $93.67 an ounce, on course for a 10.3% monthly gain.</span></p><p class=\"\"><span>Spot platinum </span><span> climbed 3.5% to $2,352.05 an ounce while palladium </span><span> was up 0.1% at $1,785.47. Both metals were headed for monthly gains.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0UZ:0-gold-nears-one-month-high-set-for-seventh-straight-monthly-rise/",
            "pub_date": "2026-02-28 00:43:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7878Ua:0",
            "title": "REG - Vulcan Two Group PLC - Posting of Admission Document",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7878U  Vulcan Two Group PLC  27 February 2026   </span><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>Vulcan Two Group plc</span></p><p class=\"\"><span>(the \"Company\" or \"Vulcan Two\")</span></p><p class=\"\"><span>Posting of Admission Document</span></p><p class=\"\"><span>Further to the Result of Placing announcement released today at 7.00 a.m., Vulcan Two Group plc, the company aiming to create the UK's leading regulated ePharmacy through buy-and-build, confirms that the Admission Document, containing further details on the Acquisitions and the Placing, will be posted to shareholders today. The Admission Document contains a Notice of General Meeting to be held at the offices of Canaccord Genuity Ltd, 88 Wood Street, London EC2V 7QR on 17 March 2026 at 10.00 a.m. (UK time).</span></p><p class=\"\"><span>The Board considers that each Acquisition and the Placing are in the best interests of the Company and its Shareholders and, accordingly, unanimously recommends that all Shareholders vote in favour of each of the Resolutions to be proposed at the General Meeting.  The Directors intend to vote in favour of the Resolutions in respect of their aggregate beneficial shareholdings, representing approximately 22.3 per cent. of the Existing Ordinary Share Capital.</span></p><p class=\"\"><span>A copy of the Admission Document and Form of Proxy are now available on the Company's website at www.vulcantwo.com. Other than where defined, capitalised terms used in this announcement have the meanings given to them in the announcement released by the Company at 4.54 p.m. on 26 February 2026.</span></p><p class=\"\"><span>For further information please contact:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Vulcan Two Group plc</span></p><p class=\"\"><span>Michael Kraftman, Chief Executive Officer</span></p><p class=\"\"><span>Brendan O'Brien, Chief Operating Officer</span></p><p class=\"\"><span>www.vulcantwo.com</span></p></td><td><p class=\"\"><span>Email: info@vulcantwo.com</span></p></td></tr><tr><td><p class=\"\"><span>Canaccord Genuity Limited</span></p><p class=\"\"><span>(Nominated Adviser, Sole Bookrunner and Sole Broker)</span></p><p class=\"\"><span>Simon Bridges / Harry Pardoe / Elizabeth Halley-Stott</span></p></td><td><p class=\"\"><span>Tel: +44 (0) 20 7523 8000</span></p></td></tr><tr><td><p class=\"\"><span>Alma Strategic Communications</span></p><p class=\"\"><span>(Financial PR)</span></p><p class=\"\"><span>Justine James / Sam Modlin / Will Merison</span></p></td><td><p class=\"\"><span>Email: vulcantwo@almastrategic.com</span></p><p class=\"\"><span>Tel: +44 (0) 20 3405 0205</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  MSCEAKAXALFKEFA</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7878Ua:0-reg-vulcan-two-group-plc-posting-of-admission-document/",
            "pub_date": "2026-02-28 00:43:48",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007646:0",
            "title": "Week Ahead for FX, Bonds: U.S. Jobs Data in Focus",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Dow Jones Newswires staff</span></p><p class=\"\"><span>Below are the most important global events likely to affect FX and bond markets in the week starting March 2.</span></p><p class=\"\"><span>U.S. jobs data will mark the highlight of the coming week as investors remain uncertain about when the Federal Reserve is next likely to cut interest rates.</span></p><p class=\"\"><span>In Europe, attention will center on eurozone inflation data and the spring statement by the U.K.'s treasury chief. In Asia, the Bank of Japan's policy outlook, Australia's growth figures and China's annual parliamentary sessions are in focus.</span></p><p class=\"\"><span>U.S.</span></p><p class=\"\"><span>U.S. jobs data are back in focus in the coming week, with monthly nonfarm payrolls data for February due on Friday.</span></p><p class=\"\"><span>Investors will be looking to see whether January's surprisingly strong payrolls numbers were a one-off. This comes amid uncertainty over whether the U.S. Federal Reserve will cut interest rates in the coming months, although analysts say it would likely take a particularly weak number to move the dial much on rate expectations.</span></p><p class=\"\"><span>\"Our view is that it would take quite a lot to get the Fed thinking about an imminent rate cut,\" ING economists said in a note.</span></p><p class=\"\"><span>U.S. money markets aren't pricing in a rate cut until July at the earliest, LSEG data show. ING doesn't expect another reduction until June.</span></p><p class=\"\"><span>Ahead of Friday's key data, ADP private payrolls figures for February will be released Wednesday, followed by weekly jobless claims Thursday.</span></p><p class=\"\"><span>The latest ISM surveys for February for manufacturing and services activity will be released on Monday and Wednesday, respectively. These will be keenly watched for indications of the overall performance of the U.S. economy, particularly amid uncertainty over U.S. tariff policy and tensions between the U.S. and Iran. U.S. January retail sales data are also released Friday.</span></p><p class=\"\"><span>Eurozone</span></p><p class=\"\"><span>The eurozone data calendar thins out after the usual end-of-month avalanche.</span></p><p class=\"\"><span>Spanish, Italian, French, German and eurozone manufacturing and services PMI data are due on Monday and Wednesday, respectively.</span></p><p class=\"\"><span>Italy will release yearly GDP data on Monday and flash estimate CPI data for February on Tuesday, when the same data is also scheduled from the eurozone as a whole.</span></p><p class=\"\"><span>Eurozone unemployment figures for January are scheduled for Wednesday and retail sales data for the same month on Thursday. Germany will publish manufacturing orders data for January on Friday.</span></p><p class=\"\"><span>Final fourth-quarter GDP and employment data from the eurozone are due on Friday.</span></p><p class=\"\"><span>\"For now, the economy still looks to be 'in a good place', albeit one that the European Central Bank thinks requires vigilance and agility,\" Investec analyst Sandra Horsfield says in a note.</span></p><p class=\"\"><span>The Netherlands will launch a new 10-year bond via a Dutch Direct Auction on Tuesday, aiming to issue between 6 billion euros and 7 billion euros. Germany will auction April 2031 bonds on Tuesday and a February 2033 green Bund on Wednesday. Spain and France will hold bond auctions on Thursday. Italy will issue a new series of retail-only BTP Valore, with subscriptions running between Monday and Friday.</span></p><p class=\"\"><span>U.K.</span></p><p class=\"\"><span>Focus in the U.K. will be on Tuesday's spring statement, a twice-yearly report on U.K. public finances which Treasury chief Rachel Reeves will present before lawmakers. This will be followed by an announcement on gilt issuance by the Debt Management Office.</span></p><p class=\"\"><span>Markets expect Reeves to announce an improved fiscal position, including solid fiscal headroom. Gilt investors also expect government debt issuance to fall in the fiscal year to April 2027. Analysts said this could help push yields on U.K. government bonds lower.</span></p><p class=\"\"><span>Economic data include final purchasing managers' data for February on manufacturing on Monday, then on services Wednesday. Data on consumer credit and mortgage lending for January are released on Monday, as well as the latest Nationwide house price index for February. The BRC's shop price index for February is released Tuesday.</span></p><p class=\"\"><span>Poland</span></p><p class=\"\"><span>Poland's central bank announces an interest-rate decision on Wednesday, where it could announce a 25 basis-point reduction in its key policy rate to 3.75%.</span></p><p class=\"\"><span>HSBC economists expect a rate cut due to evidence of declining inflation.</span></p><p class=\"\"><span>\"We continue to expect that during the March meeting the rate-setters will have a new inflation forecast that will show a downward revision to the Polish central bank's 2026 inflation forecast, to or even below the 2.5% target,\" they said in a note. This should be enough to warrant a rate cut, they said.</span></p><p class=\"\"><span>Japan</span></p><p class=\"\"><span>Investors will look for clues on the timing of the Bank of Japan's next rate increase in speeches by BOJ officials. Deputy Gov. Ryozo Himino will meet local leaders in Wakayama, Japan, on Monday. Governor Kazuo Ueda is scheduled to appear at the  \"FIN/SUM 2026\" event in Tokyo on Tuesday.</span></p><p class=\"\"><span>Japan's Ministry of Finance will auction about 2.6 trillion yen of 10-year government bonds on Tuesday and around 700 billion yen of 30-year bonds on Thursday. The 30-year sale may draw strong demand from pension funds and insurers seeking higher yields.</span></p><p class=\"\"><span>Auto sales figures for February are also scheduled for release on Monday.</span></p><p class=\"\"><span>Australia</span></p><p class=\"\"><span>Bond traders will focus on Australia's fourth-quarter 2025 growth data due Wednesday.</span></p><p class=\"\"><span>The economy is expected to have grown 2.1% in calendar 2025 while operating near full capacity, adding to inflation pressures.</span></p><p class=\"\"><span>The week will therefore be dominated once again by a discussion about a decade of weak productivity growth, excessive government spending and the potential for the Reserve Bank of Australia to raise interest rates in the coming months, perhaps as early as mid-March.</span></p><p class=\"\"><span>The release on Thursday of the household spending indicator for January will also be closely watched by the central bank, given that strong consumer spending will add to the case for higher interest rates.</span></p><p class=\"\"><span>RBA Governor Michele Bullock will deliver a speech on Tuesday. Bullock has been indicating that the central bank is closely monitoring data, including quarterly inflation numbers in late April that are likely to be critical in setting the scene for an interest rate increase in May.</span></p><p class=\"\"><span>For the RBA, the data will point to whether aggregate capacity constraints are more or less worrisome than before. January's household spending data should show consumer activity starting 2026 at a subdued pace, while house price data is likely to confirm another strong monthly increase.</span></p><p class=\"\"><span>China</span></p><p class=\"\"><span>China returns from the Lunar New Year holiday to a busy week of data and policy announcements, including the annual meetings of its top legislature and advisory body.</span></p><p class=\"\"><span>The National People's Congress, part of the \"Two Sessions,\" will open on Thursday. Beijing is expected to announce key economic targets for 2026, including GDP growth.</span></p><p class=\"\"><span>ING economists forecast the growth target will be lowered to \"above 4.5%\" from \"around 5.0%\" in recent years. Fiscal targets, including the deficit-to-GDP ratio and bond issuance, are also expected.</span></p><p class=\"\"><span>A reduced growth target would mark the first in four years. Citi economists said such a move would signal measured stimulus. They anticipate 1 trillion yuan in fiscal support, a possible 10-basis-point rate cut and a 50-basis-point reserve requirement ratio cut this year.</span></p><p class=\"\"><span>Further measures could focus on stabilizing the labor market, boosting household income and domestic demand as well as advancing AI adoption.</span></p><p class=\"\"><span>Official PMIs due Wednesday are likely to reflect disruption from February's extended holidays. ANZ economist Krystal Tan expects the manufacturing PMI to fall to 49.0 from 49.3, and the non-manufacturing PMI to edge down to 49.3 from 49.4. Small and midsize firms may show particular weakness, with tourism gains offset by softness in construction and finance.</span></p><p class=\"\"><span>Private PMIs compiled by RatingDog are also due Wednesday. Foreign-exchange reserves data will be released Saturday.</span></p><p class=\"\"><span>Asian PMIs</span></p><p class=\"\"><span>Monday brings February manufacturing PMIs for Taiwan, Japan, India, Vietnam and other economies.</span></p><p class=\"\"><span>Investors will look for signs that renewed U.S. tariff uncertainty has affected business sentiment, especially after The Supreme Court struck down Trump's global tariffs as illegal.</span></p><p class=\"\"><span>The ruling may offer temporary relief for some exporters, but trade policy remains uncertain. Momentum is likely to remain supported by a strong tech-led export cycle, which remains largely insulated from the tariff shifts, ANZ added.</span></p><p class=\"\"><span>Malaysia</span></p><p class=\"\"><span>Malaysia's central bank will announce its rate decision Thursday afternoon.</span></p><p class=\"\"><span>With inflation contained and labor-cost growth moderate, Citi expects Bank Negara to keep its policy rate unchanged at 2.75% through 2026. Policymakers are likely to favor a gradual appreciation of the ringgit to tighten monetary conditions.</span></p><p class=\"\"><span>South Korea</span></p><p class=\"\"><span>South Korea is expected to report solid February exports on Mar. 1, driven by robust semiconductor demand despite fewer working days in the month.</span></p><p class=\"\"><span>A Wall Street Journal poll of nine economists forecast exports rose 25.6% from a year earlier, after a revised 33.8% increase in January. Early February trade data suggest chip exports are on track for a monthly record. Imports likely rose 13.6%, resulting in a $10.10 billion trade surplus--wider than January's revised $8.72 billion surplus.</span></p><p class=\"\"><span>February inflation data are due Friday. Headline inflation is expected to remain near the central bank's 2% target after easing to a five-month low of 2.0% in January from 2.3% in December.</span></p><p class=\"\"><span>Indonesia</span></p><p class=\"\"><span>Indonesia will release January trade and February inflation data Monday afternoon.</span></p><p class=\"\"><span>Headline inflation likely rose in February due to base effects and stronger demand during Ramadan, Kenanga Investment Bank said.</span></p><p class=\"\"><span>January export growth may moderate as base effects fade after a temporary rise in late 2025, RHB said in a note. However, exports should maintain moderate growth over 2026, driven by ongoing efforts to diversify markets, RHB added.</span></p><p class=\"\"><span>Philippines, Thailand</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007646:0-week-ahead-for-fx-bonds-u-s-jobs-data-in-focus/",
            "pub_date": "2026-02-28 00:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2IC:0",
            "title": "4AIM SICAF FY Net Loss EUR 4.0 Mln",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>4Aim Societa di Investimento per Azioni a Capitale Fisso SpA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET LOSS EUR 4.0 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NAV SECTOR 1 AT DEC-END EUR 92,977</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2IC:0-4aim-sicaf-fy-net-loss-eur-4-0-mln/",
            "pub_date": "2026-02-28 00:44:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947374:0",
            "title": "RLJ Lodging Trust: Urban markets, renovations, and non-room revenue growth drove outperformance and strong 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Fourth quarter and full-year results exceeded expectations, driven by urban market strength, successful renovations, and robust non-room revenue growth. Guidance for 2026 anticipates modest RevPAR and EBITDA growth, with continued capital returns and a strong balance sheet.</span></p><p class=\"\"><span>Based on RLJ Lodging Trust Q4 2025 Audio Transcript — Feb. 27 2026</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947374:0-rlj-lodging-trust-urban-markets-renovations-and-non-room-revenue-growth-drove-outperformance-and-strong-2026-outlook/",
            "pub_date": "2026-02-28 00:44:38",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        }
    ]
}