{
    "data": [
        {
            "id": "DJN_DN20250205000114:0",
            "title": "USPS's Suspension of Chinese Packages Highlights Challenges Implementing New Tariff Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.S. Postal Services will likely need time to sort out how to implement new the tariff policy before resuming acceptance of Chinese packages, according to Chelsey Tam, senior equity analyst at Morningstar in an email. The process poses a significant challenge, given that in 2024, an estimated 4 million daily packages arrived in the U.S. under the de minimis rule, which allows low-value shipments to bypass duties and custom scrutiny, Tam says. The Trump administration revoked this exemption for China as part of broader tariff measures. Among Chinese e-commerce players, PDD Holdings will be hurt as its overseas e-commerce platform Temu has a significant exposure in the U.S., the analyst notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000114:0/",
            "pub_date": "2025-02-05 13:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW04N:0",
            "title": "China Lunar New Year holiday box office takings hit record high of $1.3 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's film market achieved a record high of 9.5 billion yuan  ($1.3 billion) in takings over the Lunar New Year period, 18.8% higher than the same period last year, as movie-goers flocked to cinemas to watch movies such as \"Nezha 2\". </p><p class=\"\">The box office figure, calculated by Reuters based on data from ticketing platform Maoyan , surpassed last year's record of 8.0 billion yuan for the same eight day period.</p><p class=\"\">A big draw has been \"Nezha 2\", a sequel to the 2019 animated hit that follows the adventures of the iconic Chinese mythological character Nezha. Box office tracker Beacon data showed that by 1.00 a.m. Wednesday (1500 GMT Tuesday), \"Nezha 2\" alone had grossed over 5 billion yuan. </p><p class=\"\">Some movie goers told Reuters that the show was so popular that they needed to buy tickets one or two days in advance. </p><p class=\"\">On Jan. 29, the first day of the Lunar New Year, the box office exceeded 1.8 billion yuan, with over 35 million cinema visits, setting a new single-day record. </p><p class=\"\">Trailing behind \"Nezha 2\" were all domestic films, including the comedy mystery \"Detective Chinatown 1900\", the epic fantasy \"Creation of the God II: Demon Force\", and the martial arts film \"Legends of the Condor Heroes: The Gallants\".</p><p class=\"\">($1 = 7.2832 Chinese yuan renminbi)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW04N:0-china-lunar-new-year-holiday-box-office-takings-hit-record-high-of-1-3-bln/",
            "pub_date": "2025-02-05 13:11:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446670:0",
            "title": "Singapore Retail Sales Fall at Faster Pace",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Retail sales in Singapore dropped by 2.9% year-on-year in December 2024, slipping further from a downwardly revised 0.5% fall in the previous month.</p><p class=\"\">This marked the second consecutive month of falling retail trade, as sales continued to decline for department stores (-4.5% vs -3.7% in November), mini-marts and convenience store (-9.3% vs -8.8%), wearing apparel and footwear (-6.7% vs -3.1%), and computer and telecommunications equipment (-13.1% vs -11%).</p><p class=\"\">Additionally, sales tumbled for furniture and household equipment (-4.8% vs 1.9%) and watches and jewelry (-6.2% vs 2.2%).</p><p class=\"\">Meanwhile, sales accelerated for food and alcohol (9.4% vs 4.6%) and motor vehicles (6% vs 5.2%).</p><p class=\"\">On a seasonally adjusted monthly basis, retail sales decreased 1.5% in December 2024, slowing from a 2.8% fall in the previous month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446670:0-singapore-retail-sales-fall-at-faster-pace/",
            "pub_date": "2025-02-05 13:11:41",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0IA:0",
            "title": "India's Asian Paints slides on flagging muted demand outlook in short-term",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Asian Paints  falls ~4% to 2,262 rupees; top loser on benchmark Nifty 50 , which is up 0.13%</p><p class=\"\">** Management flags muted urban demand in short-term; says will likely recover post Q1 FY26</p><p class=\"\">** At least 16 brokerages cut PT post results, nine slash ratings - LSEG</p><p class=\"\">** Investec says it continues to fear that new entrants can impair earnings for players like ASPN, with the impact likely exacerbating if demand remains challenged</p><p class=\"\">** CLSA retains \"cautious stance\", citing heightened competition that will keep growth and margins under pressure</p><p class=\"\">** Stock set to log biggest intraday pct decline since Nov. 11, 2024, post Q2 results on Nov. 9</p><p class=\"\">** ASPN last down ~1%, swings to YTD loss</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0IA:0-india-s-asian-paints-slides-on-flagging-muted-demand-outlook-in-short-term/",
            "pub_date": "2025-02-05 13:14:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000123:0",
            "title": "News Highlights: Top Financial Services News of the Day - Wednesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Its Direct Stakes in Three Companies</strong></p><p class=\"\">The firm said it would increase its investment in the companies by $1.1 billion in total as part of its unusual strategy of taking long-term stakes in businesses it likes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apollo Eyes 'Industrial Renaissance' After Investing Record $222 Billion Last Year</strong></p><p class=\"\">Apollo Global Management invested a firm record of $222 billion last year as the credit specialist sees increased opportunities to finance infrastructure developers in what it calls a \"global industrial renaissance.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Department Says DOGE's Access to Payment Data Is 'Read Only'</strong></p><p class=\"\">The letter comes after people tied to billionaire Elon Musk gained unusual access to the system.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial</strong></p><p class=\"\">Brookfield made a non-binding proposal of $2.88 a share, the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed's Daly Is in No Rush to Cut Interest Rates</strong></p><p class=\"\">The president of the Federal Reserve Bank of San Francisco said she sees a strong U.S. economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Launches New Fee Wars. What It Means for BlackRock, Schwab, Fidelity.</strong></p><p class=\"\">The drop in fees could save Vanguard investors $350 million in 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robinhood Hits the Brakes on Sports Event Contracts Following CFTC Request</strong></p><p class=\"\">Robinhood reversed course just a day after introducing events contracts that would have allowed investors to trade based on the outcome of the Super Bowl.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS Shares Slump on Stock Buyback Uncertainty</strong></p><p class=\"\">The company details plans to improve the profitability of its wealth management unit, with a focus on the U.S. market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CFTC Reorganizes Enforcement Division Into Two Task Forces</strong></p><p class=\"\">The derivatives market regulator is reorganizing its enforcement division in a move it said will end the practice of regulation by enforcement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robinhood Yanks Super Bowl Betting Contracts After Regulator's Pushback</strong></p><p class=\"\">The CFTC asked the brokerage to stop offering customer access to contracts, warning that they might be illegal blurring of financial markets and gambling.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000123:0-news-highlights-top-financial-services-news-of-the-day-wednesday-at-12-am-et/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000122:0",
            "title": "News Highlights: Top Energy News of the Day - Wednesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. benchmark oil prices end lower as China trade dispute fuels demand concerns</strong></p><p class=\"\">U.S. oil prices on Tuesday gave back most of their gains from a day earlier after the U.S. implemented an additional 10% tariff on Chinese imports and Beijing retaliated with measures of its own, raising concerns over the prospects for demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on natural gas and oil prices, OMV and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000122:0-news-highlights-top-energy-news-of-the-day-wednesday-at-12-am-et/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000127:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0313 GMT - Sime Darby's turnaround in its China motors operations and potential divestment of noncore assets could accelerate its goal of achieving an 11% ROE over the next five years, CIMB Securities says in a note. That is higher than its ROE of 7.2% in FY 2024. Analyst Mohd Shanaz Noor Azam says the Malaysian conglomerate could optimize working capital, streamline its portfolio and improve cost efficiencies to help it reach the target. Its industrial division is well-positioned to benefit from the global energy transition and steady demand for rental and after-sales services, contributing to long-term growth, he adds. The stock remains attractive, with projected dividend yields of 6.9% in 2025 and 7.3% in 2026. CIMB maintains a buy rating and a target price of MYR3.00 on Sime Darby. Shares are 1.8% higher at MYR2.22. (yingxian.wong@wsj.com)</p><p class=\"\">0259 GMT - Iron ore falls in the morning Asian session, dragged by concerns over the tariffs China announced Tuesday. China imposed a 15% tariff on imports of U.S. coking coal, ANZ Research analysts say in a research report. Chinese iron-ore markets will probably come under pressure amid worries about weaker export-driven demand, the analysts add. Coking coal along with iron ore are raw materials used in steel production. All of the iron-ore contracts on the Dalian Commodity Exchange are lower, with the May 2025 contract last quoted 1.2% down at CNY799.5 a ton. (ronnie.harui@wsj.com)</p><p class=\"\">0245 GMT - Palm oil prices rise in early Asian trading, supported by a bullish technical outlook, AmInvestment Bank says in a note. The bank suggests traders to consider long positions if prices adjust. Meanwhile, Malaysia's palm oil production is expected to remain weak due to heavy rainfall. January output is estimated to have declined 10% from the previous month to 1.34 million tons, marking a fifth consecutive decline, according to a Bloomberg survey. Inventories may have dropped 2.9% to 1.66 million tons, while exports likely slumped 14.2% to 1.15 million tons, the survey shows. The Malaysian Palm Oil Board will release official data on Monday. AmInvestment Bank pegs CPO support at 4,251 ringgit/ton and resistance at 4,453 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 23 ringgit higher at 4,331 ringgit/ton. (yingxian.wong@wsj.com)</p><p class=\"\">0202 GMT - The Malaysian government's proposal for lower pension fund contributions for foreign workers appears positive for the plantation sector, RHB IB analyst Hoe Lee Leng and team say in a note. The government recently proposed a fixed 2% mandatory employees provident fund contribution, down from the initial 12% proposed last year, though the implementation date has yet to be set, they note. This should be a relief for planters, especially following the higher minimum wage policy introduced in February, they say. While these moves may have a slight negative impact on earnings amid higher costs, it is expected to be minimal, they add. RHB maintains an overweight rating on the Southeast Asian plantation sector, pegging Johor Plantations, Sarawak Oil Palms, Bumitama Agri, London Sumatra Indonesia and SD Guthrie as top picks. (yingxian.wong@wsj.com)</p><p class=\"\">0123 GMT - Base metals are broadly higher in early Asian trade. The three-month LME copper contract is up 0.5% at $9,193.00/ton, nickel is up 0.7% and zinc is 0.3% higher. China on Tuesday announced export restrictions on metals for various industries in retaliation to U.S. tariffs, but the list didn't include base metals, which supports the positive sentiment, Daria Efanova, head of research at Sucden Financial writes in a note. Given the moderate tariff increases from China and the U.S., markets are weighing the potential impact on both economies, which may be minimal provided that the situation doesn't escalate further, Efanova adds. (kimberley.kao@wsj.com)</p><p class=\"\">0047 GMT - Gold edges higher in early Asian trade. Demand for haven assets like gold, which is testing record highs, is being boosted by uncertainty in a challenging global economic environment dominated by trade and tariff tensions between the U.S. and multiple nations, Quasar Elizundia, research strategist at Pepperstone, says in a note. U.S. job openings at the end of 2024 unexpectedly resumed their downward trend, which raises questions about the labor market's strength and its ability to withstand global economic risks, raising uncertainty for investors, Elizundia adds. Spot gold is 0.2% higher at $2,846.13/oz, and has gained 8.5% so far this year. (kimberley.kao@wsj.com)</p><p class=\"\">0012 GMT - Mondelez's CEO said the broader snacking category is not diminishing due to consumers' focus on health and wellness. There hasn't been any noticeable decrease in snacking consumption due to GLP-1 medications, either, Dirk Van de Put said. \"Since COVID, the indulgence part of snacking is growing just as fast as the healthy part,\" he said. The snack giant reported a profit of $1.75 billion for the fourth quarter, compared with $950 million a year earlier. (roshan.fernandez@wsj.com)</p><p class=\"\">2328 GMT - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2111 GMT - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">2056 GMT - Mondelez International said it expects adjusted earnings per share to decline about 10% in 2025 due to cocoa cost inflation. The Chicago-based food and snack company produces Oreo, Toblerone and Cadbury chocolate, among other cocoa-based products. High cocoa prices have forced the snack giant to raise some prices in recent quarters. \"Our teams are well-equipped to stay agile and take the necessary actions to navigate this challenging operating environment,\" CEO Dirk Van de Put said. Shares fall 4.5% after hours. (roshan.fernandez@wsj.com)</p><p class=\"\">2003 GMT - The retreat of live cattle futures from an all-time high close of $2.07 a pound continues, with cattle futures dropping under the $2 a pound mark for the first time in two weeks. The most-active contract closes down 0.7% to $1.99 a pound, making it roughly 4% cattle has lost since Jan. 28. Hog futures, meanwhile, attempted to make up for yesterday's limit-down close with a 3.9% uptick in the most-active contract, up to 89.975 cents a pound. \"Lean hog futures have been in turmoil over the last few days due to the potential for tariffs on hogs and pork moving across borders,\" says Steiner Consulting Group in a note. (kirk.maltais@wsj.com)</p><p class=\"\">1917 GMT - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000127:0/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000124:0",
            "title": "EMEA Morning Briefing: Earnings in Focus as Tariff Concerns Linger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Watch For:</p><p class=\"\">EU PPI; Services PMI data from EU, U.K., France, Germany, Italy; France Industrial production index; trading updates from Credit Agricole, GSK, Banco Santander, Novo Nordisk, TotalEnergies, Pandora, Assa Abloy, Equinor, DCC</p><p class=\"\">Opening Call:</p><p class=\"\">European and U.S. stock futures were tracking lower on cautious sentiment; Asian equities trimmed their gains after mainland Chinese shares resumed trading after the Lunar New Year holiday; The dollar fell; Treasury yields were mixed; while oil fell and gold futures gained.</p><p class=\"\">Equities:</p><p class=\"\">Stock futures were lower early Wednesday as tariff jitters linger and corporate earnings roll on.</p><p class=\"\">U.S. stocks rebounded on Tuesday despite the escalating new trade war between the U.S. and China. A U.S. official said that Trump and Xi could speak on Wednesday.</p><p class=\"\">Trump has called the China tariffs \"an opening salvo\" and indicated that the U.S. will levy substantial tariffs against China if the countries can't come to an agreement.</p><p class=\"\">Earlier Wednesday, the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong, cutting off a service that is popular with online vendors in China.</p><p class=\"\">Goldman Sachs analysts said that China's retaliatory tariffs appear much less than proportional compared with the U.S.'s 10% across-the-board additional tariff on $525 billion worth of Chinese goods. In the coming days, the U.S.'s reactions to China's retaliation will be among the key events to watch.</p><p class=\"\">Forex:</p><p class=\"\">The euro has limited scope to recover even as hopes rise that the EU can avert threatened U.S. trade tariffs after President Trump postponed a levy on Canadian and Mexican imports, ING's Francesco Pesole said.</p><p class=\"\">Trump's decision to delay tariffs on his U.S. neighbors could reflect domestic backlash over potential economic pain for U.S. consumers but the same isn't necessarily true for the EU, he said.</p><p class=\"\">Trump can afford to keep EU tariffs in place for a prolonged period, making the bloc feel some pain before striking a deal. \"With all this in mind, we are somewhat skeptical that the euro is bound for a major rally.\"</p><p class=\"\">Bonds:</p><p class=\"\">Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux said.</p><p class=\"\">ING expects the supply of euro-denominated covered bonds to drop by 7 billion euros, equivalent to $7.24 billion, this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she said.</p><p class=\"\">Energy:</p><p class=\"\">Oil prices were lower after the U.S. implemented an additional 10% tariff on Chinese imports and Beijing retaliated with measures of its own, raising concerns over the prospects for demand.</p><p class=\"\">Near-term prices for global crude oil could remain capped due to supply risks and potential trade challenges, said Hassan Fawaz, GivTrade's chairman and founder.</p><p class=\"\">Trade tensions between the U.S. and China may also affect demand levels, he said, adding that caution could dominate, leading to pressure on oil prices.</p><p class=\"\">Oil traders have also been concerned about plans by OPEC+, to boost production after the first quarter.</p><p class=\"\">Metals:</p><p class=\"\">Gold edged higher early Wednesday. Demand for haven assets like gold, which is testing record highs, was being boosted by uncertainty in a challenging global economic environment dominated by trade and tariff tensions between the U.S. and multiple nations, Pepperstone said.</p><p class=\"\">U.S. job openings at the end of 2024 unexpectedly resumed their downward trend, which raises questions about the labor market's strength and its ability to withstand global economic risks, raising uncertainty for investors, it added.</p><p class=\"\">--</p><p class=\"\">Base metals were broadly higher in Asia. China on Tuesday announced export restrictions on metals for various industries in retaliation to U.S. tariffs, but the list didn't include base metals, which supports the positive sentiment, Sucden Financial said.</p><p class=\"\">Given the moderate tariff increases from China and the U.S., markets are weighing the potential impact on both economies, which may be minimal provided that the situation doesn't escalate further, it added.</p><p class=\"\">--</p><p class=\"\">Iron ore declined, dragged by concerns over the tariffs China announced Tuesday. China imposed a 15% tariff on imports of U.S. coking coal, ANZ Research analysts said.</p><p class=\"\">Chinese iron-ore markets will probably come under pressure amid worries about weaker export-driven demand, the analysts added.</p><p class=\"\">TODAY'S TOP HEADLINES</p><p class=\"\">Fed's Daly Is in No Rush to Cut Interest Rates</p><p class=\"\">The Federal Reserve's Mary Daly is in no rush to lower interest rates until inflation is closing in on the central bank's 2% target.</p><p class=\"\">A solid economic backdrop gives the Fed the luxury of time to hold policy where it is until disinflation progress resumes, the San Francisco Fed President said on Tuesday. \"[The economy] came into 2025 in a very good place,\" Daly said at an event hosted by the Commonwealth Club World Affairs of California.</p><p class=\"\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</p><p class=\"\">A solid economy and still-too-high inflation argue for holding interest rates steady until more progress is made in slowing price growth, Federal Reserve Vice Chair Philip Jefferson said on Tuesday evening, echoing recent remarks from several of his colleagues on the Federal Open Market Committee.</p><p class=\"\">\"As long as the economy and labor market remain strong, I see it as appropriate for the Committee to be cautious in making further adjustments,\" Jefferson said in prepared remarks for an address at Lafayette College in Easton, Pa., on Tuesday evening. \"Over the medium term, I continue to see a gradual reduction in the level of monetary policy restraint placed on the economy as we move toward a more neutral stance as the most likely outcome.\"</p><p class=\"\">Novo Nordisk Earnings Must Show GLP-1 Market Still Set for Big Growth</p><p class=\"\">When Danish drugmaker Novo Nordisk reports its quarterly financial results on Wednesday, investors will be looking for reassurance the GLP-1 market is still on track for the enormous growth Wall Street expects.</p><p class=\"\">Novo shares have taken a beating in recent months, with the stock's American depositary receipts falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales of its weight loss drug Wegovy and its Type 2 diabetes drug Ozempic wouldn't live up to the hype, and then on very disappointing trial data.</p><p class=\"\">Trump Says U.S. Will Take Over Gaza</p><p class=\"\">WASHINGTON-President Trump called for the U.S. to take long-term control of Gaza and for nearly two million Palestinian residents to permanently leave for neighboring countries, a break with decades of U.S. policy that left the idea of a Palestinian state in tatters.</p><p class=\"\">\"The U.S. will take over the Gaza Strip,\" Trump said during a press conference alongside Israeli Prime Minister Benjamin Netanyahu at the White House. \"I do see a long-term ownership position, and I see it bringing great stability to that part of the Middle East, and maybe the entire Middle East.\"</p><p class=\"\">Ukraine Open to Trump's Idea to Exchange Aid for Rare Earths-But There's a Catch</p><p class=\"\">President Trump has indicated he is open to supplying Ukraine with more weapons in exchange for access to the country's mineral resources. Ukraine is on board, but putting the plan into practice might not be so easy: Many of the minerals of greatest interest to the U.S. are in areas under Russian occupation or threatened by Moscow's advance.</p><p class=\"\">As a result, access to valuable Ukrainian natural resources will depend, at least in part, on the battle for eastern Ukraine, where Russian forces are currently advancing slowly but steadily.</p><p class=\"\">Nissan to Reject Honda's Merger Terms, Putting Deal in Peril</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">Write to singaporeeditors@dowjones.com</p><p class=\"\">Expected Major Events for Wednesday</p><p class=\"\">07:00/DEN: 4Q Consumer credit</p><p class=\"\">07:45/FRA: Dec Industrial production index</p><p class=\"\">08:00/CZE: Dec Retail trade</p><p class=\"\">08:15/SPN: Jan Spain Services PMI</p><p class=\"\">08:30/EU: Jan EuroCOIN indicator of euro area economic activity</p><p class=\"\">08:45/ITA: Jan Italy Services PMI</p><p class=\"\">08:50/FRA: Jan France Services PMI</p><p class=\"\">08:55/GER: Jan Germany Services PMI</p><p class=\"\">09:00/EU: Jan Eurozone Services PMI</p><p class=\"\">09:00/UK: Jan UK monthly car registrations figures</p><p class=\"\">09:00/ITA: Dec Retail Sales</p><p class=\"\">09:30/UK: Jan S&amp;P Global UK Services PMI</p><p class=\"\">09:30/UK: Jan UK Official Reserves</p><p class=\"\">09:30/UK: Jan Narrow money (Notes &amp; Coin) and reserve balances</p><p class=\"\">10:00/EU: Dec PPI</p><p class=\"\">10:00/CYP: Jan Registered Unemployed</p><p class=\"\">10:00/LUX: Jan CPI</p><p class=\"\">11:00/FRA: Dec OECD CPI</p><p class=\"\">11:00/POR: 4Q Employment statistics</p><p class=\"\">16:59/POL: Polish interest rate decision</p><p class=\"\">All times in GMT. Powered by Onclusive and Dow Jones.</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000124:0-emea-morning-briefing-earnings-in-focus-as-tariff-concerns-linger/",
            "pub_date": "2025-02-05 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0AF:0",
            "title": "First Guaranty Bancshares Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc  reported quarterly adjusted earnings of 3 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 6 cents.  The lone analyst forecast for the quarter was for a loss of 80 cents per share. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 7.3% to $22.58 million from a year ago; analysts expected $23.01 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc's reported EPS for the quarter was 3 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $428 thousand.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Guaranty Bancshares Inc shares had fallen by 8.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 600% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the banks peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for First Guaranty Bancshares Inc is $12.75 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 05:05 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">-0.80</p></td><td><p class=\"\">0.03</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.01</p></td><td><p class=\"\">0.11</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.20</p></td><td><p class=\"\">0.53</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.10</p></td><td><p class=\"\">0.14</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0AF:0-first-guaranty-bancshares-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 13:06:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463713:0",
            "title": "UAE's Response Plus Unit Opens Norway Office",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Prometheus Medical International, a company of Response Plus (ADX:RPM) subsidiary Response Plus Medical Services, opened an office at Skullerud Park in Oslo, Norway. </p><p class=\"\">The company will offer emergency medical training and risk reduction consultancy for the defense, healthcare, energy, and engineering sectors at the new location to support its Nordic expansion plans, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463713:0/",
            "pub_date": "2025-02-05 13:06:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463718:0",
            "title": "Yuyue Medical Equipment Unit Registers Glucose Monitoring System in China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jiangsu Yuyue Medical Equipment &amp; Supply  subsidiary Jiangsu Yuyue Kailit Biotechnology obtained medical device registration for its continuous glucose monitoring system. </p><p class=\"\">The registration was issued by China's food and drug administrator and is valid until Jan. 23, 2030, according to a Wednesday filing with the Shenzhen bourse.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463718:0/",
            "pub_date": "2025-02-05 13:06:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446668:0",
            "title": "India Composite PMI Revised Slightly Lower",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HSBC India Composite PMI stood at 57.7 in January 2025, below the flash reading of 57.9 and December's figure of 59.2.</p><p class=\"\">It was the lowest print in 14 months despite marking the 42nd month of increase in private sector activity and staying above its long-run average of 54.7.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446668:0-india-composite-pmi-revised-slightly-lower/",
            "pub_date": "2025-02-05 13:07:24",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463711:0",
            "title": "Solstice Minerals Acquires Western Australia Copper-Gold Project From Cyprium Metals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Solstice Minerals  will acquire 100% of the Nanadie copper-gold project in Western Australia from Cyprium Metals , according to a Wednesday Australian bourse filing. </p><p class=\"\">Under a sale and purchase agreement signed between the two firms, Solstice will pay Cyprium AU$1 million in immediately available funds as well as 3 million fully-paid shares in the firm on the completion of the acquisition. </p><p class=\"\">It will also pay 3 million more shares if it announces within four years after the completion of the deal that the project contains more than 250,000 tonnes of contained copper applying a cut-off grade of not less than 0.2% grade of copper. </p><p class=\"\">The deal is subject to customary conditions precedent, including required regulatory approvals and delivery of unencumbered title. </p><p class=\"\">The project is underpinned by an inferred mineral resource estimate of 40.4 million tonnes at 0.4% grade of copper and 0.1 grams-per-tonne grade of gold for 162,000 tonnes of contained copper and 130,000 ounces of gold, the filing said. </p><p class=\"\">Solstice Minerals' shares rose over 3% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463711:0/",
            "pub_date": "2025-02-05 13:07:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463715:0",
            "title": "Market Chatter: KKR, Gaw in Talks to Sell Tokyo's Hyatt Regency for Over 100 Billion Yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KKR &amp; Co. and Gaw Capital Partners are in talks to sell the Hyatt Regency Tokyo to Japan Hotel REIT Investment  for over 100 billion yen, Bloomberg News reported Monday, citing people familiar with the matter. </p><p class=\"\">The firms bought the 712-room Shinjuku hotel for about 60 billion yen in early 2023 from Odakyu Electric Railway  and are renovating it in phases. </p><p class=\"\">CBRE and SMBC Trust Bank  are advising on the deal, which could close early this year, though talks continue, the report said. </p><p class=\"\">Japan Hotel REIT, which owns 51 hotels, is capitalizing on strong demand as record tourism and a weak yen push average hotel rates up more than 40% from 2019, according to the report which cited CoStar data. </p><p class=\"\">Japan Hotel REIT has recently released a statement refuting the report, saying it is not discussions to acquire the property. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463715:0/",
            "pub_date": "2025-02-05 13:08:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0EP:0",
            "title": "Thailand to roll out next phase of handout scheme in Q2, plans more stimulus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Thailand's government will implement the third phase of its 450 billion baht ($13.4 billion) stimulus scheme in the second quarter of 2025, and will also discuss more measures later this month, a deputy finance minister said on Wednesday.</p><p class=\"\">The \"digital wallet\" handout scheme and other government measures will help spur the economy this year, Julapun Amornvivat told reporters.</p><p class=\"\">The digital wallet scheme provides 10,000 baht ($300) each to an estimated 45 million people to spend in their localities within six months. So far about 17.5 million people have received payments since it started last September. </p><p class=\"\">The third phase of the handout, which Julapun has previously said would start in April, will be discussed along with other economic measures at a meeting chaired by the prime minister, he said.</p><p class=\"\">\"The first two phases of the scheme have stimulated the economy well,\" Julapun said.</p><p class=\"\">Bank of Thailand Governor Sethaput Suthiwartnarueput told Reuters last week that the impact of the handouts and other stimulus was less than expected and that growth this year could miss the central bank's forecast of 2.9%.</p><p class=\"\">The finance ministry has predicted growth of 3% for 2025.          </p><p class=\"\">($1 = 33.72 baht)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0EP:0-thailand-to-roll-out-next-phase-of-handout-scheme-in-q2-plans-more-stimulus/",
            "pub_date": "2025-02-05 13:09:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463716:0",
            "title": "Argent Minerals Confirms High-Grade Silver Mineralization at Kempfield NW Prospect in New South Wales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Argent Minerals  confirmed the presence of high-grade silver at Kempfield NW Prospect within the Kempfield project in New South Wales, where it completed a 22-hole reverse-circulation drilling campaign, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The company intersected \"shallow, broad thick zones\" of silver-gold-copper-lead-zinc mineralization up to 34 meters of high-grade volcanogenic massive sulphide-style mineralization zone from surface, per the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463716:0/",
            "pub_date": "2025-02-05 13:09:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446669:0",
            "title": "India Services PMI Revised Downward",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The HSBC India Services PMI was revised lower to 56.5 in January 2025, down from 56.8 in the preliminary estimates and declining from the highest reading in four months in December of 59.3.</p><p class=\"\">Still, the latest figure marked the 42nd consecutive month of growth in services activity and the softest pace since November 2022, as new business rose the least since November 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446669:0-india-services-pmi-revised-downward/",
            "pub_date": "2025-02-05 13:10:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1DP:0",
            "title": "Agility Global Issues Corporate Guarantees To Some Of Existing Hedging Banks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AGILITY GLOBAL :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ISSUES CORPORATE GUARANTEES TO SOME OF EXISTING  HEDGING BANKS FOR EUR 75.6 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GUARANTEES PART OF CO EFFORTS IN MANAGING DSV AS, EXISTING HEDGES OVE SOME OF DSV SHARES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1DP:0-agility-global-issues-corporate-guarantees-to-some-of-existing-hedging-banks/",
            "pub_date": "2025-02-05 13:10:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656:0",
            "title": "Toyota Raises Earnings Guidance After Profit Jumps",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(04:30 GMT) </strong>*Toyota Maintains FY Group Vehicle-Sales Forecast at 10.85M Units<br/><strong class=\"root-Tkn6WL2y\">(04:32 GMT) </strong>*Toyota Raises Revenue, Net-Profit Views for FY Ending March<br/><strong class=\"root-Tkn6WL2y\">(04:35 GMT) </strong>*Toyota: To Set Up EV Battery Subsidiary in China<br/><strong class=\"root-Tkn6WL2y\">(04:53 GMT) </strong>*Toyota Shares Extend Gains, Now Up 1.9% After 3Q Results<br/><strong class=\"root-Tkn6WL2y\">(05:00 GMT) </strong>*Toyota: China Unit to Develop Lexus-Branded Battery EV, Start Production in 2027 or Later<br/><strong class=\"root-Tkn6WL2y\">(05:01 GMT) </strong>Toyota Raises Earnings Guidance After Profit Jumps</p><p class=\"\">By Kosaku Narioka</p><p class=\"\">Toyota Motor raised its annual earnings guidance after reporting a jump in third-quarter net profit on higher revenue.</p><p class=\"\">The Japanese carmaker said Wednesday that net profit climbed 62% from a year earlier to 2.193 trillion yen, equivalent to $14.21 billion, for the three months ended Dec. 31. That beat the estimate of Y1.175 trillion in a poll of analysts by data provider Quick.</p><p class=\"\">Third-quarter revenue rose 2.9% to Y12.391 trillion.</p><p class=\"\">For the fiscal year ending March, Toyota now expects net profit to decline 8.6% to Y4.520 trillion and revenue to increase 4.2% to Y47.000 trillion. It previously expected Y3.570 trillion in net profit and Y46.000 trillion in revenue. The company left its fiscal-year group vehicle-sales forecast unchanged at 10.85 million vehicles.</p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\">The company has benefited from a shift among consumers in the U.S. and some other markets to hybrid cars from fully electric vehicles, though it struggled in China, the world's largest auto market, like many other foreign carmakers.</p><p class=\"\">To sell cars in the U.S., Japanese automakers like Toyota not only produce them at U.S. plants or import from Japan, but they also make them in Mexico and import to the U.S.</p><p class=\"\">The U.S. announced new tariffs against Mexico and Canada on Saturday before striking last-minute deals to delay them on Monday.</p><p class=\"\">Japanese auto stocks fell after the announcement of U.S. tariffs raised concerns about their U.S. sales of cars made in the North American trading partners and a further escalation in trade conflicts.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656:0/",
            "pub_date": "2025-02-05 13:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463707:0",
            "title": "Fajarbaru Builder Unit, Avionics Win Delivery Phase Deal for Butterworth Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fajarbaru Builder Group ((KLSE: FAJAR) unit FBG Builder and Avionics won the delivery phase contract for the Butterworth Infrastructure Project at RMAF Base Butterworth. </p><p class=\"\">The award is part of the Head Contract (International) Two-Phase from the Australian Department of Defence, the company said in a Tuesday Malaysian bourse filing. </p><p class=\"\">The project involves the design and construction of infrastructure at the Penang base, it said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463707:0/",
            "pub_date": "2025-02-05 13:01:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205000059_20250205000059:0",
            "title": "Toyota: China Unit's Production Capacity Expected at 100,000 Vehicles Annually",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205000059_20250205000059:0/",
            "pub_date": "2025-02-05 13:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463703:0",
            "title": "RSR Singular Assets Europe Buys Building in Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RSR Singular Assets Europe SOCIMI (MLRSR.LS) in January purchased a 3,371-square-meter building in Madrid, Spain, acording to a Tuesday release published Wednesday. </p><p class=\"\">The real estate investment vehicle earmarked 24 million euros for the purchase and renovation of the property. </p><p class=\"\">Following its latest purchase, RSR Singular's portfolio comprised five hotels, two tourist apartment buildings, an office building and a residential building.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463703:0/",
            "pub_date": "2025-02-05 13:02:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSS:0",
            "title": "Growth in India services sector slows to more than 2-year low in Jan, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Growth in India's dominant services sector was the slowest in over two years in January amid cooling demand but remained historically strong and led to a substantial rate of hiring, a business survey showed on Wednesday.</p><p class=\"\">Asia's third-largest economy has been struggling with slackening consumption. To try and boost spending the government gave some tax relief to the middle class at its annual budget on Feb. 1 but shied away from announcing big reforms which are much needed to prop up growth.</p><p class=\"\">The HSBC final India Services Purchasing Managers' Index (INPMIS=ECI), compiled by S&amp;P Global, fell to 56.5 in January from 59.3 in December, a tad lower than a preliminary estimate of 56.8 but comfortably ahead of the 50-mark separating contraction from growth.</p><p class=\"\">\"The business activity and new business PMI indices eased to their lowest levels since November 2022 and November 2023 respectively,\" said Pranjul Bhandari, chief India economist at HSBC.</p><p class=\"\">\"That said, new export business partly countered the downtrend and continued to rebound from a dip in late-2024, in line with official data.\"</p><p class=\"\">Demand for services rose at the slowest pace in 14 months but remained sturdy. It was supported by international demand that was the strongest in five months.</p><p class=\"\">The future activity sub-index moderated to a three-month low but the fall was insignificant and firms hired new staff at one of the fastest paces since the inception of the survey in December 2005.</p><p class=\"\">Inflationary pressures picked up, as both input costs and prices charged rose at a strong pace.</p><p class=\"\">But India's retail inflation\teased to a four-month low in December, increasing the chances of easier monetary policy. The Reserve Bank of India is widely expected to cut its key repo rate on Feb. 7, a Reuters poll taken last week showed.</p><p class=\"\">Slower services growth overshadowed a six-month high pace of expansion in the manufacturing sector (INPMI=ECI) and dragged the overall Composite PMI down to 57.7 last month from 59.2 in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSS:0-growth-in-india-services-sector-slows-to-more-than-2-year-low-in-jan-pmi-shows/",
            "pub_date": "2025-02-05 13:02:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463684:0",
            "title": "S&P: UAE Non-oil Private Sector Expansion Continues in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Arab Emirates' non-oil private sector growth continued in January, but capacity pressures remained a major challenge amid backlog volumes. </p><p class=\"\">The S&amp;P Global UAE PMI for the month was 55, down from 55.4 in December 2024, S&amp;P Global said Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463684:0/",
            "pub_date": "2025-02-05 13:02:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463708:0",
            "title": "Grieg Seafood Names Successor to Outgoing CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Grieg Seafood  appointed Magnus Johannesen as its new chief financial officer, effective Wednesday, according to a same-day release. </p><p class=\"\">Johannesen will succeed Atle Harald Sandtorv, who decided to step down, the Norwegian salmon farmer said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463708:0/",
            "pub_date": "2025-02-05 13:02:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463704:0",
            "title": "Kingkey Financial Expands Services with AI Computing Power Following SIAM AI Developments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kingkey Financial International (Holdings)  said it can now provide computing power to its clients following certain developments with SIAM AI, a Wednesday Hong Kong bourse filing said. </p><p class=\"\">In December 2024, the company, SIAM AI, and certain other parties decided to establish a joint venture aimed at using AI and advanced algorithms for new business areas such as AI finance, green finance, and AI tagging infrastructure. </p><p class=\"\">The company seeks to improve the green financial investments for its clients through the new venture.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463704:0/",
            "pub_date": "2025-02-05 13:03:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463710:0",
            "title": "Fat Prophets Global Property Fund Says Responsible Entity to Close Buyback",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fat Prophets Global Property Fund  said Wednesday that One Managed Investment Funds, its responsible entity, has determined that it is appropriate to close the on-market buyback as its portfolio will be liquidated, according to an Australian bourse filing. </p><p class=\"\">The fund's shares were up almost 2% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463710:0/",
            "pub_date": "2025-02-05 13:03:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463709:0",
            "title": "Fitch Keeps Vanquis Banking on Rating Watch Negative",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fitch said Tuesday that it is keeping Vanquis Banking Group's  BB- long-term issuer default and senior unsecured debt ratings on rating watch negative. </p><p class=\"\">The rating agency said it is concerned that a looming Supreme Court decision on a case against three vehicle finance lenders in the UK could negatively impact the banking company's business profile, profitability, and capitalization. Fitch said an unfavorable decision could result in a downgrade of the company's IDR.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463709:0/",
            "pub_date": "2025-02-05 13:04:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr22Jcjb:0",
            "title": "Embla Medical hf: 2024 Annual Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Embla Medical hf.<p class=\"\"><em>Announcement no. 2/2025</em></p><p class=\"\"><em>5 February 2025</em></p><p class=\"\">Today Embla Medical publishes its 2024 Annual Report.</p><p class=\"\">The full report including Remuneration and Governance Reports can be downloaded from our website https://www.emblamedical.com/annual-report</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LETTER FROM THE CEO</strong></p><p class=\"\">As we look back on a successful 2024, what stands out most is delivering on our relentless commitment to improving people‘s mobility. Our innovative product solutions and patient care have a positive impact on millions of lives around the world.</p><p class=\"\">The year was marked by several milestones, most notably the establishment of Embla Medical, beginning to unite our patient care business under the ForMotion brand, and the acquisition of Fior &amp; Gentz, to name a few.</p><p class=\"\">Additionally, positive market trends such as the expanded US Medicare coverage for advanced bionic prosthetics for less mobile K2 amputees, brings potential for improved quality of life for a large patient population.</p><p class=\"\">We continue to execute well on our Growth’27 strategy delivering solid sales in line with our long-term financial ambition. For 2024, we delivered 6% organic growth driven by a strong performance in Prosthetics &amp; Neuro Orthotics and Patient Care, while growth in local currency was 9% supported by positive impact from the acquisition of Fior &amp; Gentz. Our EBITDA margin also came in strong for the year at 20% reflecting operational efficiency and effective cost control.</p><p class=\"\">In the beginning of 2024, we acquired Fior &amp; Gentz, a leading maker of transformative and innovative lower limb neuro orthotic devices for people living with neurological conditions. The acquisition is an important milestone in our growth journey, marking our expansion into the field of Neuro Orthotics. An exciting field which broadens our ability to support individuals with chronic mobility challenges. We are very pleased to see the integration progressing according to plan as we transfer product distribution to our commercial distribution network and existing O&amp;P clinics in mature, reimbursed markets.</p><p class=\"\">I am also thrilled with our progress within R&amp;D, as we launched several exciting innovations during the year. These include two new bionic knees – Icon®, a new user-friendly and versatile knee solution, and Navii®, our next generation Rheo Knee®, which comes in a fully waterproof version featuring a powerful actuator. Beyond these new knee solutions, we also launched the Pro-Flex® Terra foot, which offers increased flexibility, balance and adaptability for low-active patients. I am very proud of our ability to innovate, while addressing real patient needs.</p><p class=\"\">2024 was also the year we introduced a new unified brand identity, ForMotion, for our patient care facilities. The goal of ForMotion is to bring our network of O&amp;P clinics under a single cohesive brand. This transition will be implemented in phases, eventually encompassing our entire global network of O&amp;P patient care facilities, which currently operate under different brand names. This unified network will deliver comprehensive, modern, and innovative care while honoring the expertise and heritage unique to each location.</p><p class=\"\">Another highlight was the 2024 Paralympic Games, where a global team of elite para-athletes using Össur’s renowned prosthetics won 22 medals and set five new Paralympic records. The Paris Paralympics established new benchmarks for excellence, inclusivity, and audience engagement. Every competitor rose to the occasion, and I was fortunate to personally meet many of our inspiring athletes, who truly embody <em>Life Without Limitations</em>®.</p><p class=\"\">Lastly, we are incredibly proud to have been named one of TIME Magazine’s World’s Best Companies in Sustainable Growth 2025, an accolade that reflects our commitment to advancing a robust sustainability agenda.</p><p class=\"\">I am excited to see what the future will bring and sincerely thank our employees, customers, end-users, and shareholders for their trust and continued collaboration to improve people‘s mobility.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sveinn Sölvason</strong></p><p class=\"\">President and CEO</p><p class=\"\">------  Ends ----- </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Klaus Sindahl</strong></p><p class=\"\">Head of Investor Relations </p><p class=\"\">M: +45 5363 0134</p><p class=\"\">E: ksindahl@emblamedical.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Edda Heidrun Geirsdottir</strong></p><p class=\"\">VP of Corporate Communication </p><p class=\"\">M: +354 664 1055</p><p class=\"\">E: egeirsdottir@emblamedical.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Embla Medical press releases by e-mail</strong></p><p class=\"\">If you wish to receive Embla Medical press releases by e-mail, please register at http://www.emblamedical.com/investors</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Embla Medical</strong></p><p class=\"\">Embla Medical (Nasdaq Copenhagen: EMBLA) was founded in Reykjavik in 1971 with the mission to improve people's mobility. Embla Medical is home to several brands renowned for positively impacting people's health and well-being. They include Össur, a leading global provider of prosthetics and bracing and supports solutions; FIOR &amp; GENTZ, an innovative developer of neuro orthotics; and College Park Industries, creators of custom-built prosthetic solutions. Embla Medical also provides patients with world-class care through a global network of Orthotic and Prosthetic (O&amp;P) facilities. Embla Medical is committed to sustainable business practices and is signatory to the UN Global Compact, UN Women’s Empowerment Principles, and contributes to the UN Sustainable Development Goals. The company's climate targets have been verified by the Science Based Targets initiative. Embla Medical operates globally and has more than 4,000 employees. www.emblamedical.com</p><p class=\"\">Embla Medical was formerly listed as Össur (OSSR) on Nasdaq Copenhagen until 8 April 2024.</p><p class=\"\">https://news.cision.com/embla-medical-hf-/r/embla-medical-hf--2024-annual-report%2Cc4100675</p><p class=\"\">Embla Medical Annual Report 2024</p><p class=\"\">https://mb.cision.com/Main/18404/4100675/3246468.zip</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr22Jcjb:0-embla-medical-hf-2024-annual-report/",
            "pub_date": "2025-02-05 13:05:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463534:0",
            "title": "Baader Helvea Adjusts Clariant Forecasts on Nixed Industrial Park Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Baader Helvea Equity Research on Tuesday lowered its forecasts for Clariant  after the buyer for its German industrial park backed out of the 95 million-euro deal. </p><p class=\"\">The Swiss specialty chemical company said earlier in the day that the Lugman Group terminated the September 2024 agreement due to the City of Frankfurt exercising \"certain pre-emption rights.\" Despite the roadblock, Clariant said it will continue to look for a new owner for the Industrial Park Fechenheim in the German city. </p><p class=\"\">Analysts said the search, however, may not be an easy feat, considering the city government pushback and the fact that the property has been on the market for around two years. The researchers added that it is also possible that Clariant will need to lower its asking price to secure a new deal. </p><p class=\"\">With the absence of a supposed one-time 70 million-franc gain from the sale, Baader Helvea said it is now 8.6% below the 2025 consensus on Clariant's reported EBITDA and 25.5% lower for EPS. </p><p class=\"\">Baader Helvea rates the Swiss stock a buy with a price target of 17 francs.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463534:0/",
            "pub_date": "2025-02-05 13:05:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}