{
    "data": [
        {
            "id": "DJN_SN20260228002563:0",
            "title": "Iran conflict risks Strait of Hormuz standstill and sparks talk of $100-a-barrel oil",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Myra P. Saefong</span></p><p class=\"\"><span>Reports say Iran's military is not allowing passage through the crucial maritime waterway known as the Strait of Hormuz</span></p><p class=\"\"><span>Sealing the Straight of Hormuz would be the economic equivalent of pulling the fire alarm in a crowded theatre, says SPI Asset Management.</span></p><p class=\"\"><span>The U.S. and Israel's attack on Iran raised alarms on Saturday that a key regional source of the world's crude oil may now be at risk, sparking  talk of a return to $100-a-barrel oil prices.</span></p><p class=\"\"><span>The Strait of Hormuz, a maritime chokepoint vital to the world's crude-oil exports, has come into sharp focus as fears of a broader regional conflict grow. The strait is crucial because it allows cargo ships to pass the Persian Gulf,  the Gulf of Oman and the Arabian Sea, facilitating the production and flow of crude oil from the Middle East. The region is home to five of the world's top 10 biggest producers.</span></p><p class=\"\"><span>\"So far, there is no clarity on the magnitude of any energy disruptions, but there has been some disruption of shipping in the Strait of Hormuz,\" said Matt Gertken, chief geopolitical and U.S. political strategist at BCA Research. \"It is too soon to gauge the impact on the oil market, but the intensity of the military operation implies high odds of a major oil supply disruption\" of 5 million barrels per day or more, he told MarketWatch on Saturday.</span></p><p class=\"\"><span>The U.S. and Israel strikes on Iran targeted its leadership and military assets, The Wall Street Journal reported. The move followed failed negotiations between the U.S. and Iran to reach a deal to limit Iran's nuclear program. Iran has responded with strikes across the Middle East.</span></p><p class=\"\"><span>Read: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.</span></p><p class=\"\"><span>Several news reports Saturday indicated that passage through the Strait of Hormuz has been curtailed. An official from the European Union's naval mission Aspides told Reuters that vessels have been receiving VHF transmission from Iran's Revolutionary Guards saying that no ship is allowed to pass the Strait of Hormuz. So far, there has not been any official closure announcement.</span></p><p class=\"\"><span>'Iran understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports.'Stephen Innes, SPI Asset Management</span></p><p class=\"\"><span>Iran, however, \"understands that sealing Hormuz is the economic equivalent of pulling the fire alarm in a crowded theatre and locking the exits for Middle East oil exports,\" said Stephen Innes, managing partner at SPI Asset Management. \"It would hit not only Western consumers but also China and regional buyers. It is a blunt instrument.\"</span></p><p class=\"\"><span>Developments in the region are sure to impact oil prices as soon as trading resumes late Sunday and into early Monday.</span></p><p class=\"\"><span>Oil prices will continue to rise on speculation that the war will expand and that infrastructure will be hit, said BCA Research's Gertken. U.S. global benchmark Brent crude (BRN00) could reach $90 per barrel without significant physical disruption, he said. That would be a more than 20% rise from Friday's settlement of $72.87 for the May contract (BRNK26).</span></p><p class=\"\"><span>If there is physical disruption, then it can rise above $100 per barrel - \"potentially well above\" that, said Gertken.</span></p><p class=\"\"><span>Strait of Hormuz: A staggering chokepoint</span></p><p class=\"\"><span>Just how much oil could be involved when it comes to the Strait of Hormuz and to the broader region is staggering. Kpler provided a snapshot Saturday of oil and oil-product tankers in the Strait of Hormuz.</span></p><p class=\"\"><span>This map is a snapshot of the oil and oil-product tankers currently in and around the Strait Hormuz. Green tankers are loaded, while red ones are in \"ballast,\" or essentially empty.</span></p><p class=\"\"><span>Around 20% of the global petroleum liquids the world uses transits through the strait each day. Last year, just over 14.5 million barrels per day of crude and crude condensate exports passed through the strait, said Matt Smith, U.S. head analyst at Kpler.</span></p><p class=\"\"><span>From the archives: Strait of Hormuz, the world's biggest oil chokepoint, in focus as U.S.-Iran tensions flare</span></p><p class=\"\"><span>Saudi Arabia accounted for around 5.5 million daily barrels, Iraq 3.25 million, UAE 1.97 million, Iran 1.59 million, Kuwait 1.55 million, and Qatar 0.72 million, said Smith. Over 90% of that oil typically heads to Asia, around 4% to Europe, 4% to the Americas and the rest to Africa, he said.</span></p><p class=\"\"><span>Four countries - China, India, Japan and South Korea - account for nearly three-quarters of the crude barrels that pass through the Strait of Hormuz, so they would feel the most significant impact, said Smith.</span></p><p class=\"\"><span>The Middle East is home to half of the world's top 10 oil producers - Saudi Arabia, Iraq, the United Arab Emirates, Iran and Kuwait, according to the International Energy Agency. In 2022, the region accounted for more than four in 10 barrels of global oil exports, it said.</span></p><p class=\"\"><span>Yet the oil market's biggest risk isn't the Strait of Hormuz being closed, said Kpler's Smith. It's that \"Iran's retaliation leads to broader unrest in the region, putting supply at risk,\" he said.</span></p><p class=\"\"><span>Iran alone produces 3.2 million daily barrels of crude oil, with around 2 million of that primarily exported to China for refining, according to OPIS, a unit of Dow Jones, the publisher of MarketWatch.</span></p><p class=\"\"><span>Iran's proven crude oil reserves are estimated at 208 billion barrels, according to OPIS.</span></p><p class=\"\"><span>There have been reports of explosions Iran's Kharg Island, a key export terminal roughly 15 miles off the coast of Iran, OPIS's Denton Cinquegrana and Tracy Cui wrote in a report Saturday. It is still too early to tell what kind of damage, if any, has been done to export infrastructure on Kharg Island, they said, but about 90% of Iran's exports go through it. Sometimes called \"oil island,\" it has a storage capacity of about 7 million barrels.</span></p><p class=\"\"><span>From the archives: Israeli strikes on Iran's 'oil island' could send crude prices soaring</span></p><p class=\"\"><span>OPEC+ meeting Sunday</span></p><p class=\"\"><span>The Iran conflict comes ahead of Sunday's monthly meeting of eight major oil producers, a group known as the Organization of the Petroleum Exporting Countries and its allies, or OPEC+.</span></p><p class=\"\"><span>The group had been raising their production quotas for most of last year, but paused those increases for the first quarter of 2026 on the heels of expectations for a global oil supply surplus.</span></p><p class=\"\"><span>Now OPEC+ is likely to increase production to \"try to suppress prices, cushion the global economy, and undercut Iranian regime funding,\" said BCA Research's Gertken. But if shipping is affected, then any such production increases \"may not be able to reach the global market immediately.\"</span></p><p class=\"\"><span>Read: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices</span></p><p class=\"\"><span>-Myra P. Saefong</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002563:0/",
            "pub_date": "2026-03-01 22:23:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZP03F:0",
            "title": "Gulf businesses reel as Iran strikes trigger regional shutdowns",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Gulf markets tumble as trading halts and volatility surges</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Ramadan networking events cancelled or postponed</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Airport and port shutdowns hit tourism and transit operations</span></li></ul></span></div><span><p class=\"\"><span>By Hadeel Al Sayegh, Federico Maccioni, Rachna Uppal and Ateeq Shariff</span></p><p class=\"\"><span>    Iran's retaliatory strikes across the Gulf have triggered the most widespread business disruption in the region since the pandemic, forcing airport closures, halting port operations and sending shockwaves through financial markets.</span></p><p class=\"\"><span>The attacks, launched in response to a joint U.S.-Israeli assault on Iran, landed across every major state in the Gulf, a region that has spent decades building its reputation as one of the world's most reliable business hubs. Three people were killed by the attacks in the United Arab Emirates and loud bangs were heard for a second day in Dubai and Abu Dhabi on Sunday. </span></p><p class=\"\"><span>The strikes marked an unprecedented escalation for Dubai, a city whose modern identity was built on being insulated from the region's conflicts. From humble beginnings as a small fishing village, the emirate of Dubai used modest oil revenues to build ports, airports and trade centres before pivoting in the 1990s to luxury tourism, real estate and financial services. </span></p><p class=\"\"><span>\"Regionally, the impact across (Gulf) economies is mixed,\" said Vijay Valecha, chief investment officer at Century Financial. </span></p><p class=\"\"><span>\"Elevated oil prices provide a fiscal cushion for producers such as Saudi Arabia and Qatar, strengthening revenues and liquidity. However, trade, logistics and tourism, particularly in the UAE, would face pressure if shipping risks rise or regional sentiment weakens.\"</span></p><p class=\"\"><span>STOCK MARKETS FALL</span></p><p class=\"\"><span>Gulf stock markets fell sharply when trading opened on Sunday, with Saudi Arabia's benchmark index dropping more than 4% at the open and closing down 2.2%. Oman closed down 1.4% and Egypt lost 2.5%, both paring earlier losses. Kuwait's exchange took the unusual step of suspending trading until further notice. UAE markets, shut on Sundays, are due to open on Monday.</span></p><p class=\"\"><span> \"Markets will continue to be fragile and volatile as long as the military actions are active,\" said Mohammed Ali Yasin, chief executive of Ghaf Benefits, a Lunate company in Abu Dhabi. \"Usually in such events, the international institutional investors are the ones that put the selling pressures initially... while local ones try and soften the drops by picking the leading stocks.\"</span></p><p class=\"\"><span>Iran's strikes targeted airports, military installations, ports and hotels across the Gulf. Dubai International Airport and Abu Dhabi's Zayed International Airport both sustained damage, with one civilian killed and 11 injured across the two sites. A berth at Dubai's Jebel Ali Port also caught fire following an aerial interception.</span></p><p class=\"\"><span>Some of the UAE's biggest companies include Dubai developer Emaar Properties and retailer Majid Al Futtaim. The country has also become a magnet for global hedge funds and major banks seeking proximity to vast pools of sovereign wealth managed by ADIA and Mubadala.</span></p><p class=\"\"><span> RAMADAN NETWORKING</span></p><p class=\"\"><span>The disruption has landed at a particularly sensitive moment in the Gulf's business calendar. The attacks fell during the Islamic holy month of Ramadan, when corporate iftars and suhoors - the communal meals that break and begin the daily fast - are among the region's most important networking events.</span></p><p class=\"\"><span>Emails seen by Reuters show that gatherings hosted by Dubai carrier Emirates, Abu Dhabi energy company Masdar, Mubadala and education firm GEMS, along with the Department of Government Enablement, have been cancelled or postponed.</span></p><p class=\"\"><span>For a region where relationships underpin business dealings, the loss of Ramadan's networking season adds a less visible but significant cost to the disruption already unfolding.</span></p><p class=\"\"><span>Strikes also hit residential areas around Dubai Marina and Palm Jumeirah, setting the Fairmont The Palm hotel ablaze and damaging the Burj Al Arab. The Fairmont had recently been sold for $325 million to Kuwait's Arzan Investment Management - a deal seen as a marker of surging Gulf hospitality demand - making the damage one of the starker symbols of the toll on the region's booming tourism economy.</span></p><p class=\"\"><span>The United States, UK and European Union issued updated travel advisories for the Gulf following the strikes, urging citizens to exercise extreme caution and avoid non-essential travel. Key transit airports, including Dubai, Abu Dhabi and Doha in Qatar, were shut or severely restricted on Sunday as much of the region's airspace remained closed. </span></p><p class=\"\"><span>Staff at major international companies are expected to follow local guidance on working from home in the coming days. The UAE federal labour authority advised companies to implement remote working arrangements through March 3, urging them to keep workers away from open areas, with the exception of vital roles requiring physical attendance.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZP03F:0-gulf-businesses-reel-as-iran-strikes-trigger-regional-shutdowns/",
            "pub_date": "2026-03-01 22:24:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZP0B2:0",
            "title": "One presumed dead and five missing after tug boat sinks off South African coast",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>One person was presumed dead and five crew members reported missing on Sunday after a tug boat sank off South Africa's southern coast, a multi-agency maritime body said.</span></p><p class=\"\"><span>The tug vessel LEO transmitted a distress message at 1702 GMT on Saturday, reporting uncontrolled water ingress and requesting immediate assistance, South African Search and Rescue (SASAR) said in a statement. </span></p><p class=\"\"><span>The ship sank in the early hours of Sunday, approximately 80 nautical miles south of Mossel Bay in South Africa's Western Cape province.</span></p><p class=\"\"><span>\"To date, 13 crew members have been accounted for, consisting of 12 survivors, and one presumed deceased,\" SASAR said, adding that the vessel had 18 crew members on board before the incident.</span></p><p class=\"\"><span>Search operations continue for the five missing crew members despite adverse weather conditions, SASAR said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZP0B2:0-one-presumed-dead-and-five-missing-after-tug-boat-sinks-off-south-african-coast/",
            "pub_date": "2026-03-01 22:25:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3X70DR:0",
            "title": "Egypt's M2 money supply rises 18.7% year on year in January",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Egypt's M2 money supply was up 18.7% year on year in January, central bank data showed on Sunday.</span></p><p class=\"\"><span>Money supply rose to 14.08 trillion Egyptian pounds ($289.1 billion) from 11.7 trillion pounds in January 2025.</span></p><p class=\"\"><span>($1 = 48.7000 Egyptian pounds)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3X70DR:0-egypt-s-m2-money-supply-rises-18-7-year-on-year-in-january/",
            "pub_date": "2026-03-01 22:14:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:cd73f71e3094b:0",
            "title": "Veteran Macro Investor Jordi Visser Says ‘AI Can’t Survive Without’ Bitcoin",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Jordi Visser said AI “can’t survive without crypto,” arguing that fiat financial guardrails “cannot handle the speed of AI,” especially as AI agents become more common.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Visser said cryptography became more important as deepfakes and AI-driven spam made it harder to confirm identity across calls, texts, and email.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Separately, Pentagon-AI partnerships drew attention after the U.S. moved to phase out Anthropic from federal use while OpenAI moved forward with a defense deal.</span></li></ul></span></div><span><p class=\"\"><span>Veteran macro investor Jordi Visser said that the fiat financial system wasn't made to handle the speed and scale of artificial intelligence. He said that as AI agents become more independent, crypto infrastructure will be needed.</span></p><p class=\"\"><span>Visser spoke on the Pomp Podcast with Anthony Pompliano on Saturday, saying that AI systems would need financial infrastructure that could handle high-speed execution, autonomous agents, and real-time verification. He added that existing fiat guardrails were not meant to support these functions, which only </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/coins/bitcoinhttps://stocktwits.com/coins/bitcoin\" rel=\"nofollow\" target=\"_blank\">Bitcoin (BTC)</a><span> can. </span></p><p class=\"\"><span>“Coming out of a crisis, you want to invest in the fastest horse in the race. Well, the fastest horse in the race coming out of this cycle is crypto, and this time I don't think it's going to stop,” he added.</span></p><p class=\"\"><span>According to Visser, many investors in venture capital, commodities, and macro had come to the same conclusion: AI couldn't grow without crypto-based rails. He also said that verification is a problem. According to Visser, cryptography has become increasingly crucial for verifying identity and authenticity as the volume of AI-generated content and spoofed communications rises. He described verification as a structural requirement in an AI-heavy environment, citing crypto-linked identity approaches.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI, Government And Model Controls</span></strong></p><p class=\"\"><span>Visser sees the conflict between Anthropic and the Defense Department as a sign of a bigger change that is coming, in which crypto infrastructure will be needed for AI to grow safely, securely, and on its own.</span></p><p class=\"\"><span>Visser points to a growing conflict between AI developers and government agencies, using Anthropic's problems with the U.S. Department of Defense as an example. Anthropic has refused to take away some safety features from its models, even though defense officials want to use them in more ways without restrictions. Visser thinks this standoff shows a bigger problem: AI is moving so quickly that current institutional controls, whether regulatory, financial, or moral, are struggling to keep up.</span></p><p class=\"\"><span>Separately, OpenAI moved forward with partnerships with the government, including those related to defense, while also laying out its own rules for using its products. OpenAI co-founder </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/business/others/openai-altman-anthropic-extremely-scary-precedent-pentagon/cZdcsKvRIcE\" rel=\"nofollow\" target=\"_blank\">Sam Altman said</a><span> the Pentagon’s reported move to phase out Anthropic set an “extremely scary precedent,” as OpenAI finalized its own Defense Department agreement.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:cd73f71e3094b:0/",
            "pub_date": "2026-03-01 22:18:43",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000617_20260301000617:0",
            "title": "ZJLD Group Sees FY Rev CNY3.55B-CNY3.70B, Down 48% to 40% >6979.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000617_20260301000617:0/",
            "pub_date": "2026-03-01 21:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000617_20260301000618:0",
            "title": "ZJLD Group Sees FY Net CNY0.52B-Net CNY0.58B, Down 56% to 61% >979.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000617_20260301000618:0/",
            "pub_date": "2026-03-01 21:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000617_20260301000619:0",
            "title": "ZJLD Cites Softened Market Demand, Which Led to Reduced Spending on Baijiu, Particularly in Business, Social Banquets, Gifting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000617_20260301000619:0/",
            "pub_date": "2026-03-01 21:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_ACSTrbpza:0",
            "title": "Sterling Metals Discovers Cu-Mo Porphyry Stock 1.5km from MEPS Discovery Zone Confirming Scale of Porphyry Copper System",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>TORONTO, ON / ACCESS Newswire / March 1, 2026 /</span></strong><span> </span><span>Sterling Metals Corp. </span><span>(OTCQB:SAGGF) (\"Sterling\" or the \"Company\") is pleased to report that in the first drill hole of the 2026 drill program, the Company has discovered a greater than 400m zone of felsic porphyry stock hosting widespread, multi-stage copper and molybdenum sulphide mineralization with potassic alteration and porphyry-type veining.</span></p><p class=\"\"><span>The blind porphyry stock was drill-intersected approximately 1.5km from the MEPS Discovery (\"</span><strong class=\"root-Tkn6WL2y\"><span>MEPS Discovery</span></strong><span>\") that is highlighted by a 400 x 400m continuous zone of near-surface copper mineralization centered around discovery hole MEPS-25-02 that contained 265.5m of 1.05% CuEq* including 68.3m of 3.25% CuEq*(see press release dated September 29, 2025). The presence of a Cu-Mo mineralized felsic porphyry stock so far from the MEPS Discovery provides further strong evidence for the presence of a giant porphyry copper system at the Soo Copper Project, located off the Trans-Canada Highway only 70km north of Sault Ste Marie and 20 km from rail and deep-water access.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Highlights</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Drillhole SC-26-01 was designed to test a ZTEM resistivity low geophysical target in proximity to bornite and chalcopyrite exposures in outcrop and as a large step-out to the MEPS Discovery (Figure 1 and 2).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>At approximately 530m vertical depth, a thick zone of altered mafic volcanics transitioned sharply into a coarse-grained felsic porphyry, interpreted as part of a stock-like intrusive body, which was then drilled for over 400m currently continuing at approximately 1000m depth. The porphyry stock contains widespread, overall weak to moderate, but locally strong development of copper sulphides as fine chalcopyrite and bornite disseminations in the groundmass and as coarser grains within veins and is closely associated with potassic feldspar alteration. Molybdenite is also commonly present within quartz veins with or without chalcopyrite (see Figure 3, 4 and 5).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>While assays are not expected for some time, the evidence from this hole suggests this is not the core of the mineralized stock but a peripheral part of a larger copper zone. However, it does confirm that there is a large porphyry stock complex associated with the surface copper showings identified across this 7km x 3km copper corridor of surface showings and drill holes that represent the upper expression of the overall giant footprint of this porphyry copper system.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The next hole is planned to drill-test the western edge of the same ZTEM anomaly in search of the shoulders of the stock and a possible associated zone of larger, higher grade porphyry copper mineralization.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>A similar ZTEM resistivity anomaly has also been identified beneath the MEPS Discovery area which is also a focus for drill-testing in this winter program (Figure 1).</span></p></li></ul><p class=\"\"><span>Neil O'Brien, Chief Geologist of Sterling Metals, comments, \"The discovery of a source porphyry stock that hosts widespread potassic alteration and copper mineralization, including bornite, so quickly into the winter program is an incredible early result. It validates both our contention of there being a giant porphyry copper complex underlying a significant area of the Soo Project but also that our exploration targeting approach is right and will lead us to where there is the greatest potential for large concentrations of copper.\"</span></p><p class=\"\"><span>Based upon visual core logging, the stock is so far principally composed of a granite porphyry to quartz monzonite porphyry intrusive, compositions that are common to many major porphyry copper systems worldwide. The porphyry contains abundant phenocrysts of feldspar (plagioclase and orthoclase) and quartz with common but lesser mafic phenocrysts (hornblende and biotite). The common presence of both primary igneous hornblende and biotite (Figure 4), both hydrous minerals, in this felsic porphyry is indicative of a 'wet' hydrous source magma that is critical to the late-stage development of abundant, metal-rich, hydrothermal fluids that are ultimately responsible for the mineralization of copper and other metals in porphyry copper systems typically as sulphides within veins crossing the stock and intruded country rocks.</span></p><p class=\"\"><span>The granite porphyry hosts widespread but patchy potassic feldspar alteration with lesser local zones of epidote alteration and weak to moderate development of porphyry style veining, including early biotite veins and a variety of quartz-sulphide A-veins. Copper is present as very fine disseminations of chalcopyrite throughout much the groundmass of the porphyry, and as larger grains within veins and partly replacing mafic phenocrysts (Figure 3 and 4). Bornite locally replaces chalcopyrite, especially within mafic mineral grains but also within irregularly shaped pegmatitic zones of very coarse grained quartz and potassic feldspar. Molybdenite is present as medium to coarse grains within later, thicker quartz veins with or without chalcopyrite (Figure 4).</span></p><p class=\"\"><span>There is also strong evidence that other intrusive porphyry phases help comprise the intrusive stock complex, including an early-stage felsic porphyry with a fine grained groundmass reminiscent of the GFP felsic porphyry dykes found at MEPS, that is strongly potassic (biotite) altered and hosts a greater concentration of veins than the granite porphyry (Figure 5). The discovery of this Cu-Mo mineralized, potassic altered and veined granite porphyry stock at 1.5km from the MEPS Discovery supports the Company's contention that the widespread surface copper showings and copper-in-soil anomalies are indicative of the presence of a giant porphyry copper complex that offers tremendous exploration discovery potential.</span></p><p class=\"\"><span>Figure 1: Plan map illustrating 8km copper corridor, as defined by copper in surface showings and drill holes, associated with underlying resistivity lows along 800m depth slice</span></p><p class=\"\"><span>Figure 2: Cross Section illustrating ZTEM resistivity target and main rock units intercepted in drill hole; transition from basalt to porphyry stock at approximately 530m vertical depth</span></p><p class=\"\"><span>Figure 3: Example in SC-26-01 of porphyry stock 740m downhole with close up illustrating early biotite (dark) veining and quartz-sulphide (light) A-veining</span></p><p class=\"\"><span>Figure 4: Examples within SC-26-01 of different types of Cu-Mo veining and disseminated chalcopyrite within porphyry stock</span></p><p class=\"\"><span>Figure 5: Example in SC-26-01 of clasts of potassic-altered, fine-grained felsic porphyry (dark), reminiscent of bornite-related GFP porphyry dykes at MEPS Discovery, hosted by coarser grained granite porphyry and crosscut by significant density of porphyry style A-veins</span></p><p class=\"\"><span>Sterling will be attending PDAC 2026 at the Metro Toronto Convention Centre (MTCC) from Sunday, March 1 to Monday, March 2, 2026, participating in Core Shack - Session A, Booth 3113A. Shareholders and investors are invited to meet with members of Sterling's management and technical team at the Company's exhibit in the MTCC South Building.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Interval Width and Copper Equivalent Calculations</span></strong></p><p class=\"\"><span>Intervals may not represent true widths which are not yet known and capping has not been applied to grades. Copper Equivalent (CuEq) for drill intersections is calculated based on a three-year trailing average for each commodity (2023, 2024 and 2025) which equates to US$ 4.18/lb Cu, US$ 2,600/oz Au, US$ 30.54/oz Ag and US$ 21.46/lb Mo, with 80% metallurgical recoveries assumed for all metals. The formula is: CuEq % = Cu % + (0.907 x Au g/t) + (0.0107 x Ag g/t) + (0.00051 x Mo ppm).</span></p><p class=\"\"><span>Sampling Procedures - Quality Assurance/Quality Control</span></p><p class=\"\"><span>Analytical services were provided by Actlabs, which is an independent, CALA- and SCC-accredited analytical services firm registered to ISO 17025 and ISO 9001 standard. Drill core samples were logged and split in half with a diamond core saw. Half-core samples were securely stored at the core logging facility until being delivered to Actlabs Thunder Bay lab by commercial transport. Samples were crushed (&lt; 7 kg) up to 90% passing 2mm (10 mesh), riffle split to 250 g and pulverized by mild steel to 95% passing 105μm (150 mesh). Samples splits underwent a 4-acid near total digestion followed by a multi-element analysis, including base metals, using an ICP method for 35 elements. Selected sample pulps were then analyzed for gold using a 30 g aliquot mixed with fire assay fluxes and Ag as a collector, placed in a fire clay crucible, gradually heated to 1060ºC for 60 min, and followed with an AA finish.</span></p><p class=\"\"><span>Laboratory QA/QC for the ICP analysis was 14% for each batch, including 5 method reagent blanks, 10 in-house controls, 10 samples duplicates, and 8 certified reference materials. An additional 13% QA/QC was performed as part of the instrumental analysis to ensure quality in the areas of instrumental drift. Laboratory quality control for the gold fire assay included two blanks per 42 samples, three sample duplicates and 2 certified reference materials, one high and one low (QC 7 out of 42 samples). In-house QA/QC included the systematic insertion of blanks, duplicates, and certified reference materials (CRM).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qualified Person</span></strong></p><p class=\"\"><span>Jeremy Niemi, P.Geo., Senior Vice President, Exploration and Evaluation for Sterling Metals has reviewed and approved the technical information presented herein.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About the Soo Copper Project</span></strong></p><p class=\"\"><span>The Soo Copper Project sits just 20 minutes off the Trans-Canada Highway, one hour north of Sault Ste. Marie, and 20km from rail and deep-water access. With near-surface copper-one of the most critical of all critical metals-alongside gold, and with the project now demonstrating both scale and grade, Sterling sees the potential for Soo Copper to become a nationally significant asset as Canada accelerates its efforts to secure strategic copper resources. Prime Minister Carney's recent designation of copper as one of Canada's first five strategic assets underscores the importance of this discovery and its potential to emerge as a key project of national interest.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Sterling Metals</span></strong></p><p class=\"\"><span>Sterling Metals is a mineral exploration company focused on large scale and high-grade Canadian exploration opportunities. The Company is advancing the 25,000-hectare Soo Copper Project in Ontario which has past production, and multiple breccia and porphyry targets strategically located near robust infrastructure and the 29,000-hectare Adeline Project in Labrador which covers an entire sediment-hosted copper belt with significant silver credits. Both opportunities have demonstrated potential for important new copper discoveries, underscoring Sterling's commitment to pioneering exploration in mineral rich Canada.</span></p><p class=\"\"><span>Sterling Metals acknowledges that its exploration activities within the Soo Copper project are conducted on the traditional lands of the Batchewana, Garden River, and Michipicoten First Nations of the North Shore of Lake Superior. We recognize and respect the longstanding and diverse relationships Indigenous Peoples have with the land and are committed to engaging in a manner that is respectful, transparent, and inclusive.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><span>Sterling Metals Corp.</span></p><p class=\"\"><span>Mathew Wilson, CEO and Director</span></p><p class=\"\"><span>Tel: (416) 643-3887</span></p><p class=\"\"><span>Email: info@sterlingmetals.ca</span></p><p class=\"\"><span>Website: www.sterlingmetals.ca</span></p><p class=\"\"><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. This news release contains certain \"forward-looking information\" within the meaning of applicable securities laws. Forward looking information is frequently characterized by words such as \"plan\", \"expect\", \"project\", \"intend\", \"believe\", \"anticipate\", \"estimate\", \"may\", \"will\", \"would\", \"potential\", \"proposed\" and other similar words, or statements that certain events or conditions \"may\" or \"will\" occur. These statements are only predictions. Forward-looking information is based on the opinions and estimates of management at the date the information is provided and is subject to a variety of risks and uncertainties and other factors that could cause actual events or results to differ materially from those projected in the forward-looking information. For a description of the risks and uncertainties facing the Company and its business and affairs, readers should refer to the Company's Management's Discussion and Analysis. The Company undertakes no obligation to update forward-looking information if circumstances or management's estimates or opinions should change, unless required by law. The reader is cautioned not to place undue reliance on forward-looking information.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Sterling Metals Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_ACSTrbpza:0/",
            "pub_date": "2026-03-01 22:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-03-01:newsml_ACSy0kt9a:0",
            "title": "OUKITEL Unveils Next-Generation Rugged Devices Designed to Dominate All Scenarios at MWC 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>HONG KONG, HK / ACCESS Newswire / March 1, 2026 /</span></strong><span> Oukitel, a global leader in outdoor technology, is revolutionizing the industry with groundbreaking devices designed to exceed users' highest expectations and drive a more sustainable future. At MWC 2026, the world's premier tech showcase, Oukitel will unveil its latest all-in-one devices, engineered to conquer any challenge in every scenario.</span></p><p class=\"\"><span>Among Oukitel's highlights, the WP61 series stands out with its top-tier satellite communication, keeping users connected while rewriting the rules of mobile technology. The RG14-P solar-powered laptop delivers uninterrupted productivity, even in the toughest outdoor conditions. The high-capacity P5000 Pro power station ensures resilient, long-lasting power from off-grid expeditions to home backup. Don't miss the opportunity to experience the pioneering technologies firsthand at Booth 7F46 from March 2 to March 5, 2026.</span></p><p class=\"\"><span>Oukitel WP61 Series: The Next Generation of Professional Rugged Innovation</span></p><p class=\"\"><span>At the forefront of mobile innovation, the WP61 series is the world's first rugged professional flagship to seamlessly combine satellite, thermal imaging, and walkie-talkie technologies. With cutting-edge NTN two-way satellite connectivity, the lineup ensures users stay connected in even the most extreme environments, providing unparalleled reliability and safety.</span></p><p class=\"\"><span>The WP61 series's DMR walkie-talkie enables real-time communication, empowering users to coordinate efficiently during industrial operations, rescue missions, or outdoor adventures. Equipped with industry-leading thermal technology with a 256×192 resolution, it reveals heat signatures with exceptional precision, helping users identify potential hazards during security, maintenance, and inspection tasks. Additionally, this series packs a massive 20,000mAh battery, supporting 45W fast charging and reverse charging.</span></p><p class=\"\"><span>Oukitel RG14-P: Pioneers Sustainable Productivity with Solar-Powered Technology</span></p><p class=\"\"><span>The RG14-P is shaping the future of sustainable productivity as the world's first rugged industrial laptop with integrated solar charging. Built for off-grid environments, it keeps performance unstoppable, making it the leading choice for outdoor tasks, industrial projects, and remote missions.</span></p><p class=\"\"><span>Equipped with a 3,000mAh main battery and a 5200mAh backup, complemented by 65W fast charging, the laptop ensures continuous operation during intensive workloads and critical situations. Running Windows 11, it handles heavy tasks effortlessly while its 14.1\" touchscreen enables users to interact directly with the display for a faster, more intuitive experience. The RG14-L also comes in a variant featuring a built-in camping light for low-light use.</span></p><p class=\"\"><span>Oukitel RT10 Series: Redefines Industrial-Grade All-in-One Tablets for the Most Demanding Operations</span></p><p class=\"\"><span>The RT10 series, the world's first industrial-grade multifunctional tablet, pushes all-in-one performance to new heights, handling complex operations without compromise. It combines a customizable industrial fingerprint capture module, ensuring secure and precise enrollment, with an integrated 2D barcode scanner for lightning-fast scanning. These features streamline workflows and enhance efficiency across warehousing, logistics, and manufacturing.</span></p><p class=\"\"><span>Powered by a massive 25,000mAh battery with reverse charging, the compact RT10 series sets a new benchmark for endurance. Its 5W dual speakers deliver crisp audio over 130 dB, while the ultra-bright camping light with multiple lighting modes adapts effortlessly to demanding work and outdoor environments. Among the RT10 lineup, the RT10 Pro variant, featuring a built-in projector, will also be showcased at the event.</span></p><p class=\"\"><span>Oukitel P5000 Pro: The Ultimate Green Portable Power Solution for Any Situation</span></p><p class=\"\"><span>The P5000 Pro is the unrivaled leader in large-capacity portable power stations, marking a milestone in green, sustainable energy solutions. Featuring a colossal 5120Wh capacity, it powers 99% of devices, supplying the energy needed for home backup, camping, RVs, and power outages. Its 3600W AC output effortlessly powers multiple heavy-duty devices simultaneously, while the 1800W AC input charges it to 80% in just 1.5 hours. The advanced LiFePO4 battery ensures maximum safety, supporting up to 5000 cycles and offering a remarkable 10-year lifespan.</span></p><p class=\"\"><span>These Oukitel devices are the best choice for those seeking cutting-edge, sustainable technology. Get an exclusive look at them at Booth 7F46 during MWC 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CONTACT:</span></strong></p><p class=\"\"><span>Leo Wu, Marketing Director</span></p><p class=\"\"><span>leowu@oukitel.com / +86 135 6469 0683</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Oukitel</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-03-01:newsml_ACSy0kt9a:0/",
            "pub_date": "2026-03-01 22:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN18Z:0",
            "title": "AI disruption looms over markets with US jobs data on tap",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Monthly US jobs data due on Friday, March 6</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Broadcom, retailers report as Q4 results season winds down</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Investors on guard for AI developments that could shake shares</span></li></ul></span></div><span><p class=\"\"><span>By Lewis Krauskopf</span></p><p class=\"\"><span>Prospects for artificial intelligence to disrupt business sectors should keep the U.S. stock market on edge in the coming week, as Wall Street looks for more insight into how the emerging technology will reverberate through the economy.</span></p><p class=\"\"><span>The monthly U.S. jobs report headlines economic data due next week, while major semiconductor player Broadcom </span><span> is among the remaining reports that will close out the fourth-quarter earnings season.</span></p><p class=\"\"><span>The disruptive potential of AI has consumed investors in recent weeks, with shares in industries such as software, wealth management and real estate services pummeled by concerns about business upheaval.</span></p><p class=\"\"><span>\"There continues to be this ... back and forth about who might be the victim and those that will actually emerge winners because they are harnessing AI as opposed to being replaced by it,\" said Kristina Hooper, chief market strategist at Man Group.</span></p><p class=\"\"><span>\"There is very little definitive right now about that, and so I think that will continue to be a concern.\"</span></p><p class=\"\"><span>Stock prices in areas such as software remain acutely sensitive to AI-related developments. AI bellwether Nvidia's </span><span> highly anticipated quarterly report failed to calm nerves, with the semiconductor giant's shares falling over 5% on Thursday and weighing on the technology sector. Investors are concerned about whether Nvidia's \"hyperscaler\" customers will garner sufficient returns to justify their massive spending on data centers and other infrastructure.</span></p><p class=\"\"><span>Despite the tech sector's struggles, gains this year in other areas such as industrials and consumer staples have helped support major equity indexes. </span></p><p class=\"\"><span>Weakness in tech and financial shares dragged on major averages on Friday, with the S&amp;P 500 </span><span> and Nasdaq Composite </span><span> in February both posting their biggest monthly percentage declines in about a year.</span></p><p class=\"\"><span>The benchmark S&amp;P 500 was up 0.5% so far in 2026 as of Friday.</span></p><p class=\"\"><span>\"The U.S. equity market is sort of in its late cycle, trying to find the winners and losers of this new disruptive technology and pretty much treading water,\" said John Velis, Americas macro strategist at BNY.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:912.2055674518201px;aspect-ratio:1.5203426124197001\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZN18Z-83bdf5296b2921a647fe73c94de5e562-resized.webp\" type=\"image/webp\"/><img alt=\"Software index vs S&amp;P 500 performance in 2026\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZN18Z-83bdf5296b2921a647fe73c94de5e562-resized.webp\" style=\"background-color:#fbfafa\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Software struggles</span></figcaption></figure><p class=\"\"><span>WILL FEBRUARY JOBS BACK JANUARY'S STRENGTH?</span></p><p class=\"\"><span>The U.S. jobs report for February, due on March 6, is expected to show an increase of 60,000 jobs, according to a Reuters poll. It comes after January's surprisingly robust report, with an increase of 130,000 jobs and the unemployment rate falling to 4.3%.</span></p><p class=\"\"><span>The January report allayed worries about a weakening labor market, but \"the concern is that January is a one-off,\" said Paul Nolte, senior wealth adviser and market strategist at Murphy &amp; Sylvest Wealth Management.</span></p><p class=\"\"><span>\"We saw a good January jobs report, but we also have seen a really weak 2025 for the job market,\" Hooper said. \"And so the question becomes, where do we go from here?\"</span></p><p class=\"\"><span>Investors will also seek clues from the report about when the Federal Reserve may next cut interest rates. Fed funds futures suggest the next reduction will come in June or July, after Fed Chair Jerome Powell's term ends in May and his nominated replacement Kevin Warsh could be in charge.</span></p><p class=\"\"><span>The Fed cut rates last year in the face of a weakening employment backdrop but paused the easing cycle in January, and solid jobs data could prompt investors to push back their expectations for further cuts. Investors generally associate lower interest rates with higher prices for stocks and other assets.</span></p><p class=\"\"><span>BNY's Velis said the market's reaction to the jobs data will be telling for which factors are prominent for equity investors. For example, strong data followed by weak stock performance is \"going to be a sign that the rate argument is important,\" Velis said.</span></p><p class=\"\"><span>RETAIL SALES, BROADCOM EARNINGS ALSO UP NEXT</span></p><p class=\"\"><span>Other economic releases due in the coming week include reports on manufacturing and services sector activity. The retail sales report for January is expected on March 6.</span></p><p class=\"\"><span>Aside from Broadcom's quarterly report on Wednesday, results are expected from retailers Best Buy </span><span> and Target </span><span>.</span></p><p class=\"\"><span>Wall Street is eager for any evidence of AI's impact on the economy, both positive and negative. In an interview with Reuters this week, outgoing Atlanta Fed President Raphael Bostic said the U.S. may be entering a period of structurally higher unemployment as firms deploy AI tools to save labor.</span></p><p class=\"\"><span>\"Major technological shifts provoke both excitement and anxiety,\" Keith Lerner, chief investment officer at Truist Advisory Services, said in a research note on Thursday. \"More recently... optimism has begun to give way to heightened anxiety and increasingly bleak narratives about AI’s impact on work, productivity, and economic outcomes.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN18Z:0-ai-disruption-looms-over-markets-with-us-jobs-data-on-tap/",
            "pub_date": "2026-03-01 22:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000611_20260301000611:0",
            "title": "China Resources Building Materials Announces CFO Change",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000611_20260301000611:0/",
            "pub_date": "2026-03-01 21:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000611_20260301000613:0",
            "title": "China Resources Building Huang Hu Stepped Down as CFO, Yang Min Appointed CFO With Effect From February 27",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000611_20260301000613:0/",
            "pub_date": "2026-03-01 21:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000614_20260301000614:0",
            "title": "China Resources Medical Sees FY Net CNY467M-Net CNY516M, Fown 17.5% to 8.9%>1515.HK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000614_20260301000614:0/",
            "pub_date": "2026-03-01 21:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cnbctv:63f540296094b:0",
            "title": "Watch | Gurmeet Chadha & Devina Mehra on market strategy amid West Asia tensions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Devina Mehra, Founder, Chairperson and Managing Director of First Global and Gurmeet Chadha, Managing Partner &amp; CIO of Complete Circle say geopolitical tensions may trigger short-term volatility but not a lasting bear market. Mehra advises using market dips to deploy cash, noting past conflicts fade from markets and crude spikes are usually temporary. She prefers autos, pharma and select cyclicals. Chadha remains overweight defence, citing opportunities in Solar Industries, Bharat Electronics and Zen Technologies, while also watching refiners amid oil price swings.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cnbctv:63f540296094b:0/",
            "pub_date": "2026-03-01 21:37:46",
            "source": "CNBC TV18",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO06A:0",
            "title": "DP World Suspends Operations At Jebel Ali Port In Dubai - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DP WORLD SUSPENDS OPERATIONS AT JEBEL ALI PORT IN DUBAI - BLOOMBERG NEWS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO06A:0-dp-world-suspends-operations-at-jebel-ali-port-in-dubai-bloomberg-news/",
            "pub_date": "2026-03-01 21:19:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000586_20260301000586:0",
            "title": "Shenzhen Woer Heat-Shrinkable Material FY Rev CNY8.45B Up 22%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000586_20260301000586:0/",
            "pub_date": "2026-03-01 21:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260301000737:0",
            "title": "Here's how much you could pay for a gallon of gas by May because of the attacks on Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Myra P. Saefong</span></p><p class=\"\"><span>U.S.-Israel strikes against Iran will push up oil futures, and prices at the pump: GasBuddy</span></p><p class=\"\"><span>Americans should brace for a jump in gas prices at the pump after the U.S. and Israel launched military strikes against Iran, says GasBuddy.</span></p><p class=\"\"><span>There's little doubt that the military strikes launched this weekend by the U.S. and Israel on Iran, one of the world's largest crude producers, will lead to a spike in oil prices.</span></p><p class=\"\"><span>Even more certain is the impact the conflict will have on American drivers when they buy gasoline at the pump.</span></p><p class=\"\"><span>Without a doubt, the Iran attack looks to be the biggest pricing event for gasoline since the Russian invasion of Ukraine in 2022, said Patrick De Haan, head of petroleum analysis at GasBuddy.</span></p><p class=\"\"><span>It's also likely to rank among the five most impactful events in the last decade or so, he told MarketWatch. Other major events included the full-scale Russian invasion of Ukraine four years ago and the Organization of the Petroleum Exporting Countries' decision in 2014 to keep oil (CL.1) (BRN00) output steady despite worries about a global supply glut.</span></p><p class=\"\"><span>Disruptions also swept up U.S. crude and oil-product supply when Hurricane Harvey hit in 2017, while the Trump administration's previous \"maximum pressure\" campaign against Iran, including rounds of new sanctions, led to a rally in oil prices.</span></p><p class=\"\"><span>Amid this new conflict, said De Haan, there's still a \"very cloudy outlook\" in terms of what level of retaliation Iran might pursue - with, notably, the supreme leader's death now confirmed - and what that may mean for global supply and demand balances.</span></p><p class=\"\"><span>Read: Iran conflict raises talk of a return to $100-a-barrel oil</span></p><p class=\"\"><span>Americans will be very anxious about what the conflict could mean for oil prices, given how President Donald Trump made low oil prices his \"signature policy,\" De Haan said. This certainly has potential to \"offset lower energy prices for some time,\" De Haan said, and motorists are going to feel \"a bit more a pinch\" in prices, which typically happens in the springtime as demand and prices edge higher.</span></p><p class=\"\"><span>The average price for a gallon of regular gasoline stood at $2.957 early evening on Saturday, according to GasBuddy.</span></p><p class=\"\"><span>Prices were already seeing a \"slow, steady uptick\" with spring-break travel right around the corner, said De Haan, and as temperatures warm up, fuel demand increases from now though mid to late July.</span></p><p class=\"\"><span>The attacks on Iran will exacerbate that increase, he said, though it's not likely to be on the level of the \"superspike\" seen in the wake of Russia's invasion of Ukraine in 2022, when retail gas prices briefly topped $5 in June of that year.</span></p><p class=\"\"><span>The national average could climb between 25 cents and 50 cents a gallon between now and April or May to the mid-$3 range, said De Haan.</span></p><p class=\"\"><span>And if things go \"bad at every turn,\" he said, consumers could potentially see prices rising by even more than 50 cents a gallon.</span></p><p class=\"\"><span>-Myra P. Saefong</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260301000737:0/",
            "pub_date": "2026-03-01 21:29:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000586_20260301000587:0",
            "title": "Shenzhen Woer Heat-Shrinkable Material FY Net CNY1.13B, Up 34%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000586_20260301000587:0/",
            "pub_date": "2026-03-01 21:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:11539861a094b:0",
            "title": "Minnesota Launches First State Fraud Fund After Crypto Scams Target Senior Citizens",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Lawmakers are reviewing a bill to ban crypto kiosks statewide amid rising fraud cases.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>State data showed $540,000 in reported losses last year, with seniors hit the hardest.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Crypto companies say better regulation and enforcement would be more effective than banning the machines.</span></li></ul></span></div><span><p class=\"\"><span>Minnesota has set up the first state-run fraud restitution fund in the country to help people who have been victims of scams, while lawmakers are trying to ban crypto kiosks in the state.</span></p><p class=\"\"><span>According to a non-profit organization geared towards older Americans, the fund is meant to help people get back on their feet financially and stabilize their finances, even though it won't fully reimburse most victims. Minnesota has passed separate consumer protection laws to stop scams involving cryptocurrencies, in addition to the restitution fund. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Crypto ATM Ban</span></strong></p><p class=\"\"><span>The bill, HF3642, sponsored by Rep. Erin Koegel, co-chair of the House Commerce Finance and Policy Committee, aims to prohibit the virtual currency kiosks across the state. The state currently has about 350 licensed kiosks operated by eight to 10 companies, according to the Department of Commerce. The bill was introduced on Monday and discussed on Thursday to prevent the rising scams against the elderly of the state. </span></p><p class=\"\"><span>Police told lawmakers on Thursday that scammers tell victims to put cash into these machines. The money is turned into cryptocurrency and sent to accounts controlled by the scammers. Once sent, it is very hard to track or get back. They added that the scams were mostly hurting senior citizens. </span></p><p class=\"\"><span>Woodbury Detective Lynn Lawrence told the House that officers once found an older woman confused at a gas station crypto kiosk. She had already made “at least 10 Bitcoin transactions in six months.” Lawrence added that the woman “had been giving 50% of her income per month to the scammers” and was scared she might have to live in her car.</span></p><p class=\"\"><span>The Department of Commerce reported 70 complaints last year totaling $540,000 in losses. Refunds averaged only 16% of total losses. While the discussions are ongoing, the House Commerce Committee has not yet voted on the bill. On Thursday, lawmakers said they may add it to a larger commerce bill later in the session.</span></p><p class=\"\"><span>Blockchain security firm PeckShield Alert reported that 15 crypto-related hacks were recorded in February alone, totaling about $26.5 million, with funds moving quickly across wallets, making recovery difficult. The top five hacks pointed out were YieldBlox at $10 million, IoTeX Bridge at $8.8 million, CrossCurveFi at $3 million, FOOMCASH at $2.26 million, and Moonwell at $1.8 million. On Sunday, Georgia hosted an event to help users identify crypto scams. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Industry Calls For Regulation, Not Prohibition</span></strong></p><p class=\"\"><span>Crypto industry representatives, however, resisted the ban in Minnesota. For instance, CoinFlip general counsel Larry Lipka told lawmakers, “It is inappropriate to ban a legal product because fraud is happening. Not our fault.” He added that machines should not be illegal, since scammers are responsible for the crimes, not the kiosk operators. He said he supports stricter rules and better enforcement instead of a full statewide ban. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:11539861a094b:0/",
            "pub_date": "2026-03-01 21:30:09",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000581_20260301000581:0",
            "title": "CRRC Appoints Qu Xiaoli as CFO (chief Aacountant) of Company, With Term Commencing From the Date of Board's Approval",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000581_20260301000581:0/",
            "pub_date": "2026-03-01 21:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZP058:0",
            "title": "Libya's Mabruk oil field to increase production to up to 30,000 bpd",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Libya's Mabruk Oil Operations resumed production increases at al-Mabruk oilfield, with initial pumping rates expected to be between 25,000 and 30,000 barrels per day, the state-owned National Oil Corporation said on Sunday.</span></p><p class=\"\"><span>NOC said in a statement the production resumption at the field started on Saturday, \"following the successful commissioning of a new early production unit\".</span></p><p class=\"\"><span>Mabruk Oil Operations is one of the oil companies operating on behalf of NOC &amp; Total E&amp;P, according to the company's website.</span></p><p class=\"\"><span>NOC said that the technical teams had begun working to increase the company's total production - from the Al-Jurf and al-Mabruk fields - to approximately 40,000 bpd by the end of March.</span></p><p class=\"\"><span>Al-Jurf is an offshore field situated close to the Tunisian border, 100 km off the coast and 150 km from the capital Tripoli, while al-Mabruk is an onshore field located about 170 km to the south of Sirt city, the company's website explained.</span></p><p class=\"\"><span>In March 2025, the Tripoli-based Government of National Unity announced a production resumption at al-Mabruk field after a decade-long shutdown. Production resumed at around 5,000 bpd. </span></p><p class=\"\"><span>The field was closed in 2015 after what NOC described as an attack by Islamist militants that cost the company $575 million in field equipment losses.</span></p><p class=\"\"><span>Libya, holding Africa's largest proven oil reserves, has struggled to maintain consistent output levels due to internal conflicts and infrastructure damage since 2011.</span></p><p class=\"\"><span>\"This step reflects the success of the National Oil Corporation's vision to develop the sector's infrastructure and strengthen the national economy,\" the NOC said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZP058:0-libya-s-mabruk-oil-field-to-increase-production-to-up-to-30-000-bpd/",
            "pub_date": "2026-03-01 21:21:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000582_20260301000582:0",
            "title": "China Shengmu Organic Milk Guides for Wider Net Loss in FY",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000582_20260301000582:0/",
            "pub_date": "2026-03-01 21:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260301000582_20260301000583:0",
            "title": "China Shengmu Sees Loss Attributable to Owners of Group's Parent Company at CNY350M-CMY390M Vs Loss of CNY65.5M for 2024",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260301000582_20260301000583:0/",
            "pub_date": "2026-03-01 21:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03R:0",
            "title": "Equipment House Signs Contract With Ministry Of Human Resources",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>SCIENTIFIC AND MEDICAL EQUIPMENT HOUSE </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUIPMENT HOUSE- SIGNING OF A CONTRACT WITH MINISTRY OF HUMAN RESOURCES</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUIPMENT HOUSE - CONTRACT VALUE 261 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQUIPMENT HOUSE- CONTRACT FOR SUPPLY OF UNCOOKED FOOD PROVISIONS TO RESIDENTIAL CARE BRANCHES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03R:0-equipment-house-signs-contract-with-ministry-of-human-resources/",
            "pub_date": "2026-03-01 21:25:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO0C7:0",
            "title": "Amak Mining FY Net Profit 280.6 Million Riyals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>AL MASANE AL KOBRA MINING </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AMAK MINING FY NET PROFIT 280.6 MILLION RIYALS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>AMAK MINING FY SALES 1.03 BILLION RIYALS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO0C7:0-amak-mining-fy-net-profit-280-6-million-riyals/",
            "pub_date": "2026-03-01 21:25:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03P:0",
            "title": "Middle East Healthcare Updates On Board Resolution To Establish An Outpatient Clinics Complex In Riyadh City",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MIDDLE EAST HEALTHCARE </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MIDDLE EAST HEALTHCARE - UPDATES ON BOARD RESOLUTION TO ESTABLISH AN OUTPATIENT CLINICS COMPLEX IN RIYADH CITY</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MIDDLE EAST HEALTHCARE - COMPLEX HAS OBTAINED FINAL LICENSE FROM MINISTRY OF HEALTH TO COMMENCE MEDICAL OPERATIONS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03P:0-middle-east-healthcare-updates-on-board-resolution-to-establish-an-outpatient-clinics-complex-in-riyadh-city/",
            "pub_date": "2026-03-01 21:26:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZO03O:0",
            "title": "Mutakamela Insurance Obtains Approval Of Insurance Authority To Market And Sell A Product",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MUTAKAMELA INSURANCE </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MUTAKAMELA INSURANCE - OBTAINED APPROVAL OF INSURANCE AUTHORITY TO MARKET AND SELL A PRODUCT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZO03O:0-mutakamela-insurance-obtains-approval-of-insurance-authority-to-market-and-sell-a-product/",
            "pub_date": "2026-03-01 21:26:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:f4ec2a245094b:0",
            "title": "Nokia expands network portfolio for premium performance in the AI-RAN era #MWC26",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Press Release</span></p><p class=\"\"><span>Nokia expands network portfolio for premium performance in the AI-RAN era #MWC26 </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Nokia expands its industry-leading AirScale portfolio with Doksuri Radios, delivering advancements in energy efficiency, capacity, and deployment simplicity. </span></li><li class=\"listItem-bmN0_SHH\"><span>Doksuri RRHs enable telecommunications providers to build sustainable and AI-ready 5G networks.</span></li><li class=\"listItem-bmN0_SHH\"><span>Nokia launches new Marketplace for Service Management and Orchestration (SMO) </span></li><li class=\"listItem-bmN0_SHH\"><span>Nokia’s advanced connectivity is critical to the AI era, with increased demands on network infrastructure performance. </span></li></ul><p class=\"\"><span>Espoo, Finland – Nokia today announced a major evolution of its AirScale portfolio with the launch of Doksuri Remote Radio Heads (Radios), engineered to meet the performance, sustainability, and automation demands of the AI era. With groundbreaking advancements in energy efficiency, superior performance and simplified installation, Doksuri Radios are set to accelerate the global transition to greener and more powerful 5G networks – pushing the boundaries of advanced connectivity.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Doksuri:A</span><span> New Generation of AI-RAN Ready Radios</span></strong></p><p class=\"\"><span>The new Doksuri Radios represent a significant leap forward in performance, energy efficiency, and deployment simplicity. Built on a next-generation System-on-Chip (SoC), Doksuri Radios bring advanced intelligence into the radio, positioning it as a foundational component in Nokia’s AI-RAN strategy. Engineered for real-world performance, Doksuri Radios deliver:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Up to 30% improvement in power efficiency, combining higher output power with lower energy consumption under typical network conditions, reducing environmental footprint</span></li><li class=\"listItem-bmN0_SHH\"><span>Up to 25% lighter Radios, lowering site footprint and simplifying deployments</span></li><li class=\"listItem-bmN0_SHH\"><span>Unique mounting system, reducing installation time by up to 70%, enabling faster, more efficient deployments.</span></li></ul><p class=\"\"><span>“Artificial Intelligence can have a definite and concrete impact when applied to Radio Access Networks, and this kind of radio innovation allows the radio hardware to support future enhancements to capacity and reliability performance in the network,” commented Joe Madden, Founder &amp; Chief Analyst at Mobile Experts, Inc.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI-RAN Ready </span></strong></p><p class=\"\"><span>Doksuri Radios are powered by our latest generation ReefShark System on Chip (SoC) technology that unlocks advanced capabilities, efficiency and adaptability. This positions Doksuri Radios as a key enabler in the evolving AI-RAN ecosystem and ensures future-proof capabilities for telecommunications providers, including compatibility with Open RAN front-haul standards.</span></p><p class=\"\"><span>“As networks transition toward AI-native architecture, performance, intelligence and efficiency must be built into the foundation. Our next-generation radio portfolio brings advanced processing closer to the edge, enabling operators to meet rising AI-driven traffic demands while reducing energy consumption and total cost of ownership. By embedding AI-ready capabilities directly into the radio layer, we are helping telcos build sustainable, high-performance networks ready for the next wave of 5G and the evolution toward 6G,” said Pallavi Mahajan, Chief Technology and AI Officer at Nokia. </span></p><p class=\"\"><span>Additionally, at #MWC26, Nokia will demonstrate its comprehensive Radio portfolio, including several new Habrok Massive MIMO products for TDD and for FDD spectrum, each delivering the necessary performance for telecommunications operators to offer advanced connectivity in the AI era.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Marketplace for Service Management and Orchestration </span></strong><span> </span></p><p class=\"\"><span>Nokia has also launched an rApp Marketplace for its Service Management and Orchestration (SMO) platform, enabling communication service providers and ecosystem partners to more easily build, integrate, and deploy automation applications within an open, multivendor environment. It allows users to discover, evaluate and deploy rApps that enhance network automation, performance and efficiency. This marketplace reinforces Nokia’s commitment to accelerating AI-driven RAN automation, fostering deeper co-creation with customers and rApp partners, and simplifying how CSPs adopt and scale autonomous network capabilities. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Nokia at MWC26</span></strong></p><p class=\"\"><span>Visitors to Nokia’s booth 3B20 in Hall 3 at Mobile World Congress 2026 will experience multiple demonstrations of Nokia’s latest technologies and innovations, highlighting their role in enabling cognitive, software-defined radio systems. Nokia’s demonstrations also showcase how AI-RAN can optimize network operations, improve energy efficiency and support new AI-driven applications. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Multimedia, technical information, and related news</span></strong></p><p class=\"\"><span>Webpage: AI-RAN</span></p><p class=\"\"><span>Webpage: AirScale Macro Remote Radio Heads</span></p><p class=\"\"><span>Webpage: Nokia AirScale Baseband </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Nokia</span></strong></p><p class=\"\"><span>Nokia is a global leader in connectivity for the AI era. With expertise across fixed, mobile, and transport networks, we’re advancing connectivity to secure a brighter world.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media inquiries</span></strong></p><p class=\"\"><span>Nokia Press Office</span></p><p class=\"\"><span>Email: mailto:Press.Services@nokia.com\" rel=\"nofollow\" target=\"_blank\" title=\"Press.Services@nokia.com\"&gt;Press.Services@nokia.com </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Follow us on social media</span></strong></p><p class=\"\"><span>LinkedIn X Instagram Facebook YouTube</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:f4ec2a245094b:0-nokia-expands-network-portfolio-for-premium-performance-in-the-ai-ran-era-mwc26/",
            "pub_date": "2026-03-01 21:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:15f85d90a094b:0",
            "title": "Nokia and Ericsson strengthen cooperation to accelerate towards Autonomous Networks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Press Release</span></p><p class=\"\"><span>Nokia and Ericsson strengthen cooperation to accelerate towards Autonomous Networks </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Nokia and Ericsson to advance adoption of open standards, and promote compatibility across their rApp portfolios </span></li><li class=\"listItem-bmN0_SHH\"><span>The collaboration supports multivendor SMO ecosystems, giving CSP greater choice and accelerating the transition towards Autonomous Networks.</span></li><li class=\"listItem-bmN0_SHH\"><span>Ericsson will join Nokia’s SMO Marketplace, and Nokia will become a member of Ericsson’s rApp Ecosystem 1 March 2026</span></li></ul><p class=\"\"><span>Espoo, Finland &amp; Stockholm, Sweden – Nokia and Ericsson today announce a landmark collaboration aimed at significantly advancing intelligent automation across purpose-built, cloud RAN, and Open RAN networks.</span></p><p class=\"\"><span>Under the collaboration, Ericsson will become a member of Nokia’s SMO Marketplace, which is designed to empower Communication Service Providers (CSPs) and partners to build, integrate, and deploy automation applications within an open, multivendor ecosystem. Nokia will also be a member of the Ericsson rApp Ecosystem, the open, well-established ecosystem of CSPs, vendors and independent developers built around the Ericsson Intelligent Automation Platform, Ericsson’s network management and automation platform for open, multivendor and multi-technology networks.</span></p><p class=\"\"><span>The mutual ecosystem membership reflects Nokia and Ericsson’s shared focus on championing Autonomous Networks, with a particular focus on innovation centred around the R1 interface through which rApps interact with the SMO. Shared efforts such as this are essential for bringing AI and automation into mobile networks to transform deployment, optimization and operations workflows as CSPs globally seek to achieve and surpass Level 4 autonomy.</span></p><p class=\"\"><span>This collaboration between Nokia and Ericsson will enhance cross-industry development and will lead to more seamless adoption and integration of automation tools across diverse multivendor environments. Through the collaboration, both companies will make rApps available to CSPs on both platforms.</span></p><p class=\"\"><span>“The telecoms industry is converging on SMO as the long-term automation architecture, with major RAN and SMO contributors, and CSPs, working together to drive this transition through standards-based collaboration. Participation in each other’s rApp ecosystem reflects shared confidence from Ericsson and Nokia in the SMO architecture and a common commitment to advancing industry-wide interoperability through standardized R1 interfaces. The collaboration will expand access to, availability of, and interoperability between the growing number of rApps coming to market for CSPs,” commented Dimitris Mavrakis, Senior Research Director, ABI Research. </span></p><p class=\"\"><span>“This collaboration is a key step forward for the telecoms industry,” says Anders Vestergren, Head of Solution Area Network Management at Ericsson, “giving CSPs greater choice and flexibility as they execute their Autonomous Network transformation strategies. The agreement between Nokia and Ericsson shows genuine progress in the ongoing and already-productive effort to encourage innovation using the R1 interface, and cultivate diverse, engaged and dynamic rApp ecosystems working together to embed this essential area of telecoms technology in networks worldwide.”</span></p><p class=\"\"><span>“This partnership with Ericsson marks a pivotal advancement in how the industry delivers the next generation of autonomous networks,” said Ari Kynaslahti, CTO at Nokia. “By aligning on open frameworks and intelligent operational models, we are giving service providers a more adaptive and future-proof foundation for automation. This collaboration also accelerates the evolution of robust rApp environments that will enable operators to introduce new capabilities faster, optimize their networks with greater precision, and scale innovation across diverse deployment scenarios worldwide.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Multimedia, technical information, and related news</span></strong></p><p class=\"\"><span>Ericsson Intelligent Automation Platform Ecosystem</span></p><p class=\"\"><span>Nokia MantaRay SMO</span></p><p class=\"\"><span>Nokia SMO Marketplace</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT ERICSSON</span></strong><span>:</span></p><p class=\"\"><span>Ericsson’s high-performing, programmable networks provide connectivity for billions of people every day. For nearly 150 years, we’ve been pioneers in creating technology for communication. We offer mobile communication and connectivity solutions for service providers and enterprises. Together with our customers and partners, we make the digital world of tomorrow a reality. www.ericsson.com</span></p><p class=\"\"><span>Ericsson Newsroom</span></p><p class=\"\"><span>media.relations@ericsson.com (+46 10 719 69 92)</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>NOKIA</span></strong><span>:</span></p><p class=\"\"><span>Nokia is a global leader in connectivity for the AI era. With expertise across fixed, mobile, and transport networks we’re advancing connectivity to secure a brighter world.</span></p><p class=\"\"><span>Media inquiries</span></p><p class=\"\"><span>Nokia Press Office</span></p><p class=\"\"><span>Email: mailto:Press.Services@nokia.com\" rel=\"nofollow\" target=\"_blank\" title=\"Press.Services@nokia.com\"&gt;Press.Services@nokia.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:15f85d90a094b:0-nokia-and-ericsson-strengthen-cooperation-to-accelerate-towards-autonomous-networks/",
            "pub_date": "2026-03-01 21:00:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        }
    ]
}