{
    "data": [
        {
            "id": "tradingview:33370a0faf451:0",
            "title": "RPC INC SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>RPC Inc., a leading provider of specialized oilfield services and equipment to the oil and gas industry, has released its 2025 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in a highly competitive market. The following sections summarize the key highlights from the report.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenue</span></strong><span>: $1,626.6 million, an increase of 15.0% compared to 2024, primarily due to revenues from the recently acquired Pintail.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income</span></strong><span>: $44.7 million, a 54.1% decrease compared to the prior year, impacted by lower pricing and decreased activity in pressure pumping.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income</span></strong><span>: $32.1 million, or $0.15 earnings per share, compared to net income of $91.4 million, or $0.43 earnings per share in 2024.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income Margin</span></strong><span>: 2.0%, compared to 6.5% in 2024, reflecting the challenges in the pressure pumping market and increased competition.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><span>: $232.7 million, with an Adjusted EBITDA margin of 14.3%, compared to $233.0 million and 16.5% in 2024, indicating stable operational performance despite market challenges.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments</span></strong><span>: In 2025, Technical Services accounted for 94.4% of total revenues, with significant contributions from Pressure Pumping (29.8%), Downhole Tools (24.2%), and Wireline (19.4%). Support Services contributed 5.6% of total revenues, primarily from Rental Tools.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance</span></strong><span>: RPC provides services across major U.S. regions including Texas, the mid-continent, Gulf of America, Rocky Mountain, and Appalachian regions, with a concentration in the Permian basin for pressure pumping services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units</span></strong><span>: The company ended 2025 with 10 horizontal frac fleets, including 3 Tier 4 DGB and 3 Tier 4 Diesel fleets, reflecting a focus on maintaining a modern and efficient fleet.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches</span></strong><span>: RPC introduced new products such as a 3½ inch high-performance downhole motor and UnPlug, a proprietary alternative to traditional bridge plugs, enhancing its Downhole Tools service line.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: RPC anticipates ongoing consolidation in the OFS and E&amp;P sectors, a reduction in rig count volatility due to capital discipline, and a favorable long-term outlook for natural gas demand. The company plans to focus on strategic investments to increase scale and diversify its service lines.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Acquisition</span></strong><span>: RPC, Inc. completed the acquisition of Pintail Alternative Energy, L.L.C., enhancing its oilfield services platform with a focus on the Permian Basin. This acquisition is expected to build on RPC's diversified services and geographic concentration in a key oil-producing region.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Systems Transformation</span></strong><span>: The company is implementing a multi-year systems transformation program to upgrade its ERP and supply chain systems, which is part of its strategic initiative to improve operational efficiency.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: RPC, Inc. maintained a strong financial position with no outstanding borrowings under its $100 million revolving credit facility as of December 31, 2025. The company paid $35.1 million in dividends and repurchased $2.9 million of common stock in 2025. Additionally, RPC has a stock buyback program with 12,768,870 shares remaining available for repurchase. The company issued a secured note as part of the Pintail acquisition, with the first principal payment due in 2026.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: RPC plans to continue its capital expenditure strategy with expected spending between $150 million and $180 million in 2026, focusing on maintenance and growth opportunities. The company anticipates funding these expenditures primarily through operating cash flows and existing cash reserves. RPC also expects to continue paying dividends, subject to industry conditions and financial performance. The company is monitoring market conditions and customer preferences for efficient equipment, which may influence future strategic decisions.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Competition</span></strong><span>: RPC operates in a highly competitive oilfield services (OFS) industry, facing significant price competition due to an oversupply of capacity, particularly in pressure pumping.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Industry Cyclicality</span></strong><span>: The company is impacted by the cyclical nature of the oil and gas industry, which can lead to financial instability and potential bankruptcies among OFS companies.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Weather Conditions</span></strong><span>: Adverse weather conditions can disrupt services and impact financial results.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Volatility of Oil and Gas Prices</span></strong><span>: The volatility of oil and natural gas prices significantly affects demand for RPC's services. A prolonged low level of customer activity in the oil and gas industry could adversely impact the company's financial condition.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Customer Concentration</span></strong><span>: The reliance on a large customer for a significant portion of revenues poses a risk if this customer reduces or ceases operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Credit Risk</span></strong><span>: The concentration of customers in the energy industry increases exposure to credit risk, especially during economic downturns.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Spending</span></strong><span>: The company's success depends on capital spending by customers, many of whom rely on external financing, which could be constrained by elevated interest rates.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Key Personnel</span></strong><span>: The loss of key personnel could disrupt operations and affect revenues. The company faces challenges in attracting and retaining skilled workers, which could impact growth and profitability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Supply Chain Disruptions</span></strong><span>: Supply chain disruptions and limited suppliers for certain materials could increase costs and reduce service availability.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Compliance</span></strong><span>: Regulatory compliance, particularly regarding environmental laws and hydraulic fracturing, could increase operating costs and reduce demand for services.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Ownership Structure</span></strong><span>: The company's management and directors have substantial ownership, limiting public stockholders' influence and potentially impacting stock price volatility.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: RPC is exposed to market risks, including fluctuations in oil and natural gas prices, which directly impact customer activity levels and demand for services. The company also faces risks related to interest rate changes, which could affect borrowing costs and financial flexibility. Additionally, geopolitical uncertainties and potential regulatory changes could influence market conditions and operational strategies.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/742278/000110465926021480/res-20251231x10k.htm\" rel=\"nofollow\" target=\"_blank\">RPC INC [ RES ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:33370a0faf451:0-rpc-inc-sec-10-k-report/",
            "pub_date": "2026-02-28 04:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8567d08461d91:0",
            "title": "MARINE PRODUCTS CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Marine Products Corp, a leading manufacturer of fiberglass motorized boats under the Chaparral and Robalo brands, has released its 2025 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the current market environment.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Sales:</span></strong><span> $244.4 million, increased by 3.3% from 2024 due to a positive price/mix change of 9%, partially offset by a 6% decrease in unit sales volume.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross Profit:</span></strong><span> $46.8 million, up from $45.5 million in 2024, reflecting improved sales growth trends as field inventory positions improved.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income:</span></strong><span> $14.0 million, decreased from $18.3 million in 2024, primarily due to higher selling, general and administrative expenses.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $11.4 million, down from $17.9 million in 2024, impacted by lower revenues and higher R&amp;D investments.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Diluted Earnings Per Share:</span></strong><span> $0.32, decreased from $0.50 in 2024, reflecting the decline in net income.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Product Lines:</span></strong><span> Marine Products offers a diverse range of fiberglass motorized boats under the Chaparral and Robalo brands. Chaparral focuses on sport boats, while Robalo targets the sport fishing market. The product lines include SSi Sport Boats, SSX Sport Boats, GTS - SURF, OSX Sport Boats, Robalo Center Consoles, Cayman Bay Boats, and Dual Consoles.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Manufacturing Facilities:</span></strong><span> The company's manufacturing operations are centralized in Nashville, Georgia, which is considered the largest single-site sport boat production plant in the U.S. This facility handles design, testing, and assembly, emphasizing manual production processes due to the customization and craftsmanship required.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dealer Network:</span></strong><span> Marine Products distributes its boats through a network of 192 domestic and 84 international independent authorized dealers. The company supports its dealers with promotional efforts and sales incentive programs to stabilize manufacturing schedules and promote inventory replenishment.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units:</span></strong><span> In 2025, the company sold 2,354 boats, a decrease from 2,492 in 2024. The average gross selling price per boat increased to $93.6 thousand in 2025 from $85.7 thousand in 2024.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> International sales accounted for 4.5% of net sales in 2025, down from 5.6% in 2024. The company has a presence in key states like Florida, Texas, Michigan, North Carolina, and Minnesota.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Research and Development:</span></strong><span> Marine Products invested $1.5 million in R&amp;D in 2025, focusing on innovative product design and quality manufacturing processes. The company utilizes 3-D printing and virtual reality software to enhance product development.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company anticipates that the merger with MasterCraft will provide opportunities for growth and enhanced market presence. The merger is expected to be completed in 2026, subject to customary closing conditions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operational Challenges:</span></strong><span> The company faced challenges due to higher interest rates and increased costs of boat ownership, impacting consumer demand. Production levels have been adjusted to align with expected demand, and dealer inventories are being closely monitored.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Merger Agreement:</span></strong><span> Marine Products Corporation entered into a Merger Agreement with MasterCraft on February 5, 2026, which is expected to enhance the company's market position and provide stockholders with continued participation in the combined company's potential growth. The merger is structured to benefit from a stronger institutional following and is expected to incur substantial costs related to the transaction.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The company maintained a revolving credit facility with Truist Bank, providing a $20 million credit line, which is scheduled to mature on November 12, 2026. As of December 31, 2025, there were no outstanding borrowings under this facility. The company also declared a regular quarterly cash dividend of $0.14 per common share, payable on March 10, 2026. Additionally, the company has a stock buyback program authorized for the repurchase of up to 8,250,000 shares, with 1,570,428 shares remaining available for repurchase as of December 31, 2025. However, the Merger Agreement generally prohibits further repurchases during the period leading up to the merger completion.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company anticipates that the liquidity provided by existing cash, cash equivalents, and cash generated from operations will be sufficient to meet its requirements for at least the next twelve months. The Merger Agreement with MasterCraft imposes certain limitations on capital expenditures and indebtedness, which are expected to influence the company's capital management strategies until the merger is completed. If the merger is not completed during 2026, capital expenditures are expected to be between $1 million and $5 million. The company also expects to incur transaction-related costs associated with the merger, which will be funded by existing cash balances and operational cash flow.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> Marine Products faces significant challenges due to its reliance on a single operational location in Nashville, Georgia. This concentration of operations increases vulnerability to catastrophic events such as natural disasters, which could disrupt manufacturing and supply chains. Additionally, the company is heavily dependent on its network of independent boat dealers for sales, with no long-term agreements in place, posing a risk to sales stability.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> Economic conditions, including consumer confidence and credit availability, significantly impact Marine Products' sales, as boats are discretionary purchases. The company is also exposed to risks from interest rate fluctuations and fuel prices, which affect both dealer financing and consumer purchasing decisions. The reliance on third-party suppliers for raw materials and engines presents a risk of supply chain disruptions and cost increases. Furthermore, the company faces intense competition in the fragmented recreational boat industry, which could impact market share and profitability.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Compliance with environmental and safety regulations could lead to increased costs or fines if not adhered to. The potential for new tariffs on imported materials could also increase production costs. Additionally, the company is under pressure to meet evolving ESG expectations, which could affect stakeholder relationships and brand reputation.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Risks:</span></strong><span> The company has experienced a decrease in net income and operating income due to higher costs and lower sales volumes. Management is focusing on aligning production with demand and reducing costs. The recent merger agreement with MasterCraft introduces risks related to integration and realization of anticipated synergies. The fixed exchange ratio in the merger agreement means that stockholders face uncertainty regarding the market value of the stock consideration they will receive.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate Risks:</span></strong><span> The company is dealing with the impact of high interest rates, which have increased the cost of boat ownership and affected consumer demand. Management is monitoring dealer inventories and adjusting production levels to align with market conditions. The potential failure to complete the merger could result in significant financial and operational disruptions.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> Marine Products is exposed to market risks related to interest rate fluctuations, which affect both dealer financing costs and consumer purchasing power. The company also faces risks from potential changes in foreign currency exchange rates, as a portion of its sales are international. These market risks could adversely impact financial results and require strategic adjustments to mitigate their effects.</span></p><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1129155/000110465926021478/mpx-20251231x10k.htm\" rel=\"nofollow\" target=\"_blank\">MARINE PRODUCTS CORP [ MPX ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:8567d08461d91:0-marine-products-corp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:adee6741302db:0",
            "title": "Chubb Ltd SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Chubb Ltd, a global insurance and reinsurance organization, has released its 2025 Form 10-K report, showcasing robust financial performance and strategic growth initiatives. The company operates in 54 countries and territories, offering a wide range of insurance products, including commercial and consumer property and casualty (P&amp;C) insurance, accident and health (A&amp;H), reinsurance, and life insurance. The report highlights significant increases in revenue and net income, strategic acquisitions, and a focus on digital transformation and climate risk management.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenues</span></strong><span>: $59,402 million, reflecting a 6.5% increase from 2024 driven by growth in net premiums written and net investment income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income</span></strong><span>: $10,622 million, a 10.0% increase from 2024, attributed to double-digit growth in P&amp;C underwriting income and Life segment income.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income Attributable to Chubb</span></strong><span>: $10,310 million, up 11.2% from 2024, driven by strong performance across segments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Investment Income</span></strong><span>: $6,465 million, a 9.0% increase from 2024, primarily due to higher average invested assets from strong operating cash flow.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Realized Gains (Losses)</span></strong><span>: $211 million, a significant improvement from $117 million in 2024, reflecting better market conditions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Losses and Loss Expenses</span></strong><span>: $26,700 million, a 2.7% increase from 2024, indicating a moderate rise in claims and loss expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Policy Benefits</span></strong><span>: $5,460 million, a 15.8% increase from 2024, primarily due to growth in international life operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Policy Acquisition Costs</span></strong><span>: $9,847 million, an 8.2% increase from 2024, reflecting higher business volumes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Administrative Expenses</span></strong><span>: $4,504 million, a 2.8% increase from 2024, indicating effective cost management.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Expense</span></strong><span>: $764 million, a 3.1% increase from 2024, reflecting changes in debt levels and interest rates.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Cash Flow</span></strong><span>: $12.8 billion, highlighting strong cash generation capabilities.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Global Operations</span></strong><span>: Chubb operates in 54 countries and territories, providing a wide range of insurance products. This extensive global presence supports a diverse client base and enhances the company's competitive advantage.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Segment Revenue Breakdown</span></strong><span>: Chubb's operations are divided into six business segments: North America Commercial P&amp;C Insurance (38% of 2025 Consolidated NPE), North America Personal P&amp;C Insurance (13%), North America Agricultural Insurance (5%), Overseas General Insurance (27%), Global Reinsurance (3%), and Life Insurance (14%).</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>North America Commercial P&amp;C Insurance</span></strong><span>: This segment serves large, middle market, and small commercial businesses in the U.S., Canada, and Bermuda, offering a broad range of P&amp;C, financial lines, and A&amp;H products.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>North America Personal P&amp;C Insurance</span></strong><span>: Focused on high-net-worth individuals and families, this segment provides comprehensive personal insurance products such as homeowners, high-value automobile, and personal liability insurance.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Overseas General Insurance</span></strong><span>: This segment includes Chubb International and Chubb Global Markets, offering a range of commercial P&amp;C and consumer lines products across Europe, Middle East, Africa, Asia, and Latin America. The acquisition of LMG Insurance in Thailand expanded operations in 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Life Insurance Operations</span></strong><span>: Chubb Life operates primarily in Asia, offering a broad portfolio of protection and savings products. The segment focuses on maximizing opportunities in Asia, with significant operations in South Korea, mainland China, Hong Kong, and Taiwan.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Acquisitions</span></strong><span>: In 2025, Chubb expanded its operations through the acquisition of LMG Insurance in Thailand and increased its ownership interest in Huatai Group to approximately 87.2%.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Digital Transformation</span></strong><span>: Chubb is enhancing its digital capabilities across various segments, including the establishment of the North America Small &amp; Lower Midmarket Division, which leverages a modern, automated, and data-centric digital operating model.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Climate and Risk Management</span></strong><span>: Chubb recognizes the impact of climate change and incorporates it into its underwriting process, using catastrophe models to quantify natural catastrophe risk and adjust its risk management strategies accordingly.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Human Capital Management</span></strong><span>: Chubb employs approximately 45,000 people globally, with a focus on attracting, developing, and retaining top talent. In 2025, the company filled approximately 9,000 roles worldwide and continued to invest in employee development and well-being programs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: Chubb's long-term business strategy focuses on sustained growth in book value through a combination of underwriting and investment income. The company aims to provide value to clients and shareholders by leveraging its substantial capital base in the insurance and reinsurance markets.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong><span>: The company has focused on enhancing its financial flexibility and supporting growth through strategic capital allocation. This includes investments in technology and data analytics to improve operational efficiency and customer engagement. Additionally, the company has pursued strategic acquisitions to expand its market presence and product offerings, particularly in international markets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: The company has actively managed its capital structure by repurchasing shares and increasing dividends. In 2025, the company repurchased $500 million of its own shares, reflecting confidence in its long-term growth prospects. The quarterly dividend was increased by 10%, demonstrating a commitment to returning value to shareholders. The company also maintained a strong balance sheet with a focus on maintaining investment-grade credit ratings, supported by prudent debt management and liquidity enhancement measures.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: Looking ahead, the company plans to continue its disciplined approach to capital management, prioritizing investments that drive sustainable growth and shareholder value. This includes further share repurchases and potential dividend increases, contingent on market conditions and business performance. The company also aims to explore strategic partnerships and acquisitions that align with its growth strategy, particularly in emerging markets and digital innovation.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Climate Change and Weather Patterns</span></strong><span>: Chubb faces challenges related to climate change and weather patterns, which are integral to its underwriting process. The company continually adjusts its process to address these changes, ensuring exposures are priced appropriately and losses are contained within its risk tolerance.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Acquisition Strategy</span></strong><span>: Chubb's acquisition strategy, including the recent acquisition of Cigna's business in Asian markets and a controlling interest in Huatai Insurance Group, presents integration risks and the challenge of maintaining profitability across diverse markets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Natural and Man-Made Disasters</span></strong><span>: Chubb is exposed to significant risks from natural and man-made disasters, including climate change, which may increase the frequency and severity of catastrophes. The unpredictability of such events could lead to substantial volatility in financial results.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Cyber Risk</span></strong><span>: The company faces increasing cyber risk due to greater digital dependence, with potential losses from catastrophic cyber events.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory and Legal Risks</span></strong><span>: Legal, regulatory, and social responses to global climate change could impact Chubb's business. Additionally, the company may face challenges in accurately assessing loss reserves, which could affect financial results if actual claims exceed estimates.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Reinsurance Risks</span></strong><span>: Chubb's reliance on reinsurance presents risks, including the potential inability to purchase adequate reinsurance or the risk of non-payment by reinsurers.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: The company's financial results are sensitive to market risks, including interest rate volatility, which could impact investment performance and capital resources.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tax and Regulatory Changes</span></strong><span>: Regulatory changes, such as the new Bermuda Corporate Income Tax Act and OECD's global minimum tax regime, could increase Chubb's tax liabilities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Privacy and Data Security</span></strong><span>: The company's operations are subject to complex and evolving privacy, data security, and AI regulations, which could increase compliance costs and risks of noncompliance.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies</span></strong><span>: Management has identified the need to adapt to regulatory changes and geopolitical developments as a significant challenge. The company is focused on maintaining underwriting discipline and leveraging its global network to manage risks effectively.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risk Exposure</span></strong><span>: Chubb is exposed to market risks, including fluctuations in interest rates and foreign currency exchange rates, which could adversely affect investment income and financial results. The company's investment portfolio, while primarily high-quality, includes a portion of below investment-grade securities, which carry higher credit or default risk.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/896159/000089615926000005/cb-20251231.htm\" rel=\"nofollow\" target=\"_blank\">Chubb Ltd [ CB ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:adee6741302db:0-chubb-ltd-sec-10-k-report/",
            "pub_date": "2026-02-28 04:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947723:0",
            "title": "Utenos Trikotazas: Revenue up 28.7% and EBITDA positive, but high debt and restructuring persist",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue grew 28.7% year-over-year with a return to positive EBITDA and a narrowed net loss. Major restructuring included the sale of the Ukrainian subsidiary and deconsolidation of AB Šatrija after insolvency. Debt remains high, but operational performance improved.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947723-5cc84c4d2f3bddb3ed19401316b885ad\" target=\"_blank\">Utenos Trikotazas AB [UTR1L] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947723:0-utenos-trikotazas-revenue-up-28-7-and-ebitda-positive-but-high-debt-and-restructuring-persist/",
            "pub_date": "2026-02-28 04:15:21",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:1fc957f67094b:0",
            "title": "Alchemy introduces autonomous payment rails for AI agents on Base",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Blockchain infrastructure company Alchemy has launched a system that allows autonomous AI agents to buy compute credits and access its blockchain data services using onchain wallets and USDC on Base.</span></p><p class=\"\"><span>According to the company’s announcement, the initial release allows AI agents to directly query blockchain networks, check nonfungible token (NFT) ownership, view wallet balances across multiple chains and access live token price data, with additional networks and services planned.</span></p><p class=\"\"><span>If an agent exhausts its prepaid compute credits, Alchemy issues a payment request that can be automatically settled in USDC (USDC) on Base, allowing the agent to continue operating without human intervention.</span></p><p class=\"\"><span>The company said agents can fund accounts with as little as $1 in USDC, and once credited, continue making API calls until the balance is depleted and another automated payment is required.</span></p><p class=\"\"><span>The system uses Coinbase’s x402 payment standard to convert an HTTP “402 Payment Required” response into an automatic billing trigger. The x402 is an open standard that allows web services to request onchain payments directly through HTTP responses, enabling machine-to-machine transactions without manual invoicing.</span></p><p class=\"\"><span>Nikil Viswanathan, CEO of Alchemy, told Cointelegraph that the system is aimed at developers building autonomous decentralized finance (DeFi) agents, portfolio management bots and other multi-step onchain workflows. </span></p><p class=\"\"><span>He said that several major crypto applications, including Robinhood Crypto, Uniswap, OpenSea, Aave and 0x, already rely on Alchemy to power transactions, adding:</span></p><div class=\"blockquote-xrkxvh37\"><span>Now AI agents can access that same infrastructure autonomously, without a human ever touching it. This is the moment the agentic economy gets its own set of keys.</span></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Crypto companies and developers accelerate agent adoption</span></strong></p><p class=\"\"><span>AI agents, software systems that can make decisions and execute tasks autonomously based on predefined goals and real-time data, have drawn growing attention over the past year. Nearly a quarter (23%) of organizations surveyed by McKinsey in November said they were expanding their use of agent-based systems.</span></p><p class=\"\"><span>On Feb. 6, AI platform AI.com, founded by Crypto.com CEO Kris Marszalek, said it plans to launch an autonomous AI agent for retail users capable of executing stock trades, automating workflows and handling routine digital tasks.</span></p><p class=\"\"><span>A few days later, Coinbase introduced “Agentic Wallets,” crypto wallet infrastructure designed to let AI agents autonomously spend, earn and trade digital assets, including executing onchain transactions such as managing DeFi positions, rebalancing portfolios and paying for services.</span></p><p class=\"\"><span>Meanwhile, Monad’s developer community announced the results of its Moltiverse Hackathon this week, naming 16 winners across a range of “agent + token” projects.</span></p><p class=\"\"><span>The winners included a programmable venture capital agent that evaluates and invests automatically, AI-driven multiplayer battle arenas, an AI dating network where agents “represent their humans,” and trading card games governed by software rather than human players. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:663.9019792648445px;aspect-ratio:1.1065032987747407\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:1fc957f67094b-d54ef3c8ce8f95f4237a61507b08a15b-resized.webp\" type=\"image/webp\"/><img alt=\"Coinbase, AI, Crypto.com, Monad\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:1fc957f67094b-d54ef3c8ce8f95f4237a61507b08a15b-resized.webp\" style=\"background-color:#8c9198\"/></picture></div></button></figure></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:1fc957f67094b:0-alchemy-introduces-autonomous-payment-rails-for-ai-agents-on-base/",
            "pub_date": "2026-02-28 04:15:31",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009504:0",
            "title": "Wheat Futures Higher as Short Covering Keeps Going — Daily Grain Highlights",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Kirk Maltais</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Wheat for May delivery rose 3% to $5.91 1/2 a bushel on the Chicago Board of Trade on Friday, with a continued push in short-covering coming as some analysts eye weather conditions globally, while futures also took cues from a risk-off macro environment.</span></li><li class=\"listItem-bmN0_SHH\"><span>Corn for May delivery rose 1.1% to $4.48 1/4 a bushel.</span></li><li class=\"listItem-bmN0_SHH\"><span>Soybeans for May delivery rose 0.6% to $11.70 a bushel.</span></li></ul><p class=\"\"><span>HIGHLIGHTS</span></p><p class=\"\"><span>Catching Fire: There are multiple reasons why traders continue to cover their short positions in wheat, Commerzbank said in a note. Part of it has to do with droughts and wildfires in the U.S. Midwest, as well as a deterioration in crop health in France. An attack by Russia on Ukrainian infrastructure in the port city of Odesa, and tensions between the U.S. and Iran that has traders across markets adjusting their positions.</span></p><p class=\"\"><span>Taking Cues: Corn futures rose to the highest their level this year. The grain received support from higher crude oil futures as U.S.-Iran tensions remain unresolved heading into the weekend. \"The two sides will resume more technical discussions next week in Vienna,\" StoneX's said Arlan Suderman in a note. \"A bulked-up U.S. military presence in the Middle East remains.\" Corn's price is tied to oil due to ethanol, which is a major consumer of commodity that is an ingredient blended into American motor fuel.</span></p><p class=\"\"><span>INSIGHT</span></p><p class=\"\"><span>Overseas Interest: The USDA reported a flash sale of U.S. corn exports for the second consecutive day, this time in a notice that said 257,000 metric tons were headed to \"unknown destinations\" for delivery in the 2025/26 marketing year. That phrase when included in USDA statements is often--but not always--used in connection with China. Grain traders continue to look for confirmation of China buying more U.S. soybeans.</span></p><p class=\"\"><span>Sticking Around: The latest U.S. inflation gauge showed price increases are likely to remain above the Federal Reserve's 2% target for a while. January's producer price index unexpectedly accelerated, and other indicators are expected to show inflation remains stubborn. \"The data out this morning actually points to inflation being a nagging frustration for the U.S. economy,\" Comerica's Bill Adams said. The Fed is expected to remain cautious when considering rate cuts in the coming months. Attitudes around inflation and rate cuts tend to affect how commodities trade.</span></p><p class=\"\"><span>AHEAD</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>The USDA will release its weekly Grain Export Inspections report at 11 a.m. ET Monday.</span></li><li class=\"listItem-bmN0_SHH\"><span>The USDA will release its monthly Grain Crushings report at 3 p.m. ET Monday.</span></li><li class=\"listItem-bmN0_SHH\"><span>The EIA will release its Weekly Petroleum Status Update report at 10:30 a.m. ET Wednesday.</span></li></ul><p class=\"\"><span>Paulo Trevisani contributed to this article</span></p><p class=\"\"><span>Write to Kirk Maltais at kirk.maltais@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009504:0/",
            "pub_date": "2026-02-28 04:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2947724:0",
            "title": "BTAI: BXCL501 offers a rapid, safe oral solution for acute agitation in Alzheimer's dementia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Acute agitation in Alzheimer's dementia remains a major unmet need, with BXCL501 showing promise as a rapid, well-tolerated oral film that could fill this gap. Its ease of use, safety profile, and potential to reduce emergency interventions may improve patient and caregiver outcomes.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2947724:0-btai-bxcl501-offers-a-rapid-safe-oral-solution-for-acute-agitation-in-alzheimer-s-dementia/",
            "pub_date": "2026-02-28 04:16:28",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN29U:0",
            "title": "Netflix Says Paramount Skydance Paid $2.8 Bln Termination Fee To Co After WBD Deal Termination",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Netflix Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NETFLIX INC - WBD TERMINATES MERGER AGREEMENT WITH NETFLIX - SEC FILING</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NETFLIX INC - PSKY PAYS $2.8 BILLION TERMINATION FEE TO NETFLIX - SEC FILING</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NETFLIX INC - DEBT COMMITMENTS AUTOMATICALLY TERMINATED - SEC FILING</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN29U:0-netflix-says-paramount-skydance-paid-2-8-bln-termination-fee-to-co-after-wbd-deal-termination/",
            "pub_date": "2026-02-28 04:16:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009511_20260227009511:0",
            "title": "Wealth Management System Expects to Sell 3.75M Shrs in IPO and Expects Hldrs to Sell 1.25M, Sees Price of $4 to $5 Each",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009511_20260227009511:0/",
            "pub_date": "2026-02-28 04:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Obi15Dyba:0",
            "title": "NES Fircroft Bondco AS FY25 Annual Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NES Fircroft Bondco AS announce the audited annual results for FY25. Pleaserefer to the Investor Relations section of our website for further details:https://www.nesfircroft.com/investor-relations/</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/667183</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Obi15Dyba:0-nes-fircroft-bondco-as-fy25-annual-results/",
            "pub_date": "2026-02-28 04:18:26",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009515:0",
            "title": "Applied Optoelectronics Is Maintained at Buy by Rosenblatt",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009515:0/",
            "pub_date": "2026-02-28 04:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1YM:0",
            "title": "RBC high-yield desk sees attrition after First Brands losses - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>-- Source link: https://tinyurl.com/272rnkzz</span></p><p class=\"\"><span>-- Note: Reuters has not verified this story and does not vouch for its accuracy</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1YM:0-rbc-high-yield-desk-sees-attrition-after-first-brands-losses-bloomberg-news/",
            "pub_date": "2026-02-28 04:20:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN14B:0",
            "title": "Brazil's Rosito to leave Finance Ministry for World Bank post in Asia, sources say ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Marcela Ayres</span></p><p class=\"\"><span> </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/brazil/\" rel=\"nofollow\" target=\"_blank\">Brazil's</a><span> secretary for International Affairs at the Finance Ministry, Tatiana Rosito, will step down to take up a World Bank director position in Asia, three sources with knowledge of the matter told Reuters.</span></p><p class=\"\"><span>Mathias Alencastro, a special adviser to Finance Minister Fernando Haddad focused on international affairs, will assume the role vacated by Rosito, the same sources said.</span></p><p class=\"\"><span>The Finance Ministry did not immediately respond to a request for comment.</span></p><p class=\"\"><span>    The changes are expected to be formalized next week, the sources said.  </span></p><p class=\"\"><span>     Rosito led the ministry's unit during Brazil's presidency of the Group of 20 major economies in 2024 and Brazil's chairmanship of the BRICS emerging economies group in 2025.  </span></p><p class=\"\"><span>     She also played an active role in Brazil's work as host of last year's     </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/united-nations/\" rel=\"nofollow\" target=\"_blank\">United Nations</a><span>     COP30 climate summit, helping engage finance ministers on financial mechanisms to support the climate agenda.  </span></p><p class=\"\"><span>     Working closely with her, Alencastro was heavily involved in Brazil's proposal for the Tropical Forests Forever Facility, seen as the country's main deliverable at the COP.  </span></p><p class=\"\"><span>     Brazil     aims     to mobilize $10 billion in public resources for the initiative before handing over the COP presidency to Turkey in November.  </span></p><p class=\"\"><span>     The personnel changes come as Haddad has himself     acknowledged     that he expects to leave office soon, amid widespread expectations that his executive secretary, Dario Durigan, will take over.  </span></p><p class=\"\"><span>     Another recent senior-level change at the ministry was the     departure     of economic reform secretary Marcos Pinto, who was replaced by Regis Dudena in January.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN14B:0-brazil-s-rosito-to-leave-finance-ministry-for-world-bank-post-in-asia-sources-say/",
            "pub_date": "2026-02-28 04:20:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:3c4f334593a0f:0",
            "title": "Navitas Semiconductor Corp SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Navitas Semiconductor Corp, a leading provider of next-generation power semiconductors, has released its annual 10-K report, detailing significant financial and operational highlights for the fiscal year. The report underscores the company's strategic pivot towards high-power markets, including AI data centers, energy and grid infrastructure, performance computing, and industrial electrification, while also addressing the challenges and risks associated with this transition.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Revenues</span></strong><span>: $45.9 million, a decrease of 45% from the previous year, primarily due to a decline in the mobile and consumer markets in China.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Cost of Revenues</span></strong><span>: $31.7 million, decreased by 42% compared to the previous year, driven by lower sales volume and the absence of a $5.0 million inventory reserve recorded in the prior year.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Loss from Operations</span></strong><span>: $(107.8) million, improved by 18% from the previous year, reflecting cost reductions in research and development and selling, general and administrative expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Loss</span></strong><span>: $(117.0) million, increased by 38% from the previous year, impacted by a $12.4 million loss from the change in fair value of earnout liabilities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Basic Net Loss Per Share Attributable to Common Stockholders</span></strong><span>: $(0.57), compared to $(0.46) in the previous year, reflecting the increased net loss.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments</span></strong><span>: Navitas Semiconductor focuses on high-power markets, including AI data centers, energy and grid infrastructure, performance computing, and industrial electrification. The company has de-emphasized mobile and consumer products, reflecting a strategic pivot towards these high-margin markets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance</span></strong><span>: In 2025, revenue distribution shifted significantly, with the United States accounting for 28% of revenue, up from 16% in 2024. Conversely, revenue from China decreased from 60% to 47%, indicating a strategic realignment and focus on other regions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units</span></strong><span>: As of December 31, 2025, Navitas shipped over 300 million GaN devices and nearly 30 million SiC devices, demonstrating the company's capability to produce and deliver high volumes of next-generation power semiconductors.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches</span></strong><span>: Navitas has developed a broad line of GaN power devices and ICs, offering optimal choices for high-power-density chargers and AI data centers, reflecting the company's commitment to innovation in high-power applications.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: The company anticipates a multi-year growth trend in high-power markets as GaN and SiC technologies replace existing silicon devices. The AI data center revolution is expected to be a primary catalyst for this growth, alongside grid modernization and industrial electrification.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Strategy</span></strong><span>: Navitas operates a fabless business model, outsourcing wafer fabrication and other functions to third-party partners, allowing for faster scaling and lower capital expenses. This model supports the company's focus on high-power markets and strategic partnerships.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Competitive Advantages</span></strong><span>: Navitas is uniquely positioned as a pure-play next-generation high-power semiconductor company, offering both GaN and high-voltage SiC products. This dual capability allows the company to address a full range of high-power use cases, providing a competitive edge in emerging markets.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Navitas 2.0 Restructuring Plan</span></strong><span>: Navitas Semiconductor Corporation undertook the Navitas 2.0 Restructuring Plan to reposition itself as a focused high-power semiconductor company. This strategic transformation involved shifting away from consumer-oriented segments towards long-term programs in AI data centers, energy and grid infrastructure, performance computing, and industrial electrification. The plan included distributor rationalization, resource realignment, technology roadmap acceleration, and go-to-market restructuring. These actions are aimed at improving business predictability, expanding gross margin, and supporting a scalable and sustainable operating model.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: Navitas executed a private placement of approximately 14.8 million shares of Class A common stock at $6.75 per share, resulting in gross proceeds of approximately $100 million. Additionally, the company completed two 'At the Market' (ATM) offerings, raising approximately $100 million in total. These capital management activities were aimed at bolstering working capital and supporting strategic initiatives in high-power markets. The company also reported a significant increase in cash and cash equivalents, driven by these equity financing activities, which increased from $86.7 million at the end of 2024 to $236.9 million at the end of 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: Navitas plans to continue focusing on high-power markets, leveraging its expertise in GaN and SiC technologies. The company expects to maintain a disciplined operating model centered on market focus, technology leadership, operational efficiency, and financial discipline. It anticipates that its current levels of cash and cash equivalents will be sufficient to finance operations, working capital requirements, and capital expenditures for the foreseeable future. The company also expects to continue incurring net operating losses and negative cash flows from operations in the near term, with research and development expenses, general and administrative expenses, and capital expenditures remaining relatively flat.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Shift Risks</span></strong><span>: The company faces significant challenges due to its strategic shift towards AI data centers, energy and grid infrastructure, performance computing, and industrial electrification. This transition involves operational, technical, and market risks, including the need to develop semiconductor solutions that meet demanding power and efficiency requirements, compete against established incumbents, and secure design wins in new market segments. The shift may also require additional capital, which may not be available on favorable terms.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Supply Chain Risks</span></strong><span>: The company is exposed to supply chain risks, particularly due to its reliance on single sources for certain manufacturing services and materials. The announcement by TSMC to cease GaN production by 2027 poses a significant risk, despite mitigation efforts such as partnerships with Powerchip and GlobalFoundries. Any delays or disruptions in transitioning to new suppliers could negatively impact the company's ability to fulfill customer orders.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geopolitical and Regulatory Risks</span></strong><span>: Geopolitical and regulatory risks are heightened due to the company's international operations, particularly in Asia. New U.S. government regulations restricting outbound investments in China could impact the company's strategic investments and partnerships, potentially affecting growth and competitive positioning.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Financial Risks</span></strong><span>: Financial risks include the unpredictability of working capital needs and the potential requirement for additional capital to support business growth. The company also faces challenges in maintaining effective internal controls, which could impact investor confidence and stock price.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Cybersecurity Risks</span></strong><span>: Cybersecurity risks are significant, with the company subject to sophisticated cyber attacks that could result in the theft or unauthorized disclosure of intellectual property and customer data. The company has experienced attempted cyber attacks, highlighting the need for ongoing enhancements to cybersecurity measures.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Tax Risks</span></strong><span>: Tax risks are present due to potential changes in domestic and international tax laws, which could adversely affect the company's financial condition. The company's status as an inverted domestic corporation under the Homeland Security Act may limit its ability to enter into U.S. government contracts, potentially decreasing the value of its business.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: The company is exposed to market risks, including foreign currency exchange rate fluctuations, which may adversely affect financial results. The semiconductor sector's cyclical volatility, especially in new and emerging markets, adds to the unpredictability of future revenues and profits.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1821769/000182176926000007/nvts-20251231.htm\" rel=\"nofollow\" target=\"_blank\">Navitas Semiconductor Corp [ NVTS ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:3c4f334593a0f:0-navitas-semiconductor-corp-sec-10-k-report/",
            "pub_date": "2026-02-28 04:05:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:ca9b803d466cf:0",
            "title": "DANA Inc SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>DANA Inc, a global leader in drivetrain and e-Propulsion systems, has released its 2025 Form 10-K report, detailing significant financial improvements, strategic initiatives, and operational highlights. The report underscores the company's focus on core on-highway markets and its commitment to technological innovation and operational efficiency.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Sales:</span></strong><span> $7,500 million, reflecting a decrease of $234 million from 2024 due to lower production volumes in North America and South America, partially offset by pricing actions and recoveries.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross Margin:</span></strong><span> $602 million, representing 8.0% of net sales, an increase of 310 basis points from 2024, driven by cost reduction initiatives and operational efficiencies.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Earnings (loss) from continuing operations before interest and income taxes:</span></strong><span> $139 million, a significant improvement from a loss of $176 million in 2024, due to cost reduction initiatives and improved operational performance.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income (Loss) from Continuing Operations:</span></strong><span> $(53) million, an improvement from a loss of $342 million in 2024, reflecting better operational performance and cost management.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income from Discontinued Operations:</span></strong><span> $155 million, primarily due to the divestiture of the Off-Highway business.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income (Loss):</span></strong><span> $102 million, compared to a loss of $49 million in 2024, driven by gains from discontinued operations.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net Income (Loss) Attributable to the Parent Company:</span></strong><span> $85 million, compared to a loss of $57 million in 2024.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Basic Earnings (Loss) Per Share:</span></strong><span> $0.64, compared to $(0.39) in 2024, reflecting improved net income.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Diluted Earnings (Loss) Per Share:</span></strong><span> $0.64, compared to $(0.39) in 2024, indicating improved profitability.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments:</span></strong><span> Dana Incorporated operates through two main segments: Light Vehicle Drive Systems and Commercial Vehicle Drive and Motion Systems. In 2025, the Light Vehicle segment accounted for 70% of sales, while the Commercial Vehicle segment contributed 30%.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> In 2025, 60% of Dana's sales were generated from North American operations, with the remaining 40% coming from international markets. Sales in Europe and Asia Pacific were impacted by lower electric vehicle product orders, while South America saw a decrease in medium/heavy-duty production volumes.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units:</span></strong><span> The Light Vehicle segment experienced a 1% decrease in sales volumes in 2025 due to lower production volumes in North America and reduced electric vehicle product orders in Europe and Asia Pacific. The Commercial Vehicle segment saw an 8% decrease in sales volumes, reflecting weaker global markets.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches:</span></strong><span> Dana continues to focus on technological innovation, with ongoing research and development efforts aimed at enhancing efficiency, performance, and safety in both internal combustion and electric vehicle technologies.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> For 2026, Dana anticipates sales between $7,300 and $7,700 million, with adjusted EBITDA expected to range from $750 to $850 million. The company plans to realize $200 million of its sales backlog in 2026, with further incremental sales expected in subsequent years.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operational Efficiency:</span></strong><span> Dana has implemented cost reduction initiatives expected to deliver annualized savings of $325 million through 2026, with $260 million realized by the end of 2025. These initiatives include reducing selling, general, and administrative costs and aligning engineering expenses with industry dynamics.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Customer Dependence:</span></strong><span> Dana's largest customers include Ford Motor Company and Stellantis N.V., which together accounted for a significant portion of sales. The company emphasizes the importance of maintaining these relationships while expanding its customer base.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Engineering and R&amp;D:</span></strong><span> Dana invested $105 million in research and development in 2025, focusing on advancements in powertrain systems, vehicle dynamics, and thermal management. The company is also leveraging AI and machine learning to enhance product development and performance.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Human Capital:</span></strong><span> As of December 31, 2025, Dana employed approximately 26,900 people globally, with a focus on safety, inclusion, and integrity. The company is committed to providing competitive compensation and benefits to attract and retain talent.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Environmental Compliance:</span></strong><span> Dana's capital expenditures include investments to ensure compliance with environmental laws and regulations, which have not materially impacted earnings or competitive position.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives:</span></strong><span> Dana Incorporated has embarked on a strategic plan to focus on core on-highway markets, which includes the divestiture of its Off-Highway business to Allison Transmission Holdings, Inc. This move is aimed at creating a more focused and nimble organization. The company is also pursuing cost reduction initiatives, which include a substantial reduction in selling, general, and administrative costs, and aligning engineering expenses to match current industry dynamics. Additionally, Dana is focusing on aftermarket growth opportunities and selective acquisitions that align with its core businesses.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> Dana has utilized the net cash proceeds from the Off-Highway business divestiture to pay down debt, strengthening its financial position, and providing capital returns to shareholders. The company has repurchased $750 million worth of its own shares under the approved stock repurchase program and has increased the share repurchase program to a total of $2 billion through the end of 2030. Furthermore, Dana has made significant debt repayments, including the redemption of senior notes and repayment of the Term A Facility, to improve its capital structure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> Dana plans to continue its focus on core on-highway markets and accelerate value creation by improving its cost structure and increasing efficiency. The company expects to realize additional annualized savings from its cost reduction initiatives through 2026. Dana also aims to leverage its strong technology foundation to expand its global markets and deliver innovative solutions for the mobility markets it serves. The company anticipates generating free cash flow of $300 million at the midpoint of its guidance range for 2026, reflecting higher adjusted EBITDA and lower income tax and interest payments.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Market-Related Risks:</span></strong><span> Dana faces several market-related risks, including a downturn in the global economy, which could adversely affect vehicle demand and, consequently, the company's business. Climate change and related regulations could increase operating costs due to potential carbon pricing mechanisms and facility improvements. Public health crises, such as pandemics, pose risks of operational disruptions and supply chain challenges.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Risks:</span></strong><span> Rising interest rates could impact Dana's ability to obtain financing at attractive rates, affecting growth strategies. The company is also vulnerable to the loss of significant customers, which could materially impact financial results. Changes in international legislative and political conditions, including trade policies and tariffs, could disrupt operations and increase costs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> Dana's operations are exposed to foreign currency exchange rate fluctuations, particularly with 43% of sales from non-U.S. operations. Strengthening of the U.S. dollar could adversely affect results. The company also faces regulatory risks related to increased fuel economy standards and greenhouse gas emissions, which could alter customer product development plans and increase costs.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Company-Specific Risks:</span></strong><span> Challenges in realizing cost savings from restructuring actions, dependency on subsidiaries for cash flow, and potential labor stoppages are significant risks. Dana is also exposed to risks from commodity price volatility, supply chain disruptions, and program launch difficulties.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Intellectual Property and Compliance Risks:</span></strong><span> The company must protect its intellectual property and manage integration challenges from acquisitions and joint ventures. Environmental, health, safety, and product liability compliance costs could increase, impacting profitability. Cybersecurity threats and the use of AI and machine learning present operational and regulatory risks.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies:</span></strong><span> Dana's strategic initiatives include cost reduction and segment realignment to enhance profitability and cash flow. The company is focusing on aftermarket opportunities and selective acquisitions to drive growth. However, the transition from internal combustion engine vehicles to electric vehicles presents both opportunities and challenges, including increased competition and the need for significant R&amp;D investment.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Market Outlook:</span></strong><span> The company anticipates a stable outlook for light vehicle markets in 2026, with marginal improvements in Europe and South America. However, commercial vehicle markets face challenges, with expected declines in Class-8 truck production in North America. Foreign currency movements and commodity costs remain significant factors affecting financial performance.</span></p><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/26780/000143774926006076/dan20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">DANA Inc [ DAN ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:ca9b803d466cf:0-dana-inc-sec-10-k-report/",
            "pub_date": "2026-02-28 04:05:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260225006555:0",
            "title": "Correction — GREEN RAIN ENERGY HOLDINGS (OTCID: GREH) Provides Corporate Update: Finalized Special Stock Dividend, Voluntary Stock Buyback Program, and Strategic Growth Initiatives",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(14:00 GMT) </span></strong><span>*GREEN RAIN ENERGY HOLDINGS (OTCID: GREH) Provides Corporate Update: Finalized Special Stock Dividend, Voluntary Stock Buyback Program, And Strategic Growth Initiatives &gt;GREH</span><br/><strong class=\"root-Tkn6WL2y\"><span>(14:00 GMT) </span></strong><span>Press Release: GREEN RAIN ENERGY HOLDINGS (OTCID: GREH) Provides Corporate Update: Finalized Special Stock Dividend, Voluntary Stock Buyback Program, and Strategic Growth Initiatives</span></p><p class=\"\"><span>BEVERLY HILLS, Calif., Feb. 25, 2026 /PRNewswire/ — Green Rain Energy Holdings (OTCID: GREH) (\"Green Rain Energy,\" \"GREH,\" or the \"Company\") is pleased to provide shareholders with a significant corporate update highlighting strategic actions designed to strengthen shareholder alignment, optimize the Company's capital structure, and support long-term value creation.</span></p><p class=\"\"><span>Special Stock Dividend Finalized — Record Date March 31, 2025</span></p><p class=\"\"><span>The Company has finalized the structure of its previously announced special stock dividend, subject to customary regulatory approvals.</span></p><p class=\"\"><span>Dividend Details</span></p><p class=\"\"><span>Dividend Ratio: One (1) share of restricted common stock for every 100 shares of common stock held.</span></p><p class=\"\"><span>Record Date: March 31, 2025</span></p><p class=\"\"><span>Shareholder Action Required: None — no action or vote is required</span></p><p class=\"\"><span>Regulatory Status: Implementation remains subject to customary approval from FINRA.</span></p><p class=\"\"><span>Fractional Shares: Fractional shares will not be issued; amounts will be rounded up to the next highest whole share.</span></p><p class=\"\"><span>Tax Treatment: The distribution is intended to qualify as tax-free for U.S. federal income tax purposes.</span></p><p class=\"\"><span>Legal counsel is finalizing required submissions and will file all applicable documentation with FINRA in the coming days.</span></p><p class=\"\"><span>Strategic Purpose of the Dividend</span></p><p class=\"\"><span>Unlike traditional distributions designed solely to reward holders, this stock dividend is intended to strategically align shareholders with the Company's next phase of expansion by:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Broadening long-term shareholder participation in anticipated corporate   growth.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Supporting capital structure stability while preserving cash resources   for execution.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Enhancing shareholder alignment with strategic acquisitions and   operational expansion initiatives.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Management believes this dividend structure allows shareholders to   participate more directly in the Company's long-term growth trajectory   while reinforcing confidence in future execution. </span></li></ul><p class=\"\"><span>Voluntary Stock Buyback Program Finalized</span></p><p class=\"\"><span>The Company further announces that its voluntary stock buyback program has been finalized following formal approval by the Board of Directors.</span></p><p class=\"\"><span>Program Overview</span></p><p class=\"\"><span>Available to shareholders holding up to 2,500 common shares</span></p><p class=\"\"><span>Eligible participants may sell shares directly to the Company at a fixed price of $0.045 per share, consistent with the Company's amended Regulation A offering price</span></p><p class=\"\"><span>Program start date: April 1, 2026</span></p><p class=\"\"><span>Program expiration date: June 30, 2026</span></p><p class=\"\"><span>An independent escrow agent will be engaged to administer and facilitate the transaction</span></p><p class=\"\"><span>Any repurchased shares will be cancelled and returned to the Company's corporate treasury, thereby reducing the number of issued and outstanding shares and supporting long-term shareholder value through potential reduction in dilution.</span></p><p class=\"\"><span>The Company cautions that there is no assurance the program will be approved or implemented as described, and any such program will be conducted in full compliance with applicable securities laws and regulations.</span></p><p class=\"\"><span>Strategic Corporate Developments</span></p><p class=\"\"><span>Green Rain Energy continues to advance a number of initiatives expected to strengthen the Company's long-term position, including:</span></p><p class=\"\"><span>Ongoing updates regarding the proposed acquisition of Chronicle Electric Inc.</span></p><p class=\"\"><span>Settlement and mitigation arrangements involving outstanding convertible debt instruments designed to improve balance sheet stability.</span></p><p class=\"\"><span>Continued progress on project development and expansion initiatives.</span></p><p class=\"\"><span>Management will continue to provide updates as material developments occur.</span></p><p class=\"\"><span>Management Commentary</span></p><p class=\"\"><span>\"These initiatives represent a balanced approach to shareholder value creation,\" said Alfredo Papadakis CEO of the company. \"By finalizing both the stock dividend and the voluntary buyback program, we are demonstrating confidence in the Company's long-term strategy while maintaining a disciplined focus on capital management. Combined with acquisition opportunities and continued operational development, we believe Green Rain Energy is positioning itself as a compelling long-term value investment.\"</span></p><p class=\"\"><span>About Green Rain Energy Holdings Inc.</span></p><p class=\"\"><span>Green Rain Energy Holdings Inc. (OTCID: GREH) is a holding company focused on opportunities in renewable energy and related sustainable technologies. The Company seeks to identify, acquire, and develop assets that align with long-term trends in clean energy and environmental responsibility.</span></p><p class=\"\"><span>Visit: https://greenrainenergy.com/</span></p><p class=\"\"><span>Investor Relations: https://greenrainenergy.com/investor-relations/</span></p><p class=\"\"><span>Follow us on X (Twitter): https://x.com/GreenRainEnergy</span></p><p class=\"\"><span>Follow us on Facebook: https://www.facebook.com/profile.php?id=61580025893268&amp;mibextid=wwXIfr</span></p><p class=\"\"><span>Follow us on Instagram: https://www.instagram.com/green.rain.energy/?igsh=MW9jY3g0MmZiaG5pNg%3D%3D&amp;utm_source=qr#</span></p><p class=\"\"><span>Follow us on YouTube: https://www.youtube.com/@GreenRainEnergy</span></p><p class=\"\"><span>Forward Looking Statements:</span></p><p class=\"\"><span>This release contains forward-looking statements under Sections 27A and 21E of U.S. securities laws, subject to safe harbor provisions. These statements involve risks and uncertainties that could cause actual results to differ materially, including technical, permitting, or other challenges. Green Rain Energy assumes no obligation to update forward-looking statements except as required by law.</span></p><p class=\"\"><span>View original content to download multimedia:https://www.prnewswire.com/news-releases/green-rain-energy-holdings-otcid-greh-provides-corporate-update-finalized-special-stock-dividend-voluntary-stock-buyback-program-and-strategic-growth-initiatives-302696835.html</span></p><p class=\"\"><span>SOURCE Green Rain Energy Holdings, Inc.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260225006555:0/",
            "pub_date": "2026-02-28 04:06:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009435:0",
            "title": "Bath & Body Works Is Maintained at Market Perform by Telsey Advisory Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009435:0/",
            "pub_date": "2026-02-28 04:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009452:0",
            "title": "Nymex Platinum, Palladium Warehouse Stocks - Feb 27",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Source: CME Group </span><br/><span> </span><br/><span>For previous business day </span><br/><span>PREV TOTAL subject to revisions. Source: CME Group </span><br/><span> </span><br/><span>                      Prev                         Net               Total </span><br/><span>Platinum             Total  Received Withdrawn  Change Adjustment    Today </span><br/><span>ASAHI DEPOSITORY LLC </span><br/><span>Registered               0         0        0       0         0          0 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                    0         0        0       0         0          0 </span><br/><span> </span><br/><span>BRINK'S, INC. </span><br/><span>Registered          71,276         0        0       0         0     71,276 </span><br/><span>Eligible            86,540         0        0       0         0     86,540 </span><br/><span>Total              157,816         0        0       0         0    157,816 </span><br/><span> </span><br/><span>CNT DEPOSITORY, INC. </span><br/><span>Registered           1,246         0        0       0         0      1,246 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                1,246         0        0       0         0      1,246 </span><br/><span> </span><br/><span>DELAWARE DEPOSITORY </span><br/><span>Registered           1,634         0        0       0         0      1,634 </span><br/><span>Eligible            18,460         0        0       0         0     18,460 </span><br/><span>Total               20,094         0        0       0         0     20,094 </span><br/><span> </span><br/><span>HSBC BANK, USA </span><br/><span>Registered           1,395         0        0       0         0      1,395 </span><br/><span>Eligible             9,282         0        0       0         0      9,282 </span><br/><span>Total               10,677         0        0       0         0     10,677 </span><br/><span> </span><br/><span>INTERNATIONAL DEPOSITORY SERVICES OF DELAWARE </span><br/><span>Registered           2,395         0        0       0         0      2,395 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                2,395         0        0       0         0      2,395 </span><br/><span> </span><br/><span>JP MORGAN CHASE BANK NA </span><br/><span>Registered         113,602         0        0       0         0    113,602 </span><br/><span>Eligible            75,485         0        0       0         0     75,485 </span><br/><span>Total              189,086         0        0       0         0    189,086 </span><br/><span> </span><br/><span>LOOMIS INTERNATIONAL (US) LLC </span><br/><span>Registered          59,210         0        0       0         0     59,210 </span><br/><span>Eligible            70,953    10,330        0  10,330         0     81,284 </span><br/><span>Total              130,163    10,330        0  10,330         0    140,493 </span><br/><span> </span><br/><span>MALCA-AMIT USA, LLC </span><br/><span>Registered             395         0        0       0         0        395 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                  395         0        0       0         0        395 </span><br/><span> </span><br/><span>MANFRA, TORDELLA &amp; BROOKES, LLC </span><br/><span>Registered          48,293         0        0       0         0     48,293 </span><br/><span>Eligible             3,432         0        0       0         0      3,432 </span><br/><span>Total               51,725         0        0       0         0     51,725 </span><br/><span> </span><br/><span>STONEX PRECIOUS METALS LLC </span><br/><span>Registered          14,123         0        0       0         0     14,123 </span><br/><span>Eligible                16         0        0       0         0         16 </span><br/><span>Total               14,139         0        0       0         0     14,139 </span><br/><span> </span><br/><span>COMBINED TOTALS </span><br/><span>Registered         313,568         0        0       0         0    313,568 </span><br/><span>Eligible           264,168    10,330        0  10,330         0    274,498 </span><br/><span>Total              577,736    10,330        0  10,330         0    588,066 </span><br/><span> </span><br/><span>                      Prev                         Net               Total </span><br/><span>Palladium            Total  Received Withdrawn  Change Adjustment    Today </span><br/><span>ASAHI DEPOSITORY LLC </span><br/><span>Registered               0         0        0       0         0          0 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                    0         0        0       0         0          0 </span><br/><span> </span><br/><span>BRINK'S, INC. </span><br/><span>Registered           7,448         0        0       0         0      7,448 </span><br/><span>Eligible             9,786         0        0       0         0      9,786 </span><br/><span>Total               17,234         0        0       0         0     17,234 </span><br/><span> </span><br/><span>CNT DEPOSITORY, INC. </span><br/><span>Registered              97         0        0       0         0         97 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                   97         0        0       0         0         97 </span><br/><span> </span><br/><span>DELAWARE DEPOSITORY </span><br/><span>Registered             788         0        0       0         0        788 </span><br/><span>Eligible             3,208         0        0       0         0      3,208 </span><br/><span>Total                3,996         0        0       0         0      3,996 </span><br/><span> </span><br/><span>HSBC BANK, USA </span><br/><span>Registered             586         0        0       0         0        586 </span><br/><span>Eligible             2,023         0        0       0         0      2,023 </span><br/><span>Total                2,609         0        0       0         0      2,609 </span><br/><span> </span><br/><span>INTERNATIONAL DEPOSITORY SERVICES OF DELAWARE </span><br/><span>Registered               0         0        0       0         0          0 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                    0         0        0       0         0          0 </span><br/><span> </span><br/><span>JP MORGAN CHASE BANK NA </span><br/><span>Registered          17,669         0        0       0         0     17,669 </span><br/><span>Eligible               103         0        0       0         0        103 </span><br/><span>Total               17,772         0        0       0         0     17,772 </span><br/><span> </span><br/><span>LOOMIS INTERNATIONAL (US) LLC </span><br/><span>Registered          41,614    15,912        0  15,912         0     57,526 </span><br/><span>Eligible             2,417         0        0       0         0      2,417 </span><br/><span>Total               44,031    15,912        0  15,912         0     59,943 </span><br/><span> </span><br/><span>MALCA-AMIT USA, LLC </span><br/><span>Registered               0         0        0       0         0          0 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                    0         0        0       0         0          0 </span><br/><span> </span><br/><span>MANFRA, TORDELLA &amp; BROOKES, LLC </span><br/><span>Registered          74,639         0        0       0         0     74,639 </span><br/><span>Eligible            20,414         0        0       0         0     20,414 </span><br/><span>Total               95,054         0        0       0         0     95,054 </span><br/><span> </span><br/><span>STONEX PRECIOUS METALS LLC </span><br/><span>Registered           5,476         0        0       0         0      5,476 </span><br/><span>Eligible                 0         0        0       0         0          0 </span><br/><span>Total                5,476         0        0       0         0      5,476 </span><br/><span> </span><br/><span>COMBINED TOTALS </span><br/><span>Registered         148,318    15,912        0  15,912         0    164,230 </span><br/><span>Eligible            37,951         0        0       0         0     37,951 </span><br/><span>Total              186,269    15,912        0  15,912         0    202,181 </span><br/><span> </span><br/><span>Write to Valena Henderson at csstat@dowjones.com </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009452:0/",
            "pub_date": "2026-02-28 04:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009459:0",
            "title": "FIGS Is Maintained at Market Perform by Telsey Advisory Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009459:0/",
            "pub_date": "2026-02-28 04:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3Z301E:0",
            "title": "US says research funding into new farm practices to surpass $1 billion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The United States will invest over $1 billion in research into new and sustainable farm practices, following an additional $200 million in funding, the Environmental Protection Agency as well as the departments of Agriculture and Health and Human Services said in a joint statement on Friday. </span></p><p class=\"\"><span>The administration is pushing efforts to reduce the usage of pesticides by finding alternatives. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3Z301E:0-us-says-research-funding-into-new-farm-practices-to-surpass-1-billion/",
            "pub_date": "2026-02-28 04:09:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:88fc76d80094b:0",
            "title": "Tesla Delays Deliveries For Cheapest Cybertruck Until 2027",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Earlier this week, the company said that the price on the cheapest variant will increase after Feb. 28.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Musk had previously predicted that Tesla could sell up to 500,000 Cybertrucks annually.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>However, the vehicle is yet to breach 100,000 deliveries a year.</span></li></ul></span></div><span><p class=\"\"><span>Customers ordering Tesla Inc.’s (TSLA) cheapest Cybertruck variant will have to wait until the next year to have it delivered, the company’s website now shows.</span></p><p class=\"\"><span>Tesla’s website has been updated to reflect delivery wait time until 2027 for zip codes in Texas as well as California for its Dual Motor all-wheel drive (AWD) variant launched last week, implying significant demand. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Cheapest Cybertruck</span></strong></p><p class=\"\"><span>The lower-price Dual Motor AWD variant of the Cybertruck priced at $59,990 was unveiled last week. Tesla now offers three versions of the vehicles including the premium all-wheel drive and Cyberbeast variants priced at $79,990 and $99,990, respectively.</span></p><p class=\"\"><span>Earlier this week, the company </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/tesla-to-hike-price-on-cheapest-cybertruck-variant-after-feb-28/cZRw9lbR4C6\" rel=\"nofollow\" target=\"_blank\">said</a><span> that the price on the cheapest variant will increase after Feb. 28. The company, however, did not provide a new price point.</span></p><p class=\"\"><span>Tesla started delivering the Cybertruck in Nov. 2023 after a long wait. However, the truck was pricier than proposed during its unveiling in 2019, dragging down demand and preventing reservation holders from actually placing the order.</span></p><p class=\"\"><span>Musk had said in 2019 that the entry-level variant of the truck would start at about $40,000, while the most premium version would start at around $70,000. The Cybertruck’s stainless steel exterior and angular design also pulled split opinions, with some deeming it ugly, while others appreciated the change.</span></p><p class=\"\"><span>Musk had previously predicted that Tesla could sell up to 500,000 Cybertrucks annually. However, in 2025, the company sold only 50,850 units of all its premium models combined, which includes the Model S, X and the Cybertruck, putting Cybertruck annual sales alone at below 20,000 units on an estimate.</span></p><p class=\"\"><span>Late last year, Tesla also launched cheaper variants of both of its top-selling Model 3 sedan and Model Y SUV models.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around TSLA stock stayed within the ‘extremely bullish’ territory while message volume stayed at ‘low’ levels.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/TSLA\" rel=\"nofollow\" target=\"_blank\">TSLA stock</a><span> has gained 42% over the past 12 months.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:88fc76d80094b:0/",
            "pub_date": "2026-02-28 04:09:40",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN137:0",
            "title": "US dollar rises on higher PPI and US-Iran tensions",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>PPI rises 0.5% in January, exceeding expectations</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Dollar gains amid US-Iran tensions and potential conflict</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Dollar index heads for first monthly gain since October</span></li></ul></span></div><span><p class=\"\"><span>By Karen Brettell</span></p><p class=\"\"><span>    The U.S. dollar was headed for its first monthly gain since October on Friday, although an earlier rally on hotter-than-expected producer price data for January faded as traders squared positions for the month-end and ahead of the weekend.</span></p><p class=\"\"><span>     The U.S. currency got a boost after data showed the Producer Price Index for final demand rose 0.5% last month. Economists polled by Reuters had forecast the PPI gaining 0.3% after a previously reported 0.5% increase in December.</span></p><p class=\"\"><span>\"There's a real deep unease in markets about inflation and growth so far in 2026,\" said Adam Button, chief currency analyst at investingLive. \"There's this expectation that inflation will moderate, but it's not showing up in the numbers.\"</span></p><p class=\"\"><span>Underneath the headline number, however, there were signs of improvement, said Chris Low, chief economist at FHN Financial.</span></p><p class=\"\"><span>\"While the PPI headline increase was alarmingly big, pressure came from trade services, a category the BLS notes is calculated in a way that does not capture true price changes in real time,\" Low said in a report. \"Otherwise, there is evidence of price moderation.\"</span></p><p class=\"\"><span>DOLLAR TRACKS FIRST MONTHLY GAIN SINCE OCTOBER</span></p><p class=\"\"><span>The dollar index </span><span>, which measures the greenback against a basket of currencies including the yen and the euro, fell 0.12% to 97.61, with the euro </span><span> up 0.18% at $1.1818.</span></p><p class=\"\"><span>The dollar index is headed for a 0.47% monthly gain, its first monthly increase since October. The euro is on track for a 0.25% loss, its first down month since October.</span></p><p class=\"\"><span>Against the Japanese yen </span><span>, the dollar weakened 0.1% to 155.95. The U.S. currency is headed for a 0.78% gain against the yen this month.</span></p><p class=\"\"><span>The U.S. Federal Reserve is expected to keep rates on hold until at least June due to concerns about elevated inflation.</span></p><p class=\"\"><span>But traders are pricing in 62 basis points of cuts by year-end on concerns about a weakening labor market.</span></p><p class=\"\"><span>The dollar was also boosted earlier by safety bids on concerns about a conflict between the U.S. and Iran.</span></p><p class=\"\"><span>The two countries made progress in talks over Tehran's nuclear program on Thursday, mediator Oman said, but hours of negotiation ended with no sign of a breakthrough that could avert potential U.S. strikes amid a massive military buildup.</span></p><p class=\"\"><span>Oil prices rose about 2% on Friday as traders remained on alert for potential supply disruptions if relations worsen. </span></p><p class=\"\"><span>Overall market moves this week have been muted as traders gauge the geopolitical uncertainty along with the impact of new tariffs, after the U.S. Supreme Court last week struck down U.S. President Donald Trump's emergency tariffs.</span></p><p class=\"\"><span>\"The dollar has been trading in a little bit of a holding pattern. It feels like it's waiting for its next real catalyst,\" said City Index market strategist Fiona Cincotta.</span></p><p class=\"\"><span>The yuan took a breather from a 10-day rally after the People's Bank of China moved to slow the pace of the rise. The central bank said it would scrap the foreign exchange risk reserves for some forward contracts, seen as a way to encourage dollar buying.</span></p><p class=\"\"><span>Sterling </span><span> weakened 0.02% to $1.3478 and was set to snap three straight months of gains with a 1.53% fall in February.</span></p><p class=\"\"><span>A local election in Manchester on Thursday delivered a big victory to the Green Party and a blow to Prime Minister Keir Starmer's Labour, whose popularity has slid sharply in the past year.</span></p><p class=\"\"><span>Sterling is sensitive to domestic politics, but with risk events ahead, such as next week's budget update from finance minister Rachel Reeves, any volatility was contained.</span></p><p class=\"\"><span>In cryptocurrencies, bitcoin </span><span> fell 3.08% to $65,399.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN137:0-us-dollar-rises-on-higher-ppi-and-us-iran-tensions/",
            "pub_date": "2026-02-28 04:09:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009470:0",
            "title": "Xponential Fitness Plummets on 4Q Earnings Miss, Expected FY Rev Decline",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Elias Schisgall</span></p><p class=\"\"><span>Shares of Xponential Fitness plummeted after the company reported a wider-than-expected fourth-quarter loss and guided for a 16% revenue decline for the full year.</span></p><p class=\"\"><span>Shares were down 48% to $4.21 in Friday afternoon trading after hitting a low of $4.06, their lowest point in at least five years. The stock is down 67% over the past 12 months.</span></p><p class=\"\"><span>The boutique fitness brands company on Thursday reported a loss of $32.9 million, or $1.17 a share, compared with a loss of $43.5 million, or $1.36 a share, a year earlier.</span></p><p class=\"\"><span>Stripping out certain one-time items, the company reported an adjusted loss of 91 cents a share. Analysts surveyed by FactSet were expecting an adjusted loss of 3 cents a share.</span></p><p class=\"\"><span>Revenue was $83 million, down slightly from $83.2 million a year earlier. Analysts were expecting $73.4 million.</span></p><p class=\"\"><span>For the current year, the company said it expects revenue to fall to between $260 million and $270 million, representing a 16% decline at the midpoint.</span></p><p class=\"\"><span>Write to Elias Schisgall at elias.schisgall@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009470:0/",
            "pub_date": "2026-02-28 04:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:20e5addb67ebc:0",
            "title": "Key facts: Morgan Stanley expands Bitcoin services; announces early redemption",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Morgan Stanley is pursuing Bitcoin yield and lending services, enhancing its digital asset strategy by hiring for crypto roles in Decentralized Finance (DeFi) and tokenization.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/beincrypto:59434bed3094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Morgan Stanley B.V. announced an early redemption related to GEM_MSBV, scheduled for February 27, 2026, as reported through the Companies Announcement Service of Euronext Dublin.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026-02-27:newsml_EduRSwdQa:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:20e5addb67ebc:0-key-facts-morgan-stanley-expands-bitcoin-services-announces-early-redemption/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:bd2b379d37810:0",
            "title": "Key facts: Match Group posts $873M operating income; files mixed shelf offering",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Match Group reported an operating income of $873 million, marking a 6% increase year-over-year, and a net income of $613 million, which reflects an 11% increase attributed to lower interest expenses.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/tradingview:e04e77d7d9fa0:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Match Group Inc. has filed for a mixed shelf offering, with the size of the offering not disclosed, according to a recent SEC filing.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_FWN3ZM29A:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:bd2b379d37810:0-key-facts-match-group-posts-873m-operating-income-files-mixed-shelf-offering/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:a1ff9314dfe48:0",
            "title": "Key facts: Janux Therapeutics Receives Strong Buy Ratings; Partners with BMS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Janux Therapeutics (JANX) has 18 'strong buy' or 'buy' ratings and no 'sell' ratings. The median 12-month price target is $53.50, indicating a potential 74.4% upside from $13.70.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L1N3ZM1FP:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Janux Therapeutics has partnered with Bristol Myers Squibb to develop a new tumor-activated therapy for solid tumors, with potential milestone payments of around $800 million.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/DJN_DN20260226014138:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:a1ff9314dfe48:0-key-facts-janux-therapeutics-receives-strong-buy-ratings-partners-with-bms/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:f02bee15afd9e:0",
            "title": "Key facts: ImmunityBio completes Phase 2 trial enrollment; conference call set",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>ImmunityBio has finished enrollment early in its Phase 2 Quilt 2.005 trial, evaluating Anktiva and BCG for early-stage bladder cancer, showing improved cancer-free rates.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/stocktwits:7fc8f762a094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>ImmunityBio, Inc. will hold a conference call on March 3, 2026, at 1:30 p.m. PT to discuss its 2025 financial results and updates on clinical trials.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/DJN_DN20260227005180:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:f02bee15afd9e:0-key-facts-immunitybio-completes-phase-2-trial-enrollment-conference-call-set/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:04ba6eb2b0d94:0",
            "title": "Key facts: HC Wainwright maintains 'Buy' on Energy Fuels; target raised to $27.25",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>HC Wainwright &amp; Co. has maintained a 'Buy' rating for Energy Fuels (UUUU) and raised the price target to $27.25 per share, an increase from the previous target of $26.75.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/DJN_DN20260227007625:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Analysts raised Energy Fuels Inc's earnings estimate by about 20% in three months. The current rating is 'buy' with 4 'strong buy' or 'buy' ratings and 1 'hold'.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L8N3ZN1SG:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:04ba6eb2b0d94:0-key-facts-hc-wainwright-maintains-buy-on-energy-fuels-target-raised-to-27-25/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:fa689e36d8812:0",
            "title": "Key facts: Google invests $600B in AI; faces antitrust probe in Belgium",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Google (Alphabet) joins major tech firms in a $600 billion AI investment this year, expected to impact various sectors like semiconductors and utilities.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L6N3ZN0PE:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Belgium's competition authority is investigating Google's ad pricing, citing possible antitrust violations amid concerns over increasing online advertising costs.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L1N3ZN0NO:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Google has signed a multibillion-dollar deal with Meta to lease its Tensor Processing Units (TPUs) for advanced AI model development, highlighting major tech firms' investment in AI.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_FWN3ZM24T:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/gurufocus:cfd363645094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">4</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:fa689e36d8812:0-key-facts-google-invests-600b-in-ai-faces-antitrust-probe-in-belgium/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:281e437c2bbce:0",
            "title": "Key facts: Goldman Sachs trades below peak; faces no redemption issues",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Goldman Sachs (GS) trades at $870, about 10% below its peak of $1,000. A bearish head-and-shoulders pattern indicates a potential drop below $875, possibly losing 100 points.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/DJN_DN20260227008782:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Goldman Sachs reported that it is not facing the same challenges as its private credit peers, who are currently dealing with redemptions.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L4N3ZN1TL:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Goldman Sachs' exposure to enterprise software credit was 15.5% at Q3's end, lower than peers. The firm has evaluated AI's potential risks to established software firms.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/reuters.com,2026:newsml_L4N3ZN1UM:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:281e437c2bbce:0-key-facts-goldman-sachs-trades-below-peak-faces-no-redemption-issues/",
            "pub_date": "2026-02-28 04:04:31",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        }
    ]
}