{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309466:0",
            "title": "3M to Pay Quarterly Dividend of $0.73 a Share, Payable March 12 to Shareholders of Record on Feb. 14",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309466:0/",
            "pub_date": "2025-02-05 06:31:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463547:0",
            "title": "Coca-Cola Bottlers Japan Buys Back 1.2 Million Shares in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coca-Cola Bottlers Japan Holdings  repurchased 1.2 million shares for 2.81 billion yen in January, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The buyback is part of a program approved on Nov. 6, 2024, allowing the buyback of up to 20 million shares, or 11% of outstanding stock, for a maximum of 30 billion yen. </p><p class=\"\">As of Jan. 31, the company has acquired 3 million shares, spending 7.37 billion yen.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463547:0/",
            "pub_date": "2025-02-05 06:31:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013227:0",
            "title": "NETRAMARK PROVIDES BUSINESS UPDATE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NETRAMARK PROVIDES BUSINESS UPDATE</p><p class=\"\">Canada NewsWire</p><p class=\"\">TORONTO, Feb. 4, 2025</p><p class=\"\">TORONTO, Feb. 4, 2025 /CNW/ - NetraMark Holdings Inc. (the \"Company\" or \"NetraMark\")   (Frankfurt: 8TV) a generative AI software leader in clinical trial analytics, is pleased to highlight recent corporate advancements; including a key leadership appointment, a major pharmaceutical collaboration, a strategic board addition, a strengthened financial position and a new marketing / investor relations engagement.</p><p class=\"\">Dr. Angelico Carta Appointed as Chief Strategy Officer</p><p class=\"\">As previously announced on December 11, 2024, NetraMark appointed Dr. Angelico Carta, co-founder of Worldwide Clinical Trials, as its Chief Strategy Officer. Dr. Carta brings over 35 years of experience in clinical research and pharmaceutical strategy, enhancing NetraMark's ability to expand partnerships and refine its go-to-market approach. His leadership is expected to play a critical role in advancing NetraMark's AI-driven capabilities in clinical trials and precision medicine.</p><p class=\"\">Strategic Collaboration with Top 5 Pharmaceutical Company</p><p class=\"\">As previously announced on December 9, 2024, NetraMark has entered into a pilot collaboration agreement with a Top 5 pharmaceutical company, as defined by market capitalization. The initiative aims to leverage NetraAI technology to uncover novel insights into patient populations, improving the client's development of treatments for autoimmune disorders. This collaboration aligns with one of the Company's core goals - validation of the technology through major collaborations and co-publishing opportunities.</p><p class=\"\">P.J. Haley Joins Board of Directors</p><p class=\"\">As previously announced on October 9, 2024, NetraMark welcomed P.J. Haley, Executive Vice President of Commercial at Exelixis, Inc., to its Board of Directors. With over 20 years of experience in oncology commercialization, market access, and strategic partnerships, Mr. Haley will help steer NetraMark's expansion into the oncology sector, aligning AI solutions with evolving industry needs.</p><p class=\"\">$1.16 Million Raised Through Warrant and Stock Option Exercises</p><p class=\"\">As previously announced on December 12, 2024, NetraMark strengthened its financial position in Q1 of this fiscal year through the exercise of warrants and stock options by their holders, raising $1,161,000. This capital infusion will support the continued development and expansion of NetraMark's AI solutions, designed to empower pharmaceutical companies with advanced insights for clinical trial success. The funding reinforces the company's ability to scale operations and drive innovation in precision medicine.</p><p class=\"\">Marketing, Public and Investor Relations</p><p class=\"\">NetraMark announces that it has extended the term of its original agreement (\"ARU Agreement\") with ARU Global Inc. (\"ARU\") to provide public relations services in an effort to increase public awareness of the Company. Certain services to be provided by ARU are anticipated to include \"investor relations activities\" under the policies of the Canadian Securities Exchange.  Any materials disseminated by ARU will require the prior written approval of the Company.</p><p class=\"\">The term of the ARU Agreement is extended to Mach 31, 2025. The ARU Agreement was also amended to increase compensation paid during the term to ARU, from $112,000 USD to $133,000 USD.  ARU is owned by Brian Uppal and is located at 17th Floor, PH Plaza 2000 50th Street Panama City, Panama and can be reached at 507-6532-8900 or brian@aruglobalinc.com. ARU does not have any interest, directly or indirectly, in NetraMark or its securities, or any right or intent to acquire such an interest.</p><p class=\"\">NetraMark also announces it has entered into an agreement with 1502656 B.C LTD. (\"BC Ltd.)\" to provide strategic digital media services, marketing (including awareness campaigns) and data analytical services to the Company (the \"Marketing Agreement\"). The term of the Marketing Agreement is for a period of six months commencing February 4, 2025. During the term of the Marketing Agreement, BC LTD. will be paid compensation equal to C$300,000.  BC LTD. and its principals are arm's length to the Company.  As of the date hereof, to the Company's knowledge, BC LTD. (including its directors and officers) do not own any securities of the Company. BC LTD. is located at 3849 154th Street Surrey, BC V3Z0V3, and can be reached at 604-317-2952 or nate@wagnergroup.media</p><p class=\"\">About NetraAI</p><p class=\"\">In contrast with other AI-based methods, NetraAI is uniquely engineered to include focus mechanisms that separate small datasets into explainable and unexplainable subsets. Unexplainable subsets are collections of patients that can lead to suboptimal overfit models and inaccurate insights due to poor correlations with the variables involved. The NetraAI uses the explainable subsets to derive insights and hypotheses (including factors that influence treatment and placebo responses, as well as adverse events) that have the potential to increase the chances of a clinical trial success.  Other AI methods lack these focus mechanisms and assign every patient to a class, even when this leads to \"overfitting\" which drowns out critical information that could have been used to improve a trial's chance of success.</p><p class=\"\">About NetraMark</p><p class=\"\">NetraMark is a company focused on being a leader in the development of Generative Artificial Intelligence (Gen AI)/Machine Learning (ML) solutions targeted at the Pharmaceutical industry. Its product offering uses a novel topology-based algorithm that has the ability to parse patient data sets into subsets of people that are strongly related according to several variables simultaneously. This allows NetraMark to use a variety of ML methods, depending on the character and size of the data, to transform the data into powerfully intelligent data that activates traditional AI/ML methods. The result is that NetraMark can work with much smaller datasets and accurately segment diseases into different types, as well as accurately classify patients for sensitivity to drugs and/or efficacy of treatment.</p><p class=\"\">For further details on the Company please see the Company's publicly available documents filed on the System for Electronic Document Analysis and Retrieval+ (SEDAR+).</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation including statements regarding the terms of ARU's engagement, the terms of BC Ltd.'s engagement, NetraMark's technology, benefits of new directors, officers, financial position and collaborations, the potential for accelerated growth and the potential value of our technology to pharmaceutical and biotechnology companies which are based upon NetraMark's current internal expectations, estimates, projections, assumptions and beliefs, and views of future events. Forward-looking information can be identified by the use of forward-looking terminology such as \"expect\", \"likely\", \"may\", \"will\", \"should\", \"intend\", \"anticipate\", \"potential\", \"proposed\", \"estimate\" and other similar words, including negative and grammatical variations thereof, or statements that certain events or conditions \"may\", \"would\" or \"will\" happen, or by discussions of strategy. Forward-looking information includes estimates, plans, expectations, opinions, forecasts, projections, targets, guidance, or other statements that are not statements of fact. The forward-looking statements are expectations only and are subject to known and unknown risks, uncertainties and other important factors that could cause actual results of the Company or industry results to differ materially from future results, performance or achievements. Any forward-looking information speaks only as of the date on which it is made, and, except as required by law, NetraMark does not undertake any obligation to update or revise any forward-looking information, whether as a result of new information, future events, or otherwise. New factors emerge from time to time, and it is not possible for NetraMark to predict all such factors.</p><p class=\"\">When considering these forward-looking statements, readers should keep in mind the risk factors and other cautionary statements as set out in the materials we file with applicable Canadian securities regulatory authorities on SEDAR+ at www.sedarplus.ca including our Management's Discussion and Analysis for the year ended September 30, 2024. These risk factors and other factors could cause actual events or results to differ materially from those described in any forward-looking information.</p><p class=\"\">The CSE does not accept responsibility for the adequacy or accuracy of this release.</p><p class=\"\">SOURCE NetraMark Holdings Inc.</p><p class=\"\">View original content to download multimedia: http://www.newswire.ca/en/releases/archive/February2025/04/c3701.html</p><p class=\"\">/CONTACT:</p><p class=\"\">Contact Information: Swapan Kakumanu - CFO | swapan@netramark.com</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013227:0/",
            "pub_date": "2025-02-05 06:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013237:0",
            "title": "Sterling Gains 0.26% to $1.2481 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">British pound/dollar: 1.2481 dollars per British pound (0.8012 British pound per dollar)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Today the British pound gained 0.26% vs. the dollar</li><li class=\"listItem-bmN0_SHH\">Up for two straight sessions</li><li class=\"listItem-bmN0_SHH\">Up 0.70% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two-day percentage gain since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 16.09% since the pre-Brexit vote level of 1.49 on Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Highest five pm New York rate since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 6.96% from its 52-week high of 1.3415 hit Tuesday, Sept. 24, 2024</li><li class=\"listItem-bmN0_SHH\">Up 2.58% from its 52-week low of 1.2167 hit Friday, Jan. 17, 2025</li><li class=\"listItem-bmN0_SHH\">Down 0.94% vs the dollar from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Year-to-date the British pound is down 0.26% vs the dollar</li></ul><p class=\"\">Data based on 5 p.m. ET values</p><p class=\"\">Source: Tullett Prebon and Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013237:0-sterling-gains-0-26-to-1-2481-data-talk/",
            "pub_date": "2025-02-05 06:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013233:0",
            "title": "New Zealand's Unemployment Rate Rises to Four-Year High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By James Glynn</p><p class=\"\">SYDNEY--New Zealand's unemployment rose to its highest level in four years in the final months of last year, highlighting the extent of its economic slowdown and locking in a further significant cut in interest rates when the central bank meets later this month.</p><p class=\"\">Unemployment rose to 5.1% in the fourth quarter, the highest it has been since the third quarter of 2020, when it stood at 5.2%, Stats NZ said Wednesday.</p><p class=\"\">The economy shed 32,000 jobs through calendar 2024, the largest annual fall in employment since the 2009, it added.</p><p class=\"\">The Reserve Bank of New Zealand has been cutting interest rates aggressively since mid-2024, with senior bank officials indicating in recent months that more will be needed to restore momentum to the economy.</p><p class=\"\">A combination of soaring interest rates and a surge in the cost of living over recent years had seen New Zealand's move in and out of recession in that time.</p><p class=\"\">Recent GDP growth data was far weaker than most economists had expected, putting the RBNZ on track to deliver a further 50 basis-point cut in the official cash rate on Feb. 19, taking the total reduction in the official cash rate to 175 basis points since midway through last year.</p><p class=\"\">The RBNZ has also pointed to growing uncertainty around the global economic outlook, and the fact that inflation has returned to target, as key reasons to ease policy settings.</p><p class=\"\">The underutilization rate, which measures untapped capacity in the labor market, rose to 12.1% in the fourth quarter from 11.6% in the third quarter.</p><p class=\"\">Men accounted for 85% of the annual decrease in employment, reflecting substantial falls in the male-dominated occupation groups of technicians and trades workers, and machinery operators and drivers, the data showed.</p><p class=\"\">Write to James Glynn at james.glynn@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013233:0-new-zealand-s-unemployment-rate-rises-to-four-year-high/",
            "pub_date": "2025-02-05 06:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013235:0",
            "title": "Dollar Lost 0.27% to 154.34 Yen — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dollar/Japanese yen: 154.34 Japanese yen per dollar (0.0065 dollar per Japanese yen)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Today the dollar lost 0.27% vs. the Japanese yen</li><li class=\"listItem-bmN0_SHH\">Down for two straight sessions</li><li class=\"listItem-bmN0_SHH\">Down 0.55% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two-day percentage decline since Thursday, Jan. 30, 2025</li><li class=\"listItem-bmN0_SHH\">Down 14 of the past 19 sessions</li><li class=\"listItem-bmN0_SHH\">Off 4.55% from its 52-week high of 161.697 hit Wednesday, July 10, 2024</li><li class=\"listItem-bmN0_SHH\">Up 9.77% from its 52-week low of 140.613 hit Monday, Sept. 16, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 4.33% vs the Japanese yen from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Year-to-date the dollar is down 1.82% vs the Japanese yen</li></ul><p class=\"\">Data based on 5 p.m. ET values</p><p class=\"\">Source: Tullett Prebon and Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013235:0-dollar-lost-0-27-to-154-34-yen-data-talk/",
            "pub_date": "2025-02-05 06:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUAC2NND4:0",
            "title": "Powell Industries Declares Quarterly Cash Dividend Of $0.2675 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Powell Industries Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">POWELL INDUSTRIES RAISES QUARTERLY DIVIDEND TO $0.2675 PER SHARE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">POWELL INDUSTRIES INC - DECLARES QUARTERLY CASH DIVIDEND OF $0.2675 PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUAC2NND4:0-powell-industries-declares-quarterly-cash-dividend-of-0-2675-per-share/",
            "pub_date": "2025-02-05 06:33:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013241:0",
            "title": "The WSJ Dollar Index Falls 0.34% to 102.03 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The WSJ Dollar Index is down 0.34 point or 0.34% today to 102.03</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one-day point and percentage decline since Friday, Jan. 24, 2025</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 0.48 point or 0.47% over the last two trading days</li><li class=\"listItem-bmN0_SHH\">Largest two-day point and percentage decline since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 2.96% from its record close of 105.14 hit Tuesday, Sept. 27, 2022</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third lowest this year</li><li class=\"listItem-bmN0_SHH\">Lowest closing value since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 1.52% from its 52-week high of 103.61 hit Friday, Jan. 10, 2025</li><li class=\"listItem-bmN0_SHH\">Up 7.06% from its 52-week low of 95.31 hit Friday, Sept. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 3.70% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is down 0.72 point or 0.70%</li></ul><p class=\"\">Data based on 5 p.m. ET values</p><p class=\"\">Source: Tullett Prebon and Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013241:0-the-wsj-dollar-index-falls-0-34-to-102-03-data-talk/",
            "pub_date": "2025-02-05 06:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013239:0",
            "title": "Euro Gains 0.35% to $1.0381 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Euro/dollar: 1.0381 dollars per euro (0.9633 euro per dollar)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Today the euro gained 0.35% vs. the dollar</li><li class=\"listItem-bmN0_SHH\">Largest one-day percentage gain since Friday, Jan. 24, 2025</li><li class=\"listItem-bmN0_SHH\">Snaps a six session losing streak</li><li class=\"listItem-bmN0_SHH\">Off 7.26% from its 52-week high of 1.1194 hit Friday, Aug. 23, 2024</li><li class=\"listItem-bmN0_SHH\">Up 1.32% from its 52-week low of 1.0246 hit Monday, Jan. 13, 2025</li><li class=\"listItem-bmN0_SHH\">Down 3.48% vs the dollar from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Year-to-date the euro is up 0.24% vs the dollar</li></ul><p class=\"\">Data based on 5 p.m. ET values</p><p class=\"\">Source: Tullett Prebon and Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013239:0-euro-gains-0-35-to-1-0381-data-talk/",
            "pub_date": "2025-02-05 06:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463564:0",
            "title": "Kelly Partners Group Posts Higher Fiscal H1 Earnings as Revenue Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kelly Partners Group Holdings  reported Wednesday fiscal first-half attributable earnings of AU$0.0556 per diluted share, up from AU$0.0435 per diluted share a year earlier. </p><p class=\"\">Revenue from ordinary activities for the six months ended Dec. 31, 2024, was AU$64.9 million, up from AU$52.9 million a year ago. </p><p class=\"\">There were no dividends declared for the period.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463564:0/",
            "pub_date": "2025-02-05 06:34:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013251:0",
            "title": "3M Raises Dividend, Authorizes $7.5B Share Repurchase Plan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Stephen Nakrosis</p><p class=\"\">3M board raised its dividend to 73 cents per share of the company's common stock for the first quarter, up from 70 cents per share.</p><p class=\"\">The new dividend, $2.92 on an annual basis, will be paid on March 12 to shareholders of record at the close of business on Feb. 14.</p><p class=\"\">Based on Tuesday's closing share price of $151.68, the dividend represents a yield of about 1.9%.</p><p class=\"\">3M said it  has paid dividends to its shareholders without interruption for more than 100 years.</p><p class=\"\">The company also said its board authorized the repurchase of up to $7.5 billion of outstanding common stock, replacing an existing repurchase program. The authorization has no pre-established closing date.</p><p class=\"\">3M has a market cap of $80.94 billion, 539.74 million shares outstanding and a public float of 538.98 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013251:0/",
            "pub_date": "2025-02-05 06:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463548:0",
            "title": "F-Code to Acquire Ciel Zero to Boost Digital Transformation, AI Capabilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">F-Code  will acquire an 80% stake in Ciel Zero Inc. for 1.31 billion yen, aiming to strengthen its digital transformation and AI capabilities, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The deal, approved by the board on Feb. 4, is set to close on Feb. 14. </p><p class=\"\">Ciel Zero, spun off from UE Corporation on Jan. 31, provides IT engineering and AI-driven solutions. F-Code expects the acquisition to enhance its technology offerings and boost profitability.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463548:0/",
            "pub_date": "2025-02-05 06:35:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309462:0",
            "title": "Columbia Sportswear Q4 Earnings, Sales Increase; Sets Q1 Guidance; Shares Slump After Hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Columbia Sportswear  reported Q4 earnings late Tuesday of $1.80 per diluted share, up from $1.55 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.89. </p><p class=\"\">Net sales for the quarter that ended Dec. 31 was $1.10 billion, up from $1.06 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $1.08 billion. </p><p class=\"\">The company said it expects Q1 earnings of $0.62 to $0.70 per diluted share. Analysts surveyed by FactSet expect $0.71. The company expects net sales for the quarter of $749 million to $764 million. Analysts polled by FactSet expect $798.3 million. </p><p class=\"\">For full-year 2025, the company expects earnings of $3.80 to $4.15 per diluted share on net sales of $3.40 billion to $3.47 billion. Analysts polled by FactSet expect $4.32 and $3.48 billion, respectively. </p><p class=\"\">Shares of the company were 7.4% lower in after-hours activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309462:0/",
            "pub_date": "2025-02-05 06:35:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:68291f4194dbe:0",
            "title": "PayPal Holdings, Inc. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal Holdings, Inc., a leading global payments platform, has released its 2024 Form 10-K report, detailing significant financial growth, strategic initiatives, and the challenges it faces in the evolving digital payments landscape. The report provides a comprehensive overview of the company's performance, strategic direction, and risk management efforts.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Revenues:</strong> $31,797 million, a 7% increase compared to 2023, driven primarily by growth in total payment volume.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $5,325 million, a 6% increase due to net revenues increasing more than operating expenses.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (Loss):</strong> $4,147 million, a 2% decrease due to a decrease in other income (expense), net, driven primarily by net losses on strategic investments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income (Loss) Per Diluted Share:</strong> $3.99, a 4% increase compared to 2023.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments:</strong> PayPal's transaction revenues grew by $2.0 billion, or 7%, in 2024 compared to 2023, driven primarily by increases in revenues from Braintree, core PayPal, and Venmo products and services. Braintree saw the largest increase, contributing approximately $1.3 billion to the growth.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance:</strong> Approximately 37% of PayPal's total payment volume (TPV) in 2024 was generated outside of the U.S., with significant contributions from regions such as Europe and Asia-Pacific. The company continues to expand its global reach, operating in approximately 200 markets worldwide.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sales Units:</strong> PayPal processed 26.3 billion payment transactions in 2024, marking a 5% increase from 2023. The number of active accounts also grew to 434 million, a 2% increase from the previous year.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches:</strong> PayPal expanded its buy now, pay later offerings in the U.S., U.K., France, Germany, and Japan through its Paidy brand, emphasizing the absence of interest or late fees in most geographies.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> PayPal aims to accelerate growth in its branded checkout business by improving user experience and expanding its value proposition for consumers and merchants. The company is also focused on increasing offline engagement through PayPal-branded debit and credit cards and building strategic partnerships to enhance customer experiences.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Receivables Portfolio Management:</strong> PayPal has entered into a multi-year agreement with a global investment firm to sell its eligible consumer installment receivables portfolio, which was amended in December 2024 to extend the commitment period to December 2026 and increase the maximum balance of loans that can be sold. This initiative is part of PayPal's strategy to manage its credit products and liquidity needs effectively.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Capital Management:</strong> PayPal's capital management activities included repurchasing approximately $6.0 billion of its common stock in 2024 under the stock repurchase program authorized in June 2022. As of December 31, 2024, approximately $4.9 billion remained available for future repurchases. Additionally, PayPal maintains a $5.0 billion revolving credit facility, with no borrowings outstanding as of December 31, 2024, providing significant liquidity. The company also issued fixed-rate notes with varying maturity dates, maintaining an aggregate principal amount of $10.6 billion in fixed-rate debt outstanding.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook:</strong> PayPal plans to continue its focus on profitable growth, particularly in its Braintree offerings, and expects lower volume and transaction revenue growth from these offerings in 2025. The company aims to expand the availability of its credit products with capital from external sources, although there is no assurance of success. PayPal's Board of Directors authorized an additional $15.0 billion stock repurchase program in February 2025, indicating a continued commitment to returning value to shareholders.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity and Technology Risks:</strong> The company faces significant risks from evolving cybersecurity threats, including advanced cyberattacks, ransomware, and data breaches. These threats could compromise customer data, damage reputation, and result in regulatory penalties. The company has experienced incidents in the past and anticipates future challenges in this area.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Business Interruptions:</strong> Natural disasters, cyberattacks, and other disruptions could impair the availability of the company's services. The increasing frequency of climate-related events poses additional risks to operations, particularly given the company's headquarters in a seismically active region.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Regulatory and Compliance Risks:</strong> The company is subject to extensive and evolving regulations across multiple jurisdictions, including those related to payments, data protection, and cryptocurrency. Non-compliance could lead to significant fines, operational restrictions, and reputational damage.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cryptocurrency Regulation:</strong> The regulatory landscape for cryptocurrencies is rapidly changing, which could impose additional compliance costs and operational challenges. The company's involvement with stablecoins, such as PayPal USD, introduces further regulatory scrutiny and potential liabilities.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Risks:</strong> The company relies on third-party providers for critical services, which introduces risks related to service disruptions and compliance failures. Any failure by these third parties could negatively impact the company's operations and reputation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Risks:</strong> The company faces intense competition in the global payments industry, which is characterized by rapid technological changes and evolving consumer preferences. Failure to innovate or adapt to these changes could harm the company's competitive position.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Management's Discussion and Analysis:</strong> Management acknowledges the challenges posed by regulatory changes and competitive pressures. The company is investing in technology upgrades and compliance measures to mitigate these risks. Strategic partnerships and acquisitions are also being considered to enhance market position and operational resilience.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Market Risk Disclosures:</strong> The company is exposed to foreign exchange rate fluctuations, which could adversely affect financial results. The management is implementing hedging strategies to mitigate these risks and ensure financial stability.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1633917/000163391725000019/pypl-20241231.htm\" rel=\"nofollow\" target=\"_blank\">PayPal Holdings, Inc. [ PYPL ] - 10-K - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:68291f4194dbe:0-paypal-holdings-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 06:28:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013172:0",
            "title": "FMC Shares Drop on Weak Outlook as Customers Cut Inventory",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul Ziobro</p><p class=\"\">Shares of FMC plunged after the agricultural services company forecast a sharp drop in  profit and sales stemming from customers cutting inventory levels around the world and cautious purchase patterns by end users.</p><p class=\"\">Shares fell 17.1% to $44.81 in late trading, after closing the regular trading session at $54.04. Through Tuesday's close, the stock had been up about 11.2% over the last year.</p><p class=\"\">FMC Chief Executive Pierre Brondeau said that volume growth in the fourth quarter fell below its expectations as customers in many countries aimed to hold significantly less inventory than they have historically.</p><p class=\"\">The challenges will continue into the current quarter, where it projects sales between $750 million and $800 million, a drop of 16% at the midpoint compared to a year ago. Analysts were looking for revenue of $957 million, according to FactSet.</p><p class=\"\">Adjusted per-share earnings are expected between 5 cents and 15 cents. Analysts were looking for 77 cents.</p><p class=\"\">The company expects volume to improve over the course of the year, with an increase in growth portfolio sales offsetting weaker demand in the channel.</p><p class=\"\">But its full-year forecast also came in short of expectations. FMC expects adjusted per-share earnings between $3.26 and $3.70 on revenue between $4.15 billion and $4.35 billion.</p><p class=\"\">Analysts were looking for per-share earnings of $4.35 on revenue of $4.39 billion.</p><p class=\"\">The view came after FMC reported that revenue rose 7% in the fourth quarter. It also swung to a loss, primarily tied to tax incentives in the prior-year period granted to its Swiss subsidiaries. Adjusted earnings of $1.79 a share, meanwhile, topped analyst expectations for $1.60 a share.</p><p class=\"\">Write to Paul Ziobro at paul.ziobro@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013172:0/",
            "pub_date": "2025-02-05 06:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013177:0",
            "title": "AMD's AI Revenue Jumps in 4Q, But Misses Estimates — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Advanced Micro Devices posted higher quarterly revenue thanks to significant growth in its data-center business, but results failed to impress Wall Street, sending the stock lower.</p><p class=\"\">The Santa Clara, Calif., chip maker said Tuesday that sales across its data-center division--which includes its artificial-intelligence chips--jumped 69%, to $3.9 billion, primarily due to the ramp of its Instinct chip. Analysts polled by FactSet were expecting data-center revenue of $4.14 billion.</p><p class=\"\">Shares fell 3.8%, to $114.91, after the bell. The stock is down 29% in the past year, as some analysts and investors have found the AI positioning of its competitors, including Nvidia, as more compelling.</p><p class=\"\">Overall revenue increased 24%, to $7.66 billion, ahead of the $7.53 billion that analysts had modeled.</p><p class=\"\">AMD's client, or personal-computing, revenue rose 58%, to $2.3 billion, driven by what the company called strong demand for its Ryzen processors. The gain was slightly offset by the company's gaming unit, where sales fell 59%, to $563 million, and its embedded segment, down 13%, to $923 million.</p><p class=\"\">During its quarter ended Dec. 28, the company posted a profit of $482 million, or 29 cents a share, compared with $667 million, or 41 cents a share, a year earlier. Adjusted per-share earnings came in at $1.09, narrowly beating the $1.08 that analysts polled by FactSet were expecting.</p><p class=\"\">Chief Executive Lisa Su said there are clear opportunities for the company to continue growing in 2025, citing its product portfolio and growing demand for high-performance and adaptive computing.</p><p class=\"\">For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion, the midpoint of which beat the $7 billion that analysts surveyed by FactSet had forecast.</p><p class=\"\">The company has benefited from robust AI demand, supplying chips used to create and deploy tools that produce human-like text, images and video, but its non-AI offerings have stalled growth. As part of a shift in AMD's broader business strategy towards AI, it said in November that it would reduce its global workforce by 4%, or about 1,040 jobs.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013177:0/",
            "pub_date": "2025-02-05 06:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309460:0",
            "title": "Western Union Q4 Adjusted Earnings, Revenue Increase; Sets 2025 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Western Union  reported Q4 adjusted diluted earnings late Tuesday of $0.40 per share, up from $0.37 a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $0.42. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $1.06 billion, up from $1.05 billion a year ago. </p><p class=\"\">Analysts surveyed by FactSet expected $1.03 billion. </p><p class=\"\">The company set its full-year 2025 guidance of adjusted earnings between $1.75 to $1.85 per share on revenue of $4.12 billion to $4.22 billion. Analysts surveyed by FactSet expect EPS of $1.81 and revenue of $4.20 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309460:0/",
            "pub_date": "2025-02-05 06:28:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0QD:0",
            "title": "The Hanover’s CR improves 5 pts to 89.2% in Q4 as NPW grows 7.4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - The Hanover Insurance Group has reported a 5 point improvement in its combined ratio to 89.2 percent for the fourth quarter, in an earnings beat that also included 7.4 percent net premiums written growth to $1.45bn.</p><p class=\"\">Worcester, Massachusetts-based The Hanover reported operating income of $194.6mn for the fourth quarter of 2024, up from $113.1mn in the prior-year quarter.</p><p class=\"\">The operating income per diluted share of $5.32 beat the $3.36 consensus estimate of eight analysts as per MarketWatch and was up from $3.13 in Q4 2023. </p><p class=\"\">The combined ratio improved to 89.2 percent in the quarter from 94.2 percent in the prior-year quarter.</p><p class=\"\">Catastrophes represented 1.7 points of the combined ratio in Q4 2024 and 4.0 points in the prior-year period, while there was 1.7 points of favourable prior year development compared with 0.6 points in Q4 2023.</p><p class=\"\">The combined ratio excluding catastrophes of 87.5 percent was an improvement from 90.2 percent in the fourth quarter of 2023.</p><p class=\"\">Net premiums written increased 7.4 percent to $1.45bn in the fourth quarter of 2024, from $1.35bn in the same period of last year</p><p class=\"\">The core commercial combined ratio improved to 95.0 percent in the quarter, compared with 96.7 percent in the prior-year quarter. </p><p class=\"\">Core commercial net premiums written were $500.5mn in the quarter, up 7.5 percent from the prior-year quarter.</p><p class=\"\">This consisted of 9.3 percent growth in small commercial and 5.0 percent growth in middle market, which The Hanover said were both sequential accelerations from the third quarter of 2024. </p><p class=\"\">In the fourth quarter, core commercial renewal price increases averaged 11.8 percent, including average rate increases of 9.2 percent. These were both sequential decelerations from the 12.9 percent renewal price increase and 10.0 percent rate increase in Q3 2024.</p><p class=\"\">The Hanover in an investor presentation commented that the core commercial renewal price increases of 11.8 percent were “driven by strong price increases in both property and liability”.</p><p class=\"\">The specialty combined ratio was 81.6 percent, compared to 83.2 percent in the prior-year quarter.</p><p class=\"\">Specialty net premiums written were $331.8mn in the quarter, up 8.8 percent from the prior-year quarter. </p><p class=\"\">In the fourth quarter, specialty renewal price increases averaged 9.5 percent (10.1 percent in Q3 2024), including average rate increases of 6.1 percent (7.6 percent in Q3 2024).</p><p class=\"\">The personal lines combined ratio was 88.1 percent in the fourth quarter of 2024, compared to 97.6 percent in the prior-year quarter. </p><p class=\"\">Personal lines net premiums written were $612.8mn in the quarter, up 6.6 percent compared to the prior-year quarter. The increase was primarily due to the impact of renewal pricing increases and higher new business, The Hanover said.</p><p class=\"\">Personal lines renewal price increases averaged 14.2 percent (15.2 percent in Q3 2024), including average rate increases of 13.1 percent (14.4 percent in Q3 2024). </p><p class=\"\">The renewal price and rate increases in both personal auto and homeowners were all sequential decelerations from Q3 2024. </p><p class=\"\">The Hanover said that personal lines policies in force in the fourth quarter of 2024 decreased 0.6 percent compared to the third quarter of 2024, with a 1.1 percent decline in the Midwestern US, while the rest of the country was essentially flat.</p><p class=\"\">For the full year 2024, The Hanover’s combined ratio was 94.8 percent, compared to 103.5 percent in 2023.</p><p class=\"\">Catastrophe losses were $375.9mn, or 6.4 points of the combined ratio, in 2024, compared to $690.1mn, or 12.2 points, in the prior year. </p><p class=\"\">Net favourable prior-year reserve development, excluding catastrophes, was $67.4mn, or 1.1 points, in 2024, compared to $15.9mn, or 0.3 points, in the prior year.</p><p class=\"\">Total net premiums written were $6.08bn in 2024, up 4.7 percent from 2023, reflecting growth of 6.2 percent in specialty, 4.3 percent in personal lines, and 4.2 percent in core commercial, with The Hanover stating that growth in each segment was impacted by targeted underwriting actions.</p><p class=\"\">\"2024 was an exceptional year for our company, as we delivered excellent financial performance, executed well on our strategic priorities, and continued to invest in innovative tools and technology, further enhancing our strong competitive position and prospects,\" said John Roche, president and CEO at The Hanover. </p><p class=\"\">Roche also highlighted “significant progress in executing our catastrophe mitigation initiatives and delivering on our margin recapture plan”. </p><p class=\"\">“We expect to make continued progress in 2025, while leveraging our targeted growth initiatives throughout the enterprise and capitalizing on emerging opportunities in the marketplace. We continue to operate in firm market conditions and expect strong pricing will enable us to optimize our geographic mix further and achieve broad-based profitability across all segments,” he continued.</p><p class=\"\">In addition, The Hanover’s investor presentation also noted that the impact of catastrophe bookings in January 2025 is expected to be less than $10mn above the January monthly catastrophe plan of $30mn.</p><p class=\"\">“California wildfire activity represents the overwhelming majority of January CATs,” it said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0QD:0-the-hanover-s-cr-improves-5-pts-to-89-2-in-q4-as-npw-grows-7-4/",
            "pub_date": "2025-02-05 06:28:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309465:0",
            "title": "Allied Properties REIT Brief: Williams Cites \"Demand rising in our cities and across our three workspace formats\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309465:0/",
            "pub_date": "2025-02-05 06:28:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309457:0",
            "title": "Finning International Posts Higher Fourth-quarter Profit, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Finning International , after trade Tuesday, said its fourth-quarter adjusted profit rose above expectations on higher revenue. </p><p class=\"\">The company, the world's largest Caterpillar equipment dealer, said adjusted earnings per share, excluding most one-time items, rose to $1.02 from $0.96 last year. FactSet's consensus estimate was $0.87. </p><p class=\"\">Revenue rose 7% to $2.58 billion from $2.40 billion a year prior. FactSet projected $2.49 billion. </p><p class=\"\">\"We exited the year with strong momentum including record Q4 EPS of $1.02 while concurrently generating Q4 free cash flow of $399 million and rebuilding our backlog to a robust $2.6 billion,\" said Chief Executive Kevin Parkes said, adding that the company's focus in 2025 will be on executing its strategy to grow its used, rental, and power businesses to boost returns on invested capital. </p><p class=\"\">The company's shares closed up $0.86 to $36.54 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309457:0/",
            "pub_date": "2025-02-05 06:29:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013192:0",
            "title": "Spectrum Brands Holdings Declares Quarterly Common Stock Dividend of $0.47 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spectrum Brands Holdings Declares Quarterly Common Stock Dividend of $0.47 Per Share</p><p class=\"\">MIDDLETON, Wis.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Spectrum Brands Holdings, Inc.  announced that its Board of Directors today declared a quarterly dividend of $0.47 per share on the Common Stock of the Company. The dividend is payable on March 11, 2025 to shareholders of record as of February 18, 2025.</p><p class=\"\">About Spectrum Brands Holdings, Inc.</p><p class=\"\">Spectrum Brands is a home-essentials company with a mission to make living better at home. We focus on delivering innovative products and solutions to consumers for use in and around the home through our trusted brands. We are a leading supplier of specialty pet supplies, lawn and garden and home pest control products, personal insect repellents, shaving and grooming products, personal care products, and small household appliances. Helping to meet the needs of consumers worldwide, we offer a broad portfolio of market-leading, well-known and widely trusted brands including Tetra(R), DreamBone(R), SmartBones(R), Nature's Miracle(R), 8-in-1(R), FURminator(R), Healthy-Hide(R), Good Boy(R), Meowee!(R), OmegaOne(R), Spectracide(R), Cutter(R), Repel(R), Hot Shot(R), Rejuvenate(R), Black Flag(R), Liquid Fence(R), Remington(R), George Foreman(R), Russell Hobbs(R), BLACK + DECKER(R), PowerXL(R), Emeril Lagasse(R), and Copper Chef(R). For more information, please visit www.spectrumbrands.com. Spectrum Brands — A Home Essentials Company(TM).</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204526511/en/</p><p class=\"\">CONTACT:    Investor/Media Contact:</p><p class=\"\">Joanne Chomiak</p><p class=\"\">608-275-4458</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013192:0/",
            "pub_date": "2025-02-05 06:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013202:0",
            "title": "Prudential Financial Swings to 4Q Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Prudential Financial swung to a loss in the fourth quarter dragged down by lower returns from its U.S. Businesses and Retirement Strategies units.</p><p class=\"\">The Newark, N.J., insurer on Tuesday posted a loss of $57 million, or 17 cents a share, compared with a profit of $1.32 billion, or $3.61 a share, in last year's comparable quarter.</p><p class=\"\">Adjusted per-share earnings came in at $2.96, missing the $3.24 that analysts surveyed by FactSet were expecting.</p><p class=\"\">Assets under management at Prudential's global investment-management business, known as PGIM, increased 6% to $1.375 trillion, driven by net inflows, equity market appreciation and strong investment performance, the company said.</p><p class=\"\">Prudential's U.S. Businesses unit reported adjusted operating income of $860 million, down from $964 million a year earlier, due to higher expenses, lower net fee income and less favorable underwriting results.</p><p class=\"\">Adjusted operating income from its Retirement Strategies arm, which includes both institutions and individuals, fell to $851 million from $890 million.</p><p class=\"\">The company's shares fell 3.2% to $114.21 in post-market trading.</p><p class=\"\">Chief Executive Charles Lowrey said Prudential worked to diversify its product mix and expand its distribution channels in 2024, allowing the company to reach more people around the world. At the same time, it continued to address the growing global retirement opportunity and increased demand for alternative investments, he said.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013202:0/",
            "pub_date": "2025-02-05 06:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013196:0",
            "title": "Nine Energy Service Announces Timing of Fourth Quarter and Full Year 2024 Earnings Release and Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nine Energy Service Announces Timing of Fourth Quarter and Full Year 2024 Earnings Release and Conference Call</p><p class=\"\">HOUSTON--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Nine Energy Service, Inc.  announced today that it has scheduled its fourth quarter and full year 2024 earnings conference call for Thursday, March 6, 2025 at 9:00 am Central Time. During the call, Nine will discuss its financial and operating results for the quarter and full year ended December 31, 2024, which are expected to be released prior to the conference call.</p><p class=\"\">Participants may join the live conference call by dialing U.S. (Toll Free): (877) 524-8416 or International: (412) 902-1028 and asking for the \"Nine Energy Service Earnings Call\". Participants are encouraged to dial into the conference call ten to fifteen minutes before the scheduled start time to avoid any delays entering the earnings call.</p><p class=\"\">For those who cannot listen to the live call, a telephonic replay of the call will be available through March 20, 2025, and may be accessed by dialing U.S. (Toll Free): (877) 660-6853 or International: (201) 612-7415 and entering the passcode of 13751412.</p><p class=\"\">About Nine Energy Service</p><p class=\"\">Nine Energy Service is an oilfield services company that offers completion solutions within North America and abroad. The Company brings years of experience with a deep commitment to serving clients with smarter, customized solutions and world-class resources that drive efficiencies. Serving the global oil and gas industry, Nine continues to differentiate itself through superior service quality, wellsite execution and cutting-edge technology. Nine is headquartered in Houston, Texas with operating facilities in the Permian, Eagle Ford, Haynesville, SCOOP/STACK, Niobrara, Barnett, Bakken, Marcellus, Utica and Canada.</p><p class=\"\">For more information on the Company, please visit Nine's website at nineenergyservice.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204435876/en/</p><p class=\"\">CONTACT:</p><p class=\"\">Nine Energy Service Investor Contact:</p><p class=\"\">Heather Schmidt</p><p class=\"\">Senior Vice President, Strategic Development and Investor Relations</p><p class=\"\">(281) 730-5113</p><p class=\"\">investors@nineenergyservice.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013196:0/",
            "pub_date": "2025-02-05 06:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013200:0",
            "title": "Mexico Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Alfa Series A                  16.91      -0.06      -0.35 <br/>  America Movil Series B         14.66      +0.19      +1.31 <br/>  Cemex Series CPO               12.48      +0.18      +1.46 <br/>  Desarrolladora Homex            0.00       unch       unch <br/>  Fomento Economico Mex         175.86      -0.29      -0.16 <br/>  Gruma Series B                353.19      -5.94      -1.65 <br/>  Grupo Bimbo Series A           54.30      -0.11      -0.20 <br/>  Grupo Carso Series A1         117.13      -1.67      -1.41 <br/>  Gpo Financiero Banorte O      147.67      +4.47      +3.12 <br/>  Grupo Mexico Series B         103.41      +1.82      +1.79 <br/>  Grupo Televisa                  8.16      +0.26      +3.29 <br/>  Organizacion Soriana B         29.91      +0.73      +2.50 <br/>  Wal-Mart de Mexico             55.06      +1.34      +2.49 <br/>These prices are based on the official close price from the exchange. <br/>Prices in pesos. <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013200:0/",
            "pub_date": "2025-02-05 06:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSfb3t9a:0",
            "title": "Bluewater Launches Strategic Division to Transform Modern Marketing Challenges Into Growth Opportunities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CLEARWATER, FLORIDA / ACCESS Newswire / February 4, 2025 / Bluewater, the fully converged direct marketing powerhouse, has launched a Brand Strategy division, combining top marketing veterans to help brands navigate today's complex media landscape and challenges. This expansion reinforces Bluewater's dedication to cutting through the noise with comprehensive marketing solutions.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1069.4183864915572px;aspect-ratio:1.7823639774859288\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSfb3t9a-ee5f24a3c92bc492393bd71bcbe2a8dd-resized.webp\" type=\"images/webp\"/><img alt=\"Bluewater Brand Strategy\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACSfb3t9a-ee5f24a3c92bc492393bd71bcbe2a8dd-resized.jpeg\" style=\"background-color:#6d5b59\"/></picture></div></figure></span></p><strong class=\"root-Tkn6WL2y\">Bluewater Brand Strategy</strong><p class=\"\">The new division represents a significant enhancement of Bluewater's capabilities, combining decades of expertise in brand development, marketing strategy, and revenue optimization and business growth. This initiative addresses the growing challenges brands face in reaching and engaging consumers across multiple platforms while managing rising customer acquisition costs.</p><p class=\"\">\"In today's rapidly evolving marketing landscape, brands need more than just tactical execution - they need strategic partners who can drive sustainable growth,\" said Gina Pomponi, President and COO of Bluewater Media. \"Bluewater's assembled some of the smartest minds in the industry, bringing together leaders whose collective experience spans global brands, direct-to-consumer marketing, and omnichannel strategy. This powerhouse team represents the best strategic thinking in the business, and their proven track records in delivering transformative results for major brands speaks volumes about the value they bring to our clients.\"</p><p class=\"\">The division is led by three accomplished industry veterans: Priya Ghai, a transformative global business executive who specializes in building recurring revenue streams and introducing major corporations to direct-to-consumer channels; Bernadette Abasta, a marketing operations pioneer known for optimizing performance and operational efficiencies across both agency and client-side roles; and Lindsay Hendricks, an award-winning strategist whose innovative omnichannel campaigns have earned industry recognition, including two Digiday award nominations in 2023.</p><p class=\"\">Each leader brings distinctive expertise to Bluewater's clients. Ghai's extensive experience includes leading at direct-to-consumer pioneer Guthy Renker as Managing Director, India, and later leveraging this DTC and subscription model expertise to transform traditional retail brands like Philips North America and Walgreens Boots Alliance into omnichannel powerhouses, achieving triple-digit growth through innovative direct-response strategies. Abasta has established herself as an authority in media analysis and marketing operations, having driven significant revenue growth through her expertise in backend optimization and operational excellence. Throughout her career, she has consistently delivered operational efficiencies while maintaining high performance standards across both agency and client-side roles. Hendricks has developed breakthrough strategies for major brands including Bed, Bath &amp; Beyond, National Debt Relief, Worx Tools, and TurboTax, consistently delivering elevated ROAS and year-over-year revenue growth through data-driven insights and innovative market approaches.</p><p class=\"\">The strategic division enhances Bluewater's existing strengths in research, creative, production, media, digital commerce, and analytics, offering clients a truly integrated approach to modern marketing challenges. This expansion aligns with Bluewater's vision of breaking down silos between marketing disciplines to deliver more effective, data-driven campaigns that drive measurable results and growth.</p><p class=\"\">\"Today's marketing environment demands more sophisticated, integrated approaches,\" said CEO, Andy Latimer. \"With the formation of this strategic division, we're not just responding to current market challenges - we're positioning our clients for sustainable growth in an increasingly complex landscape. This team's combined expertise in global markets, brand development, and performance marketing provides our clients with unparalleled strategic guidance.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Madeleine Sky</p><p class=\"\"><em>Director, Marketing &amp; Operations</em></p><p class=\"\">msky@bluewater.tv</p><p class=\"\">(813) 944-2926</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Bluewater</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSfb3t9a:0/",
            "pub_date": "2025-02-05 06:30:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463546:0",
            "title": "Ichigo to Build New Sapporo Office Building",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ichigo  is developing The Village Sapporo, an office building in Hokkaido set for completion in April 2026, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The building, located near major transit hubs and directly connected to the Chi-Ka-Ho underground walkway, will include office and retail space. </p><p class=\"\">The project features seismic reinforcement exceeding current standards, a 72-hour emergency power supply, and aims for environmental certifications such as CASBEE Sapporo A Rank and ZEB Oriented. </p><p class=\"\">Ichigo is working with SoftBank to incorporate digital infrastructure. </p><p class=\"\">WeWork Japan will open its first Hokkaido office in the building, providing flexible workspace. The development is part of Ichigo's Village series, following similar projects in Tokyo's Monzen Nakacho and Akasaka.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463546:0/",
            "pub_date": "2025-02-05 06:30:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013101_20250204013101:0",
            "title": "Mitchell Services Target Price Cut 9.1% to A$0.50/Share by Morgans>MSV.AU",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013101_20250204013101:0/",
            "pub_date": "2025-02-05 06:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013096:0",
            "title": "IPC Indice de Precios Y Cotizaciones Ends 1.33% Higher at 51889.75 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The IPC Indice de Precios Y Cotizaciones is up 680.22 points or 1.33% today to 51889.75</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one-day point gain since Monday, Dec. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Largest one-day percentage gain since Tuesday, Dec. 31, 2024</li><li class=\"listItem-bmN0_SHH\">Up nine of the past 11 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.62% from its record close of 58711.87 hit Wednesday, Feb. 7, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the second highest this year</li><li class=\"listItem-bmN0_SHH\">Off 11.62% from its 52-week high of 58711.87 hit Wednesday, Feb. 7, 2024</li><li class=\"listItem-bmN0_SHH\">Up 6.25% from its 52-week low of 48837.72 hit Monday, Dec 30, 2024</li><li class=\"listItem-bmN0_SHH\">Down 11.57% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.31% from its 2025 closing high of 52050.25 hit Thursday, Jan 30, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.99% from its 2025 closing low of 48957.24 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 2376.48 points or 4.80%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013096:0-ipc-indice-de-precios-y-cotizaciones-ends-1-33-higher-at-51889-75-data-talk/",
            "pub_date": "2025-02-05 06:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013097:0",
            "title": "Bovespa Index Ends 0.65% Lower at 125147.42 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bovespa Index is down 823.04 points or 0.65% today to 125147.42</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one-day point and percentage decline since Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Down for three consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 1765.36 points or 1.39% over the last three trading days</li><li class=\"listItem-bmN0_SHH\">Largest three-day point and percentage decline since Friday, Jan. 10, 2025</li><li class=\"listItem-bmN0_SHH\">Down eight of the past 10 trading days</li><li class=\"listItem-bmN0_SHH\">Off 8.88% from its record close of 137343.96 hit Wednesday, Aug. 28, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 8.88% from its 52-week high of 137343.96 hit Wednesday, Aug. 28, 2024</li><li class=\"listItem-bmN0_SHH\">Up 5.58% from its 52-week low of 118532.68 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Down 4.04% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.39% from its 2025 closing high of 126912.78 hit Thursday, Jan 30, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.58% from its 2025 closing low of 118532.68 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 4864.02 points or 4.04%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013097:0-bovespa-index-ends-0-65-lower-at-125147-42-data-talk/",
            "pub_date": "2025-02-05 06:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001767:0",
            "title": "AMD Stock Falls on Disappointing Revenue for Data Center Chips — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tae Kim</p><p class=\"\">AMD reported better-than-expected earnings results Tuesday afternoon. Its shares wavered in after-hours trading.</p><p class=\"\">The semiconductor company reported fourth-quarter adjusted earnings per share of $1.09, compared to Wall Street's consensus estimate of $1.08, according to FactSet. Revenue came in at $7.7 billion, which was above analysts' expectations of $7.5 billion.</p><p class=\"\">AMD forecast sales in the current quarter to a range with $7.1 billion at the midpoint versus the $7 billion analysts' estimate.</p><p class=\"\">AMD shares initially rose as much as 3% in after-hours trading following the re lease but then traded down as much as 3%.</p><p class=\"\">This is breaking news. Read a preview of AMD earnings below and check back for more analysis soon.</p><p class=\"\">The outlook for revenue will be investors' focus when Advanced Micro Devices reports its fourth-quarter earnings after the close Tuesday.</p><p class=\"\">The consensus forecast among analysts is that AMD will report December quarter revenue of $7.5 billion with adjusted earnings per share of $1.08. For the current quarter, the consensus call is that revenue will be $7.0 billion and earnings per share will come in at 95 cents, according to FactSet.</p><p class=\"\">On Friday, Keybanc analyst John Vinh reaffirmed an Overweight rating and $150 price target for AMD. The analyst warned, however, the company's near-term outlook may not impress shareholders.</p><p class=\"\">\"We expect AMD to post in line to higher results and lower guidance,\" he wrote. \"We see NT [near term] risk to forward guidance.\"</p><p class=\"\">The analyst cited softer laptop shipments and the potential for weaker demand for server processors for the potentially weak guidance.</p><p class=\"\">Last week, Intel, AMD's main chip rival, gave a softer-than-expected outlook for its March quarter, citing a weakening global economy. It said some buying that might have happened in the current quarter moved forward to the December quarter as investors sought to prepare for potential tariffs under the Trump administration.</p><p class=\"\">AMD shares are down 36% over the past 12 months, compared to the 8% gain for the iShares Semiconductor ETF.</p><p class=\"\">Write to Tae Kim at tae.kim@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001767:0/",
            "pub_date": "2025-02-05 06:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}