{
    "data": [
        {
            "id": "DJN_DN20250204000961_20250204001292:0",
            "title": "Mitsubishi Electric Raises FY Revenue Forecast to Y5.40T From Y5.39T Previously >6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001292:0/",
            "pub_date": "2025-02-04 14:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000839:0",
            "title": "Infineon Lifts Sales Guidance After Boost From AI Chips",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mauro Orru</p><p class=\"\">Infineon Technologies raised its sales forecasts for the fiscal year amid solid demand for chips to power servers and data centers behind the artificial-intelligence boom.</p><p class=\"\">The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros ($15.94 billion) it reported for fiscal 2024. Infineon had previously forecast a slight decline. Meanwhile, Infineon's segment result margin--a key profitability measure--is still expected in the mid-to-high-teens percentage range.</p><p class=\"\">The upgrade comes after what Infineon called a slightly better start to the fiscal year than expected amid a boost in semiconductors sales for servers and data centers to power AI. However, areas of the semiconductor industry outside of artificial intelligence continue to suffer from sluggish demand.</p><p class=\"\">Infineon posted 3.42 billion euros in sales in the three months to the end of December, down 8% on year. Net profit declined to 246 million euros from 587 million euros, while its segment result contracted to 573 million euros from 831 million euros, generating a 16.7% margin.</p><p class=\"\">Analysts had forecast quarterly sales of nearly 3.23 billion euros, a net profit of 252 million euros, a segment result of 477 million euros and a 14.8% margin, according to a Vara Research consensus.</p><p class=\"\">For the current quarter, Infineon is expecting sales of around 3.6 billion euros and a segment result margin in the mid-teens percentage range.</p><p class=\"\">Write to Mauro Orru at mauro.orru@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000839:0/",
            "pub_date": "2025-02-04 14:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:7e0c665f7094b:0",
            "title": "Bitcoin lingers below $100,000 as China announces retaliatory tariffs on US imports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitcoin is flirting with the $99,300 level after China announced retaliatory tariffs on certain U.S. goods.</p><p class=\"\">On Tuesday, China’s finance ministry said that starting Feb. 10, it will impose an additional 15% tariff on coal and liquefied natural gas and an additional 10% on crude oil, agricultural machinery and certain vehicles.</p><p class=\"\">China’s tariff announcement comes after the additional U.S. tariffs on Chinese goods took effect today. “The U.S.' unilateral imposition of tariffs severely violates the rules of the World Trade Organization,” the Chinese ministry said in a translated statement.</p><p class=\"\">Meanwhile, China’s Ministry of Commerce announced on Tuesday that it will tighten export controls on products containing tungsten, tellurium, bismuth, molybdenum, and indium, citing the need to safeguard national interests and security.</p><p class=\"\">Bitcoin is currently trading at around $99,300 after dipping to around $98,500 at one stage today and recovering from $92,800 on Monday amid a broader sell-off.</p><p class=\"\">The world’s largest cryptocurrency saw a sharp rebound to above $100,000 on Monday after U.S. President Donald Trump said the tariff threats between the U.S. and Mexico were put on pause for the next month.</p><p class=\"\">“While bitcoin is often discussed as a digital alternative to gold, it is still largely perceived as a risk asset by many investors. As such, China’s retaliatory 10% tariff on the U.S. is likely to put pressure on risk assets, including crypto, much like equities,” Min Jung, research analyst at Presto Research, told The Block.</p><p class=\"\">“However, as seen in today’s V-shaped recovery before the announcement, the initial market reaction may have been an overreaction,” Jung added. “The longer-term impact will depend on whether this marks the beginning of a broader trade escalation or remains a one-off event. That said, we expect volatility to remain elevated as tariff-related headlines continue to drive market sentiment.”</p><p class=\"\">Justin d'Anethan, head of sales at Liquifi, said that while initial market jitters were tied to Trump’s tariffs on Mexico and Canada, it’s “becoming clear that those were just opening shots — the real escalation is happening with China, and potentially Europe next.”</p><p class=\"\">“An escalation into a trade war will further deepen a sell-off of crypto assets unless the US can negotiate a cancellation or postponement like with Canada and Mexico,” said Nick Ruck, director of LVRG Research.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:7e0c665f7094b:0-bitcoin-lingers-below-100-000-as-china-announces-retaliatory-tariffs-on-us-imports/",
            "pub_date": "2025-02-04 14:51:01",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0B9:0",
            "title": "Australian shares surrender gains after U.S.-China trade war kicks offs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">ASX 200 trims gains to end flat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump imposes new levies on China</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Global trade war escalates as China hits back</li></ul></span></div><span><p class=\"\">    Australian shares lost all their gains and ended slightly lower on Tuesday after China slapped tariffs on U.S. imports in a tit-for-tat move that realised fears of a trade war between the world's largest economy and Australia's biggest export market.</p><p class=\"\">The S&amp;P/ASX 200 index  gained as much as 0.8% earlier in the session after U.S. President Donald Trump's decision to delay tariffs on Mexico and Canada for a month.</p><p class=\"\">However, the benchmark settled 0.1% lower at 8,374 points after Trump did not afford a similar leniency to China, which is Australia's largest trading partner.</p><p class=\"\">Nonetheless, local miners , which have a roughly 25% weightage on the benchmark and are heavily exposed to China, rallied 1.1% after sinking as much as 1.9% in the previous session.</p><p class=\"\">BHP Group , the world's largest listed miner, and sector heavyweight Fortescue  rose 0.7% and 1.8% respectively.</p><p class=\"\">\"The heavyweight banking and mining sector has been supported by dip buyers taking advantage of yesterday's knock down in prices,\" said Tony Sycamore, an analyst at IG Markets.</p><p class=\"\">Banks  reversed gains of 0.9% to end 0.2% lower, with the \"Big Four\" banks dipping between 0.1% and 0.3%.</p><p class=\"\">Gold miners  rose 1.6% to a three-month high, tracking gains in bullion prices.</p><p class=\"\">Predictive Discovery  and ASX-listed shares of SSR Mining  topped gains on the sub-index, adding 13.2% and 7.7%, respectively.</p><p class=\"\">Tech stocks  closed 1.5% higher, tracking the early jump in futures of tech-heavy Nasdaq. </p><p class=\"\">WiseTech Global  and NEXTDC  added 3.6% and 1.4%, respectively.</p><p class=\"\">Energy stocks  slipped 0.7% after oil prices retreated. Oil producers Ampol  and Viva Energy  topped losses on the sub-index, losing over 1.5% each.</p><p class=\"\">Across the Tasman Sea, New Zealand's benchmark S&amp;P/NZX 50 index  advanced 0.7% to close at 12905.04 points.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0B9:0-australian-shares-surrender-gains-after-u-s-china-trade-war-kicks-offs/",
            "pub_date": "2025-02-04 14:51:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463253:0",
            "title": "Hong Kong Urban Renewal Authority Offers Lower Compensation for Second Redevelopment Project in Kowloon City",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's Urban Renewal Authority lowered the compensation rate for eligible property owners at its second redevelopment project in Kowloon City. </p><p class=\"\">The city's redevelopment agency proposed to offer HK$15,385 per square foot for the Kau Pui Lung Road/Chi Kiang Street Development Scheme Plan. </p><p class=\"\">The amount is lower than the HK$19,848 per square foot offered at the Shing Tak Street/Ma Tau Chung Road Development Project proposed in 2021. </p><p class=\"\">URA's two projects are under the Civil Servants' Co-operative Building Society Scheme. </p><p class=\"\">Under the redevelopment scheme, the government will dissolve cooperative building society schemes, modify government leases, assign apartments to CBS members, and set up owner corporations, the URA said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463253:0/",
            "pub_date": "2025-02-04 14:51:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3O506L:0",
            "title": "Honda Has Floated Idea Of Turning Nissan Into A Subsidiary, Public Broadcaster NHK Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">HONDA HAS FLOATED IDEA OF TURNING NISSAN INTO A SUBSIDIARY, PUBLIC BROADCASTER NHK SAYS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">HONDA PROPOSAL HAS BEEN MET WITH STRONG OPPOSITION FROM WITHIN NISSAN, NHK SAYS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3O506L:0-honda-has-floated-idea-of-turning-nissan-into-a-subsidiary-public-broadcaster-nhk-says/",
            "pub_date": "2025-02-04 14:51:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001294:0",
            "title": "Mitsubishi Electric Maintains FY Forecasts for Other Earnings>6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001294:0/",
            "pub_date": "2025-02-04 14:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463224:0",
            "title": "Riyad Bank's Planned Dividend Tops Expectations as Lower Provisions Support 2024 Earnings Boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Riyad Bank (SASE:1010) on Monday recommended a bigger shareholder payout after an 8.7% jump in operating income coupled with a 17.2% decline in provisions led to a surge in net profit for the full-year 2024. </p><p class=\"\">The lender proposed to distribute a cash dividend of 0.9 Saudi riyal per share for the second half of 2024, higher than the payment of 0.75 riyal per share a year ago. This translates to an annual per-share dividend of 1.7 riyals per share, which surpassed the 1.4 riyals per share distributed in 2023 and the expectation of 1.58 riyals by analysts polled by FactSet. </p><p class=\"\">Backing the payout is Riyad Bank's net profit for the 12 months ended Dec. 31, 2024, which climbed year over year to 9.32 billion riyals from 8.05 billion riyals while profit per share moved to 3.01 riyals from 2.58 riyals. The earnings surpassed the FactSet consensus estimates of 9.09 billion riyals or 2.96 riyals per share. </p><p class=\"\">Meanwhile, the Saudi Arabia-listed bank's total operations profit zoomed up to 17.28 billion riyals, from 15.9 billion riyals earlier and the expected 16.92 billion riyals. </p><p class=\"\">Additionally, Riyad Bank's assets gained 16.4% to 450.38 billion riyals while investments climbed 19.9% to 69.67 billion riyals. Loans and advances jumped 16.7% to 320.09 billion riyals and deposits gained 20.2% to 306.42 billion riyals. </p><p class=\"\">Meanwhile, provisions for expected credit and other losses dropped to 1.63 billion riyals from 1.97 billion riyals.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463224:0/",
            "pub_date": "2025-02-04 14:52:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0IT:0",
            "title": "Evolution, Whitbread, Young & Co's Brewery",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Securities analysts revised their ratings and price targets on several European companies, including Evolution, Whitbread and Young &amp; Co's Brewery on Tuesday. </p><p class=\"\">HIGHLIGHTS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Breedon Group Plc : HSBC raises target price to 548p from 540p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Evolution : Berenberg cuts target price to SEK 785 from SEK 910    </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Jet2 Plc : Jefferies raises target price to 2,200p from 1,800p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Whitbread : Jefferies cuts target price to 3500p from 3600p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Young &amp; Co's Brewery Plc : JP Morgan raises to overweight from neutral            </p></li></ul><p class=\"\">Following is a summary of research actions on European companies reported by Reuters on Tuesday. Stock entries are in alphabetical order. </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Accor : Jefferies raises target price to EUR 55 from EUR 52</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* AXA : Berenberg raises target price to EUR 46 from EUR 41.5</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Breedon Group Plc : HSBC raises target price to 548p from 540p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Dalata Hotel Group Plc : Jefferies raises target price to EUR 5.10 from EUR 4.70</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Evolution : Berenberg cuts target price to SEK 785 from SEK 910</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Foresight Group Holdings Ltd : Peel Hunt cuts target price to 480p from 490p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Galderma Group AG : JP Morgan raises target price to CHF 120 from CHF 105</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Jet2 Plc : Jefferies raises target price to 2,200p from 1,800p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Julius Baer Gruppe AG : RBC cuts target price to CHF 65 from CHF 70</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Schaeffler AG : HSBC cuts target price to EUR 6.4 from EUR 8.8</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Whitbread : Jefferies cuts target price to 3500p from 3600p</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Wiit SpA : Berenberg initiates coverage with buy rating; price target EUR 23</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">* Young &amp; Co's Brewery Plc : JP Morgan raises to overweight from neutral</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0IT:0-evolution-whitbread-young-co-s-brewery/",
            "pub_date": "2025-02-04 14:53:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463251:0",
            "title": "Sumitomo Chemical Turns to Profit in Nine Months Ended December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sumitomo Chemical  recorded an attributable net income of 28.6 billion yen for the nine months ended Dec. 31, 2024, compared with an attributable loss of 109.8 billion yen in the year-ago period, a Monday Hong Kong bourse filing said. </p><p class=\"\">Basic earnings per share stood at 17.47 yen in the three quarters, while the company incurred a loss per share of 67.13 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The chemical company's sales revenue rose by 5.4% year over year to 1.905 trillion yen in the period from 1.807 trillion yen a year prior. </p><p class=\"\">The company forecasts an attributable net income of 25 billion yen, a basic EPS of 15.28 yen, a sales revenue of 2.600 trillion yen, and a total dividend of 9 yen per share for the year ending March 31. </p><p class=\"\">Shares of the company were up over 4% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463251:0/",
            "pub_date": "2025-02-04 14:53:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OU094:0",
            "title": "Fiji leader to press Pacific Islands concerns in Washington after U.S. aid frozen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. aid freeze impacts Pacific Islands' clean energy, cooking, water projects</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Pacific aid organisations unable to pay staff</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. aid cuts risks losing influence to China, analysts warn</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China is second-largest donor to Pacific Islands after Australia</li></ul></span></div><span><p class=\"\">    Fiji's Prime Minister Sitiveni Rabuka will attend a presidential prayer breakfast in Washington on Thursday, the first opportunity for a Pacific Islands leader to press the region's aid and climate priorities with the Trump Administration.</p><p class=\"\">Community groups across the Pacific Islands, one of the world's most aid reliant regions, are scrambling to find ways to pay staff after U.S. funding was frozen, organisations in Fiji said.</p><p class=\"\">Analysts warn U.S. aid cuts targeting clean energy risk damaging the United States ability to compete with China in the strategic region, where almost half of pledged aid is climate related.</p><p class=\"\">China is the second-biggest bilateral donor to the Pacific Islands after Australia, a Lowy Institute report on aid to the region found in November.</p><p class=\"\">The U.S. State Department last week gave \"clean energy programs for women in Fiji\" as an example of aid that did not make America stronger, in a statement announcing a blanket aid freeze.</p><p class=\"\">The program singled out is run by the Fiji office of the Pacific Community, the Pacific's largest intergovernmental organisation, Reuters has confirmed, and provides families with access to cooking and water in a region where 65% of the population don't have electricity. </p><p class=\"\">The Pacific Community reports to 27 Pacific Island governments and declined to comment. </p><p class=\"\">Documents show it received $1.5 million from the U.S. State Department for energy programs targeting women, including giving families biogas fuel stoves for cooking meals on remote atoll nations such as Tuvalu, and solar technology for water pumps.</p><p class=\"\">Most Pacific Islands import energy at high cost, so renewable energy is needed to provide basic services to villages, said Meg Keen, the head of Pacific Research at the Australian National University.</p><p class=\"\">The region's top donor Australia requires gender goals in all aid grants over AU$3 million.    </p><p class=\"\">\"Women are the ones who are working to find food, we are the ones who go further to find water, so anything we do on climate change and disaster response has to be gender responsive,\" said Noelene Nabulivou, a climate activist and feminist who runs the independently-funded DIVA for Equality in Fiji.</p><p class=\"\">Nabulivou said she is getting calls from women's groups across the Pacific who can't pay staff because of the U.S. aid freeze. A permanent bar on women's projects will \"will have massive impacts in the region,\" she said.</p><p class=\"\">U.S. SOFT POWER AT RISK</p><p class=\"\">The U.S. provides 8% of aid into the Pacific, and although island states could turn to other donors, cuts to U.S. aid would undermine U.S. security goals, Keen said.</p><p class=\"\">\"The whole point of the United States coming back into the region was for soft power and influence and this is not going to help\", she said.</p><p class=\"\">Fiji is indebted to Chinese state banks after decades of infrastructure lending, and was a focus of the former Biden Administration's efforts to compete with China, which is pressing for a greater security role in the Pacific Islands.</p><p class=\"\">The U.S. Agency for International Development (USAID) re-opened its Pacific office in Fiji last October after a decades-long absence, as Washington sought to bolster defence ties with Fiji to counterbalance China's influence in the region.</p><p class=\"\">Billionaire Elon Musk, who has been tasked by U.S. President Donald Trump with downsizing the federal government, announced this week that USAID would be shut down. </p><p class=\"\">Rabuka's office said he would meet with Republican senators Mike Lee and Kevin Cramer in Washington as well as attending the prayer breakfast, where Trump is expected to give a speech.</p><p class=\"\">A Fiji government statement said Rabuka will advocate for an \"Ocean of Peace\", referring to Fiji's policy opposing an arms race in the Pacific.</p><p class=\"\">\"I look forward to discussing issues of common interest not only for Fiji but also the wider Pacific region,\" Rabuka said in the statement.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OU094:0-fiji-leader-to-press-pacific-islands-concerns-in-washington-after-u-s-aid-frozen/",
            "pub_date": "2025-02-04 14:54:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463252:0",
            "title": "Infineon Technologies Logs Lower Fiscal Q1 Attributable Profit, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Infineon Technologies  said Tuesday its profit and revenue for the fiscal first quarter decreased year over year. </p><p class=\"\">Profit attributable to shareholders and hybrid capital investors for the three months ended Dec. 31, 2024, was 246 million euros, compared with 587 million euros earlier. EPS moved to 0.18 euro from 0.44 euro. </p><p class=\"\">The German semiconductor company's revenue was 3.42 billion euros, compared with 3.70 billion euros a year ago. </p><p class=\"\">Analysts polled by FactSet were expecting 3.22 billion euros in sales, 313 million euros in net income, and 0.27 euro in EPS. </p><p class=\"\">For the fiscal second quarter, the company expects revenue of 3.6 billion euros. Meanwhile, Infineon raised its forecast for the full fiscal 2025 and now expects revenue to either be flat or slightly higher than a year ago, compared with previous guidance of a slight decline.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463252:0/",
            "pub_date": "2025-02-04 14:54:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:88889956d094b:0",
            "title": "Power Grid shares decline over 1% after firm's Q3 net profit falls 4% to Rs 3,862 crore",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Power Grid Corporation of India shares fell over 1 percent in morning trade on February 4, a day after the company reported a strong decline of over 4 percent in Q3 net profit.</p><p class=\"\">Power Grid Corporation of India shares were trading at Rs 279.60 apiece, as seen at 9:45 am. This marks a decline of 1.48 percent from the previous closing price.</p><p class=\"\">Read about Stock Market updates LIVE</p><p class=\"\">The state-owned Power Grid Corporation of India released its earnings performance results for the quarter ended December in the post market hours of February 3. Its net profit declined 4 percent year-on-year to Rs 3,862 crore. The company had earlier recorded a net profit of Rs 4,028 crore in the corresponding quarter of the previous financial year.</p><p class=\"\">Its revenue from operations stood at Rs 11,550 crore in Q3, marking a 3 percent rise from Rs 11,233 crore reported in Q3 of the preceding fiscal. The company's overall income decreased 1 percent to Rs 11,743 crore in Q3, as against Rs 11,819.7 crore in the corresponding period of FY24.</p><p class=\"\">At the operating level, the company's EBITDA decreased by 4 percent year-on-year to Rs 10,048.01 crore in the third quarter of this fiscal. The corresponding period of the previous fiscal saw EBITDA at Rs 10,482.8 crore. EBITDA margin for Q3 was at 86 percent, as against 89 percent year-ago.</p><p class=\"\">A slowdown in India's economy has dampened the growth in power demand. In the second half of 2024, power generation accounted for just about a quarter of the total growth seen in the first half of the year. From October to December 2024, India's power generation grew by only 3 percent, marking a sharp decline when compared to the 12 percent growth during the same period in 2023. Overall, the power generation growth in 2024 marked the slowest pace since the COVID-19 pandemic.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:88889956d094b:0-power-grid-shares-decline-over-1-after-firm-s-q3-net-profit-falls-4-to-rs-3-862-crore/",
            "pub_date": "2025-02-04 14:46:24",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CI:0",
            "title": "Unicaja Sees 2025 NII Above 1.40 Bln Euros",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unicaja Banco SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES 2025 NII ABOVE 1.40 BILLION EUROS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES CET1 FULLY LOADED ABOVE 14% THROUGHOUT 2025-2027 PERIOD</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES SHAREHOLDER REMUNERATION ACUMULATED PROFIBILITY IN 2025-2027 ABOVE 40%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES ACCUMULATED SHAREHOLDER REMUNERATION (% OF ACCUMULATED NET RESULT OF 2025-2027) ABOVE 85%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CI:0-unicaja-sees-2025-nii-above-1-40-bln-euros/",
            "pub_date": "2025-02-04 14:46:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV00E:0",
            "title": "Mutakamela Insurance FY Profit At 15.2 Mln Riyals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MUTAKAMELA INSURANCE CO :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">MUTAKAMELA INSURANCE FY INSURANCE REVENUE 873.9 MILLION RIYALS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MUTAKAMELA INSURANCE FY NET PROFIT ATTRIBUTABLE 15.2 MILLION RIYALS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV00E:0-mutakamela-insurance-fy-profit-at-15-2-mln-riyals/",
            "pub_date": "2025-02-04 14:46:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463250:0",
            "title": "Coloplast Posts Lower Fiscal Q1 Profit; Revenue Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coloplast (COLO-B.CO) said Tuesday that profit for the first quarter of fiscal 2025 declined, while revenue increased year over year. </p><p class=\"\">Profit for the three months ended Dec. 31, 2024, was 1.04 billion Danish kroner, compared with 1.21 billion kroner earlier. EPS moved to 4.63 kroner from 5.39 kroner. </p><p class=\"\">The Danish medical device company's revenue was 7.03 billion kroner, compared with 6.61 billion kroner a year ago. </p><p class=\"\">Analysts polled by FactSet were expecting 7.04 billion kroner in sales, 1.28 billion kroner in net income, and 5.78 kroner in EPS. </p><p class=\"\">Looking ahead, the company downgraded its expectations for its organic growth for fiscal 2025 to 7%, compared with the previous guidance of 8% to 9%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463250:0/",
            "pub_date": "2025-02-04 14:46:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU1VQ:0",
            "title": "Unicaja's books 122 mln euro profit in Q4 vs 19 mln euro loss in 2023",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spain's Unicaja  on Tuesday reported a net profit of 122 million euros ($125.57 million) in the fourth against a loss of 19 million euros in the same period in 2023 when it set aside higher provisions to clean up its real estate loan portfolio.</p><p class=\"\">In the September to December period, new loan growth  somewhat offset pressure from lower interest rates on financial margins. Analysts expected net profit would come in at 142 million euros.</p><p class=\"\">($1 = 0.9079 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU1VQ:0-unicaja-s-books-122-mln-euro-profit-in-q4-vs-19-mln-euro-loss-in-2023/",
            "pub_date": "2025-02-04 14:46:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001257:0",
            "title": "Mitsubishi Electric 3Q Business Platform Segment Operating Profit Y2.7B, Up Y1.3B on Year>6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001257:0/",
            "pub_date": "2025-02-04 14:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001261:0",
            "title": "KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">KKR raised its tender-offer price for Japanese software company Fuji Soft in an attempt to end the takeover battle with rival Bain Capital.</p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\">Foreign private-equity firms like KKR and Bain Capital have been riding a growing wave of Japanese mergers and acquisitions in recent years as big companies spin off noncore businesses or managements opt to leave the public market.</p><p class=\"\">KKR said in a regulatory filing Tuesday that it decided to raise the tender-offer price to 9,850 yen a share, equivalent to $63.64, from Y9,451 previously. KKR will also extend the tender-offer period through Feb. 19, it said.</p><p class=\"\">Bain Capital has said it planned to start a tender offer for Fuji Soft at Y9,600 a share once certain conditions are met.</p><p class=\"\">Fuji Soft's shares have remained above KKR's previous tender-offer price for the past couple of months. The stock ended 1.9% higher at Y9,990 on Tuesday.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001261:0/",
            "pub_date": "2025-02-04 14:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463244:0",
            "title": "Nikkei Ends Higher as Markets Eye US-China Trade Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japanese shares edged higher on Tuesday, tracking Wall Street gains after Washington delayed tariffs on Mexico and Canada, easing investor nerves ahead of a China-US trade call. </p><p class=\"\">The Nikkei 225 rose 0.72%, or 278.28 points, to close at 38,798.37. </p><p class=\"\">U.S. President Donald Trump said trade talks with China were set to happen \"probably over the next 24 hours,\" raising hopes of a last-minute reprieve on a 10% tariff due early Tuesday. He warned that without a deal, tariffs would be \"very, very substantial.\"</p><p class=\"\">In corporate moves, Takashima &amp; Co.  took full control of Sanwa Holdings  and its 14 affiliates, according to a Monday filing. Sanwa, founded in 2019, sells and installs solar power systems. </p><p class=\"\">Kyocera  reported a 79.7% slump in attributable profit to 18.3 billion yen for the nine months to Dec. 31, hit by weak factory utilization and higher taxes. Basic EPS fell to 13.01 yen, while sales were little changed at 1.492 trillion yen. </p><p class=\"\">ASKA Pharmaceutical  will lift its stake in Vietnam's Ha Tay Pharmaceutical (HNX:DHT) to 40% from 39.9%, making it a subsidiary. The deal, set to close in February, aligns with ASKA's push into Southeast Asia.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463244:0-nikkei-ends-higher-as-markets-eye-us-china-trade-call/",
            "pub_date": "2025-02-04 14:47:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000961_20250204001264:0",
            "title": "Mitsubishi Electric 3Q Semiconductor & Device Segment Operating Profit Y8.4B, Up Y0.5B on Year >6503.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000961_20250204001264:0/",
            "pub_date": "2025-02-04 14:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV06J:0",
            "title": "Germany's Siltronic posts annual preliminary sales in line with market view",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German semiconductor materials supplier Siltronic  reported a 7% drop in its preliminary annual sales on Tuesday, citing high inventory levels amid a delay in demand recovery.</p><p class=\"\">The company, which makes silicon wafers used in semiconductor chips, posted 2024 revenue of 1.41 billion euros  ($1.45 billion), down from 1.51 billion euros a year earlier. However, this figure aligned with analysts' expectations of 1.40 billion euros, based on a poll by Vara Research.</p><p class=\"\">Its earnings before interest tax, depreciation and amortisation (EBITDA) came in at 364 million euros for the same period, down from 434 million euros last year.</p><p class=\"\">    \"For the year 2025, we anticipate that the growth in the end-markets, primarily driven by AI, will not yet be reflected in our wafer demand due to the persistently elevated inventory levels in the value chain,\" CEO Michael Heckmeier said in a statement.</p><p class=\"\">The German company anticipates that the first half of next year will be considerably weaker than the second half of 2024. It also expects full-year sales for 2025 to be roughly in line with the previous year, with no significant year-on-year growth.</p><p class=\"\">Siltronic will provide a more detailed outlook at the release of its annual report on March 6.</p><p class=\"\">($1 = 0.9713 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV06J:0-germany-s-siltronic-posts-annual-preliminary-sales-in-line-with-market-view/",
            "pub_date": "2025-02-04 14:48:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV02J:0",
            "title": "Panasonic's battery unit Q3 operating profit rises 39% from a year earlier",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Panasonic Holdings  said on Thursday the third-quarter operating profit of its energy unit, which supplies batteries to Tesla , rose 39% from a year earlier on improved profitability at its U.S. plant and stronger sales of energy storage systems.</p><p class=\"\">Operating income for the key segment increased to 42 billion yen ($270.46 million) as the better profitability at its U.S. plant helped offset an overall decline in sales in its in-vehicle business, it said in presentation materials.</p><p class=\"\">($1 = 155.2900 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV02J:0-panasonic-s-battery-unit-q3-operating-profit-rises-39-from-a-year-earlier/",
            "pub_date": "2025-02-04 14:49:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0EA:0",
            "title": "Raiffeisen says Russia loan volume reduced to 4.2 bln eur at end of 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Austria's Raiffeisen Bank International  said on Tuesday it reduced its loan volume in Russia to 4.2 billion euros ($4.32 billion) at the end of last year, as it sought to pare back its business in the country in response to unrelenting regulatory pressure.</p><p class=\"\">Almost three years after Russia sent troops into Ukraine, Raiffeisen's continued presence in Russia underlines the lingering ties between Moscow and Vienna - with Vienna having served as a hub for cash from Russia and former Soviet states.</p><p class=\"\">That bond put Raiffeisen and Austria on the front line of a global push by the United States to isolate Russia.</p><p class=\"\">Raiffeisen has around 6 billion euros stranded in Russia, earned in part from processing billions in international payments in the years since Russia's invasion of Ukraine, a person with knowledge of the matter has told Reuters.</p><p class=\"\">($1 = 0.9715 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0EA:0-raiffeisen-says-russia-loan-volume-reduced-to-4-2-bln-eur-at-end-of-2024/",
            "pub_date": "2025-02-04 14:50:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0HH:0",
            "title": "JGB yields rise to multi-year highs as markets weigh US tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japanese government bond (JGB) yields rose to multi-year highs on Tuesday alongside U.S. Treasury yields as investors continued to weigh the impact of U.S. tariffs while eyeing the Bank of Japan's rate path outlook.</p><p class=\"\">The 10-year JGB yield (JP10YTN=JBTC) touched a 14-year peak of 1.27%, while 10-year JGB futures (2JGBv1) fell 0.21 points to 140.54 yen.</p><p class=\"\">JGB yields followed U.S. Treasury yields higher, with ten-year U.S. Treasury yields  hovering around 4.57% during Asian hours. </p><p class=\"\">U.S. President Donald Trump suspended his threat of steep tariffs on Mexico and Canada on Monday, agreeing to a 30-day pause to negotiate with the two trade partners.</p><p class=\"\">Trump's additional 10% tariff across all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT), spurring a tit-for-tat from China.</p><p class=\"\">Elsewhere, BOJ Governor Kazuo Ueda reiterated on Tuesday the central bank will aim to achieve 2% inflation on a sustained basis. </p><p class=\"\">Markets are eyeing the BOJ's July meeting as the next possible time for it to raise interest rates.</p><p class=\"\">There is a strong consensus in the market that the BOJ will raise rates every six months to around 1%, a view that has more or less been completely factored in, Nomura's chief macro strategist Naka Matsuzawa said.</p><p class=\"\">The Japan policy rate stands at 0.5% after the BOJ hiked rates last month.</p><p class=\"\">BOJ policymakers have been reluctant to give guidance about the terminal rate, but \"at some point before they even get to 1%, they have to start communicating with the market\", Matsuzawa said.</p><p class=\"\">The two-year JGB yield (JP2YTN=JBTC) sat 1.5 basis points higher at 0.735%, having briefly touched its highest since October 2008 at 0.74%.</p><p class=\"\">The five-year yield (JP5YTN=JBTC) rose 3 bps to 0.925%, a level last seen in November 2008.</p><p class=\"\">The 20-year JGB yield (JP20YTN=JBTC) also climbed 3 bps to 1.985%. The 30-year JGB yield (JP30YTN=JBTC) ticked up 2.5 bps to 2.325%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0HH:0-jgb-yields-rise-to-multi-year-highs-as-markets-weigh-us-tariffs/",
            "pub_date": "2025-02-04 14:50:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463247:0",
            "title": "HFCL Sees Drop in Fiscal Q3 Consolidated Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HFCL  recorded a decline in its attributable consolidated net profit to 736.5 million Indian rupees in the fiscal third quarter from 822.4 million rupees a year ago, according to a Monday filing with the Indian stock exchanges by the telecom infrastructure company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, dropped to 0.51 rupees from 0.58 rupees a year earlier. </p><p class=\"\">Revenue from operations in fiscal Q3 also slipped to 10.1 billion rupees from 10.3 billion rupees a year earlier, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463247:0/",
            "pub_date": "2025-02-04 14:41:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001168:0",
            "title": "Tariffs Unlikely to Have Long-Term Impact on Central Bank Policy — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001168:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001170:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0642 GMT - Higher tariffs have the potential to increase inflation in the short term if companies pass the costs on to their customers, says Damian McIntyre at Federated Hermes. However, this is unlikely to impact central bank policy in the longer term, says the head of multi-asset solutions in a note. \"We would expect this to be a one-off impact of inflation, rather than a sustained increase,\" he says. In the short term, this could keep rates higher for longer, he adds. Federated Hermes, however, does not expect it to have long-term implications for central bank policy. U.S. President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month. (emese.bartha@wsj.com)</p><p class=\"\">0633 GMT - China's retaliation to Trump's tariffs doesn't seem aggressive, says Zhiwei Zhang, president and chief economist at Pinpoint Asset Management. Beijing's measures only target some U.S. products, whereas the U.S. tariffs apply to all Chinese exports to the country, says Zhang. \"This is likely only the beginning of a long process for the two countries to negotiate,\" the economist says. The negotiations between the U.S. and its neighbors suggest that there is some hope of de-escalation at some point, though the road ahead is likely to be bumpy, Zhang says. Washington postponed tariffs on Canada and Mexico after reaching border-related deals. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0629 GMT - ​The top risk for 2025 identified by ETF provider Global X was policy sequencing across taxes, tariffs and deregulation. These are now now playing out, potentially causing more volatility in rates markets, says Scott Helfstein, head of investment strategy. \"This is likely a source for increased volatility in the rate market more so than serious disruption for companies and equities, but this is early days,\" he says in a note. U.S. President Trump moved to levy tariffs on Mexico and Canada, but the leaders of the three states reached an agreement to put tariffs on hold for a month. (emese.bartha@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001170:0/",
            "pub_date": "2025-02-04 14:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV071:0",
            "title": "Nintendo cuts FY profit forecast by 22%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Nintendo  cut its operating profit forecast on Tuesday by 22.2% to 280 billion yen ($1.8 billion) for the financial year ending March. </p><p class=\"\">In the April-December period, profit fell 46.7% to 247.6 billion yen.</p><p class=\"\">Nintendo remains dependent on its console business even as it has opened stores and its roster of characters feature in theme parks and film. </p><p class=\"\">The company said last month it will release a successor to the hit home-portable Switch console this year. </p><p class=\"\">The Switch 2 appears to closely follow the design of its predecessor, which transformed Nintendo's fortunes after the underperformance of the Wii U. </p><p class=\"\">($1 = 155.2900 yen)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV071:0-nintendo-cuts-fy-profit-forecast-by-22/",
            "pub_date": "2025-02-04 14:43:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0BN:0",
            "title": "Logistics firm DSV Q4 profit lags forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Freight forwarder DSV  posted a fourth-quarter operating profit before special items below expectations on Tuesday and said the macroeconomic and geopolitical environment remains uncertain into 2025.</p><p class=\"\">\"The macroeconomic and geopolitical environment, including the situation in the Red Sea remains uncertain, and unforeseen changes may therefore impact our financial results,\" the company said in a statement. </p><p class=\"\">    \"We continue to monitor activity closely across our organisation and adjust capacity and cost base accordingly\".  </p><p class=\"\">    Its earnings before interest, tax and special items fell to 3.94 billion Danish crowns ($543.7 million) from 3.95 billion a year ago, lagging an average forecast of 4.28 billion in a     poll     of 18 analysts conducted by the company.  </p><p class=\"\">    DSV said it expects operating profit before special items this year of between 15.5 billion and 17.5 billion crowns, excluding the impact from its acquisition of Schenker, compared with 17.59 billion expected by analysts and the 16.1 billion it achieved in 2024.  </p><p class=\"\">    DSV is set to become the world's     biggest     logistics company after its $14.6 billion     acquisition     of Schenker which is expected to close in the second quarter.  </p><p class=\"\">    ($1 = 7.2467 Danish crowns)  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0BN:0-logistics-firm-dsv-q4-profit-lags-forecasts/",
            "pub_date": "2025-02-04 14:43:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}