{
    "data": [
        {
            "id": "DJN_DN20250204008065:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1038 ET - Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p><p class=\"\">1037 ET - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">1036 ET - After three years of underwhelming mergers and acquisition activity, 2025 may finally be the year that the market regains footing, Bain &amp; Company says in a report. While some companies continued M&amp;A during this time--navigating unfavorable market realities to deliver inorganic growth--many didn't have this option, the report says. Foundational shifts in technology, sector profit pools, and the broader global economy demanded a strategic response, the management-consulting firm says. \"We expect that the two biggest inhibitors to deals in 2024--namely, interest rates and regulatory challenges--will ease in 2025,\" it adds. (nina.kienle@wsj.com)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1018 ET - Bombardier bounces back as investors breathe a sigh of relief for the month-long pause on tariffs on Canadian imports. Bombardier's business is particularly vulnerable to US tariffs considering many of its business jets are sold to US customers. The company's shares gyrated in the run-up to Trump's tariffs, falling nearly 12% on Monday before recovering throughout the day after the tariff pause was announced. Bombardier is 4.3% higher at C$86.34. (adriano.marchese@wsj.com)</p><p class=\"\">0956 ET - As the threat of U.S. tariffs on imports from Canada continues to loom, the ongoing uncertainty makes it challenging for small business owners to plan and make decisions on their operations, warns the Canadian Federation of Independent Business. The association, which represents about 100,000 members, said that as both countries catch their breath Canada still needs to focus on critical changes needed to prepare for the future. This, the federation suggests, means taking the opportunity now to bring in policies that improve the investment climate, reduce taxes, slash red tape and break down internal trade barriers in the country to ensure Canada is prepared no matter what external threats come its way. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0940 ET - With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p><p class=\"\">0840 ET - TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">0834 ET - Diageo has had little to toast so far in 2025, AJ Bell's Russ Mould says in a note. First the calls from U.S. surgeon general for warnings about the health impacts of alcohol consumption and now it has withdrawn its medium-term guidance. The Guinness beer owner scrapped its midterm outlook of organic net sales growth of between 5% and 7%, citing uncertainty in key markets. The company said U.S. tariffs would affect the Mexican tequila and Canadian whiskey it sells in the U.S. AJ Bell's investment director says the group will be relieved to see the imposition of tariffs for these two countries delayed for now, as imports from these countries account for a good chunk of Diageo's U.S. sales. Shares are down 0.7% at 23.49 pounds. (andrea.figueras@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008065:0/",
            "pub_date": "2025-02-04 23:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008066:0",
            "title": "Berry Global On Pace for Largest Percent Increase In Almost a Year — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Berry Global Group Inc (BERY) is currently at $69.84, up $3.01 or 4.5%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Dec. 4, 2024, when it closed at $70.96</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 9, 2024, when it rose 5.54%</li><li class=\"listItem-bmN0_SHH\">Snaps a two day losing streak</li><li class=\"listItem-bmN0_SHH\">Up 7.99% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 3.42% from its all-time closing high of $72.31 on Nov. 29, 2024</li><li class=\"listItem-bmN0_SHH\">Up 18.35% from 52 weeks ago (Feb. 6, 2024), when it closed at $59.01</li><li class=\"listItem-bmN0_SHH\">Down 3.42% from its 52-week closing high of $72.31 on Nov. 29, 2024</li><li class=\"listItem-bmN0_SHH\">Up 36.07% from its 52-week closing low of $51.33 on Feb. 8, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $70.36; highest intraday level since Dec. 11, 2024, when it hit $70.56</li><li class=\"listItem-bmN0_SHH\">Up 5.27% at today's intraday high; largest intraday percent increase since Nov. 19, 2024, when it rose as much as 8.13%</li></ul><p class=\"\">All data as of 10:39:55 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008066:0/",
            "pub_date": "2025-02-04 23:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008064:0",
            "title": "ADM Could Close, Sell Assets — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1036 ET - After three years of underwhelming mergers and acquisition activity, 2025 may finally be the year that the market regains footing, Bain &amp; Company says in a report. While some companies continued M&amp;A during this time--navigating unfavorable market realities to deliver inorganic growth--many didn't have this option, the report says. Foundational shifts in technology, sector profit pools, and the broader global economy demanded a strategic response, the management-consulting firm says. \"We expect that the two biggest inhibitors to deals in 2024--namely, interest rates and regulatory challenges--will ease in 2025,\" it adds. (nina.kienle@wsj.com)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1001 ET - The average buyer's agent commission held steady at 2.37% in 4Q, down slightly from 2.45% a year prior, according to Redfin. Despite new commission rules by the National Association of Realtors implemented in August 2024, commissions saw only minor fluctuations, starting at 2.38% in July, dipping to 2.35% in August, and returning to 2.38% by December. A Redfin survey of 500 U.S. agents revealed that 48% said the average agent commission in their area remained about the same since the NAR settlement took effect, while 43% noted a decline. Moreover, 54% of agents reported increased negotiation efforts over commissions by clients, with only 6% seeing less negotiation. (chris.wack@wsj.com)</p><p class=\"\">0928 ET - New U.S. tariffs on Chinese goods were met with retaliation from China, resulting in selling in CBOT soybean futures overnight. But that selling has moderated, with the most-active soybean contract now down only 0.3% pre-market. Traders who have spoken to WSJ say that a lot of market activity has become reactive to new headlines, but is showing restraint in light of trade uncertainty. \"I think the trade is well braced for this,\" says Terry Reilly of Marex. Reilly adds that many traders likely \"learned their lesson\" after handling the fallout of the trade war with China in Trump's first term. (kirk.maltais@wsj.com)</p><p class=\"\">0922 ET - The dollar recovers some ground after yesterday's choppy session, which ended with a small decline in the WSJ Dollar Index as tariffs on Mexico and Canada were delayed. The trade war with China goes on and markets remain worried about the potential fallout of a prolonged period in which tariffs would loom over the global economy. BBH says in a report that investors should look through the noise and focus on the fact that the U.S. still has strong growth and elevated inflation, \"and a more hawkish Fed continues to favor higher U.S. yields and a stronger dollar.\" The greenback strengthens 0.3 against the yen and is stable versus the euro. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0918 ET - Much of the past few days has been about gauging how inflexible the Trump administration will be on tariffs; in other words, whether they're better understood as firm policy or a negotiating tool. Quick postponements of the Canada and Mexico tariffs point to the latter category, strategist Will Compernolle of FHN Financial writes. He notes China's retaliatory tariffs against the only barriers Trump has actually implemented so far don't start until Feb. 10. That \"implies room for negotiation, something traders may take as a sign these tariffs will not be long term,\" Compernolle writes. \"The trade relationship may nevertheless be scarred, but there's a sense, rightly or wrongly, the more maximalist policies will not be the equilibrium.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p><p class=\"\">0840 ET - TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">0835 ET - Treasury yields rise as the U.S. trade war against Mexico and Canada takes a pause while China announces retaliatory tariffs on U.S. exports. Inflation concerns are rising while it remains to be seen how the Fed will react to trade tensions. December JOLTS report is due at 10 a.m. ET. ADP employment data will come tomorrow, followed by jobless claims on Thursday and nonfarm payrolls Friday. Economists surveyed by The Wall Street Journal forecast a slowdown in job creation last month, with unemployment stable at 4.1%. The 10-year is at 4.577% and the two-year at 4.257%. (paulo.trevisani@wsj.com; @ptrevisani)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008064:0/",
            "pub_date": "2025-02-04 23:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309017:0",
            "title": "Quebec Labor Union Vows Legal Action After Amazon Closes 7 Warehouses, Lays Off 1,700",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Confederation of National Trade Unions said Tuesday it is bringing legal action against Amazon.com  in response to the company's decision to shut seven warehouses and lay off 1,700 workers. </p><p class=\"\">\"In light of the anti-union agenda behind Amazon's ruthless actions, the CSN will petition the court to annul the mass layoff and order the reopening of the seven warehouses, the reinstatement of the 1,700 Amazon employees, and the payment of compensation and damages,\" the trade union federation said in a statement. </p><p class=\"\">Amazon didn't immediately reply to a request for comment from MT Newswires.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309017:0/",
            "pub_date": "2025-02-04 23:42:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308967:0",
            "title": "Globex Mining Edging Up After Reporting Metallurgical Progress on Two Royalty Properties; Includesd Radisson and Brunswick",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Globex Mining Enterprises  has seen its shares edge up on the TSX after it reported Tuesday updates regarding metallurgical test work related to two its royalty properties. </p><p class=\"\">In a statement it noted Radisson Mining Resources  announced initial milling test results regarding gold ore from the O'Brien project. The project comprises the Kewagama gold mine, on which Globex holds a 2% net smelter royalty, and the New Alger gold mine, on which Globex holds a 1% net smelter royalty. </p><p class=\"\">Globex said Radisson reported gold recoveries of between 86% to 96% based upon a series of flow sheet options compatible with the Doyon-Westwood mill with minimal or modest additional capital. </p><p class=\"\">Thus, Radisson concludes that the Doyon-Westwood mill is a feasible processing option for the O'Brien ore. </p><p class=\"\">Meanwhile, Brunswick Exploration  reported metallurgical results from test work on drill core samples from the Mirage project, which hosts the Lac Escale claims, on which Globex owns a 3% gross metal royalty. </p><p class=\"\">Among highlights, Globex noted Brunswick reported preliminary recoveries of 76% producing a spodumene concentrate grading 5.5% lithium oxide for HLS testing and recoveries of 68.4% producing a spodumene concentrate grading 5.7% lithium oxide for DMS testing both at coarse grain size. </p><p class=\"\">With these positive test results, Globex said Brunswick plans further metallurgical work and is focused on continuing drill exploration to advance the project to a first resource estimate.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308967:0/",
            "pub_date": "2025-02-04 23:43:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446587:0",
            "title": "Palladium Retreats From 3-Month Highs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palladium futures fell to $1,030 per ounce, retreating from a three-month high of $1,063 seen January 31st, with global auto sector struggles curbing consumption for catalytic converters.</p><p class=\"\">Declining vehicle sales in China and the EU, coupled with the ongoing shift toward electric vehicles, reduced automakers’ palladium needs.</p><p class=\"\">Additionally, US-China trade tensions weighed on industrial demand, particularly in China, where manufacturing activity remains sluggish amid weak export growth and subdued domestic consumption.</p><p class=\"\">On the supply side, disruptions from Western sanctions on Russian exports, which account for roughly 40% of global palladium production, kept markets tight.</p><p class=\"\">However, increased recycling rates and stable output from South African mines helped offset these constraints, preventing a sharper price rebound.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446587:0-palladium-retreats-from-3-month-highs/",
            "pub_date": "2025-02-04 23:43:44",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008069:0",
            "title": "Lancaster Colony Up Over 10%, on Pace for Largest Percent Increase in Over a Year — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lancaster Colony Corporation (LANC) is currently at $183.24, up $16.74 or 10.05%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Dec. 17, 2024, when it closed at $189.22</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 1, 2024, when it rose 11.02%</li><li class=\"listItem-bmN0_SHH\">Snaps a three day losing streak</li><li class=\"listItem-bmN0_SHH\">Up 5.83% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 16.27% from its all-time closing high of $218.84 on May 5, 2023</li><li class=\"listItem-bmN0_SHH\">Down 5.20% from 52 weeks ago (Feb. 6, 2024), when it closed at $193.29</li><li class=\"listItem-bmN0_SHH\">Down 11.75% from its 52-week closing high of $207.63 on March 28, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.34% from its 52-week closing low of $166.07 on Jan. 7, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as high as $185.56; highest intraday level since Dec. 18, 2024, when it hit $189.10</li><li class=\"listItem-bmN0_SHH\">Up 11.45% at today's intraday high; largest intraday percent increase since Feb. 1, 2024, when it rose as much as 17.16%</li></ul><p class=\"\">All data as of 10:41:28 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008069:0/",
            "pub_date": "2025-02-04 23:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463518:0",
            "title": "Moody's Confirms Ratings, Outlook of German Landlord Vonovia",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Moody's on Tuesday affirmed Vonovia's  Baa1 long-term issuer and senior unsecured ratings with a stable outlook. </p><p class=\"\">The affirmation supports the German residential landlord's strong operating performance and divestment program that helped offset the impact of high interest rates. </p><p class=\"\">For the stable outlook, the rating agency noted its expectations that Vonovia would maintain credit metrics in line with its rating guidance and expectations that the German multifamily sector valuations stabilized in the latter half of 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463518:0/",
            "pub_date": "2025-02-04 23:44:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008074:0",
            "title": "Enphase Energy Price Target Maintained With a $50.69/Share by GLJ Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008074:0/",
            "pub_date": "2025-02-04 23:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS4kVLga:0",
            "title": "Rhino Investments Group Announces Acquisition of Pavilions at San Mateo in Albuquerque, NM",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rhino Investments Group Acquires Pavilions at San Mateo, Expanding Presence in Albuquerque's Premier Retail District</p><p class=\"\">ALBUQUERQUE, NM / ACCESS Newswire / February 4, 2025 / Rhino Investments Group (Rhino), a leading Las Vegas-based commercial real estate firm specializing in value-add investments, is excited to announce its acquisition of <strong class=\"root-Tkn6WL2y\">Pavilions at San Mateo</strong>, a premier retail shopping center located at 4500-5010 Cutler Avenue NE, Albuquerque, NM. This acquisition is a key addition to Rhino's growing portfolio and underscores its commitment to investing in high-quality assets in top-tier markets with significant long-term growth potential.</p><p class=\"\">Pavilions at San Mateo is a 148,749-square-foot Walmart Neighborhood Market-anchored shopping center that offers a strong mix of national and regional retailers. Key tenants include Walmart Neighborhood Market, Old Navy, Shoe Dept., Rack Room Shoes, and Dollar Tree, with notable additional tenants like Orange Theory Fitness, Einstein Bros Bagels, and Supercuts. The center, built in 1997, is strategically positioned along the high-traffic Interstate 40 and San Mateo Boulevard, providing exceptional visibility and access to over 150,000 vehicles daily.</p><p class=\"\">\"We are thrilled to expand our portfolio with the acquisition of Pavilions at San Mateo, which is ideally located in one of Albuquerque's most desirable retail districts,\" said <strong class=\"root-Tkn6WL2y\">Sanjiv Chopra</strong>, CEO of Rhino Investments Group. \"The property's high occupancy rate, strong tenant lineup, and proven retail performance align perfectly with our strategy of acquiring well-located assets with robust upside potential.\"</p><p class=\"\">The property benefits from a strong local demographic, with more than 198,000 people within a 3-mile radius and average household incomes exceeding $70,000 within one mile. Pavilions at San Mateo is currently 92% leased, demonstrating its stability and appeal to both national and regional tenants. Rhino sees significant opportunities for further value creation through potential lease-up of available spaces and strategic tenant improvements.</p><p class=\"\">In addition to its existing strengths, Pavilions at San Mateo is situated in a high-growth area with easy access to major roads and proximity to key employers, including Sandia National Laboratories and the University of New Mexico, further bolstering the property's long-term prospects.</p><p class=\"\">\"This acquisition marks a significant milestone for Rhino as we further strengthen our presence in Albuquerque, along with our growing portfolio across New Mexico,\" said <strong class=\"root-Tkn6WL2y\">Sanjiv Chopra</strong>. \"Albuquerque's dynamic commercial real estate landscape offers tremendous potential, and we are committed to continuing our investment in the region. Our focus remains on enhancing the performance of Pavilions at San Mateo and ensuring it remains a thriving retail hub for the local community.\"</p><p class=\"\">The property will be managed by Colliers' Real Estate Management Services team from their Albuquerque office. \"This is our second property management assignment awarded to Colliers,\" said Becca Wall, Vice President of Operations. \"They have done an excellent job managing our Zecca Plaza project,\" she continued, referring to Rhino's July 2024 acquisition of a 111,000-square-foot, Albertsons-anchored shopping center in Gallup, New Mexico. \"We look forward to further expanding our partnership with Colliers across New Mexico,\" Ms. Wall added.</p><p class=\"\">Leasing for the property will be handled by Colliers' leasing specialists, led by Chase Ruffin and Ben Perich, also out of Colliers' Albuquerque office.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Rhino Investments Group</strong></p><p class=\"\">Rhino Investments Group is a leading commercial real estate firm based in Las Vegas, Nevada, specializing in value-add investments across retail and commercial real estate. With a proven track record of successful acquisitions and asset management, Rhino focuses on transforming properties to deliver exceptional returns for investors. For more information, visit www.rhinoig.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Details:</strong></p><p class=\"\">Rhino Investments Group</p><p class=\"\">tednoff@rhioig.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Rhino Investments Group</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS4kVLga:0/",
            "pub_date": "2025-02-04 23:45:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6VZcz6:0",
            "title": "Yerbae Expands Colorado Distribution Through Eagle Rock Distributing and King Soopers, Seeking to Mirror Safety Shot’s Success in Major Supermarket Chains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SCOTTSDALE, Ariz., Feb.  04, 2025  (GLOBE NEWSWIRE) — Yerbaé Brands Corp. (TSX-V: YERB.U; OTCQX: YERBF) (“Yerbaé” or the “Company”), a plant-based functional beverage company, today announced a new distribution agreement with Eagle Rock Distributing Company (“Eagle Rock”), a full-service beverage distributor servicing retailers across Georgia and Colorado. Under the agreement, Eagle Rock will distribute Yerbae’s 12oz functional beverage product line to King Soopers locations throughout Colorado. King Soopers, a subsidiary of Kroger, is one of the largest supermarket chains in the Rocky Mountain region.</p><p class=\"\">This strategic partnership comes amidst a surge in consumer demand for plant-based, better-for-you alternatives in the beverage sector. Yerbaé, with its commitment to clean ingredients and natural energy, is well-positioned to capitalize on this trend, particularly within the expansive King Soopers network.</p><p class=\"\">Eagle Rock Distributing Company has been a trusted partner for premium beverage brands in Colorado, known for its commitment to quality service and extensive experience in the beverage distribution space. The company’s established network will ensure that Yerbae’s products reach King Soopers locations throughout the state, from Denver to Boulder to Colorado Springs.</p><p class=\"\">“We’re extremely excited to be working with Eagle Rock Distributing,” said Todd Gibson, CEO and Co-Founder of Yerbaé. “Colorado consumers are increasingly focused on health and wellness, and Yerbae’s clean, plant-based functional beverages are the perfect fit for this market. We’ve seen strong sales in the region from other retailers, and this partnership with Eagle Rock will ensure that King Soopers customers across the state have easy access to our products. We’re confident that Eagle Rock’s local expertise and excellent service will help us grow our presence in Colorado and continue meeting the demand for healthier beverage options.”</p><p class=\"\">This expansion seeks to mirror Safety Shot, Inc.’s  success, which is in the process of acquiring Yerbaé, in securing distribution agreements with major supermarket chains across the United States, including a leading chain with over 2,400 stores in 35 states and a prominent Midwestern chain with over 285 stores across eight states.</p><p class=\"\">Expanding Product Availability and Empowering Consumers</p><p class=\"\">Eagle Rock will be delivering Yerbae’s latest 12oz functional beverage lineup, featuring the tantalizing flavors of Mango Passionfruit, Black Cherry Pineapple, and Peachy Mimosa Twist. This expansion provides King Soopers’ customers with an even wider selection of zero sugar, zero calorie, non-GMO, and gluten-free beverages, empowering them to make healthy choices without sacrificing taste or enjoyment.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Synergies with Safety Shot and Future Growth</strong></p><p class=\"\">This distribution agreement with Eagle Rock and King Soopers reinforces Yerbaé’s commitment to expanding its retail footprint and making its products more accessible to health-conscious consumers. This strategy aligns with the approach of Safety Shot, Inc., which is in the process of acquiring Yerbaé, and its focus on securing prominent placements within both convenience stores and major supermarket chains.</p><p class=\"\">“Yerbaé’s expansion into King Soopers reflects a shared vision with Safety Shot to provide consumers with convenient access to innovative and healthy beverage choices,” said Jarrett Boon, CEO of Safety Shot, Inc. “We are confident that this partnership will be mutually beneficial and contribute to the continued growth of both brands.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Yerbaé Brands Corp.</strong></p><p class=\"\">Founded in 2017 by Todd Gibson and Karrie Gibson, Yerbaé Brands Corp., (TSX-V: YERB.U; OTCQX: YERBF) is disrupting the functional beverage marketplace with great tasting, zero sugar, zero calorie beverages, while using plant-based ingredients that are designed to meet the needs of the wellness forward consumer. Harnessing the power of nature, Yerbaé’s key ingredient (yerba mate, a South American herb) is known to produce 196 different vitamins, minerals and nutrients as well as caffeine.</p><p class=\"\">By combining yerba mate with its premium ingredients and flavors, Yerbaé provides consumers with a no compromise functional beverage solution. All Yerbaé beverages are zero calorie, zero sugar, non-GMO, and gluten free.</p><p class=\"\">Find us @DrinkYerbaé on Instagram, Facebook, Twitter and TikTok, or online at https://yerbae.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information:</strong></p><p class=\"\">For investors, investors@yerbae.com or 480.471.8391</p><p class=\"\">To reach CEO Todd Gibson, todd@yerbae.com or 480.471.8391</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Safety Shot, Inc.</strong></p><p class=\"\">Safety Shot, Inc., a wellness and dietary supplement company, has developed Sure Shot, the first patented wellness product on Earth that lowers blood alcohol content by supporting its metabolism, while boosting clarity, energy, and overall mood. Sure Shot is available for purchase online at www.sureshot.com, www.walmart.com and Amazon. Safety Shot, Inc. is introducing business-to-business sales of Sure Shot to distributors, retailers, restaurants, and bars throughout 2025.</p><p class=\"\">Investor Relations</p><p class=\"\">Phone: 561-244-7100</p><p class=\"\">Email: investors@drinksafetyshot.com</p><p class=\"\">Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains certain forward-looking statements within the meaning of the applicable securities laws. All statements other than statements of historical facts contained in this press release, including statements regarding Eagle Rock’s ability to help Yerbaé grow its presence in Colorado, Yerbaé’s ability to capitalize on growing consumer demand for plant-based, better-for-you alternatives in the beverage sector in Colorado or elsewhere, particularly within the expansive King Soopers network, Yerbaé’s and SHOT’s business strategy, prospective costs, timing and the completion and any successes derived therefrom from the proposed business combination between Yerbaé and SHOT, are all forward-looking statements. These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result,” and similar expressions. These forward-looking statements are subject to a number of risks, uncertainties and assumptions, including, but not limited to, Yerbaé’s inability to grow its presence in Colorado and, in connection therewith, its ability to capitalize on the growing demand for plant-based, better-for-you alternatives in the beverage sector, the risk that the Yerbaé and SHOT transaction may not be completed in a timely manner or at all, which may adversely affect the price of Yerbaé’s securities; changes in applicable laws or regulations; the possibility that Yerbaé may be adversely affected by other economic, business, and/or competitive factors; and other risks and uncertainties not in the direct control of the Company. Moreover, Yerbaé operates in very competitive and rapidly changing environments. Because forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified and some of which are beyond Yerbaé’s control, you should not rely on these forward-looking statements as predictions of future events. Forward-looking statements speak only as of the date they are made. Yerbaé gives no assurance that it will achieve the expectations stated herein. Readers are cautioned not to put undue reliance on forward-looking statements, and except as required by law, Yerbaé assumes no obligation and do not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6VZcz6:0-yerbae-expands-colorado-distribution-through-eagle-rock-distributing-and-king-soopers-seeking-to-mirror-safety-shot-s-success-in-major-supermarket-chains/",
            "pub_date": "2025-02-04 23:46:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463519:0",
            "title": "Cavendish Financial plc Changes Name to Cavendish plc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cavendish Financial plc  officially changed its name to Cavendish plc after the UK Companies House issued a change of name certificate on Jan. 31. </p><p class=\"\">Trading in the British investment bank's shares under the new name on the London bourse is expected to start Wednesday, according to a Tuesday filing. The ticker symbol, meanwhile, remains unchanged.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463519:0/",
            "pub_date": "2025-02-04 23:46:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0IY:0",
            "title": "US dollar edges lower as China tariffs kick in",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US dollar lower as duties against China take effect</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Markets see tariff threats as a negotiating tool</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro and Australian dollar rise</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Canadian dollar down after Monday rebound</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">President Trump granted Canada, Mexico 30-day reprieve</li></ul></span></div><span><p class=\"\">    The U.S. dollar edged lower on Tuesday as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal, a day after he suspended planned measures against Mexico and Canada.</p><p class=\"\">However, the new Trump administration imposed additional 10% tariffs on imports from China effective from early Tuesday and currency analysts said they expected high sensitivity to tariff developments and volatility to persist.</p><p class=\"\">The U.S. dollar index , a measure of the value of the greenback relative to a weighted basket of six major foreign currencies, was down 0.43% at 108.12 while the Canadian dollar was weaker and the Mexican peso was stronger.</p><p class=\"\">\"We're still looking at these 10% tariffs on China and China's retaliation, which is going to add some risk premium back into the market,\" said Helen Given, FX trader at Monex USA. \"We'll see if there's any sort of negotiation on the back end that might tamp these down as we saw with Mexico and Canada. But as it looks right now, the trade war with China is back up and running.\"</p><p class=\"\">The euro rose slightly, with Washington threatening that the European Union may be next in line for trade levies, which are widely expected to push up U.S. inflation, supporting the dollar by keeping U.S. interest rates higher for longer.</p><p class=\"\">\"That Trump wants to negotiate is clear,\" said Marcus Widen, an economist at SEB.</p><p class=\"\">\"But at the same time, there is a basic idea that tariff revenues should finance tax cuts, and from that perspective, one could wonder if one can go back on tariff plans every time.\" </p><p class=\"\">Beijing on Tuesday imposed tariffs on some U.S. imports in a swift response to new U.S. duties on Chinese goods, raising the stakes in a showdown between the world's top two economies. </p><p class=\"\">\"It suggests that China is wary of pushing back too hard against Trump’s latest tariffs and is leaving the door open for future negotiations,\" said Lee Hardman, senior currency analyst at MUFG.</p><p class=\"\">The Chinese yuan edged up 0.27% to 7.2796 per dollar in offshore trading =D3&gt;. There is no official yuan trading until Wednesday, with mainland markets still closed for Lunar New Year festivities.</p><p class=\"\">The Australian dollar =D4&gt;, which often acts as a liquid proxy for the yuan because the Australian economy is highly exposed to China, rose 0.28% to $0.625, well above Monday's low of $0.6085, the weakest level since April 2020.</p><p class=\"\">EURO LOWER</p><p class=\"\">The euro  rose 0.28% to $1.037, with market participants watching parity.</p><p class=\"\">\"The maximum trade war risk premium seen during the first Trump administration was six big figures which would take the euro/dollar to parity,\" said George Saravelos, head of forex research at Deutsche Bank. </p><p class=\"\">\"A European Central Bank (terminal rate) repricing down to 1.50%, with the Fed (policy path) unchanged, would take the euro/dollar further down to 0.98-0.99 based on current betas.\"</p><p class=\"\">Several analysts recently said that U.S. tariffs would have a deflationary effect on the euro area.</p><p class=\"\">The Canadian dollar  lost 0.46% to C$1.436 against its U.S. counterpart, following a sharp rebound from a low of C$1.4792 on Monday, the weakest level since 2003.</p><p class=\"\">The Mexican peso  rose 0.53% to 20.4373, after jumping over 1.5% the day before.</p><p class=\"\">The pound edged lower against the euro after recording its biggest daily rise in three months as investors expect U.S. tariffs to hurt the economy more in Europe than in Britain. </p><p class=\"\">The U.S. dollar was nearly flat at 154.66 yen =EBS&gt;, with the Japanese currency seen as a safe-haven currency and the greenback less appealing after recent rises.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0IY:0-us-dollar-edges-lower-as-china-tariffs-kick-in/",
            "pub_date": "2025-02-04 23:46:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006573:0",
            "title": "Merck Shares Hit After Guidance Falls Short, Gardasil Challenge — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jared S. Hopkins and Denny Jacob</p><p class=\"\">Merck shares tumbled more than 7% Tuesday premarket after the drugmaker gave 2025 revenue guidance that fell short of analyst expectations and said it was pausing shipments to China of its top-selling vaccine Gardasil.</p><p class=\"\">Merck said it expected sales of $64.1 billion to $65.5 billion in 2025 and adjusted earnings of $8.88 to $9.03 a share. Both forecasts came in below the average analyst expectation for revenue of $67.07 billion, and adjusted earnings per share of $9.13.</p><p class=\"\">Merck's guidance was affected because it decided to pause shipments of Gardasil to China from February through at least the middle of the year, as the company's Gardasil business in China remains a challenge.</p><p class=\"\">Gardasil prevents cancers caused from the human papillomavirus and is the company's biggest-selling franchise behind blockbuster cancer therapy Keytruda.</p><p class=\"\">The vaccine's sales had been booming in China until last year when Merck said it had been affected by various economic issues, including an anticorruption effort by the government. The company has said it has been working on improving patient education and promotion of the vaccine.</p><p class=\"\">Gardasil sales in 2024 totaled roughly $8.6 billion, down 3% from the prior year. Fourth-quarter sales were about $1.6 billion, down 18% from a year ago in part because of the lower demand in China.</p><p class=\"\">Gardasil's China sales account for most of the shot's international revenue. The shot's sales could be key to helping Merck deal with revenue losses when Keytruda loses patent protection in 2028.</p><p class=\"\">Keytruda's fourth-quarter sales grew 21% to $7.8 billion, helping power company quarterly revenue to $15.6 billion. Analysts expected $15.5 billion. Keytruda sales totaled $29 billion in 2024.</p><p class=\"\">Chief Executive Robert Davis attributed growth in 2024 to Keytruda, the second-quarter launch of hypertension drug Winrevair and performance in the animal-health business.</p><p class=\"\">Stripping out certain one-time items, earnings came in at $1.72 a share; analysts polled by FactSet had expected $1.61 a share.</p><p class=\"\">Merck reported fourth-quarter net income of $3.74 billion, or $1.48 a share, compared with a loss of $1.23 billion, or 48 cents a share, a year earlier.</p><p class=\"\">Write to Jared S. Hopkins at jared.hopkins@wsj.com and Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006573:0/",
            "pub_date": "2025-02-04 23:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008035:0",
            "title": "Intesa Sanpaolo's Operating Profit, Outlook Surpass Expectations — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008035:0/",
            "pub_date": "2025-02-04 23:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463516:0",
            "title": "DOF Group Wins $30 Million Subsea Service Contracts in Asia-Pacific",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DOF Group  secured two subsea service contracts totaling $30 million in the Asia-Pacific region, according to a Tuesday release. </p><p class=\"\">The first contract involves using the DSV Skandi Singapore dive support vessel for saturation diving services in Malaysia. The vessel will be deployed in the second quarter, lasting 30 days. </p><p class=\"\">Under the second contract, the offshore and subsea vessels company will provide construction support services in Indonesia with a multipurpose vessel for seven weeks, beginning in the third quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463516:0/",
            "pub_date": "2025-02-04 23:38:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008044:0",
            "title": "U.S. Job Openings Fell in December; Other Hiring Metrics Steady",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">The number of open jobs in the U.S. fell by more than half a million in the last month of 2024, but other indicators of labor-market health stayed steady in December.</p><p class=\"\">Job openings ended December at 7.6 million, down by 556,000 from a month earlier and a decline of 1.3 million from a year earlier, according to the Job Openings and Labor Turnover Survey, published Tuesday by the Department of Labor.</p><p class=\"\">The hiring rate, at 3.4%, and the quits rate, at 2%, were both constant from November.</p><p class=\"\">Layoffs and discharges were also steady at a rate of 1.1%, the rate that has held since September. A total of about 1.8 million workers were laid off or discharged in December, little changed from a month earlier.</p><p class=\"\">Despite steadiness in December, labor-market metrics softened over the course of 2024 as hiring cooled and workers saw less opportunity to leave their jobs for new roles.</p><p class=\"\">The ratio of open jobs to unemployed workers peaked at around 2 in early 2022, but has fallen to closer to 1 in recent months.</p><p class=\"\">More up-to-date labor-market figures are on the way Friday, in the monthly jobs report for January.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008044:0-u-s-job-openings-fell-in-december-other-hiring-metrics-steady/",
            "pub_date": "2025-02-04 23:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008037:0",
            "title": "EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Edith Hancock</p><p class=\"\">European officials need to manage their expectations in diplomatic negotiations against a more volatile geopolitical environment, European Commission President Ursula von der Leyen said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\">\"This is a world where we can no longer take much for granted including the rules and norms that were built over the past 70 years,\" she said at a conference on Tuesday, adding that \"in this hot-headed world, Europe's best approach is to remain level-headed.\"</p><p class=\"\">Von der Leyen--one of the European Union's most powerful officials--said negotiators need a clear and reasonable idea of the world as it really is. \"Don't think in terms of pessimism or even optimism, think about in terms of what is possible,\" she said.</p><p class=\"\">The commission president said that no other economies in the world are as integrated in the same way as the EU and the U.S.</p><p class=\"\">\"We want to make it work, and not only because of our historic ties, but because it is simply smart business,\" she said. \"So our first priority is now to work on the many areas where the interests converge.\"</p><p class=\"\">Her comments come after U.S. President Trump signed an executive order on Feb. 1 placing extra 10% tariffs on all Chinese imports, as well as threatening measures against Canada and Mexico before postponing them as both countries agreed to boost border security. Trump blasted the U.S.'s trade relationship with the EU over the weekend, calling it an \"atrocity\" and complaining that the EU exports far more to the U.S. than it imports. He said fresh tariffs on the bloc will definitely happen.</p><p class=\"\">\"We know that there will be an increased use of threats and economic coercion tools such as sanctions, export controls and tariffs,\" commission chief von der Leyen said. \"Europe will safeguard its economic and national security, but it is important that we strike the right balance,\" she said.</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008037:0/",
            "pub_date": "2025-02-04 23:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0S6:0",
            "title": "Wall Street gains early; Palantir Technologies rallies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nasdaq up &gt;1%, S&amp;P 500 up ~0.5%, Dow edges green</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dec factory orders MM -0.9% vs -0.7% estimate</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dec JOLTS job openings 7.6M vs 8.0M estimate</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.2%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar down; bitcoin falls &gt;2.5%; crude ~flat; gold up ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield edges up to ~4.56%</li></ul></span></div><span><p class=\"\">WALL STREET GAINS EARLY; PALANTIR TECHNOLOGIES RALLIES</p><p class=\"\">U.S. stocks are higher in morning Tuesday trading, with a more than 1% gain in the Nasdaq composite  leading the way up along with energy and technology shares.</p><p class=\"\">Shares of Palantir Technologies  are up about 27% and helping to boost the Nasdaq after the company late Monday gave an upbeat 2025 revenue outlook, and an executive at the company said Palantir recommends that its clients steer clear of Chinese startup DeepSeek's AI models.</p><p class=\"\">Energy  up about 2%, and tech  up about 1.4%, are the leading S&amp;P 500  sectors. Staples  and healthcare , both off around 0.9%, are the weakest groups.</p><p class=\"\">Keeping investors on edge, however, is news that China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs.</p><p class=\"\">Here is the early market snapshot:</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:700.990099009901px;aspect-ratio:1.1683168316831682\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0S6-dc233eb279ef047a3aacf5b89653cdb6-resized.webp\" type=\"images/webp\"/><img alt=\"feb 4\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0S6-dc233eb279ef047a3aacf5b89653cdb6-resized.jpeg\" style=\"background-color:#e9e8ed\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">morning snapshot</span></figcaption></figure></span></p><p class=\"\">(Caroline Valetkevitch)</p><p class=\"\">     *****</p><p class=\"\">FOR TUESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">NASDAQ COMPOSITE: LOTS OF CHOP AS TRIES TO AVOID A BIGGER DROP - CLICK HERE</p><p class=\"\">WATCH OUT INVESTORS, IT'S THE YEAR OF THE SNAKE - CLICK HERE</p><p class=\"\">EQUITIES AND THE EURO: IT'S COMPLICATED - CLICK HERE</p><p class=\"\">A \"FASCINATING\" EARNINGS SEASON AHEAD FOR UK BANKS - CLICK HERE</p><p class=\"\">BACK TO EARNINGS - CLICK HERE</p><p class=\"\">EUROPE BEFORE THE BELL: HERE WE GO AGAIN - CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0S6:0-wall-street-gains-early-palantir-technologies-rallies/",
            "pub_date": "2025-02-04 23:39:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309000:0",
            "title": "Market Chatter: Grab Holdings Mulls Takeover of GoTo at $7 Billion Valuation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Grab Holdings  is considering a takeover of rival GoTo Group at a valuation of over $7 billion, Bloomberg reported Tuesday, citing people familiar with the matter. </p><p class=\"\">Grab is discussing an all-stock purchase valuing shares of GoTo at more than 100 Indonesian rupiah each, representing a roughly 20% premium over its current stock price, the people reportedly told Bloomberg. </p><p class=\"\">Grab did not immediately reply to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309000:0/",
            "pub_date": "2025-02-04 23:39:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309008:0",
            "title": "Arcturus Therapeutics Appoints Moncef Slaoui Chair Designate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arcturus Therapeutics Holdings  said Tuesday it has appointed Moncef Slaoui as chair designate. </p><p class=\"\">Slaoui has been a member of the company's board since June 2024 and most recently served as chief scientific advisor to the White House's Operation Warp Speed, according to Arcturus.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309008:0/",
            "pub_date": "2025-02-04 23:39:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1LV:0",
            "title": "Miner Ferrexpo tumbles as Ukrainian unit faces $3.77 bln civil claim",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Miner Ferrexpo plc  down 9.7% at 93.6p; stock top loser on FTSE 250 index (.FTMC) </p><p class=\"\">** Says a civil claim worth UAH 157 billion ($3.77 billion) is filed against its Ukrainian unit Ferrexpo Poltava Mining (FPM) in relation to alleged sale of waste products, as well as illegal mining and selling subsoil</p><p class=\"\">** Adds that FPM is of the view that accusations and claim are without merit</p><p class=\"\">** Unit intends to defend its position in the Ukrainian courts</p><p class=\"\">** As of last close, stock down ~2% YTD </p><p class=\"\">($1 = 41.6800 hryvnias)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1LV:0-miner-ferrexpo-tumbles-as-ukrainian-unit-faces-3-77-bln-civil-claim/",
            "pub_date": "2025-02-04 23:39:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0MS:0",
            "title": "South African rand firms after change in Trump's tariff stance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    South Africa's rand edged higher on Tuesday as markets digested U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/topic/person/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a>'s changing tariff stance.</p><p class=\"\">At 1518 GMT, the rand traded at 18.68 against the dollar , about 0.2% stronger than Monday's close. The dollar  last traded about 0.4% weaker against a basket of currencies.</p><p class=\"\">Trump on Monday suspended his threat of steep tariffs on Mexico and Canada, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">The U.S. imposed tariffs on Chinese imports on Tuesday and China quickly responded.</p><p class=\"\">The rand traded turbulently on Monday, slumping almost 2% in early trade on news that Trump would suspend funding to <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/south-africa/\" rel=\"nofollow\" target=\"_blank\">South Africa</a> over land rights, but staged a recovery later to close roughly flat.</p><p class=\"\">\"What we are seeing is that Trump is looking for concessions, while he negotiates,\" Adam Phillips, treasury specialist at Umkhulu Treasury, said about the tariffs turmoil.</p><p class=\"\">\"What is clear is that a risk premium is being added into the foreign exchange market and this is going to be around for a while.\"</p><p class=\"\">On the stock market, the Top-40  index closed about 1.1% higher.</p><p class=\"\">South Africa's benchmark 2030 government bond (ZAR2030=) was stronger, with the yield down 5.5 basis points to 9.09%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0MS:0-south-african-rand-firms-after-change-in-trump-s-tariff-stance/",
            "pub_date": "2025-02-04 23:39:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309018:0",
            "title": "Utah Medical Products Keeps Quarterly Dividend at $0.305 a Share, Payable April 3 to Stockholders of Record March 14",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309018:0/",
            "pub_date": "2025-02-04 23:40:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008051:0",
            "title": "Ferrari Up Nearly 8%, On Track for Largest Percent Increase Since February 2024 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ferrari NV (RACE) is currently at $462.41, up $33.47 or 7.8%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Nov. 4, 2024, when it closed at $476.05</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 1, 2024, when it rose 12.58%</li><li class=\"listItem-bmN0_SHH\">Currently up three of the past four days</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 7.91% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Feb. 2, 2024, when it rose 9.64%</li><li class=\"listItem-bmN0_SHH\">Up 8.84% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its all-time closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.16% from 52 weeks ago (Feb. 6, 2024), when it closed at $378.53</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its 52-week closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.71% from its 52-week closing low of $376.84 on Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $470.16; highest intraday level since Nov. 4, 2024, when it hit $480.74</li><li class=\"listItem-bmN0_SHH\">Up 9.61% at today's intraday high; largest intraday percent increase since Feb. 1, 2024, when it rose as much as 13.15%</li></ul><p class=\"\">All data as of 10:36:31 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008051:0/",
            "pub_date": "2025-02-04 23:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309014:0",
            "title": "Quebec Labor Union Vows Legal Action After Amazon Closes 7 Warehouses, Lays Off 1,700 Workers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309014:0/",
            "pub_date": "2025-02-04 23:40:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007969:0",
            "title": "Century Communities Sees Tariffs Hitting Remodelers Most — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007969:0/",
            "pub_date": "2025-02-04 23:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV22X:0",
            "title": "Ingredion Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc  reported quarterly adjusted earnings of $2.63​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.97.  The mean expectation of six analysts for the quarter was for earnings of $2.57 per share. Wall Street expected results to range from $2.53  to $2.60 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 6.3% to $1.80 billion from a year ago; analysts expected $1.87 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc's reported EPS for the quarter was $1.43​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $95 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc shares had fallen by 2.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 3.5% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the food processing peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Ingredion Inc is $168.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:30 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">2.57</p></td><td><p class=\"\">2.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.58</p></td><td><p class=\"\">3.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.49</p></td><td><p class=\"\">2.87</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.06</p></td><td><p class=\"\">2.08</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV22X:0-ingredion-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:31:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSkZDJra:0",
            "title": "WSLA Alumnae Group Announces Winners of 2025 Women in Sustainability Leadership Awards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">To Be Presented at WSLA Awards Ceremony During GreenBiz 25</p><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / One of the highlights of the GreenBiz 25 conference for sustainable business leaders, the Women in Sustainability Leadership Awards (WSLA Awards) will be presented at the 11th annual WSLA Awards ceremony Feb. 11, 2025, 6 pm - 8:30 pm MST at the Meritage Terrace of JW Marriott in Phoenix, AZ.</p><p class=\"\">The WSLA Awards will be hosted by the WSLA Alumnae Group, comprised of past WSLA Awards winners. This year's 11 honorees will join these other powerful women at the forefront of sustainability who are making a difference in the world by initiating lasting change. No other organization recognizes highly accomplished women in sustainability from such diverse, global, and multi-professional segments.</p><p class=\"\">And the WSLA Class of 2025 winners are….</p><p class=\"\">I<strong class=\"root-Tkn6WL2y\">rissol Arce</strong> - Senior Director, Sustainability at Northwestern Mutual</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Taryn Fuentes</strong> - Co-Founder of Carbon Real</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Irene Galindo</strong> - Second Councilor of Los Cabos</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Catherin Greene</strong>r - Founder, Greener Solutions Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Connie Hensler</strong> - Global Director of Environmental Management and Product Stewardship at Interface.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chris Hagler</strong> - Co-Founder and CEO of Impact Pathways</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Annie Lappé</strong> - Vice President, Strategy &amp; Impact at Pivot Energy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SheaJameel</strong>- Senior Director, Head of Sustainability for Marsh McLennan.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Christina Vernon Sanborn -</strong> Associate Principal, Sustainability Practice Leader at Mazzetti</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Dr. Cassandra Thiel</strong> - Assistant Professor at New York University; President and CEO of Clinically Sustainable Consulting LLC</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aurora Winslade</strong> - Director of Sustainability at Edison International.</p><p class=\"\">Said Rochelle Routman, WSLA Alumnae Group President and Chairperson of the Board, \"We look forward to welcoming these women leaders into the heart and soul of WSLA, which is an organization dedicated to recognizing women sustainability leaders that have a track record of selfless determination, persistence, and achievement. This award elevates these high achieving women, providing them with even greater influence to solve more complex challenges, which benefits all of us.</p><p class=\"\">Noted WSLA Alumnae Group Vice President and Board Member Lisa Colicchio, \"Congratulations to the WSLA winners of 2025! These women are champions of climate change leading the charge towards a sustainable future for all.\"</p><p class=\"\">The Feb. 11 WSLA Awards ceremony will feature opening words from GreenBiz Editor and WSLA Alumnae Group Board Member Heather Clancy, who will moderate a fireside chat in conversation with Laura Bishop, a WSLA Class of 2024 alumnae. Together they will explore the most pressing issues affecting life on earth.</p><p class=\"\">Tickets are $75. For more information and to purchase tickets, visit https://www.zeffy.com/en-US/ticketing/a20f99cd-5334-40a8-a6af-f41433ca6866</p><p class=\"\">Join an esteemed group of sponsors and enjoy great exposure with a prestigious audience before, during and after the event. To sponsor, see https://www.wsla.global/sponsors</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About WSLA</strong></p><p class=\"\">The WSLA Alumnae Group, a 501(c)(3) charitable organization, is a community of past Women in Sustainability Leadership Award winners: over 125 of the most influential women* trailblazers who have become a powerful force in the profession of creating a more sustainable world. The group's annual awards program, summits, service activities and mentorship opportunities continue to pave the way in sustainability and for future leaders in the field. For more information, visit https://www.wsla.global</p><p class=\"\">*<!-- -->WSLA welcomes a diversity of women to unite as a strong collective of unique lived experiences and perspectives committed to sustainability and impactful environmental stewardship. WSLA is a strong proponent, advocate, and practitioner of equity, diversity, inclusion, and justice and as such is an organization open to all women. Our definition of women is expansive and includes those who may identify as non-binary, genderqueer, gender-expansive, two-spirit, and otherwise do not exist within a gender binary.</p><p class=\"\"># # #</p><p class=\"\">PRESS CONTACT:</p><p class=\"\">Susan Bang</p><p class=\"\">HMTX Industries</p><p class=\"\">AT WSLA ALUMNAE GROUP:</p><p class=\"\">Rochelle Routman</p><p class=\"\">HMTX Industries</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read More</strong></p><p class=\"\">View additional multimedia and more ESG storytelling from WSLA Alumnae Group on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: WSLA Alumnae Group</p><p class=\"\">Website: https://www.3blmedia.com/profiles/wsla-alumnae-group</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> WSLA Alumnae Group</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSkZDJra:0/",
            "pub_date": "2025-02-04 23:31:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309007:0",
            "title": "Wells Fargo Adjusts Ulta Beauty Price Target to $360 From $370",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ulta Beauty  has an average rating of overweight and mean price target of $465.54, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309007:0/",
            "pub_date": "2025-02-04 23:31:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}