{
    "data": [
        {
            "id": "DJN_DN20250204009849:0",
            "title": "Quebec Premier Says Proposed Energy East Oil Pipeline Unlikely to Win Approval — OPIS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Quebec has not softened its opposition to a proposed pipeline that would move more than 1 million b/d of crude oil from western Canada to eastern provinces.</p><p class=\"\">Quebec Premier Francois Legault on Tuesday said he believes it's unlikely that the proposed Energy East pipeline that would carry oil from Alberta to tidal waters in St. John, New Brunswick, where it would have access to markets in Europe and elsewhere, can be approved.</p><p class=\"\">The Energy East project, which has been under discussion for more than a decade, has faced stiff opposition in Quebec, where residents in Montreal have raised concerns about possible contamination of drinking water. The line has also drawn opposition from environmental and some Indigenous groups.</p><p class=\"\">The project was canceled in 2017, but Alberta Premier Danielle Smith in January said the industry is \"dusting off proposals\" for domestic pipelines in response to President Trump's plans to impose tariffs on U.S. imports of Canadian crude, the Canadian Broadcasting Corp. reported in late January.</p><p class=\"\">The Trump administration on Saturday said it would impose 25% tariffs on goods imported from Canada and Mexico and a 10% tariff on Canadian crude imports. On Monday, he paused the implementation of tariffs for 30 days after both countries agreed to take steps to strengthen border security.</p><p class=\"\">The line, which has an estimated cost of $12 billion, could provide crude oil to Irving's 320,000 b/d New Brunswick refinery and reduce, if not eliminate, the need to import oil from the U.S. and other countries.</p><p class=\"\">Under the proposal, an existing natural gas pipeline would be converted to carry crude over a line that would rival some of the world's longest, running nearly 2,900 miles from Hardisty, Alberta to St. John.</p><p class=\"\">Irving in January said it had completed a strategic review of its operations and plans to hold on to its St. John refinery and will continue to operate as a privately held company.</p><p class=\"\">While Irving's review likely examined the refinery's dependence on foreign crude oil, market sources said they don't believe the company views the Energy East line as a project that could win approval or get funded.</p><p class=\"\">The project has support in Alberta and Nova Scotia, where Premier Tim Houston has called on the federal government to approve the line, but critics don't believe it can overcome Quebec's opposition.</p><p class=\"\">This content was created by Oil Price Information Service, which is operated by Dow Jones &amp; Co. OPIS is run independently from Dow Jones Newswires and The Wall Street Journal.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Reporting by Tom Kloza, tkloza@opisnet.com; Editing by Jeff Barber, jbarber@opisnet.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009849:0-quebec-premier-says-proposed-energy-east-oil-pipeline-unlikely-to-win-approval-opis/",
            "pub_date": "2025-02-05 04:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309208:0",
            "title": "Marathon Petroleum Shares Rise After Tudor Pickering Holt Upgrade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marathon Petroleum's  shares rose 6.2% in recent Tuesday trading after Tudor Pickering Holt upgraded its rating on the stock to hold from sell and boosted its price target to $153 from $147. </p><p class=\"\">Intraday volume topped 3.48 million shares versus the daily average of 2.67 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309208:0/",
            "pub_date": "2025-02-05 04:11:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:b401d4ed7094b:0",
            "title": "SF FED'S DALY Q&A/COMMONWEALTH CLUB: ASPIRATION FOR EVER HIGHER STANDARDS OF LIVING BEING FRUSTRATED, IN HOUSING, CHILD CARE ETC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:b401d4ed7094b:0-sf-fed-s-daly-q-a-commonwealth-club-aspiration-for-ever-higher-standards-of-living-being-frustrated-in-housing-child-care-etc/",
            "pub_date": "2025-02-05 04:13:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0MH:0",
            "title": "Latam markets rebound on relief after Trump pauses tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">MSCI EM stocks index logs biggest gain since September</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China slaps tariffs on US, expands mineral export control</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">MSCI Latam FX up 0.6%, stocks gain 1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mexico implements measures to ensure stability of financial markets</li></ul></span></div><span><p class=\"\">    Emerging market currencies rose broadly and stocks were set for their biggest gains in months on Tuesday, on relief after U.S. President Donald Trump temporarily suspended tariffs on Mexico and Canada. </p><p class=\"\">The global EM stocks measure <!-- -->CBOE:EFS<!-- --> was up 1.9%, logging its biggest one-day jump since September 2024. MSCI's index tracking Latin American currencies (.MILA00000CUS) rose 0.6%, while the stocks gauge (.MILA00000PUS) advanced 1%.</p><p class=\"\">All regional bourses were higher, with Argentina's Merval  up 1.8%, while Colombia's COLCAP (.COLCAP) gained 0.6%. </p><p class=\"\">Trump relieved Mexico and Canada from tariffs for 30 days, as the countries came to border security agreements. Most EM assets recouped heavy declines from a volatile session on Monday, including the Mexican peso  that had hit its lowest in nearly three years. </p><p class=\"\">The currency was down 1% against the dollar ahead of a local central bank monetary policy decision due later in the week. Banxico is widely expected to lower benchmark interest rates by 50 basis points. Mexican stocks  were 1.2% higher in their first session of trading after the change in tariff policy. </p><p class=\"\">\"The saga is not over, of course, and could be revisited again in early March, or when headlines emerge in the intervening period,\" said Thierry Wizman, global FX &amp; rates strategist at Macquarie.</p><p class=\"\">\"But the U.S. administration's decision to delay U.S. import tariffs on Mexico and Canada for 30 days supports our view that, in the final analysis, it will be \"concessions\", and not \"tariffs\" that will be the norm for U.S. allies.\"</p><p class=\"\">Mexico's finance ministry said it was implementing measures to guarantee the stability of financial markets following recent volatility in its peso and local stock exchange.</p><p class=\"\">China, however, could not escape the tariffs, and responded with limited countermeasures on U.S. imports and an expansion on control over mineral exports. Trump's call with the Chinese president, expected \"very soon\" according to the White House, will be awaited. </p><p class=\"\">Still, Hong Kong stocks  closed 2.8% higher.  </p><p class=\"\">Trump's threats of tariffs have kept EM investors on tenterhooks and clouded the growth outlook for EM economies, with many already grappling with fiscal concerns and prospects of higher for longer interest rates in the U.S. </p><p class=\"\">Some relief over tariffs also boosted copper prices, lifting the Chilean peso  to its highest since Dec. 10 and stocks  rose 0.9% in the world's largest copper producer. </p><p class=\"\">The real (BRBY=) was 0.6% higher, trading around levels last seen in November and on track for its twelfth session of gains, in its longest streak in 20 years. </p><p class=\"\">In the minutes of its last meeting, Brazil's central bank stressed that cooling economic activity is crucial for bringing inflation to target, while flagging risks from inflation expectations and an overheating economy. </p><p class=\"\">Brazil's Bovespa index  was the only outlier among bourses, down 0.2%, weighed by a 0.6% decline in oil heavy-weight Petrobras  after it reported a decrease in fourth-quarter production and lower sales and exports.</p><p class=\"\">Brazil's sovereign bond (BR10YT=RR) rose 9.7 cents on the dollar after the country's treasury estimated that federal public debt will rise up to 16% this year.</p><p class=\"\">10-year sovereign papers of Mexico (MX10YT=RR), Colombia &lt;CO10YT=RR&gt; and Chile (CL10YT=RR) added between 0.1 and 0.8 cent.</p><p class=\"\">Key Latin American stock indexes and currencies at 1937 GMT:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Latin American market prices from Reuters</p></td><td></td><td></td></tr><tr><td><p class=\"\">Equities</p></td><td><p class=\"\">Latest</p></td><td><p class=\"\">Daily % change</p></td></tr><tr><td><p class=\"\">MSCI Emerging Markets <!-- -->CBOE:EFS</p></td><td><p class=\"\">1094.75</p></td><td><p class=\"\">1.96</p></td></tr><tr><td><p class=\"\">MSCI LatAm (.MILA00000PUS)</p></td><td><p class=\"\">2048.4</p></td><td><p class=\"\">1.03</p></td></tr><tr><td><p class=\"\">Brazil Bovespa </p></td><td><p class=\"\">125446.37</p></td><td><p class=\"\">-0.23</p></td></tr><tr><td><p class=\"\">Mexico IPC </p></td><td><p class=\"\">51838.08</p></td><td><p class=\"\">1.23</p></td></tr><tr><td><p class=\"\">Chile IPSA </p></td><td><p class=\"\">7269.19</p></td><td><p class=\"\">0.9</p></td></tr><tr><td><p class=\"\">Argentina Merval </p></td><td><p class=\"\">2528840.02</p></td><td><p class=\"\">1.8</p></td></tr><tr><td><p class=\"\">Colombia COLCAP (.COLCAP)</p></td><td><p class=\"\">1514.42</p></td><td><p class=\"\">0.64</p></td></tr><tr><td><p class=\"\">Currencies</p></td><td><p class=\"\">Latest</p></td><td><p class=\"\">Daily % change</p></td></tr><tr><td><p class=\"\">Brazil real </p></td><td><p class=\"\">5.7682</p></td><td><p class=\"\">0.66</p></td></tr><tr><td><p class=\"\">Mexico peso </p></td><td><p class=\"\">20.5478</p></td><td><p class=\"\">-1.07</p></td></tr><tr><td><p class=\"\">Chile peso </p></td><td><p class=\"\">971.9</p></td><td><p class=\"\">1.27</p></td></tr><tr><td><p class=\"\">Colombia peso </p></td><td><p class=\"\">4162.5</p></td><td><p class=\"\">-0.1</p></td></tr><tr><td><p class=\"\">Peru sol </p></td><td><p class=\"\">3.712</p></td><td><p class=\"\">-0.19</p></td></tr><tr><td><p class=\"\">Argentina peso (interbank) </p></td><td><p class=\"\">1053.5</p></td><td><p class=\"\">0.02</p></td></tr><tr><td><p class=\"\">Argentina peso (parallel) (ARSB=)</p></td><td><p class=\"\">1195</p></td><td><p class=\"\">2.05</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0MH:0-latam-markets-rebound-on-relief-after-trump-pauses-tariffs/",
            "pub_date": "2025-02-05 04:14:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309210:0",
            "title": "Sector Update: Energy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were higher late Tuesday afternoon, with the NYSE Energy Sector Index adding 2.1% and the Energy Select Sector SPDR Fund (XLE) up 2%. </p><p class=\"\">The Philadelphia Oil Service Sector index climbed 2.5%, while the Dow Jones US Utilities index was down 0.6%. </p><p class=\"\">In sector news, China plans to impose 15% tariffs on US coal and liquefied natural gas imports and a 10% tariff on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. The move follows the Trump administration's announcement of a 10% additional tariff on imports from China late Friday. </p><p class=\"\">Front-month West Texas Intermediate crude oil was declining 0.7% to $72.63 a barrel while the global benchmark Brent crude contract was up 0.1% at $76.06 a barrel. Henry Hub natural gas futures fell 3% to $3.25 per 1 million BTU. </p><p class=\"\">In corporate news, WEC Energy  reported Q4 earnings Tuesday of $1.43 per diluted share, up from $0.69 a year earlier. Analysts polled by FactSet expected $1.44. Its shares shed 0.5%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309210:0-sector-update-energy/",
            "pub_date": "2025-02-05 04:14:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:b3ffd737d094b:0",
            "title": "SF FED'S DALY Q&A/COMMONWEALTH CLUB: SINGLE BEST WAY FOR FED TO SUSTAIN ITS INDEPENDENCE IS 'TO DO YOUR JOB,' BE ACCOUNTABLE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:b3ffd737d094b:0-sf-fed-s-daly-q-a-commonwealth-club-single-best-way-for-fed-to-sustain-its-independence-is-to-do-your-job-be-accountable/",
            "pub_date": "2025-02-05 04:15:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009861:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 3 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery, in a less volatile session, despite China's retaliation against the new U.S. tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The U.K. Has Dodged Trump's Tariffs So Far. Here Are Some (Very British) Reasons Why.</strong></p><p class=\"\">In his global tariff offensive, President Trump has said trade with the U.K., while out of line, can be worked out.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Is On Track to Become Health Secretary</strong></p><p class=\"\">Next, the full Senate will vote whether to confirm Robert F. Kennedy Jr.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009861:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-3-pm-et/",
            "pub_date": "2025-02-05 04:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009860:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 3 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Wells Fargo clears another postscandal regulatory hurdle - but more remain</strong></p><p class=\"\">The bank's stock rises as it fulfills two disciplinary orders from the Federal Reserve related to its mortgage business - but five more remain, including its asset cap.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Falls on RFK's Progress Towards Confirmation Despite Good Earnings. Its CEO is Unbothered.</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland draws dreaded 'sell' rating despite laying off hundreds</strong></p><p class=\"\">Archer Daniels Midland's efforts to boost its prospects by cutting hundreds of jobs failed to ignite much enthusiasm from one analyst, who has downgraded the food- and fuel-processing giant to sell from hold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009860:0-news-highlights-top-company-news-of-the-day-tuesday-at-3-pm-et/",
            "pub_date": "2025-02-05 04:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX23f2mr:0",
            "title": "Holladay Distillery breaks ground on ironclad rickhouse in latest growth spurt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Weston, Missouri, Feb.  04, 2025  (GLOBE NEWSWIRE) — In step with continued growth and increased consumer demand, the Weston, Missouri-based Holladay Distillery has broken ground on its new Rickhouse D, its fourth in a century of developing the only ironclad rickhouses in the state of Missouri. A giant in Missouri distilling history, Holladay built its first three on-site rickhouses in the early 1900s, 1930, and 1950. Seventy-five years after its last rickhouse, 2025’s development will mark Holladay’s latest stage of growth in its distilling legacy that dates back to 1856.</p><p class=\"\">Holladay’s Rickhouse D will be constructed over the course of eight to nine months in partnership with the St. Joseph-based construction company Al J. Mueller. Holladay’s active rickhouses span roughly 9,000 square feet and offer barrel capacity between 10,000 and 12,000. Rickhouse D will feature an 11,000-barrel capacity to maintain consistency across each bourbon. Holladay Distillery remains the only distillery in Missouri to age bourbon in ironclad rickhouses.</p><p class=\"\">“We’re proud to continue making Missouri history by expanding our capacity to distill, age, and distribute premium bourbon to a wider audience,” said Holladay Distillery's president, Mick Harris. “Rickhouse D is a significant investment into our future, as well as a commitment to continuing to meet growing demands for Holladay Bourbon.”</p><p class=\"\">The business took a bourbon distilling hiatus from 1985 to 2015 to focus on other spirits within its portfolio. In 2015, Holladay installed new equipment in its original stillhouse and began making bourbon onsite again for the first time in 30 years. The original 1856 Holladay mash bill was used for production, and after six years of aging, Ben Holladay Bourbon was released in 2022. In 2016, Holladay added a new mash bill to the lineup that included soft red wheat as an ingredient which led to the release of Holladay Soft Red Wheat Bourbon in 2023. Heightened demand for both products ultimately drove the distillery to expand its capacity for rickhouse aging.</p><p class=\"\">In addition to its flagship brands, Holladay Soft Red Wheat and Ben Holladay Bourbon, Holladay offers a Rickhouse Proof, and One Barrel Bourbons which are both bottled at the exact proof from the bourbon barrel yield after a minimum of six years’ aging in one of the original Holladay Rickhouses. Holladay also offers its Ancient Cave Collection, a series of bourbon aged in experimental barrels for a secondary finish. Each Holladay collection will benefit from the expanded capacity offered by the new Rickhouse D.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Holladay Distillery</strong></p><p class=\"\">Originally founded in 1856 by Ben Holladay, Holladay Distillery produces Missouri bourbon steeped in history, including Holladay Soft Red Wheat and Ben Holladay Bourbon, which uses an original recipe more than 160 years old. Located in Weston, Missouri, Holladay Distillery offers tours with the opportunity to explore fascinating local history and to experience Real Missouri Bourbon being made. Learn more at holladaybourbon.com. </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Holladay Distillery breaks ground on new rickhouse      </li></ul><p class=\"\">Claire Martin</p><p class=\"\">Trozzolo</p><p class=\"\">9136876499</p><p class=\"\">cmartin@trozzolo.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX23f2mr:0-holladay-distillery-breaks-ground-on-ironclad-rickhouse-in-latest-growth-spurt/",
            "pub_date": "2025-02-05 04:15:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309206:0",
            "title": "Timken Shares Rise After BofA Securities Upgrade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Timken's  shares were up 2.7% in recent Tuesday trading after BofA Securities upgraded the company's stock to neutral from underperform and adjusted its price target to $78 from $73. </p><p class=\"\">Trading volume stood at nearly 892,000 shares against a daily average of about 591,000.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309206:0/",
            "pub_date": "2025-02-05 04:05:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:3291a56d7094b:0",
            "title": "SF FED'S DALY Q&A/COMMONWEALTH CLUB: ASSUMPTION IN USA THAT GENERATIONS GROW IN ACHIEVEMENT HAS BEEN DISRUPTED THANKS IN PART TO INFLATION SURGE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:3291a56d7094b:0-sf-fed-s-daly-q-a-commonwealth-club-assumption-in-usa-that-generations-grow-in-achievement-has-been-disrupted-thanks-in-part-to-inflation-surge/",
            "pub_date": "2025-02-05 04:06:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009830:0",
            "title": "U.S. Natural Gas Futures Flit With Weather Outlook — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S. natural gas futures lose ground, but end above the day's lows as weather forecasts shift between colder and milder. The impact of China's decision to slap a 15% retaliatory tariff on imports of U.S. LNG is difficult to gauge, forecaster NatGasWeather.com says in a note. \"Weather trends the next few days will continue to be very important and are likely to dictate the direction of trade.\" The Nymex front month settles down 3% at $3.253/mmBtu. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009830:0/",
            "pub_date": "2025-02-05 04:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309167:0",
            "title": "Estee Lauder Earnings Outlook Misses Views Amid Asia Pacific Demand Challenges",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder's  outlook for third-quarter earnings fell well short of Wall Street's estimates as the cosmetic company expects sales pressure to intensify amid Asia Pacific demand challenges. </p><p class=\"\">It projects adjusted earnings per share to drop by 69% to 79% for the three months ending March 31 to between $0.20 and $0.30. Adjusted EPS on a constant currency basis was guided in the $0.24 to $0.34 range. The FactSet consensus is for third-quarter non-GAAP EPS of $0.61. </p><p class=\"\">The company expects reported sales to be down 10% to 12% from 2024's third-quarter sales of $3.94 billion. Second-quarter revenue fell 6% year-over-year to $4 billion. The consensus is for sales of $3.65 billion in the ongoing period. </p><p class=\"\">Shares of Estee Lauder plunged 16% in afternoon trade. </p><p class=\"\">Management withdrew the cosmetic company's full-year outlook at the end of October. </p><p class=\"\">\"Given challenges in the company's Asia travel retail business, subdued consumer sentiment in China and Korea, and evolving global geopolitical uncertainty, the company anticipates continued volatility and low visibility in the near term,\" Estee Lauder said Tuesday. \"Therefore, it is solely providing a fiscal 2025 third-quarter outlook.\"</p><p class=\"\">The second-quarter revenue of $4 billion still narrowly surpassed the $3.98 billion average analyst estimate in a FactSet survey. Adjusted EPS slid to $0.62 for the three months ended Dec. 31 from $0.88 a year earlier, but topped the Street's $0.32 view. </p><p class=\"\">Skin care sales declined 12% to $1.92 billion. In the company's makeup division, global sales fell 1% to $1.15 billion. They declined 8% to $159 million in hair care while ticking up 1% to $744 million in fragrance. </p><p class=\"\">Overall sales in the Asia Pacific slid 11%, while the Americas reported a 2% drop.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309167:0/",
            "pub_date": "2025-02-05 04:07:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV12X:0",
            "title": "Wall Street rallies, tariff tumult tips gold to record high",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. stocks rise after tariff reprieves on Canada, Mexico</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new highs amid trade tensions with China</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. job openings, factory orders fall, Fed rate cuts unlikely</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">New China duties take effect; Beijing retaliates</li></ul></span></div><span><p class=\"\">    U.S. stocks gathered momentum on Tuesday, while gold reached new highs as global trade jitters kept investors guessing.</p><p class=\"\">All three major U.S. stock indexes strengthened after last-minute negotiations resulted in one-month reprieves on President Donald Trump's 25% levies against Canada and Mexico.</p><p class=\"\">But safe-haven investors continued to favor gold after a 10% tariff against China went into effect; tariffs which prompted Beijing to announce its own retaliatory tariffs against U.S. energy exports and expand its control over the export of critical minerals. </p><p class=\"\">China also warned Alphabet  and other American firms of potential sanctions.</p><p class=\"\">Trump's trade advisor said the president will speak with Chinese President Xi Jinping later on Tuesday.</p><p class=\"\">\"The tariff news is back-and-forth and heightened uncertainty and yet the market seems to want to go up,\" said Thomas Martin, Senior Portfolio Manager at GLOBALT in Atlanta.</p><p class=\"\">But Martin does not expect much to be resolved between Trump and Xi. </p><p class=\"\">\"I expect there to be more room for continued escalation, because I don't think the Chinese government is going back down,\" Martin added. \"They're still an enemy.\"</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:885.6548856548857px;aspect-ratio:1.476091476091476\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV12X-2e65580770a3cd36a16c27d131484759-resized.webp\" type=\"images/webp\"/><img alt=\"U.S. futures and foreign currencies fell then rallied on tariff news\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV12X-2e65580770a3cd36a16c27d131484759-resized.jpeg\" style=\"background-color:#f4f4f3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Trump's tariff approach sends currencies and stocks on wild ride</span></figcaption></figure></span></p><p class=\"\">Data showed U.S. job openings and factory orders both fell more than expected in December, pointing to some economic dampening, but not enough to convince the U.S. Federal Reserve to continue down its rate-cutting path anytime soon.</p><p class=\"\">        The Dow Jones Industrial Average  rose 163.58 points, or 0.37%, to 44,585.49, the S&amp;P 500  rose 45.32 points, or 0.75%, to 6,039.74 and the Nasdaq Composite  rose 249.66 points, or 1.29%, to 19,641.62.</p><p class=\"\">European shares ended a choppy session modestly higher as investor focus shifted to quarterly earnings reports, while anxieties over U.S. tariffs igniting a broader trade war were moved to the back burner. </p><p class=\"\">        MSCI's gauge of stocks across the globe <!-- -->EURONEXT:IACWI<!-- --> rose 8.18 points, or 0.95%, to 867.51.</p><p class=\"\">The STOXX 600  index rose 0.22%, while Europe's broad FTSEurofirst 300 index (.FTEU3) rose 4.51 points, or 0.21%. Emerging market stocks <!-- -->CBOE:EFS<!-- --> rose 20.87 points, or 1.94%, to 1,094.59. MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) closed higher by 1.94%, to 575.37, while Japan's Nikkei  rose 278.28 points, or 0.72%, to 38,798.37.</p><p class=\"\">U.S. 10-year Treasury yields gained ground on the Mexico and Canada tariff delays, while yields on two-year notes, which are tied to the Federal Reserve's policy moves, dipped after the JOLTS data.</p><p class=\"\">The yield on benchmark U.S. 10-year notes  fell 2.8 basis points to 4.513%, from 4.543% late on Monday. The 30-year bond (US30YT=RR) yield fell 2.1 basis points to 4.75% from 4.771% late on Monday.</p><p class=\"\">The 2-year note (US2YT=RR) yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 5.1 basis points to 4.214%, from 4.265% late on Monday.</p><p class=\"\">The dollar lost ground after duties against Chinese goods took effect.</p><p class=\"\">The dollar index , which measures the greenback against a basket of currencies including the yen and the euro, fell 0.56% to 107.97, with the euro  up 0.35% at $1.038. Against the Japanese yen , the dollar weakened 0.29% to 154.3.</p><p class=\"\">The Mexican peso &lt;MXN=&gt; weakened 1.01% versus the dollar at 20.551.</p><p class=\"\">The Canadian dollar  strengthened 0.79% versus the greenback to C$1.43 per dollar.</p><p class=\"\">        In cryptocurrencies, bitcoin  fell 1.33% to $100,513.00. Ethereum (ETH=) rose 1.01% to $2,843.53.</p><p class=\"\">Crude prices pared their losses after a U.S. official said President Trump plans to restore his \"maximum pressure\" campaign on Iran, which would include driving its oil exports down to zero in order to stop Tehran from obtaining a nuclear weapon.</p><p class=\"\">U.S. crude  fell 0.63% to $72.70 per barrel, while Brent  rose to $76.20 per barrel, up 0.32% on the day.</p><p class=\"\">Gold prices continued to rally, hitting fresh highs as investors flocked to the safe-haven metal.</p><p class=\"\">Spot gold  rose 1.06% to $2,843.46 an ounce. U.S. gold futures (GCc1) rose 0.62% to $2,851.40 an ounce.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV12X:0-wall-street-rallies-tariff-tumult-tips-gold-to-record-high/",
            "pub_date": "2025-02-05 04:07:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV16F:0",
            "title": "CBOT wheat gains on technical buying, weaker dollar",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Chicago Board of Trade wheat futures closed higher on Tuesday after hitting their highest level since November on technical buying, a weaker dollar and relief over the suspension of planned U.S. tariffs against Mexico.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CBOT March soft red winter wheat (WH25) settled up 10-1/4 cents to $5.77 a bushel.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">K.C. March hard red winter wheat (KWH25) ended up 9 cents at $5.94-3/4 per bushel.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Minneapolis March spring wheat (MWEH25) ended unchanged at $6.16-1/2 a bushel.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Weakness in the dollar also helped boost prices, as it makes U.S. farm products look more attractive to global buyers.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Wheat has remained under pressure from sluggish export demand and improved monthly crop condition ratings in Kansas, the top U.S. winter wheat producer.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Condition ratings for winter wheat improved during the month of January in Kansas but worsened in Oklahoma, Colorado and Nebraska, states where soil moisture declined, the U.S. Department of Agriculture said on Monday.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Grain consultancy Sovecon raised its Russian wheat export forecast for the 2025/2026 season to 38.3 million tonnes from 36.4 million. Russian wheat exports for the 2024/2025 season are seen at 42.8 million tonnes, Sovecon said.</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV16F:0-cbot-wheat-gains-on-technical-buying-weaker-dollar/",
            "pub_date": "2025-02-05 04:07:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309195:0",
            "title": "CyberArk Software Expected to Issue 2025 Annual Recurring Revenue Outlook In Line With Prior Guides, UBS Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CyberArk Software  is expected to issue net new annual recurring revenue outlook for 2025 in line with prior guidance when it reports its Q4 results, UBS said in a note Tuesday. </p><p class=\"\">UBS said it expects the company to issue flat net new annual recurring revenue, or NNARR, guidance for the calendar year, consistent with previous outlooks, which would also reflect any potential upside to consensus estimates for $68 million NNARR in Q4. </p><p class=\"\">UBS also said that the company would have a \"more mixed setup\" near-term but its partners \"continue to sound positive\" on 2025. </p><p class=\"\">The investment firm said it sees potential for upside to 2025 numbers as the Venafi acquisition could open up a cross-sell opportunity to around 8,500 of CyberArk's non-overlapping customers. Even a modest cross-sell could represent a third to a half of 2025 NNARR, though there is some risk associated if CyberArk \"does not nail the integration,\" according to UBS. </p><p class=\"\">The firm said it was raising its price target to $440 from $400 while maintaining a buy rating on the stock. </p><p class=\"\">CYBR shares were up 0.9% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309195:0/",
            "pub_date": "2025-02-05 04:08:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0NW:0",
            "title": "Bird flu spurs diner chain Waffle House to add 50-cent fee per egg",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    U.S. diner chain Waffle House has added a 50-cent surcharge for every egg in a customer’s order, the company said in a statement posted in its restaurants on Monday.</p><p class=\"\">The fee is temporary, the company said in a statement Tuesday, and is a response to a “dramatic increase in egg prices” caused by bird flu outbreaks.</p><p class=\"\">\"While we hope these price fluctuations will be short-lived we cannot predict how long this shortage will last,” the statement read. </p><p class=\"\">The privately-held chain is known for its low prices. A standard American breakfast with two eggs is sold for $7.75 in Norcross, Georgia, where the company is headquartered. That meal is now $1 more expensive.</p><p class=\"\">The price of U.S. wholesale eggs hit an all-time high in December, according to commodity data firm Expana, with a dozen eggs going for $5.57 in the Midwest and $8.85 in California.</p><p class=\"\">The main factor driving egg prices higher is damage to the laying flock from bird flu. The virus wiped out more than 20 million chickens in the U.S. last quarter, data from the U.S. Department of Agriculture shows, the highest toll since the beginning of the outbreak in 2022.</p><p class=\"\">The chain said it has 2,100 locations across the United States. Its website says it serves 272 million eggs every year.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0NW:0-bird-flu-spurs-diner-chain-waffle-house-to-add-50-cent-fee-per-egg/",
            "pub_date": "2025-02-05 04:09:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:15ae0d6f04b51:0",
            "title": "HUNT J B TRANSPORT SERVICES EVP Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Mcgee Eric</td></tr><tr><td>Relationship</td><td>EVP of ICS</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$557,700</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1705956/000156218025000866/xslF345X05/primarydocument.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Eric McGee, EVP of ICS at HUNT J B TRANSPORT SERVICES, sold 3,300 shares of Common Stock on February 4, 2025, at a price of $169.0 per share, totaling $557,700. Following the transaction, McGee directly owns 825 shares of Common Stock and 6,497 shares in a Common Stock 401(k).</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1705956/000156218025000866/xslF345X05/primarydocument.xml\" rel=\"nofollow\" target=\"_blank\">HUNT J B TRANSPORT SERVICES INC [ JBHT ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:15ae0d6f04b51:0-hunt-j-b-transport-services-evp-sells-shares/",
            "pub_date": "2025-02-05 04:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309207:0",
            "title": "J B Hunt Transport Services Insider Sold Shares Worth $557,700, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eric McGee, Executive Vice President, Highway Services, on February 04, 2025, sold 3,300 shares in J B Hunt Transport Services  for $557,700. Following the Form 4 filing with the SEC, McGee has control over a total of 7,322 common shares of the company, with 7,322 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/728535/000156218025000866/xslF345X05/primarydocument.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/728535/000156218025000866/xslF345X05/primarydocument.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309207:0/",
            "pub_date": "2025-02-05 04:10:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309209:0",
            "title": "CIBC FICC Strategy; 2yr Sector Update & Auction Preview; CAN 3% Feb27s",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb27s Auction Preview: Tomorrow, CIBC noted Tuesday, will bring C$5.5 billion (est. C$1.06mn/dv01) of the CAN 3% Feb27s for the fifth and final time. CIBC noted auction sizing has remained unchanged over the Feb27s' life, consistent with the projections from the latest Fall Economic Statement. Upon settlement, the Feb27s will have C$27.5bn outstanding, making it the largest free float issue in the sector. At the time of writing, CIBC said, the building roll stood around -1.1bps, versus average fair value of -1.5bps. But, the bank added, a cursory examination of the relationship between issuance and discounts to fair value suggests that rising supply was worth near 2.4bps, implying the roll \"isn't trading cheap enough.\"</p><p class=\"\">2y Sector RV: Recently, CIBC said, we've seen a clear dislocation in behaviour between Bank-owned and non-Bank-owned bonds, where the former have richened on spline during both rallies and selloffs. This, it added, is likely due to a mix of supply dynamics as well as elevated volatility. On some of CIBC's RV metrics, it finds that shorter bonds like the Feb26s and Apr26s appear cheap, while the incumbent Nov26s look rich. However, looking at the valuation of recent 2yr rolls, CIBC finds that the building roll is roughly in line with what it would expect. \"Moreover, given that we see no catalysts to drive the Nov26s/Feb27s roll richer, we think that more opportunities lie in the macro space.\"</p><p class=\"\">2yr Sector Macro: CIBC noted the past few sessions have clearly been dominated by tariff developments, with terminal rates \"whipsawing\" on new pieces of information. In CIBC's view, the market is braced for a swift resolution with very little impact. As such, it said, the balance of risk tilts to the downside, which implies richer front-end yields and a steeper 5s30s curve. However, CIBC added, an outcome that's more robust to any resolution to the conflict is the rising cost of USDs. Namely, according to CIBC, the Bank of Canada's announcement on the end of QT, in tandem with potentially lower domestic exports to the US or rising imports from the US 'should' result in a wider cross-currency basis. \"Resultingly,\" it said, \"GoC 2yr valuation to for USD investors is likely to cheapen even further from already-cheap levels, which could entice receiving flows from our southern neighbours. As such, we see some scope for further CA/US 2yr outperformance in the near term.\"</p><p class=\"\">2yr Sector Trading Thoughts: CIBC said with \"very few catalysts to support a richening of the building roll\", it sees no value in owning it coming out of tomorrow's auction. Moreover, the bank added, with few consistent signals on the broader micro, it thinks better opportunities lie in the macro. Here, CIBC sees scope for a wider cross-currency basis, which should improve the valuation of CAD duration for USD investors. Accordingly, it likes positioning for further tightening of the CA/US 2yr spread in the near term.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309209:0/",
            "pub_date": "2025-02-05 04:10:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:757ced7fa094b:0",
            "title": " Will Trump’s trade war bring an early end to the Bitcoin bull market? ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitcoin’s sharp drop below $92,000 on Feb. 3 rattled the crypto market, triggering an astounding $2.1 billion in liquidations. Initially, investors seemed to brace for economic hardship from the US President Donald Trump’s tariff war announcement. However, concerns quickly shifted to whether Bitcoin (BTC) had already peaked and was about to enter a downtrend.</p><p class=\"\">Adding to the anxiety, Bitcoin Archive noted that every past BTC bull market had topped within 330 days of breaking the prior cycle’s all-time high. Feb. 4 marks day 328. </p><p class=\"\">Yet, Bitcoin quickly rebounded after the drop. The pause on Mexico and Canada tariffs announced on Feb. 3, and President Trump’s Crypto Czar David Sacks scheduled speech on Feb. 4 seem to have reassured the market. The Fear &amp; Greed Index, which briefly dipped to 44 (fear), has since surged to 72 (greed), despite China’s announcement of retaliatory tariffs on Feb. 4. </p><p class=\"\">This raises the question of whether the market rebounded too quickly. Macroeconomic and geopolitical challenges remain, posing the risk that Bitcoin traders could be walking into a bull trap. Onchain data can offer deeper insight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin demand remains strong</strong></p><p class=\"\">As the tariff war scare demonstrated, Bitcoin demand remains strong, consistently absorbing pullbacks—even at historically high levels above $90,000.</p><p class=\"\">Glassnode analysis of Bitcoin’s bull market drawdowns suggests that demand for BTC could rise, possibly triggering the market’s “second euphoric phase.” Historical data shows that in the past three cycles (2011-2015, 2015-2018, and 2018-2022), corrections averaged around 25%, followed by an acceleration in price performance during the final third of the bull run. The current bull market is yet to experience such an acceleration.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-e5d0ef5f67bd98c5c394a3b1b6b9a417-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-e5d0ef5f67bd98c5c394a3b1b6b9a417-resized.jpeg\" style=\"background-color:#f2f4f4\"/></picture></div></figure></span></p><p class=\"\">On the supply side, a key metric to watch is the Long/Short Term Holder Threshold. It tracks capital rotation from long-term investors to new buyers, providing a clearer view of supply dynamics.</p><p class=\"\">Bitcoin cycle peaks often align with long-term holders taking profits and offloading their coins to newcomers. Glassnode data shows that this is not the case yet. While long-term holders have transferred over 1 million BTC to new buyers since Nov. 2024, they still retain a significantly larger share of the supply, signaling confidence in even higher prices ahead.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-31a0cdf6f0c431974b3fafd316ebdc8a-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-31a0cdf6f0c431974b3fafd316ebdc8a-resized.jpeg\" style=\"background-color:#dbe3f7\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">How high can Bitcoin go in 2025?</strong></p><p class=\"\">Additional data from Glassnode shows the 2022–2025 cycle has closely mirrored the 2015–2018 cycle so far. However, an exact repeat is unlikely. In 2017, Bitcoin’s all-time high multiplied its price by 113x, while the next peak delivered a 20x return. As Bitcoin matures, each cycle’s growth ratio has declined, requiring increasingly larger capital inflows to sustain new price levels.</p><p class=\"\">So far, BTC has risen 6x from its cycle lows of $16,000 in December 2023, suggesting an expected multiplier in the range of 10x to 13x. This would mean a peak between $160,000 and $210,000—a target range that aligns with many analysts’ forecasts. VanEck’s head of digital assets research, Matthew Sigel, expects Bitcoin to hit $180,000, while Bitwise Asset Management and Bernstein anticipate $200,000. Tom Lee, CNBC contributor and Managing Partner at Fundstrat, predicts a $250,000 Bitcoin price.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-827a2b9300525ea812cd39afd09ab146-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-827a2b9300525ea812cd39afd09ab146-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">When will Bitcoin top?</strong></p><p class=\"\">Technical analyst CryptoCon views Bitcoin’s relative strength index (RSI) as rather precise in determining the cycle’s phases. RSI is a momentum oscillator that measures the speed and magnitude of price movements, helping identify overbought and oversold conditions in an asset. </p><p class=\"\">By analyzing the instances when the RSI approached the 99% threshold, CryptoCon determines the key cycle stages. Their data suggests that Bitcoin entered the fourth cycle phase in November 2024, pointing to a likely market top around September–October 2025.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1109.0252707581228px;aspect-ratio:1.848375451263538\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-7a3a2d04f94f1b2339948a70f4d027dc-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-7a3a2d04f94f1b2339948a70f4d027dc-resized.jpeg\" style=\"background-color:#f6f6f8\"/></picture></div></figure></span></p><p class=\"\">Another historically accurate indicator for identifying market tops is the Pi Cycle Top. This metric tracks the 111-day moving average (111DMA) and a multiple of the 350-day moving average (350DMA x 2). In previous cycles, Bitcoin’s price has peaked when the 111DMA crosses above the 350DMA x 2.</p><p class=\"\">According to the Bitcoin Pi Cycle Top Prediction, which extrapolates these moving averages to estimate the next peak, Bitcoin is expected to top out around Sept. 26, 2025.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.1538461538462px;aspect-ratio:1.7769230769230768\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-720520c045be9f5beca4a0cd536f5093-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:757ced7fa094b-720520c045be9f5beca4a0cd536f5093-resized.jpeg\" style=\"background-color:#060605\"/></picture></div></figure></span></p><p class=\"\">While no indicator is perfect, the market’s resilience and continued demand suggest that the real top may still be ahead.</p><p class=\"\">This article does not contain investment advice or recommendations. Every investment and trading move involves risk, and readers should conduct their own research when making a decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:757ced7fa094b:0-will-trump-s-trade-war-bring-an-early-end-to-the-bitcoin-bull-market/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1US:0",
            "title": "Insurance broker WTW beats fourth-quarter profit estimates on robust product demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Insurance broker Willis Towers Watson  beat Wall Street estimates for fourth-quarter profit on Tuesday, driven by a strong performance in its risk and brokerage business.</p><p class=\"\">Businesses increased spending on insurance products as they prioritized financial security to safeguard against risks, despite higher premium prices.</p><p class=\"\">Insurance brokers' commissions are tied to the premiums insurers charge.</p><p class=\"\">Revenue from Willis Towers Watson's risk and broking unit, which advises clients on risk management and lets them negotiate and place policies with insurers, rose 6% from a year earlier to $1.14 billion, on the back of higher new business activity and strong client retention.</p><p class=\"\">However, the company's shares are down 4.1% at $317.1.</p><p class=\"\">\"The stock's decline is likely tied to concerns around free cash flow, buyback levels and reinsurance costs,\" said TD Cowen analyst Andrew Kligerman.</p><p class=\"\">\"Organic revenue growth of 5% was in line with consensus, but below 3Q24's 6%, so investors may be disappointed in that as well,\" he added.</p><p class=\"\">Meanwhile, the company's largest segment - health, wealth and career - saw revenue rise to $1.85 billion from $1.80 billion a year earlier, boosted by increased project work and brokerage income in North America. </p><p class=\"\">Willis Tower Watson posted adjusted net income of $827 million, or $8.13 per share, for the three months ended Dec. 31, compared with $775 million, or $7.44 per share, a year earlier.</p><p class=\"\">Analysts on average were expecting earnings of $8.03 per share, according to data compiled by LSEG.</p><p class=\"\">Total revenue in the quarter jumped 4% from a year earlier to $3.04 billion.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:828.7937743190661px;aspect-ratio:1.3813229571984436\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV1US-1d01aa64c43c229734d423b267fbdc5d-resized.webp\" type=\"images/webp\"/><img alt=\"Willis Towers Watson's stock performance in 2024 compared with its peers\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV1US-1d01aa64c43c229734d423b267fbdc5d-resized.jpeg\" style=\"background-color:#d8d2e5\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Willis Towers Watson's stock performance in 2024 compared with its peers</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1US:0-insurance-broker-wtw-beats-fourth-quarter-profit-estimates-on-robust-product-demand/",
            "pub_date": "2025-02-05 04:01:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC75JRVP:0",
            "title": "Raketech Announces EUR 48.5 Million Impairment Charge",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Raketech Group Holding PLC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAKETECH ANNOUNCES A NON-CASH INTANGIBLE ASSETS IMPAIRMENT CHARGE AND PRELIMINARY Q4 2024 TRADING UPDATE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAKETECH GROUP HOLDING PLC - ANNOUNCES EUR 48.5 MILLION IMPAIRMENT CHARGE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAKETECH GROUP HOLDING PLC - EXPECTS Q4 2024 REVENUES OF EUR 12.3 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAKETECH GROUP HOLDING PLC - EXPECTS Q4 ADJUSTED EBITDA OF EUR 3.2 MILLION (EUR 6.0 MILLION)</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC75JRVP:0-raketech-announces-eur-48-5-million-impairment-charge/",
            "pub_date": "2025-02-05 04:02:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3NB15C:0",
            "title": "Encino's owner mulls $7 billion sale, IPO of energy producer, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Canadian pension fund CPP Investments is weighing strategic options, including a sale or initial public offering, for Encino Acquisition Partners that could value the U.S. oil and natural gas producer at as much as $7 billion, including debt, people familiar with the matter said.</p><p class=\"\">The deliberations come as the energy industry is anticipating tailwinds from the administration of President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a>, which has put forward an economic agenda tailored to boost fossil-fuel production, as it speeds up permits for energy projects and rolls back environmental protections. </p><p class=\"\">Moreover, the booming demand for artificial intelligence and data centers is expected to drive a jump in U.S. power demand, which in turn is likely to boost the need for natural gas to fuel power generation.</p><p class=\"\">Houston, Texas-based Encino, which is majority-owned by CPP, is in the early stages of evaluating options and is working on selecting investment banks to lead the review process, the sources said, requesting anonymity as the matter is confidential. A deal is expected to happen later this year, the sources said, cautioning that Encino's plans are subject to market conditions. </p><p class=\"\">Encino and CPP declined to comment.</p><p class=\"\">Encino operates in the Utica shale basin of Ohio and is one of the largest privately owned oil and gas exploration and production companies in the United States. </p><p class=\"\">It was formed in 2017 as a partnership to buy and develop U.S. oil and gas assets. Under the terms of the agreement, CPP Investments invested $1 billion in the venture, while oil and gas producer Encino Energy agreed to operate the acquired assets.</p><p class=\"\">A year later, Encino Acquisition Partners bought Chesapeake Energy's Ohio assets for $2 billion. CPP Investments said in April 2024 it would invest another $300 million in the business to help accelerate the development of the company's assets.</p><p class=\"\">In January, Infinity Natural Resources raised $265 million from its IPO and the company's shares jumped on their debut in New York. The positive market reaction to the natural gas producer's stock market launch helped accelerate Encino's decision to explore its options, one of the sources said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3NB15C:0-encino-s-owner-mulls-7-billion-sale-ipo-of-energy-producer-sources-say/",
            "pub_date": "2025-02-05 04:04:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV150:0",
            "title": "Boeing executive says supplier Spirit Aero has a substantial inventory of 737 fuselages",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Boeing 's key supplier Spirit AeroSystems  has a substantial inventory of 737 fuselages that are ready to ship, an executive with the planemaker told a Seattle aerospace conference on Tuesday. </p><p class=\"\">The U.S. planemaker is working to grow production of its 737 MAX jet to at least 38 a month this year after drastically curbing output in 2024 following quality concerns after a mid-air panel blowout on a near-new model. </p><p class=\"\">Ihssane Mounir, Boeing senior VP for global supply chain and fabrication, told the Pacific Northwest Aerospace Alliance (PNAA) supplier conference that the quality of the Spirit Aero-produced fuselage has significantly improved. </p><p class=\"\">Boeing is aiming to improve quality by minimizing the transfer of work from one supplier to another within its vast supply chain, a shift that Mounir said is the leading cause of quality defects.</p><p class=\"\">Boeing is in the process of buying financially-strapped Spirit Aero even as the planemaker tries to revive its battered supply chain after a weeks-long strike last year by its Northwest factory workers halted most jet output. </p><p class=\"\">   Wichita-based Spirit Aero has increased fuselage production from a rate of 21 a month to 31 a month, a source familiar with the matter told Reuters.</p><p class=\"\">   Spirit Aero spokesperson Joe Buccino said the company \"remains committed to meeting our customer's production targets.\"</p><p class=\"\">Boeing said last month it has $87.5 billion in inventory, ample enough to allow it to produce its strongest-selling 737 MAX at a rate of 38 a month.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV150:0-boeing-executive-says-supplier-spirit-aero-has-a-substantial-inventory-of-737-fuselages/",
            "pub_date": "2025-02-05 04:05:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009776:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 3 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fewer Americans Are Quitting Their Jobs</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery, in a less volatile session, despite China's retaliation against the new U.S. tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The U.K. Has Dodged Trump's Tariffs So Far. Here Are Some (Very British) Reasons Why.</strong></p><p class=\"\">In his global tariff offensive, President Trump has said trade with the U.K., while out of line, can be worked out.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Is On Track to Become Health Secretary</strong></p><p class=\"\">Next, the full Senate will vote whether to confirm Robert F. Kennedy Jr.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009776:0/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009775:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 3 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Wells Fargo clears another postscandal regulatory hurdle - but more remain</strong></p><p class=\"\">The bank's stock rises as it fulfills two disciplinary orders from the Federal Reserve related to its mortgage business - but five more remain, including its asset cap.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Falls on RFK's Progress Towards Confirmation Despite Good Earnings. Its CEO is Unbothered.</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland draws dreaded 'sell' rating despite laying off hundreds</strong></p><p class=\"\">Archer Daniels Midland's efforts to boost its prospects by cutting hundreds of jobs failed to ignite much enthusiasm from one analyst, who has downgraded the food- and fuel-processing giant to sell from hold.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009775:0/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009794:0",
            "title": "Front Month Nymex ULSD Fell 1.35% to Settle at $2.4298 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex ULSD for March delivery lost 3.33 cents per gallon, or 1.35% to $2.4298 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage decline since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Down 5.47 cents or 2.20% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage decline since Tuesday, Jan. 28, 2025</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the seventh lowest this year</li><li class=\"listItem-bmN0_SHH\">Lowest settlement value since Thursday, Jan. 9, 2025</li><li class=\"listItem-bmN0_SHH\">Off 18.03% from its 52-week high of $2.9642 hit Friday, Feb. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Up 18.07% from its 52-week low of $2.058 hit Tuesday, Sept. 10, 2024</li><li class=\"listItem-bmN0_SHH\">Down 11.41% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 7.29% from its 2025 settlement high of $2.621 hit Friday, Jan. 17, 2025</li><li class=\"listItem-bmN0_SHH\">Up 3.49% from its 2025 settlement low of $2.3478 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Off 52.69% from its record high of $5.1354 hit Thursday, April 28, 2022</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 10.92 cents or 4.71%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009794:0-front-month-nymex-ulsd-fell-1-35-to-settle-at-2-4298-data-talk/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009795:0",
            "title": "Front Month Nymex RBOB Gasoline Fell 0.88% to Settle at $2.0990 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex RBOB Gasoline for March delivery lost 1.87 cents per gallon, or 0.88% to $2.0990 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage decline since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Down two of the past three sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the seventh highest this year</li><li class=\"listItem-bmN0_SHH\">Off 25.63% from its 52-week high of $2.8223 hit Tuesday, April 16, 2024</li><li class=\"listItem-bmN0_SHH\">Up 12.25% from its 52-week low of $1.87 hit Tuesday, Sept. 10, 2024</li><li class=\"listItem-bmN0_SHH\">Down 5.34% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 2.77% from its 2025 settlement high of $2.1589 hit Wednesday, Jan. 15, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.42% from its 2025 settlement low of $2.0102 hit Wednesday, Jan. 8, 2025</li><li class=\"listItem-bmN0_SHH\">Off 50.91% from its record high of $4.2762 hit Thursday, June 9, 2022</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 9.75 cents or 4.87%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009795:0-front-month-nymex-rbob-gasoline-fell-0-88-to-settle-at-2-0990-data-talk/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009788:0",
            "title": "Front Month Nymex Natural Gas Fell 2.95% to Settle at $3.2530 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex Natural Gas for March delivery lost 9.90 cents per million British thermal units, or 2.95% to $3.2530 per million British thermal units today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Down five of the past seven sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the third lowest this year</li><li class=\"listItem-bmN0_SHH\">Off 23.60% from its 52-week high of $4.258 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 106.54% from its 52-week low of $1.575 hit Tuesday, March 26, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 61.92% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 23.60% from its 2025 settlement high of $4.258 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.87% from its 2025 settlement low of $3.044 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Off 78.85% from its record high of $15.378 hit Tuesday, Dec. 13, 2005</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is down 38.00 cents or 10.46%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009788:0-front-month-nymex-natural-gas-fell-2-95-to-settle-at-3-2530-data-talk/",
            "pub_date": "2025-02-05 04:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}