{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463197:0",
            "title": "Black Canyon's Drill Program Confirms Resource Upgrade Potential at Western Australia Manganese Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Black Canyon  said reverse circulation infill drilling from the KR2 prospect in its Balfour manganese field project in Western Australia returned thick zones of manganese-enriched shale, according to a Tuesday Australian bourse filing. </p><p class=\"\">The results demonstrated manganese mineralization from surface to near-surface, including an intercept of 36 meters at 15.5% manganese from the surface, including 17 meters at 17.2% manganese from 13 meters. </p><p class=\"\">The resource upgrade will allow it to update its scoping study to target improved cash flow.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463197:0/",
            "pub_date": "2025-02-04 13:34:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0EB:0",
            "title": "India's Bharat Wire slides to near 2-year low on qtrly profit fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Bharat Wire Ropes  slide as much as 6.2% to 165.5 rupees, their lowest in nearly two years </p><p class=\"\">** Steel wire ropes maker's Dec-qtr net profit fell ~44% y/y to 148.8 mln rupees ($1.7 mln)</p><p class=\"\">** Expenses grew 16%, outpacing a ~3% rise in rev from ops </p><p class=\"\">** Stock last down 4.7%; it has fallen ~27% since its reporting Sept-qtr results on Oct. 28</p><p class=\"\"> ($1 = 87.1075 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0EB:0-india-s-bharat-wire-slides-to-near-2-year-low-on-qtrly-profit-fall/",
            "pub_date": "2025-02-04 13:34:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463198:0",
            "title": "China Development Bank Issues More than 20 Billion Yuan in Loans to Boost Public Infrastructure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China Development Bank in 2024 allocated 20.4 billion yuan in loans to support 136 \"dual-use public infrastructure\" projects in cities including Beijing, Shenzhen, and Fuzhou, Xinhua News Agency reported Monday. </p><p class=\"\">The initiative aligns with China's goals to enhance affordable housing, urban renewal and dual-use infrastructure. </p><p class=\"\">Guan Hongyan, CDB's transportation department head, said the policy bank plans to expand medium- and long-term financing for such projects.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463198:0/",
            "pub_date": "2025-02-04 13:26:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463195:0",
            "title": "Sunway REIT Reports Higher DPU in Q42024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sunway REIT  distribution per unit or DPU jumped 14.1% year over year in the fourth quarter of 2024 to 5.34 ringgit from 4.68 ringgit a year earlier. </p><p class=\"\">Realized profit for the period attributable to unitholders soared 29.1% to 94.7 million ringgit from 73.4 million ringgit, according to a filing with Bursa Malaysia on Monday. </p><p class=\"\">Net property income increased by 22% to 165.6 million ringgit from 135.7 million ringgit. </p><p class=\"\">Meanwhile, revenue was up 15.9% annually to 220.9 million ringgit from 190.5 million ringgit in the year-ago period.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463195:0/",
            "pub_date": "2025-02-04 13:27:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV04K:0",
            "title": "Palm falls on weakness in Chicago soyoil",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Malaysian palm oil futures slipped on Tuesday after five straight sessions of gains, as Chicago soyoil prices tumbled on news that the U.S. would delay implementing import tariffs on Mexico and Canada.</p><p class=\"\">The benchmark palm oil contract  for April delivery on the Bursa Malaysia Derivatives Exchange slid 90 ringgit, or 2.06%, to 4,277 ringgit ($960.04) a metric ton at the midday break.</p><p class=\"\">The crude palm oil futures were dragged down by weakness in the Chicago soyoil market, a Kuala Lumpur-based trader said.</p><p class=\"\">\"The news that the U.S. will postpone imposing import tariffs on Mexico and Canada caused a heavy sell-off in Chicago soybean oil this morning,\" the trader said.           </p><p class=\"\">Soyoil prices on the Chicago Board of Trade  were down 3.48%. The Dalian Commodity Exchange was closed for the Chinese Lunar New Year and will reopen on Wednesday.</p><p class=\"\">Palm oil tracks the price movements of rival edible oils, as it competes for a share of the global vegetable oils market.   </p><p class=\"\">Oil prices retreated after U.S. President Donald Trump agreed to hold off imposing steep tariffs on Mexico and Canada, the two biggest foreign oil suppliers to the United States, for a month. O/R</p><p class=\"\">Brent crude futures  fell 0.78% to $75.38 a barrel by 0505 GMT. Weaker crude oil futures make palm a less attractive option for biodiesel feedstock. </p><p class=\"\">The ringgit , palm's currency of trade, strengthened 0.29% against the dollar, making the commodity more expensive for buyers holding foreign currencies.</p><p class=\"\">Brazil's 2024/25 soybean crop is expected to reach a record 174 million metric tons, agribusiness consultancy Celeres said, bumping up its forecast from a prior 170.8 million tons due to positive weather conditions.</p><p class=\"\">Palm oil may retrace into a range of 4,265 ringgit to 4,315 ringgit per ton, as it failed to break resistance at 4,402 ringgit, Reuters technical analyst Wang Tao said. TECH/C</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:541.875px;max-width:1200px;aspect-ratio:2.2145328719723185\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV04K-3d959a10773850217558cc8f5d126f81-resized.webp\" type=\"images/webp\"/><img alt=\"tech/c\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV04K-3d959a10773850217558cc8f5d126f81-resized.jpeg\" style=\"background-color:#f6f0ed\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">cpo</span></figcaption></figure></span></p><p class=\"\">($1 = 4.4550 ringgit)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV04K:0-palm-falls-on-weakness-in-chicago-soyoil/",
            "pub_date": "2025-02-04 13:27:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463200:0",
            "title": "Market Chatter: Shein Returns to India Following Five-Year Ban",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shein has returned to India five years after its ban in the country through a long-term license deal with Reliance Retail, BBC reported Monday. </p><p class=\"\">The Chinese fast-fashion company reestablished itself in India but will be subject to strict terms such as saving all data within India, the report said, citing remarks by Commerce Minister Piyush Goyal in December. </p><p class=\"\">India banned Shein and other Chinese apps, such as TikTok, in 2020, according to the BBC. </p><p class=\"\">The ban was driven by data privacy concerns and tensions with China over its border in the Himalayas, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463200:0/",
            "pub_date": "2025-02-04 13:27:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463192:0",
            "title": "Resmed Incorporated's Fiscal 2Q Revenue, NPAT Results Above Consensus; Jarden Research Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Resmed Incorporated  reported \"solid results\" for the fiscal second quarter, driven by strong device sales in the US, Jarden Research said in a Jan.31 note. </p><p class=\"\">Revenue for the period reached $1.282 billion, a 10.3% year-on-year increase, though it was 0.3% below Jarden's estimate of $1.285 billion and 1% but ahead of consensus at $1.27 million, Jarden said. </p><p class=\"\">Net profit after tax came in at $358.3 million, up 29.2% year-on-year, 0.3% below Jarden's estimate of $359.5 million, but 4.4% above consensus of $343.3 million, Jarden added. </p><p class=\"\">Jarden sees further improvement in the company's gross margin in the second half of the fiscal. </p><p class=\"\">The broker also expects the $2 million foreign exchange impact to turn neutral in the third quarter of the fiscal. </p><p class=\"\">While the company's freight has stabilized, it is too early to determine if they could provide any upside, the broker said. </p><p class=\"\">Jarden Research has an overweight rating and a price target of AU$36.60 on Resmed Incorporated.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463192:0/",
            "pub_date": "2025-02-04 13:28:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446476:0",
            "title": "Egypt Non-Oil Private Sector Growth at Over 4-Year High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Egypt PMI increased to 50.7 in January 2025, up from 48.1 in December 2024, marking the first expansion in the non-oil private sector since last August. The latest figure also represents the highest reading since November 2020, signaling that a pick-up in domestic market conditions had driven sales higher, supported by a softening of cost pressures as some material prices fell.</p><p class=\"\">Total business activity and new orders rose modestly, with growth rates the fastest observed in over four years.</p><p class=\"\">Meanwhile, employment stabilized after a two-month run of job cuts, driven by rising sales.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446476:0-egypt-non-oil-private-sector-growth-at-over-4-year-high/",
            "pub_date": "2025-02-04 13:28:41",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000066:0",
            "title": "China Probes Google Over Potential Violation of Antitrust Law",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sherry Qin</p><p class=\"\">China's market regulator has initiated an investigation into technology giant Google on suspected violation of antitrust law.</p><p class=\"\">The investigation will be carried out by the State Administration for Market Regulation, the regulator said on Tuesday.</p><p class=\"\">The statement, however, didn't provide further details on the probe.</p><p class=\"\">Google didn't immediately respond to a request for comments.</p><p class=\"\">The probe comes amid heightened tensions between the U.S. and China, particularly around trade and technology.</p><p class=\"\">Earlier this week, President Trump announced 10% tariffs on Chinese goods that have now taken effect. Beijing has also responded with its own tariff measures, including levies on imports of coal and liquefied natural gas.</p><p class=\"\">Write to Sherry Qin at sherry.qin@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000066:0/",
            "pub_date": "2025-02-04 13:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV04F:0",
            "title": "China tariffs on, but everything's negotiable",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A look at the day ahead in European and global markets from Tom Westbrook</p><p class=\"\">Markets have taken the one-month delay in tariffs on Canada and Mexico as a signal that everything's negotiable. Even for China.</p><p class=\"\">Canada's Justin Trudeau and Mexico's Claudia Sheinbaum got on the phone to Donald Trump on Monday and told him they had agreed to bolster border enforcement efforts.</p><p class=\"\">Sheinbaum won plaudits from political analysts for her approach and investors seemed to relax - sort of.</p><p class=\"\">Hong Kong shares  touched a two-month high, led by electric vehicle makers, as investors turned more hopeful that China - hit by a 10% tariff - will end up cutting a deal. </p><p class=\"\">The euro  rebounded from a two-year low around $1.01 back to $1.03 in one of its biggest round-trips in recent years as fears of an imminent trade war seemed to subside. </p><p class=\"\">Crypto traders bought the big dip in bitcoin  and ether (ETH=).</p><p class=\"\">Yet, the wild ride has left so many things unclear. As J.P. Morgan's Michael Feroli points out, it has increased policy uncertainty in a way that is hard to reverse. </p><p class=\"\">European stock futures  rose only 0.1% in Asia.</p><p class=\"\">Focus in the session may also fall on numerous results announcements spanning financials such as Amundi , UBS  and BNP Paribas , as well as on businesses with exposure to tariffs such as Ferrari , Infineon  and Diageo .</p><p class=\"\">Google parent Alphabet  reports earnings after market close in New York.   </p><p class=\"\">On China, Trump has said that tariffs \"are going to go substantially higher\" unless it stops \"sending us fentanyl\".</p><p class=\"\">China says it has already cracked down on the drug trade and that <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/investigates/special-report/drugs-fentanyl-supply-chain-process/\" rel=\"nofollow\" target=\"_blank\">fentanyl</a> - a synthetic drug that is 50 times stronger than heroin - is a problem for the U.S. to sort out.</p><p class=\"\">Trump's press secretary has said he will speak with Chinese President Xi Jinping in the next couple of days.</p><p class=\"\">The outcome of that conversation, as well as how Beijing handles its dollar exchange rate when Chinese markets return from a week-long holiday on Wednesday, will be in focus.</p><p class=\"\">Most expect the yuan's trading band fixing to be fairly steady. After Monday's rollercoaster, the offshore yuan - at around 7.31 per dollar - is still technically within the bounds of where the onshore trading band closed last week. </p><p class=\"\">It is not clear what sort of deal Europe could cut to avoid tariffs that Trump has threatened.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:896.8421052631579px;aspect-ratio:1.4947368421052631\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV04F-19fd28a148e43c97cc3425e73e87608d-resized.webp\" type=\"images/webp\"/><img alt=\"A chart showing stock swings for General Motors and Ford Motor on news of President Trump's tariffs\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV04F-19fd28a148e43c97cc3425e73e87608d-resized.jpeg\" style=\"background-color:#f8f7f9\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Detroit automakers lurch on tariff moves</span></figcaption></figure></span></p><p class=\"\">Key developments that could influence markets on Tuesday:</p><p class=\"\">- Earnings: Amundi, BNP Paribas, Dassault Systemes, Diageo, Ferrari, Infineon Technologies, UBS, Alphabet </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV04F:0-china-tariffs-on-but-everything-s-negotiable/",
            "pub_date": "2025-02-04 13:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463194:0",
            "title": "Global Bioenergies to Co-develop Improved Sustainable Aviation Fuels Process",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Global Bioenergies  and an undisclosed international industrial company signed a term sheet to formulate a lower-cost process for sustainable aviation fuels, or SAF. </p><p class=\"\">The French sustainable chemicals production company combined its bio-isobutene process with the industrialist's proprietary technology, which reduced the procedure's carbon emissions, according to a Monday release. </p><p class=\"\">Assuming successful development, the technology is projected to supply mandated and targeted SAF volumes starting in 2030, with potential applications in the cosmetics sector.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463194:0/",
            "pub_date": "2025-02-04 13:20:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000077:0",
            "title": "KKR Raises Tender-Offer Price for Fuji Soft",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kosaku Narioka</p><p class=\"\">KKR said Tuesday that it decided to raise its tender-offer price for Japanese software company Fuji Soft to 9,850 yen a share from 9,451 yen.</p><p class=\"\">The U.S. investment company will also extend the tender-offer period through Feb. 19, it said in a regulatory filing.</p><p class=\"\">KKR has been competing with rival Bain Capital to acquire Fuji Soft.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000077:0-kkr-raises-tender-offer-price-for-fuji-soft/",
            "pub_date": "2025-02-04 13:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463188:0",
            "title": "Market Chatter: US State Secretary Praises Panama for Not Renewing Belt and Road Initiative Commitment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US Secretary of State Marco Rubio lauded Panama for allowing its participation in China's Belt and Road Initiative to expire, according to the secretary's post on social media platform X, formerly known as Twitter. </p><p class=\"\">Panama's President Jose Raul Mulino said the country will not renew its contribution to the Chinese infrastructure initiative or could exit it early, Reuters reported Monday. </p><p class=\"\">The remarks came after Mulino met with Rubio, who visited Panama as his first trip abroad as the top Trump administration diplomat, the report said. </p><p class=\"\">China protested against Panama's decision, with the country's United National Ambassador Fu Cong calling it a \"regrettable decision,\" the media outlet reported. </p><p class=\"\">The US has launched a \"smear campaign\" against the initiative and the Western countries' criticism of the plan is \"totally groundless\", Reuters quoted Fu as saying. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463188:0/",
            "pub_date": "2025-02-04 13:21:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV057:0",
            "title": "India's GAIL issues swap tender for 12 LNG cargoes, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GAIL (India) Ltd  has issued a swap tender offering 12 liquefied natural gas (LNG) cargoes for loading in the United States in exchange for 12 cargoes to be delivered to India in 2026, two industry sources said on Tuesday.</p><p class=\"\">GAIL, India's largest gas distributor, is offering the cargoes for loading, one in each month of the year, from Sabine Pass on a free-on-board (FOB) basis.</p><p class=\"\">In exchange, the company is seeking the cargoes for delivery to the Dhamra terminal on a delivered ex-ship (DES) basis in the same timeframe.</p><p class=\"\">The swap tender closes on Feb. 19.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV057:0-india-s-gail-issues-swap-tender-for-12-lng-cargoes-sources-say/",
            "pub_date": "2025-02-04 13:21:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000078_20250204000078:0",
            "title": "South Korea's Kospi Trims Gains, Last 0.8% Higher at 2472.49",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000078_20250204000078:0/",
            "pub_date": "2025-02-04 13:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446475:0",
            "title": "NZX50 Rebounds as Trump Delays Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand’s benchmark S&amp;P/NZX 50 index closed 0.7% higher at 12,905 on Tuesday, rebounding from a more than 1% drop in the previous session, as the US halted tariffs on Mexican and Canadian goods, temporarily averting a trade war.</p><p class=\"\">However, uncertainty remained as markets awaited details, with Trump yet to reach a deal with China on a potential exemption from the additional 10% tariffs set to take effect later today.</p><p class=\"\">In New Zealand, investors are now awaiting the country’s Q4 jobless rate data, set for release on Wednesday.</p><p class=\"\">A weak report could strengthen the case for further rate cuts by the RBNZ, with markets anticipating a 50bps reduction to 3.75% this month.</p><p class=\"\">Among key stocks, Fisher &amp; Paykel Healthcare, Monday’s biggest loser, gained 2.3%.</p><p class=\"\">Skellerup rose 0.2%, with Forsyth Barr noting that the 10% China tariff would have minimal impact on earnings.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446475:0-nzx50-rebounds-as-trump-delays-tariffs/",
            "pub_date": "2025-02-04 13:23:49",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000050_20250204000084:0",
            "title": "China Says PVH, Illumina Discriminate Against Chinese Companies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000050_20250204000084:0/",
            "pub_date": "2025-02-04 13:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000050_20250204000082:0",
            "title": "China Puts PVH, Illumina in Unreliable Entity List, Ministry of Commerce Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000050_20250204000082:0/",
            "pub_date": "2025-02-04 13:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463199:0",
            "title": "Tah Hsin Industrial Sells Nearly NT$419 Million Worth of Stake in TSMC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tah Hsin Industrial  sold 390,000 shares of Taiwan Semiconductor Manufacturing or TSMC  for roughly NT$418.9 million. </p><p class=\"\">The company sold the shares between Oct. 11, 2024, and Feb. 3, 2025, at an average price of NT$1,074 apiece, according to a Monday Taiwan Exchange filing. </p><p class=\"\">The transaction resulted in a gain of NT$197.0 million.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463199:0/",
            "pub_date": "2025-02-04 13:25:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463196:0",
            "title": "Mahanagar Gas Acquires 44% Stake in International Battery Company India",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mahanagar Gas  has completed the acquisition of a 44% stake in International Battery Company India (IBC India) for 353.6 million Indian rupees, making it an associate company, according to a Monday filing to the Indian stock exchanges. </p><p class=\"\">The company has invested in 4,371,065 equity shares of IBC India, which was incorporated to carry out manufacturing, promotion, marketing, distribution, sale and export of the battery cells. </p><p class=\"\">The acquisition is part of Mahanagar Gas' plan to jointly manufacture and sell battery cells in India with US-based International Battery Company. </p><p class=\"\">IBC US and the company plan to run the Indian business through IBC India.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463196:0/",
            "pub_date": "2025-02-04 13:25:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000058_20250204000067:0",
            "title": "Hang Seng Tech Index Pares Gains, Last Up 2.9% at 4876.38",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000058_20250204000067:0/",
            "pub_date": "2025-02-04 13:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463191:0",
            "title": "Market Chatter: Airbus Explores Possible European Space Venture with Thales, Leonardo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">French aerospace company Airbus  reportedly mandated Goldman Sachs Group to advise on the formation of a space and satellite business with Thales  and Leonardo (LDO.MI) that can compete with Elon Musk's SpaceX. </p><p class=\"\">France-based defense and technology group Thales is in talks with advisers, while Italian aerospace company Leonardo is working with Bank of America for the plan termed Project Bromo, Bloomberg News reported Tuesday, citing people familiar with the matter. </p><p class=\"\">Talks related to the creation of the European space venture are at an exploratory stage and no service offerings are determined yet. The three-way venture will also be subject to antitrust considerations, the report noted. </p><p class=\"\">Airbus, Goldman Sachs, Leonardo and Thales did not immediately respond to requests for comments from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463191:0/",
            "pub_date": "2025-02-04 13:16:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU1B8:0",
            "title": "Egypt's non-oil private sector posts growth in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Egypt's non-oil private sector expanded in January, marking its best performance in over four years and its first growth since August as output and sales volumes increased, a business survey showed on Tuesday.</p><p class=\"\">S&amp;P Global's headline Purchasing Managers' Index (PMI) rose to 50.7 in January from 48.1 in December, signalling a renewed improvement in the sector's health at the start of 2025.</p><p class=\"\">A PMI reading above 50.0 indicates growth, while below that level points to a contraction. </p><p class=\"\">January's figure was the highest since November 2020, driven by a pick-up in domestic market conditions and a softening of cost pressures, which helped boost sales. However, uncertainty over the sustainability of this upturn weighed on business expectations and hiring.</p><p class=\"\">\"The ceasefire deal between Israel and Hamas likely added confidence to markets in January,\" said David Owen, Senior Economist at S&amp;P Global Market Intelligence. \"That said, business expectations for the next 12 months remain subdued, showing that firms are still uncertain about economic stability over the longer term.\"</p><p class=\"\">The output sub-index climbed to 51.1 from 47.1 in December, while the new orders index rose to 51.3 from 46.4. </p><p class=\"\">Despite the positive start to the year, firms remained cautious about future activity, with expectations slipping to a near historic low. Employment levels stabilised after two months of job cuts, but hiring was limited.</p><p class=\"\">The sub-index for expected future output fell to 52.8 from 53.8 in December. </p><p class=\"\">Cost pressures eased to an eight-month low, with input prices rising at a slower pace. This allowed firms to raise output prices only slightly, marking the softest increase in four-and-a-half years. </p><p class=\"\">While the construction sector saw a decrease in purchase costs, other sectors experienced slower inflation than in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU1B8:0-egypt-s-non-oil-private-sector-posts-growth-in-january-pmi-shows/",
            "pub_date": "2025-02-04 13:16:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000071:0",
            "title": "EMEA Morning Briefing: Stock Futures Rise After U.S. Delays Mexico, Canada Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Watch For:</p><p class=\"\">Trading updates from UBS, BNP Paribas, Intesa Sanpaolo, Diageo, Infineon Technologies, Vodafone Group, Publicis</p><p class=\"\">Opening Call:</p><p class=\"\">European and U.S. stock futures gained alongside advances by Asian benchmarks following a delay to U.S. tariffs on Canada and Mexico. The dollar fell; Treasury yields edged higher; while oil and gold futures fell.</p><p class=\"\">Equities:</p><p class=\"\">Stock futures were higher early Tuesday, while markets across Asia staged a relief rally as risk sentiment improved after President Trump and the leaders of Mexico and Canada reached a deal to put tariffs on hold for a month.</p><p class=\"\">Meanwhile, China hopes to negotiate over the 10% extra being imposed on its exports to the U.S. Beijing is readying an opening bid to try to head off greater tariff increases and technology restrictions.</p><p class=\"\">The on-again, off-again tariffs briefly hit the market on Monday, before fear evaporated. What it shows: Investors are convinced he will use tariffs to extract concessions on other issues, rather than, as he keeps saying, to raise money and force companies to relocate to America.</p><p class=\"\">Forex:</p><p class=\"\">The U.S. dollar is likely to maintain its safe-haven status in 1H, DBS's Philip Wee said. Trade uncertainties loom despite the U.S. delaying tariffs on Canada and Mexico, the senior forex strategist said, adding there's potential volatility in markets from Trump's unpredictability.</p><p class=\"\">Meanwhile, Trump has given notice that the European Union is next in line for U.S. tariffs, Wee noted. Also, there was no 30-day reprieve for the additional 10% tariff on Chinese imports, with markets awaiting responses from Chinese President Xi, Wee said.</p><p class=\"\">Bonds:</p><p class=\"\">The corporate-debt market has so far shrugged off Trump's tariff announcements. After a brief disruption in debt issuance, companies of varying credit quality are expected to resume debt sales Tuesday, bankers and analysts say.</p><p class=\"\">\"After monitoring how things are going, it feels like the tone is a lot better,\" said Meghan Robson, head of U.S. credit strategy for BNP Paribas.</p><p class=\"\">\"As long as we're on a Fed pause, we think credit can do well,\" said Robson. \"When you get rate hikes, we'd start to be more concerned about fundamentals, but we think we're still a ways away from that.\"</p><p class=\"\">Energy:</p><p class=\"\">Volatility remains high in crude oil markets as the threat of U.S. tariffs continues to loom, ANZ said. Trump's calls for OPEC to lower prices were meanwhile ignored, as the group decided not to make any changes to its existing oil production plans, ANZ added. The OPEC+ alliance is likely awaiting more clarity on other Trump policies, ANZ said.</p><p class=\"\">Metals:</p><p class=\"\">Despite the U.S. deal to delay tariffs on Canada and Mexico, \"uncertainty over trade and tariffs continues to buoy gold prices,\" ING said.</p><p class=\"\">The bank said the precious metal had risen to a new all-time high after Trump's initial imposition of tariffs as investors sought safe havens. ING added that dollar strength has offset some strength in gold overnight.</p><p class=\"\">-</p><p class=\"\">Copper gained in Asian trade. Uncertainty over tariffs is likely to keep volatility high in commodity markets, ANZ said. Base metals had been under pressure recently due to demand concerns stemming from the impending trade war, it said.</p><p class=\"\">TODAY'S TOP HEADLINES</p><p class=\"\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</p><p class=\"\">President Donald Trump is pausing plans for 25% tariffs on goods from Mexico and Canada after separate meetings with the leaders of both nations.</p><p class=\"\">Canada Prime Minister Justin Trudeau said in a social media post on Monday afternoon that the threatened tariffs had been paused for \"at least\" 30 days.</p><p class=\"\">Bitcoin rebounds after Trump pauses Mexico, Canada tariffs. Here's why the crypto reacts to tariffs.</p><p class=\"\">Bitcoin rebounded to above $100,000 by Monday evening, after President Donald Trump said he would pause imposing tariffs on Mexico and Canada.</p><p class=\"\">Bitcoin BTCUSD, the largest cryptocurrency by market capitalization, experienced a weekend selloff, falling to as low as $91,229 early Monday, its lowest level since Jan. 13, according to Dow Jones Market Data.</p><p class=\"\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</p><p class=\"\">BRUSSELS-European leaders, bracing for a fight with President Trump over the world's most valuable trading relationship, said they are ready to strike back but prefer cooperation.</p><p class=\"\">Trump over the weekend announced punishing tariffs on Canada and Mexico and made clear that U.S. allies across the Atlantic were high on his target list. He later agreed to pause tariffs on Canada and Mexico for one month.</p><p class=\"\">Tariffs Will Be Especially Bad for Europe. What They Mean for European Stocks.</p><p class=\"\">With friendly trade partners like these, who needs enemies? That is what European countries must be thinking as President Donald Trump prepares to target them with his next round of taxes on imported goods.</p><p class=\"\">After unveiling 25% levies on goods from Canada and Mexico, as well as an additional 10% tax on Chinese products, Trump said Sunday that he would soon move on to Europe.</p><p class=\"\">Apple escaped tariffs last time. This time, it may have to raise prices.</p><p class=\"\">Apple Inc. was one of the luckier consumer-electronics companies when it got exemptions from the tariffs imposed by the first Trump administration on many goods made in China.</p><p class=\"\">But this time, it might not be quite as fortunate.</p><p class=\"\">Nvidia's stock falls as these two questions dog investors</p><p class=\"\">Nvidia Corp.'s stock fell Monday as investors weighed the potential for tariffs to impact chip companies and continued to assess the fallout from DeepSeek.</p><p class=\"\">Shares of Nvidia NVDA slid 2.8% to rank among the worst performers in the PHLX Semiconductor Index SOX. The stock pared losses after President Donald Trump said he had agreed to pause the Mexico tariffs for a month. A similar deal to delay tariffs on Canada came later in the day. China still faces 10% tariffs starting at midnight.</p><p class=\"\">Write to singaporeeditors@dowjones.com</p><p class=\"\">Expected Major Events for Tuesday</p><p class=\"\">01:01/IRL: Jan Ireland Manufacturing PMI</p><p class=\"\">07:00/ROM: Dec PPI</p><p class=\"\">08:00/SPN: Jan Unemployment</p><p class=\"\">16:00/DEN: Jan Foreign Exchange &amp; Liquidity</p><p class=\"\">All times in GMT. Powered by Onclusive and Dow Jones.</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000071:0-emea-morning-briefing-stock-futures-rise-after-u-s-delays-mexico-canada-tariffs/",
            "pub_date": "2025-02-04 13:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000050_20250204000072:0",
            "title": "China Imposes Additional 10% Tariffs on U.S. Crude Oil, Agricultural Machinery, Vehicles",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000050_20250204000072:0/",
            "pub_date": "2025-02-04 13:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0C6:0",
            "title": "India's Divi's Lab gains again on Q3 print; analysts flag good execution, key risk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Divi's Laboratories  rises ~5% in second session of gains post Q3 results</p><p class=\"\">** Co's custom synthesis segment grows 45% y/y in Q3</p><p class=\"\">** BOB Capital upgrades to \"hold\" from \"sell\", citing co's effective opportunity utilisation in the fast growing segment</p><p class=\"\">** Jefferies retains \"hold\" despite custom synthesis improving product mix and profit</p><p class=\"\">** Says co needs to overcome high rev concentration of key heart failure drug the patent for which will expire in 2026</p><p class=\"\">** Co working on glucose stabilising hormone GLP-1 manufacturing process to diversify</p><p class=\"\">** Systematix Equities says DIVI seeing interest in GLPs from several MNCs; has strong position due to backward integration</p><p class=\"\">** But retains \"sell\" on rich stock valuation</p><p class=\"\">** DIVI rated \"hold\" on avg; mean PT of 5,427 rupees is 12.2% downside to current price of 6,185.7 rupees</p><p class=\"\">** Stock up 66% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0C6:0-india-s-divi-s-lab-gains-again-on-q3-print-analysts-flag-good-execution-key-risk/",
            "pub_date": "2025-02-04 13:17:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463193:0",
            "title": "Tropicana Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tropicana  bought back 420,000 shares for 490,603 ringgit on Monday, according to a same-day Malaysian bourse disclosure. </p><p class=\"\">The shares were repurchased by the real estate firm at between 1.160 ringgit and 1.170 apiece, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463193:0/",
            "pub_date": "2025-02-04 13:17:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446473:0",
            "title": "India Shares Trade at Near 4-Week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">India's equities advanced 523 points, or 0.7%, to 77,684, while the Nifty 50 was above 23,500 in Tuesday morning trade, tracking a rise in Asian peers as concerns about a potential trade war eased after U.S. President Donald Trump delayed tariffs on Canada and Mexico for a month.</p><p class=\"\">The BSE Sensex hit its highest level in nearly four weeks, halting losses from the previous session, mainly supported by gains in metals, oil &amp; gas, banking, and tech sectors.</p><p class=\"\">Additionally, mid-cap and small-cap stocks gained, rising over 1% each.</p><p class=\"\">The RBI interest rate decision, which will be announced later this week, also lifted sentiment, with the market expecting the central bank to cut rates by 25 bps amid a slowdown in GDP growth.</p><p class=\"\">Among the early top performers were Tata Motors (2.6%), Larsen &amp; Toubro (2.2%), ICICI Bank (1.9%), Axis Bank (1.9%), and IndusInd Bank (1.8%).</p><p class=\"\">By contrast, Power Grid fell 1.3% after posting a 4% YoY fall in its consolidated net profit for the December 2024 quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446473:0-india-shares-trade-at-near-4-week-high/",
            "pub_date": "2025-02-04 13:18:23",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0D7:0",
            "title": "India's Welspun Enterprises slides on Q3 profit decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Welspun Enterprises  fall 6.1% to 564.5 rupees</p><p class=\"\">** Stock heads for biggest daily pct decline in over three months </p><p class=\"\">** The infrastructure developer's Q3 consol profit fell 3.6% to 770.5 mln rupees ($8.9 mln)</p><p class=\"\">** Co's rev rose 22.7% to 8.67 bln rupees while expense jumped ~30% to 8.02 bln rupees     </p><p class=\"\">** WELS moved below its 50-day and 100-day simple moving avgs after the results    </p><p class=\"\">** More than 1.6 mln shares traded, 4.4x its 30-day moving avg</p><p class=\"\">** Stock sees most active day in over eight months</p><p class=\"\">** WELS rose 88.3% in 2024, gaining for fifth straight year</p><p class=\"\">($1 = 87.0275 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0D7:0-india-s-welspun-enterprises-slides-on-q3-profit-decline/",
            "pub_date": "2025-02-04 13:19:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446474:0",
            "title": "Japan 10-Year Yield Hits Near 14-Year High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan’s 10-year government bond yield climbed to around 1.27% on Tuesday, reaching its highest levels in nearly 14 years as the suspension of US tariffs on Mexico and Canada reduced safe-haven demand for JGBs.</p><p class=\"\">Late on Monday, U.S. President Donald Trump agreed to “immediately pause” the planned tariffs on Mexico and Canada for a month following successful negotiations with their leaders.</p><p class=\"\">Additionally, Japan’s Finance Ministry was scheduled to auction off 2.6 trillion yen of 10-year JGBs on Tuesday, putting further upward pressure on domestic yields.</p><p class=\"\">Investors are also looking ahead to Wednesday’s release of Japan’s latest wage figures, which could influence the outlook for Bank of Japan monetary policy.</p><p class=\"\">The BOJ raised interest rates again in January and has signaled its readiness to hike rates further if economic and price trends align with forecasts.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446474:0-japan-10-year-yield-hits-near-14-year-high/",
            "pub_date": "2025-02-04 13:20:41",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        }
    ]
}