{
    "data": [
        {
            "id": "DJN_SN20250204006323:0",
            "title": "As Trump's tariffs grip markets, a key indicator flashes a warning for bullish investors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">Bank of America says Wall Street strategists are too bullish.</p><p class=\"\">The news pipeline has had this stock market and investors thrashing about lately. And that looks set to continue, with China now jumping into the tariff fray, and equities looking weaker for Tuesday.</p><p class=\"\">That's as we're still in the belly of earnings season, with results from a big Nvidia competitor looming after the close.</p><p class=\"\">Stepping away from the headlines that make the market these days, our call of the day from Bank of America flags a contrarian stock market indicator that they say is just a whisker away from a \"sell signal.\"</p><p class=\"\">BofA's sell side indicator, tracks average recommended equity allocations by Wall Street strategists. In January, that indicator climbed to 57%, the highest since early 2022 and a mere 1 percentage point shy from a sell signal, Savita Subramanian, equity and quant strategist, and her colleague Victoria Roloff, told clients in a note.</p><p class=\"\">In other words, when so many strategists are saying buy stocks, the best plan of action may be to not follow the herd. When the indicator has been at the 57% level or higher, returns for the next 12 months were positive  65% of the time versus 82% overall, BofA said.</p><p class=\"\">So the bank's voicing caution in a crowded market, as they put it.</p><p class=\"\">\"The [sell-side indicator] has been a reliable contrarian indicator. In other words, it has been bullish when Wall Street was extremely bearish and vice versa,\" and now sits at the closest to a sell signal since December 2021, said Subramanian and Roloff.</p><p class=\"\">Last month, those strategists left their equity allocations unchanged after a 2.8% gain for the S&amp;P 500 SPX in December, which suggests a wait-and-see approach on trade tensions and any policy risks, said the BofA team.</p><p class=\"\">\"The current level of 57% implies an estimated price return of 10.5% over the [next twelve months], lower than the past two years but still healthy. We see this as support for our view that 2025 is a year for buying stocks, not the index,\" they said.</p><p class=\"\">Societe Generale has predicted 2025 will be the best stock picking period in 25 years, citing reflationary policies from President Trump's administration, such as lower taxes, less regulation and lower oil prices, which they say can all yield potential stock picking ideas.</p><p class=\"\">Plus: Stock market's wild ride on Monday could be a microcosm of what to expect in 2025</p><p class=\"\">The markets</p><p class=\"\">U.S. stock-index futures (ES00) (NQ00) are turning higher, though Dow industrials futures are lagging. Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y are rising, and the ICE Dollar Index dollar DXY is down 0.4%. Oil prices (CL.1) are also dropping.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              5994.57    -0.29%  0.32%   1.92%  21.28% <br/>   Nasdaq Composite                                                     19,391.96  0.26%   -2.38%  0.42%  24.33% <br/>   10-year Treasury                                                     4.574      3.00    -13.20  -0.20  45.10 <br/>   Gold                                                                 2843.2     3.65%   7.42%   7.73%  39.27% <br/>   Oil                                                                  72.04      -1.45%  -1.89%  0.24%  -1.04% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">China slapped retaliatory tariffs on the U.S. for coal, liquefied natural gas, crude, agricultural machinery and large-engine cars, and will probe Alphabet's Google (GOOGL) over alleged antitrust violations, a day after Trump said he would delay Mexico and Canada tariffs for a month.</p><p class=\"\">In the earnings spotlight, Google's parent Alphabet (GOOGL) will report after the close, alongside Nvidia competitor AMD (AMD) and Chipotle (CMG).</p><p class=\"\">Regeneron (REGN) stock is up 5% after the biotech launched a divided program and boosted buybacks. Merck (MRK) is tumbling after disappointing guidance overshadowed an earnings beat. PepsiCo (PEP) logged a third-straight quarterly miss on revenue and shares are falling. Spotify (SPOT) swung to a profit and shares are popping.</p><p class=\"\">Job openings and factory orders are both coming at 10 a.m. We'll hear from Fed officials throughout the day - Atlanta Fed Pres. Raphael Bostic, San Francisco Fed Pres. Mary Daly and Fed Reserve Vice Chairman Philip Jefferson.</p><p class=\"\">Best of the web</p><p class=\"\">Tesla sales are getting crushed in its biggest U.S. market</p><p class=\"\">Elon Musk may have just staged a '21st-century coup' at the Treasury Department. What could happen next.</p><p class=\"\">The $22 billion vape industry is about to get even messier</p><p class=\"\">The chart</p><p class=\"\">The above chart shows the explosive growth of retail participation in options market over the past few years, which surged during the pandemic, according to derivatives and exchange network CBOE. That market clearly just keeps getting bigger. The CBOE (CBOE), which has also been pushing for more real-time trading data, said a record 12.2 billion options contracts traded in the U.S. in 2024, up 10.6% from 2023's total, a fifth-straight record year.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6 a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   PLTR    Palantir Technologies <br/>   TSLA    Tesla <br/>   GME     GameStop <br/>   AAPL    Apple <br/>   HOLO    MicroCloud Hologram <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMD     Advanced Micro Devices <br/>   SMCI    Super Micro Computer <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Eggspensive scramble on the freeway.</p><p class=\"\">British pub gives away nearly 300 pints of own-goal beer.</p><p class=\"\">On the road with the meteorite hunters.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204006323:0/",
            "pub_date": "2025-02-04 22:37:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1HE:0",
            "title": "TSX opens higher as industrials shares gain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canada's main stock index opened higher on Tuesday, helped by gains in industrials stocks, though investors remained cautious due to an escalating trade war between the U.S. and China.</p><p class=\"\">At 9:31 a.m. ET (1431 GMT), the Toronto Stock Exchange's S&amp;P/TSX composite index  was up 0.2% at 25291.43.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1HE:0-tsx-opens-higher-as-industrials-shares-gain/",
            "pub_date": "2025-02-04 22:38:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1LN:0",
            "title": "Arabica coffee hits fresh record high as it nears $4 per lb",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The relentless rally in arabica coffee continued on Tuesday, with the market setting a record high for a ninth successive session as roasters scrambled to secure supplies and farmers remained reluctant to sell.</p><p class=\"\">Arabica coffee futures on the ICE exchange , used as a global price benchmark, hit a record $3.8990 per lb earlier in the trading session, and were up 1.6% at $3.8680 by 1300 GMT, bringing gains for the year to around 20% so far. They gained 70% last year.</p><p class=\"\">Dealers said speculative investors are piling into coffee on the buy side mostly, prompting roasters to engage in panic-buying and farmers to withhold sales in the hope that prices can rise higher still.</p><p class=\"\">\"The natural target for this week is to test the $4/lb threshold,\" a dealer said.</p><p class=\"\">Arabica has been supported by an expected output slump in top producer Brazil this season, partly owing to last year's drought, though some experts say the harvest may not be as bad as initially feared thanks to ample rains recently. </p><p class=\"\">Robusta coffee , a generally cheaper variety used mostly to make instant coffee, rose 1.1% to $5,581 a metric ton, after peaking last week at $5,840, the highest price since the contract started trading in 2008.</p><p class=\"\">\"When coffee prices are this high, fundamentals start to matter less. Speculators will speculate. Many would be attracted to coffee following what happened in cocoa and the rally many of them missed,\" Rabobank said.</p><p class=\"\">It added that the market is also concerned that U.S. President Donald Trump might place trade tariffs on South American countries that are key coffee producers.</p><p class=\"\">\"Latin America is in the president's horizon. Uncertainty in tariffs and trade wars is uncertainty to coffee,\" it said.</p><p class=\"\">In other soft commodities, New York cocoa futures  were little changed at $10,916 a ton, having lost 5% last week, while London cocoa  slipped 0.2% to 8,742 pounds per ton.</p><p class=\"\">Raw sugar  edged up 0.1% to 19.28 cents per lb, while white sugar  rose 1.1% to $520.20 a ton.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1LN:0-arabica-coffee-hits-fresh-record-high-as-it-nears-4-per-lb/",
            "pub_date": "2025-02-04 22:38:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308924:0",
            "title": "Ericsson, Lower Colorado River Authority to Establish LTE Network for Texas Utilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ericsson  said Tuesday it has signed a multi-year agreement with the Lower Colorado River Authority to deploy a private LTE network for utilities in parts of 68 Texas counties. </p><p class=\"\">The network will back grid modernization projects, provide low-latency communications and help safeguard utility operations, Ericsson said. </p><p class=\"\">Initial operations to establish the network are slated to start in Q1 2025, the company said. </p><p class=\"\">Financial details were not disclosed.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308924:0/",
            "pub_date": "2025-02-04 22:38:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObikQQrGa:0",
            "title": "NOTIFICATION OF MAJOR HOLDINGS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Please see attachment on www.newsweb.no</p><p class=\"\">https://newsweb.oslobors.no/message/637694</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObikQQrGa:0-notification-of-major-holdings/",
            "pub_date": "2025-02-04 22:39:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204003093:0",
            "title": "Spotify Reports First Full-Year Profit — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anne Steele</p><p class=\"\">Spotify reported its first ever full year of profitability, fueled by record user growth and austerity measures after years of heavy spending on growth initiatives such as podcasts.</p><p class=\"\">Its fourth-quarter earnings are a sign that the company has been able to wean itself off years of intense investment and transform from a music-streaming service with tough margins to a full-service audio company.</p><p class=\"\">Spotify swung to a fourth-quarter profit of 367 million euros, or EUR1.76 a share, from a loss of EUR70 million, or 36 euro cents a share, a year ago. Analysts expected EUR1.99 a share, according to FactSet.</p><p class=\"\">Net income for the year was EUR1.14 billion, equivalent to about $1.18 billion, compared with a loss of EUR532 million in 2023.</p><p class=\"\">Monthly active users climbed 12% to 675 million — the largest fourth quarter in the company's history and topping guidance by 10 million.</p><p class=\"\">Spotify shares are up 20% so far this year.</p><p class=\"\">When Spotify went public nearly seven years ago, it told investors it would give priority to growth over profits in an effort to establish itself as the dominant audio-streaming service. After spending over $1 billion on podcasting and facing pressure from investors to turn a profit, the company in 2023 shifted its focus to cost controls and laid off about a fifth of its workforce.</p><p class=\"\">It raised subscription prices in many regions around the world last year, including in the U.S. for the second time, further juicing its revenue. Executives promised sustained profits last year while pushing into audiobooks.</p><p class=\"\">Other key highlights from Spotify's fourth-quarter earnings:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue rose 16% to EUR4.24 billion, topping guidance.   </li><li class=\"listItem-bmN0_SHH\">Gross margin of 32.2% was stronger than its guidance and ahead of the   goal it set at a 2022 investor day of achieving 30% gross margins between   2025 and 2027.   </li><li class=\"listItem-bmN0_SHH\">Premium subscribers, Spotify's most lucrative type of customer, grew 11%   to 263 million, above expectations.   </li><li class=\"listItem-bmN0_SHH\">Average revenue per user for its subscription business ticked up 5% to   EUR4.85, thanks to price increases. The metric has been pressured as   Spotify brings in new subscribers via discounted plans and lower prices   in emerging markets.   </li><li class=\"listItem-bmN0_SHH\">Ad-supported revenue grew 7% to EUR537 million, driven by both music and   podcasts. </li></ul><p class=\"\">Write to Anne Steele at anne.steele@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204003093:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007386:0",
            "title": "Canada's Auto Industry Wary of U.S. Tariffs, Highlights Integrated Industry — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">With tariffs paused but still looming, Canada's automotive industry continues to stress the integrated nature of the industry in North America and the damage levies could cause. The Canadian Automotive Partnership Council in a meeting with Canadian lawmakers warned tariffs pose an existential threat to the industry in Canada and the U.S. and costs ultimately being borne by consumers. The industry body notes bilateral automotive trade is balanced, with Canadian exports to the U.S. at C$82 billion and imports at C$79 billion in 2023. And it stresses Canadian-made vehicles don't pose a threat to U.S. automotive jobs or production mandates: fewer than 10% of vehicles sold in the U.S. are produced in Canada, whereas the U.S. assembles about half of the vehicles sold in Canada and exports more vehicles to Canada than to any other country. (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007386:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204004891:0",
            "title": "10, 30-year yields rise as China's tariff retaliation adds to inflation concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jamie Chisholm</p><p class=\"\">U.S. bond yields inched slightly higher early Tuesday, amid fears about the possible inflationary impact of a trade war between the U.S. and China and as investors turned their focus to labor market reports over the next few days.</p><p class=\"\">What's happening</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The yield on the 2-year Treasury BX:TMUBMUSD02Y fell 0.5 basis points to 4.260%.</li><li class=\"listItem-bmN0_SHH\">The yield on the 10-year Treasury BX:TMUBMUSD10Y climbed 1.2 basis points to 4.576%.</li><li class=\"listItem-bmN0_SHH\">The yield on the 30-year Treasury BX:TMUBMUSD30Y rose 1.4 basis points to 4.811%.</li></ul><p class=\"\">What's driving markets</p><p class=\"\">Longer-term Treasury yields are a fraction higher after China raised tariffs against U.S. energy and some vehicles, bolstering concerns that a prolonged trade war between the world's two biggest economies may increase inflationary pressures.</p><p class=\"\">See also: Trump's tariff moves upend inflation expectations in financial markets</p><p class=\"\">However, the more monetary policy-sensitive 2-year U.S. yield dipped as investors made bets that tit-for-tat tariff increases may also damage economic growth in the short term.</p><p class=\"\">Still, the overall market reaction - in fixed income, stock-index futures and forex - is relatively mild early Tuesday compared to the volatility seen on Monday, when traders reacted to U.S. tariffs on Mexico and Canada that were later in the day postponed.</p><p class=\"\">The calmer tone may allow investors to turn their focus to the health of the U.S. economy as the rest of the week sees a batch of labor data, starting with the job openings, or JOLTs report on Tuesday at 10:00 a.m. Eastern, and culminating with the January nonfarm payrolls report on Friday.</p><p class=\"\">\"Any strength in data will further fuel the Fed hawks and help push back the expectation of the next rate cut further down the road. For now, the first rate cut is being priced in for June - [at] the earliest,\" said Ipek Ozkardeskaya, senior analyst at Swissquote Bank.</p><p class=\"\">The Federal Reserve is expected to take its Fed funds rate target down to around 3.925% by December, according to 30-day Fed Funds futures, suggesting just two 25 basis point cuts this year.</p><p class=\"\">Other U.S. economic data due Tuesday include factory orders for December, released at 10:00 a.m. Eastern.</p><p class=\"\">Federal Reserve officials making comments include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">11:00 a.m. Atlanta Fed President Raphael Bostic speaks on housing.</li><li class=\"listItem-bmN0_SHH\">2:00 p.m. San Francisco Fed President Daly speaks on the economic outlook.</li><li class=\"listItem-bmN0_SHH\">7:30 p.m. Federal Reserve Vice Chairman Philip Jefferson speaks on the economy and monetary policy.</li></ul><p class=\"\">-Jamie Chisholm</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204004891:0/",
            "pub_date": "2025-02-04 22:40:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV14C:0",
            "title": "Analysts say Trump tariffs could disrupt pulp, packaging sector",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Citigroup says U.S. President Donald Trump's tariffs could likely disrupt supply chain for beer cans and glass bottles in the U.S., potentially affecting companies like Ball Corp  and Crown Holdings  with operations in Mexico</p><p class=\"\">** Trump imposed tariffs on its top trading partners Canada and Mexico on Saturday, but later suspended them until Mar. 1</p><p class=\"\">** Brokerage says glass bottles and jars maker O-I Glass Inc  could also see impacts to its revenue from its Mexican glass bottle production unit</p><p class=\"\">        ** Separately, BofA sees potential short-term disruptions in Mexican alcohol imports impacting companies like BALL and OI, but expects domestic brands to offset some losses by inventory management and shifts in market share</p><p class=\"\">    ** Citigroup sees tariffs potentially increasing costs for Canadian-produced containerboard and pulp</p><p class=\"\">** Similarly, BofA sees tariffs on Canadian pulp imports, especially NBSK pulp (made from softwood trees), driving up prices and potentially shifting the supply chain to alternative sources</p><p class=\"\">** BALL beat Q4 profit estimates on Tuesday; OI and CCK to report this week</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV14C:0-analysts-say-trump-tariffs-could-disrupt-pulp-packaging-sector/",
            "pub_date": "2025-02-04 22:40:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308928:0",
            "title": "Ecovyst, ChiralVision Collaborate on Enzyme Immobilization Technologies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ecovyst  and ChiralVision said Tuesday they have signed a memorandum of understanding to advance enzyme immobilization technologies. </p><p class=\"\">Financial terms were not disclosed. </p><p class=\"\">The companies said they will develop technologies to enhance the efficiency and sustainability of enzyme-based processes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308928:0/",
            "pub_date": "2025-02-04 22:40:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308932:0",
            "title": "Natural Gas Falls as Mild Southern Weather Cuts Into Demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Natural gas eased early on Tuesday as mild southern temperatures cut heating demand, but with long-term forecasts seeing colder weather on the way, the price decline could be short-lived. </p><p class=\"\">Gas for March delivery was last seen down US$0.16 to US$3.19 per million British thermal units. </p><p class=\"\">The drop comes as southern states enjoy mild weather, even as wintry weather continues in the north. </p><p class=\"\">\"The northern 1/3 of the US will be cool to very cold as frosty weather systems track through w/snow and highs of -0s to 30s, coldest N. Plains. The southern 2/3 of the US will be mild to nice w/highs of 50s-80s as high pressure rules, including very nice highs of 70s-80s across Texas. Overall, Light national demand much of the next 7-days,\" NatGasWeather noted. </p><p class=\"\">However long-term forecasts from the National Weather Service see colder weather on the way, with nearly all states expected to see colder than seasonal temperatures over the agency's eight to 14 day outlook.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308932:0/",
            "pub_date": "2025-02-04 22:40:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308929:0",
            "title": "Evercore ISI Adjusts Dollar General Price Target to $90 From $118",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dollar General  has an average rating of Hold and mean price target of $87.42, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308929:0/",
            "pub_date": "2025-02-04 22:40:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308934:0",
            "title": "Evercore ISI Adjusts AutoZone Price Target to $3,500 From $3,900",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AutoZone  has an average rating of overweight and mean price target of $3,678.23, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308934:0/",
            "pub_date": "2025-02-04 22:40:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1T7:0",
            "title": "Madison Square Garden Sports Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp  reported quarterly adjusted earnings of 5 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 59 cents.  The mean expectation of five analysts for the quarter was for earnings of 31 cents per share. Wall Street expected results to range from 19 cents to 46 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 9.4% to $357.76 million from a year ago; analysts expected $352.68 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp's reported EPS for the quarter was 5 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $1.11 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Madison Square Garden Sports Corp shares had fallen by 3.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the entertainment production peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Madison Square Garden Sports Corp is $260.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.31</p></td><td><p class=\"\">0.05</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">-0.86</p></td><td><p class=\"\">-0.31</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.38</p></td><td><p class=\"\">1.06</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.28</p></td><td><p class=\"\">1.57</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1T7:0-madison-square-garden-sports-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:31:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1EA:0",
            "title": "Wall St muted at open after China's retaliatory tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wall Street's main indexes were subdued at the open on Tuesday as investor appetite for risk waned after China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs.</p><p class=\"\">The Dow Jones Industrial Average  rose 47.5 points, or 0.11%, at the open to 44469.46. The S&amp;P 500  rose 3.6 points, or 0.06%, at the open to 5998.14​, while the Nasdaq Composite  rose 30.2 points, or 0.16%, to 19422.171 at the opening bell.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1EA:0-wall-st-muted-at-open-after-china-s-retaliatory-tariffs/",
            "pub_date": "2025-02-04 22:31:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX97ytlx:0",
            "title": "AgriFORCE Growing Systems Ltd. Supercharges Growth with Robust Financing, Strategic Acquisitions, and Potential for Unprecedented Operational Excellence",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vancouver, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — AgriFORCE Growing Systems Ltd. , a trailblazing technology-driven innovator committed to sustainability and operational excellence, is enthusiastic to comment upon a transformative series of developments. In an explosive 75-day period, the Company has evolved into a fully operational bitcoin mining and agtech company with diversified revenue streams, setting new industry benchmarks for growth and innovation across both Canada and the U.S.</p><p class=\"\">Unmatched Operational and Technological Breakthroughs</p><p class=\"\">AgriFORCE now operates three strategically located sites—two in Ohio and one in Alberta—with a combined installed capacity of 5 MW. The state-of-the-art facilities are delivering solid mining metrics:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Collective Hashrate:</strong> 18 PH/s</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bitcoin Production:</strong> Approximately 0.057 BTC per day</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Miner Count:</strong> 1,120</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Energy Cost:</strong> $0.04 per kWh</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Unprecedented Uptime:</strong> Only 1 outage day recorded since November 30, 2024</li></ul><p class=\"\">This remarkable operational ramp-up has driven a more than 600% increase in hashrate since the commencement of operations of its Sturgeon, Alberta facility, firmly establishing AgriFORCE’s potential as a formidable competitor in the digital asset mining arena.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Acquisitions Powering Future Growth</strong></p><p class=\"\">In a bold, strategic move to amplify its growth trajectory, AgriFORCE acquired an innovatively efficient 5 MW bitcoin mining facility in Columbiana County, Ohio, for $4.5 million in cash. This facility, powered by natural gas flare energy, currently runs over 900 bitcoin mining units—with the potential to expand to 1,200 units—delivering immediate cash flow and extraordinary scalability. This acquisition is a cornerstone of AgriFORCE’s trailblazing strategy to leverage stranded gas assets while integrating sustainable energy and agricultural growth strategies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Robust Financing Accelerates Expansion</strong></p><p class=\"\">Highlighting investor confidence and a bright future ahead, AgriFORCE has secured the first tranche of an up to $50 million financing facility from leading institutional investors. An initial $7 million tranche was deployed to complete the recent high-impact acquisitions. This significant financial backing not only underpins the Company’s aggressive expansion plans but also enables the rapid scaling of operations and the anticipated integration of pioneering sustainable technologies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jolie Kahn, CEO of AgriFORCE,</strong> stated, </p><p class=\"\">“Our rapid growth, marked by a more than 600% increase in hashrate in under 60 days, is a testament to our innovative approach and the exceptional leadership driving AgriFORCE forward. The acquisition of high-potential assets in Ohio, combined with our trailblazing work repurposing waste heat and carbon emissions for anticipated sustainable agricultural initiatives in Ohio and Alberta, underscores our ability to redefine the intersection of cryptocurrency mining and environmental stewardship. With the support of our financing partners, we believe we are seizing a once-in-a-generation opportunity to revolutionize our industry and deliver extraordinary value to our shareholders.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Vision for Transformative Growth</strong></p><p class=\"\">AgriFORCE’s groundbreaking integration of bitcoin mining with sustainable agricultural practices is setting a new paradigm in the digital asset and environmental sectors. The secured financing gives us the runway to fuel further acquisitions and enable the expansion of operations, ensuring that AgriFORCE has the potential to remain at the forefront of the sustainable digital asset ecosystem.</p><p class=\"\">By harnessing innovative technology and a robust operational framework, AgriFORCE is not only accelerating its growth but also paving the way for a future where profitability potential and sustainability go hand in hand.</p><p class=\"\">About AgriFORCE Growing Systems Ltd.</p><p class=\"\">AgriFORCE Growing Systems Ltd.  is a forward-thinking technology company dedicated to solving critical challenges in agriculture, sustainability, and environmental stewardship. By leveraging advanced technologies and innovative business models, AgriFORCE aims to deliver value for shareholders while creating lasting benefits for communities and ecosystems.</p><p class=\"\">Follow AgriFORCE on Social Media:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Twitter: @agriforcegs</li><li class=\"listItem-bmN0_SHH\">Facebook: AgriFORCE Growing Systems Ltd.</li><li class=\"listItem-bmN0_SHH\">LinkedIn: AgriFORCE Growing Systems Ltd.</li></ul><p class=\"\">Forward-Looking Statements</p><p class=\"\">Statements made in this press release include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements can be identified by the use of words such as “may,” “will”, “plan,” “should,” “expect,” “anticipate,” “estimate,” “continue,” or comparable terminology. Such forward-looking statements are inherently subject to certain risks, trends and uncertainties, many of which the Company cannot predict with accuracy and some of which the Company might not even anticipate and involve factors that may cause actual results to differ materially from those projected or suggested. Readers are cautioned not to place undue reliance on these forward-looking statements and are advised to consider the factors listed above together with the additional factors under the heading “Risk Factors” in the Company's Period Reports on Forms 10-K and 10-Q, as may be supplemented or amended by the Company's Current Reports on Form 8-K. The Company assumes no obligation to update or supplement forward-looking statements that become untrue because of subsequent events, new information or otherwise. No information in this press release should be construed as any indication whatsoever of the Company’s future revenues, results of operations, or stock price.</p><p class=\"\">For more information, visit www.agriforcegs.com.</p><p class=\"\">For media inquiries, please contact:</p><p class=\"\">Richard Wong</p><p class=\"\">CFO</p><p class=\"\">AgriForce Growing Systems Ltd.</p><p class=\"\">1-778-658-0533</p><p class=\"\">rwong@agriforcegs.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">###</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX97ytlx:0-agriforce-growing-systems-ltd-supercharges-growth-with-robust-financing-strategic-acquisitions-and-potential-for-unprecedented-operational-excellence/",
            "pub_date": "2025-02-04 22:32:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1TH:0",
            "title": "Marathon Petroleum Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp  reported quarterly adjusted earnings of 77 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $3.98.  The mean expectation of eighteen analysts for the quarter was for earnings of 2 cents per share. Wall Street expected results to range from -39 cents to 14 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 9.1% to $33.47 billion from a year ago; analysts expected $31.12 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp's reported EPS for the quarter was $1.15​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $371 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Marathon Petroleum Corp shares had risen by 5.4% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 98.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, fourteen analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 11 \"strong buy\" or \"buy,\" 7 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the oil &amp; gas refining and marketing peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Marathon Petroleum Corp is $170.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.02</p></td><td><p class=\"\">0.77</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">1.87</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">3.09</p></td><td><p class=\"\">4.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.42</p></td><td><p class=\"\">2.58</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1TH:0-marathon-petroleum-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:32:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1TI:0",
            "title": "CTS Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CTS Corp  reported quarterly adjusted earnings of 53 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 47 cents.  The lone analyst forecast for the quarter was for earnings of 54 cents per share. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 2.2% to $127.44 million from a year ago; analysts expected $132.80 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CTS Corp's reported EPS for the quarter was 45 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $13.61 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CTS Corp shares had fallen by 6.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the electronic equipment &amp; parts peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for CTS Corp is $49.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.54</p></td><td><p class=\"\">0.53</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.54</p></td><td><p class=\"\">0.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.53</p></td><td><p class=\"\">0.54</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.43</p></td><td><p class=\"\">0.47</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1TI:0-cts-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:32:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308931:0",
            "title": "TSX Closer: Up Near 30 Pts After Canada and U.S. Tariffs War Put On Hold, For 30 Days at Least",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308931:0-tsx-closer-up-near-30-pts-after-canada-and-u-s-tariffs-war-put-on-hold-for-30-days-at-least/",
            "pub_date": "2025-02-04 22:32:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007343_20250204007343:0",
            "title": "S&P 500 Rises 3.67 Points (0.06%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007343_20250204007343:0/",
            "pub_date": "2025-02-04 22:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007344_20250204007344:0",
            "title": "Nasdaq Composite Rises 48.88 Points (0.25%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007344_20250204007344:0/",
            "pub_date": "2025-02-04 22:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007342_20250204007342:0",
            "title": "DJIA Falls 54.13 Points (0.12%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007342_20250204007342:0/",
            "pub_date": "2025-02-04 22:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308915:0",
            "title": "Supernus Pharmaceuticals Says Onapgo Approved by FDA for Parkinson's Disease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Supernus Pharmaceuticals  said Tuesday that the US Food and Drug Administration has approved its Onapgo injection to treat motor fluctuations in adults with advanced Parkinson's disease. </p><p class=\"\">The biopharmaceutical company said Onapgo will be available in Q2. </p><p class=\"\">Shares of Supernus Pharmaceuticals were up more than 4% in early trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308915:0/",
            "pub_date": "2025-02-04 22:33:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308927:0",
            "title": "Freightos Names Pablo Pinillos CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Freightos  said Tuesday that it has named Pablo Pinillos as chief financial officer, effective March 1. </p><p class=\"\">Pinillos was most recently CFO of Coincover, Freightos said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308927:0/",
            "pub_date": "2025-02-04 22:34:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308933:0",
            "title": "Correction: -- TSX Brief (Not Closer): Up Near 50 Pts After Canada and U.S. Tariffs War Put On Hold, For 30 Days at Least",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308933:0-correction-tsx-brief-not-closer-up-near-50-pts-after-canada-and-u-s-tariffs-war-put-on-hold-for-30-days-at-least/",
            "pub_date": "2025-02-04 22:34:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007362:0",
            "title": "LTC Announces Date of Fourth Quarter 2024 Earnings Release, Conference Call and Webcast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LTC Announces Date of Fourth Quarter 2024 Earnings Release, Conference Call and Webcast</p><p class=\"\">WESTLAKE VILLAGE, Calif.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">LTC Properties Inc.  (\"LTC\" or the \"Company\"), will release fourth quarter earnings on Monday, February 24, 2025 after market close.</p><p class=\"\">LTC will conduct a conference call on Tuesday, February 25, 2025 at 8:00 a.m. Pacific / 11:00 a.m. Eastern, to provide commentary on the performance and operating results for the quarter ended December 31, 2024.</p><p class=\"\">Conference Call</p><p class=\"\">Interested parties may access the live conference call via the following:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Webcast                    www.LTCReit.com <br/>USA Toll-Free Number       1-888-506-0062 <br/>International Number       1-973-528-0011 <br/>Conference Access Code     995858 <br/> </pre><p class=\"\">Conference Call Replay</p><p class=\"\">A replay of the call will be available one hour after the live call and through March 11, 2025.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>USA Toll-Free Number       1-877-481-4010 <br/>International Number       1-919-882-2331 <br/>Conference Access Code     51842 <br/> </pre><p class=\"\">An audio replay of the conference call and the Company's earnings release and supplemental information package for the current period will be available on the Company's website at: https://ir.ltcreit.com/Investors.</p><p class=\"\">About LTC Properties</p><p class=\"\">LTC is a real estate investment trust (REIT) investing in seniors housing and health care properties primarily through sale-leasebacks, mortgage financing, joint-ventures and structured finance solutions including preferred equity and mezzanine lending. LTC's investment portfolio includes 189 properties in 25 states with 29 operating partners. Based on its gross real estate investments, LTC's investment portfolio is comprised of approximately 50% seniors housing and 50% skilled nursing properties. Learn more at www.LTCreit.com.</p><p class=\"\">Forward Looking Statements</p><p class=\"\">This press release includes statements that are not purely historical and are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding the Company's expectations, beliefs, intentions or strategies regarding the future. All statements other than historical facts contained in this press release are forward looking statements. These forward-looking statements involve a number of risks and uncertainties. All forward looking statements included in this press release are based on information available to the Company on the date hereof, and the Company assumes no obligation to update such forward looking statements. Although the Company's management believes that the assumptions and expectations reflected in such forward-looking statements are reasonable, no assurance can be given that such expectations will prove to have been correct. The actual results achieved by the Company may differ materially from any forward-looking statements due to the risks and uncertainties of such statements.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204145318/en/</p><p class=\"\">CONTACT:    For more information contact:</p><p class=\"\">Mandi Hogan</p><p class=\"\">(805) 981-8655</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007362:0/",
            "pub_date": "2025-02-04 22:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1DH:0",
            "title": "U.S. FDA approves Supernus' drug-device combination for Parkinson's disease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The U.S. Food and Drug Administration has approved Supernus Pharmaceuticals'  drug-device combination to treat movement-related symptoms of Parkinson's disease, the drugmaker said on Tuesday.</p><p class=\"\">The treatment branded Onapgo will be available in the U.S. in the second quarter.</p><p class=\"\">The drug regulator's greenlight brings an end in the company's years-long effort to market the pump-based treatment, which works by continuously delivering the drug apomorphine under-the-skin, compared with the currently approved injection form which has to be given as often as two hours apart.</p><p class=\"\">The FDA declined to approve Supernus' application in 2022 and 2024, with the regulator last year requesting additional information related to product quality and the device.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1DH:0-u-s-fda-approves-supernus-drug-device-combination-for-parkinson-s-disease/",
            "pub_date": "2025-02-04 22:30:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308925:0",
            "title": "Evercore ISI Adjusts CarMax Price Target to $90 From $79",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CarMax  has an average rating of overweight and mean price target of $86.36, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308925:0/",
            "pub_date": "2025-02-04 22:30:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObixTPGra:0",
            "title": "4finance EUR 2028 bond put option notification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">4 February 2025. 4finance S.A. (\"4finance\" or the \"Company\") notifiesinvestorsthat it has published a put option notice in respect of its 11.25% EUR 2028bonds, as per the Terms and Conditions amended in December 2023. Upon requestfrom investors the Company may repurchase up to a total of EUR 15 million oftheEUR 2028 bonds at par.Given the EUR 2028 bonds are currently trading above par, the Company does notexpect significant investor participation. The put option notice and relevant forms to submit a repurchase request areavailable at https://www.4finance.com/investors-and-media/bonds</p><p class=\"\">For more information, please contact: investorrelations@4finance.com or AaltoCapital (manfred.steinbeisser@aaltocapital.com / +49 175 2668901)</p><p class=\"\">Certain statements in this document are \"forward-looking statements\". Thesestatements are based on management's current expectations and are subject touncertainty and changes in circumstances. Actual results may differ materiallyfrom those included in these statements.</p><p class=\"\">About 4finance</p><p class=\"\">Established in 2008, 4finance is one of Europe's largest digital consumerlending groups with operations in 11 countries.</p><p class=\"\">Leveraging automation and data-driven insights across the business, 4financehasgrown rapidly, issuing over EUR10 billion since inception in instalment loans,lines of credit and single payment loans.</p><p class=\"\">4finance operates a portfolio of market-leading brands offering simple, usefuland transparent products to millions of customers. The Group providesconvenientproducts in a responsible way to the many consumers who are often underservedbyconventional providers.</p><p class=\"\">The Group also offers deposits, in addition to consumer and SME loans throughits TBI Bank subsidiary, an EU licensed institution with operations primarilyinBulgaria, Romania and Greece.</p><p class=\"\">www.4finance.com</p><p class=\"\">https://newsweb.oslobors.no/message/637692</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObixTPGra:0-4finance-eur-2028-bond-put-option-notification/",
            "pub_date": "2025-02-04 22:30:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9YG6lq:0",
            "title": "nuVizz Unveils AI-Powered “Vizzard” for Smarter Last-Mile Logistics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ATLANTA, Feb.  04, 2025  (GLOBE NEWSWIRE) — nuVizz, a leading innovator in Last-Mile Transportation Management Solutions (TMS), announces the release of its latest software version and its new artificial intelligence (AI) assistant, Vizzard. nuVizz’s Vizzard is an intelligent assistant designed to transform last-mile operations by leveraging data-driven insights and the latest in artificial intelligence technology. The innovation comes as part of nuVizz’s latest software update, version 10.01, marking a decade of groundbreaking advancements in the last-mile logistics space.</p><p class=\"\">nuVizz’s last-mile TMS solution supports retail, healthcare, food distribution, third-party logistics providers (3PL), carriers, and automotive parts distribution. During the past decade, nuVizz has accumulated an unparalleled depth of data, which has helped glean intelligence and fuel the development of AI-based models that deliver cutting-edge solutions for last-mile logistics challenges, including Vizzard.</p><p class=\"\">“As we celebrate a decade of innovation, the release of version 10.01 reflects our commitment to empowering our customers with smarter, more efficient solutions,” said <strong class=\"root-Tkn6WL2y\">Guru Rao</strong>, <strong class=\"root-Tkn6WL2y\">CEO of nuVizz.</strong> “Our introduction of nuVizz’s AI Vizzard also represents a significant leap forward in AI-driven last-mile logistics. By combining a decade of data intelligence with cutting-edge AI technologies, we are redefining the way businesses approach last-mile operations.”</p><p class=\"\">The 10.01 version extends the nuVizz platform’s capabilities to address critical logistics decisions with precision and efficiency, including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Optimized Route Generation:</strong> AI-driven algorithms that create intelligent, cost-effective delivery routes.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Real-Time On-Demand Routing:</strong> Dynamic adjustments to delivery routes based on real-time events and data inputs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Intelligent Data Mapping:</strong> Seamless integration of customer data from external sources, minimizing manual processes.</li></ul><p class=\"\">Vizzard further empowers logistics teams by simplifying complex decision-making including:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Algorithm Selection Assistance:</strong> Helps dispatchers select the ideal algorithm to optimize routes, improve vehicle utilization, and reduce driven miles based on their delivery demand patterns.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Ease of Data Integration: </strong>Intelligently maps customer data from multiple external sources, streamlining data integration.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Address Correction and Validation: </strong>Provides intelligent suggestions and corrections by automatically detecting and correcting inaccurate customer addresses to minimize incorrect deliveries and operational inefficiencies.</li></ul><p class=\"\">nuVizz continues to lead the way in last-mile TMS innovation by delivering customer-centric, technology-driven solutions, ensuring businesses can adapt to the rapidly evolving logistics landscape. You can learn more about the latest version, 10.01, of nuVizz’s last-mile TMS solution and AI Vizzard here.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About nuVizz</strong></p><p class=\"\">nuVizz lights the way to better delivery and transportation logistics. From the first mile to the last mile-and everything in between – we’re trailblazers in supply chain optimization and digitization. Infinitely flexible, the nuVizz SaaS platform drives visibility, control, cost savings, and a better customer experience across the fulfillment lifecycle.</p><p class=\"\">Our single-minded mission: simple, sustainable transportation solutions for every business on the planet. Go further, grow faster. For more information, visit nuvizz.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact</strong></p><p class=\"\">Erika Belezarian</p><p class=\"\">LeadCoverage</p><p class=\"\">erika@leadcoverage.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9YG6lq:0-nuvizz-unveils-ai-powered-vizzard-for-smarter-last-mile-logistics/",
            "pub_date": "2025-02-04 22:30:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}