{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309857:0",
            "title": "Raymond James Initiates Robinhood Markets at Market Perform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Robinhood Markets  has an average rating of overweight and mean price target of $50.88, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309857:0/",
            "pub_date": "2025-02-05 20:53:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005511:0",
            "title": "Johnson Controls Names Weidemanis CEO, Logs 1Q Income Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Rob Curran</p><p class=\"\">Johnson Controls named Danaher executive Joakim Weidemanis as chief executive to succeed George Oliver, who last year divulged plans to step down following pressure from activist investment firm Elliott Investments.</p><p class=\"\">Separately, the maker of heating, ventilation and air-conditioning machinery posted fiscal first-quarter earnings growth and boosted its earnings projection for the year ending in September.</p><p class=\"\">Weidemanis is slated to start as CEO on March 12. Oliver will remain as nonexecutive chairman until July 31, at which point he will be succeeded in that role by Mark Vergnano, who has sat on the board since 2016. Oliver will then serve as an adviser, supporting the leadership transition until the end of 2025.</p><p class=\"\">Weidemanis had a 13-year career as an executive at industrial conglomerate Danaher, most recently as executive vice president, diagnostics and China, and he previously worked at Swiss industrial firm ABB.</p><p class=\"\">Johnson posted earnings of $419 million, or 63 cents a share, for the quarter ended in December, up from $374 million, or 55 cents a share, a year earlier.</p><p class=\"\">On an adjusted basis, the Ireland-based company logged earnings of 64 cents a share, compared with the mean analyst estimate of 59 cents a share, per FactSet.</p><p class=\"\">Sales rose 4% to $5.43 billion, surpassing the mean analyst estimate of $5.29 billion.</p><p class=\"\">For the fiscal second quarter, Johnson targeted adjusted earnings between 77 cents and 79 cents a share.</p><p class=\"\">For the fiscal year, the company boosted its forecast for adjusted earnings to a range between $3.50 and $3.60 a share from a previous target of $3.40 to $3.50 a share.</p><p class=\"\">Johnson started a chief-executive search in July, when Oliver disclosed plans to step down in response to an activist-investor campaign from Elliott. Oliver noted the company's tightening of its focus during his tenure.</p><p class=\"\">Write to Rob Curran at rob.curran@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005511:0-johnson-controls-names-weidemanis-ceo-logs-1q-income-growth/",
            "pub_date": "2025-02-05 20:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309858:0",
            "title": "HSBC Downgrades H World Group to Hold From Buy, Adjusts Price Target to $32.40 From $50.30",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">H World Group  has an average rating of Buy and mean price target of $43.76, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309858:0/",
            "pub_date": "2025-02-05 20:54:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1UW:0",
            "title": "Boston Scientific sees higher-than-expected 2025 profit on strong demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Medical device maker Boston Scientific  forecast annual profit above Wall Street estimates on Wednesday, banking on steady demand for its heart devices.</p><p class=\"\">Manufacturers of medical devices have been benefiting from the elevated demand for elective surgical procedures in the United States, especially among older adults.</p><p class=\"\">Boston Scientific, which generates most of its revenue from sales of heart devices such as pacemakers and stents, also produces equipment for diagnosing and treating a range of gastrointestinal and pulmonary conditions.    </p><p class=\"\">The company expects its 2025 adjusted earnings to be in the range of $2.80 to $2.87 per share, above analysts' average expectation of $2.81 at the midpoint, according to data compiled by LSEG.</p><p class=\"\">Boston Scientific projected full-year revenue growth between 12.5% and 14.5%, compared with the prior year.    </p><p class=\"\">The company's key growth drivers include its stroke prevention device, Watchman, and Farapulse, which uses short high-voltage pulses to treat certain abnormal heart rhythm conditions. </p><p class=\"\">The initial 2025 guide is \"strong out of the gates and we see room for the company to beat and raise through the year with PFA (Farapulse) as a key driver,\" RBC Capital analyst Shagun Singh said.</p><p class=\"\">The results and the forecast \"continue to point to a positive read-through to the rest of the sector,\" Singh added.</p><p class=\"\">Boston Scientific's revenue increased 22.4% to $4.56 billion for the fourth quarter, surpassing expectations of $4.43 billion.</p><p class=\"\">Sales at the company's cardiovascular unit rose nearly 29% to $2.94 billion in the three months ended Dec. 31, beating estimates of $2.83 billion.</p><p class=\"\">The company's endoscopy unit, which includes devices used in surgical procedures that aid in weight loss, reported a 7% rise in its quarterly revenue of $690 million. Analysts were expecting the unit to report sales of $695.9 million.</p><p class=\"\">Boston Scientific earned 70 cents per share on an adjusted basis in the fourth quarter, topping estimates of 66 cents. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1UW:0-boston-scientific-sees-higher-than-expected-2025-profit-on-strong-demand/",
            "pub_date": "2025-02-05 20:54:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309860:0",
            "title": "RBC Trims Price Target on Graphic Packaging Holding to $33 From $34, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Graphic Packaging Holding  has an average rating of overweight and mean price target of $31.81, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309860:0/",
            "pub_date": "2025-02-05 20:54:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8N4Vyq:0",
            "title": "ParaZero Successfully Demonstrates its Precision Airdrop System with Leading Defense Company",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tel Aviv, Israel, Feb.  05, 2025  (GLOBE NEWSWIRE) — ParaZero Technologies Ltd.  (the \"Company or “ParaZero”), an aerospace company focused on safety systems for commercial unmanned aircrafts and defense Counter UAS systems, announced today the successful demonstration of its DropAir Precision airdrop system in collaboration with a leading global defense company. The demonstration showcased the DropAir system’s ability to safely and precisely deliver critical supplies under challenging operational conditions.</p><p class=\"\">During the test, ParaZero’s proprietary DropAir technology was deployed in multiple high-altitude drone airdrops. The system’s advanced parachute mechanism activated at low altitude, ensuring minimal drift and precise landings, even in complex environments. Following the successful demonstration, ParaZero plans to advance the DropAir system into the next phase of development, focusing on enhancing its capabilities for real-world military and humanitarian operations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the DropAir Precision Airdrop System</strong></p><p class=\"\">The DropAir Precision Airdrop System (High-Altitude Low-Opening) is designed to revolutionize drone-based logistical support by enabling precise and secure delivery of supplies in challenging environments. Leveraging ParaZero’s renowned parachute technology, the DropAir system offers a cutting-edge solution to support military forces and emergency responders operating in high-risk zones.</p><p class=\"\">Following this demonstration and previous successful tests, ParaZero is moving forward with the next stage of DropAir’s development, refining the technology for operational deployment in military and humanitarian applications.</p><p class=\"\">Boaz Shetzer, CEO of ParaZero, said: \"This successful demonstration reinforces ParaZero’s commitment to advancing aerial safety and precision in critical supply missions. We believe that the DropAir system has the potential to transform logistical operations for defense and emergency response, ensuring rapid and secure deliveries in the most demanding environments. We are excited to take this technology to the next level, working towards its integration into real-world operational scenarios.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ParaZero Technologies</strong></p><p class=\"\">ParaZero  is a leading developer of autonomous parachute safety systems technologies for commercial and military platforms as well as for urban air mobility (UAM) aircraft. Started in 2014 by a passionate group of aviation professionals and drone industry veterans, ParaZero develops and manufactures smart, autonomous parachute safety systems designed to enable safe flight operations over populated areas and beyond-visual-line-of-sight (BVLOS) as well as for various military applications including Counter UAS. For more information about ParaZero, please visit https://parazero.com/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward- looking statements</strong></p><p class=\"\">This press release contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act and other securities laws. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates” and similar expressions or variations of such words are intended to identify forward-looking statements. For example, ParaZero is using forward-looking statements when it discusses its how the DropAir Precision Airdrop System is designed to revolutionize drone-based logistical support by enabling precise and secure delivery of supplies in challenging environments, commitment to advancing aerial safety and precision in critical supply missions and its belief that the DropAir system has the potential to transform logistical operations for defense and emergency response, ensuring rapid and secure deliveries in the most demanding environments. Forward-looking statements are not historical facts, and are based upon management’s current expectations, beliefs and projections, many of which, by their nature, are inherently uncertain. Such expectations, beliefs and projections are expressed in good faith. However, there can be no assurance that management’s expectations, beliefs and projections will be achieved, and actual results may differ materially from what is expressed in or indicated by the forward-looking statements. Forward-looking statements are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the forward-looking statements. For a more detailed description of the risks and uncertainties affecting the Company, reference is made to the Company’s reports filed from time to time with the Securities and Exchange Commission (“SEC”), including, but not limited to, the risks detailed in the Company’s annual report on From 20-F for the year ended December 31, 2023. Forward- looking statements speak only as of the date the statements are made. The Company assumes no obligation to update forward-looking statements to reflect actual results, subsequent events or circumstances, changes in assumptions or changes in other factors affecting forward-looking information except to the extent required by applicable securities laws. If the Company does update one or more forward-looking statements, no inference should be drawn that the Company will make additional updates with respect thereto or with respect to other forward-looking statements. References and links to websites have been provided as a convenience, and the information contained on such websites is not incorporated by reference into this press release. ParaZero is not responsible for the content of third-party websites.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Michal Efraty</p><p class=\"\">Investor Relations</p><p class=\"\">michal@efraty.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8N4Vyq:0-parazero-successfully-demonstrates-its-precision-airdrop-system-with-leading-defense-company/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005528:0",
            "title": "Currency Headwinds Cool Uber Bookings Outlook — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uber says it expects gross bookings in the current quarter of $42 billion-$43.5 billion, with the top end of that range coming in line with Wall Street's consensus view, according to FactSet. The 1Q outlook assumes a currency headwind to total growth of about 5.5 percentage points, the ride-hailing company says. Shares fall 5.3% premarket, despite 4Q results otherwise coming in ahead of Street views. (mark.long@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005528:0/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005530:0",
            "title": "Chipotle Mexican Is Maintained at Overweight by Keybanc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:55 GMT) </strong>Chipotle Mexican Price Target Cut to $64.00/Share From $66.00 by Keybanc</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005530:0/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005526:0",
            "title": "Chipotle Mexican Is Maintained at Equal-Weight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:55 GMT) </strong>Chipotle Mexican Price Target Cut to $60.00/Share From $63.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005526:0/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005524:0",
            "title": "Aon PLC Is Maintained at Outperform by Keefe, Bruyette & Woods",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:55 GMT) </strong>Aon PLC Price Target Raised to $414.00/Share From $411.00 by Keefe, Bruyette &amp; Woods</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005524:0/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX4wh64n:0",
            "title": "American Rebel CEO Andy Ross to Appear on ABC-TV Tampa Weekday Morning Show Morning Blend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Appearance Scheduled to Air on Friday, February 7 Broadcast Between 10 – 11 am Eastern</p><p class=\"\">Nashville, TN, Feb.  05, 2025  (GLOBE NEWSWIRE) — American Rebel Holdings, Inc.  (\"American Rebel\" or the \"Company\"), creator of American Rebel Beer (americanrebelbeer.com) and a designer, manufacturer, and marketer of branded safes, personal security and self-defense products and apparel (americanrebel.com), is excited to announce that its CEO Andy Ross will appear on the Friday, February 7 broadcast of Morning Blend (abcactionnews.com/morning-blend) on ABC Action News Tampa. Andy’s segment will appear between 10- 11 am Eastern Standard Time. Andy will promote the SCAG Power Equipment PRO Superstar Shootout (prosuperstarshootout.com) and his Saturday concert appearance on the American Rebel Beer stage near the starting line at the conclusion of racing, discuss the company’s sponsorship of Tony Stewart Racing’s Funny Car driven by Matt Hagan and the ongoing launch of American Rebel Beer.</p><p class=\"\">“The PRO Superstar Shootout is the Pro Bowl of the NHRA drag racing season,” said Andy Ross. “Last year’s debut event was a massive success and American Rebel and I are honored to participate. The PRO Superstar Shootout is a chance for the race teams to have some friendly competition and a dress rehearsal for the NHRA season. There’s nothing better than a weekend at the track, except a weekend at the track with an after party. I can’t wait to play my brand of country patriotic rock ‘n’ roll for these great fans.”</p><p class=\"\">“Coming to Florida to support the PRO Superstar Shootout and the Matt Hagan Dodge//SRT Hellcat American Rebel Light Funny Car is very important for American Rebel,” continued Andy Ross. “We recently had a launch party for American Rebel Beer in Nashville at Kid Rock’s bar on Broadway and Tony, Matt and some of the other Tony Stewart Racing Team folks came into town to support us…it meant the world to me and our company. It’s more than business, it’s family.”</p><p class=\"\">“I can’t wait to unleash the American Rebel Beer Funny Car with Andy Ross at Bradenton,” said Matt Hagan. “Andy and the American Rebel Beer Team are going full throttle as they launch a new premium domestic light beer. We’re proud to promote his brand and watch them expand into more states and bars nationwide. I’m honored to represent them and stand behind their bold American spirit.”</p><p class=\"\">“It’s always a good time when Andy plays a concert at the racetrack,” continued Matt Hagan. “He likes to rock and that suits us just fine.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About American Rebel Light Beer</strong></p><p class=\"\">Produced in partnership with AlcSource, American Rebel Light Beer (americanrebelbeer.com) is a premium domestic light lager celebrated for its exceptional quality and patriotic values. It stands out as America’s Patriotic, God-Fearing, Constitution-Loving, National Anthem-Singing, Stand Your Ground Beer.</p><p class=\"\">American Rebel Light is a Premium Domestic Light Lager Beer – All Natural, Crisp, Clean and Bold Taste with a Lighter Feel. With approximately 100 calories, 3.2 carbohydrates, and 4.3% alcoholic content per 12 oz serving, American Rebel Light Beer delivers a lighter option for those who love great beer but prefer a more balanced lifestyle. It’s all natural with no added supplements and importantly does not use corn, rice, or other sweeteners typically found in mass produced beers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Tony Stewart Racing (TSR) Nitro</strong></p><p class=\"\">As tenacious as Stewart is in the cockpit of a racecar, he’s proven equally adept at providing cars and equipment for racing’s elite. The three-time NASCAR Cup Series champion can also list 31 owners’ titles to his resume, from NASCAR to USAC to the World of Outlaws Sprint Car Series. In 2023 Stewart earned his 31st owner title when Matt Hagan and the TSR Funny Car team earned the championship on November 11th. His team, Tony Stewart Racing, fields a powerhouse lineup in the NHRA Mission Foods Drag Racing Series with Tony in Top Fuel and Matt Hagan in Funny Car. After more than four decades of racing around in circles, Stewart has embarked on a straight and narrow path, albeit at more than 300 mph. For more information on TSR Nitro go to tsrnitro.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About American Rebel Holdings, Inc.</strong></p><p class=\"\">American Rebel Holdings, Inc.  has operated primarily as a designer, manufacturer and marketer of branded safes and personal security and self-defense products and has recently transitioned into the beverage industry through the introduction of American Rebel Light Beer. The Company also designs and produces branded apparel and accessories. To learn more, visit www.americanrebel.com and www.americanrebelbeer.com. For investor information, visit www.americanrebel.com/investor-relations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">American Rebel Holdings, Inc.</strong></p><p class=\"\">info@americanrebel.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">American Rebel Beverages, LLC</strong></p><p class=\"\">Todd Porter, President</p><p class=\"\">tporter@americanrebelbeer.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. American Rebel Holdings, Inc., (NASDAQ: AREB; AREBW) (the “Company,” \"American Rebel,” “we,” “our” or “us”) desires to take advantage of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbor legislation. The words \"forecasts\" \"believe,\" \"may,\" \"estimate,\" \"continue,\" \"anticipate,\" \"intend,\" \"should,\" \"plan,\" \"could,\" \"target,\" \"potential,\" \"is likely,\" \"expect\" and similar expressions, as they relate to us, are intended to identify forward-looking statements. We have based these forward-looking statements primarily on our current expectations and projections about future events and financial trends that we believe may affect our financial condition, results of operations, business strategy, and financial needs. Important factors that could cause actual results to differ from those in the forward-looking statements include benefits of marketing outreach efforts, actual placement timing and availability of American Rebel Beer, success and availability of the promotional activities, our ability to effectively execute our business plan, and the Risk Factors contained within our filings with the SEC, including our Annual Report on Form 10-K for the year ended December 31, 2023. Any forward-looking statement made by us herein speaks only as of the date on which it is made. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. We undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future developments or otherwise, except as may be required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company Contact:</strong></p><p class=\"\">tporter@americanrebelbeer.com </p><p class=\"\">info@americanrebel.com</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">American Rebel Holdings Inc      </li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">American Rebel Holdings Inc</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">American Rebel Light</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX4wh64n:0-american-rebel-ceo-andy-ross-to-appear-on-abc-tv-tampa-weekday-morning-show-morning-blend/",
            "pub_date": "2025-02-05 20:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:d0cbb504d77d7:0",
            "title": "Griffon Corporation Announces First Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Griffon Corporation, a diversified management and holding company, has released its financial results for the first quarter of fiscal 2025, ending December 31, 2024. The company operates through two main segments: Home and Building Products (HBP) and Consumer and Professional Products (CPP).</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the first quarter of fiscal 2025, Griffon Corporation reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $632.4 million, a 2% decrease from $643.2 million in the same quarter of the previous year.</li><li class=\"listItem-bmN0_SHH\">Net income of $70.9 million, or $1.49 per share, compared to $42.2 million, or $0.82 per share, in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Adjusted net income of $65.9 million, or $1.39 per share, compared to $55.3 million, or $1.07 per share, in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $131.2 million, a 13% increase from $116.4 million in the prior year quarter.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">In the Home and Building Products (HBP) segment, revenue remained consistent at $395.4 million, reflecting increased residential volume offset by reduced commercial volume. Adjusted EBITDA for HBP increased by 2% to $127.0 million, driven by reduced material costs, partially offset by increased labor and distribution costs.</p><p class=\"\">The Consumer and Professional Products (CPP) segment saw a 4% decrease in revenue to $237.0 million, primarily due to decreased consumer demand in North America and the United Kingdom, partially offset by organic growth in Australia. The Pope acquisition contributed 4% to the revenue. Adjusted EBITDA for CPP increased significantly to $18.2 million from $5.5 million in the prior year quarter, mainly due to benefits from the global sourcing expansion initiative and increased revenue in Australia.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Griffon Corporation reported a leverage ratio of 2.4x net debt to EBITDA, an improvement from 2.5x at the end of December 2023. The company generated free cash flow of $142.7 million for the quarter, reflecting strong operating results. Additionally, Griffon repurchased 0.6 million shares for $42.3 million during the quarter, with $390.3 million remaining under the Board authorized share repurchase program.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Ronald J. Kramer, Chairman and Chief Executive Officer, commented, \"Fiscal 2025 is off to a strong start, with our first quarter results highlighted by free cash flow of $143 million, continued solid operating performance at Home and Building Products, and improved profitability from our global sourcing expansion initiative at Consumer and Professional Products. We are pleased with our performance and are on track to meet our financial targets for the year.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Griffon Corporation remains optimistic about its financial targets for the year, driven by strong free cash flow, solid operating performance, and strategic initiatives aimed at improving profitability and expanding global sourcing.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/50725/000005072525000005/gff-20250205.htm\" rel=\"nofollow\" target=\"_blank\">GRIFFON CORP [ GFF ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:d0cbb504d77d7:0-griffon-corporation-announces-first-quarter-results/",
            "pub_date": "2025-02-05 20:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0YB:0",
            "title": "Sagility India Dec-Quarter Consol Net Profit At 2.17 Billion Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sagility India Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAGILITY INDIA DEC-QUARTER CONSOL NET PROFIT 2.17 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAGILITY INDIA DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 14.53 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0YB:0-sagility-india-dec-quarter-consol-net-profit-at-2-17-billion-rupees/",
            "pub_date": "2025-02-05 20:55:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005482_20250205005485:0",
            "title": "Starboard Value Nominates Four Director Candidates to Kenvue Board >KVUE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005482_20250205005485:0/",
            "pub_date": "2025-02-05 20:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309836:0",
            "title": "Piper Sandler Initiates Opera at Overweight With $25 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Opera  has an average rating of buy and mean price target of $24.29, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309836:0/",
            "pub_date": "2025-02-05 20:49:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309840:0",
            "title": "Loop Capital Downgrades Aspen Technology to Hold From Buy, Adjusts Price Target to $265 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aspen Technology  has an average rating of Hold and mean price target of $261, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309840:0/",
            "pub_date": "2025-02-05 20:49:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW19R:0",
            "title": "Investment manager T Rowe misses quarterly profit estimates on persistent capital outflows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Asset manager T Rowe Price  missed Wall Street estimates for fourth-quarter profit on Wednesday as capital outflows countered the gains from a rallying equities market.</p><p class=\"\">Investors have been opting for the low-cost offerings of passively managed funds over active managers such as T Rowe, resulting in 15 consecutive quarters of capital outflows for the firm.</p><p class=\"\">The Federal Reserve's 100-basis-point rate cuts in the later half of 2024 have boosted investor interest in passive offerings further, as it becomes harder for active managers to beat booming benchmark index returns.</p><p class=\"\">The equity rally boosted Baltimore, Maryland-based company's average assets under management (AUM), which determine its investment advisory fees, by 19.2% to $1.64 trillion in the quarter, despite $19.3 billion of net outflows. Total net outflows for the year were $43.2 billion.</p><p class=\"\">T Rowe's investment advisory fees, the primary driver of its revenue, rose 16.1% to $1.67 billion for the three months ended Dec. 31.</p><p class=\"\">Adjusted profit rose to $484.8 million, or $2.12 per share, for the quarter, compared with analysts' expectations of $2.20 per share.</p><p class=\"\">The company had posted an adjusted profit of $394.7 million, or $1.72 per share, a year earlier.</p><p class=\"\">Peers Invesco  and Franklin Templeton  beat profit estimates last week, helped by rising investment fees as their AUM expanded.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW19R:0-investment-manager-t-rowe-misses-quarterly-profit-estimates-on-persistent-capital-outflows/",
            "pub_date": "2025-02-05 20:49:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309780:0",
            "title": "ValOre Metals Affiliate Acquires Uranium Properties in Saskatchewan from Skyharbour Resources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ValOre Metals  said Wednesday that its affiliate Hatchet Uranium agreed to acquire interests in two Skyharbour Resources  projects in Saskatchewan. </p><p class=\"\">Hatchet could acquire an 80% stake in Skyharbour's Highway uranium property and a 100% interest, subject to a \"claw-back\" provision, in the Genie, Usam and CBX/Shoe uranium projects. </p><p class=\"\">As part of the deal, Hatchet is required to raise $1.5 million in equity from external investors. ValOre said this financing requirement has been completed. </p><p class=\"\">Hatchet will also pay $25,000 cash and issue 1,452,013 units to Skyharbour. Upon closing, ValOre will hold a 51.5% equity ownership interest in Hatchet, decreasing from 56.8%. </p><p class=\"\">ValOre's share price gained 3.9% on Tuesday to $0.0675 on the TSXV.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309780:0/",
            "pub_date": "2025-02-05 20:49:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309831:0",
            "title": "FirstService Q4 Adjusted Earnings, Revenue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FirstService  reported Q4 adjusted earnings Wednesday of $1.34 per diluted share, up from $1.11 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $1.37. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $1.37 billion, up from $1.08 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $1.31 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309831:0/",
            "pub_date": "2025-02-05 20:49:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309843:0",
            "title": "TD Cowen Initiates Palvella Therapeutics at Buy With $44 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309843:0/",
            "pub_date": "2025-02-05 20:49:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005490:0",
            "title": "Tempur Sealy Raised to Outperform From Market Perform by William Blair",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005490:0/",
            "pub_date": "2025-02-05 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005482_20250205005488:0",
            "title": "Starboard Value's Kenvue Nominatees Include Starboard CEO Jeffrey Smith >KVUE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005482_20250205005488:0/",
            "pub_date": "2025-02-05 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw84YxNz:0",
            "title": "Cytophage Launches Incubator Egg Trials for OvaPhage in Partnership with Leading Canadian Hatchery",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">WINNIPEG, MB – February 5,2025 – TheNewswire -Cytophage Technologies (‘Cytophage’ or‘the Company’) (TSXV: CYTO; FSE: 70G) is proud to announce a newpartnership with one of Canada’s leading poultry hatcheries to beginincubator egg trials for OvaPhage, an innovative bacteriophage productdesigned to only target harmful bacteria on the surface of eggs, whilepreserving the natural protective cuticle of eggs. The trials areexpected to be completed by the third quarter of this year, and arethe next steps in proving the efficacy of OvaPhage. Cytophage’searly lab tests have demonstrated a 99% reduction in bacterial load onthe surface of eggs, setting the stage for this critical new phase ofreal-world validation.  </p><p class=\"\">Upon completion of the trials, Cytophage plans toprepare regulatory submissions, paving the way for OvaPhage’sinitial market launch in Canada, with global expansion tofollow.</p><p class=\"\">There are over 200 hatching egg producers in Canada. In2023, hatching egg farmers produced approximately 868 million broilerhatching eggs according to theCanadian Hatching Egg Producers,generating $500 million in farm revenues. Cytophage’s partnerhatchery represents a key segment of this market, and is recognized asa leader in advanced poultry management systems. The hatchery’sstaff are working closely with Cytophage to improve resiliency andproductivity in the poultry industry. OvaPhage addresses key industrypriorities, such as reducing bacterial contamination and increasinghatch rates. </p><p class=\"\">“This moment marks a turning point for our company.Moving from the lab to incubator egg trials is a key milestone inproving OvaPhage’s real-world efficacy,” said Cytophage CEO Dr.Steven Theriault. “We are excited to demonstrate how this technologycan redefine standards for the industry.”  </p><p class=\"\">OvaPhage Trials Process </p><p class=\"\">The OvaPhage trials advance in three stages, each onemoving the product towards broader commercialization:   </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Trial Stage </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Objective </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Outcome </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Timeline </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #1: Feasibility </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Assess OvaPhage’s compatibility with hatcheryprocesses.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Demonstrate OvaPhage’s readiness for large-scaleapplication by verifying its adherence properties andefficacy. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q1 2025 </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #2: Optimization </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Determine the most effective phage concentration andmethods.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Defined conditions for optimal performance. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q1-Q2 2025  </p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Stage #3: Validation </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Demonstrate OvaPhage’s performance.  </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Confirmed productivity enhancements and measurablebenefits. </p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Q2-Q3 2025 </p></td></tr></tbody></table></div><p class=\"\">“This is an exciting moment for Cytophage and ourinvestors,” said Julius Kalcevich, CFO of Cytophage. “The pathahead for OvaPhage is clear, and each milestone brings us closer totransforming poultry production and commercializing our innovativephage products.”  </p><p class=\"\">About Cytophage </p><p class=\"\">Cytophage Technologies (TSXV:CYTO / FSE: 70G) is a pioneeringbiotechnology company dedicated to bacteriophage research, productdevelopment and commercialization. </p><p class=\"\">Bacteriophages are viruses that only infect and killbacteria. These natural killers of bacteria can overcome cellular ororganism-level defences. They are nature’s version ofantibiotics. </p><p class=\"\">Cytophage is improving bacteria’s natural predatorswith environmental as well as genetic modifications to bring safe andtoxin free killer solutions to large addressable markets with aninitial focus on animal health which offers a fast-track to near-termrevenue. As a leading bacteriophage manufacturer in Canada and poweredby a large library of strains, Cytophage is committed to addressingthe global challenge of antibiotic resistance (AMR). The WHO predictsthat AMR will be the leading cause of human mortality by 2050. Manycountries have already banned or limited preventative antibiotic usein animal production including 27 EU countries, US, Canada, Brazil,Bangladesh, India and Mexico. In addition to that, consumers all overthe world are demanding organic and antibiotic-free products. </p><p class=\"\">Cytophage is using a de-risked and patented technologyto advance innovative and cost competitive products that harness thepower of bacteriophages to combat bacterial infections affecting humanhealth, animal health, and food security.  </p><p class=\"\">About OvaPhage </p><p class=\"\">At its core, OvaPhage represents a novel approach tobiosecurity for poultry hatcheries. Its advanced formulation enablesbacteriophages to adhere to eggshells, providing protection againstharmful bacteria like Salmonella, Escherichia andShigella species throughout the production process.  </p><p class=\"\">OvaPhage is part of the Company’s flagship suite ofanimal health products designed to target harmful bacteria without thetoxic effects of traditional chemicals. Key features willinclude:  </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Non-toxic and safe: Proven safe for animals, humans,and the environment.   </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cuticle preservation: Maintains the egg’s naturalprotective barrier, improving hatch rates.   </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Easy to Use: Seamlessly integrates with existinghatchery systems.   </p></li></ul><p class=\"\">For further information please contact:  </p><p class=\"\">Heather Medwick, Chief Operating Officer </p><p class=\"\">heather@cytophage.com | 431 388 8873 </p><p class=\"\">For media inquiries, please contact: </p><p class=\"\">Simon Bredin, PR Advisor (media@cytophage.com)  </p><p class=\"\">Cautionary Statement on Forward-LookingInformation </p><p class=\"\">This news release contains“forward-looking information” and “forward-looking statements”(collectively, “forward-looking statements”) within the meaning ofthe applicable Canadian securities legislation. All statements, otherthan statements of historical fact, are forward-looking statements andare based on expectations, estimates and projections as at the date ofthis news release. Anystatement that involves discussions with respect to predictions,expectations, beliefs, plans, projections, objectives, assumptions,future events or performance (often but not always using phrases suchas “expects”, or “does not expect”, “is expected”,“anticipates” or “does not anticipate”, “plans”,“budget”, “scheduled”, “forecasts”, “estimates”,“believes” or “intends” or variations of such words andphrases or stating that certain actions, events or results “may”or “could”, “would”, “might” or “will” be taken tooccur or be achieved) are not statements of historical fact and may beforward-looking statements. Forward-looking statements involve knownand unknown risks, uncertainties and other factors which may cause theactual results, performance or achievements of Cytophage to bematerially different from any future results, performance orachievements expressed or implied by the forward-looking statements.Factors that could cause actual results to differ materially fromthose anticipated in these forward-looking statements are described under the caption “RiskFactors” in Cytophage’s Filing Statement dated January 30, 2024,which is available for view on SEDAR+ at www.sedarplus.ca. These risksinclude but are not limited to, the risks associated with thebacteriophage industry, such as operational risks in development orcapital expenditures, the uncertainty of extensive regulatory approvalrequirements, government regulations, protection of intellectualproperty, product liability and rapid technological advancements.Forward-looking statements contained herein are made as of the date ofthis press release, and Cytophage disclaims, other than as required bylaw, any obligation to update any forward-looking statements whetheras a result of new information, results, future events, circumstances,or if management’s estimates or opinions should change, orotherwise. There can be no assurance that forward-looking statementswill prove to be accurate, as actual results and future events coulddiffer materially from those anticipated in such statements.Accordingly, the reader is cautioned not to place undue reliance onforward-looking statements.  </p><p class=\"\">Neither the TSXV nor its RegulationServices Provider (as that term is defined in the policies of theTSXV) accepts responsibility for the adequacy or accuracy of this newsrelease. </p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw84YxNz:0-cytophage-launches-incubator-egg-trials-for-ovaphage-in-partnership-with-leading-canadian-hatchery/",
            "pub_date": "2025-02-05 20:50:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSwdqsBa:0",
            "title": "Polaris Renewable Energy Declares Quarterly Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">TORONTO, ON / ACCESS Newswire / February 5, 2025 /</strong> Polaris Renewable Energy Inc.  (\"Polaris Renewable Energy\" or the \"Company\"), is pleased to announce that its board of directors has declared a quarterly dividend of US$0.15 per common share outstanding.</p><p class=\"\">This dividend will be paid on February 28th to shareholders of record at the close of business on February 17th. The dividend is an \"eligible dividend\" as designated for Canadian federal, provincial, and territorial income tax purposes.</p><p class=\"\">The board of directors of Polaris Renewable Energy remains committed to paying a quarterly dividend and will evaluate further dividend increases, as appropriate, going forward.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Polaris Renewable Energy Inc.</strong></p><p class=\"\">Polaris Renewable Energy Inc. is a Canadian publicly traded company engaged in the acquisition, development, and operation of renewable energy projects in Latin America &amp; the Caribbean. We are a high-performing and financially sound contributor to the energy transition.</p><p class=\"\">The Company's operations include a geothermal plant (~82 MW), four run-of river hydroelectric plants (~40 MW), three solar (photovoltaic) projects in operation (~35 MW) and one wind park (26 MW) following closing of the Puerto Rico acquisition.</p><p class=\"\">For more information, contact:</p><p class=\"\">Investor Relations</p><p class=\"\">Polaris Renewable Energy Inc.</p><p class=\"\">Phone: +1 647-245-7199</p><p class=\"\">Email: info@PolarisREI.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Cautionary Statements</strong></p><p class=\"\">This press release contains certain \"forward-looking information\" which may include, but is not limited to, statements with respect to future events or future performance, the expected use of proceeds or rating(s) of any such issuance, the Company's acquisition and other investment plans, any benefits to the Company's financial or business performance, the settlement date of the bonds and the listing of the bonds on the Oslo Alternative Bond Market. Such forward-looking information reflects management's current beliefs and is based on information currently available to management. Often, but not always, forward-looking statements can be identified by the use of words such as \"plans\", \"expects\", \"is expected\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"predicts\", \"intends\", \"targets\", \"aims\", \"anticipates\" or \"believes\" or variations (including negative variations) of such words and phrases or may be identified by statements to the effect that certain actions \"may\", \"could\", \"should\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. A number of known and unknown risks, uncertainties and other factors may cause the actual results or performance to materially differ from any future results or performance expressed or implied by the forward-looking information. Such factors include, among others, the ability of the Company to satisfy any interest payments, which may be affected by such factors as general business, economic, competitive, political and social uncertainties; the actual results of current geothermal, solar and hydro energy production, development and/or exploration activities and the accuracy of probability simulations prepared to predict prospective geothermal resources; changes in project parameters as plans continue to be refined; possible variations of production rates; failure of plant, equipment or processes to operate as anticipated; accidents, labour disputes and other risks of the geothermal and hydro power industries; political instability or insurrection or war; labour force availability and turnover; delays in obtaining governmental approvals or in the completion of development or construction activities, or in the commencement of operations; the ability of the Company to continue as a going concern and general economic conditions, as well as those factors discussed in the section entitled \"Risk Factors\" in the Company's Annual Information Form. These factors should be considered carefully and readers of this press release should not place undue reliance on forward-looking information.</p><p class=\"\">Although the forward-looking information contained in this press release is based upon what management believes to be reasonable assumptions, there can be no assurance that such forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information. Accordingly, readers should not place undue reliance on forward-looking information. The information in this press release, including such forward-looking information, is made as of the date of this press release and, other than as required by applicable securities laws, Polaris assumes no obligation to update or revise such information to reflect new events or circumstances.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Polaris Renewable Energy Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSwdqsBa:0/",
            "pub_date": "2025-02-05 20:50:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0JM:0",
            "title": "US futures knocked by Alphabet earnings; gold strikes record",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar loses out to yen, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold at record; Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">        U.S. stock futures fell on Wednesday after disappointing earnings from Alphabet, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.  </p><p class=\"\">Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/israel-hamas/\" rel=\"nofollow\" target=\"_blank\">war-ravaged Gaza Strip</a> and develop it economically.</p><p class=\"\">The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead. Gold hit another record high, driven mostly by a weaker dollar.</p><p class=\"\">    S&amp;P 500 futures  fell 0.5% and Nasdaq futures  lost 0.9%.      </p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area,\" said Paul Donovan, chief economist at UBS Global Wealth Management.</p><p class=\"\">Volatility across markets has run high in the last few trading days since Trump announced he would slap <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/tariffs/\" rel=\"nofollow\" target=\"_blank\">tariffs</a> on Canada and Mexico, only to backpedal within hours and agree to a one-month delay.</p><p class=\"\">Some sense of calm returned by Wednesday, leaving investors to focus on more micro-led events such as company earnings, where Google parent Alphabet missed forecasts as it ramped up spending on capex. Its shares fell 7% in premarket trading, suggesting a heavy fall at the opening bell later.    </p><p class=\"\">    Other stocks in focus were Walt Disney , which rose 0.8%, while those in ride-hailing app Uber  dropped 4%.  </p><p class=\"\">In Europe, activity was dominated by a heavy day for earnings, where shares in Novo Nordisk , the most valuable company in the region, rose 1.6% after beating fourth-quarter expectations, which helped lift the STOXX 600  by 0.1% on the day.</p><p class=\"\">The delays to tariffs have eased concern about how much scope the Federal Reserve might have to cut interest rates this year, pushing Treasury yields lower, although with China and Europe still in Trump's sights, the mood was cautious.</p><p class=\"\">\"The period of doubt - during which worries about 'tariff risk' prevails in the market - is not over yet,\" Thierry Wizman, global FX and rates strategist at Macquarie, said in a note.</p><p class=\"\">\"Traders may revisit those doubts in 30 days, as Trump tries to extract more concessions from Mexico and Canada, and then the EU.\" </p><p class=\"\">DOLLAR SOFTENS</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) eased 2 basis points on the day to below 4.2%, which in turn took some sheen off the dollar. The U.S. currency is relatively flat so far this year against a basket of major currencies, having risen 7% in 2024.</p><p class=\"\">Chinese markets returned from a week-long break for the Lunar New Year holidays. China has, so far, made a relatively restrained response to Trump's additional 10% in tariffs, announcing levies that cover just $14 billion of U.S. exports.</p><p class=\"\">Beijing set a firm fix for its yuan, countering concerns that it might allow the currency to slide to offset the impact of tariffs on its exports.</p><p class=\"\">Elsewhere in Asia, the Japanese yen  strengthened sharply against a range of currencies, after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.</p><p class=\"\">    The dollar fell 1% against the yen to 152.785, while the euro  was down 0.6% at 159.09.  </p><p class=\"\">Against the dollar, the euro rose 0.3% to $1.041 , having pulled off a two-year trough of $1.0125 at the start of the week. The dollar also fell 0.2% against the Canadian dollar to C$1.4293 , below this week's 22-year high at C$1.4792.</p><p class=\"\">In commodities, gold hit a fresh all-time high at $2,877 an ounce , buoyed in part by the pullback in the dollar and Treasury yields.</p><p class=\"\">Oil prices were weighed down by China's tariffs on imports of U.S. oil, which offset a potential boost from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent crude futures  fell 1.2% to $75.29 a barrel, while U.S. crude  fell 1.2% to $71.84.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0JM:0-us-futures-knocked-by-alphabet-earnings-gold-strikes-record/",
            "pub_date": "2025-02-05 20:50:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309844:0",
            "title": "JPMorgan Downgrades Federated Hermes to Underweight From Neutral, Adjusts Price Target to $41 From $42",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Federated Hermes  has an average rating of Hold and mean price target of $42, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309844:0/",
            "pub_date": "2025-02-05 20:50:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005432:0",
            "title": "Advanced Micro Devices Is Maintained at Neutral by B of A Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:43 GMT) </strong>Advanced Micro Devices Price Target Cut to $135.00/Share From $155.00 by B of A Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005432:0/",
            "pub_date": "2025-02-05 20:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b5fc1ba9b9da5:0",
            "title": "Lucky Strike Entertainment Corp SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lucky Strike Entertainment Corp, a leading provider of entertainment venues featuring bowling, food, and amusement activities, has released its Form 10-Q report for the fourth quarter of 2024. The report highlights the company's financial performance and operational activities, providing insights into its revenue streams, profitability, and future growth plans.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Total Revenues:</strong> $300.1 million, a decrease of 2% compared to the same period last year due to a decline in same-store sales, partially offset by new locations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Income:</strong> $46.9 million, representing 16% of total revenues, a decrease of 5% from the previous year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income:</strong> $28.3 million, a significant improvement from a net loss of $63.5 million in the prior year, driven by a decrease in the fair value of the earnout liability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Share, Basic:</strong> $0.17, compared to a loss of $0.44 per share in the previous year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Income Per Share, Diluted:</strong> $0.16, compared to a loss of $0.44 per share in the previous year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong></p> <p class=\"\">The company reported a slight decrease in bowling revenue by 4% for the three months ended December 29, 2024, compared to the same period last year. Food and beverage revenue remained relatively stable, while amusement and other revenue increased by 2%. For the six months ended December 29, 2024, food and beverage revenue increased by 7%, and amusement and other revenue saw a significant increase of 17%.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">New Production Launches</strong></p> <p class=\"\">The company completed and opened four newly built Lucky Strike locations in prime markets, with two others underway, indicating an expansion in production capacity and market presence.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">The company remains focused on creating long-term shareholder value through continued organic growth, conversion and upgrading of locations to more upscale entertainment concepts, opening new locations, and acquisitions. The company anticipates an increased acquisition environment during the 2025 fiscal year to further diversify its location-based entertainment offerings.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1840572/000162828025003930/bowl-20241229.htm\" rel=\"nofollow\" target=\"_blank\">Lucky Strike Entertainment Corp [ BOWL ] - 10-Q - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:b5fc1ba9b9da5:0-lucky-strike-entertainment-corp-sec-10-q-report/",
            "pub_date": "2025-02-05 20:43:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW12T:0",
            "title": "Nasdaq futures stumble on bleak Alphabet, AMD forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Chipotle falls after tepid sales forecast</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Disney gains after Q1 results beat estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Futures down: Dow 0.04%, S&amp;P 500 0.45%, Nasdaq 0.84%</li></ul></span></div><span><p class=\"\">    U.S. stock index futures declined on Wednesday, with the tech-heavy Nasdaq leading losses after disappointing forecasts from Alphabet and AMD in a busy day for corporate earnings.</p><p class=\"\">Google-parent Alphabet  dropped 7.1% in premarket trading after posting downbeat cloud revenue growth and earmarking a higher-than-expected $75 billion for its AI buildout this year, fanning concerns about its hefty investments into the technology.</p><p class=\"\">\"While some investors may have hoped that Silicon Valley would exercise caution in the wake of China's AI innovations, the opposite is occurring,\" Jochen Stanzl, chief market analyst at CMC Markets, said in a mailed statement.</p><p class=\"\">Advanced Micro Devices  lost 9.1% after CEO Lisa Su said the company's current-quarter data center sales - a proxy for its AI revenue - would fall about 7% from the previous quarter. </p><p class=\"\">Meanwhile, Apple  shed 2.6% after Bloomberg News reported that China's antitrust regulator was preparing for a possible investigation of the iPhone maker.</p><p class=\"\">At 07:08 a.m. ET, Dow E-minis  were down 20 points, or 0.04%, S&amp;P 500 E-minis  were down 27.25 points, or 0.45%, and Nasdaq 100 E-minis  were down 181.25 points, or 0.84%.</p><p class=\"\">All three major Wall Street indexes closed higher on Tuesday, with energy shares outperforming, while an earnings-driven jump in Palantir  boosted technology shares. </p><p class=\"\">A January private payrolls reading is due at 8:15 a.m. ET on Wednesday, while a survey on U.S. services activity for the month is due shortly after markets open.</p><p class=\"\">The all-important January nonfarm payrolls report is expected to be released on Friday.</p><p class=\"\">Markets also looked for developments on the tariffs front.</p><p class=\"\">U.S. President Donald Trump said on Tuesday he was in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the countries, sparked by sweeping 10% U.S. tariffs on all Chinese imports.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:817.658349328215px;aspect-ratio:1.3627639155470248\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW12T-30b95821f61fdb612ad90ae5923497be-resized.webp\" type=\"images/webp\"/><img alt=\"Wall Street's &quot;fear gauge&quot; has moved sharply recently due to several factors like tariffs, inflation worries and questions about AI spending\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW12T-30b95821f61fdb612ad90ae5923497be-resized.jpeg\" style=\"background-color:#2a2928\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Volatility spiked in US markets for the last month</span></figcaption></figure></span></p><p class=\"\">Morgan Stanley joined Barclays and Macquarie in forecasting a single 25-basis-point interest rate cut by the U.S. Federal Reserve this year, citing uncertainty from Trump's tariff policy.</p><p class=\"\">Fed Vice Chair Philip Jefferson as well as San Francisco Fed President Mary Daly on Tuesday reiterated the central bank's message that policymakers need not rush into easing rates further.</p><p class=\"\">Comments from four Fed heads including Richmond Fed President Thomas Barkin will be on the radar through the day.</p><p class=\"\">In other moves, FMC Corp  plunged 21.3% after the agrichemicals producer forecast first-quarter revenue below estimates.</p><p class=\"\">Chipotle Mexican Grill  slid 5.6% after the burrito maker forecast tepid annual comparable sales growth and said if Trump's proposed tariffs against Mexico went into full effect, the company would take a roughly 60-basis-point impact on its raw material costs this year.</p><p class=\"\">U.S.-listed shares of Chinese e-commerce firm PDD Holdings  dropped 6.6% after a report that the U.S. was considering whether to add PDD's Temu to Homeland Security's \"forced labor\" list.</p><p class=\"\">        Walt Disney  gained 1.4% after sharply outperforming quarterly earnings estimates.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW12T:0-nasdaq-futures-stumble-on-bleak-alphabet-amd-forecasts/",
            "pub_date": "2025-02-05 20:43:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005441:0",
            "title": "InMode Is Maintained at Overweight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:44 GMT) </strong>InMode Price Target Raised to $29.00/Share From $26.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005441:0/",
            "pub_date": "2025-02-05 20:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}