{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0NN:0",
            "title": "Payoneer Q4 revenue misses expectations, net income up 5%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Financial technology firm's Q4 revenue missed analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net income for Q4 increased 5% year-over-year</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company repurchased $175 mln in shares, 8% of shares outstanding</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payoneer expects 2026 revenue ex. interest between $900 mln and $940 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company projects 2026 adjusted EBITDA ex. interest at $85 mln to $95 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payoneer estimates 2026 transaction costs at ~15% of revenue</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>B2B SMB GROWTH - B2B SMBs revenue increased 17% year-over-year, contributing significantly to revenue ex. interest</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARPU INCREASE - ARPU grew 15% year-over-year, driven by larger customers and strategic pricing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INTEREST INCOME DECLINE - Interest income fell 8% in Q4 due to lower interest rates, affecting overall revenue</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Miss</span></p></td><td><p class=\"\"><span>$274.70 mln</span></p></td><td><p class=\"\"><span>$282.35 mln (10 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>$0.05</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>$19 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Expenses</span></p></td><td></td><td><p class=\"\"><span>$245.77 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating income</span></p></td><td></td><td><p class=\"\"><span>$28.92 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 10 \"strong buy\" or \"buy\", 1 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the business support services peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Payoneer Global Inc is $9.23, about 76.1% above its February 25 closing price of $5.24</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 19 times the next 12-month earnings vs. a P/E of 21 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0NN:0-payoneer-q4-revenue-misses-expectations-net-income-up-5/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008615:0",
            "title": "Papa John's Posts Lower 4Q Profit, Revenue as North American Business Struggles",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Connor Hart</span></p><p class=\"\"><span>Papa John's International said profit and revenue fell in the fourth quarter, hurt by a weak consumer backdrop and higher promotions across its North American business.</span></p><p class=\"\"><span>The pizza chain on Thursday posted a profit of $8.63 million, or 21 cents a share, down from $15 million, or 44 cents a share, a year earlier.</span></p><p class=\"\"><span>Stripping out one-time costs, earnings were 34 cents a share. Analysts polled by FactSet expected adjusted earnings of 33 cents a share.</span></p><p class=\"\"><span>Revenue fell 6.1% to $498.2 million and missed the $517.3 million that Wall Street modeled.</span></p><p class=\"\"><span>Chief Executive Todd Penegor said strength across international markets carried the company during the recent quarter, while its North American results reflect a weak consumer backdrop and elevated promotional environment.</span></p><p class=\"\"><span>Papa John's is making progress on its turnaround strategy as it works to reinforce its brand health, sharpen its value proposition, build its innovation pipeline and enhance customer experience, he added.</span></p><p class=\"\"><span>Looking forward, Papa John's guided for systemwide restaurant sales to be flat to down low single digits this year. Comparable sales, which account for store openings and closings, are projected to be down 2% to 4% in North America, offset by an estimated 2%-to-4% gain across international markets.</span></p><p class=\"\"><span>Shares fell 3.5% to $32.64 in premarket trading.</span></p><p class=\"\"><span>Write to Connor Hart at connor.hart@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008615:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601:0",
            "title": "Marcus Corporation Reports Fourth Quarter and Full Year Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q EPS 19c &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q Net $5.96M &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q Rev $193.5M &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>Press Release: Marcus Corporation Reports Fourth Quarter and Full Year Fiscal 2025 Results</span></p><p class=\"\"><span>Marcus Theatres leads the industry in fourth quarter box office growth; Marcus Hotels &amp; Resorts reports record revenue and Adjusted EBITDA for fiscal 2025</span></p><p class=\"\"><span>MILWAUKEE--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>The Marcus Corporation </span><span> today reported results for the fourth quarter and fiscal year 2025 ended December 31, 2025.</span></p><p class=\"\"><span>\"Both of our divisions outperformed their industries in the fourth quarter, with Marcus Theatres leading the industry in box office growth thanks to price optimization strategies and a favorable film slate, and Marcus Hotels &amp; Resorts delivering strong fourth quarter results to cap a record year for the division,\" said Gregory S. Marcus, chief executive officer of Marcus Corporation. \"During the fourth quarter, our theatre division benefitted from strong performances from family films and several blockbusters across genres that performed well in our markets. Consumers continued to show demand for out-of-home entertainment experiences, with a wide variety of great movies bringing audiences to the big screen at Marcus Theatres during the holiday season. We are excited for a 2026 film slate that includes several family films and some of the biggest movie franchises. In our hotel division, stable leisure demand and strong group bookings contributed to a year of record revenue and Adjusted EBITDA, with our newly renovated properties driving our outperformance in both the fourth quarter and full-year fiscal 2025. The positive impact of the strategic reinvestments made over the past few years will continue to position Marcus Hotels &amp; Resorts well for both the near- and long-term, as our renovated assets continue to win in their markets. As we look ahead to fiscal 2026 and beyond, we expect the building momentum in both businesses to be sustained by our long-standing commitment to operational excellence, the resiliency of our balance sheet, and the unwavering dedication of our valued associates.\"</span></p><p class=\"\"><span>Fourth Quarter Fiscal 2025 Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total revenues for the fourth quarter of fiscal 2025 were $193.5   million, a 2.8% increase from total revenues of $188.3 million for the   fourth quarter of fiscal 2024. Revenues were favorably impacted by a   shift in operating days due to the previously announced change in the   Company's fiscal calendar as described further below.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Operating income was $1.7 million for the fourth quarter of fiscal   2025, compared to operating loss of $2.2 million for the prior year   quarter. Operating income for the fourth quarter of fiscal 2025 was   negatively impacted by $5.2 million, or $0.12 per diluted common share   net of tax, of noncash impairment charges. Operating loss for the fourth   quarter of fiscal 2024 was negatively impacted by $6.4 million, or $0.15   per share net of tax, of noncash impairment charges.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings was $6.0 million for the fourth quarter of fiscal 2025,   compared to net earnings of $1.0 million for the same period in fiscal   2024. Net earnings for the fourth quarter of fiscal 2025 was favorably   impacted by $7.6 million, or $0.25 per diluted common share, of income   tax benefit from a historic rehabilitation tax credit (net of valuation   allowance) from the Hilton Milwaukee renovation. Net earnings for the   fourth quarter of fiscal 2024 was favorably impacted by $6.0 million, or   $0.19 per diluted common share, of income tax benefit due to decreases in   valuation allowances for deferred state income taxes.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings per diluted common share was $0.19 for the fourth quarter   of fiscal 2025, compared to net earnings per diluted common share of   $0.03 for the fourth quarter of fiscal 2024.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Adjusted EBITDA was $26.8 million for the fourth quarter of fiscal   2025, a 3.6% increase from Adjusted EBITDA of $25.9 million for the prior   year quarter. </span></li></ul><p class=\"\"><span>Full Year Fiscal 2025 Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total revenues for fiscal 2025 were $758.5 million, a 3.1% increase   from total revenues of $735.6 million for fiscal 2024.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Operating income was $17.1 million for fiscal 2025, a 5.5% increase   from operating income of $16.2 million for fiscal 2024. Operating income   for fiscal 2025 was negatively impacted by $5.2 million, or $0.12 per   diluted common share net of tax, of noncash impairment charges. Operating   income for fiscal 2024 was negatively impacted by $6.8 million, or $0.16   per share net of tax, of noncash impairment charges.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings was $12.7 million for fiscal 2025, compared to net loss of   $7.8 million for fiscal 2024. Net earnings for fiscal 2025 was favorably   impacted by $7.6 million, or $0.24 per diluted common share, of income   tax benefit from a historic rehabilitation tax credit (net of valuation   allowance) from the Hilton Milwaukee renovation, and was favorably   impacted by a $3.4 million, or $0.11 per share, gain from a property   insurance settlement, net of tax. Net loss for fiscal 2024 was favorably   impacted by $6.1 million, or $0.19 per diluted common share, of income   tax benefit due to decreases in valuation allowances for deferred state   income taxes, and was negatively impacted by $16.7 million, or $0.52 per   diluted common share, of debt conversion expense and related tax impacts   of convertible senior notes repurchases.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings per diluted common share was $0.41 for fiscal 2025,   compared to net loss per diluted common share of $0.25 for fiscal 2024.     </span></li><li class=\"listItem-bmN0_SHH\"><span>Adjusted EBITDA was $99.3 million for the full year fiscal 2025, a 3.1%   decrease from Adjusted EBITDA of $102.4 million for fiscal 2024. </span></li></ul><p class=\"\"><span>Marcus Theatres(R)</span></p><p class=\"\"><span>For the fourth quarter of fiscal 2025, Marcus Theatres reported total revenues of $123.8 million, a 2.2% increase over the same period last year. Revenues were favorably impacted by a shift in the fiscal calendar resulting in five additional days between Christmas and New Year's in exchange for four less days at the end of September. Operating income in the fourth quarter of fiscal 2025 was $7.7 million compared to operating income of $3.3 million for the same period of fiscal 2024 and was negatively impacted by $5.2 million of noncash impairment charges. Adjusted EBITDA in the fourth quarter of fiscal 2025 was $24.1 million, a 1.9% increase compared to $23.7 million in the fourth quarter of fiscal 2024.</span></p><p class=\"\"><span>Marcus Theatres outperformed the industry by 7.6 percentage points during the fourth quarter of fiscal 2025 compared to the fourth quarter of fiscal 2024, according to data from Comscore. Same store admission revenues for the fourth quarter of fiscal 2025 increased 6.1% compared to the fourth quarter of fiscal 2024. Same store attendance decreased 5.7% in the fourth quarter of fiscal 2025, with average ticket price increasing 12.7% compared to the prior year period due to strategic price changes designed to optimize pricing during peak demand periods, as well as a higher percentage of sales coming from premium large format and 3D showings. During the fourth quarter of fiscal 2025, Marcus Theatres' top five highest-performing films were Wicked: For Good, Zootopia 2, Avatar: Fire and Ash, Five Nights at Freddy's 2, and Black Phone 2.</span></p><p class=\"\"><span>For the full year fiscal 2025, Marcus Theatres reported total revenues of $462.7 million compared to $447.7 million in fiscal 2024, a 3.4% increase from the prior year period. Operating income was $29.4 million in fiscal 2025 compared to $22.1 million in fiscal 2024, a 32.9% increase that was negatively impacted by impairment charges of $5.2 million in fiscal 2025. Adjusted EBITDA for the year decreased to $76.5 million in fiscal 2025 compared to $78.1 million in fiscal 2024, primarily due to increased labor and other costs, with labor efficiency sequentially improving during the year. Average ticket price increased 3.7% during fiscal 2025 compared to fiscal 2024, while average concession revenue per person grew 4.1% over the prior year. The highest grossing films for the year included A Minecraft Movie, Wicked: For Good, Lilo &amp; Stitch, Zootopia 2 and Superman.</span></p><p class=\"\"><span>\"Marcus Theatres benefitted from a favorable mix of films in the fourth quarter, with blockbuster hits like Zootopia 2, Wicked: For Good, and Avatar: Fire and Ash and exciting originals like The Housemaid and Marty Supreme giving moviegoers of all ages and demographics a reason to enjoy incredible entertainment experiences at the movies,\" said Mark A. Gramz, president of Marcus Theatres. \"Looking to fiscal 2026, holdover fourth quarter fiscal 2025 films, including the long run of Avatar: Fire and Ash, and several new films released in the first quarter of fiscal 2026 has kicked off what is expected to be a robust slate of must-see movies in the year ahead. The franchise heavy slate includes the newest installments of several family favorites that tend to play well in our markets, including Toy Story 5, Minions &amp; Monsters, The Super Mario Galaxy Movie, and the live action adaptation of Moana, along with popular action adventures like Star Wars: The Mandalorian and Grogu, Spider-Man: Brand New Day, Dune: Part Three, and Avengers: Doomsday. Moreover, the highly anticipated release of Christopher Nolan's The Odyssey, nostalgic revivals like Scream 7 and The Devil Wears Prada 2, and a large slate of other appealing wide release films means fiscal 2026 has more than something for everyone. And with the highest concentration of luxury recliner seating and PLF screens among the top theatre circuits, incredible food and beverage offerings, consumer-friendly technology, and the outstanding contributions of our associates, Marcus Theatres is well positioned to capitalize on what is expected to be a memorable year of moviegoing.\" Several films have contributed to early fiscal 2026 first quarter results, including the carry over impact of late 2025 releases including Avatar: Fire and Ash, Zootopia 2, The Housemaid, Song Sung Blue, Anaconda, Marty Supreme, and The Spongebob Movie: Search for Square Pants, and new releases during the first quarter of fiscal 2026 such as 28 Years Later, The Bone Temple, Send Help, GOAT, Wuthering Heights and I Can Only Imagine 2. The film slate for fiscal 2026 features many well-known franchises and highly anticipated films including: Scream 7, Hoppers, Project Hail Mary, The Super Mario Galaxy Movie, Michael, The Devil Wears Prada 2, Star Wars: The Mandalorian and Grogu, Masters of the Universe, Toy Story 5, Supergirl: Woman of Tomorrow, Minions &amp; Monsters, Moana, The Odyssey, Spider-Man: Brand New Day, The Cat in the Hat, The Hunger Games: Sunrise on the Reaping, Hexed, Jumanji 3, Dune: Part Three, and Avengers: Doomsday.</span></p><p class=\"\"><span>Marcus(R) Hotels &amp; Resorts</span></p><p class=\"\"><span>During the fourth quarter of fiscal 2025, total revenues before cost reimbursements were $60.4 million, a 5.0% increase over the same period in fiscal 2024. Operating loss in the fourth quarter of fiscal 2025 was $0.1 million and was impacted by a $0.9 million increase in depreciation expense from hotel renovations. Adjusted EBITDA was $7.3 million in the fourth quarter of fiscal 2025, an increase of 3.4% compared to the fourth quarter of fiscal 2024.</span></p><p class=\"\"><span>Revenue per available room, or RevPAR, increased 3.5% at comparable company-owned hotels during the fourth quarter of fiscal 2025 compared to the prior year period. As a result, Marcus Hotels &amp; Resorts outperformed the industry by 2.7 percentage points during the fourth quarter of fiscal 2025, according to data from STR.</span></p><p class=\"\"><span>For the full year fiscal 2025, Marcus Hotels &amp; Resorts again reported record total revenues and record Adjusted EBITDA. Total revenues before cost reimbursements in fiscal 2025 were $257.6 million, a 3.7% increase compared to fiscal 2024. Operating income in fiscal 2025 was $14.4 million, a decrease of 22.0% from the prior year period primarily due to a $5.0 million increase in depreciation expense from hotel renovations completed in fiscal 2024 and 2025. Adjusted EBITDA was $42.7 million in fiscal 2025, a 2.7% increase compared to the prior year. RevPAR decreased 0.7% in fiscal 2025 compared to fiscal 2024 and was unfavorably impacted by room displacement during the Hilton Milwaukee renovation in the first half of the year.</span></p><p class=\"\"><span>\"We are proud to deliver another year of record revenues and Adjusted EBITDA, made even more impressive considering the number of rooms out of service during the Hilton Milwaukee renovation in the first half of the year and the difficult comparison to fiscal year 2024, which included the one-time positive impact of the Republican National Convention in Milwaukee,\" said Michael R. Evans, president of Marcus Hotels &amp; Resorts. \"Our newly renovated assets contributed meaningfully to our outperformance in both the fourth quarter and full year fiscal 2025 thanks to stable leisure demand and continued strong group bookings. As we look ahead, operational excellence across the portfolio will continue to drive our results as we settle into a less intensive capital reinvestment cycle.\"</span></p><p class=\"\"><span>Group booking pace for fiscal 2026 is running slightly ahead compared to the same period in fiscal 2025. Banquet and catering revenue for fiscal 2026 is running similarly ahead of the same time last year.</span></p><p class=\"\"><span>In December 2025, Marcus Hotels &amp; Resorts announced it completed the Hilton Milwaukee renovation, the most extensive renovation in the company's history. The project revitalized the hotel's lobby and bar, transformed its meeting and event spaces, and restyled its 554 guest rooms.</span></p><p class=\"\"><span>In January 2026, the division announced the opening of The Marc Hotel, an independent 175-room hotel in downtown Milwaukee, in the former west wing of the Hilton Milwaukee. Centrally located in the heart of the city, The Marc Hotel is connected to the Baird Center via a climate-controlled skywalk and located just steps from the city's premier corporate offices, sports and entertainment venues, several dining destinations, and nearby Marquette University.</span></p><p class=\"\"><span>Looking ahead, Grand Geneva Resort &amp; Spa will open its new short-course golf course, Wee Nip, in spring 2026. The new course is designed to cater to golfers of all skill levels, joining two championship courses and a new practice facility, as part of the acclaimed resort's ongoing multi-year renovation.</span></p><p class=\"\"><span>Return of Capital to Shareholders</span></p><p class=\"\"><span>During the fourth quarter of fiscal 2025, the Company repurchased 0.1 million shares of common stock for $1.8 million in cash, and during the full year fiscal 2025, the Company repurchased 1.1 million shares of common stock for $18.0 million in cash. In total, the Company returned $27.1 million in capital to shareholders through share repurchases and dividends paid during fiscal 2025.</span></p><p class=\"\"><span>Since resuming share repurchases in the third quarter of fiscal 2024, the Company has repurchased 1.8 million shares of common stock, or 5.7% of the shares outstanding, for $27.6 million in cash. In total, over the last two years the Company returned $45.6 million in capital to shareholders through share repurchases and dividends paid during fiscal 2024 and 2025.</span></p><p class=\"\"><span>As of December 31, 2025, there were 4.5 million shares remaining available for repurchase under Board of Directors repurchase authorizations. As of December 31, 2025, the Company had 23.7 million shares of common stock outstanding and 7.0 million shares of Class B common stock outstanding.</span></p><p class=\"\"><span>Fiscal Year Change</span></p><p class=\"\"><span>Beginning in fiscal 2025, the Company's fiscal year changed from a 52-53 week fiscal year ending on the last Thursday of each year to a fiscal year ending on December 31 of each year. Accordingly, fiscal 2025 was a 370 operating day fiscal year that began on December 27, 2024 and ended on December 31, 2025, with quarterly results for the three month periods ending March 31, June 30, September 30 and December 31. The fourth quarter of fiscal 2025 was favorably impacted by one additional operating day and by a shift in the fiscal calendar that included five additional days between the Christmas and New Year's holidays and four fewer days at the end of September, compared to the fourth quarter of fiscal 2024. Fiscal 2026 will be a 365 operating day fiscal year that began on January 1, 2026 and will end on December 31, 2026, with quarterly results for the three month periods ending March 31, June 30, September 30 and December 31.</span></p><p class=\"\"><span>Conference Call and Webcast</span></p><p class=\"\"><span>Marcus Corporation management will hold a conference call today, Thursday, February 26, 2026, at 10:00 a.m. Central/11:00 a.m. Eastern time. Interested parties may listen to the call live on the internet through the investor relations section of the company's website: investors.marcuscorp.com, or by dialing 1-646-844-6383 and entering the passcode 467741. Listeners should dial in to the call at least 5-10 minutes prior to the start of the call or should go to the website at least 15 minutes prior to the call to download and install any necessary audio software.</span></p><p class=\"\"><span>A telephone replay of the conference call will be available through Thursday, March 5, 2026, by dialing 1-866-813-9403 and entering passcode 631850. The webcast will be archived on the company's website until its next earnings release.</span></p><p class=\"\"><span>Non-GAAP Financial Measure</span></p><p class=\"\"><span>Adjusted EBITDA has been presented in this press release as a supplemental measure of financial performance that is not required by, or presented in accordance with, GAAP. The company defines Adjusted EBITDA as net earnings (loss) attributable to Marcus Corporation before investment income or loss, interest expense, other expense, gain or loss on disposition of property, equipment and other assets, equity earnings or losses from unconsolidated joint ventures, net earnings or losses attributable to noncontrolling interests, income taxes, depreciation and amortization and non-cash share-based compensation expense, adjusted to eliminate the impact of certain items that the company does not consider indicative of its core operating performance. A reconciliation of this measure to the equivalent measure under GAAP, along with reconciliations of this measure for each of our operating segments, are set forth in the attached table.</span></p><p class=\"\"><span>Adjusted EBITDA is a key measure used by management and the company's board of directors to assess the company's financial performance and enterprise value. The company believes that Adjusted EBITDA is a useful measure, as it eliminates certain expenses and gains that are not indicative of the company's core operating performance and facilitates a comparison of the company's core operating performance on a consistent basis from period to period. The company also uses Adjusted EBITDA as a basis to determine certain annual cash bonuses and long-term incentive awards, to supplement GAAP measures of performance to evaluate the effectiveness of its business strategies, to make budgeting decisions, and to compare its performance against that of other peer companies using similar measures. Adjusted EBITDA is also used by analysts, investors and other interested parties as a performance measure to evaluate industry competitors.</span></p><p class=\"\"><span>Adjusted EBITDA is a non-GAAP measure of the company's financial performance and should not be considered as an alternative to net earnings (loss) as a measure of financial performance, or any other performance measure derived in accordance with GAAP and it should not be construed as an inference that the company's future results will be unaffected by unusual or non-recurring items. Additionally, Adjusted EBITDA is not intended to be a measure of liquidity or free cash flow for management's discretionary use. In addition, this non-GAAP measure excludes certain non-recurring and other charges and has its limitations as an analytical tool. You should not consider Adjusted EBITDA in isolation or as a substitute for analysis of the company's results as reported under GAAP. In evaluating Adjusted EBITDA, you should be aware that in the future the company will incur expenses that are the same as or similar to some of the items eliminated in the adjustments made to determine Adjusted EBITDA, such as acquisition expenses, preopening expenses, accelerated depreciation, impairment charges and other adjustments. The company's presentation of Adjusted EBITDA should not be construed to imply that the company's future results will be unaffected by any such adjustments. Definitions and calculations of Adjusted EBITDA differ among companies in our industries, and therefore Adjusted EBITDA disclosed by the company may not be comparable to the measures disclosed by other companies.</span></p><p class=\"\"><span>About Marcus Corporation</span></p><p class=\"\"><span>Headquartered in Milwaukee, Marcus Corporation is a leader in the entertainment and hospitality industries, with significant company-owned real estate assets. Marcus Corporation's theatre division, Marcus Theatres(R) , is the fourth largest theatre circuit in the U.S. and currently owns or operates 985 screens at 78 locations in 17 states under the Marcus Theatres, Movie Tavern(R) by Marcus and BistroPlex(R) brands. The company's hospitality division, Marcus(R) Hotels &amp; Resorts, owns and/or manages 17 hotels, resorts and other properties in eight states. For more information, please visit the company's website at www.marcuscorp.com.</span></p><p class=\"\"><span>Certain matters discussed in this press release are \"forward-looking statements\" intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements may generally be identified as such because the context of such statements include words such as we \"believe, \" \"anticipate,\" \"expect\" or words of similar import. Similarly, statements that describe our future plans, objectives or goals are also forward-looking statements. Such forward-looking statements are subject to certain risks and uncertainties which may cause results to differ materially from those expected, including, but not limited to, the following: (1) the adverse effects future pandemics or epidemics may have on our theatre and hotels and resorts businesses, results of operations, liquidity, cash flows, financial condition, access to credit markets and ability to service our existing and future indebtedness; (2) the availability, in terms of both quantity and audience appeal, of motion pictures for our theatre division (including disruptions in the production of films due to events such as a strike by actors, writers or directors or future pandemics); (3) the effects of theatre industry dynamics such as the maintenance of a suitable window between the date such motion pictures are released in theatres and the date they are released to other distribution channels; (4) the effects of adverse economic conditions in our markets; (5) the effects of adverse economic conditions on our ability to obtain financing on reasonable and acceptable terms, if at all; (6) the effects on our occupancy and room rates caused by the relative industry supply of available rooms at comparable lodging facilities in our markets; (7) the effects of competitive conditions in our markets; (8) our ability to achieve expected benefits and performance from our strategic initiatives and acquisitions; (9) the effects of increasing depreciation expenses, reduced operating profits during major property renovations, impairment losses, and preopening and start-up costs due to the capital intensive nature of our business; (10) the effects of changes in the availability of and cost of labor and other supplies essential to the operation of our business; (11) the effects of tariffs that are implemented or merely threatened on our costs; (12) the effects of weather conditions, particularly during the winter in the Midwest and in our other markets; (13) our ability to identify properties to acquire, develop and/or manage and the continuing availability of funds for such development; (14) the adverse impact on business and consumer spending on travel, leisure and entertainment resulting from terrorist attacks in the United States or other incidents of violence in public venues such as hotels and movie theatres; and (15) a disruption in our business and reputational and economic risks associated with civil securities claims brought by shareholders. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control and difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. Our forward-looking statements are based upon our assumptions, which are based upon currently available information. Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are made only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span> </span><br/><span>                     THE MARCUS CORPORATION </span><br/><span> </span><br/><span>             Consolidated Statements of Operations </span><br/><span>                          (Unaudited) </span><br/><span>             (in thousands, except per share data) </span><br/><span> </span><br/><span>                     Three Months Ended    Twelve Months Ended </span><br/><span>                    --------------------  ---------------------- </span><br/><span>                    December   December   December    December </span><br/><span>                    31, 2025   26, 2024   31, 2025    26, 2024 </span><br/><span>                    ---------  ---------  ---------  ----------- </span><br/><span>Revenues: </span><br/><span>   Theatre </span><br/><span>    admissions      $ 59,392   $ 56,265   $220,385   $214,421 </span><br/><span>   Rooms              25,762     24,616    114,544    113,344 </span><br/><span>   Theatre </span><br/><span>    concessions       51,001     50,759    197,856    191,989 </span><br/><span>   Food and </span><br/><span>    beverage          21,153     20,384     84,410     78,102 </span><br/><span>   Other revenues     26,353     26,118    100,563     97,230 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>                     183,661    178,142    717,758    695,086 </span><br/><span>   Cost </span><br/><span>    reimbursements     9,837     10,171     40,700     40,474 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Total revenues       193,498    188,313    758,458    735,560 </span><br/><span> </span><br/><span>Costs and </span><br/><span>expenses: </span><br/><span>   Theatre </span><br/><span>    operations        61,511     59,909    234,680    225,472 </span><br/><span>   Rooms              10,530     10,550     43,624     43,425 </span><br/><span>   Theatre </span><br/><span>    concessions       20,419     20,943     82,169     78,406 </span><br/><span>   Food and </span><br/><span>    beverage          16,335     15,392     63,900     60,419 </span><br/><span>   Advertising and </span><br/><span>    marketing          7,012      6,111     26,077     24,559 </span><br/><span>   Administrative     21,977     21,724     92,578     88,958 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization      17,915     17,970     70,191     67,958 </span><br/><span>   Rent                6,368      6,437     25,243     25,911 </span><br/><span>   Property taxes      3,597      2,655     16,222     14,716 </span><br/><span>   Other operating </span><br/><span>    expenses          11,087     12,284     40,838     42,269 </span><br/><span>   Impairment </span><br/><span>    charges            5,172      6,351      5,172      6,823 </span><br/><span>   Reimbursed </span><br/><span>    costs              9,837     10,171     40,700     40,474 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Total costs and </span><br/><span> expenses            191,760    190,497    741,394    719,390 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span> </span><br/><span>Operating income </span><br/><span> (loss)                1,738     (2,184)    17,064     16,170 </span><br/><span> </span><br/><span>Other income </span><br/><span>(expense): </span><br/><span>   Investment </span><br/><span>    income               414        557        878      2,231 </span><br/><span>   Interest </span><br/><span>    expense           (2,903)    (2,812)   (11,472)   (10,972) </span><br/><span>   Other income </span><br/><span>    (expense)           (452)      (392)     2,848     (1,513) </span><br/><span>   Debt conversion </span><br/><span>    expense               --       (203)        --    (15,521) </span><br/><span>   Equity losses </span><br/><span>    from </span><br/><span>    unconsolidated </span><br/><span>    joint </span><br/><span>    ventures            (173)      (158)      (611)      (604) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>                      (3,114)    (3,008)    (8,357)   (26,379) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span> </span><br/><span>Earnings (loss) </span><br/><span> before income </span><br/><span> taxes                (1,376)    (5,192)     8,707    (10,209) </span><br/><span>Income tax benefit    (7,332)    (6,178)    (3,984)    (2,422) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Net earnings </span><br/><span> (loss)             $  5,956   $    986   $ 12,691   $ (7,787) </span><br/><span>                     =======    =======    =======    ======= </span><br/><span> </span><br/><span>Net earnings </span><br/><span> (loss) per common </span><br/><span> share - diluted    $   0.19   $   0.03   $   0.41   $  (0.25) </span><br/><span> </span><br/><span>Weighted average </span><br/><span> shares </span><br/><span> outstanding - </span><br/><span> diluted              30,768     31,766     31,279     31,887 </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                           THE MARCUS CORPORATION </span><br/><span> </span><br/><span>                   Condensed Consolidated Balance Sheets </span><br/><span>                                (Unaudited) </span><br/><span>                               (In thousands) </span><br/><span> </span><br/><span>                                             December 31,     December 26, </span><br/><span>                                                  2025             2024 </span><br/><span>                                            ---------------  --------------- </span><br/><span> </span><br/><span>Assets: </span><br/><span> </span><br/><span>   Cash and cash equivalents                 $       23,448   $       40,841 </span><br/><span>   Restricted cash                                    3,134            3,738 </span><br/><span>   Accounts receivable                               19,082           21,457 </span><br/><span>   Assets held for sale                                  --            1,199 </span><br/><span>   Other current assets                              18,912           24,915 </span><br/><span>   Property and equipment, net                      697,712          685,734 </span><br/><span>   Operating lease right-of-use assets              142,115          159,194 </span><br/><span>   Other assets                                     110,129          107,450 </span><br/><span>                                                -----------      ----------- </span><br/><span> </span><br/><span>Total Assets                                 $    1,014,532   $    1,044,528 </span><br/><span>                                                ===========      =========== </span><br/><span> </span><br/><span>Liabilities and Shareholders' Equity: </span><br/><span> </span><br/><span>   Accounts payable                          $       44,523   $       50,690 </span><br/><span>   Taxes other than income taxes                     18,482           18,696 </span><br/><span>   Other current liabilities                         81,390           78,806 </span><br/><span>   Current portion of finance lease </span><br/><span>    obligations                                       2,827            2,591 </span><br/><span>   Current portion of operating lease </span><br/><span>    obligations                                      16,219           15,765 </span><br/><span>   Current maturities of long-term debt                  --           10,133 </span><br/><span>   Finance lease obligations                          8,452           10,360 </span><br/><span>   Operating lease obligations                      148,977          164,776 </span><br/><span>   Long-term debt                                   159,007          149,007 </span><br/><span>   Deferred income taxes                             30,905           32,619 </span><br/><span>   Other long-term obligations                       46,372           46,219 </span><br/><span>   Equity                                           457,378          464,866 </span><br/><span>                                                -----------      ----------- </span><br/><span> </span><br/><span>Total Liabilities and Shareholders' Equity   $    1,014,532   $    1,044,528 </span><br/><span>                                                ===========      =========== </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                    THE MARCUS CORPORATION </span><br/><span> </span><br/><span>                 Business Segment Information </span><br/><span>                         (Unaudited) </span><br/><span>                        (In thousands) </span><br/><span> </span><br/><span>                            Hotels/     Corporate </span><br/><span>               Theatres      Resorts      Items       Total </span><br/><span>               ---------  ------------  ---------  ----------- </span><br/><span>Three Months </span><br/><span>Ended </span><br/><span>December 31, </span><br/><span>2025 </span><br/><span>Revenues       $ 123,793   $   69,536   $    169   $193,498 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)            7,687          (90)    (5,859)     1,738 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     10,439        7,106        370     17,915 </span><br/><span>Adjusted </span><br/><span> EBITDA           24,112        7,338     (4,636)    26,814 </span><br/><span> </span><br/><span>Three Months </span><br/><span>Ended </span><br/><span>December 26, </span><br/><span>2024 </span><br/><span>Revenues       $ 121,158   $   67,074   $     81   $188,313 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)            3,344          481     (6,009)    (2,184) </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     11,452        6,216        302     17,970 </span><br/><span>Adjusted </span><br/><span> EBITDA           23,658        7,095     (4,872)    25,881 </span><br/><span> </span><br/><span>Twelve Months </span><br/><span>Ended </span><br/><span>December 31, </span><br/><span>2025 </span><br/><span>Revenues       $ 462,741   $  295,269   $    448   $758,458 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)           29,437       14,416    (26,789)    17,064 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     41,755       26,873      1,563     70,191 </span><br/><span>Adjusted </span><br/><span> EBITDA           76,458       42,719    (19,909)    99,268 </span><br/><span> </span><br/><span>Twelve Months </span><br/><span>Ended </span><br/><span>December 26, </span><br/><span>2024 </span><br/><span>Revenues       $ 447,723   $  287,506   $    331   $735,560 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)           22,147       18,477    (24,454)    16,170 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     45,352       21,917        689     67,958 </span><br/><span>Adjusted </span><br/><span> EBITDA           78,070       41,584    (17,247)   102,407 </span><br/><span> </span><br/><span>Corporate items include amounts not allocable to the business </span><br/><span>segments. Corporate revenues consist principally of rent and </span><br/><span>the corporate operating loss includes general corporate </span><br/><span>expenses. Corporate information technology costs and </span><br/><span>accounting shared services costs are allocated to the business </span><br/><span>segments based upon several factors, including actual usage </span><br/><span>and segment revenues. </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                     Supplemental Data </span><br/><span>                        (Unaudited) </span><br/><span>                       (In thousands) </span><br/><span> </span><br/><span>                 Three Months Ended    Twelve Months Ended </span><br/><span>                --------------------  ---------------------- </span><br/><span>                December   December   December    December </span><br/><span>Consolidated    31, 2025   26, 2024   31, 2025    26, 2024 </span><br/><span>-------------   ---------  ---------  ---------  ----------- </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> operating </span><br/><span> activities     $ 48,800   $ 52,566   $ 84,200   $103,940 </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> investing </span><br/><span> activities      (24,767)   (23,501)   (71,373)   (81,898) </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> financing </span><br/><span> activities       (7,932)   (17,531)   (30,824)   (37,301) </span><br/><span>Capital </span><br/><span> expenditures    (22,402)   (25,440)   (83,211)   (79,210) </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                    THE MARCUS CORPORATION </span><br/><span> </span><br/><span>   Reconciliation of Net earnings (loss) to Adjusted EBITDA </span><br/><span>                         (Unaudited) </span><br/><span>                        (In thousands) </span><br/><span> </span><br/><span>                     Three Months Ended   Twelve Months Ended </span><br/><span>                     ------------------  --------------------- </span><br/><span>                     December  December  December </span><br/><span>                       31,       26,       31,      December </span><br/><span>                       2025      2024      2025     26, 2024 </span><br/><span>                     --------  --------  --------  ----------- </span><br/><span>Net earnings (loss)  $ 5,956   $   986   $12,691   $ (7,787) </span><br/><span>Add (deduct): </span><br/><span>    Investment </span><br/><span>     (income) loss      (414)     (557)     (878)    (2,231) </span><br/><span>    Interest </span><br/><span>     expense           2,903     2,812    11,472     10,972 </span><br/><span>    Other expense </span><br/><span>     (income) (a)        452       392    (2,848)     1,513 </span><br/><span>    (Gain) loss on </span><br/><span>     disposition of </span><br/><span>     property, </span><br/><span>     equipment and </span><br/><span>     other assets        703       291      (553)       386 </span><br/><span>    Equity losses </span><br/><span>     from </span><br/><span>     unconsolidated </span><br/><span>     joint </span><br/><span>     ventures            173       158       611        604 </span><br/><span>    Income tax </span><br/><span>     expense </span><br/><span>     (benefit)        (7,332)   (6,178)   (3,984)    (2,422) </span><br/><span>    Depreciation </span><br/><span>     and </span><br/><span>     amortization     17,915    17,970    70,191     67,958 </span><br/><span>    Share-based </span><br/><span>     compensation </span><br/><span>     (b)               1,286     1,049     7,502      8,206 </span><br/><span>    Impairment </span><br/><span>     charges (c)       5,172     6,351     5,172      6,823 </span><br/><span>    Theatre exit </span><br/><span>     costs (d)            --        --       135        136 </span><br/><span>    Insured losses </span><br/><span>     (recoveries) </span><br/><span>     (e)                  --         4      (243)       243 </span><br/><span>    Debt conversion </span><br/><span>     expense (f)          --       203        --     15,521 </span><br/><span>    Other </span><br/><span>     non-recurring </span><br/><span>     (g)                  --     2,400        --      2,485 </span><br/><span>                      ------    ------    ------    ------- </span><br/><span>   Adjusted EBITDA   $26,814   $25,881   $99,268   $102,407 </span><br/><span>                      ======    ======    ======    ======= </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>         Reconciliation of Operating income (loss) to Adjusted EBITDA by Reportable Segment </span><br/><span>                                             (Unaudited) </span><br/><span>                                           (In thousands) </span><br/><span> </span><br/><span>                   Three Months Ended December 31, 2025      Twelve Months Ended December 31, 2025 </span><br/><span>                  --------------------------------------  ------------------------------------------- </span><br/><span>                             Hotels                                    Hotels </span><br/><span>                                &amp;      Corp.                              &amp;       Corp. </span><br/><span>                  Theatres   Resorts    Items    Total     Theatres    Resorts    Items      Total </span><br/><span>                  ---------  -------  --------  --------  -----------  -------  ---------  ---------- </span><br/><span>Operating income </span><br/><span> (loss)           $   7,687  $  (90)  $(5,859)  $  1,738  $29,437      $14,416  $(26,789)  $17,064 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization     10,439   7,106       370     17,915   41,755       26,873     1,563    70,191 </span><br/><span>   Loss (gain) </span><br/><span>    on </span><br/><span>    disposition </span><br/><span>    of property, </span><br/><span>    equipment </span><br/><span>    and other </span><br/><span>    assets              660      43        --        703     (813)         277       (17)     (553) </span><br/><span>   Share-based </span><br/><span>    compensation </span><br/><span>    (b)                 154     279       853      1,286    1,015        1,153     5,334     7,502 </span><br/><span>   Impairment </span><br/><span>    charges (c)       5,172      --        --      5,172    5,172           --        --     5,172 </span><br/><span>   Theatre exit </span><br/><span>    costs (d)            --      --        --         --      135           --        --       135 </span><br/><span>   Insured </span><br/><span>    losses </span><br/><span>    (recoveries) </span><br/><span>    (e)                  --      --        --         --     (243)          --        --      (243) </span><br/><span>                   --------   -----    ------    -------   ------       ------   -------    ------ </span><br/><span>   Adjusted </span><br/><span>    EBITDA        $  24,112  $7,338   $(4,636)  $ 26,814  $76,458      $42,719  $(19,909)  $99,268 </span><br/><span> </span><br/><span> </span><br/><span>                    Three Months Ended December 26, 2024    Twelve Months Ended December 26, 2024 </span><br/><span>                   --------------------------------------  --------------------------------------- </span><br/><span>                              Hotels                                 Hotels </span><br/><span>                                 &amp;      Corp.                           &amp;       Corp. </span><br/><span>                   Theatres   Resorts    Items    Total    Theatres  Resorts    Items      Total </span><br/><span>                   ---------  -------  --------  --------  --------  -------  ---------  --------- </span><br/><span>Operating income </span><br/><span> (loss)            $   3,344  $   481  $(6,009)  $(2,184)  $ 22,147  $18,477  $(24,454)  $  16,170 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization      11,452    6,216      302    17,970     45,352   21,917       689      67,958 </span><br/><span>   Loss (gain) on </span><br/><span>    disposition </span><br/><span>    of property, </span><br/><span>    equipment and </span><br/><span>    other assets         155      141       (5)      291        254      137        (5)        386 </span><br/><span>   Share-based </span><br/><span>    compensation </span><br/><span>    (b)                  169      257      623     1,049        932    1,053     6,221       8,206 </span><br/><span>   Impairment </span><br/><span>    charges (c)        6,351       --       --     6,351      6,823       --        --       6,823 </span><br/><span>   Theatre exit </span><br/><span>    costs (d)             --       --       --        --        136       --        --         136 </span><br/><span>   Insured losses </span><br/><span>    (recoveries) </span><br/><span>    (e)                    4       --       --         4        243       --        --         243 </span><br/><span>   Other </span><br/><span>    non-recurring </span><br/><span>    (g)                2,183       --      217     2,400      2,183       --       302       2,485 </span><br/><span>                    --------   ------   ------    ------    -------   ------   -------    -------- </span><br/><span>   Adjusted </span><br/><span>    EBITDA         $  23,658  $ 7,095  $(4,872)  $25,881   $ 78,070  $41,584  $(17,247)  $ 102,407 </span><br/><span> </span><br/><span> </span><br/><span>(a)    Includes a gain from an insurance settlement of $4.5M related to </span><br/><span>       insured property damage at one theatre location in fiscal 2025. </span><br/><span>(b)    Non-cash expense related to share-based compensation programs. </span><br/><span>(c)    Non-cash impairment charges in fiscal 2025 related to eight operating </span><br/><span>       theatres and one vacant parcel of land. Non-cash impairment charges in </span><br/><span>       fiscal 2024 related to three operating theatres, one operating theatre </span><br/><span>       that closed in early fiscal 2025, and one permanently closed theatre. </span><br/><span>       Non-cash impairment charges in fiscal 2023 related to one permanently </span><br/><span>       closed theatre. </span><br/><span>(d)    Non-recurring costs related to the closure and exit of one theatre </span><br/><span>       location in fiscal 2024. </span><br/><span>(e)    Repair costs and insurance recoveries that are non-operating in nature </span><br/><span>       related to insured property damage at one theatre location. </span><br/><span>(f)    Debt conversion expense for repurchases of $100.1 million aggregate </span><br/><span>       principal amount of Convertible Notes. See Convertible Senior Notes in </span><br/><span>       the \"Liquidity and Capital Resources\" section of MD&amp;A included in the </span><br/><span>       fiscal 2025 Form 10-K for further discussion. </span><br/><span>(g)    Other non-recurring in fiscal 2024 includes settlement and legal </span><br/><span>       expenses related to an equipment lease agreement impacted by the </span><br/><span>       COVID-19 pandemic in Theatres, and professional fees related to </span><br/><span>       convertible debt repurchase transactions and corporate office </span><br/><span>       relocation expenses in Corporate Items. </span><br/><span> </span></pre><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260225045975/en/</span></p><p class=\"\"><span>CONTACT:    For additional information, contact:</span></p><p class=\"\"><span>Chad Paris</span></p><p class=\"\"><span>(414) 905-1100</span></p><p class=\"\"><span>investors@marcuscorp.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601_20260226008603:0",
            "title": "Marcus Corp 4Q Rev $193.5M >MCS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601_20260226008603:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601_20260226008602:0",
            "title": "Marcus Corp 4Q Net $5.96M >MCS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601_20260226008602:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601_20260226008601:0",
            "title": "Marcus Corp 4Q EPS 19c >MCS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601_20260226008601:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008614:0",
            "title": "Acadia Realty Trust Announces $0.20 Per Share Quarterly Dividend",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>RYE, N.Y.--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>Acadia Realty Trust </span><span> (\"Acadia\" or the \"Company\") today announced that its Board of Trustees has authorized a cash dividend of $0.20 per common share for the quarter ended March 31, 2026. The quarterly dividend is payable on April 15, 2026 to holders of record as of March 31, 2026.</span></p><p class=\"\"><span>About Acadia Realty Trust</span></p><p class=\"\"><span>Acadia Realty Trust is an equity real estate investment trust focused on delivering long-term, profitable growth. Acadia owns and operates a high-quality core real estate portfolio (\"REIT Portfolio\") of street and open-air retail properties in the nation's most dynamic retail corridors, along with an investment management platform that targets opportunistic and value-add investments through its institutional co-investment vehicles (\"Investment Management\"). For further information, please visit www.acadiarealty.com.</span></p><p class=\"\"><span>Safe Harbor Statement</span></p><p class=\"\"><span>Certain statements in this press release may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the \"Securities Act\"), and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). Forward-looking statements, which are based on certain assumptions and describe the Company's future plans, strategies and expectations are generally identifiable by the use of words, such as \"may,\" \"will,\" \"should,\" \"expect,\" \"anticipate,\" \"estimate,\" \"believe,\" \"intend\" or \"project,\" or the negative thereof, or other variations thereon or comparable terminology. Forward-looking statements involve known and unknown risks, uncertainties and other factors that could cause the Company's actual results and financial performance to be materially different from future results and financial performance expressed or implied by such forward-looking statements, including, but not limited to: (i) macroeconomic conditions, including due to geopolitical instability and global trade disruptions, which may lead to a disruption of or lack of access to the capital markets and other sources of funding, and rising inflation; (ii) the Company's success in implementing its business strategy and its ability to identify, underwrite, finance, consummate and integrate diversifying acquisitions and investments; (including the potential acquisitions discussed in this press release); (iii) changes in general economic conditions or economic conditions in the markets in which the Company may, from time to time, compete, including the impact of recently announced tariffs on our tenants and their customers, and their effect on the Company's and our tenants' revenues, earnings and funding sources; (iv) increases in the Company's borrowing costs as a result of rising inflation, changes in interest rates and other factors; (v) the Company's ability to pay down, refinance, restructure or extend its indebtedness as it becomes due; (vi) the Company's investments in joint ventures and unconsolidated entities, including its lack of sole decision-making authority and its reliance on its joint venture partners' financial condition; (vii) the Company's ability to obtain the financial results expected from its development and redevelopment projects; (viii) the ability and willingness of the Company's tenants to renew their leases with the Company upon expiration, the Company's ability to re-lease its properties on the same or better terms in the event of nonrenewal or in the event the Company exercises its right to replace an existing tenant, and obligations the Company may incur in connection with the replacement of an existing tenant; (ix) the Company's potential liability for environmental matters; (x) damage to the Company's properties from catastrophic weather and other natural events, and the physical effects of climate change; (xi) the economic, political and social impact of, and uncertainty surrounding, any public health crisis; (xii) uninsured losses; (xiii) the Company's ability and willingness to maintain its qualification as a REIT in light of economic, market, legal, tax and other considerations; (xiv) information technology (\"IT\") security breaches, including increased cybersecurity risks relating to the use of remote technology and artificial intelligence (\"AI\"); (xv) risks associated with our use of AI tools, which could result in reputational harm, and legal or regulatory liability; (xvi) the loss of key executives; and (xvii) the accuracy of the Company's methodologies and estimates regarding corporate responsibility metrics, goals and targets, tenant willingness and ability to collaborate towards reporting such metrics and meeting such goals and targets, and the impact of governmental regulation on our corporate responsibility efforts.</span></p><p class=\"\"><span>The factors described above are not exhaustive and additional factors could adversely affect the Company's future results and financial performance, including the risk factors discussed under the section captioned \"Risk Factors\" in the Company's most recent Annual Report on Form 10-K and other periodic or current reports the Company files with the SEC. Any forward-looking statements in this press release speak only as of the date hereof. The Company expressly disclaims any obligation or undertaking to release publicly any updates or revisions to any forward-looking statements to reflect any changes in the Company's expectations with regard thereto or changes in the events, conditions or circumstances on which such forward-looking statements are based.</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260226053571/en/</span></p><p class=\"\"><span>CONTACT:    Acadia Realty Trust</span></p><p class=\"\"><span>(914) 288-8100</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008614:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSpGn6Va:0",
            "title": "Mongolia Growth Group Announces Return of Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, ON / ACCESS Newswire / February 26, 2026 / </span><em><span>Mongolia Growth</span></em><span> Group Ltd. (NEX:YAK.H, \"MGG\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") today announced that its Board of Directors (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Board</span></strong><span>\") has determined to proceed with a transaction to be completed as a plan of arrangement (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Arrangement</span></strong><span>\") under the provisions of the </span><em><span>Business Corporations Act</span></em><span> (Alberta) pursuant to which shareholders of the Company will be entitled to receive (among other things) cash in the amount of $1.28 per common share (a \"</span><strong class=\"root-Tkn6WL2y\"><span>Common Share</span></strong><span>\").</span></p><p class=\"\"><span>Under the terms of the Arrangement, each issued and outstanding Common Share as at the close of business on the effective date of the Arrangement will be exchanged for: (i) one (1) new common share in the capital of the Company (a \"</span><strong class=\"root-Tkn6WL2y\"><span>New Common Share</span></strong><span>\"); and (ii) one (1) redeemable preferred share in the capital of the Company (a \"</span><strong class=\"root-Tkn6WL2y\"><span>Redeemable Preferred Share</span></strong><span>\"), which Redeemable Preferred Shares will be immediately redeemed by the Company for cash, in accordance with their terms, for $1.28 per Redeemable Preferred Share (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Redemption Amount</span></strong><span>\"). As a result of the completion of the Arrangement (including the payment of the Redemption Amount), shareholders will receive, for each Common Share held, one New Common Share and $1.28 in cash. The New Common Shares issued pursuant to the Arrangement are expected to be substantially similar to the currently outstanding Common Shares, provided that each New Common Share will entitle the holder thereof to two (2) votes per New Common Share.</span></p><p class=\"\"><span>The Company believes that the Arrangement represents an opportunity to return capital to shareholders in an effective and efficient manner and represents the best course of action in order to complete the same, consistent with the Company's previously stated intentions to return a substantial portion of the Company's cash assets to shareholders.</span></p><p class=\"\"><span>The Arrangement is subject to the approval by two-thirds of the votes cast by holders of Common Shares present or represented by proxy at a special meeting of holders of Common Shares (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Meeting</span></strong><span>\") to be held in May 2026. In addition to the required approvals of shareholders, closing of the Arrangement is also subject to obtaining the approval of the Court of King's Bench of Alberta, the NEX Board of the TSX Venture Exchange (the \"</span><strong class=\"root-Tkn6WL2y\"><span>NEX</span></strong><span>\"), as well as other customary closing conditions.</span></p><p class=\"\"><span>Further details regarding the Arrangement will be contained in a management information circular (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Circular</span></strong><span>\") for the Meeting to be sent to holders of Common Shares in connection with the Meeting. If all approvals are received and other closing conditions are satisfied in a timely manner, the Arrangement is expected to be completed shortly after the Meeting.</span></p><p class=\"\"><span>The Arrangement is the result of a review process by the Board in connection with the Company's previously stated return of capital strategy. The Board, having undertaken a thorough review of, and having carefully considered, among other things, the terms of the Arrangement and its impact on the Company and all relevant stakeholders, other available courses of action and information concerning the Company and other relevant matters, has unanimously: (i) determined that the Arrangement is in the best interests of the Company and fair to shareholders; (ii) approved the Arrangement; and (iii) recommended that shareholders vote FOR the Arrangement.</span></p><p class=\"\"><span>Subsequent to the completion of the Arrangement, including the payment of the aggregate Redemption Amount, the Company will retain cash assets of approximately $1 million to fund ongoing costs and expenses, and expects to continue to be listed on the NEX and may consider and pursue new business opportunities which may be of a benefit to shareholders.</span></p><p class=\"\"><span>The Circular will be available for viewing under the Company's SEDAR+ profile at </span><strong class=\"root-Tkn6WL2y\"><span>www.sedarplus.ca</span></strong><span>. All shareholders are urged to read the Circular once available, as it will contain additional important information concerning the Arrangement and how to vote their Common Shares.</span></p><p class=\"\"><span>For further information please contact:</span></p><p class=\"\"><span>Genevieve Walkden</span></p><p class=\"\"><span>Corporate Secretary &amp; Chief Financial Officer</span></p><p class=\"\"><span>Email: gwalkden@mongoliagrowthgroup.com</span></p><p class=\"\"><span>Phone: (877) 644-1186</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Information Disclaimer</span></strong></p><p class=\"\"><span>This press release contains forward-looking information within the meaning of applicable securities laws. Forward-looking statements include, but are not limited to, statements regarding the timing of the Arrangement, the effective date, the date of the Meeting, the Company after the completion of the Arrangement, business intentions after the completion of the Arrangement, and the anticipated closing of the Arrangement. These statements are subject to numerous risks and uncertainties, including regulatory approvals and shareholder approvals. Readers are cautioned not to place undue reliance on these statements.</span></p><p class=\"\"><span>This news release includes forward-looking statements that are subject to risks and uncertainties. All statements within, other than statements of historical fact, are to be considered forward looking. Although the Company believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in forward-looking statements. Factors that could cause actual results to differ materially from those in forward-looking statements include general economic, market and business conditions, the regulatory process and actions, regulator and corporate approvals, technical issues, new legislation, competitive and general economic factors and conditions, the uncertainties resulting from potential delays or changes in plans, the occurrence of unexpected events, and the Company's capability to execute and implement its future plans. Actual results may differ materially from those projected by management. There can be no assurances that such statements will prove accurate and, therefore, readers are advised to rely on their own evaluation of such uncertainties. We do not assume any obligation to update any forward-looking statements.</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Mongolia Growth Group Ltd.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSpGn6Va:0/",
            "pub_date": "2026-02-26 20:45:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSDwF7Ya:0",
            "title": "Greene Concepts Announces Federal Registration of Be Water(TM) Trademark, Supporting National Brand Expansion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>MARION, NC / ACCESS Newswire / February 26, 2026 /</span></strong><span> Greene Concepts Inc. (OTCID:INKW), owner and operator of a 60,000-square-foot bottling facility in Marion, North Carolina, and producer of the premium artesian spring water brand Be Water, announced it has received federal trademark registration from the United States Patent and Trademark Office (USPTO).</span></p><p class=\"\"><span>Registered under U.S. Registration No. 8145597, the trademark completes a USPTO review process that began in April 2021 and establishes federal protection for the Be Water brand.</span></p><p class=\"\"><span>Federal trademark registration provides important advantages for consumer brands, including a legal presumption of ownership, nationwide notice of rights, and stronger enforcement options in federal court.</span></p><p class=\"\"><span>For Greene Concepts, the registration strengthens brand protection as the Company continues expanding retail and e-commerce distribution and evaluating additional partnership channels.</span></p><p class=\"\"><span>\"This is a meaningful achievement for Greene Concepts and for the Be Water brand,\" said Lenny Greene, President and CEO of Greene Concepts, Inc. \"Securing federal trademark registration reinforces the identity we have worked hard to build and supports our long-term vision for national expansion and brand recognition.\"</span></p><p class=\"\"><span>\"This registration reflects the years of work invested in developing Be Water as a premium American artesian spring water brand,\" Greene added. \"As we continue expanding distribution and building awareness, having our trademark fully registered adds clarity, credibility, and long-term protection to everything we are building.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Follow Greene Concepts, Inc. on Social Media at:</span></strong><span> X - @GreeneConcepts , Facebook - @inkw2025, Instagram - Greene Concepts, Inc. and Be Water</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Greene Concepts, Inc.</span></strong></p><p class=\"\"><span>Greene Concepts, Inc. (https://www.greeneconcepts.com) is a publicly traded company whose purpose is to provide the world with high-quality, healthy and enhanced beverage choices that meet the nutritional needs of its consumers while refreshing their mind, body and spirit. The Company's flagship product, Be Water, is a premium artesian bottled water that supports total body health and wellness. Greene Concepts' beverage and bottling plant is located in Marion,North Carolina, and their water is ethically sourced from spring and artesian wells that are fed from a natural aquifer located deep beneath the Blue Ridge Mountains. Greene Concepts continues to develop and market premium beverage brands designed to enhance the daily lives of consumers.</span></p><p class=\"\"><span>Safe Harbor: This Press Release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. These forward-looking statements are based on the current plans and expectations of management and are subject to a few uncertainties and risks that could significantly affect the company's current plans and expectations, as well as future results of operations and financial condition. A more extensive listing of risks and factors that may affect the company's business prospects and cause actual results to differ materially from those described in the forward-looking statements can be found in the reports and other documents filed by the company with the Securities and Exchange Commission and OTC Markets, Inc. OTC Disclosure and News Service. The company undertakes no obligation to publicly update or revise any forward-looking statements, because of new information, future events or otherwise.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CONTACT:</span></strong></p><p class=\"\"><span>Greene Concepts, Inc.</span></p><p class=\"\"><span>Investor Relations</span></p><p class=\"\"><span>IR@greeneconcepts.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Greene Concepts Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSDwF7Ya:0/",
            "pub_date": "2026-02-26 20:45:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_Tnw2kKNkW:0",
            "title": "Trailbreaker Resources Announces Flow-Through Financing up to $3M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>February 26, 2026  TheNewswire - Trailbreaker Resources Ltd.(TBK.V) (Trailbreaker or theCompany) today announces a non-brokered structured private placementoffering (the Offering), to consist of the sale of the followingsecurities:</span></p><p class=\"\"><span>a. up to 2,142,857 CMETCflow-through units (CMETC FT Units) at a price of $0.56 perCMETC FT Unit, to raise gross proceeds of up to $1.2 million, to fundcritical minerals exploration expenses, each CMETC FT Unitconsisting of 1 CMETC FT common share and  of a common sharepurchase warrant, each of which will qualify as a \"flow-throughshare\" within the meaning of subsection 66(15) of theIncome Tax Act (Canada) (the \"Tax Act\"). Each full warrant isexercisable at $0.50 for 24 months from the date of issue for one non-flow-through common share;and</span></p><p class=\"\"><span>b. up to 3,600,000 flow-throughunits (FT Units) at a price of $0.50 per FT Unit to raise grossproceeds of up to $1.8 million, each FT Unit consisting of 1 FT commonshare and  of a common share purchase warrant, each of which willqualify as a \"flow-through share\" within the meaning ofsubsection 66(15) of the Tax Act. Each full warrant is exercisable at$0.50 for 24 months from the date of issue forone non-flow-through common share.</span></p><p class=\"\"><span>All of the FT Units and CMETC FT Units issued pursuantto the Offering, which is subject to TSX Venture Exchange acceptance,will be subject to a hold period in Canada of four months plus one dayfrom closing.</span></p><p class=\"\"><span>The Company will use an amount equal to the grossproceeds received by the Company from the sale of the FT Units andCMETC FT Units, pursuant to the provisions in the Tax Act, to incureligible Canadian exploration expenses that qualify, in the caseof the FT Units, as flow-through mining expenditures within themeaning of the Tax Act, and, in the case of the CMETC FT Units, asflow-through critical mineral mining expenditures within themeaning of the Tax Act, and, in each case, for FT Units and CMETC FTUnits purchased by eligible British Columbia purchasers, as \"BCflow-through mining expenditures\" that meet the criteria setforth in subsection 4.721(1) of the Income Tax Act(British Columbia), in respect of the exploration activities on theCompany's properties in British Columbia (the QualifyingExpenditures). The Qualifying Expenditures will be incurred on orbefore December 31, 2027, and renounced by the Company to the initialpurchasers of the FT Units and CMETC FT Units effective December 31,2026. </span></p><p class=\"\"><span>The proceeds of the Private Placement will be used toadvance the Companys various exploration projects.</span></p><p class=\"\"><span>ON BEHALF OF THE BOARD</span></p><p class=\"\"><span>Daithi Mac Gearailt</span></p><p class=\"\"><span>President and Chief Executive Officer</span></p><p class=\"\"><span>For new information about the Companys projects, please visitTrailbreakers website at TrailbreakerResources.com and sign up toreceive news. For further information, follow Trailbreakers tweetsat Twitter.com/TrailbreakerLtd, use the Contact section of ourwebsite,</span></p><p class=\"\"><span>or contact us at  (604) 681-1820 or at info@trailbreakerresources.com.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange norits Regulation Services Provider (as that term is defined in thepolicies of the TSX Venture Exchange) accepts responsibility for theadequacy or accuracy of this release.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_Tnw2kKNkW:0-trailbreaker-resources-announces-flow-through-financing-up-to-3m/",
            "pub_date": "2026-02-26 20:45:03",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5750Ua:0",
            "title": "REG - Tudor Cap Eur LLP JTC PLC - Form 8.3 JTC Plc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5750U  Tudor Capital Europe LLP  26 February 2026  </span><p class=\"\"><span>FORM 8.3</span></p><p class=\"\"><span>PUBLIC OPENING POSITION DISCLOSURE/DEALING DISCLOSURE BY</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A PERSON WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE</span></strong></p><p class=\"\"><span>Rule 8.3 of the Takeover Code (the \"Code\")</span></p><p class=\"\"><span>1. KEY INFORMATION</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>(a) Full name of discloser:</span></p></td><td><p class=\"\"><span>Tudor Investment Corporation</span></p></td></tr><tr><td><p class=\"\"><span>(b) Owner or controller of interests and short positions disclosed, if different from 1(a):</span></p><p class=\"\"><span> The naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>(c) Name of offeror/offeree in relation to whose relevant securities this form relates:</span></p><p class=\"\"><span> Use a separate form for each offeror/offeree</span></p></td><td><p class=\"\"><span>JTC PLC</span></p></td></tr><tr><td><p class=\"\"><span>(d) If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree:</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>(e) Date position held/dealing undertaken:</span></p><p class=\"\"><span> For an opening position disclosure, state the latest practicable date prior to the disclosure</span></p></td><td><p class=\"\"><span>25/02/2026</span></p></td></tr><tr><td><p class=\"\"><span>(f) In addition to the company in 1(c) above, is the discloser making disclosures in respect of any other party to the offer?</span></p><p class=\"\"><span> If it is a cash offer or possible cash offer, state \"N/A\"</span></p></td><td><p class=\"\"><span>NO</span></p></td></tr></tbody></table></div><p class=\"\"><span>2. POSITIONS OF THE PERSON MAKING THE DISCLOSURE</span></p><p class=\"\"><span>If there are positions or rights to subscribe to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2(a) or (b) (as appropriate) for each additional class of relevant security.</span></p><p class=\"\"><span>(a) Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security:</span></p></td><td colspan=\"4\"><p class=\"\"><span>1p ordinary</span></p></td></tr><tr><td></td><td colspan=\"2\"><p class=\"\"><span>Interests</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short positions</span></p></td></tr><tr><td></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td></tr><tr><td><p class=\"\"><span>(1) Relevant securities owned and/or controlled:</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(2) Cash-settled derivatives:</span></p></td><td><p class=\"\"><span>3,955,359</span></p></td><td><p class=\"\"><span>2.2945</span></p></td><td><p class=\"\"><span>43,557</span></p></td><td><p class=\"\"><span>0.03</span></p></td></tr><tr><td><p class=\"\"><span>(3) Stock-settled derivatives (including options) and agreements to purchase/sell:</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span> TOTAL:</span></p></td><td><p class=\"\"><span>3,955,359</span></p></td><td><p class=\"\"><span>2.2945</span></p></td><td><p class=\"\"><span>43,557</span></p></td><td><p class=\"\"><span>0.03</span></p></td></tr></tbody></table></div><p class=\"\"><span>All interests and all short positions should be disclosed.</span></p><p class=\"\"><span>Details of any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form8 (Open Positions).</span></p><p class=\"\"><span>(b) Rights to subscribe for new securities (including directors' and other employee options)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security in relation to which subscription right exists:</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Details, including nature of the rights concerned and relevant percentages:</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr></tbody></table></div><p class=\"\"><span>3. DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE</span></p><p class=\"\"><span>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.</span></p><p class=\"\"><span>The currency of all prices and other monetary amounts should be stated.</span></p><p class=\"\"><span>(a) Purchases and sales</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Purchase/sale</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit</span></p></li></ul><p class=\"\"><span>(b) Cash-settled derivative transactions</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>Ordinary</span></p></td></tr><tr><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. CFD</span></p></td><td><p class=\"\"><span>Equity Swaps</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. opening/closing a long/short position, increasing/reducing a long/short position</span></p></td><td><p class=\"\"><span>Increasing a long position</span></p></td></tr><tr><td><p class=\"\"><span>Number of reference securities</span></p></td><td><p class=\"\"><span>13,200</span></p></td></tr><tr><td><p class=\"\"><span>Price per unit</span></p></td><td><p class=\"\"><span>13</span></p></td></tr></tbody></table></div><p class=\"\"><span>(c) Stock-settled derivative transactions (including options)</span></p><p class=\"\"><span>(i) Writing, selling, purchasing or varying</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description e.g. call option</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Writing, purchasing, selling, varying etc.</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of securities to which option relates</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Exercise price per unit</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Type</span></p><p class=\"\"><span>e.g. American, European etc.</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Expiry date</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Option money paid/ received per unit</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>(ii) Exercise</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Product description</span></p><p class=\"\"><span>e.g. call option</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Exercising/ exercised against</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Number of securities</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Exercise price per unit</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>(d) Other dealings (including subscribing for new securities)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security</span></p></td><td><p class=\"\"><span>N/A</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span>e.g. subscription, conversion</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Details</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Price per unit (if applicable)</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>4. OTHER INFORMATION</span></p><p class=\"\"><span>(a) Indemnity and other dealing arrangements</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer:</span></p><p class=\"\"><span>Irrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><p class=\"\"><span>(b) Agreements, arrangements or understandings relating to options or derivatives</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any agreement, arrangement or understanding, formal or informal, between the person making the disclosure and any other person relating to:</span></p><p class=\"\"><span>(i) the voting rights of any relevant securities under any option; or</span></p><p class=\"\"><span>(ii) the voting rights or future acquisition or disposal of any relevant securities to which any derivative is referenced:</span></p><p class=\"\"><span>If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>None</span></p></li></ul><p class=\"\"><span>(c) Attachments</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Is a Supplemental Form 8 (Open Positions) attached?</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>YES/NO</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Date of disclosure:</span></td><td><p class=\"\"><span>26/02/2026</span></p></td></tr><tr><td><span>Contact name:</span></td><td><p class=\"\"><span>Ben Kitchener</span></p></td></tr><tr><td><span>Telephone number*:</span></td><td><p class=\"\"><span>+44 (203) 755-3935</span></p></td></tr></tbody></table></div><p class=\"\"><span>Public disclosures under Rule 8 of the Code must be made to a Regulatory Information Service.</span></p><p class=\"\"><span>The Panel's Market Surveillance Unit is available for consultation in relation to the Code's disclosure requirements on +44 (0)20 7638 0129.</span></p><p class=\"\"><span>*If the discloser is a natural person, a telephone number does not need to be included, provided contact information has been provided to the Panel's Market Surveillance Unit.</span></p><p class=\"\"><span>The Code can be viewed on the Panel's website at www.thetakeoverpanel.org.uk.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.  ENDRETSEUFEMEMSEDE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5750Ua:0-reg-tudor-cap-eur-llp-jtc-plc-form-8-3-jtc-plc/",
            "pub_date": "2026-02-26 20:45:11",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM19E:0",
            "title": "Al Moammar Information Systems Obtains SAR 550 Million Banking Facility",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>AL MOAMMAR INFORMATION SYSTEMS COMPANY SJSC </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OBTAINS ISLAMIC SHARIA-COMPLIANT BANKING FACILITY</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FINANCING AMOUNT SAR 550 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM19E:0-al-moammar-information-systems-obtains-sar-550-million-banking-facility/",
            "pub_date": "2026-02-26 20:45:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0NU:0",
            "title": "FTI Consulting Q4 revenue up 11%, beats expectations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Consulting firm's Q4 revenue rose 11%, beating analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Adjusted EPS for Q4 beat analyst expectations, rising 14% yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company repurchased 5.26 mln shares in 2025, costing $858.6 mln</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FTI Consulting estimates 2026 revenue between $3.940 bln and $4.100 bln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FTI Consulting expects 2026 EPS to range from $8.90 to $9.60</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company does not expect Adjusted EPS to differ from EPS in 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CORPORATE FINANCE GROWTH - Revenue in Corporate Finance segment rose 26.1% due to increased demand and higher bill rates for turnaround &amp; restructuring services</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FORENSIC AND LITIGATION CONSULTING - Revenue increased 9.7% driven by higher bill rates for risk &amp; investigations services</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ECONOMIC CONSULTING DECLINE - Revenue fell 14.5% due to lower demand for antitrust services</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$990.70 mln</span></p></td><td><p class=\"\"><span>$918.55 mln (3 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EPS</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$1.78</span></p></td><td><p class=\"\"><span>$1.46 (3 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>$1.78</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy\", 2 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the business support services peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for FTI Consulting Inc is $177.50, about 11% above its February 25 closing price of $159.98</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 17 times the next 12-month earnings vs. a P/E of 18 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0NU:0-fti-consulting-q4-revenue-up-11-beats-expectations/",
            "pub_date": "2026-02-26 20:45:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936294:0",
            "title": "WVE: Cash doubled to $602.1M, net loss widened, and major clinical milestones expected in 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Cash position doubled year-over-year to $602.1M, supporting a cash runway into Q3 2028. Net loss widened to $204.4M for 2025 as R&amp;D spending increased, while revenue declined. Key clinical milestones for obesity and AATD programs are expected in 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936294-6dd1d982a878fec031ca715e6e539922\" target=\"_blank\">Wave Life Sciences Ltd. [WVE] SEC 8-K Current Report  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936294:0-wve-cash-doubled-to-602-1m-net-loss-widened-and-major-clinical-milestones-expected-in-2026/",
            "pub_date": "2026-02-26 20:39:09",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936289:0",
            "title": "DSX: Q4 2025 net income fell to $3.1M, but full-year net income rose to $17.8M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net income for Q4 2025 declined to $3.1 million, with full-year net income rising to $17.8 million. Time charter revenues and operating income decreased year-over-year, while fleet utilization remained high at 99.7%.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936289-b030cc146c2bc28f9bf2471c87db55f0\" target=\"_blank\">Diana Shipping inc. [DSX] SEC 6-K Current Report  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936289:0-dsx-q4-2025-net-income-fell-to-3-1m-but-full-year-net-income-rose-to-17-8m/",
            "pub_date": "2026-02-26 20:39:09",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0N6:0",
            "title": "Trump tariff turmoil yet to dent emerging countries' growth, EBRD says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Libby George and Karin Strohecker</span></p><p class=\"\"><span>    U.S. tariffs have rerouted trade, but not dented it as much as feared, allowing larger-than-expected economic growth in certain developing markets, the European Bank for Reconstruction and Development said on Thursday. </span></p><p class=\"\"><span>Growth in the 41 countries covered by the development finance institution rose by a larger-than-forecast 3.4%, but the bank warned that continued trade turmoil could yet derail growth in some of the economies. </span></p><p class=\"\"><span>\"The picture is somewhat more optimistic than in the autumn...and we expect this year and next year to be even better than last year,\" the EBRD's chief economist Beata Javorcik told Reuters.    </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:883.8174273858922px;aspect-ratio:1.4730290456431536\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZM0N6-e20b945dbd2e116a0e1b84fe9145fe66-resized.webp\" type=\"image/webp\"/><img alt=\"Growth in 2025 has outpaced the forecasts made during the worst of the trade tensions\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZM0N6-e20b945dbd2e116a0e1b84fe9145fe66-resized.webp\" style=\"background-color:#f8f8f9\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">2025 growth has outpaced forecasts made during height of trade \nfears</span></figcaption></figure><p class=\"\"><span>Slowing inflation and big spending on infrastructure projects - particularly in Europe - were helping, but the report also showed that the impacts of U.S. President Donald Trump's trade tariffs were not as stark as expected. </span></p><p class=\"\"><span>The bank now expects 3.6% growth this year and 3.7% in 2027 - both a 0.2 percentage point upward revision compared with its autumn projections.</span></p><p class=\"\"><span>Exports from some EBRD countries to the United States even grew, particularly those related to the AI boom, as those countries replaced China's exports. </span></p><p class=\"\"><span>Hungary, the Czech Republic and Poland all export AI-related products such as servers, processors and computing systems that mean they could benefit from the shift.     </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:898.7341772151899px;aspect-ratio:1.4978902953586497\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZM0N6-9fa79159560912a72eeaa9cdc85aa7f5-resized.webp\" type=\"image/webp\"/><img alt=\"U.S. imports from China fell below the 2024 average, but imports from the rest of the world did not\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L1N3ZM0N6-9fa79159560912a72eeaa9cdc85aa7f5-resized.webp\" style=\"background-color:#f6f6f7\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">US imports from China dropped, but increased from elsewhere</span></figcaption></figure><p class=\"\"><span>But Javorcik warned that the full impact of the tariffs remained unclear; most of the trade tracked by the report arrived in the U.S. prior to the April 2025 \"Liberation Day\" tariffs, and there was added uncertainty following the U.S. Supreme Court ruling that Trump had exceeded his authority in imposing the initial tariffs. </span></p><p class=\"\"><span>\"This turbulence means that policymakers are forced to focus on the urgent, on the shocks that arrive - weekly, if not daily,\" she said, adding it drained countries' abilities to tackle larger problems, such as the demographics \"time bomb\" and other factors threatening standards of living. </span></p><p class=\"\"><span>She also said that the \"emergency mode\" due to the ongoing war in Ukraine, and subsequent increases in defense spending, could drain money from other government priorities and said the ultimate impact would hinge on whether they spend that money on one-off equipment purchases or on infrastructure such as roads and hospitals that could also aid the economy.</span></p><p class=\"\"><span>The poly-crises, she said, emphasize the need for leaders to ensure that public investments are focused on projects that can drive economic growth.</span></p><p class=\"\"><span>\"Global uncertainty turbulence is likely to persist, and...it's going to be a force detrimental to private investment, and that's why I have been stressing the role of public investment,\" Javorcik said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0N6:0-trump-tariff-turmoil-yet-to-dent-emerging-countries-growth-ebrd-says/",
            "pub_date": "2026-02-26 20:39:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1H7:0",
            "title": "Engineers India Dividend 1.50 Rupees Per Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Engineers India Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ENGINEERS INDIA LTD - DIVIDEND 1.50 RUPEES PER SHARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1H7:0-engineers-india-dividend-1-50-rupees-per-share/",
            "pub_date": "2026-02-26 20:39:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2936325:0",
            "title": "EBS: Net income hit 3.5B, loans and deposits grew, and risk metrics remained stable",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong growth in 2025 was driven by the Polish acquisition and robust loan and deposit increases, with net income reaching 3.5 billion. Risk costs and NPL ratios remained stable, and the CET1 ratio was high pre-consolidation. Dividend is expected to rebound in 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2936325:0-ebs-net-income-hit-3-5b-loans-and-deposits-grew-and-risk-metrics-remained-stable/",
            "pub_date": "2026-02-26 20:39:42",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2936315:0",
            "title": "EME: Record financial performance and strong 2026 outlook supported by robust demand and RPOs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record revenues and earnings were achieved in Q4 and FY25, driven by strong demand and execution across diverse sectors. Outlook for 2026 remains positive with robust RPOs and continued growth in key markets, despite macro uncertainties.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2936315-124c3932582b8f8cd8682741da574532\" target=\"_blank\">EMCOR Group, Inc. [EME] Slides Release  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2936315:0-eme-record-financial-performance-and-strong-2026-outlook-supported-by-robust-demand-and-rpos/",
            "pub_date": "2026-02-26 20:39:45",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0NS:0",
            "title": "Thryv Q4 SaaS revenue grows 14%, EBITDA beats estimates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Small business marketing software provider's Q4 SaaS revenue grew 14% yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Adjusted EBITDA for Q4 beat analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 revenue slightly missed analyst expectations</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Thryv shifts focus to AI-enabled Thryv Platform to empower SMBs</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company aims to transition clients from legacy services to Thryv Platform</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Thryv did not provide specific financial guidance for future quarters</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SaaS REVENUE GROWTH - Thryv's Q4 SaaS revenue increased 14% year-over-year, driven by expansion of its AI-enabled platform</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MARKETING CENTER GROWTH - Q4 Marketing Center revenue grew 56% year-over-year, contributing positively to overall results</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MARKETING SERVICES DECLINE - Marketing Services revenue decreased 11.7% year-over-year, partially offsetting SaaS gains</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Slight Miss*</span></p></td><td><p class=\"\"><span>$191.62 mln</span></p></td><td><p class=\"\"><span>$193.14 mln (5 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>-$0.22</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-$9.66 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$38.90 mln</span></p></td><td><p class=\"\"><span>$38.22 mln (5 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>20.30%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted Gross Profit</span></p></td><td></td><td><p class=\"\"><span>$133.60 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 EBIT</span></p></td><td></td><td><p class=\"\"><span>$10.16 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Gross Profit</span></p></td><td></td><td><p class=\"\"><span>$130.34 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>*Applies to a deviation of less than 1%; not applicable for per-share numbers.</span></p><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy\", 3 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the advertising &amp; marketing peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Thryv Holdings Inc is $12.00, about 206.1% above its February 25 closing price of $3.92</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 9 times the next 12-month earnings vs. a P/E of 18 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0NS:0-thryv-q4-saas-revenue-grows-14-ebitda-beats-estimates/",
            "pub_date": "2026-02-26 20:39:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZM15S:0",
            "title": "Carlyle Group aims to raise more than $200 billion by 2028",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Isla Binnie and Prakhar Srivastava</span></p><p class=\"\"><span>    Investment firm Carlyle </span><span> expects to raise at least $200 billion between now and the end of 2028, a faster pace than the previous three years, and boost its earnings from managing that money, the company said on Thursday.</span></p><p class=\"\"><span>The outlook comes as a sharp selloff in software stocks this month, driven by AI disruption fears, spilled over into other sectors including asset managers amid concerns about credit quality and exposure to the technology sector.</span></p><p class=\"\"><span>Shares of the company, which have fallen 12.8% so far this year, rose 1.92% in trading before the bell.</span></p><p class=\"\"><span>Chief Executive Harvey Schwartz has been working on a turnaround at Carlyle, which manages around $477 billion, after the company faced a few difficult years linked to an industry-wide downturn and an internal succession struggle.</span></p><p class=\"\"><span>Three years after joining the firm, former Goldman Sachs executive Schwartz said in a statement he had \"systematically reshaped\" the company.</span></p><p class=\"\"><span>The targeted $200 billion inflows would represent a jump from the $158 billion the firm raised between 2023 and 2025.</span></p><p class=\"\"><span>Carlyle was widely seen as having lagged rivals such as Blackstone </span><span>, Apollo </span><span> and KKR </span><span> for some years when Schwartz took over, struggling to garner more of the assets that would generate management fees.</span></p><p class=\"\"><span>Mergers and acquisitions rebounded late last year after a prolonged slowdown, helped by lower interest rates that made deal financing cheaper. Easing concerns over U.S. trade policies also raised hopes among asset managers that stronger activity will support exits. </span></p><p class=\"\"><span>Carlyle's last earnings report earlier this month slightly beat analyst expectations thanks to income from deals at its private equity arm and gains at its credit and secondaries businesses.</span></p><p class=\"\"><span>It is now targeting $1.9 billion in 2028 fee-related earnings, which can provide money managers with stable income when markets are turbulent. That figure reached $1.2 billion in 2025.    </span></p><p class=\"\"><span>Distributed earnings per common share, a closely watched metric, is now projected to come in at more than $6 per share in 2028 versus $4.02 in 2025. </span></p><p class=\"\"><span>\"We're confident that we can meet or exceed each of these targets,\" said Chief Financial Officer Justin Plouffe.</span></p><p class=\"\"><span>Carlyle also approved a $2 billion repurchase authorization. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:898.7341772151899px;aspect-ratio:1.4978902953586497\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L4N3ZM15S-8fdec238f00992a684e119e5cee306de-resized.webp\" type=\"image/webp\"/><img alt=\"Chart showing performance of Carlyle's stock in the past twelve months\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L4N3ZM15S-8fdec238f00992a684e119e5cee306de-resized.webp\" style=\"background-color:#f3f5f6\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Performance of Carlyle's stock in the past twelve months</span></figcaption></figure></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZM15S:0-carlyle-group-aims-to-raise-more-than-200-billion-by-2028/",
            "pub_date": "2026-02-26 20:39:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1H6:0",
            "title": "Zinema Media And Entertainment To Consider Issue Of 14.8 Million Equity Shares At 10 Rupees Each",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Zinema Media and Entertainment Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZINEMA MEDIA AND ENTERTAINMENT - TO CONSIDER ISSUE OF 14.8 MILLION EQUITY SHARES AT 10 RUPEES EACH</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZINEMA MEDIA AND ENTERTAINMENT LTD - TO CONSIDER BUYING UP TO 60% STAKE IN BEONTYME TECHNOLOGIES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1H6:0-zinema-media-and-entertainment-to-consider-issue-of-14-8-million-equity-shares-at-10-rupees-each/",
            "pub_date": "2026-02-26 20:39:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS97tRla:0",
            "title": "NioCorp Launches Construction of Elk Creek Critical Minerals Project Mine Portal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NioCorp's Recent $100 Million Capital Raise Fuels Advancement of the Elk Creek Critical Minerals Project</span></p><p class=\"\"><span>More than $500M in Gross Capital Raised in 2025/2026 Also Strengthens NioCorp's Position with the Export-Import Bank of the U.S. for Proposed Debt Financing</span></p><p class=\"\"><span>\"We Look Forward to Hosting a Formal Groundbreaking Ceremony Following Completion of our Overall Project Financing Effort,\" Mr. Smith said</span></p><p class=\"\"><span>CENTENNIAL, CO / ACCESS Newswire / February 26, 2026 / NioCorp Developments Ltd. (\"</span><strong class=\"root-Tkn6WL2y\"><span>NioCorp</span></strong><span>,\" \"</span><strong class=\"root-Tkn6WL2y\"><span>our</span></strong><span>,\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") (</span><strong class=\"root-Tkn6WL2y\"><span>NASDAQ:NB</span></strong><span>), a leading U.S. critical minerals developer, today announced that construction of the main access to the underground portion of the Company's Elk Creek Critical Minerals Project (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Elk Creek Project</span></strong><span>\") in southeast Nebraska has now begun.</span></p><p class=\"\"><span>With detailed engineering well underway and construction equipment mobilized to the project site near Elk Creek, Nebraska, NioCorp has launched an approximately $44.6 million effort to construct the mine's main entrance, known as a \"portal,\" that will serve as the primary access point for personnel, equipment, and materials. The portal will also be used to deliver ore from the underground mine to the surface production plant. The Company also filed a formal \"Notice of Commencement\" with the Mine Safety and Health Administration (MSHA) in conjunction with this effort.</span></p><p class=\"\"><span>\"Our success in raising approximately $500 million in capital investment in 2025 and year-to-date in 2026 is enabling more intensive project advancement across the table, including pre-construction of our underground mine in southeast Nebraska, strengthening our position with the Export-Import Bank of the U.S. (\"</span><strong class=\"root-Tkn6WL2y\"><span>EXIM</span></strong><span>\") for our proposed debt financing, and building out our team in Nebraska to prepare for a formal construction launch of the entire project once we secure full project financing,\" said Mark A. Smith, Chairman and CEO of NioCorp.</span></p><p class=\"\"><span>Mr. Smith added: \"I am very gratified with the strong investment support from markets that NioCorp and the Elk Creek Project continue to receive. I look forward to hosting a formal groundbreaking ceremony once a final investment decision, or FID, is made by our Board of Directors following completion of our project financing effort.\"</span></p><p class=\"\"><span>The mine portal's construction advances the Elk Creek Project from a planning phase into pre-construction at our Nebraska project site.</span></p><p class=\"\"><span>\"Establishing underground access is a foundational step that brings us that much closer to unlocking the value of this large, polymetallic orebody,\" Mr. Smith said. \"We elected to advance this critical pre-construction work now to help streamline the development path toward full construction while we continue working toward securing the remaining financing needed for the Elk Creek Project.\"</span></p><p class=\"\"><span>Mr. Smith added: \"This marks a significant milestone for our project and for the local community and our shareholders.\"</span></p><p class=\"\"><span>Scott Honan, COO of NioCorp and President of Elk Creek Resources Corp., said: \"This project is a substantial excavation effort and marks a vital step on the critical path for commencing operations at Elk Creek. Over the next approximately nine months, our team will focus on executing the portal project safely and efficiently.\"</span></p><p class=\"\"><span>As currently configured, the Elk Creek Project plans to produce multiple products from minerals that are all designated by the U.S. Government as critical. These products include those derived from niobium, scandium, titanium, and potentially several individual rare earth elements.[1]</span></p><p class=\"\"><span># # #</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FOR MORE INFORMATION:</span></strong></p><p class=\"\"><span>Jim Sims, Corporate Communications Officer, NioCorp Developments Ltd., (720) 334-7066, jim.sims@niocorp.com</span></p><p class=\"\"><span>Alex Guthrie, Director, Investor Relations, NioCorp Developments Ltd., (647) 999-0527, aguthrie@niocorp.com</span></p><p class=\"\"><span>@NioCorp $NB #Niobium #Scandium #rareearth #neodymium #dysprosium #terbium #ElkCreek</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT NIOCORP</span></strong></p><p class=\"\"><span>NioCorp is developing the Elk Creek Project that is expected to produce niobium, scandium, and titanium. The Company also is evaluating the potential to produce several rare earths from the Elk Creek Project. Niobium is used to produce specialty alloys as well as High Strength, Low Alloy steel, which is a lighter, stronger steel used in automotive, structural, and pipeline applications. Scandium is a specialty metal that can be combined with Aluminum to make alloys with increased strength and improved corrosion resistance. Scandium is also a critical component of advanced solid oxide fuel cells. Titanium is used in various lightweight alloys and is a key component of pigments used in paper, paint and plastics and is also used for aerospace applications, armor, and medical implants. Magnetic rare earths, such as neodymium, praseodymium, terbium, and dysprosium are critical to the making of neodymium-iron-boron magnets, which are used across a wide variety of defense and civilian applications.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FORWARD-LOOKING STATEMENTS</span></strong></p><p class=\"\"><span>This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995 and forward-looking information within the meaning of applicable Canadian securities laws (collectively \"forward-looking statements\"). Forward-looking statements may include, but are not limited to, statements regarding the expected scope, timing, sequencing, progression and capital cost of the portal project and related pre-construction work at the Elk Creek Project, as well as expectations regarding future underground development and advancement toward construction; NioCorp's expectation that the portal will also be used to deliver ore from the underground mine to the surface production plant; statements regarding the Company's debt financing application process with EXIM; NioCorp's expectation of producing niobium, scandium, and titanium, and the potential of producing rare earths, at the Elk Creek Project; and NioCorp's confidence in and ability to secure sufficient project financing to complete construction of the Elk Creek Project and move it to commercial operation, as well as efforts and expenditures relating to the same. Forward-looking statements are typically identified by words such as \"plan,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"outlook,\" \"estimate,\" \"forecast,\" \"project,\" \"continue,\" \"could,\" \"may,\" \"might,\" \"possible,\" \"potential,\" \"predict,\" \"should,\" \"would\" and other similar words and expressions, but the absence of these words does not mean that a statement is not forward-looking.</span></p><p class=\"\"><span>The forward-looking statements are based on the current expectations of the management of NioCorp and are inherently subject to uncertainties and changes in circumstances and their potential effects and speak only as of the date of such statement. There can be no assurance that future developments will be those that have been anticipated. Forward-looking statements reflect material expectations and assumptions, including, without limitation, expectations and assumptions relating to: NioCorp's ability to receive sufficient project financing for the construction of the Elk Creek Project on acceptable terms, or at all; the future price of and demand for metals, including Al-Sc alloy; and the stability of the financial and capital markets. Such expectations and assumptions are inherently subject to uncertainties and contingencies regarding future events and, as such, are subject to change. Forward-looking statements involve a number of risks, uncertainties or other factors that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, but are not limited to, those discussed and identified in public filings made by NioCorp with the Securities and Exchange Commission and with the applicable Canadian securities regulatory authorities and the following: NioCorp's requirement of significant additional capital; NioCorp's ability to receive sufficient project financing for the construction of the Elk Creek Project on acceptable terms, or at all; NioCorp's ability to achieve the required milestones and receive the full $10.0 million in reimbursement under the Project Sub-Agreement with Advanced Technology International, an entity acting on behalf of the Defense Industrial Base Consortium under the authority of the U.S. Department of War; NioCorp's ability to receive a final commitment of financing from the EXIM or other debt financing or financial support on acceptable timelines, on acceptable terms, or at all; NioCorp's ability to access the full amount of the expected net proceeds under the standby equity purchase agreement (the \"Yorkville Equity Facility Financing Agreement\") with YA II PN, Ltd., an investment fund managed by Yorkville Advisors Global, LP; NioCorp's ability to continue to meet the listing standards of The Nasdaq Stock Market LLC; risks relating to NioCorp's common shares, including price volatility, lack of dividend payments and dilution or the perception of the likelihood of any of the foregoing; the extent to which NioCorp's level of indebtedness and/or the terms contained in agreements governing NioCorp's indebtedness, if any, the Yorkville Equity Facility Financing Agreement or other agreements may impair NioCorp's ability to obtain additional financing, on acceptable terms, or at all; covenants contained in agreements with NioCorp's secured creditors that may affect its assets; NioCorp's limited operating history; NioCorp's history of losses; the material weaknesses in NioCorp's internal control over financial reporting, NioCorp's efforts to remediate such material weaknesses and the timing of remediation; the possibility that NioCorp may qualify as a passive foreign investment company under the U.S. Internal Revenue Code of 1986, as amended (the \"Code\"); the potential that the business combination with GX Acquisition Corp. II and other related transactions could result in NioCorp becoming subject to materially adverse U.S. federal income tax consequences as a result of the application of Section 7874 and related sections of the Code; cost increases for NioCorp's exploration and, if warranted, development projects; a disruption in, or failure of, NioCorp's information technology systems, including those related to cybersecurity; equipment and supply shortages; variations in the market demand for, and prices of, niobium, scandium, titanium and rare earth products; current and future offtake agreements, joint ventures, and partnerships, including NioCorp's ability to negotiate extensions to existing agreements or to enter into new agreements, on favorable terms or at all; NioCorp's ability to attract qualified management; estimates of mineral resources and reserves; mineral exploration and production activities; feasibility study results; the results of metallurgical testing; the results of technological research; changes in demand for and price of commodities (such as fuel and electricity) and currencies; competition in the mining industry; changes or disruptions in the securities markets; legislative, political or economic developments, including changes in federal and/or state laws that may significantly affect the mining and scandium alloy industries; trade policies and tensions, including tariffs; inflationary pressures; the impacts of climate change, as well as actions taken or required by governments related to strengthening resilience in the face of potential impacts from climate change; the need to obtain permits and comply with laws and regulations and other regulatory requirements; the timing and reliability of sampling and assay data; the possibility that actual results of work may differ from projections/expectations or may not realize the perceived potential of NioCorp's projects; risks of accidents, equipment breakdowns, and labor disputes or other unanticipated difficulties or interruptions; the possibility of cost overruns or unanticipated expenses in development programs; operating or technical difficulties in connection with exploration, mining, development or scandium alloy production activities; management of the water balance at the Elk Creek Project site; land reclamation requirements related to the Elk Creek Project; the speculative nature of mineral exploration and development, including the risks of diminishing quantities of grades of reserves and resources; claims on the title to NioCorp's properties; the infringement or loss of NioCorp's intellectual property rights; potential future litigation; and NioCorp's lack of insurance covering all of NioCorp's operations.</span></p><p class=\"\"><span>Should one or more of these risks or uncertainties materialize or should any of the assumptions made by the management of NioCorp prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements.</span></p><p class=\"\"><span>All subsequent written and oral forward-looking statements concerning the matters addressed herein and attributable to NioCorp or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements contained or referred to herein. Except to the extent required by applicable law or regulation, NioCorp undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof to reflect the occurrence of unanticipated events.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>[1]</span></strong><span>The Company's current Mineral Resource includes rare earth elements and NioCorp is currently working to add rare earths to its Mineral Reserve. The potential inclusion of rare earths remains subject to completion of additional technical work and publication of an updated Feasibility Study.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> NioCorp Developments Ltd.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS97tRla:0/",
            "pub_date": "2026-02-26 20:40:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM120:0",
            "title": "Aptus Pharma Expands Into Life-Saving Injectables And ICU Care",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Aptus Pharma Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>APTUS PHARMA LTD - EXPANDS INTO LIFE-SAVING INJECTABLES AND ICU CARE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM120:0-aptus-pharma-expands-into-life-saving-injectables-and-icu-care/",
            "pub_date": "2026-02-26 20:40:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0NW:0",
            "title": "Cheniere Energy Q4 revenue rises 23% on record LNG production",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LNG producer's Q4 revenue rose 23% yr/yr, driven by record LNG production</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net income for Q4 increased 136% yr/yr, driven by favorable derivative variances</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company upsized share repurchase authorization to over $10 bln through 2030</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cheniere forecasts 2026 Consolidated Adjusted EBITDA of $6.75 bln - $7.25 bln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company expects 2026 Distributable Cash Flow of $4.35 bln - $4.85 bln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cheniere plans $10 bln share repurchase authorization through 2030</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RECORD LNG PRODUCTION - Cheniere produced a record amount of LNG in 2025, with 670 cargoes exported, contributing to strong financial results</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DERIVATIVE IMPACT - Favorable variances related to changes in fair value of derivative instruments significantly boosted net income for Q4 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CAPITAL ALLOCATION - Completion of '20/20 Vision' capital allocation plan ahead of schedule, with over $20 bln deployed, supported financial performance</span></p></li></ul><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td></td><td><p class=\"\"><span>$5.45 bln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>$2.30 bln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA</span></p></td><td></td><td><p class=\"\"><span>$2.05 bln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 21 \"strong buy\" or \"buy\", 2 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the oil &amp; gas transportation services peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Cheniere Energy Inc is $266.00, about 20.8% above its February 25 closing price of $220.13</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 15 times the next 12-month earnings vs. a P/E of 14 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0NW:0-cheniere-energy-q4-revenue-rises-23-on-record-lng-production/",
            "pub_date": "2026-02-26 20:40:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936300:0",
            "title": "NVAX: Pfizer license and $330M credit facility boost liquidity, with strict revenue and cash covenants",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>A new non-exclusive license with Pfizer for Matrix-M adjuvant brings $30M upfront, up to $500M in milestones, and royalties, while a $330M senior secured term loan facility with MidCap Financial Trust strengthens liquidity but imposes escalating royalty revenue and cash covenants. These deals are expected to drive future revenue and require strict financial compliance.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936300-61e2aa2a091c2a726e7e60830fa3829e\" target=\"_blank\">Novavax, Inc. [NVAX] SEC 10-K Annual Report  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936300:0-nvax-pfizer-license-and-330m-credit-facility-boost-liquidity-with-strict-revenue-and-cash-covenants/",
            "pub_date": "2026-02-26 20:40:41",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936272:0",
            "title": "CARS: 2025 saw record revenue and strong cash returns, but net income declined on lower one-time gains",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 revenue of $723.2M was driven by dealer growth, but net income fell 58% year-over-year due to prior-year one-time gains. Adjusted EBITDA rose 1% to $211.1M, and 7.1M shares were repurchased. 2026 guidance calls for flat to 2% revenue growth and stable margins.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936272-0fb3cf6574f339c86b91bc0b3724ec07\" target=\"_blank\">Cars.com Inc. [CARS] SEC 8-K Current Report  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936272:0-cars-2025-saw-record-revenue-and-strong-cash-returns-but-net-income-declined-on-lower-one-time-gains/",
            "pub_date": "2026-02-26 20:34:57",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EduGQTtha:0",
            "title": "REG - Euronext Dublin - GEM Notice (EURONEXT DUBLIN) [89186]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89186</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EduGQTtha:0-reg-euronext-dublin-gem-notice-euronext-dublin-89186/",
            "pub_date": "2026-02-26 20:34:59",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936285:0",
            "title": "COLL: 2025 revenues and adjusted EBITDA hit record highs, led by Jornay PM and pain portfolio growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 revenues rose 24% year-over-year, driven by strong growth in Jornay PM and the pain portfolio. Adjusted EBITDA increased 15% to $460.5M, with robust cash flow and improved debt terms positioning for continued growth in 2026.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936285-9f05350d33455a366f2982b2c863abf8\" target=\"_blank\">Collegium Pharmaceutical, Inc. [COLL] SEC 8-K Current Report  Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936285:0-coll-2025-revenues-and-adjusted-ebitda-hit-record-highs-led-by-jornay-pm-and-pain-portfolio-growth/",
            "pub_date": "2026-02-26 20:34:59",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008075_20260226008402:0",
            "title": "Vera Therapeutics: Potential Comml Launch of Atacicept Expected in Mid-2026 >VERA",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008075_20260226008402:0/",
            "pub_date": "2026-02-26 20:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}