{
    "data": [
        {
            "id": "DJN_DN20250204007145:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p><p class=\"\">0829 ET - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">0509 ET - Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p><p class=\"\">0444 ET - Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0426 ET - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0321 ET - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0310 ET - Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research's Joseph Chai says in a research report. Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800/oz level, leaving its bullish bias intact, Chai says. The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900/oz level, Chai says. The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, the analyst adds. Spot gold is 0.1% lower at $2,812.28/oz. (ronnie.harui@wsj.com)</p><p class=\"\">2213 ET - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007145:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX42ZFZ4:0",
            "title": "Fatboy Bean Bag Chairs: The Ultimate Blend of Comfort, Style, and Durability",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MONTREAL, Feb.  04, 2025  (GLOBE NEWSWIRE) — Fatboy, the global icon in casual furniture, offers a premium collection of bean bag chairs designed for both indoor and outdoor relaxation. With an unwavering commitment to quality and innovation, Fatboy's bean bags and ottomans are filled and manufactured in Canada, ensuring a product that meets the highest standards of comfort and durability for Canadian homes and lifestyles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Collection for Every Space</strong></p><p class=\"\">Whether you're looking to create a cozy indoor lounge or a stylish outdoor retreat, Fatboy has a bean bag chair for every setting. From the classic Original bean bag to the compact Junior, the versatile Slim, and the durable outdoor-friendly Buggle-Up, Fatboy’s collection offers a variety of shapes, sizes, and textures to suit any space.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Premium Fabrics for Maximum Comfort</strong></p><p class=\"\">Fatboy’s bean bag chairs are available in an exclusive selection of high-quality fabrics, each crafted for specific needs:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nylon</strong> – A durable and stainproof option, perfect for vibrant and easy-to-maintain indoor seating.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Stonewashed Cotton</strong> – A soft, natural fabric with a vintage-inspired look, offering timeless comfort and a relaxed aesthetic.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Olefin</strong> – A UV-resistant, water-repellent material ideal for outdoor use, built to withstand the elements.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Velvet</strong> – Luxuriously soft and made from recycled polyester, adding a touch of elegance to any interior.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Teddy &amp; Sherpa</strong> – Ultra-plush fabrics designed for cozy indoor lounging with a warm, inviting feel.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corduroy</strong> – A stylish, textured option that adds depth and sophistication to any space.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Mingle</strong> – A durable woven bouclé fabric with a 100,000 Martindale rating, providing both beauty and longevity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Polyester</strong> – A versatile, strong fabric that is easy to clean and perfect for both indoor and outdoor relaxation.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Proudly Made for Canada</strong></p><p class=\"\">Fatboy is a Dutch design brand known for its bold and innovative approach to casual furniture. While its roots are in the Netherlands, Fatboy's bean bag chairs and ottomans are filled and manufactured in Canada for the Canadian market, ensuring quality craftsmanship, shorter lead times, and a commitment to local production. With a focus on sustainable materials and innovative designs, Fatboy continues to redefine casual seating with products that are as stylish as they are functional.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Experience the Fatboy Difference</strong></p><p class=\"\">From living rooms to patios, Fatboy’s products elevate comfort and design in any space. Discover the full collection and find your perfect bean bag chair match today.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fatboy</strong></p><p class=\"\">Fatboy is a global leader in modern casual furniture, known for its bold designs, high-quality materials, and innovative approach to comfort. Since launching the Original bean bag, Fatboy has expanded its product range to include furniture, lighting, and accessories that redefine contemporary living.</p><p class=\"\">For more information, interviews, or high-resolution images, please contact:</p><p class=\"\">Fatboy Canada</p><p class=\"\">Email: hello@fatboycanada.com</p><p class=\"\">Website: fatboycanada.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX42ZFZ4:0-fatboy-bean-bag-chairs-the-ultimate-blend-of-comfort-style-and-durability/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007143:0",
            "title": "Bristol-Myers Squibb Is Maintained at Neutral by Cantor Fitzgerald",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>Bristol-Myers Squibb Price Target Raised to $55.00/Share From $50.00 by Cantor Fitzgerald</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007143:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007152:0",
            "title": "Berry Global Group Sees FY25 Cash Flow From Ops of $1.125 B-$1.225 B >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007152:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007115:0",
            "title": "Berry Global Group Sees FY Adj EPS $6.10-Adj EPS $6.60 >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007115:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007116:0",
            "title": "Berry Global Group 1Q Sales $2.4B >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007116:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007119:0",
            "title": "Berry Global Group 1Q Net $14M >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007119:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007117:0",
            "title": "Berry Global Group 1Q EPS 69c >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007117:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007118:0",
            "title": "Berry Global Group 1Q Adj EPS $1.09 >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007118:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115:0",
            "title": "Berry Announces First Quarter 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group Sees FY Adj EPS $6.10-Adj EPS $6.60 &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Sales $2.4B &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q EPS 69c &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Adj EPS $1.09 &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Net $14M &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>Press Release: Berry Announces First Quarter 2025 Results</p><p class=\"\">Berry Announces First Quarter 2025 Results</p><p class=\"\">Strategy Update</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Successful completion of the spin of Berry's Health, Hygiene and   Specialties Global Nonwovens and Films Business ('HHNF') and merger with   Glatfelter Corporation in November     </li><li class=\"listItem-bmN0_SHH\">Entered into a definitive merger agreement with Amcor, to combine, in   an all-stock transaction and expected to be completed in the middle of   calendar 2025     </li><li class=\"listItem-bmN0_SHH\">Announcement of the sale of our Tapes business; Closed in early   February 2025   </li></ul><p class=\"\">First Quarter Highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">GAAP: Net sales of $2.4 billion; Operating income of $152 million;   Earnings per share of $0.69     </li><li class=\"listItem-bmN0_SHH\">Non-GAAP: Operating EBITDA of $378 million; Adjusted earnings per share   of $1.09     </li><li class=\"listItem-bmN0_SHH\">Organic volume growth of +2%     </li><li class=\"listItem-bmN0_SHH\">Operating EBITDA growth of +4% and Adjusted EPS growth of +5%     </li><li class=\"listItem-bmN0_SHH\">Reaffirmed fiscal year 2025 guidance   </li></ul><p class=\"\">EVANSVILLE, Ind.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Kevin Kwilinski, Berry's CEO, stated, \"We had a very busy quarter to start fiscal 2025, continuing our transition into a more streamlined and focused provider of consumer packaging solutions. Our recent strategic actions, including the completion of the spin-off/merger of our HHNF business, announcement of the expected combination with Amcor, and the sale of our Tapes business, mark significant milestones in our journey. These actions, combined with our commitment to innovation and sustainability, position us for sustainable long-term growth. I want to also acknowledge the hard work, dedication and focus by all of our team members around the world during these eventful times.</p><p class=\"\">Financially, we had a strong start to fiscal 2025, delivering 2% organic volume growth and a 5% increase in adjusted earnings per share compared to the prior year. Our intentional focus on fast-moving consumer goods will lead to more predictable earnings growth and cash generation, providing stability and resilience to our business. We are confident that our strategic investments and operational excellence will continue to enhance value for our shareholders.</p><p class=\"\">Today we are reaffirming our guidance and, looking ahead into fiscal 2025, we anticipate continued low-single digit volume growth, as demonstrated over the last three quarters, along with strong adjusted free cash flow. As we move forward, we will deliver enhanced value to our shareholders by pursuing three key strategic objectives: accelerating organic growth, increasing margins through improved operations, and deleveraging.\"</p><p class=\"\">Key Financials (1)</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                          December Quarter     Reported <br/>GAAP results               2024       2023     &lt;DELTA&gt;% <br/>----------------------  -----------  -------  ---------- <br/>Net sales                $    2,385  $ 2,333     2% <br/>Operating income                152      165    (8%) <br/>EPS (diluted)                  0.69     0.55    25% <br/>                            -------   ------  ----   --- <br/> <br/>                          December Quarter     Reported    Comparable <br/>Adjusted non-GAAP <br/>results                    2024       2023     &lt;DELTA&gt;%     &lt;DELTA&gt;% <br/>----------------------  -----------  -------  ----------  ------------ <br/>Operating EBITDA                378      365     4%          4% <br/>Adjusted EPS (diluted)         1.09     1.04     5%          5% <br/>                                                          ---- ----- <br/> <br/> <br/>(1)    Adjusted non-GAAP results exclude items not considered to be ongoing <br/>       operations. In addition, comparable change % excludes the impacts of <br/>       foreign currency, acquisitions, and recent divestitures. Further <br/>       details related to non-GAAP measures and reconciliations can be found <br/>       under our \"Non-GAAP Financial Measures and Estimates\" section and in <br/>       reconciliation tables in this release. In millions of USD, except per <br/>       share data. <br/> </pre><p class=\"\">Financial Results — First Quarter 2025</p><p class=\"\">Consolidated Overview</p><p class=\"\">Net sales increased 2%, to $2.4 billion, primarily attributed to organic volume growth of 2%, increased selling prices, and current year acquisitions, partially offset by prior year divestiture sales. All three segments delivered positive organic volume growth.</p><p class=\"\">The operating income decrease is primarily attributed to an increase in business integration costs primarily associated with the proposed merger with Amcor. These costs were partially offset by 2% organic volume growth and a $16 million favorable impact from price cost spread.</p><p class=\"\">Consumer Packaging — International</p><p class=\"\">Net sales decreased by 3% compared to the prior year, coming in at $885 million. The decrease was primarily attributed to prior year divestiture sales, partially offset by 1% organic volume growth and the impact of higher selling prices. The organic volume increase was primarily driven by emerging market growth and share gains offsetting a weaker demand environment in Europe.</p><p class=\"\">The operating income change is primarily attributed to an increase in general administrative and business integration costs, partially offset by a $15 million favorable impact from price cost spread.</p><p class=\"\">Consumer Packaging — North America</p><p class=\"\">Net sales increased 10% to $769 million primarily driven by 4% organic volume growth, along with higher selling prices and a 2% benefit from acquisition sales. The volume growth was broad based and led by our food, beverage, and foodservice markets.</p><p class=\"\">The operating income change is primarily attributed to an increase in general administrative and business integration costs, offset by 4% organic volume growth.</p><p class=\"\">Flexibles</p><p class=\"\">Net sales increased by 2%, reaching $731 million, primarily driven by increased selling prices and organic volume growth of 1%. The organic volume growth is primarily driven by the continued recovery in European industrial markets.</p><p class=\"\">The operating income decrease is primarily attributed to an increase in general administrative and business integration costs, partially offset by 1% organic volume growth.</p><p class=\"\">Cash Returns to Shareholders</p><p class=\"\">Berry generates significant cash flow and is committed to returning capital to shareholders. This annual cash flow provides substantial capacity to simultaneously reinvest in the business for organic growth, pay down debt, pursue bolt-on acquisitions, and return cash to shareholders through a compelling dividend as well as share repurchases. We expect to further reduce leverage in fiscal 2025, while also returning cash to shareholders during the year, subject to market conditions, available cash on hand and cash needs, overall financial condition, and other factors considered relevant by our Board of Directors.</p><p class=\"\">Dividend and Share Repurchases</p><p class=\"\">As previously announced, Berry's Board of Directors declared a quarterly cash dividend of $0.31 per share payable on March 17, 2025 to stockholders of record as of March 3, 2025. Berry did not repurchase any shares during the first fiscal quarter of fiscal 2025.</p><p class=\"\">Fiscal Year 2025 Guidance - Reaffirmed</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Adjusted earnings per share range of $6.10-$6.60 (Fiscal 2024   comparable $6.00)     </li><li class=\"listItem-bmN0_SHH\">Cash flow from operations of $1.125-$1.225 billion; free cash flow of   $600-$700 million     </li><li class=\"listItem-bmN0_SHH\">Committed to further debt reduction   </li></ul><p class=\"\">Due to the pending transaction with Amcor plc, the Company will not host a quarterly conference call to review its first quarter results. We have posted this release and a presentation regarding our first fiscal 2025 quarter on the Company's website at https://ir.berryglobal.com/financials.</p><p class=\"\">About Berry</p><p class=\"\">At Berry Global Group, Inc. , we create innovative packaging solutions that we believe make life better for people and the planet. We do this every day by leveraging our unmatched global capabilities, sustainability leadership, and deep innovation expertise to serve customers of all sizes around the world. Harnessing the strength in our diversity and industry-leading talent of over 34,000 global employees across more than 200 locations, we partner with customers to develop, design, and manufacture innovative products with an eye toward the circular economy. The challenges we solve and the innovations we pioneer benefit our customers at every stage of their journey. For more information, visit our website, or connect with us on LinkedIn or X.</p><p class=\"\">Non-GAAP Financial Measures and Estimates</p><p class=\"\">This press release includes non-GAAP financial measures such as operating EBITDA, Adjusted operating income, Adjusted earnings per share (or adjusted EPS), free cash flow, and comparable basis net sales, comparable adjusted EPS and comparable operating EBITDA. A reconciliation of these non-GAAP financial measures to comparable measures determined in accordance with accounting principles generally accepted in the United States of America (GAAP) is set forth at the end of this press release. Fiscal year 2025 cash flow from operations, free cash flow and adjusted earnings per share guidance excludes the impact from the Amcor/Berry combination transaction. Information reconciling forward-looking adjusted EPS and free cash flow is not provided because such information is not available without unreasonable effort due to the high variability, complexity, and low visibility with respect to certain items, including debt refinancing activity or other non-comparable items. These items are uncertain, depend on various factors, and could be material to our results computed in accordance with U.S. GAAP.</p><p class=\"\">Important Information for Investors and Shareholders This communication does not constitute an offer to sell or the solicitation of an offer to buy or exchange any securities or a solicitation of any vote or approval in any jurisdiction, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. It does not constitute a prospectus or prospectus equivalent document. No offering or sale of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the US Securities Act of 1933, as amended, and otherwise in accordance with applicable law.</p><p class=\"\">In connection with the proposed transaction between Berry Global Group, Inc. (\"Berry\") and Amcor plc (\"Amcor\"), on January 13, 2025, Amcor filed with the Securities and Exchange Commission (the \"SEC\") a registration statement on Form S-4, as amended on January 21, 2025, containing a joint proxy statement of Berry and Amcor that also constitutes a prospectus of Amcor (the \"Joint Proxy Statement/Prospectus\"). The registration statement was declared effective by the SEC on January 23, 2025, and Berry and Amcor commenced mailing the Joint Proxy Statement/Prospectus to their respective shareholders on or about January 23, 2025. This document is not a substitute for the Joint Proxy Statement/Prospectus or any other document which Berry or Amcor may file with the SEC. INVESTORS AND SECURITY HOLDERS OF BERRY AND AMCOR ARE URGED TO READ THE JOINT PROXY STATEMENT/PROSPECTUS AND ANY OTHER DOCUMENTS FILED OR THAT WILL BE FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THESE DOCUMENTS, CAREFULLY AND IN THEIR ENTIRETY BECAUSE THEY CONTAIN OR WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION AND RELATED MATTERS. Investors and security holders may obtain free copies of the registration statement and the Joint Proxy Statement/Prospectus and other documents filed with the SEC by Berry or Amcor through the website maintained by the SEC at http://www.sec.gov. Copies of the documents filed with the SEC by Berry are available free of charge on Berry's website at berryglobal.com under the tab \"Investors\" and under the heading \"Financials\" and subheading \"SEC Filings.\" Copies of the documents filed with the SEC by Amcor are available free of charge on Amcor's website at amcor.com under the tab \"Investors\" and under the heading \"Financial Information\" and subheading \"SEC Filings.\"</p><p class=\"\">Certain Information Regarding Participants</p><p class=\"\">Berry, Amcor and their respective directors and executive officers may be considered participants in the solicitation of proxies from the shareholders of Berry and Amcor in connection with the proposed transaction. Information about the directors and executive officers of Berry is set forth in its Annual Report on Form 10-K for the year ended September 28, 2024, which was filed with the SEC on November 26, 2024, and its proxy statement for its 2025 annual meeting, which was filed with the SEC on January 7, 2025. Information about the directors and executive officers of Amcor is set forth in its Annual Report on Form 10-K for the year ended June 30, 2024, which was filed with the SEC on August 16, 2024, its proxy statement for its 2024 annual meeting, which was filed with the SEC on September 24, 2024 and its Current Report on Form 8-K, which was filed with the SEC on January 6, 2025. To the extent holdings of Berry's or Amcor's securities by its directors or executive officers have changed since the amounts set forth in such filings, such changes have been or will be reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Beneficial Ownership on Form 4 filed with the SEC. Information about the directors and executive officers of Berry and Amcor, including a description of their direct or indirect interests, by security holdings or otherwise, and other information regarding the potential participants in the proxy solicitations, which may be different than those of Berry's stockholders and Amcor's shareholders generally, are contained in the Joint Proxy Statement/Prospectus and other relevant materials to be filed with the SEC regarding the proposed transaction. You may obtain these documents free of charge through the website maintained by the SEC at http://www.sec.gov and from Berry's or Amcor's website as described above.</p><p class=\"\">Cautionary Statement Regarding Forward-Looking Statements</p><p class=\"\">This communication contains certain statements that are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act. Some of these forward-looking statements can be identified by words like \"anticipate,\" \"approximately, \" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"outlook,\" \"plan,\" \"potential,\" \"possible,\" \"predict,\" \"project,\" \"target,\" \"seek,\" \"should,\" \"will,\" or \"would,\" the negative of these words, other terms of similar meaning or the use of future dates. Such statements, including projections as to the anticipated benefits of the proposed transaction, the impact of the proposed transaction on Berry's and Amcor's business and future financial and operating results and prospects, the amount and timing of synergies from the proposed transaction, the terms and scope of the expected financing in connection with the proposed transaction, the aggregate amount of indebtedness of the combined company following the closing of the proposed transaction and the closing date for the proposed transaction, are based on the current estimates, assumptions and projections of the management of Berry and Amcor, and are qualified by the inherent risks and uncertainties surrounding future expectations generally, all of which are subject to change. Actual results could differ materially from those currently anticipated due to a number of risks and uncertainties, many of which are beyond Berry's and Amcor's control. None of Berry, Amcor or any of their respective directors, executive officers, or advisors, provide any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements will actually occur, or if any of them do occur, what impact they will have on the business, results of operations or financial condition of Berry or Amcor. Should any risks and uncertainties develop into actual events, these developments could have a material adverse effect on Berry's and Amcor's businesses, the proposed transaction and the ability to successfully complete the proposed transaction and realize its expected benefits. Risks and uncertainties that could cause results to differ from expectations include, but are not limited to, the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; the risk that the conditions to the completion of the proposed transaction (including shareholder and regulatory approvals) are not satisfied in a timely manner or at all; the risks arising from the integration of the Berry and Amcor businesses; the risk that the anticipated benefits of the proposed transaction may not be realized when expected or at all; the risk of unexpected costs or expenses resulting from the proposed transaction; the risk of litigation related to the proposed transaction; the risks related to disruption of management's time from ongoing business operations as a result of the proposed transaction; the risk that the proposed transaction may have an adverse effect on the ability of Berry and Amcor to retain key personnel and customers; general economic, market and social developments and conditions; the evolving legal, regulatory and tax regimes under which Berry and Amcor operate; potential business uncertainty, including changes to existing business relationships, during the pendency of the proposed transaction that could affect Berry's and/or Amcor's financial performance; and other risks and uncertainties identified from time to time in Berry's and Amcor's respective filings with the SEC, including the Joint Proxy Statement/Prospectus to be filed with the SEC in connection with the proposed transaction. While the list of risks presented here is, and the list of risks presented in the Joint Proxy Statement/Prospectus will be, considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties, and other risks may present significant additional obstacles to the realization of forward-looking statements. Forward-looking statements included herein are made only as of the date hereof and neither Berry nor Amcor undertakes any obligation to update any forward-looking statements, or any other information in this communication, as a result of new information, future developments or otherwise, or to correct any inaccuracies or omissions in them which become apparent. All forward-looking statements in this communication are qualified in their entirety by this cautionary statement.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                         Berry Global Group, Inc. <br/>               Consolidated Statements of Income (Unaudited) <br/> <br/>                                             Quarterly Period Ended <br/>                                       ----------------------------------- <br/>(in millions of USD, except per share    December 28,       December 30, <br/>data)                                         2024              2023 <br/>-------------------------------------  -----------------  ---------------- <br/> <br/>Net sales                                $        2,385    $      2,333 <br/>Costs and expenses: <br/>   Cost of goods sold                             1,929           1,903 <br/>   Selling, general and <br/>    administrative                                  223             206 <br/>   Amortization of intangibles                       46              47 <br/>   Business consolidation and other <br/>    activities                                       35              12 <br/>-------------------------------------  ---  -----------       --------- <br/>Operating income                                    152             165 <br/>Other expense (income)                              (22)             15 <br/>Interest expense, net                                75              71 <br/>-------------------------------------  ---  -----------       --------- <br/>Income before income taxes                           99              79 <br/>Income tax expense                                   18              14 <br/>-------------------------------------  ---  -----------       --------- <br/>Net income from continuing operations                81              65 <br/>Discontinued operations, net of tax                 (67)             (6) <br/>-------------------------------------  ---  -----------       --------- <br/>Net income                               $           14    $         59 <br/>-------------------------------------  ---  -----------       --------- <br/> <br/>Net income per share: <br/>Basic - continuing operations            $         0.70    $       0.56 <br/>Basic - discontinued operations                   (0.58)          (0.05) <br/>-------------------------------------  ---  -----------       --------- <br/>   Total basic net income per share      $         0.12    $       0.51 <br/> <br/>Diluted - continuing operations          $         0.69    $       0.55 <br/>Diluted - discontinued operations                 (0.57)          (0.05) <br/>-------------------------------------  ---  -----------       --------- <br/>   Total diluted net income per share    $         0.12    $       0.50 <br/> <br/> <br/>Outstanding weighted average shares <br/>(in millions) <br/>Basic                                             115.3           115.6 <br/>Diluted                                           118.2           118.3 <br/>-------------------------------------  ---  -----------       --------- <br/> <br/> <br/>             Condensed Consolidated Balance Sheets (Unaudited) <br/> <br/>                                              December 28,    September 28, <br/>(in millions of USD)                              2024             2024 <br/>-------------------------------------------  --------------  --------------- <br/>Cash and cash equivalents                     $       1,181   $          865 <br/>Accounts receivable                                   1,089            1,269 <br/>Inventories                                           1,328            1,371 <br/>Other current assets                                    501              184 <br/>Current assets of discontinued operations                 -              885 <br/>Property, plant, and equipment                        3,483            3,627 <br/>Goodwill, intangible assets, and other <br/> long-term assets                                     5,955            6,362 <br/>Non-current assets of discontinued <br/> operations                                               -            2,050 <br/>-------------------------------------------      ----------      ----------- <br/>Total assets                                  $      13,577   $       16,613 <br/>-------------------------------------------      ----------      ----------- <br/>Current liabilities, excluding current debt           1,809            2,451 <br/>Current liabilities of discontinued <br/> operations                                               -              411 <br/>Current and long-term debt                            8,129            8,315 <br/>Other long-term liabilities                           1,433            1,683 <br/>Non-current liabilities of discontinued <br/> operations                                               -              145 <br/>Stockholders' equity                                  2,206            3,608 <br/>-------------------------------------------      ----------      ----------- <br/>Total liabilities and stockholders' equity    $      13,577   $       16,613 <br/>-------------------------------------------      ----------      ----------- <br/> <br/> <br/>       Condensed Consolidated Statements of Cash Flows (Unaudited) <br/> <br/>                                              Quarterly Period Ended <br/>                                        ---------------------------------- <br/>                                          December 28,      December 30, <br/>(in millions of USD)                          2024              2023 <br/>--------------------------------------  ----------------  ---------------- <br/>Cash flows from operating activities: <br/>Net income                                $          14    $         59 <br/>Income (loss) from discontinued <br/> operations                                         (67)             (6) <br/>--------------------------------------  ---  ----------       --------- <br/>Income from continuing operations                    81              65 <br/>Adjustments to reconcile net cash from <br/>operating activities: <br/>   Depreciation                                     124             123 <br/>   Amortization of intangibles                       46              47 <br/>   Non-cash interest, net                           (12)            (20) <br/>   Share-based compensation expense                  21              18 <br/>   Deferred income tax                              (28)            (16) <br/>   Settlement of derivatives                          -              19 <br/>   Other non-cash operating <br/>    activities, net                                 (23)             14 <br/>   Changes in working capital                      (581)           (418) <br/>--------------------------------------  ---  ----------       --------- <br/>      Operating cash used in <br/>       continuing operations                       (372)           (168) <br/>      Operating cash used in <br/>       discontinued operations                     (106)            (31) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from operating <br/>       activities                                  (478)           (199) <br/> <br/>Cash flows from investing activities: <br/>Additions to property, plant, and <br/> equipment, net                                    (134)           (168) <br/>Acquisitions of business and other                  (48)              - <br/>--------------------------------------  ---  ----------       --------- <br/>      Investing cash used in <br/>       continuing operations                       (182)           (168) <br/>      Investing cash used in <br/>       discontinued operations                       (9)            (15) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from investing <br/>       activities                                  (191)           (183) <br/> <br/>Cash flows from financing activities: <br/>Repayments on long-term borrowings                 (106)         (1,858) <br/>Cash transferred to Magnera related to <br/> spin, net                                         (624)              - <br/>Proceeds from long-term borrowings                1,585           1,550 <br/>Repurchase of common stock                            -              (7) <br/>Proceeds from issuance of common stock               19              13 <br/>Dividends paid                                      (36)            (36) <br/>Debt financing costs and other                      (39)             (4) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from financing <br/>       activities                                   799            (342) <br/>--------------------------------------  ---  ----------       --------- <br/>Effect of currency translation on cash              (44)             28 <br/>--------------------------------------  ---  ----------       --------- <br/>Net change in cash and cash <br/> equivalents                                         86            (696) <br/>Cash and cash equivalents at beginning <br/> of period                                        1,095           1,203 <br/>--------------------------------------  ---  ----------       --------- <br/>      Cash and cash equivalents at end <br/>       of period                          $       1,181    $        507 <br/>--------------------------------------  ---  ----------       --------- <br/> <br/> <br/>    Segment and Supplemental Comparable Basis Information (Unaudited) <br/> <br/>                          Quarterly Period Ended December 28, 2024 <br/>                  -------------------------------------------------------- <br/>                                       Consumer <br/>                      Consumer         Packaging- <br/>(in millions of      Packaging -         North <br/>USD)                International       America      Flexibles     Total <br/>----------------  -----------------  -------------  -----------  --------- <br/>Net sales            $   885            $      769   $      731  $2,385 <br/> <br/>Operating income     $    28            $       59   $       65  $  152 <br/>Depreciation and <br/> amortization             78                    58           34     170 <br/>Business <br/> consolidation <br/> and other <br/> activities(1)            17                     9            9      35 <br/>Other non-cash <br/> charges                   8                     7            6      21 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/>Operating EBITDA     $   131            $      133   $      114  $  378 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/>                          Quarterly Period Ended December 30, 2023 <br/>----------------  -------------------------------------------------------- <br/>Reported net <br/> sales               $   916            $      699   $      718  $2,333 <br/>Foreign <br/> currency, <br/> acquisitions &amp; <br/> divestitures            (40)                   16            2     (22) <br/>----------------  ----  ----   ----  ----  -------      -------   ----- <br/>Comparable net <br/> sales (1)           $   876            $      715   $      720  $2,311 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/>Operating income     $    29            $       60   $       76  $  165 <br/>Depreciation and <br/> amortization             80                    57           33     170 <br/>Business <br/> consolidation <br/> and other <br/> activities                6                     5            1      12 <br/>Other non-cash <br/> charges                   6                     6            6      18 <br/>Foreign <br/> currency, <br/> acquisitions &amp; <br/> divestitures             (3)                    3            -       - <br/>----------------  ----  ----   ----  ----  -------      -------   ----- <br/>Comparable <br/> operating <br/> EBITDA (2)          $   118            $      131   $      116  $  365 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/> <br/>(1)    During the current quarter, the Company incurred $18 million of <br/>       transaction related activities associated with the proposed merger with <br/>       Amcor. <br/> <br/>(2)    The prior year comparable basis change excludes the impacts of foreign <br/>       currency, acquisitions, and divestitures. Further details related to <br/>       non-GAAP measures and reconciliations can be found under our \"Non-GAAP <br/>       Financial Measures and Estimates\" section or in reconciliation tables <br/>       in this release. <br/> <br/> <br/>Discontinued Operations (a) <br/> <br/>                                             Quarterly Period Ended <br/>                                     --------------------------------------- <br/>                                         December 28,         December 30, <br/>                                              2024                2023 <br/>-----------------------------------  ---------------------  ---------------- <br/>Net sales                               $         204         $      520 <br/> <br/>Cost of sales                                     179                476 <br/>Selling, general, and <br/> administrative                                     9                 29 <br/>Amortization of intangibles                         4                 13 <br/>Other income (expense), net                        79                 10 <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Operating loss                                    (67)                (8) <br/>Other non-operating items, net                      2                 (3) <br/>Interest expense, net                               1                  1 <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Loss before income taxes                          (70)                (6) <br/>Income tax (expense) benefit                        3                  - <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Discontinued operations, net of tax     $         (67)        $       (6) <br/> <br/> <br/>(a)    In connection with the HHNF transaction, this table summarizes the <br/>       results of discontinued operations for the HHNF business. <br/> <br/> <br/>                   Reconciliation of Non-GAAP Measures <br/> <br/>Reconciliation of Net income and earnings per share (EPS) to adjusted <br/>operating income, operating earnings before interest, tax, depreciation <br/>and amortization (EBITDA), and adjusted earnings per share (adjusted EPS) <br/> <br/>(in millions of USD, except per share data amounts) <br/> <br/>                                             Quarterly Period Ended <br/>                                       ----------------------------------- <br/>                                         December 28,       December 30, <br/>                                              2024              2023 <br/>-------------------------------------  -----------------  ---------------- <br/>Net income attributable to Berry <br/> Global Group, Inc.                        $         14    $         59 <br/>Discontinued operations, net of tax                 (67)             (6) <br/>-------------------------------------  -----  ---------       --------- <br/>Net income from continuing operations      $         81    $         65 <br/>   Add: other expense (income)                      (22)             15 <br/>   Add: interest expense                             75              71 <br/>   Add: income tax expense                           18              14 <br/>-------------------------------------  -----  ---------       --------- <br/>Operating income                           $        152    $        165 <br/> <br/>   Add: business consolidation and <br/>    other activities                                 35              12 <br/>   Add: other non-cash charges (1)                   21              18 <br/>-------------------------------------  -----  ---------       --------- <br/>Adjusted operating income (3)              $        208    $        195 <br/> <br/>   Add: depreciation                                124             123 <br/>   Add: amortization of intangibles                  46              47 <br/>-------------------------------------  -----  ---------       --------- <br/>Operating EBITDA (3)                       $        378    $        365 <br/>-------------------------------------  -----  ---------       --------- <br/> <br/>   Net income per diluted share            $       0.69    $       0.55 <br/>   Other expense (income)                         (0.19)           0.13 <br/>   Business consolidation and other <br/>    activities                                     0.30            0.10 <br/>   Amortization of intangibles from <br/>    acquisitions (2)                               0.39            0.40 <br/>   Income tax impact on items above               (0.10)          (0.14) <br/>   Foreign currency, acquisitions, <br/>   and divestitures                                                   - <br/>-------------------------------------  -----------------      --------- <br/>Adjusted net income per diluted share <br/> (3)                                       $       1.09    $       1.04 <br/>-------------------------------------  -----  ---------       --------- <br/> <br/> <br/>   Non-U.S. GAAP Free Cash Flow <br/>   (continuing operations): <br/>   Cash flow from operating <br/>    activities                             $       (372)   $       (168) <br/>   Additions to property, plant, and <br/>    equipment (net)                                (134)           (168) <br/>-------------------------------------  -----  ---------       --------- <br/>   Non-U.S. GAAP Free Cash Flow <br/>    (continuing operations)                $       (488)   $       (336) <br/>-------------------------------------  -----  ---------       --------- <br/> <br/> <br/>                                              Estimated Fiscal 2025 <br/>                                       ----------------------------------- <br/>   Cash flow from operating <br/>    activities                                    $1,125-$1,225 <br/>   Net additions to property, plant, <br/>    and equipment                                     (525) <br/>-------------------------------------  ----------------------------------- <br/>Free cash flow (3)                                  $600-$700 <br/>-------------------------------------  ----------------------------------- <br/> <br/> <br/>(1)    Other non-cash charges are primarily stock compensation expense <br/> <br/>(2)    Amortization of intangibles from acquisition are added back to better <br/>       align our calculation of adjusted EPS with peers. <br/> <br/>(3)    Supplemental financial measures that are not required by, or presented <br/>       in accordance with, accounting principles generally accepted in the <br/>       United States (\"GAAP\"). These non-GAAP financial measures should not be <br/>       considered as alternatives to operating or net income or cash flows <br/>       from operating activities, in each case determined in accordance with <br/>       GAAP. Organic sales growth and comparable basis measures exclude the <br/>       impact of currency translation effects and acquisitions. These non-GAAP <br/>       financial measures may be calculated differently by other companies, <br/>       including other companies in our industry, limiting their usefulness as <br/>       comparative measures. Berry's management believes that adjusted net <br/>       income and other non-GAAP financial measures are useful to our <br/>       investors because they allow for a better period-over-period comparison <br/>       of operating results by removing the impact of items that, in <br/>       management's view, do not reflect our core operating performance. <br/> <br/>       We define \"free cash flow\" as cash flow from operating activities, less <br/>       net additions to property, plant, and equipment. We believe free cash <br/>       flow is useful to an investor in evaluating our liquidity because free <br/>       cash flow and similar measures are widely used by investors, securities <br/>       analysts, and other interested parties in our industry to measure a <br/>       company's liquidity. We also believe free cash flow is useful to an <br/>       investor in evaluating our liquidity as it can assist in assessing a <br/>       company's ability to fund its growth through its generation of cash. <br/> <br/>       Adjusted EBITDA is used by our lenders for debt covenant compliance <br/>       purposes. We also use Adjusted operating income, Operating EBITDA, <br/>       adjusted EPS and comparable basis measures, among other measures, to <br/>       evaluate management performance and in determining performance-based <br/>       compensation. Operating EBITDA is a measure widely used by investors, <br/>       securities analysts, and other interested parties in our industry to <br/>       measure a company's performance. We also believe EBITDA and Adjusted <br/>       operating income are useful to an investor in evaluating our <br/>       performance without regard to revenue and expense recognition, which <br/>       can vary depending upon accounting methods. <br/> </pre><p class=\"\">(BERY-F)</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204633666/en/</p><p class=\"\">CONTACT:    Dustin Stilwell</p><p class=\"\">VP, Head of Investor Relations</p><p class=\"\">+1 (812) 306 2964</p><p class=\"\">ir@berryglobal.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group Sees FY25 Cash Flow From Ops of $1.125 B-$1.225 B &gt;BERY</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8F2s4b:0",
            "title": "Matterport and CAPTUR3D Partner to Recognize Digital Twin Innovation Around the World",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUNNYVALE, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Matterport, Inc. , a pioneer in digital twin technology and spatial data capture, is proud to sponsor the 2025 Digital Twins Awards (DTAs), powered by Matterport partner, CAPTUR3D.</p><p class=\"\">Now in its fourth year, the DTAs are a global stage for inspiring individuals and forward-thinking businesses to showcase their most engaging Matterport digital twins in 2024. From real estate to cultural preservation, the awards showcase the best and most impactful digital twin projects from over 170 countries worldwide. All Matterport users and partners—from developers to capture technicians and photographers—are invited to participate in one of the largest digital twin awards events in the world.</p><p class=\"\">“The Digital Twin Awards are a tribute to the expert skill and dedication within our global community who push the limits of creativity, technology, and digital transformation,\" said RJ Pittman, Chairman and CEO, Matterport. \"These awards inspire the next generation of ideas, showcasing how digital twins are unlocking a new era of possibilities for real-world spaces.\"</p><p class=\"\">This year’s award categories include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Best Digital Twin of 2024</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Arts &amp; Culture</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Education</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Real Estate</li><li class=\"listItem-bmN0_SHH\">Most Unique Use of Matterport</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Historical Preservation</li><li class=\"listItem-bmN0_SHH\">NEW: Best Non Pro Series Device Scan (includes 360, smartphone, DSLR, and synthetic CGI)</li></ul><p class=\"\">Submissions are now open and will be accepted until February 28, 2025. Participants may submit one entry per category, with a panel of expert judges shortlisting the top five nominees in each. Winners will be selected by the judges and revealed on April 4, 2025 during the official announcement. The awards will also feature a public voting period from March 14-28, 2025, giving the global community an opportunity to celebrate their favorite projects. Winners across seven categories will receive Matterport hardware, accessories, and subscriptions, with prizes valued up to $6,300 USD and a total prize pool of $28,000 USD.</p><p class=\"\">For submission details and to participate in the 2025 Digital Twin Awards, please visit https://www.digitaltwinawards.com/2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Matterport </strong></p><p class=\"\">Matterport, Inc.  is leading the digital transformation of the built world. Our groundbreaking spatial data platform turns buildings into data to make nearly every space more valuable and accessible. Millions of buildings in more than 177 countries have been transformed into immersive Matterport digital twins to improve every part of the building lifecycle from planning, construction, and operations to documentation, appraisal and marketing. Learn more at matterport.com and browse a gallery of digital twins at matterport.com/discover.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">press@matterport.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact:</strong></p><p class=\"\">ir@matterport.com</p><p class=\"\">This press release was published by a CLEAR® Verified individual.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8F2s4b:0-matterport-and-captur3d-partner-to-recognize-digital-twin-innovation-around-the-world/",
            "pub_date": "2025-02-04 22:15:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE3Sj18l:0",
            "title": "College of Commercial Arbitrators Expands Mentorship Program to Foster Future Leaders in Commercial Arbitration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The College of Commercial Arbitrators (CCA), a leading professional organization dedicated to advancing excellence in commercial arbitration, is proud to announce the launch of the fourth year of its highly regarded mentorship initiative.</p><p class=\"\">AUSTIN, TX, Feb.  04, 2025  (GLOBE NEWSWIRE) — The College of Commercial Arbitrators (CCA), a leading professional organization dedicated to advancing excellence in commercial arbitration, is proud to announce the launch of the fourth year of its highly regarded mentorship initiative. Building on the success of previous years, the CCA is expanding its mentorship opportunities for two additional years to accommodate an increasing number of emerging arbitrators eager to refine their skills and deepen their expertise in commercial arbitration.</p><p class=\"\">The CCA Associates Mentorship Program provides a unique platform for less experienced, diverse arbitrators to benefit from the knowledge, mentorship, and networking opportunities offered by CCA Fellows. This initiative is designed to support individuals who have historically been underrepresented in the field of commercial arbitration, including women, people of color, and other historically disadvantaged groups to empower them to succeed and jumpstart their careers as commercial arbitrators.</p><p class=\"\">\"By pairing emerging, diverse arbitrators with seasoned experts, we are nurturing the leaders who will shape the future of the profession,” said Tyrone Holt, CCA Fellow, Past President and Co-Chair of the Associates Mentorship Program. “The success of the Program over the past three years underscores the growing demand for targeted mentorship in the commercial arbitration community.\"</p><p class=\"\">Following an increase in applicants over the program’s first three years, this year’s cohort is expected to attract even greater interest. The selected participants will embark on a two-year mentorship journey, running through 2027, which includes education, practical experience, and ongoing professional development.</p><p class=\"\">To be eligible for the program, applicants must meet the following criteria:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Active practice in the alternative dispute resolution fields</li><li class=\"listItem-bmN0_SHH\">Less than five years of experience as a commercial arbitrator</li><li class=\"listItem-bmN0_SHH\">A demonstrated commitment to learning and developing high-quality commercial arbitration skills</li></ul><p class=\"\">Arbitrators interested in applying for the 2025-2027 mentorship cycle can learn more and submit their applications by visiting <!-- -->https://www.ccarbitrators.org/cca-associates-program/.</p><p class=\"\">The application deadline is April 21, 2025, with selections announced on June 23, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the College of Commercial Arbitrators (CCA)</strong></p><p class=\"\">Founded in 2001, the CCA is an exclusive, invitation-only organization that promotes excellence in commercial arbitration, both in the U.S. and internationally. CCA Fellows possess the professional training, experience, and judgment to handle the most complex and challenging arbitration assignments. By fostering collaboration, innovation, and thought leadership, CCA makes unique and significant contributions to the field of commercial dispute resolution. For more information or to find an arbitrator, visit www.ccarbitrators.org.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE3Sj18l:0-college-of-commercial-arbitrators-expands-mentorship-program-to-foster-future-leaders-in-commercial-arbitration/",
            "pub_date": "2025-02-04 22:15:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PLXDE4193:0",
            "title": "BRIEF-Berry Global Group Q1 Adjusted EPS USD 1.09 Vs. IBES Estimate USD 0.97",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 04 (Reuters) - Berry Global Group Q1 EPS USD 0.69.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q1 sales USD 2,400 million vs. IBES estimate USD 2,345 million</li><li class=\"listItem-bmN0_SHH\">Q1 operating income USD 152 million vs. IBES estimate USD 211.9 million</li><li class=\"listItem-bmN0_SHH\">Q1 adjusted EBITDA USD 378 million vs. IBES estimate USD 368.1 million</li><li class=\"listItem-bmN0_SHH\">outlook FY free cash flow USD 600-700 million</li><li class=\"listItem-bmN0_SHH\">outlook FY adjusted EPS USD 6.1-6.6</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PLXDE4193:0-brief-berry-global-group-q1-adjusted-eps-usd-1-09-vs-ibes-estimate-usd-0-97/",
            "pub_date": "2025-02-04 22:15:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308852:0",
            "title": "Thermo Fisher Scientific Partners With X-ELIO on Renewable Energy Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thermo Fisher Scientific  said Tuesday that it signed a 10-year virtual power purchase agreement with X-ELIO, designed to increase access to renewable electricity across pharmaceutical and healthcare supply chains. </p><p class=\"\">The medical device maker said the Lorca solar project is set to begein operations early next year and will involve three partners from the pharmaceutical and healthcare sectors. </p><p class=\"\">The company said its 73 megawatt share of the project will generate 150,000 megawatt-hours of renewable electricity per year, enough to power 40,500 European homes for a year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308852:0/",
            "pub_date": "2025-02-04 22:09:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV118:0",
            "title": "Tilaknagar Industries Dec-Quarter Consol Net Profit 539.3 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tilaknagar Industries Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 539.3 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 8.05 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV118:0-tilaknagar-industries-dec-quarter-consol-net-profit-539-3-mln-rupees/",
            "pub_date": "2025-02-04 22:09:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308872:0",
            "title": "Sector Update: Tech Stocks Edge Higher Premarket Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Technology stocks were edging higher premarket Tuesday, with The Technology Select Sector SPDR Fund  and SPDR S&amp;P Semiconductor ETF  up 0.5%. </p><p class=\"\">Palantir Technologies  shares were up past 23% after the company reported higher Q4 adjusted earnings and revenue in addition to issuing Q1 and 2025 revenue outlook that surpassed analyst expectations. </p><p class=\"\">Spotify Technology  stock was over 8% higher after the company reported that it swung to Q4 earnings as revenue increased during the period. </p><p class=\"\">Gartner  shares were up more than 4% after the company posted higher Q4 adjusted earnings and revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308872:0-sector-update-tech-stocks-edge-higher-premarket-tuesday/",
            "pub_date": "2025-02-04 22:09:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV043:0",
            "title": "Three Canadian Western Bank executives after National Bank takeover",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Three former Canadian Western Bank  executives will be leaving National Bank , the new parent company of the Alberta-based lender, following a C$5 billion ($3.47 billion) takeover, according to an internal memo seen by Reuters. </p><p class=\"\">The executives leaving the bank are CWB CEO Chris Fowler, who is retiring, Chief Risk Officer Carolina Parra and Stephen Murphy, who is the head of the commercial, personal and wealth business, according to a Jan. 30 memo by Fowler to CWB staff.</p><p class=\"\">Murphy's last day is April 30 and Parra's is Feb. 28. </p><p class=\"\">Fowler, whose retirement was also publicly announced on Monday, will continue as executive advisor to National Bank CEO Laurent Ferreira until April 30. </p><p class=\"\">CWB's CFO Matt Rudd will join National Bank's finance team and Jeff Wright, the head of client solutions and specialty business, will join the bank as the head of integration for the commercial team, the memo said. </p><p class=\"\">National Bank closed the deal on Monday following an approval from Canada's finance minister in December.   </p><p class=\"\">The deal gives National Bank, the largest bank in the province of Quebec, scope to expand in Western Canada, a region where CWB has grown its footprint over the past 37 years through a slew of acquisitions.</p><p class=\"\">CWB focuses on providing commercial banking, personal banking and wealth advisory services to small and medium-sized business owners. It has also expanded in Ontario through the opening of new branches. </p><p class=\"\">($1 = 1.4399 Canadian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV043:0-three-canadian-western-bank-executives-after-national-bank-takeover/",
            "pub_date": "2025-02-04 22:09:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007044:0",
            "title": "Croatia Issues 2 Billion Euros in 12-Year Bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emese Bartha</p><p class=\"\">Croatia issued 2 billion euros ($2.07 billion) in February 2037-dated bonds via a bank syndicate on Tuesday, drawing demand in excess of 5 billion euros, one of the joint lead manager banks said.</p><p class=\"\">The books include 175 million euros of joint lead manager demand.</p><p class=\"\">The spread on the bond was set 90 basis points above mid-swaps, the same bank said.</p><p class=\"\">Joint lead managers of the transaction were Erste Group; IMI-Intesa Sanpaolo/PBZ; ING; J.P. Morgan and Morgan Stanley.</p><p class=\"\">Write to Emese Bartha at emese.bartha@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007044:0-croatia-issues-2-billion-euros-in-12-year-bonds/",
            "pub_date": "2025-02-04 22:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1GQ:0",
            "title": "Spanish ministers agree to cut legal working week to 37.5 hours",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Spanish ministers agreed on Tuesday to cut the legal working week to 37.5 hours with no change in salary, forging ahead with one of the coalition government's flagship measures despite opposition from employers' associations.</p><p class=\"\">During its weekly meeting, the cabinet approved the reduction, from 40 hours currently, in an executive decree penned by Labour Minister Yolanda Diaz, who leads the hard-left party Sumar. </p><p class=\"\">\"This proposal is about living better, working less and being much more productive and more efficient economically,\" Diaz told reporters.</p><p class=\"\">The measure still needs to be approved in parliament, where the centre-left government led by Socialist Prime Minister Pedro Sanchez lacks a clear majority and depends on balancing the demands of several smaller parties to pass legislation. </p><p class=\"\">Diaz, who is also deputy prime minister, made the plan to reduce working hours by the end of 2025 central to her party's support for Sanchez's premiership.</p><p class=\"\">     But the centre-right Catalan separatist party Junts has already signalled resistance to the proposal, while the main lobby for employers, CEOE, has said it would raise Spanish firms' costs and make them less competitive.</p><p class=\"\">After months of talks between Diaz and unions and employers' representatives, negotiations with CEOE broke down in November after it insisted the shorter week should not be imposed by law but through collective bargaining to suit each company's needs.</p><p class=\"\">\"The corporate world is in favour of dialogue, but not in favour of monologue,\" CEOE chief Antonio Garamendi said on Tuesday.</p><p class=\"\">Diaz has also clashed with Economy Minister Carlos Cuerpo, whom she accused of \"siding with employers\" after he proposed delaying the change by a year to give small businesses time to adapt.</p><p class=\"\">Spain's central bank and former economy minister have both warned that higher labour costs could fuel inflation and curb job creation.</p><p class=\"\">After the cabinet decision, Cuerpo said companies could resist the change given Spain's strong economic growth, declining inflation and an unemployment rate at a 16-year low. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1GQ:0-spanish-ministers-agree-to-cut-legal-working-week-to-37-5-hours/",
            "pub_date": "2025-02-04 22:10:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV1PN:0",
            "title": "ATI Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ATI Inc  reported quarterly adjusted earnings of 79 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 64 cents.  The mean expectation of eleven analysts for the quarter was for earnings of 61 cents per share. Wall Street expected results to range from 56 cents to 78 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 10.2% to $1.17 billion from a year ago; analysts expected $1.09 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ATI Inc's reported EPS for the quarter was 94 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $137.1 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ATI Inc shares had risen by 5.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 0.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 10 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the aerospace &amp; defense peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for ATI Inc is $70.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 02:09 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.61</p></td><td><p class=\"\">0.79</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.66</p></td><td><p class=\"\">0.60</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.58</p></td><td><p class=\"\">0.60</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.41</p></td><td><p class=\"\">0.48</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV1PN:0-ati-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 22:10:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308877:0",
            "title": "HSBC Adjusts Price Target on Thermo Fisher Scientific to $700 From $690, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thermo Fisher Scientific  has an average rating of buy and mean price target of $669.08, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308877:0/",
            "pub_date": "2025-02-04 22:10:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446566:0",
            "title": "Zinc Edges Higher From 4-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Zinc futures were at $2,810 per tonne, firmly above the over-four-month low of $2,750 touched on January 31st as supply concerns weighed against an uncertain demand outlook.</p><p class=\"\">New aggregates showed that global mined zinc production fell for the third consecutive year in 2024.</p><p class=\"\">The was consistent with a 7% decline in refined zinc from China, as lower processing rates drove the country’s largest operators to ease output.</p><p class=\"\">Also, the Red Dog Mine in Alaska, the world’s largest zinc mine, and responsible for 10% of global output, is due to slow in 2025 as it approaches its depletion of ore.</p><p class=\"\">On the other hand, official data from China showed that activity in its largest manufacturers unexpectedly declined in January despite earlier optimism that improved credit demand would drive growth for goods.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446566:0-zinc-edges-higher-from-4-month-low/",
            "pub_date": "2025-02-04 22:10:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308878:0",
            "title": "BMO Capital Adjusts Exelon Price Target to $46 From $44, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Exelon  has an average rating of overweight and mean price target of $43.43, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308878:0/",
            "pub_date": "2025-02-04 22:10:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308879:0",
            "title": "Deutsche Bank Adjusts Price Target on Eli Lilly to $1,010 From $1,015",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eli Lilly  has an average rating of overweight and mean price target of $997.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308879:0/",
            "pub_date": "2025-02-04 22:10:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308864:0",
            "title": "SailPoint to Launch 50 Million-Share IPO, Expected Range of $19 to $21",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SailPoint said Tuesday it has launched a roadshow for its proposed initial public offering of 50 million common shares expected to be priced between $19 and $21 per share. </p><p class=\"\">The cybersecurity firm said it is offering 47.5 million of the shares, with its parent Thoma Bravo offering the remaining 2.5 million shares. SailPoint also said it plans to give the underwriters a 30-day option to buy 7.5 million more shares at the IPO price, less discounts and commissions. </p><p class=\"\">The company said it plans to use the net proceeds to repay part of its term loan, settle equity awards and equity appreciation rights, pay fees under the advisory services deal with Thoma Bravo and for general corporate purposes. </p><p class=\"\">SailPoint said it will not receive any proceeds from the sale of shares by selling stockholders. </p><p class=\"\">The company said it has applied to list its shares on the Nasdaq under the \"SAIL\" ticker.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308864:0/",
            "pub_date": "2025-02-04 22:10:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308874:0",
            "title": "BMO Capital Adjusts SBA Communications Price Target to $220 From $230, Maintains Market Perform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SBA Communications  has an average rating of overweight and mean price target of $250.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308874:0/",
            "pub_date": "2025-02-04 22:10:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1CF:0",
            "title": "Air Products names Eduardo Menezes as CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Air Products  said on Tuesday it has named Eduardo Menezes as its chief executive officer, effective Feb. 7.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1CF:0-air-products-names-eduardo-menezes-as-ceo/",
            "pub_date": "2025-02-04 22:03:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308868:0",
            "title": "Cantor Fitzgerald Adjusts Fortinet Price Target to $110 From $95, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fortinet  has an average rating of overweight and mean price target of $102.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308868:0/",
            "pub_date": "2025-02-04 22:03:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308867:0",
            "title": "Sector Update: Energy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks fell pre-bell Tuesday as the Energy Select Sector SPDR Fund (XLE) declined by 0.6% recently. </p><p class=\"\">The United States Oil Fund (USO) was down 2.6% and the United States Natural Gas Fund (UNG) was 4.6% lower. </p><p class=\"\">Front-month US West Texas Intermediate crude oil was down 2.8% at $71.14 per barrel at the New York Mercantile Exchange. Global benchmark North Sea Brent crude oil lost 1.7% to $74.65 per barrel, and natural gas futures were down 5.3% at $3.18 per 1 million British Thermal Units. </p><p class=\"\">Marathon Petroleum  shares were up over 2% after the company reported lower Q4 adjusted net income and total revenue that still topped market expectations.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308867:0-sector-update-energy/",
            "pub_date": "2025-02-04 22:03:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006951_20250204006951:0",
            "title": "USDA Says 132,000 Tons Of Corn Sold To South Korea In 2024-25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006951_20250204006951:0/",
            "pub_date": "2025-02-04 22:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}