{
    "data": [
        {
            "id": "DJN_DN20250205004118:0",
            "title": "EU Merger Watchdog Begins Probe of AMD's $5 Billion ZT Systems Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU Starts Reviewing AMD's $5 Billion ZT Systems Server Builder Deal<br/><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU Sets March 12 Deadline to End First Probe of Deal<br/><strong class=\"root-Tkn6WL2y\">(11:38 GMT) </strong>*EU: AMD, ZT Systems Notify Merger Plans for EU Review<br/><strong class=\"root-Tkn6WL2y\">(12:09 GMT) </strong>EU Merger Watchdog Begins Probe of AMD's $5 Billion ZT Systems Acquisition</p><p class=\"\">By Edith Hancock</p><p class=\"\">The European Commission started looking at Advanced Micro Devices' $5 billion acquisition of ZT Systems, setting a March 12 deadline to decide whether or not to clear the deal or launch an in-depth investigation.</p><p class=\"\">AMD notified the commission about its bid for the New Jersey, U.S.-based server builder on Tuesday, according to the regulator's website.</p><p class=\"\">The chip maker agreed to buy ZT Systems, which designs data-center equipment for cloud computing and artificial intelligence, last August in a move to take on Nvidia's dominance in the fast-growing AI space.</p><p class=\"\">AMD and ZT Systems didn't immediately respond to requests for comment.</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004118:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004957:0",
            "title": "DeepSeek Is Great, Say Google, Palantir, Nvidia. Why Stock Markets Should Worry and 5 Other Things to Know Today. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">When it comes to the artificial intelligence threat from China's DeepSeek, everyone in Silicon Valley seems to be singing from the same hymn sheet.</p><p class=\"\">Two more voices joined the choir on Tuesday. Alphabet, the parent company of search engine Google, only had good things to say about DeepSeek when it reported mixed results. \"Tremendous,\" and \"very good work\" is how CEO Sundar Pichai described the upstart, which claims to have developed an AI model that rivals those made by U.S. tech companies at a fraction of the cost. Pichai added that Google's models are still some of the best.</p><p class=\"\">Lisa Su, CEO of chip maker AMD, said DeepSeek shows how quickly the technology is innovating, which is good for business. Earlier this week, Palantir's Alex Karp said cheap AI was a plus for his company because it lowered input costs. And Microsoft CEO Satya Nadella last week referred to the obscure economic concept of Jevons Paradox — developed to show why 19th century coal use skyrocketed even as industry grew more energy efficient — to explain how DeepSeek would help bolster demand for AI services. Nvidia described it as an \"excellent AI advancement.\"</p><p class=\"\">Investors may be forgiven for feeling a little suspicious of all the positive spin. There are at least two aspects to the DeepSeek threat. One is the AI arms race between China and the U. S. — something from which Palantir, with extensive defense contracts, might be best placed to benefit. This is the side of DeepSeek that prompted comparisons with Sputnik, the 1950s Soviet Union satellite that spurred the investment that led to the U.S. landing on the moon first a decade later.</p><p class=\"\">The other side is whether Big Tech's huge spending on AI investment is worth it, purely from a perspective of returns on capital employed. Executives still think it will be — none offered hints that their plans had changed since DeepSeek jolted the market. They might be right. But with the impact yet to show up in earnings, investors have every reason to remain skeptical about the game plan.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Brian Swint</li></ul><p class=\"\">***</p><p class=\"\">Alphabet's Revenue Misses Expectations. AI Spending Accelerates.</p><p class=\"\">Alphabet was under pressure after revenue growth, while positive, slowed in the December quarter, and revenue in the closely watched cloud computing business fell short of expectations. CEO Sundar Pichai said it is accelerating spending on data centers for artificial intelligence, with $75 billion in capital expenditures this year.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">That amount of capital spending compares with just over $52 billion for   2024. Capital spending in the December quarter ran above expectations.   CFO Anat Ashkenazi said most of these investments were in technical   infrastructure, the largest component being investments in servers and   data centers.   </li><li class=\"listItem-bmN0_SHH\">The Google parent reported fourth-quarter earnings of $2.15 a share and   revenue of $96.47 billion, up 12% from a year earlier but the lowest   growth rate since 2023. The per-share number beat expectations but   revenue fell short. Cloud revenue rose 30% to $12 billion but missed   estimates.   </li><li class=\"listItem-bmN0_SHH\">Its video platform YouTube offered a bright spot for Alphabet, with   advertising revenue of $10.47 billion that beat expectations. Alphabet's   total advertising revenue was $72.5 billion, up 10.6% from a year earlier   and ahead of forecasts.   </li><li class=\"listItem-bmN0_SHH\">Google has remained top of the heap in search for years, but generative   AI-powered chatbots have put its market share in that business at risk.   Microsoft-backed OpenAI's ChatGPT and Meta Platforms' AI offering, along   with the new China-based DeepSeek's chat model compete with Google's   Gemini. </li></ul><p class=\"\">What's Next: Investors are awaiting updates on the Justice Department's antitrust case involving Google. A judge ruled in August that Google maintained a monopoly in general search services and general text advertising. The Justice Department has suggested a breakup of the company as a potential remedy.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Angela Palumbo and Liz Moyer</li></ul><p class=\"\">***</p><p class=\"\">AMD Disappoints on Data Center Revenue Despite Earnings Beat</p><p class=\"\">Advanced Micro Devices beat expectations for earnings but soft data center revenue failed to impress Wall Street analysts. CEO Lisa Su called 2024 a transformative year. Looking into 2025, Su sees clear opportunities for continued growth based on growing demand for high-performance and adaptive computing.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">AMD reported fourth-quarter adjusted earnings of $1.09 a share and   revenue of $7.7 billion. The chip maker's data-center unit generated   $3.86 billion in revenue. AMD forecast sales in the current quarter to a   range with $7.1 billion at the midpoint versus the $7 billion analysts'   estimate.   </li><li class=\"listItem-bmN0_SHH\">Personal-computing revenue rose 58%, to $2.3 billion, driven by solid   demand for its Ryzen processor chips. But its gaming unit sales dropped   59%, to $563 million, and its embedded segment fell 13%, to $923 million.   </li><li class=\"listItem-bmN0_SHH\">AMD has gotten a boost from the surge in AI demand that has lifted the   chip sector. It makes chips that help create and use tools that produce   humanlike text, images, and video. As it moves toward more AI activities,   it has cut its global workforce by more than 1,000 jobs. </li></ul><p class=\"\">What's Next: Su said artificial intelligence models such as DeepSeek and AI infrastructure buildout announcements like Stargate are highlights showing the rapid pace of AI innovation that will drive more AI compute demand and give AMD growth opportunities.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Tae Kim</li></ul><p class=\"\">***</p><p class=\"\">RFK Jr.'s Nomination Advances as Big Pharma Reports Earnings</p><p class=\"\">Robert F. Kennedy Jr., President Donald Trump's pick to head the Health and Human Services Department, is headed to a full Senate confirmation vote after Republican Sen. Bill Cassidy, a physician once seen as a potential \"no\" vote, joined other finance committee Republicans to support his nomination.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cassidy said that he would support Kennedy despite the latter's record as   a strident vaccine critic. Cassidy's decision significantly narrows the   odds that those opposed to his nomination will muster enough Republican   votes to block him, making his eventual confirmation highly likely.   </li><li class=\"listItem-bmN0_SHH\">Vaccine maker Pfizer's stock fell 2.2% after the vote despite reporting   earnings that beat expectations. CEO Albert Bourla told Barron's he has   met with Kennedy and remains optimistic about the Trump administration   and Pfizer's focus on cancer treatments. Fellow vaccine maker Moderna's   stock closed down 6.5%.   </li><li class=\"listItem-bmN0_SHH\">Pfizer maintained the 2025 guidance laid out in December. Its   fourth-quarter earnings were 63 cents a share and revenue was $17.8   billion, up 21% from a year ago. It didn't update on its closely watched   obesity pill danuglipron, but promised data by the end of the first   quarter.   </li><li class=\"listItem-bmN0_SHH\">Merck's human papillomavirus vaccine Gardasil's fourth-quarter sales fell   17%, and it paused shipments to China. Full-year guidance was below   expectations, but CEO Rob Davis said confidence about successfully   navigating the 2028 expiration of patents for its cancer drug Keytruda   remains \"unchanged.\" </li></ul><p class=\"\">What's Next: Merck expects sales of $64.1 billion to $65.5 billion in 2025. Its outlook is affected by its decision to halt shipments to China until at least midyear as business in that country remains a challenge.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Josh Nathan-Kazis, Mackenzie Tatananni, and Janet H. Cho</li></ul><p class=\"\">***</p><p class=\"\">Robinhood Markets Says Super Bowl Bets Are Off</p><p class=\"\">Robinhood Markets, the trading app favored by meme stock investors, has suspended new contracts that would have allowed users to bet on the Super Bowl. The move at the request of the Commodity Futures Trading Commission comes just days before the annual sporting event, expected to draw record legal bets.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Robinhood said it was disappointed but will comply with the request from   the CFTC, which raised concerns about legality despite the company   discussing the contracts with the agency before their launch on Monday.   Robinhood general counsel Lucas Moskowitz said they believed they were in   full compliance with regulations.   </li><li class=\"listItem-bmN0_SHH\">Robinhood started event contracts during the U.S. presidential election.   Its Pro Football Championship market launched with Kalshi, an online   prediction market, and would have let customers trade contracts based on   whether they thought the Kansas City Chiefs or Philadelphia Eagles would   win in New Orleans on Sunday.   </li><li class=\"listItem-bmN0_SHH\">Fans are expected to legally bet a record $1.39 billion on the Super Bowl,   up from $1.25 billion last year, according to the American Gaming   Association. Thirty-eight states and Washington, D.C., now allow legal   sports betting.   </li><li class=\"listItem-bmN0_SHH\">U.S. sportsbooks including DraftKings, FanDuel, and Caesars generated   roughly $150 billion in wagers in 2024, but the total amount wagered is   much higher, because of illegal offshore sportsbooks and other   off-the-books gambling. The American Gaming Association estimates that   Super Bowl betting hit $23.1 billion last year. </li></ul><p class=\"\">What's Next: New York could surpass Nevada in Super Bowl wagers this year, Eric Ramsey of LegalSportsReport, a sports-betting site that tracks states' gambling amounts, told MarketWatch. LegalSportsReport estimates Super Bowl betting will reach $183 million in New York state, $170 million in Nevada, and $147 million in New Jersey.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Andrew Welsch and Janet H. Cho</li></ul><p class=\"\">***</p><p class=\"\">Novo Nordisk Earnings Beat But There Are Growth Concerns Novo Nordisk, the maker of weight-loss drugs Ozempic and Wegovy, posted fourth-quarter earnings comfortably above estimates early Wednesday. The results looked to ease some of investors' recent concerns about the pharma giant's future trajectory amid fierce competition from Eli Lilly. Yet, it wasn't all good news for the Danish drugmaker.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Novo Nordisk reported earnings of 6.34 Danish kroner ($0.88) a share on   sales of 85.7 billion DKK ($11.9 billion) for the quarter, beating   expectations for earnings of 5.98 DKK a share on sales of 80.1 billion   DKK, according to FactSet.   </li><li class=\"listItem-bmN0_SHH\">However, it also said it sees 2025 sales growth between 16% and 24% in   2025, less than the 26% growth observed in 2024.   </li><li class=\"listItem-bmN0_SHH\">Sales of Wegovy more than doubled from the same period last year, and   came largely in line with analysts' expectations at 19.9 billion DKK.   </li><li class=\"listItem-bmN0_SHH\">Shares have taken a beating in recent months, punished by growing worries   that sales of its blood sugar and appetite controlling GLP-1 drugs   wouldn't live up to the hype. </li></ul><p class=\"\">What's Next: The coming quarters will be crucial for Novo Nordisk as the narrative around the company has recently begun to shift for the worse. Its main rival, U.S.-based Eli Lilly, is set to report earnings Thursday and investors will be on the lookout for clues on the future of the GLP-1 market, as well as how the Novo-Lilly rivalry is shaping up.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Elsa Ohlen and Josh Nathan-Kazis</li></ul><p class=\"\">***</p><p class=\"\">Dear Quentin,</p><p class=\"\">I just visited my 62-year-old friend in the hospital and am dumbfounded. He has been given a diagnosis of stage four cancer. Because he has had organ transplants, chemotherapy isn't an option. If he gets stronger and can do radiation, they may be able to extend his life from a week or two to six months, maybe longer.</p><p class=\"\">Most of our visit was spent talking about memories we had and about his end-of-life wishes. He has a 30-year-old son and two grandchildren, and his wife is stepmother to his son. He received a $250,000 inheritance last year and would like to take that money and pay off his $150,000 mortgage so that his wife will have the house paid off. I don't know the interest rate. His big wish is for his son to get the house after his wife dies. At this point, what can be done? He was weak, and it was hard to determine what his will says.</p><p class=\"\">Assuming he gets stronger and doesn't die soon, what is the best course of action? Obviously, see a lawyer. I have seen letters where one spouse dies and the children don't get what the will specifies. Is some kind of trust better? I have no reason to distrust his wife, but I don't know her very well. At this point, does he just hope everything works out OK? From what I know, I don't think his wife can afford the house on her income alone. She has worked as a waitress in a local restaurant for over 20 years.</p><p class=\"\">Without his disability checks, his wife might end up having to sell the house. She would like to retire, but I don't know how much Social Security she would get on her own or using his earnings history. They have no savings other than the $250,000 from the inheritance. I wish I had known about this months and years ago so I could have helped, but I never felt it was my place to ask. It all feels so pointless and discouraging. I feel the big lesson here isn't to put off estate planning and to ensure your wishes are followed — especially if a stepparent is involved.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A Friend</li></ul><p class=\"\">Read the Moneyist's response here.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Quentin Fottrell</li></ul><p class=\"\">***</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Newsletter edited by Liz Moyer, Patrick O'Donnell, Callum Keown</li></ul><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004957:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004955:0",
            "title": "Advanced Micro Devices Is Maintained at Overweight by Keybanc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:09 GMT) </strong>Advanced Micro Devices Price Target Cut to $140.00/Share From $150.00 by Keybanc</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004955:0/",
            "pub_date": "2025-02-05 20:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464024:0",
            "title": "JP Morgan Boosts Middle East Healthcare's PT, Keeps at Neutral",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JP Morgan on Wednesday raised its price target of hospital operator Middle East Healthcare (SASE:4009) to 92.30 Saudi riyals from 75.00 riyals and maintained its rating at neutral.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464024:0/",
            "pub_date": "2025-02-05 20:09:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464022:0",
            "title": "RBC Upgrades Schroders to Outperform, Raises PT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RBC on Wednesday upgraded British asset manager Schroders  to outperform from sector perform and increased its price target to 3.95 pounds sterling from 3.30 pounds.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464022:0/",
            "pub_date": "2025-02-05 20:09:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309730:0",
            "title": "Uber Technologies' Q4 Earnings, Revenue Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uber Technologies  reported Q4 earnings Wednesday of $3.21 per diluted share, up from $0.66 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.50. </p><p class=\"\">Revenue for the quarter ended Dec. 31 was $11.96 billion, up from $9.94 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $11.76 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309730:0/",
            "pub_date": "2025-02-05 20:09:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004866_20250205004983:0",
            "title": "New York Times Sees 1Q Digital-only Subscription Revenues Increasing 14% - 17% >NYT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004866_20250205004983:0/",
            "pub_date": "2025-02-05 20:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309750:0",
            "title": "Earnings Flash (SR) Spire Posts Fiscal Q1 Adjusted EPS $1.34, vs. FactSet Est of $1.42",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309750:0/",
            "pub_date": "2025-02-05 20:10:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464023:0",
            "title": "Brainhole Technology Purchases Further Shares in Two US Companies for $1 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brainhole Technology  purchased further shares of Affirm Holdings and Robinhood Markets for $1 million through the open market on Tuesday, a Wednesday Hong Kong bourse filing said. </p><p class=\"\">The company purchased 8,400 class A common stock of Affirm Holdings and 9,800 class A common stock of Robinhood Markets for $500,000 each. </p><p class=\"\">The company had previously purchased 20,200 Affirm Holdings shares between Jan. 29 and Jan. 31 while it had acquired 22,000 Robinhood Markets' shares on Jan. 31. </p><p class=\"\">The purchases were funded through the existing internal financial resources of the group.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464023:0/",
            "pub_date": "2025-02-05 20:10:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW11G:0",
            "title": "Uber down as Q1 bookings forecast falls short of estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of ride-hailing company Uber  fell 3.3% to $67.47 premarket</p><p class=\"\">** Uber expects Q1 gross bookings between $42 bln and $43.5 bln, with mid-point lower than analysts estimate of $43.42 bln</p><p class=\"\">** Uber sees a 5.5-percentage-point hit from a strong dollar</p><p class=\"\">** Q4 revenue stood at  $11.96 bln, surpassing the average estimate of $11.77 bln - LSEG</p><p class=\"\">** Uber says Q4 gross bookings was $44.2 bln, beating Wall Street expectations of $43.45 bln</p><p class=\"\">** Forecasts Q1 adjusted core profit between $1.79 bln and $1.89 bln, compared with est. of $1.85 bln</p><p class=\"\">** Company says Q4 net profit was $6.88 bln, including a $6.4 bln benefit from a tax valuation release</p><p class=\"\">** Up to last close, stock had risen 2.5% in the past 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW11G:0-uber-down-as-q1-bookings-forecast-falls-short-of-estimates/",
            "pub_date": "2025-02-05 20:10:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_WkrbnwDjm:0",
            "title": "Nasdaq Copenhagen has accepted Penneo's request for delisting of its shares from Nasdaq Copenhagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 20/2025 </p><p class=\"\">Copenhagen, Denmark, 5 February 2025</p><p class=\"\">With reference to Penneo A/S' (\"<strong class=\"root-Tkn6WL2y\">Penneo</strong>\") announcement of 5 February 2025 (no. 19/2025), regarding Penneo's Board of Directors' decision, upon request from Visma Danmark Holding A/S, to request Nasdaq Copenhagen A/S (\"<strong class=\"root-Tkn6WL2y\">Nasdaq Copenhagen</strong>\") to have Penneo's shares (ISIN DK0061283009) removed from trading and official listing at Nasdaq Copenhagen, Nasdaq Copenhagen has today accepted to remove the shares from trading and official listing. </p><p class=\"\">The last day of trading and official listing of the shares in Penneo on Nasdaq Copenhagen will be 5 March 2025, being the last business day within the four-week compulsory acquisition period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information - Penneo:</strong></p><p class=\"\">Jostein Vik</p><p class=\"\">Chairman of the Board of Directors at Penneo</p><p class=\"\">Mobile +47 92 22 23 92 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Enquiries – Visma:</strong></p><p class=\"\">Lage Bøhren</p><p class=\"\">Director of Communication at Visma</p><p class=\"\">Telephone: +47 92 15 78 01</p><p class=\"\">Sindre Talleraas Holden</p><p class=\"\">Head of M&amp;A at Visma</p><p class=\"\">Telephone: +47 93 05 94 69</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world's leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/nasdaq-copenhagen-has-accepted-penneo-s-request-for-delisting-of-its-shares-from-nasdaq-copenhagen%2Cc4101064</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_WkrbnwDjm:0-nasdaq-copenhagen-has-accepted-penneo-s-request-for-delisting-of-its-shares-from-nasdaq-copenhagen/",
            "pub_date": "2025-02-05 20:10:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004987:0",
            "title": "Sterling Rises as Dollar Falls on Reduced Tariff Fears — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sterling rises to a four-week high against the dollar, which weakens following the suspension of U.S. tariffs on Mexico and Canada, Monex Europe forex analyst Nick Rees says. \"Sterling's recent drift higher looks like a predominantly-dollar driven move,\" he says. That is demonstrated by the fact sterling is only marginally higher versus the euro. However, the prospect of more gradual Bank of England interest-rate cuts relative to the European Central Bank suggest further sterling strength against the euro. Solid underlying growth, a relative lack of political dysfunction and insulation from U.S. tariffs compared to the eurozone also provide \"good reason to be constructive.\" EUR/GBP falls 0.1% to 0.8310. GBP/USD rises 0.4% to a high of 1.2551.(renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004987:0/",
            "pub_date": "2025-02-05 20:11:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309755:0",
            "title": "Earnings Flash (SR) Spire Posts Fiscal Q1 Operating Revenue $669.1 Million, vs. FactSet Est of $762.8 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309755:0/",
            "pub_date": "2025-02-05 20:11:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004866_20250205004909:0",
            "title": "New York Times 4Q Net $123.7M >NYT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004866_20250205004909:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004903:0",
            "title": "Logistics Report: Tariff Fightback Begins; How Levies Are Raising Commodity Costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sponsored by</p><p class=\"\">Tariff Fightback Begins; How Levies Are Raising Commodity Costs By Paul Berger</p><p class=\"\">Some of the U.S.'s biggest trading partners are flexing their muscles as the Trump administration escalates its trade war.</p><p class=\"\">Within minutes of the U.S. imposing a 10% tariff on China, Chinese officials hit back with tariffs on U.S. coal and liquefied natural gas imports, restrictions on exports of certain metals and by opening an antitrust probe into Google.</p><p class=\"\">The WSJ's Liza Lin and Raffaele Huang report that China's measures are largely symbolic because its tariffs, set for Feb. 10, target a narrow band of energy and machinery imports and its export controls don't go as far as a recent ban on critical minerals. Google has only a minimal presence in China.</p><p class=\"\">The tit-for-tat exchange shows how quickly tensions are escalating. The WSJ's Alexander Ward and Alex Leary write that a hoped-for phone call Tuesday between President Trump and Chinese leader Xi Jinping didn't happen . U.S. officials say a conversation between the two leaders is expected in the next week.</p><p class=\"\">European leaders have started preparing for the prospect of tariffs as well. The WSJ's Daniel Michaels and Kim Mackrael write that European Union officials are identifying imports from politically sensitive U.S. states , and French President Emmanuel Macron says Europe \"must command respect and respond\" to any tariffs.</p><p class=\"\">The U.S. Postal Service is suspending international parcels from China and Hong Kong after the U.S. closed a loophole that allows companies to avoid duties on packages worth less than $800. Spirits maker Diageo warned U.S. trade tariffs could derail its recovery . (WSJ) The U.K. is managing to avoid U.S. tariffs , for now. (WSJ)</p><p class=\"\">CONTENT FROM: PENSKE Gain Intel. Gain Ground with Penske.</p><p class=\"\">The road to the future relies on data. And we speak data. At Penske, technology is embedded in everything we do. Our apps and tools help our customers optimize their fleet by delivering real-time actionable insights straight to them.</p><p class=\"\">Learn More Quotable  Commodities</p><p class=\"\">Steelmakers are offering a glimpse at how tariffs could ripple across U.S. supply chains and raise consumer prices. Some U.S. steelmakers are raising their rates even after Trump paused tariffs on Canada and Mexico. The WSJ's Bob Tita reports that pricier steel and aluminum imports could lift consumer prices for appliances, cars and canned drinks .</p><p class=\"\">The U.S. steel industry is coming off its worst year since 2020 because of weak manufacturing demand. Steel executives have been pushing for measures that block what they see as unfairly low-price materials entering the country. Canada and Mexico accounted for 35% of steel imports last year. In the last few weeks, U.S. Steel announced a $50-a-ton price increase for flat-rolled steel, and Nucor raised its price by $25 a ton. Those price hikes are already hitting manufacturers who say they must now raise prices too.</p><p class=\"\">Number of the Day  In Other News</p><p class=\"\">The Federal Reserve's Mary Daly says the central bank is in no rush to lower interest rates. (MarketWatch)</p><p class=\"\">Job openings in the U.S. fell in December to the second-lowest level since the end of the pandemic. (MarketWatch)</p><p class=\"\">Ferrari expects revenue and earnings to rise this year after the sports-car maker reported a strong end to 2024 . (WSJ)</p><p class=\"\">Cosmetics giant Estée Lauder will cut up to 7,000 jobs and warned of a steep sales drop to start the year. (WSJ)</p><p class=\"\">Nintendo cut its annual earnings projections. (WSJ)</p><p class=\"\">Truck engine maker Cummins swung to a fourth-quarter profit of $418 million from a loss of $1.43 billion a year earlier. (Dow Jones Newswires)</p><p class=\"\">An oil tanker that was attacked by Houthi militants in Yemen last year has sailed through the Red Sea unharmed. (Reuters)</p><p class=\"\">The Singapore Navy is deploying a remotely controlled patrol boat to monitor local waters. (The Maritime Executive)</p><p class=\"\">The chief executive of Japanese shipowner K Line, Yukikazu Myochin, is stepping down . (TradeWinds)</p><p class=\"\">Almost 100,000 organic eggs valued at $40,000 were stolen from a trailer in Pennsylvania. (NBC News)</p><p class=\"\">About Us</p><p class=\"\">Follow the WSJ Logistics Report team: @bylizyoung  and @pdberger . Follow the WSJ Logistics Report on X at @WSJLogistics .</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004903:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004895:0",
            "title": "Euro Credit More Attractive Than U.S. Credit Due to Higher Inflation Risk in U.S. — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Euro credit looks more attractive and has more value to offer investors than U.S. credit, Benjamin Melman, global chief investment officer at Edmond de Rothschild Asset Management, says in a note. The risk of inflation reaccelerating in the U.S. makes euro credit more attractive, Melman says. \"The new Trump administration has added an extra layer of uncertainty over the future path of inflation with its tariff and deportation policies,\" he says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004895:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205007820:0",
            "title": "DeepSeek and tariffs have roiled the market. History says deeper pullbacks are coming, this strategist says.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">But American corporations will keep the bull market going, says Truist's Keith Lerner</p><p class=\"\">Despite the bumps for Wall Street to kick off the new year, the S&amp;P 500 SPX has held up fairly well, still positive and just over 1% away from making a new high.</p><p class=\"\">Truist Advisory Services' chief market strategist Keith Lerner says the \"carousel of tariffs\" and DeepSeek-related headlines have upended markets, but things could get much rockier as he urges clients to not react to each one.</p><p class=\"\">While his \"market uptrend remains intact...the latest tariff developments underscore the potential for disruptions and broken pieces that we expected to be part of the investment narrative in 2025.\"</p><p class=\"\">In our call of the day, Lerner also cautions against rushing into buy on market dips caused by those newsy headlines. \"With stocks not far from all-time highs and after a strong January, it's premature to say this current setback presents a great buying opportunity,\" he told clients in a new note.</p><p class=\"\">Over the past 40 years, the market has averaged a maximum intra-year pullback of around 14%, said the strategist. Stocks have also been up in 33 of 40 of those years - 83% of the time.</p><p class=\"\">Positives for stocks? Lerner said they expect the U.S. economy to stay resilient in 2025, given how it weathered the pandemic, high inflation and the fastest Fed rate-hiking cycle in decades. He also notes a more balanced performance across the stock market so far with 10 of 11 large-cap sectors up this year.</p><p class=\"\">He expects earnings will deliver - this current earnings solid has been \"solid,\" with 79% of S&amp;P 500 companies reporting beating consensus earnings estimates-and exceeding those estimates by an average of 6%, he says.</p><p class=\"\">As for where investors should be keeping their money, Lerner says he's holding on to a \"longstanding U.S. equity bias relative to international markets,\" owing to stronger economic and earnings trends.</p><p class=\"\">Lerner prefers large-cap stocks over small-caps, due to strong balance sheets and \"more levers to pull to manage through challenging periods.\" And he also likes midcaps over small-caps, owing to stronger financial footing and better earnings trends.</p><p class=\"\">And he's focused on higher quality when it comes to fixed income, with \"tension between the potential of higher inflation offset by a flight to quality in the 10-year U.S. Treasury yield.\" A modest position in gold is also something he favor right now, and for some investors, allocating to alternative strategies such as hedge funds can help smooth out the bumps  he expects.</p><p class=\"\">The markets</p><p class=\"\">Nasdaq-100 futures (NQ00) are leading declines for U.S. stock futures (ES00) (YM00), with Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y down and the dollar DXY off another 0.5%.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              6037.88    -0.49%  2.18%   2.66%  21.87% <br/>   Nasdaq Composite                                                     19,654.02  -0.40%  0.84%   1.78%  25.91% <br/>   10-year Treasury                                                     4.49       -2.90   -19.80  -8.60  33.32 <br/>   Gold                                                                 2892.8     4.34%   7.94%   9.60%  41.05% <br/>   Oil                                                                  72.36      -0.89%  -1.31%  0.68%  -2.32% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">Alphabet's stock (GOOGL) is tumbling after a revenue miss and big plans for AI spending.</p><p class=\"\">AMD shares (AMD) are sliding after a disappointing outlook for its data-center business, as it won't give AI revenue forecasts anymore.</p><p class=\"\">Mattel (MAT) is jumping on upbeat profit and Barbie forecasts. A disappointing sales forecast is hitting Chipotle shares (CMG).</p><p class=\"\">Disney (DIS) and Uber (UBER) are due to report ahead of the open, with Ford (F) results and Costco (COST) sales coming after the close.</p><p class=\"\">The U.S. Post Office will stop accepting parcels from China, news that weighed on shares of Amazon.com (AMZN) and Temu owner PDD (PDD).</p><p class=\"\">Private-sector payroll data is coming at 8:15 a.m., the U.S. trade deficit at 8:30 a.m. and the Institute for Supply Management's services survey at 10 a.m. Among Fed speakers, we'll hear from Richmond Fed President Tom Barkin and Chicago Fed President Goolsbee.</p><p class=\"\">Best of the web</p><p class=\"\">Why central banks' hunger for gold shows 'no sign of being quelled' this year.</p><p class=\"\">Trump campaigned on ending foreign entanglements. Now he wants to own Gaza.</p><p class=\"\">The young techies assigned to help Musk slash size of U.S. government.</p><p class=\"\">The chart</p><p class=\"\">The above chart shows how gold miners continue to lag the precious metal (GC00), up 9.6% so far in 2025. TopDown Chart's head of research and founder Callum Thomas, who provided the chart, says gold miners have been in a 5-year trading range, and never caught up from a divergence with gold prices back in 2021. \"But with growth stocks looking increasingly overvalued and at risk in an environment of rising (geo)political risk, and gold prices going from strength to strength I think it's fair to expect some catch-up for miners,\" he writes.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6.a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   TSLA    Tesla <br/>   AMD     Advanced Micro Devices <br/>   PLTR    Palantir Technologies <br/>   GOOGL   Alphabet <br/>   AAPL    Apple <br/>   GME     GameStop <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMZN    Amazon.com <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Egg-ceptional times: police are hunting thieves who stole $40,000 worth of eggs.</p><p class=\"\">A pig bites man story.</p><p class=\"\">No, Scotland will not ban cats, despite a recommendation to do so.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205007820:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004877:0",
            "title": "CDW Authorizes $750 Million Share Repurchase Program Increase and Declares Quarterly Cash Dividend of $0.625 Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>*CDW Authorizes $750 Million Share Repurchase Program Increase And Declares Quarterly Cash Dividend Of $0.625 Per Share &gt;CDW<br/><strong class=\"root-Tkn6WL2y\">(12:05 GMT) </strong>Press Release: CDW Authorizes $750 Million Share Repurchase Program Increase and Declares Quarterly Cash Dividend of $0.625 Per Share</p><p class=\"\">CDW Authorizes $750 Million Share Repurchase Program Increase and Declares Quarterly Cash Dividend of $0.625 Per Share</p><p class=\"\">Reinforces Ongoing Commitment to Delivering Value to Stockholders</p><p class=\"\">VERNON HILLS, Ill.--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">CDW Corporation , a leading multi-brand provider of information technology solutions to business, government, education and healthcare customers in the United States, the United Kingdom and Canada, today announced that its Board of Directors has authorized a $750 million increase to the Company's share repurchase program and declared a quarterly cash dividend. The cash dividend of $0.625 per common share will be paid on March 11, 2025 to all stockholders of record as of the close of business on February 25, 2025. This amount represents a 1 percent increase over last year's dividend.</p><p class=\"\">\"Since our IPO in June 2013, our dividend has increased nearly fifteen-fold from its initial level and we have returned more than $7.2 billion to stockholders through dividends and share repurchases,\" said Albert J. Miralles, chief financial officer, CDW. \"Our capital allocation strategy continues to emphasize dividend growth, along with managing our net leverage and making strategic acquisitions, in addition to share repurchases. This strategy has enabled us to deliver value to our stockholders, just as we have delivered value to our customers and partners for 40 years.\"</p><p class=\"\">Future dividends and share repurchase authorizations will be subject to approval by CDW's Board of Directors. The $750 million authorization is incremental to the approximately $588 million remaining from the previous repurchase program as of December 31, 2024. Share repurchases under the program will be made from time to time in private transactions, open market purchases or other transactions as permitted by securities laws and other legal requirements. The timing and amounts of any purchases will be based on market conditions and other factors including but not limited to price, regulatory requirements and capital availability. The program does not require the purchase of any minimum dollar amount or number of shares and the program may be modified, suspended or discontinued at any time.</p><p class=\"\">About CDW</p><p class=\"\">CDW Corporation  is a leading multi-brand provider of information technology solutions to business, government, education and healthcare customers in the United States, the United Kingdom and Canada. A Fortune 500 company and member of the S&amp;P 500 Index, CDW helps its customers navigate an increasingly complex IT market and maximize return on their technology investments. For more information about CDW, please visit www.CDW.com.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">Statements in this release that are not statements of historical fact are forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including without limitation statements regarding the future dividends, share repurchases, earnings growth, capital allocation, leverage ratio and other strategic plans of CDW. These forward-looking statements are subject to risks and uncertainties that may cause actual results or events to differ materially from those described in such statements. Although CDW believes that its plans, intentions and other expectations reflected in or suggested by such forward-looking statements are reasonable, it can give no assurance that it will achieve those plans, intentions or expectations. Reference is made to a more complete discussion of forward-looking statements and applicable risks contained under the captions \"Forward-Looking Statements\" and \"Risk Factors\" in CDW's Annual Report on Form 10-K for the year ended December 31, 2023 and subsequent filings with the SEC. CDW undertakes no obligation to update or revise any of its forward-looking statements, whether as a result of new information, future events or otherwise, except as otherwise required by law.</p><p class=\"\">CDWPR-FI</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205735737/en/</p><p class=\"\">CONTACT:    Investor Inquiries</p><p class=\"\">Steven O'Brien</p><p class=\"\">Vice President, Investor Relations</p><p class=\"\">(847) 968-0238</p><p class=\"\">investorrelations@cdw.com</p><p class=\"\">Media Inquiries</p><p class=\"\">Sara Granack</p><p class=\"\">Vice President, Corporate Communications</p><p class=\"\">(847) 419-7411</p><p class=\"\">mediarelations@cdw.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004877:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004877_20250205004877:0",
            "title": "CDW Authorizes $750 Million Share Repurchase Program Increase And Declares Quarterly Cash Dividend Of $0.625 Per Share >CDW",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004877_20250205004877:0/",
            "pub_date": "2025-02-05 20:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:6167b26fcb52e:0",
            "title": "Uber Technologies, Inc. Q4 and Full Year 2024 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uber Technologies, Inc. has released its financial results for the fourth quarter and full year ending December 31, 2024. The company reported significant growth across various financial and operational metrics, highlighting its robust performance and strategic advancements.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Uber reported a strong financial performance for Q4 2024, with Gross Bookings growing by 18% year-over-year (YoY) to $44.2 billion. Revenue for the quarter increased by 20% YoY to $12.0 billion. The company achieved an income from operations of $770 million, up $118 million YoY, and a net income attributable to Uber Technologies, Inc. of $6.9 billion, which includes a substantial tax valuation release benefit.</p><p class=\"\">Adjusted EBITDA for the quarter grew by 44% YoY to $1.8 billion, with an Adjusted EBITDA margin of 4.2% of Gross Bookings. Uber also reported a free cash flow of $1.7 billion for the quarter, reflecting a 122% increase YoY.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Uber's business segments showed notable performance improvements. Mobility Gross Bookings increased by 18% YoY to $22.8 billion, while Delivery Gross Bookings also grew by 18% YoY to $20.1 billion. The company recorded 3.1 billion trips during the quarter, averaging approximately 33 million trips per day.</p><p class=\"\">Operationally, Uber expanded its autonomous vehicle initiatives, launching services in Abu Dhabi and enhancing its delivery operations with autonomous robots in Austin, Dallas, and Osaka. The company also saw a significant increase in its Uber One membership base, which grew by 60% YoY to 30 million members.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Uber continued to focus on strategic initiatives, including a $2.0 billion debt redemption in Q4 2024. The company also entered into an accelerated share repurchase agreement in January 2025 to buy back $1.5 billion worth of its common stock. Additionally, Uber formed a joint initiative with NVIDIA to develop AI-powered autonomous driving technology.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">CEO Dara Khosrowshahi emphasized the company's strong performance and growth across multiple priorities, including autonomous vehicles. CFO Prashanth Mahendra-Rajah highlighted the record demand in both Mobility and Delivery segments, which helped Uber exceed its three-year outlook for Gross Bookings, Adjusted EBITDA, and free cash flow.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For Q1 2025, Uber anticipates Gross Bookings growth of 17% to 21% YoY on a constant currency basis, translating to reported Gross Bookings of $42.0 billion to $43.5 billion. The company also projects Adjusted EBITDA of $1.79 billion to $1.89 billion, representing 30% to 37% YoY growth.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1543151/000154315125000004/uber-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Uber Technologies, Inc [ UBER ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:6167b26fcb52e:0-uber-technologies-inc-q4-and-full-year-2024-financial-results/",
            "pub_date": "2025-02-05 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:710b26f79fbfc:0",
            "title": "Reynolds Consumer Products Reports Fourth Quarter and Full Year 2024 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reynolds Consumer Products Inc., a leading provider of household products, has released its financial results for the fourth quarter and fiscal year ending December 31, 2024. The company, known for its iconic brands such as Reynolds Wrap® and Hefty®, has provided a detailed overview of its financial performance, strategic initiatives, and future outlook.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fiscal year 2024, Reynolds Consumer Products reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net Revenues of $3,695 million, a slight decrease from $3,756 million in 2023.</li><li class=\"listItem-bmN0_SHH\">Net Income of $352 million, up 18% from $298 million in 2023.</li><li class=\"listItem-bmN0_SHH\">EBITDA of $678 million, a 7% increase from $636 million in 2023.</li><li class=\"listItem-bmN0_SHH\">Earnings Per Share (EPS) of $1.67, compared to $1.42 in 2023.</li><li class=\"listItem-bmN0_SHH\">Operating Cash Flow of $489 million, with a 72% conversion of Adjusted EBITDA.</li></ul><p class=\"\">For the fourth quarter of 2024, the company reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net Revenues of $1,021 million, up from $1,007 million in Q4 2023.</li><li class=\"listItem-bmN0_SHH\">Net Income of $121 million, down from $137 million in Q4 2023.</li><li class=\"listItem-bmN0_SHH\">EBITDA of $213 million, a decrease from $238 million in Q4 2023.</li><li class=\"listItem-bmN0_SHH\">Earnings Per Share (EPS) of $0.58, compared to $0.65 in Q4 2023.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Reynolds Consumer Products saw varied performance across its segments:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Reynolds Cooking &amp; Baking:</strong> Net Revenues increased by $17 million to $374 million, driven by retail and non-retail growth. Adjusted EBITDA decreased by $7 million to $82 million due to higher operational costs and lower pricing.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Hefty Waste &amp; Storage:</strong> Net Revenues increased by $8 million to $245 million. Adjusted EBITDA decreased by $5 million to $68 million, impacted by higher operational costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Hefty Tableware:</strong> Net Revenues decreased by $8 million to $251 million. Adjusted EBITDA decreased by $6 million to $52 million, driven by lower net revenues and higher operational costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Presto Products:</strong> Net Revenues remained unchanged at $153 million. Adjusted EBITDA decreased by $4 million to $30 million due to higher operational costs.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">The company made significant strides in debt reduction, reducing Net Debt Leverage from 2.7x to 2.3x. Additionally, Reynolds Consumer Products made a voluntary principal payment of $50 million on its term loan facility. The company also increased its capital expenditures to $120 million, reflecting investments in automation and cost-saving programs.</p><p class=\"\">The Board of Directors approved a quarterly dividend of $0.23 per common share, payable on February 28, 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Scott Huckins, President and CEO, highlighted the company's strong brand presence and commitment to driving growth and margin expansion. He emphasized the company's readiness to execute new and existing programs to realize more of its potential.</p><p class=\"\">Nathan Lowe, CFO, underscored the strength of the company's balance sheet and cash flows, positioning it well for increased investment and profitability. He mentioned the application of a returns-based framework to a robust pipeline of product innovation and cost-saving programs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For fiscal year 2025, Reynolds Consumer Products expects:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net Revenues to be down low single digits compared to 2024.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA to be between $670 million and $690 million.</li><li class=\"listItem-bmN0_SHH\">Adjusted EPS to be between $1.61 and $1.68.</li></ul><p class=\"\">For the first quarter of 2025, the company anticipates:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net Revenues to be down low single digits compared to Q1 2024.</li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA to be approximately $115 million to $120 million.</li><li class=\"listItem-bmN0_SHH\">Adjusted EPS to be between $0.22 and $0.24.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1786431/000162828025003918/reyn-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Reynolds Consumer Products Inc. [ REYN ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:710b26f79fbfc:0-reynolds-consumer-products-reports-fourth-quarter-and-full-year-2024-financial-results/",
            "pub_date": "2025-02-05 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:77e64e7e1379a:0",
            "title": "Performance Food Group Company Reports Second-Quarter and First-Six Months Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Performance Food Group Company (PFG), a leading food and foodservice distribution company in North America, has released its financial results for the second quarter and first six months of fiscal 2025. The company reported strong growth in independent restaurant case volume, net sales, and cash flow, despite a decline in net income.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the second quarter of fiscal 2025, PFG reported a 9.4% increase in net sales, reaching $15.6 billion. Gross profit improved by 14.4% to $1.8 billion. However, net income decreased by 45.8% to $42.4 million, primarily due to increased interest expenses and operating costs. Adjusted EBITDA rose by 22.5% to $423.0 million, while diluted EPS decreased by 46.0% to $0.27. Adjusted Diluted EPS increased by 8.9% to $0.98.</p><p class=\"\">For the first six months of fiscal 2025, net sales grew by 6.2% to $31.1 billion, and gross profit increased by 10.2% to $3.6 billion. Net income decreased by 24.4% to $150.4 million. Adjusted EBITDA rose by 14.5% to $834.9 million, while diluted EPS decreased by 24.4% to $0.96. Adjusted Diluted EPS increased by 3.9% to $2.13. Operating cash flow was $379.0 million, and free cash flow was $175.1 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">PFG experienced significant growth in case volumes, with total case volume increasing by 9.8% in the second quarter and 6.1% in the first six months of fiscal 2025. The company saw a 19.8% increase in total independent foodservice case volume in the second quarter and a 13.5% increase in the first six months. Organic independent foodservice case volume also grew by 5.0% in the second quarter and 4.6% in the first six months.</p><p class=\"\">Net sales growth was driven by recent acquisitions, including Cheney Brothers, and an increase in selling prices per case due to inflation. The company also benefited from procurement efficiencies and a favorable shift in the mix of cases sold.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">PFG continued its share repurchase program, buying back 0.4 million shares for $33.6 million in the first six months of fiscal 2025. The company has approximately $177.0 million remaining for additional share repurchases under its $300 million share repurchase program authorized in November 2022.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">George Holm, PFG’s Chairman &amp; Chief Executive Officer, expressed satisfaction with the company's performance, highlighting strong sales and Adjusted EBITDA growth. He noted that both organic business and recent acquisitions contributed significantly to the company's exceptional case growth in Foodservice. Holm also mentioned the successful integration of José Santiago and Cheney Brothers, emphasizing the value and expertise these organizations bring to PFG.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For the third quarter of fiscal 2025, PFG expects net sales to be in the range of $15.2 billion to $15.6 billion and Adjusted EBITDA to be between $390 million and $410 million. For the full fiscal year 2025, the company anticipates net sales of approximately $63 billion to $64 billion and Adjusted EBITDA in the range of $1.725 billion to $1.8 billion.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1618673/000095017025014152/pfgc-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Performance Food Group Co [ PFGC ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:77e64e7e1379a:0-performance-food-group-company-reports-second-quarter-and-first-six-months-fiscal-2025-results/",
            "pub_date": "2025-02-05 20:05:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309736:0",
            "title": "Aurora Cannabis Brief: Says Generated Q3 Record Net Income of $31.2 Million, and Record Adjusted EBITDA of $23.1 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309736:0/",
            "pub_date": "2025-02-05 20:05:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463972:0",
            "title": "Investec Kicks Off XPS Pensions Group Coverage at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Investec on Wednesday initiated the coverage of British pensions consulting and administration company XPS Pensions Group  with a buy rating and a price target of 4.00 pounds sterling.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463972:0/",
            "pub_date": "2025-02-05 20:05:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309740:0",
            "title": "Aurora Cannabis Brief: Says Achieved Target of Positive Free Cash Flow in Q3, Generating $27.4 Million of Free Cash Flow",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309740:0/",
            "pub_date": "2025-02-05 20:05:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLX1F8470:0",
            "title": "BRIEF-New York Times Q4 Operating Profit USD 146.6 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - New York Times Q4 EPS USD 0.75.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q4 adjusted operating profit USD 167 million vs. IBES estimate USD 197 million</li><li class=\"listItem-bmN0_SHH\">Q4 operating margin 20.2%</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLX1F8470:0-brief-new-york-times-q4-operating-profit-usd-146-6-million/",
            "pub_date": "2025-02-05 20:05:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1HI:0",
            "title": "Equinor ASA reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA  reported quarterly adjusted earnings of 63 cents​​ per share for the quarter ended December 31, identical to the same quarter last year.  The lone analyst forecast for the quarter was for earnings of 62 cents per share. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 7.2% to $26.42 billion from a year ago; analysts expected $25.97 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA's reported EPS for the quarter was 73 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $2 billion.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA shares had risen by 4.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 23.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the integrated oil &amp; gas peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Equinor ASA is $29.39 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 11:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.62</p></td><td><p class=\"\">0.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.74</p></td><td><p class=\"\">0.79</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.85</p></td><td><p class=\"\">0.84</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.80</p></td><td><p class=\"\">0.96</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1HI:0-equinor-asa-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 20:00:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr7NGvkh:0",
            "title": "Changes in the KONE Executive Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>KONE Oyj<p class=\"\">KONE Corporation, stock exchange release, February 5, 2025, at 2:00 p.m. EET</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Changes in the KONE Executive Board</strong></p><p class=\"\">Nicolas Alchal has been appointed Executive Vice President, Commercial &amp; Operations as of April 1, 2025. He continues to be part of the KONE Executive Board, reporting to Philippe Delorme, President and CEO. Nicolas will continue in his current role as interim Executive Vice President for KONE’s Europe organization, until Karla Lindahl returns from parental leave in late March.</p><p class=\"\">Nicolas succeeds Axel Berkling who has decided to step down from his position as Executive Vice President for Commercial &amp; Operations as of March 31. Following this date, Axel will continue to serve the company as an Executive Advisor until the end of August 2025, after which he will pursue other opportunities outside of KONE. </p><p class=\"\">Kaori Uehigashi has been appointed Executive Vice President, Strategy &amp; Transformation as of early May 2025. She continues to be a member of the Executive Board, reporting to Philippe Delorme, having served as the interim leader for the Strategy &amp; Transformation organization since January 2024. </p><p class=\"\">“I want to thank Axel for his outstanding commitment to KONE over the past 26 years. He has been a member of the KONE Executive Board since 2016, and we have greatly benefited from his extensive business acumen and values-based leadership. I wish him all the best in his future endeavors. I also want to congratulate Nicolas and Kaori and look forward to their continued contributions in driving KONE’s strategy forward together with the rest of the Executive Board,” says Philippe Delorme, President and CEO.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Kaija Bridger, Executive Vice President, People and Communications, tel. +358 20 4751</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sender:</strong></p><p class=\"\">KONE Corporation</p><p class=\"\">Philippe Delorme</p><p class=\"\">President and CEO</p><p class=\"\">Kaija Bridger</p><p class=\"\">Executive Vice President, People &amp; Communications</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About KONE</strong></p><p class=\"\">At KONE, our purpose is to shape the future of cities. As a global leader in the elevator and escalator industry, we move two billion people every day, making their journeys safe, convenient, and reliable with smart and sustainable People Flow®. In 2024, KONE had annual sales of EUR 11.0 billion, and at the end of the year over 60,000 employees in close to 70 countries. KONE class B shares are listed on the Nasdaq Helsinki Ltd. in Finland.</p><p class=\"\">www.kone.com</p><p class=\"\">https://news.cision.com/kone-oyj/r/changes-in-the-kone-executive-board%2Cc4101011</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr7NGvkh:0-changes-in-the-kone-executive-board/",
            "pub_date": "2025-02-05 20:00:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1HL:0",
            "title": "GSK plc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc  reported quarterly adjusted earnings of 59 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 72 cents.  The mean expectation of two analysts for the quarter was for earnings of 44 cents per share. Wall Street expected results to range from 37 cents to 50 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 4% to $10.40 billion from a year ago; analysts expected $9.68 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc's reported EPS for the quarter was 26 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc shares had risen by 3.0% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 4 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the pharmaceuticals peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for GSK plc is $41.50 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 11:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">0.59</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.24</p></td><td><p class=\"\">1.29</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">1.10</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.91</p></td><td><p class=\"\">1.09</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1HL:0-gsk-plc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 20:00:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309610:0",
            "title": "Calibre Mining Adds 30% to Contained Gold at Leprechaun Open Pit of Valentine Gold Mine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Calibre Mining  on Wednesday released additional drill results from its Leprechaun open pit at the Valentine gold mine in Newfoundland and Labrador, adding 30% to contained gold. </p><p class=\"\">The results of drilling have so far demonstrated 29% more ore tonnes at a 1% higher grade for 30% more gold than the comparable area in the 2022 mineral reserve model at an ore-waste cut-off of 0.38 grams per tonne (g/t) gold. </p><p class=\"\">The grade distribution indicates that applying a higher cut-off grade will result in processing higher grade material, Calibre CEO Darren Hall said in a release. </p><p class=\"\">At a 0.7 g/t cut-off, the reserve model estimated 660,000 tonnes at 2.02 g/t but the ore control model for a similar tonnage results in 18% higher grade by increasing the cut-off to 1.0 g/t. </p><p class=\"\">The findings could result in increased metal production and extend the mine life, Hall noted.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309610:0/",
            "pub_date": "2025-02-05 20:00:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}