{
    "data": [
        {
            "id": "DJN_DN20250204008550:0",
            "title": "Advanced Micro Devices Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:47 GMT) </strong>Advanced Micro Devices Price Target Cut to $147.00/Share From $158.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008550:0/",
            "pub_date": "2025-02-05 00:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309051:0",
            "title": "Palantir Technologies' Big Q4 Beat Boosted by AI Demand, US Commercial Segment, UBS Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies'  Q4 results beat market expectations on a jump in US commercial sales and demand for artificial intelligence, underpinning strong margins and cash flow growth, UBS Securities said Tuesday in a report. </p><p class=\"\">On Monday, Palantir's results \"stood in sharp contrast to the mixed results from Microsoft  and ServiceNow  last week,\" the report said. </p><p class=\"\">\"The guidance for strong 54% US commercial revs growth in 2025 is a</p><p class=\"\">positive signal,\" UBS said. </p><p class=\"\">\"In light of DeepSeek, Palantir reaffirmed its views that model costs are falling fast, and performance gaps are narrowing,\" UBS said. Palantir's pricing structure \"may help to insulate it from any resulting AI price deflation,\" the report said. </p><p class=\"\">UBS raised its price target on Palantir stock to $105 from $80 and affirmed its neutral rating. Several other analysts boosted their price targets. </p><p class=\"\">Palantir shares jumped 25% in recent Tuesday trading. Microsoft gained 0.5%, and ServiceNow fell 1.3%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309051:0/",
            "pub_date": "2025-02-05 00:47:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:eba42dcb2094b:0",
            "title": "TradingView's General Manager Pierce Crosby Departs to Launch Consulting Firm for Startups",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">After nearly six years at the charting and analysis firm TradingView, Pierce Crosby is moving on to his next venture. The former General Manager of TradingView announced his departure to launch Merchant Seven (M7), a consulting firm focused on accelerating growth for early-stage technology companies. </p><p class=\"\">\"M7 provides a fractional, high-impact team and operational systems to help businesses move faster without the burden of full-time exec hires, Crosby posted on LinkedIn today (Tuesday). \"Why now? TradingView is in good hands, and the early-stage ecosystem is evolving rapidly. The right expertise at the right time is the perfect catalyst.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fintech and Tech Expert</strong></p><p class=\"\">With a decade of experience in fintech and trading technology, Crosby is now shifting his expertise toward helping startups scale. According to his post, Merchant Seven (M7) is designed to offer strategic guidance and operational support to growing tech firms.Pierce Crosby, Source: LinkedIn</p><p class=\"\">M7 reportedly provides a \"fractional, high-impact team\" to help businesses move forward without requiring full-time executive hires. The firm is already working with five clients and plans to expand its team this spring. </p><p class=\"\">\"We're launching with five clients already on board and expanding our team this spring to take on more. If you're building something ambitious and looking for support, drop us a note.\"</p><p class=\"\">Crosby highlighted the evolving early-stage startup ecosystem as a key reason for launching M7. By offering specialized consulting, M7 now aims to streamline growth processes and enhance operational efficiency for emerging companies. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Teaming Up with Former Colleagues</strong></p><p class=\"\">Crosby isn't embarking on this new venture alone. Joining him at M7 are two former TradingView colleagues, Milana Ruchkina. Ruchkina, previously the US Growth Director at TradingView, will serve as Chief of Staff at M7.Milana Ruchkina, Source: LinkedIn</p><p class=\"\">\"I've joined the Merchant Seven team to continue pursuing that vision and passion. My focus will be working with early-stage companies to help their dreams come true too!,\" Ruchkina wrote. </p><p class=\"\">Crosby's tenure at TradingView began in 2019, where he played a crucial role in expanding the platform's influence, particularly among retail FX and CFD brokers.</p><p class=\"\">Before that, he spent five years at StockTwits in various leadership roles, including VP of Revenue Strategy and Head of Business Development.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:eba42dcb2094b:0-tradingview-s-general-manager-pierce-crosby-departs-to-launch-consulting-firm-for-startups/",
            "pub_date": "2025-02-05 00:47:10",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308952:0",
            "title": "Top Midday Stories: China Retaliates With Tariffs, Antitrust Probe of Google; Merck Shares Tumble on Downbeat Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">All three major US stock indexes were up in late morning trading on Tuesday as investors digest the latest US tariff news. </p><p class=\"\">China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. China announced tariffs of 15% on coal and LNG coming from the US and 10% for crude oil, farm machinery and certain vehicles, set to take effect Feb. 10. In addition, China's State Administration for Market Regulation opened an antitrust investigation in Alphabet's  Google over suspected violations of the country's anti-monopoly law, according to media reports. Lastly, China's Commerce Ministry has reportedly placed PVH , owner of brands like Calvin Klein and Tommy Hilfiger, and Illumina  on its \"unreliable entity\" list, the reports said. Alphabet shares were up 1.9%, while those of PVH and Illumina were down 1.3% and 5.8%, respectively. </p><p class=\"\">Merck  reported Q4 non-GAAP earnings Tuesday of $1.72 per share, up from $0.03 a year earlier and above the consensus estimate of analysts surveyed by FactSet of $1.61. Fourth-quarter sales were $15.62 billion, up from $14.63 billion a year earlier and above the FactSet consensus estimate of $15.48 billion. For full-year 2025, Merck expects non-GAAP EPS of $8.88 to $9.03 on sales of $64.1 billion to $65.6 billion. Analysts polled by FactSet expect non-GAAP EPS of $9.13 on sales of $67.07 billion. Merck shares were down about 11%. </p><p class=\"\">PepsiCo  reported fiscal Q4 core earnings Tuesday of $1.96 per diluted share, up from $1.78 a year earlier and above the FactSet consensus estimate of $1.94. Fiscal Q4 revenue was $27.78 billion, down from $27.85 billion in the year-ago period and below the FactSet consensus of $27.89 billion. The company expects fiscal 2025 core earnings to increase by low-single digits and expects low-single-digit organic revenue growth. Pepsi shares were down 4.2%. </p><p class=\"\">Palantir Technologies  reported Q4 adjusted earnings late Monday of $0.14 per share, up from $0.08 a year earlier and above the FactSet consensus of $0.11. Fourth-quarter revenue was $827.5 million, up from $608.4 million in the year-ago period and above the FactSet consensus of $775.8 million. The company expects Q1 revenue of $858 million to $862 million, compared to the FactSet consensus estimate of $799.6 million. For full-year 2025 revenue, Palantir expects $3.74 billion to $3.76 billion, compared to the FactSet consensus of $3.50 billion. Palantir shares were up nearly 25%. </p><p class=\"\">Pfizer  reported Q4 adjusted earnings Tuesday of $0.63 per diluted share, up from $0.10 a year earlier and above the FactSet consensus estimate of $0.47. Fourth-quarter revenue was $17.76 billion, up from $14.57 billion a year earlier and above the FactSet consensus of $17.35 billion. The company reaffirmed both its full-year 2025 adjusted EPS guidance of $2.80 to $3 and its full-year 2025 revenue guidance of $61 billion to $64 billion. Pfizer shares were down 1.2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308952:0/",
            "pub_date": "2025-02-05 00:47:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008565:0",
            "title": "VeriSign Is Maintained at Buy by Citigroup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008565:0/",
            "pub_date": "2025-02-05 00:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309070:0",
            "title": "FirstService Raises Quarterly Dividend to $0.275 a Share From $0.25, Payable April 7 to Holders of Record March 31",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309070:0/",
            "pub_date": "2025-02-05 00:48:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008580:0",
            "title": "Trump Tariffs Loom Over Ad Industry, From Brands to Digital Sellers — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Patrick Coffee</p><p class=\"\">President Trump's new tariffs on China, and those threatened against Canada and Mexico, may slow advertising growth at top digital powers such as Meta Platforms and Google and encourage some major brands to cut ad spending more broadly, industry analysts said.</p><p class=\"\">Trump's 10% tariffs on imports from China took effect on Tuesday morning, along with an order suspending the de minimis rule that has exempted shipments worth less than $800 from tariffs.</p><p class=\"\">White House trade adviser Peter Navarro said this morning that Trump will talk with Chinese leader Xi Jinping later Tuesday about a potential tariff pause, and it's possible that the Trump administration could ultimately avoid tariffs and preserve the de minimis exception with all three countries.</p><p class=\"\">Should the opposite happen, however, the turmoil in aggregate would \"absolutely impact everybody, including the large ad platforms,\" said Youssef Squali, managing director at banking company Truist Financial and head of its internet and digital research group.</p><p class=\"\">Chinese e-commerce giants such as Temu and Shein built enormous businesses around the de minimis exception in recent years, spending billions of dollars on digital advertising to market their low-cost goods to American consumers. Eliminating the rule will force the companies to either raise prices for U.S. buyers or accept lower profits.</p><p class=\"\">\"A suspension of the de minimis exemption poses a risk to ad spend from Chinese e-comm platforms like Temu &amp; Shein,\" Bank of America analysts wrote in a note Monday, describing the change as a negative for the largest digital ad platforms. \"With the exemption removed, their growth could be significantly constrained, potentially leading to cuts [to] marketing budgets.\"</p><p class=\"\">Even if Temu and Shein don't significantly reduce their advertising, a modest cutback would be noticeable at the companies' key platforms including Meta's Facebook and Instagram and Alphabet's YouTube and Google search, said Squali.</p><p class=\"\">Temu spent $2 billion on Meta ads in 2023, The Wall Street Journal has reported.</p><p class=\"\">Temu was the second-largest advertiser on Meta's platforms last month and the seventh largest digital advertiser in the U.S., according to market research firm Sensor Tower.</p><p class=\"\">Other advertisers will also be impacted by the tariffs against China, and even more so if those against Canada and Mexico take effect. Sellers of cars and trucks, household items, sporting goods, computers and agricultural products all rely heavily on imports to build their products, Bank of America noted.</p><p class=\"\">Automakers, for example, spend millions of dollars every year on imports from Mexico, Canada and China in order to build car seats and safety belts, according to research from consulting firm AlixPartners. They had hoped that the administration would grant them a carve-out from the tariffs promised against Mexico and Canada, but no such exception materialized.</p><p class=\"\">The price of each car sold in the U.S. will go up by around $3,000 as a result of the tariffs if they all take effect, and discretionary spending categories like marketing will be the first place automakers look to counter those losses, said Arun Kumar, partner, managing director and global co-leader of the advanced mobility practice at AlixPartners.</p><p class=\"\">The pandemic saw a 20% decline in overall ad spending, Kumar said. The tariffs on China plus those threatened against Canada and Mexico would likely power a 5% to 15% drop, with large car brands slashing brand marketing efforts, especially in traditional formats like print and linear TV, in favor of digital performance campaigns, he said.</p><p class=\"\">\"The long-term equity, brand building, that's going to be the first one they'll kind of dial back because obviously they can live without that,\" Kumar said.</p><p class=\"\">Platforms could weather the tariffs' effects in the long run. Investors believe that Meta, for example, may be well-positioned to absorb the blow given its scale and grip on advertisers, as demonstrated by the company's own price hikes, said Squali of Truist. Meta's price per ad increased 14% in the fourth quarter of 2024 compared with the period a year earlier, according to its most recent earnings.</p><p class=\"\">Brands may also recover from the initial shock of the first stages of Trump's pending trade war. But the general sense of market volatility will affect revenue by discouraging consumers who may have already been hesitant to buy big-ticket items like cars, said Kumar.</p><p class=\"\">\"Net-net, the situation today [for advertisers] does not look as rosy as it did a week ago, when we didn't have these tariffs contemplated in our models,\" said Squali.</p><p class=\"\">Write to Patrick Coffee at patrick.coffee@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008580:0/",
            "pub_date": "2025-02-05 00:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008577:0",
            "title": "Base Metal Prices Rise on Tariff Delay, Weaker U.S. Dollar — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008577:0/",
            "pub_date": "2025-02-05 00:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446595:0",
            "title": "CAC 40 Rises as Earnings Offset Trade Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 climbed 0.7% to close at 7,906 on Tuesday, rebounding from early losses and the prior session’s sharp decline, driven by strong corporate earnings despite lingering trade tensions.</p><p class=\"\">BNP Paribas surged 4.2% after reporting higher earnings and boosting shareholder returns, lifting other major financial stocks.</p><p class=\"\">SImilarly, Dassault Systèmes soared 8.9% following better-than-expected Q4 results.</p><p class=\"\">Meanwhile, luxury mega caps were mixed amid uncertainty over Chinese demand.</p><p class=\"\">On the geopolitical front, U.S. President Trump’s new 10% tariff on Chinese imports took effect, prompting Beijing to retaliate with tariffs on select U.S. exports, including oil, gas, and automobiles, alongside an antitrust probe into Google.</p><p class=\"\">However, Trump delayed imposing 25% tariffs on Mexico and Canada for a month in exchange for commitments on migration and drug trafficking, adding a degree of relief to markets.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446595:0-cac-40-rises-as-earnings-offset-trade-concerns/",
            "pub_date": "2025-02-05 00:49:09",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1PF:0",
            "title": "Vaccine makers fall as Kennedy moves closer to health secretary job",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of vaccine makers fall after President Donald Trump's pick for U.S. health secretary, Robert F. Kennedy Jr., moved closer to the job following a favorable vote by a U.S. Senate panel</p><p class=\"\">** Kennedy, who founded the anti-vaccine group Children's Health Defense, has long sown doubts about the safety and efficacy of vaccines</p><p class=\"\">** Shares of Pfizer  fall 1.5%, Moderna  fall 4.2%, U.S.-listed shares of BioNTech  down 2.5% and Novavax  down 2.3%</p><p class=\"\">** Earlier on Tuesday, Pfizer shares were up 2% in pre-market trading on better-than-expected quarterly results </p><p class=\"\">** Up to the last close, PFE down 2.7%, MRNA down 62.5% in the last 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1PF:0-vaccine-makers-fall-as-kennedy-moves-closer-to-health-secretary-job/",
            "pub_date": "2025-02-05 00:49:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008588:0",
            "title": "ServiceNow Is Maintained at Buy by Citigroup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:50 GMT) </strong>ServiceNow Price Target Cut to $1426.00/Share From $1432.00 by Citigroup</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008588:0/",
            "pub_date": "2025-02-05 00:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSQ2TkQa:0",
            "title": "Empower Federal Credit Union Employs Process-Mapping and Robotic Process Automation with The Lab Consulting to Improve Efficiency, Boost Member Experience, and Enable Higher Levels of Employee Productivity",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Innovative Credit Union Taps The Lab Consulting for End-to-End Process Mapping and Automation Implementation</p><p class=\"\">SYRACUSE, NY / ACCESS Newswire / February 4, 2025 / Empower Federal Credit Union is pleased to announce the results of its recent, ongoing strategic initiative to improve operational efficiency, scalability, end-to-end processes, and experience for its more than 280,000 members and 600 employees.</p><p class=\"\">By recently engaging with Houston-based The Lab Consulting to business-process-map the organization, Empower FCU was able to identify hundreds of valuable process improvements, identify high-value automation use cases, and define an implementation roadmap for self-sustaining their new automation program.</p><p class=\"\">The initiative was extensive, fast paced, and detailed. Thousands of work activities-scrutinized down to the one-to-three-minute-activity level-were mapped. Over 100 Robotic Process Automation (RPA) use cases were identified, business value quantified, and each prioritized for implementation. Additionally, more than 150 industry best practices-spanning people, processes, and technology-were identified as part of the effort.</p><p class=\"\">End-to-end business processes mapped included retail new-account opening; branch operations and support; consumer, mortgage, and commercial loan origination and servicing; card operations; and payments and deposit operations.</p><p class=\"\">Implementation of the identified opportunities was prioritized by benefits across three waves in a \"crawl/walk/run\" cadence, with the first implementation wave already complete. Five select Robotic Process Automation \"bots\" already implemented for Empower FCU, in partnership with The Lab's US-based development team, include: Right-to-Offset, ACH Returns, General-Ledger Balancing, Account Warning Flag Removal, and Delinquent Loan Charge Offs.</p><p class=\"\">\"Our dedication to process improvement is anchored by a commitment to reduce friction for our members and employees. With an established goal to decrease processing times by eliminating manual tasks, we partnered with The Lab and started our continuous improvement journey. Through business-process mapping we've now identified, prioritized, and implemented improvements that allow our team to focus on higher-value work while minimizing tedious tasks,\" said Jen Wolfe, EVP/COO, Empower FCU.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information:</strong></p><p class=\"\">Chris Keller | Chief Marketing Officer</p><p class=\"\">Empower FCU</p><p class=\"\">ckeller@empowerfcu.com</p><p class=\"\">Chris Wilds | Director, Automation</p><p class=\"\">The Lab Consulting</p><p class=\"\">cwilds@thelabconsulting.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Empower FCU</strong></p><p class=\"\">Empower Federal Credit Union is a not-for-profit financial cooperative owned by and operated for its members since its founding in 1939. Since then, Empower FCU has grown to over $3.8 billion in assets, serving more than 280,000 members, with 24 branch locations across upstate New York. To learn more, visit <em>www.empowerfcu.com</em><em>.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About The Lab Consulting</strong></p><p class=\"\">Houston-based The Lab Consulting is a leading provider of process improvement and data standardization for white-collar work, or \"knowledge work.\" The Lab's \"process-first\" approach has accelerated strategic benefits for credit unions and banks with process standardization, robotic process automation (RPA), artificial intelligence (AI), data analytics and more. Since 1993, The Lab has helped businesses worldwide to reclaim capacity, preserve margin and increase sales. Visit <em>thelabconsulting.com.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> The Lab Consulting</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSQ2TkQa:0/",
            "pub_date": "2025-02-05 00:50:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0VC:0",
            "title": "PREVIEW: Advanced Micro Devices shares up; Q4 rev, EPS seen rising",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in chip designer Advanced Micro Devices  up 2.4% ahead of quarterly report due after market close</p><p class=\"\">** Wall Street sees AMD reporting Q4 adj EPS of $1.08 vs $0.77 in year-ago quarter on rev of $7.53 bln vs $$6.17 bln year-ago, according to latest data from LSEG</p><p class=\"\">** In last 8 quarters AMD met or beat the Street on EPS 7 times while its rev met or beat every time</p><p class=\"\">** Investors will closely watch for details of AMD's artificial intelligence strategy with doubts about its place in the AI race, which Nvidia  already dominates while Microsoft , Amazon.com , Meta  are working on custom chips</p><p class=\"\">** Last traded at $117 vs median PT of $166.50 as per LSEG, which shows 51 analyst ratings: 12 'strong buy,' 24 'buy,' 14 'hold' and 1 'sell' recommendation</p><p class=\"\">** AMD shares down ~2.9% YTD after falling 18.1% in 2024 while Philadelphia semiconductor index  down ~0.1% YTD after rising 19.3% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0VC:0-preview-advanced-micro-devices-shares-up-q4-rev-eps-seen-rising/",
            "pub_date": "2025-02-05 00:50:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC69ty9p:0",
            "title": "Zoeta Dogsoul Launches Groundbreaking Dog Knowledge Base",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Game-Changer in Dog Training and Canine Behavior Understanding</p><p class=\"\">Chiang Mai, Thailand--(Newsfile Corp. - February 4, 2025) -  Zoeta Dogsoul, a global pioneer in science-backed dog training and behavioral research, proudly unveils its <strong class=\"root-Tkn6WL2y\">Comprehensive Dog Knowledge Base</strong>-a transformative resource designed to revolutionize the way dog owners, trainers, and enthusiasts understand and connect with their dogs.</p><p class=\"\">Sebastian Stroeller Behavior Expert | Zoeta Dogsoul</p><p class=\"\">With a mission rooted in <strong class=\"root-Tkn6WL2y\">bridging science and soul in dog training</strong>, Zoeta Dogsoul's new knowledge base is not just another collection of dog training tips. Instead, it's an evolving platform that integrates cutting-edge research, time-tested methodologies, and deep behavioral insights to <!-- -->help humans truly understand their canine companions.</p><p class=\"\">Beyond Training: A Holistic Approach to Canine Behavior</p><p class=\"\">\"Our goal has always been to go beyond traditional dog training and tap into the emotional, psychological, and instinctual world of dogs,\" said <strong class=\"root-Tkn6WL2y\">Sebastian Stroeller, CEO of Zoeta Dogsoul.</strong></p><p class=\"\">\"This knowledge base isn't just about training commands-it's about fostering communication, trust, and harmony between dogs and their owners.\"</p><p class=\"\">This comprehensive resource offers <strong class=\"root-Tkn6WL2y\">scientifically-backed insights</strong> into key areas such as: <strong class=\"root-Tkn6WL2y\">Dog Training</strong> - Structured guidance from basic obedience to advanced training techniques (Explore training topics).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Behavioral Science</strong> - Expert analysis of canine psychology, problem-solving, and social intelligence (Understand behavior).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nutrition &amp; Health</strong> - Data-driven dietary recommendations to optimize canine well-being (Dive into nutrition).</p><p class=\"\">Key Highlights of the Zoeta Dogsoul Knowledge Base:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Science-Backed Learning:</strong> Articles, videos, and research-driven content provide real solutions for dog owners (Read: Why the Alpha Dominance Theory is Outdated).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mastering Canine Psychology:</strong> A deep dive into how dogs think, learn, and interact with humans (Master Dog Psychology).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Behavioral Problem-Solving:</strong> Strategies to prevent and manage common dog issues (Preventing &amp; Managing Behavioral Problems).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Evolution of Training Methods:</strong> The history and science behind dog training, from early domestication to modern methods (History of Dog Training).</p><p class=\"\">A Resource for Every Dog Owner, Trainer, and Enthusiast</p><p class=\"\">Designed for accessibility and ease of use, the <strong class=\"root-Tkn6WL2y\">Zoeta Dogsoul Knowledge Base</strong> offers engaging, interactive content for all learning styles. Whether a first-time dog owner, a professional trainer, or a canine behaviorist, users will find <strong class=\"root-Tkn6WL2y\">actionable insights</strong> that <strong class=\"root-Tkn6WL2y\">enhance their connection with dogs</strong> while addressing real-world challenges like behavioral issues, nutrition, and training roadblocks.</p><p class=\"\">With <!-- -->continuous updates, fresh research, and real-world case studies, Zoeta Dogsoul ensures that its knowledge base remains at the forefront of the <!-- -->global dog training and behavioral science landscape.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Experience the Future of Dog Training</strong></p><p class=\"\">Discover the <strong class=\"root-Tkn6WL2y\">Zoeta Dogsoul Comprehensive Dog Knowledge Base</strong> today and unlock the secrets to a <strong class=\"root-Tkn6WL2y\">harmonious, well-trained dog</strong>: Start Learning Now.</p><p class=\"\">Zoeta Dogsoul Center Chiang Mai</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Zoeta Dogsoul</strong></p><p class=\"\">Zoeta Dogsoul is a leading innovator in dog training, behavioral science, and canine education. Through AI-powered technology, expert-led insights, and a deep commitment to understanding the soul of the dog, Zoeta Dogsoul continues to set new standards in dog training worldwide. Available in 95 languages, our AI Training Assistant, Live Training Sessions, and Video-on-Demand features provide unparalleled access to professional dog training anytime, anywhere.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press Inquiries</strong></p><p class=\"\">Zoeta Dogsoul</p><p class=\"\">https://zoeta-dogsoul.com/</p><p class=\"\">Sebastian Stroeller</p><p class=\"\">sebastian@zoeta-dogsoul.com</p><p class=\"\">+66958496783</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239587</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC69ty9p:0-zoeta-dogsoul-launches-groundbreaking-dog-knowledge-base/",
            "pub_date": "2025-02-05 00:41:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC7p34Pl:0",
            "title": "CSE Bulletin: CSE Family Day Schedule",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toronto, Ontario--(Newsfile Corp. - Le 4 février/February 2025) - CSE market and offices will be closed on Monday, February 17, 2025 for Family Day. Regular trading hours for CSE will resume on Tuesday, February 18, 2025. Trade and settlement dates are as follows:</p><p class=\"\">_________________________________</p><p class=\"\">Le marché et les bureaux du CSE seront fermés le lundi 17 février 2025 pour le jour de la Famille. Les heures normales de négociation pour CSE reprendront le mardi 18 février 2025. Les dates de transaction et de règlement sont les suivantes:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Holiday/ Vacances</p></td><td><p class=\"\">Family Day/ Le jour de la Famille</p><p class=\"\">Le 17 février/February 2025</p></td></tr><tr><td><p class=\"\">Trade Date/ Date du commerce</p></td><td><p class=\"\">Le 14 février/February 2025</p></td></tr><tr><td><p class=\"\">Settlement date/Date de règlement</p></td><td><p class=\"\">Le 18 février/February 2025</p></td></tr></tbody></table></div><p class=\"\">If you require further information on the holiday schedule, please contact CSE Market Operations at Marketops@thecse.com or 416-306-0772.</p><p class=\"\">Si vous avez besoin de plus amples informations sur le calendrier des vacances, veuillez contacter les opérations de marché du CSE à Marketops@thecse.com ou au 416-306-0772.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC7p34Pl:0-cse-bulletin-cse-family-day-schedule/",
            "pub_date": "2025-02-05 00:41:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008496:0",
            "title": "PepsiCo on Pace for Largest Percent Decrease Since October 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo, Inc. (PEP) is currently at $143.47, down $6.80 or 4.53%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be lowest close since Jan. 10, 2025, when it closed at $142.64</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent decrease since Oct. 5, 2023, when it fell 5.22%</li><li class=\"listItem-bmN0_SHH\">Currently down three consecutive days; down 5.55% over this period</li><li class=\"listItem-bmN0_SHH\">Worst three day stretch since the three days ending May 20, 2022, when it fell 7.02%</li><li class=\"listItem-bmN0_SHH\">Down 5.65% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 26.85% from its all-time closing high of $196.12 on May 12, 2023</li><li class=\"listItem-bmN0_SHH\">Down 16.30% from 52 weeks ago (Feb. 6, 2024), when it closed at $171.42</li><li class=\"listItem-bmN0_SHH\">Down 21.65% from its 52-week closing high of $183.11 on May 16, 2024</li><li class=\"listItem-bmN0_SHH\">Up 0.58% from its 52-week closing low of $142.64 on Jan. 10, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as low as $143.10; lowest intraday level since Jan. 13, 2025, when it hit $142.14</li><li class=\"listItem-bmN0_SHH\">Down 4.77% at today's intraday low; largest intraday percent decrease since Oct. 5, 2023, when it fell as much as 5.35%</li><li class=\"listItem-bmN0_SHH\">Second worst performer in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 11:40:41 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008496:0/",
            "pub_date": "2025-02-05 00:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008497:0",
            "title": "Croatia Issues 2 Billion Euros in 12-Year Bonds — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emese Bartha</p><p class=\"\">Croatia issued 2 billion euros ($2.07 billion) in February 2037-dated bonds via a bank syndicate on Tuesday, drawing demand in excess of 5 billion euros, one of the joint lead manager banks said.</p><p class=\"\">The books include 175 million euros of joint lead manager demand.</p><p class=\"\">The spread on the bond was set 90 basis points above mid-swaps, the same bank said. The bond has a 3.25% coupon, and it was priced at 99.745, at a yield of 3.276%, the same bank said.</p><p class=\"\">Joint lead managers of the transaction were Erste Group; IMI-Intesa Sanpaolo/PBZ; ING; J.P. Morgan and Morgan Stanley.</p><p class=\"\">Write to Emese Bartha at emese.bartha@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008497:0-croatia-issues-2-billion-euros-in-12-year-bonds-update/",
            "pub_date": "2025-02-05 00:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV11W:0",
            "title": "Aena Proposes Over 1 Bln Euro Investments For Canary Islands Airports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aena SME SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PROPOSES INVESTMENTS SUBSTANTIALLY IN EXCESS OF 1 BILLION EUROS FOR CANARY ISLANDS AIRPORTS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV11W:0-aena-proposes-over-1-bln-euro-investments-for-canary-islands-airports/",
            "pub_date": "2025-02-05 00:42:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446593:0",
            "title": "Sugar Hits 4-week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sugar increased to a 4-week high of 19.59 USd/Lbs.</p><p class=\"\">Over the past 4 weeks, Sugar gained 1.23%, and in the last 12 months, it decreased 16.89%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446593:0-sugar-hits-4-week-high/",
            "pub_date": "2025-02-05 00:42:52",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008502:0",
            "title": "Timken Raised to Neutral From Underperform by B of A Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:43 GMT) </strong>Timken Price Target Raised to $78.00/Share From $73.00 by B of A Securities</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008502:0/",
            "pub_date": "2025-02-05 00:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008498:0",
            "title": "Music Publishers Ask Spotify to Take Down Podcasts Featuring Unlicensed Songs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anne Steele</p><p class=\"\">Music publishers are asking Spotify to remove thousands of unlicensed songs from podcasts on its platform, a massive takedown request spanning work by megastars from Taylor Swift and Kendrick Lamar to Michael Jackson and Prince.</p><p class=\"\">The National Music Publishers' Association, a trade group, said Tuesday it sent notice of more than 2,500 instances of infringement to the streaming service, alleging that songs are being used without permission or compensation. Other artists' with affected songs include Justin Bieber, Carrie Underwood, Linkin Park, Pearl Jam, Travis Scott and Ariana Grande.</p><p class=\"\">\"Music in podcasts should be a revenue source for songwriters and publishers,\" said NMPA Chief Executive David Israelite. The fast-growing genre is ripe for clean up when it comes to its use of unlicensed music, he said.</p><p class=\"\">NMPA said it found widespread infringement, including the use of songs as theme music and the uploading of songs in their entirety as podcasts.</p><p class=\"\">Spotify didn't immediately respond to a request for comment.</p><p class=\"\">The takedown effort includes 19 NMPA member publishers, including Sony Music Publishing, Warner Chappell Music and Universal Music Publishing Group.</p><p class=\"\">NMPA plans to send a new batch of takedowns each week until the issue is resolved.</p><p class=\"\">The takedown requests follow a warning from the trade body last May, when it sent a cease-and-desist letter to Spotify saying that the platform appeared to be engaged in infringement by hosting unlicensed musical works in lyrics, videos and podcasts.</p><p class=\"\">Write to Anne Steele at anne.steele@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008498:0/",
            "pub_date": "2025-02-05 00:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463526:0",
            "title": "Ferrexpo's Ukraine Unit Faces UAH157 Billion Civil Claim for Alleged Illegal Mining",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ferrexpo's  Ukrainian unit is facing a 157 billion-hryvnia civil claim for alleged environmental damages from illegal mining and the sale of subsoil. </p><p class=\"\">The claim seeks joint liability from Ferrexpo Poltava Mining and its general director, according to a Tuesday release from the iron ore pellets producer, and follows a pre-trial investigation that was announced mid-January. </p><p class=\"\">Ferrexpo Poltava reiterated that the claims are without merit and that it will vigorously defend its position in Ukraine's courts.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463526:0/",
            "pub_date": "2025-02-05 00:43:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0VH:0",
            "title": "Two-fer Tuesday: JOLTS, factory orders",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US indexes green, Nasdaq up &gt;1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Energy leads S&amp;P sector gainers; Utilities weakest group</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.2%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar, crude fall; bitcoin down &gt;2%; gold up ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield edges down to ~4.53%</li></ul></span></div><span><p class=\"\">TWO-FER TUESDAY: JOLTS, FACTORY ORDERS</p><p class=\"\">Data released on Tuesday showed tumbling job openings and a bigger-than-expected decline in new orders for U.S. factory-made merchandise.    </p><p class=\"\">Job openings plunged by 6.8% in December to 7.6 million, according to the Labor Department's Job Openings and Labor Turnover Survey (JOLTS) (USJOLT=ECI).</p><p class=\"\">That's 400,000 fewer than analysts expected and goes hand-in-hand with recent survey data on dampening job sentiment.</p><p class=\"\">But Carl Weinberg, chief economist at High Frequency Economics, sees no reason to panic.</p><p class=\"\">Noting that job openings were last this low in September, Weinberg adds \"there is nothing wrong here. No sign of recession can be found.\"  </p><p class=\"\">The JOLTS report, which monitors labor market churn, also showed hires, fires and quits, as percentages of the workforce, held steady.</p><p class=\"\">\"The FOMC will find no cause to rush to cut rates in today’s data,\" Weinberg says. \"The labor market does not need it!\"</p><p class=\"\">Separately, new orders for goods made by U.S. factories (USFORD=ECI) fell by 0.9% in the last weeks of 2024, worse than the -0.7% consensus.</p><p class=\"\">Adding insult to injury, the disappointing number extends November's downwardly revised 0.8% drop.</p><p class=\"\">The downside surprise seems to contradict Monday's PMI data from the Institute for Supply Management, wich showed the manufacturing sector returning to expansion territory after a two-year plus absence.</p><p class=\"\">The Commerce Department's report also revised its crucial core capital goods data, showing an increase of 0.4%, down from the 0.5% gain previously stated.</p><p class=\"\">The metric, which excludes defense and aircraft, is considered indicative of U.S. corporate spending intentions. </p><p class=\"\">(Stephen Culp)</p><p class=\"\">     *****</p><p class=\"\">FOR TUESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">META SHARES POISED FOR RECORD WINNING STREAK ON FACEBOOK'S 21ST BIRTHDAY - CLICK HERE</p><p class=\"\">WALL STREET GAINS EARLY; PALANTIR TECHNOLOGIES RALLIES - CLICK HERE</p><p class=\"\">NASDAQ COMPOSITE: LOTS OF CHOP AS TRIES TO AVOID A BIGGER DROP - CLICK HERE</p><p class=\"\">WATCH OUT INVESTORS, IT'S THE YEAR OF THE SNAKE - CLICK HERE</p><p class=\"\">EQUITIES AND THE EURO: IT'S COMPLICATED - CLICK HERE</p><p class=\"\">A \"FASCINATING\" EARNINGS SEASON AHEAD FOR UK BANKS - CLICK HERE</p><p class=\"\">BACK TO EARNINGS - CLICK HERE</p><p class=\"\">EUROPE BEFORE THE BELL: HERE WE GO AGAIN - CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0VH:0-two-fer-tuesday-jolts-factory-orders/",
            "pub_date": "2025-02-05 00:44:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MU:0",
            "title": "Vaccine, packaged food stocks fall as Kennedy moves closer to health secretary job",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Shares of vaccine makers and packaged food companies fell on Tuesday after President Donald Trump's pick for U.S. health secretary, Robert F. Kennedy Jr., moved closer to the job after a favorable vote by a Senate panel. </p><p class=\"\">The vote by the U.S. Senate Finance Committee paves the way for the full Senate to vote to confirm him as secretary of the U.S. Department of Health and Human Services as soon as this week.</p><p class=\"\">Kennedy, who has faced opposition from health groups and Democrats, has long sown doubts about the safety and efficacy of vaccines that have helped curb disease and prevent deaths for decades. He disputes the anti-vaccine characterization and has said he would not prevent Americans from getting inoculations.</p><p class=\"\">Kennedy said during his run for U.S. president as an independent that he wanted to \"Make America Healthy Again,\" calling out additives, chemicals and sugar used in packaged foods and sodas as culprits for causing chronic illness in the United States.</p><p class=\"\">Pfizer  was down 1.8%, along with U.S. shares of its COVID-19 vaccine partner, BioNTech , , which fell 2%. Moderna  dropped 1.8% and Novavax  slipped 2.3%.</p><p class=\"\">Shares of packaged food companies including Hershey , Mondelez , Kraft Heinz , General Mills  were all down 2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MU:0-vaccine-packaged-food-stocks-fall-as-kennedy-moves-closer-to-health-secretary-job/",
            "pub_date": "2025-02-05 00:44:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE64x4Rx:0",
            "title": "Gray Media Renews InvestigateTV+ and InvestigateTV+ Weekend for 2025-2026 Season",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">ATLANTA, Feb.  04, 2025  (GLOBE NEWSWIRE) —  </strong>Gray Media has renewed its daily, 30-minute news magazine <em>InvestigateTV+</em> for a third season. The renewal naturally followed from continued ratings growth for the program in its second season, including weekly cumulative reach with Adults 18+ is up 5.7% in the first 18 weeks of the 2024-2025 season compared to the same period in 2023-2024 according to Nielsen.   Gray also renewed the weekend edition of the show, <em>InvestigateTV+ Weekend,</em> for 2025-2026, its fifth season.</p><p class=\"\">“<em>InvestigateTV+</em> is setting the standard for original reporting that provides real solutions,” Gray’s Chief Operating Officer Sandy Breland said.   “The increase in audience shows a true appetite for this type of content, and we are thrilled to be able to continue on this mission.” </p><p class=\"\"><em>InvestigateTV+</em> stories made significant impact in season two. An exclusive investigation by Chief Investigator Brendan Keefe uncovered the DEA’s practice of search and seizure of cash assets at airports and eventually led the government to end the practice nationwide.   Reporter Caresse Jackman revealed doubts that a proposed 10-year deadline to remove every lead pipe in America will be met.   Reporter Joce Sterman uncovered mistakes by military doctors and why they are kept hidden from service members and their families. Reporters Kristin Crowley and Heather Graf explored multiple angles of the affordable housing crisis and solutions to make sure everyone has a roof over their head.  </p><p class=\"\">“Our investigations get results. The stories we report everyday affect millions of people, and we are excited to keep delivering on that promise,” said Gray’s Senior Vice President of News Strategy and Innovation and <em>InvestigateTV+</em> Host Lee Zurik.</p><p class=\"\"><em>InvestigateTV+</em> airs in all 113 Gray markets. During this season, the show expanded its footprint into more non-Gray markets. <em>InvestigateTV+ </em>is now cleared in 46% of the U.S daily while <em>InvestigateTV+ Weekend</em> is cleared in 67% of the U.S.</p><p class=\"\">“Our team is excited to get to work on another season of award-winning investigations, consumer and health reporting that help viewers in their daily lives, and stories about real people that inspire us all,” <em>InvestigateTV+</em> Host and Reporter Tisha Powell said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About</strong> <strong class=\"root-Tkn6WL2y\">Gray Media:</strong></p><p class=\"\">Gray Media, Inc.  is a multimedia company headquartered in Atlanta, Georgia. The company is the nation’s largest owner of top-rated local television stations and digital assets serving 113 television markets that collectively reach approximately 36 percent of US television households. The portfolio includes 77 markets with the top-rated television station and 100 markets with the first and/or second highest rated television station, as well as the largest Telemundo Affiliate group with 43 markets totaling nearly 1.5 million Hispanic TV Households.  The company also owns Gray Digital Media, a full-service digital agency offering national and local clients digital marketing strategies with the most advanced digital products and services.  Gray’s additional media properties include video production companies Raycom Sports, Tupelo Media Group, and PowerNation Studios, and studio production facilities Assembly Atlanta and Third Rail Studios. Gray owns a majority interest in Swirl Films. For more information, please visit www.graymedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gray Contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sandy Breland</strong>, Executive Vice President, Chief Operating Officer, 404-266-8333</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE64x4Rx:0-gray-media-renews-investigatetv-and-investigatetv-weekend-for-2025-2026-season/",
            "pub_date": "2025-02-05 00:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr7g1Cmw:0",
            "title": "aXichem updates status regarding completion of Feed Additive application in the EU for phenylcapsaicin",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>aXichem AB<p class=\"\">aXichem AB (publ), developer of innovative natural analogue feed additives and dietary supplement ingredients, announces that the company will increase the number of studies, regarding effect, that form part of the documentation for supplementing aXichem's application for Feed Additive approval in the EU for the company's product phenylcapsaicin as a salmonella-inhibiting additive in chicken feed. The company will conduct one additional effect study and assesses, based on previous positive effect data, that this is the only remaining part for a complete application. The extended studies affect the estimated time of submission to the European Food Safety Authority (EFSA), which the company announced in connection with the presentation of the quarterly report on November 29, 2024.</p><p class=\"\">Torsten Helsing, CEO, comments:</p><p class=\"\">“We have conducted three studies in a clinical environment where chickens were exposed to salmonella at a level that is higher compared to what is seen in an industrial production environment. EFSA's regulations require three studies that demonstrate the product's effect in the use for which the application is intended. Two of the studies show that phenylcapsaicin has a statistically significant salmonella-inhibiting effect, which is very positive. However, study three has given us results that we do not believe meet the criteria for a complete application. Our assessment after analysis is that no changes in the study set up are required, but other factors may have played a role for the study result. We will therefore repeat the study, which will take place as soon as the test facility we have chosen makes it possible. This means that we can submit the additions to EFSA at the earliest when the study has been completed and compiled, and the result contains the data we need for the application. We will notify the market as soon as this happens.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About phenylcapsaicin and aXiphen</strong></p><p class=\"\">The health benefits of chili, with its active ingredient capsaicin have been known for centuries. aXichem’s proprietary molecule, phenylcapsaicin, combines the naturally occurring phenyl group with capsaicin, bridged by a triple bond. The result is an innovative natural analogue capsaicin with high purity, where the pungency is greatly reduced.</p><p class=\"\">Production tests and studies have proven the effectiveness of aXiphen® as an ingredient in poultry feed. A production test on on-floor salmonella prevalence, following the inclusion of 15 ppm phenylcapsaicin in a regular starter diet, was carried out in a full-scale commercial broiler production trial under farming conditions. The production test included about 1.6 million broiler chickens. The trial concluded that under the conditions of the test, the inclusion of 15 ppm phenylcapsaicin in broiler chicken feed statistically significantly reduced the number of farms with salmonella-positive floor boot swabs. The European model for production efficiency, EPEF, showed that breeding efficiency increased by 14% compared to traditional feeding.</p><p class=\"\">The information was submitted, through the care of the contact person below, for publication on 4 February 2025, at 17:45 CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Company contact:</strong></p><p class=\"\">Torsten Helsing, CEO, aXichem AB</p><p class=\"\">Phone: +46 706 863 355 Email: torsten.helsing@axichem.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About aXichem</strong></p><p class=\"\">aXichem develops, patents and markets natural analogue industrial chemicals, i.e., synthetically produced substances that have similar and comparable properties to natural substances. The company's first product is phenylcapsaicin, which the company commercializes under two brands, aXiphen® and aXivite®, as an ingredient in animal feed and dietary supplements, respectively. The business is divided into three market areas with different applications for phenylcapsaicin: as an ingredient in feed for poultry, such as chicken and turkey; as an ingredient in food supplements for gut health, weight control and sports and exercise; and as an ingredient in food supplements for the bio-enhancement of curcumin and melatonin. aXichem is listed on the Nasdaq First North Growth Market. Certified advisor for aXichem is Västra Hamnen Corporate Finance AB.</p><p class=\"\">More information is available at www.axichem.com.</p><p class=\"\">https://news.cision.com/se/axichem-ab/r/axichem-updates-status-regarding-completion-of-feed-additive-application-in-the-eu-for-phenylcapsaic%2Cc4100344</p><p class=\"\">aXichem updates status regarding completion of Feed Additive application in the EU for phenylcapsaicin</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr7g1Cmw:0-axichem-updates-status-regarding-completion-of-feed-additive-application-in-the-eu-for-phenylcapsaicin/",
            "pub_date": "2025-02-05 00:45:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:521336bfe094b:0",
            "title": "European equity close: Spain, Italy and France lead with strong gains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Europe recovered a good portion of the gap that opened the week, though the gains certainly weren't evenly distributed.</p><p class=\"\">Closing changes:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Stoxx 600 +0.3%</li><li class=\"listItem-bmN0_SHH\">German DAX +0.4%</li><li class=\"listItem-bmN0_SHH\">France CAC +0.7%</li><li class=\"listItem-bmN0_SHH\">UK FTSE 100 -0.1%</li><li class=\"listItem-bmN0_SHH\">Spain IBEX +1.5%</li><li class=\"listItem-bmN0_SHH\">Italy's FTSE MIB +1.2%</li></ul><p class=\"\">I would have hoped the FTSE 100 would have done better after Trump yesterday hinted that the UK was safe from tariffs.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1049.6842105263158px;aspect-ratio:1.7494736842105263\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:521336bfe094b-ad8426b81cd9ff5f77f64b1aab55e334-resized.webp\" type=\"images/webp\"/><img alt=\"FTSE 100 daily\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:521336bfe094b-ad8426b81cd9ff5f77f64b1aab55e334-resized.jpeg\" style=\"background-color:#272723\"/></picture></div></figure></span><p class=\"\">FTSE 100 daily</p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:521336bfe094b:0-european-equity-close-spain-italy-and-france-lead-with-strong-gains/",
            "pub_date": "2025-02-05 00:34:56",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NR:0",
            "title": "Cotton rises to near 1-week peak on lower dollar, strong grains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    ICE cotton prices rose more than 1% to their highest level in nearly a week on Tuesday, supported by a weaker U.S. dollar and upbeat sentiment from the grains market seeping into the natural fiber.</p><p class=\"\">* Cotton contracts for March (CTc1) rose 0.72 cent, or 1.09%,  to 66.76 cents per lb at 10:49 a.m. ET (1549 GMT), after it fell to its lowest level since October 2020 on Monday.</p><p class=\"\">* \"The U.S. dollar is turning down. We're also into that seasonal time when we're getting ready to harvest the South American crop and they're seeing some weather adversities down there,\" said Keith Brown, principal at cotton broker Keith Brown and Co in Georgia.</p><p class=\"\">* The U.S. dollar edged lower as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal, a day after he suspended planned measures against Mexico and Canada.      </p><p class=\"\">* A weaker dollar makes greenback-priced cotton more cheaper for overseas buyers.</p><p class=\"\">* Chicago corn future contracts for March were up 1.6% after the suspension of planned U.S. tariffs against Mexico, the biggest importer of U.S. corn. </p><p class=\"\">* A reduction in cotton planting in the northern hemisphere of the U.S. is expected to drive cotton prices higher in the near future, Brown said. </p><p class=\"\">* Elsewhere, the S&amp;P 500 and the Nasdaq gained as megacap stocks stabilized despite ongoing market volatility following China's counter tariffs in response to new U.S. trade restrictions. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NR:0-cotton-rises-to-near-1-week-peak-on-lower-dollar-strong-grains/",
            "pub_date": "2025-02-05 00:36:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309059:0",
            "title": "First Majestic Silver Kept at Sector Perform with a $10.25 Price Target at National Bank of Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">National Bank of Canada on Tuesday reiterated its sector-perform rating on the shares of First Majestic Silver  and its $10.25 price target. </p><p class=\"\">First Majestic recently released drill results from its second-half drill program at the Navidad discovery in Mexico. </p><p class=\"\">The bank said drilling continues to confirm continuity and expand the Navidad mineralization closer to Ermitano. </p><p class=\"\">Highlights include 1,315 grams per tonne (g/t) silver equivalent over 3.2 meters and 808 g/t silver equivalent over 4.8 meters.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309059:0/",
            "pub_date": "2025-02-05 00:37:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309050:0",
            "title": "Royal Caribbean's EPS Estimates Raised After Q4 Earnings Report, UBS Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Royal Caribbean Cruises'  diluted earnings per share estimates have been raised following its Q4 financial results, UBS Securities said in a note Monday. </p><p class=\"\">The firm said it increased its diluted EPS estimates for Royal Caribbean Cruises to $15.27 from $14.48 for 2025, $17.64 from $17.38 for 2026, and $20.33 from $20.04 for 2027. </p><p class=\"\">\"We roll forward our valuation year to 2027, discounted back, to factor in the benefit of RCL's new private destinations including beach clubs and Perfect Day Mexico,\" UBS said in the note. </p><p class=\"\">The brokerage said the company seems to be going \"full speed ahead\" with Perfect Day Mexico despite a looming tax increase there. </p><p class=\"\">UBS lifted its price target on the stock to $301 from $271, and maintained its buy rating.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309050:0/",
            "pub_date": "2025-02-05 00:37:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}