{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0C4:0",
            "title": "Czech retail sales growth strongest since 2022",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Czech retail sales climbed by 6.2% year-on-year in December, posting the strongest rise in almost three years, statistics office data showed on Wednesday.</p><p class=\"\">The pace of growth picked up from 4.2% year-on-year in November and was more than 2 percentage points above a Reuters poll forecast.</p><p class=\"\">Revived consumer demand has been the main growth driver for the Czech economy, as for other central European countries, as soft demand from euro zone trade partners weighs on the region's manufacturers.</p><p class=\"\">\"(The data) confirms the combination of low inflation and solid nominal wage growth... creates a favourable environment for the revival of retail sales and household consumption in general,\" Radomir Jac, chief economist at Generali Investments CEE, said.</p><p class=\"\">Czech retail sales have climbed each month since December 2023 after falling for around a year-and-a-half before that as high inflation crushed demand. The rise in December was the biggest since January 2022.</p><p class=\"\">In month-on-month terms, retail sales increased by 1.2% in December, the statistics office said, giving a rise for the full-year 2024 of 4.6%.</p><p class=\"\">The Czech National Bank meets on Thursday and analysts expect it to renew interest rate cuts after it paused the easing cycle in December due to lingering inflation pressures, especially in the services sector. </p><p class=\"\">The bank has cut its main rate to 4.00% from 7.00% since late 2023.</p><p class=\"\">Inflation in December accelerated less than expected, to 3.0% year-on-year, which helped increase bets on another rate cut. Preliminary price data for January will be published on Thursday morning, before the central bank's rate decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0C4:0-czech-retail-sales-growth-strongest-since-2022/",
            "pub_date": "2025-02-05 16:47:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0BM:0",
            "title": "Major Gulf markets ease as Trump's Gaza remarks spark concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Major stock markets in the Gulf were subdued in early trade on Wednesday, reacting to U.S. President Donald Trump's stunning statement about taking control of the war-ravaged Gaza Strip and revamping its economy once Palestinians are relocated elsewhere.</p><p class=\"\">The announcement followed Trump's shock proposal for the permanent resettlement of the more than two million Palestinians from Gaza to neighboring countries, calling the enclave - where the first phase of a fragile Israel-Hamas ceasefire and hostage release deal is in effect - a \"demolition site.\"</p><p class=\"\">Saudi Arabia's benchmark index  eased 0.1% in choppy trade, with SABIC Agri-Nutrients Company  losing 2.6%.</p><p class=\"\">The kingdom rejects any attempts to displace the Palestinians from their land and would not establish ties with Israel without the creation of a Palestinian state, Saudi Arabia's foreign ministry said.</p><p class=\"\">The United States had led months of diplomacy to get Saudi Arabia, one of the most powerful and influential Arab states, to normalise ties with Israel and recognise the country. </p><p class=\"\">Dubai's main share index  lost 0.2%, hit by a 1.1% fall in blue-chip developer Emaar Properties .</p><p class=\"\">In Abu Dhabi, the index  fell 0.1%, with the country's biggest lender First Abu Dhabi Bank  ahead of its earnings announcement.</p><p class=\"\">The United Arab Emirates' foreign trade touched 3 trillion dirhams ($817 billion) for the first time by the end of 2024, Prime Minister and Dubai ruler Sheikh Mohammed bin Rashid Al Maktoum said in a post on X on Wednesday.</p><p class=\"\">Meanwhile, the UAE's non-oil private sector continued to expand robustly at the start of 2025, although capacity pressures and competitive challenges posed headwinds, a survey showed on Wednesday.</p><p class=\"\">The Qatari benchmark  lost 0.3%, with the Gulf's biggest lender Qatar National Bank  dropping 0.5%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0BM:0-major-gulf-markets-ease-as-trump-s-gaza-remarks-spark-concerns/",
            "pub_date": "2025-02-05 16:47:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002486:0",
            "title": "MotorK Announces Lower-Than-Expected Q4 and FY 2024 CARR",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MotorK Announces Lower-Than-Expected Q4 and FY 2024 CARR</p><p class=\"\">LONDON--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Regulatory News:</p><p class=\"\">MotorK PLC (AMS: MTRK) (\"MotorK\", the \"Group\" or the \"Company\"), a leading SaaS provider to the automotive retail industry in the EMEA region, today announced that its Committed Annual Recurring Revenues(1) (CARR) for the fourth quarter 2024 and the full financial year 2024 are lower than previously expected.</p><p class=\"\">European automotive uncertainty and macroeconomics have influenced decision-making among large retailers and manufacturers, impacting MotorK's CARR in two key ways:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Several high-value deals originally expected to close by year-end 2024   have been deferred into 2025 and remain under negotiation.     </li><li class=\"listItem-bmN0_SHH\">Client-signed and yet-to-be-delivered deals have experienced delays or   have been subject to renegotiation.   </li></ul><p class=\"\">In response, MotorK has adopted a more conservative criteria of CARR to better reflect the evolving business environment. This adjustment has resulted in a reduction in reported CARR, with deals that no longer meet the revised criteria being reclassified into the company's pipeline. As a result:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">MotorK's CARR for the fiscal year ending 31 December 2024 are expected   to be approximately 15% below the guidance of EUR 45-50 million, as   previously communicated.     </li><li class=\"listItem-bmN0_SHH\">MotorK's sales pipeline exceeded EUR24 million on 31 December 2024,   reinforcing the company's strong commercial momentum and future revenue   potential.   </li></ul><p class=\"\">MotorK remains confident in its long-term growth strategy and continues to execute on its commitment to driving innovation and delivering value to its customers and shareholders.</p><p class=\"\">Forward-looking information and disclaimer</p><p class=\"\">This press release may include forward-looking statements. Other than reported financial results and historical information, all statements included in this press release, including, without limitation, those regarding our financial position, business strategy and management plans and objectives for future operations, may be deemed to be forward-looking statements. Without limitation, any statements preceded or followed by or that include the words \"targets\", \"plans\", \"believes\", \"expects\", \"aims\", \"intends\", \"anticipates\", \"estimates\", \"projects\", \"will\", \"may\", \"would\", \"could\" or \"should\", or words or terms of similar substance or the negative thereof, are forward-looking statements. These forward-looking statements are based on our current expectations, projections and key assumptions about future events and are subject to risks and uncertainties that could cause actual results to differ materially from those expressed in the forward-looking statements. Many of these risks and uncertainties relate to factors that are beyond MotorK's ability to control or estimate precisely, such as future market conditions, the behavior of other market participants and the actions of governmental regulators. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release and are subject to change without notice. Other than as required by applicable law or the applicable rules of any exchange on which our securities may be traded, we expressly disclaim any obligation or undertaking to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise.</p><p class=\"\">Important information</p><p class=\"\">This press release contains information within the meaning of Article 7(1) of the Market Abuse Regulation (596/2014).</p><p class=\"\">ABOUT MOTORK PLC</p><p class=\"\">MotorK (AMS: MTRK) is a leading software as a service (\"SaaS\") provider for the automotive retail industry in the EMEA region, with approximately 400 employees and ten offices in seven countries (Italy, Spain, France, Germany, Belgium, the UK, and Israel). MotorK empowers car manufacturers and dealers to improve their customer experience through a broad suite of fully integrated digital products and services. MotorK provides its customers with an innovative combination of digital solutions, SaaS cloud products and the largest R&amp;D department in the automotive digital sales and marketing industry in Europe. MotorK is a company registered in England and Wales. Registered office: 5th Floor One New Change, London, England, EC4M 9AF - Company Registration: 9259000. For more information: www.motork.io or investors.motork.io.</p><p class=\"\">(1) Committed ARR (\"CARR\") includes ARR and Committed Recurring Revenues (\"CRR\"). CRR refers to signed contracts to be delivered and billed. Annual Recurring Revenues (\"ARR\") are defined as the yearly subscription value of the customer base at the end of the reporting period.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205207682/en/</p><p class=\"\">CONTACT:    FOR FURTHER INFORMATION</p><p class=\"\">MotorK Investor Relations</p><p class=\"\">Boaz Zilberman</p><p class=\"\">boaz.zilberman@motork.io</p><p class=\"\">+972 532 819 810</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002486:0/",
            "pub_date": "2025-02-05 16:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463886:0",
            "title": "Kingkey Financial International Extends the Completion Date for Completing Proposed Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kingkey Financial International (Holdings)  extended the completion date to Feb. 11 to allow for the completion of its proposed acquisition of the target company's sale shares, according to a Tuesday filing with the Hong Kong bourse. </p><p class=\"\">Initially, four business days were needed after fulfilling conditions on Jan. 24 to allow more time for administrative procedures. All other terms of the agreement remain unchanged.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463886:0/",
            "pub_date": "2025-02-05 16:48:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0TZ:0",
            "title": "Vestas slides after 2025 profit guidance misses expectation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Vestas  slip around 3% after the Danish wind turbine maker guided for a lower than expected profit in 2025, despite Q4 results coming in above</p><p class=\"\">** It sees operating profit margin before special items of 4-7% in 2025, which Jefferies says is around 130 basis points below expectations at mid-point</p><p class=\"\">** J.P.Morgan also notes that the guidance for service-adjusted EBIT of 700 mln euros came in below the estimate of 737 million</p><p class=\"\">** \"This may bring some disappointment to bulls who were hoping for a positive surprise given it was not that long ago Vestas was aiming for a 10% margin in 2025,\" it says</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0TZ:0-vestas-slides-after-2025-profit-guidance-misses-expectation/",
            "pub_date": "2025-02-05 16:48:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463883:0",
            "title": "Kyushu Railway Records 8% Lower Attributable Net Income for Nine Months to December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kyushu Railway  recorded a net income attributable to owners of the parent of 37.4 billion yen for the nine months ended Dec. 31, 2024, 8.2% lower than 40.7 billion yen logged for the same period a year ago. </p><p class=\"\">The company's basic net income per share for the reporting period decreased to 238.81 yen from 259.19 yen per share a year ago, according to a Tuesday filing with the Tokyo Exchange. </p><p class=\"\">Operating revenue of the rail services company came in at 321.9 billion yen, 9.9% higher than 292.9 billion yen a year earlier. </p><p class=\"\">It forecasted an attributable net income of 42.2 billion yen, net income per share of 269.46 yen, operating revenue of 441.1 billion yen, and a final dividend of 46.50 yen per share for the fiscal year ending March. 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463883:0/",
            "pub_date": "2025-02-05 16:48:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0RS:0",
            "title": "OpenAI's Altman meets with India IT minister to discuss country's AI plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    OpenAI Chief Executive Sam Altman met with India's IT Minister Ashwini Vaishnaw on Wednesday and discussed India's plan of creating a low-cost AI ecosystem.</p><p class=\"\">Vaishnaw said in a post on X that he had a \"super cool discussion\" with Altman on India's \"strategy of creating the entire AI stack - GPUs, model, and apps\" and that OpenAI was willing to collaborate on all three.</p><p class=\"\">Altman's India visit, his first since 2023, comes at a time when the company faces legal challenges in the country, its second-largest market by number of users.</p><p class=\"\">Vaishnaw last week praised Chinese startup DeepSeek for shaking up the sector with its low-cost AI assistant, likening its frugal approach to his government's efforts to build a localised AI model.</p><p class=\"\">\"Our country sent a mission to the moon at a friction of the cost that many other countries did right, why can't we do a model that will be a fraction of the cost that many others do?\" Vaishnaw said in a video of part of the discussion with Altman that he posted.</p><p class=\"\">Altman's trip to India follows visits to Japan and Korea. He clinched deals with SoftBank Group  and Kakao . In Seoul, he also held talks with SoftBank and Samsung about the Stargate AI data centre project that has been backed by U.S. President Donald Trump.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0RS:0-openai-s-altman-meets-with-india-it-minister-to-discuss-country-s-ai-plans/",
            "pub_date": "2025-02-05 16:48:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW024:0",
            "title": "Spain's Competition Watchdog Fines Endesa, Naturgy For Omitting Relevant Information In Bills",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SPAIN'S COMPETITION WATCHDOG CNMC: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FINES ENDESA  AND NATURGY  1.2 MILLION EUROS FOR OMITTING RELEVANT INFORMATION FOR CONSUMERS IN THEIR BILLS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ENDESA ENERGIA AND NATURGY IBERIA WERE FINED 600,000 EUROS EACH</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW024:0-spain-s-competition-watchdog-fines-endesa-naturgy-for-omitting-relevant-information-in-bills/",
            "pub_date": "2025-02-05 16:48:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0BS:0",
            "title": "Huawei chairman says 2024 revenue exceeded $118 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Huawei's chairman said on Wednesday that the tech company's annual revenue exceeded 860 billion yuan ($118.27 billion) last year, as it continued to shake off the impact of U.S. sanctions and its consumer business returned to growth. </p><p class=\"\">Liang Hua made the remarks at a forum in Guangzhou, according to a report by the Shenzhen Business Daily, which was confirmed by a Huawei spokesperson.</p><p class=\"\">Annual revenue of 860 billion yuan would mark 22% year-on-year-growth from 2023, when Huawei reported 704.2 billion yuan in revenue. The company also reported its fastest growth in four years that year. </p><p class=\"\">\"In 2024, Huawei's overall operations will meet expectations, ICT infrastructure will remain stable, consumer business will return to growth, and the smart car solution business will develop rapidly, with annual sales revenue exceeding 860 billion yuan,\" Liang was quoted as saying. </p><p class=\"\">Huawei's consumer business has made a strong comeback since August 2023, when it launched new phones with locally-made chipsets that defied U.S. sanctions. Last year, it grabbed a 16% share of the Chinese smartphone market, overtaking Apple , according to data from Canalys. </p><p class=\"\">($1 = 7.2715 Chinese yuan renminbi)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0BS:0-huawei-chairman-says-2024-revenue-exceeded-118-bln/",
            "pub_date": "2025-02-05 16:49:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002500:0",
            "title": "Pandora's Results Are a Mixed Bag — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pandora's results are broadly mixed, with 4Q performance in line with expectations but guidance softer than anticipated, RBC Capital Markets analyst Piral Dadhania says in a note. The Danish jeweler reported revenue of 11.97 billion Danish kroner ($1.67 billion) for the final quarter of 2024, up 11% organically on year. Analysts had forecast revenue of 11.85 billion kroner, according to company-compiled consensus. However, the group's guidance of organic revenue growth between 7% and 8% in 2025 is slightly softer than expected, which could prompt low-single-digit earnings revisions, the analyst says. The company expects the EBIT margin target by 2026 at the lower end of the 26% to 27% range, which will likely be received with some caution, Dadhania says. Shares are down 1.3% at 1,356.50 kroner. (andrea.figueras@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002500:0/",
            "pub_date": "2025-02-05 16:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0UH:0",
            "title": "Bechtle jumps as Q4 profitability surprises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Bechtle  jump 4% after the German IT service provider posts a 'positive surprise' in terms of Q4 profitability, citing a slight uptick in momentum, particularly in December</p><p class=\"\">** \"We want to highlight the pick-up of the business volume momentum that increased by approximately 4% yoy,\" Baader Helvea says</p><p class=\"\">** \"Profitability surprises positively,\" Jefferies says</p><p class=\"\">** The broker says the results suggest the worst is likely behind, adding though the first half of 2025 will remain tough due to snap elections in Germany</p><p class=\"\">** The stock sits at the top of the German mid-cap index , with shares on track for the best day in a year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0UH:0-bechtle-jumps-as-q4-profitability-surprises/",
            "pub_date": "2025-02-05 16:50:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWT0:0",
            "title": "French service sector downturn deepens in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    France's service sector contracted faster than first estimated in January, with business activity declining for the fifth consecutive month amid persistent demand weakness and political uncertainty, a survey reported on Wednesday.</p><p class=\"\">The HCOB France Services Purchasing Managers' Index (PMI), compiled by S&amp;P Global, fell to 48.2 in January from 49.3 in December, moving further below the 50.0 threshold that separates growth from contraction. January's flash services PMI had come in at 48.9 points.</p><p class=\"\">Weaker client demand and political uncertainty were cited as factors weighing on output.</p><p class=\"\">\"Political uncertainty dampened activity, according to some panel members, while others attributed the slowdown to weaker customer demand and reduced confidence in the economic outlook,\" said Tariq Kamal Chaudhry, economist at Hamburg Commercial Bank.</p><p class=\"\">France has been mired in political instability since President Emmanuel Macron called a snap election last June that delivered a hung parliament just as an unexpected hole in the public finances emerged.</p><p class=\"\">Employment in the services sector in January fell at the fastest rate since October 2020, with companies citing the non-replacement of voluntary leavers and expiration of temporary contracts as reasons for job cuts. </p><p class=\"\">Business confidence sank to a 56-month low, reflecting uncertainty over the domestic political climate.</p><p class=\"\">Despite intensifying cost pressures, with input prices rising at the quickest pace in five months, service providers cut their prices for the first time since April 2021, driven by lower interest rates and efforts to remain competitive.</p><p class=\"\">The survey also highlighted a modest decline in new business, with export orders showing signs of stabilisation.</p><p class=\"\">However, firms remained cautious about the outlook, with expectations for future activity at their weakest since May 2020.</p><p class=\"\">The French government faces pressure to create political stability to prevent further disruptions in the labour market, as noted by Chaudhry.</p><p class=\"\">The final composite PMI figure for January - which comprises both the services and manufacturing sectors - was also several notches lower than first thought, at 47.6 points from 47.5 points in December and 48.3 points initially estimated. It is also below the 50-threshold for a fifth month in a row.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWT0:0-french-service-sector-downturn-deepens-in-january-pmi-shows/",
            "pub_date": "2025-02-05 16:50:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0YJ:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar . Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS:</p><p class=\"\">MODI SHAFRIR, CHIEF STRATEGIST FOR FINANCIAL MARKETS, BANK HAPOALIM, TEL AVIV:</p><p class=\"\">    \"The risks to Israel will decline in the short term and that’s good for the shekel and local markets and also since it appears the coalition will not fall apart.\"  </p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">\"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"</p><p class=\"\">PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"</p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0YJ:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 16:50:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0VR:0",
            "title": "Iceland's central bank cuts policy interest rate to 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Iceland's central bank cut its key policy interest rate to 8.0% from 8.5% on Wednesday and said inflation has continued to fall.</p><p class=\"\">\"Underlying inflation has eased ... and is at its lowest in three years. The outlook is for continued disinflation in coming months,\" the bank's monetary policy committee said in a statement.</p><p class=\"\">    Wednesday's cut was the third     since October    , when the central bank began an easing cycle from a high of 9.25%.  </p><p class=\"\">    The bank had been raising the cost of borrowing since mid-2021 to tackle inflation, lifting the main rate from a low of 0.75%.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0VR:0-iceland-s-central-bank-cuts-policy-interest-rate-to-8/",
            "pub_date": "2025-02-05 16:41:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0FU:0",
            "title": "Weak macro, less contracts to hit 'volatile' Worldline, JPM says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** J.P. Morgan sees Worldline  entering H1 this year burdened by weak consumer market growth in Europe and contract losses, expecting lower earnings across the board</p><p class=\"\">** It urges the French payments group to finalise its decision on company leadership, with a new strategic plan following</p><p class=\"\">** \"Till that strategic plan is announced, the stock is going to remain volatile and is unlikely to substantially break out of its range,\" JPM says</p><p class=\"\">** Only a turnaround in consumer markets or major contract wins for Worldline can change the sentiment, it adds</p><p class=\"\">** Broker sharply cuts its TP by 40% to 8.10 euros ($8.41) from 13.50 euros to adjust to its updated near-term result forecasts</p><p class=\"\">** Out of 21 analysts that cover Worldline, five rate the stock \"strong buy\" or \"buy,\"​ 14 \"hold\" and two​ rate the stock \"strong sell\" or \"sell\"</p><p class=\"\">($1 = 0.9627 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0FU:0-weak-macro-less-contracts-to-hit-volatile-worldline-jpm-says/",
            "pub_date": "2025-02-05 16:42:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002453:0",
            "title": "LG CNS Makes Weak Debut in South Korea — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">LG CNS, an information-technology services affiliate of conglomerate LG Group, made a weak debut in South Korea after the country's biggest initial public offering in three years.</p><p class=\"\">The lackluster listing reflects South Korea's sluggish IPO market and the gloom in the wider equities market. The stock benchmark Kospi has been down more than 3% over the past 12 months.</p><p class=\"\">Shares of LG CNS fell 9.9% to close at 55,800 won, equivalent to $38.44, after opening at 60,500 won in their first day of trading on the Kospi stock exchange Wednesday. The Kospi ended 1.1% higher.</p><p class=\"\">Throughout the session, the shares remained below their IPO price of 61,900 won, the top end of their marketed price rage.</p><p class=\"\">The company, through an oversubscribed share sale in January, raised around $825 million. That marked the largest IPO in South Korea since 2022, when battery maker LG Energy Solution raised more than $10 billion.</p><p class=\"\">LG CNS's estimated market value shrank to $3.72 billion from $4.13 billion over the course of the day after the stock's poor performance.</p><p class=\"\">The IPO market has been sluggish since the second half of 2024 in South Korea, Seoul-based Samsung Securities analyst Changhe Lee said in a recent note.</p><p class=\"\">Most of the country's newly listed companies in January set their IPO prices at the bottom of marketed ranges, and their shares opened below their IPO price, he said.</p><p class=\"\">LG CNS said it plans to use the offering's proceeds for facility investments, acquisitions of other IT firms and debt repayment.</p><p class=\"\">Revenue at the company rose 13% to 5.605 trillion won in 2023, while operating profit was up 12% at 464.05 billion won.</p><p class=\"\">LG Corp., the holding company for LG Group, has a 45% stake in LG CNS.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002453:0/",
            "pub_date": "2025-02-05 16:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463866:0",
            "title": "Hanwha Ocean Delivers Wind Turbine Vessel to Denmark-based Cadeler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hanwha Ocean  delivered Wind Maker, an offshore wind turbine installation vessel (WTIV) to Denmark-based construction engineering company Cadeler on Jan. 31, a month ahead of schedule, Hanwha Ocean said in a LinkedIn post on Tuesday. </p><p class=\"\">The Wind Maker, a 148-meter-long vessel with a lifting capacity of 2,600 metric tons, can install five 15-megawatt turbines in waters up to 65 meters deep. The vessel will begin its initial operations at Taiwan's Changhua country offshore windfarm, according to the post. </p><p class=\"\">Shares of Hanwha Ocean fell more than 1% at market close on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463866:0/",
            "pub_date": "2025-02-05 16:43:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309531:0",
            "title": "Nokia Enters Four-Year Deal Extension With Orange France",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nokia  said Wednesday it has extended its partnership with Orange France with a new four-year contract to upgrade the latter's 5G radio infrastructure with Nokia's AirScale portfolio. </p><p class=\"\">Financial terms were not disclosed. </p><p class=\"\">Orange will also test Nokia's 5G cloud RAN offerings, the company said, adding that it will also provide its MantaRay NM AI-powered radio network management tool.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309531:0/",
            "pub_date": "2025-02-05 16:43:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0VL:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar =&gt;. Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS: </p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">    \"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"  </p><p class=\"\">    PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:  </p><p class=\"\">    \"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"  </p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0VL:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 16:44:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW0CF:0",
            "title": "TotalEnergies beats expectations for fourth-quarter profit, signals stronger 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Q4 profit of $4.4 billion beats estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Group reports stronger power sales, LNG trading</li></ul></span></div><span><p class=\"\">    French oil major TotalEnergies  beat expectations for fourth-quarter earnings on Wednesday as higher trading profits in the gas market helped it offset some of the impact of low oil prices and weak fuel demand.</p><p class=\"\">Adjusted net income for the final three months of 2024 was $4.4 billion, down 15% from $5.2 billion a year previously but slightly higher than the third quarter's $4.1 billion. The results beat expectations for $4.2 billion, according to an analyst consensus compiled by LSEG.</p><p class=\"\">The company said it expects higher gas prices, upstream production and power sales in early 2025. Its shares were up 1.3% at 0842 GMT. </p><p class=\"\">CEO Patrick Pouyanne said at a press briefing that he expects the company to be able to continue investing in renewable energy in the U.S., and added that exports of U.S. LNG are set to practically double in the coming years.</p><p class=\"\">The French firm is the U.S.'s largest LNG exporter with more than 10 million tons under contract.</p><p class=\"\">Total announced a 7% increase in the 2024 dividend to 3.22 euros per share, and for 2025 confirmed share buybacks of $2 billion per quarter.</p><p class=\"\">RBC analyst Biraj Borkhataria said Total's announced dividend growth was \"higher than we anticipated\", and added that the reported 8% gearing \"should allay any concerns around debt levels\".</p><p class=\"\">Western oil majors are facing reduced economic activity and competition from new African and Asian refineries, which caused profit margins for converting crude oil into fuel products to collapse last year. The trend is expected to continue in 2025.</p><p class=\"\">Total's European refining margin for the fourth quarter was $25.90 per metric ton — half the $50.10 realized in late 2023 — while crude oil prices were nearly $10 per barrel lower than the previous year.</p><p class=\"\">Last week Shell, Chevron and ExxonMobil all reported fourth-quarter earnings hard hit by the downturn in refining margins.</p><p class=\"\">Total was able to end the year on a higher note thanks to its integrated LNG division, where traders captured higher profits due to market volatility and boosted earnings by 35% to $1.4 billion. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:656.4617314930991px;aspect-ratio:1.0941028858218318\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L6N3OW0CF-73404401489026fa9eec9ea2a87b6ad8-resized.webp\" type=\"images/webp\"/><img alt=\"A view of quarterly adjusted net income from Paris-listed energy company TotalEnergies from 2019 to 2024.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L6N3OW0CF-73404401489026fa9eec9ea2a87b6ad8-resized.jpeg\" style=\"background-color:#f7e7dc\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">TotalEnergies' quarterly profits, 2019-2024</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW0CF:0-totalenergies-beats-expectations-for-fourth-quarter-profit-signals-stronger-2025/",
            "pub_date": "2025-02-05 16:44:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0LA:0",
            "title": "Goldman Sachs moves Generali to 'neutral' after strong price rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Goldman Sachs cuts Italy's Generali  to \"neutral\" from \"buy\" as it says its valuation no longer stands out after a \"strong\" share price performance</p><p class=\"\">** The share price performance of Italy's top insurer has seen a 20% increase since mid Sept. 2024, outperforming the 4% increase of the FTSE World Europe (.FTAWEXUKSR) index, GS says</p><p class=\"\">** Its 2026 total capital return yield estimate is at 6.6%, below peers Allianz  and Axa , the broker notes </p><p class=\"\">** Generali's spread over home country 10-year government bond yields is the narrowest in comparison with its peers, it adds</p><p class=\"\">** Out of 21 analysts that cover Generali, seven rate the stock \"strong buy\" or \"buy\", ​nine rate \"hold\" and five​ rate the stock \"strong sell\" or \"sell\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0LA:0-goldman-sachs-moves-generali-to-neutral-after-strong-price-rally/",
            "pub_date": "2025-02-05 16:44:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463881:0",
            "title": "China's Central Bank Conducts Nearly 700-Billion-Yuan Reverse Repo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's central bank on Wednesday conducted a 697-billion-yuan reverse repo operation via a fixed-rate tender. </p><p class=\"\">The operation had a seven-day term with an interest rate of 1.50%, according to a Wednesday filing with the People's Bank of China.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463881:0/",
            "pub_date": "2025-02-05 16:44:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002465:0",
            "title": "Singapore's Retail Sales Likely to Perform Better in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's retail sales will likely pick up this year, says OCBC's Selena Ling. Retail sales contracted 2.9% on year in December, marking its worst performance since February 2022, she writes. But with the Singapore Tourism Board expecting 17 million-18.5 million visitors this year that could generate S$29 billion to S$30.5 billion in revenue, things look brighter for the retail sector. Domestic consumption is also expected to be supported by a resilient labor market, Ling says. However, she cautions that external headwinds pose as a key risk for the retail sector, and a challenging trade environment may dampen near-term market sentiment. OCBC expects Singapore's retail sales to expand around 2% in 2025 compared to 2024's 1.2% and 2023's 2.3%.(amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002465:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002464:0",
            "title": "Hong Kong Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in HK$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Aluminum Corp China             5.09       4.97      +0.12      +2.41 <br/>  Bank of China                   4.07       4.09      -0.02      -0.49 <br/>  Bank of Communications          6.29       6.29       unch       unch <br/>  Bank of East Asia               9.94       9.91      +0.03      +0.30 <br/>  BOC Hong Kong (Holdings)       25.35      25.40      -0.05      -0.20 <br/>  Cafe de Coral Holdings          7.51       7.56      -0.05      -0.66 <br/>  Cathay Pacific Airways         10.10      10.44      -0.34      -3.26 <br/>  China Coal Energy               8.94       9.06      -0.12      -1.32 <br/>  China Construction Bank         6.32       6.41      -0.09      -1.40 <br/>  China Life Insurance           14.44      14.74      -0.30      -2.04 <br/>  China Merchants Port           12.84      12.88      -0.04      -0.31 <br/>  China Mobile                   75.70      76.50      -0.80      -1.05 <br/>  China Overseas Land &amp; Inv      12.00      12.26      -0.26      -2.12 <br/>  China Petro &amp; Chem              4.29       4.30      -0.01      -0.23 <br/>  China Rscs Beer Holdings       23.55      24.25      -0.70      -2.89 <br/>  China Resources Land           22.90      23.15      -0.25      -1.08 <br/>  China Resources Power          17.24      17.28      -0.04      -0.23 <br/>  China Shenhua Energy           31.40      31.70      -0.30      -0.95 <br/>  China Unicom (Hong Kong)        7.15       7.29      -0.14      -1.92 <br/>  CITIC                           8.78       8.94      -0.16      -1.79 <br/>  CK Hutchison Holdings          38.50      39.05      -0.55      -1.41 <br/>  CLP Holdings                   63.95      64.60      -0.65      -1.01 <br/>  CNOOC                          18.56      18.76      -0.20      -1.07 <br/>  COSCO SHIPPING Ports            4.45       4.40      +0.05      +1.14 <br/>  Esprit Holdings                 0.12       0.12       unch       unch <br/>  FIH Mobile                      0.85       0.84      +0.01      +1.19 <br/>  Hang Lung Properties            6.00       6.09      -0.09      -1.48 <br/>  Hang Seng Bank                 97.90      98.85      -0.95      -0.96 <br/>  Henderson Land Devt            21.65      22.00      -0.35      -1.59 <br/>  Hong Kong &amp; China Gas           5.93       5.95      -0.02      -0.34 <br/>  HK Exchanges &amp; Clearing       305.80     312.00      -6.20      -1.99 <br/>  Hong Kong Tech Venture          1.28       1.28       unch       unch <br/>  HSBC Holdings                  80.20      80.05      +0.15      +0.19 <br/>  i-CABLE Communications          0.03       0.03       0.00      -3.45 <br/>  Ind &amp; Comml Bk of China         5.36       5.39      -0.03      -0.56 <br/>  Manulife Financial            230.00     229.00      +1.00      +0.44 <br/>  Mongolia Energy                 0.55       0.55       unch       unch <br/>  MTR                            24.35      24.65      -0.30      -1.22 <br/>  New World Development           4.08       4.18      -0.10      -2.39 <br/>  PetroChina                      6.01       6.05      -0.04      -0.66 <br/>  Ping An Ins of China           43.55      44.00      -0.45      -1.02 <br/>  Power Assets Holdings          50.05      50.25      -0.20      -0.40 <br/>  Sino Land                       7.44       7.50      -0.06      -0.80 <br/>  SINOPEC Shg Petrochem H         1.19       1.20      -0.01      -0.83 <br/>  Sun Hung Kai Properties        69.75      71.15      -1.40      -1.97 <br/>  Swire Pacific A                65.25      67.20      -1.95      -2.90 <br/>  Tencent Holdings              417.80     420.80      -3.00      -0.71 <br/>  Tsingtao Brewery               49.00      48.95      +0.05      +0.10 <br/>  VTech Holdings                 51.45      51.35      +0.10      +0.19 <br/>  Wharf (Holdings)               18.68      19.44      -0.76      -3.91 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002464:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002466:0",
            "title": "DCC's Healthcare Disposal Could Unlock Significant Shareholder Value — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DCC's process to sell its healthcare segment, in order to focus on the energy sector, could significantly boost returns to shareholders, Davy Research analyst Colin Grant says. The Irish research firm forecasts that DCC could receive 1.365 billion pounds for the division. This is more than 15 times the FY 2025 Ebitda expectations of 88 million pounds, the analyst adds in a note. Assuming that most of the cash will be returned to shareholders, this means that the disposal will unlock significant value as the deal could be far ahead of DCC's current valuation, Grant adds. DCC said in its third-quarter update that the disposal is progressing in line with expectations, the analyst says. Shares are down 2.4% at 53.65 pounds. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002466:0/",
            "pub_date": "2025-02-05 16:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSX:0",
            "title": "Italian services sector growth slows, employment drops, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Italy's services sector grew marginally in January but underlying demand conditions remained weak and employment levels decreased, a survey showed on Wednesday.</p><p class=\"\">The HCOB Global Purchasing Managers' Index for services edged down to 50.4 in January from 50.7 in December, remaining just above the 50 mark that separates growth from contraction.</p><p class=\"\">That came broadly in line with a median forecast of 50.5 in a Reuters survey of 14 analysts. </p><p class=\"\">New business declined for a third consecutive month, coming in at 49.0 from a previous 49.1, while the employment index fell to 49.0 from 51.3 in December, returning to negative territory for the first time since October. </p><p class=\"\">\"Activity in the Italian service sector remains within the growth area, but only marginally,\" said HCOB economist Jonas Feldhusen. \"Underlying demand remains weak and has worsened again.\" </p><p class=\"\">A sister survey for the manufacturing sector published on Monday showed contraction for a 10th month running in January and at roughly the same pace as the month before.</p><p class=\"\">Overall, Italy's private sector continued to contract slightly, with the composite PMI at 49.7, unchanged from December and below the 50 mark for a third month running.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSX:0-italian-services-sector-growth-slows-employment-drops-pmi-shows/",
            "pub_date": "2025-02-05 16:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002422:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0837 GMT - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">0830 GMT - Yields on U.K. government bonds, or gilts, fall ahead of an anticipated interest-rate cut by the Bank of England this week. Markets price in a 98% probability of a 25 basis-point cut to 4.5% on Thursday, LSEG Refinitiv data show. \"I suspect this Thursday's BOE will be sufficiently dovish to strongly raise odds of another cut already at the March meeting,\" Saxo's John Hardy says in a note. The 10-year gilt yield falls 3 basis points to 4.488%, Tradeweb data show. (miriam.mukuru@wsj.com)</p><p class=\"\">0822 GMT - The euro's gains will likely prove limited as it remains broadly unattractive given weak macroeconomic fundamentals and President Trump's threats to impose tariffs on the EU, ING analyst Francesco Pesole says. Wide eurozone-U.S. interest rate differentials in favor of the dollar reflect these factors, he says in a note. Trade news will dominate euro price action, although it will be interesting to hear whether the unexpected acceleration in January eurozone inflation triggers some change in the narrative from European Central Bank members. The ECB's chief economist, Philip Lane, is due to speak at 1400 GMT in Washington, DC. The euro rises 0.2% to $1.0402. (renae.dyer@wsj.com)</p><p class=\"\">0811 GMT - Singapore's retail sales could strengthen this year after a soft performance in 2024, buoyed by new attractions and other tailwinds, UOB associate economist Jester Koh writes in a note. Retail sales fell again in December due to weak tourist arrival numbers. For the full year, retail sales growth fell to 1.2% from 2.3% in 2023, with eight of 14 retail sales categories declining, he notes. Looking ahead, he expects new attractions, including Singapore's fifth zoological park, to lend support to sales. The upcoming budget 2025 is likely to be expansionary and further support measures could also lift sales, he adds. (amanda.lee@wsj.com)</p><p class=\"\">0803 GMT - The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis analysts say in a note. The spread hasn't reached this level since last November, they say, describing it \"a sign that investor perception of France is less pessimistic than before.\" The 10-year French-Spanish yield differential is 5.6 basis points, according to LSEG data. French Prime Minister Francois Bayrou used special executive powers on Monday to push the 2025 budget through parliament without a vote, while facing a no-confidence motion on Wednesday. (emese.bartha@wsj.com)</p><p class=\"\">0802 GMT - The dollar continues to trade at softer levels after Tuesday's data showed U.S. job openings fell in December. Openings dropped to 7.6 million from 8.2 million in November. The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank analyst Ipek Ozkardeskaya says in a note. Traders will now turn their focus to U.S. ADP private payrolls data at 1315 GMT and the U.S. ISM services report at 1500 GMT. The DXY dollar index falls 0.2% to a near one-week low of 107.643.(renae.dyer@wsj.com)</p><p class=\"\">0756 GMT - There are some green shoots in China's consumption spending, but caution persists, HSBC Global Research analysts write in a note. Preliminary data show the country's box office sales exceeded 9 billion yuan during the Lunar New Year holiday, while domestic travel reached a new record of over 2.33 billion cross-regional trips within China, they say. These are positive signs for consumer sentiment, but HSBC remains cautious over whether the holiday spirit can translate into more sustainable momentum without further stimulus. Another fiscal policy push is still needed to drive a sustained increase in activities in the coming months, especially given geopolitical uncertainty, HSBC adds. (jiahui.huang@wsj.com; @ivy_jiahuihuang)</p><p class=\"\">0754 GMT - Citi expects Malaysia's minimum wage hike to boost consumer spending, with median wages projected to grow by a high single digit in 2025, analyst Huan Wen Gan writes in a note. The minimum wage was raised to MYR1,700/month from MYR1,500/month on Feb. 1. Retail trade, particularly at convenience stores and mini-markets, is likely see further support, he adds. The agriculture sector has lower median wages, but oil palm harvesters already earn above the new threshold, minimizing the impact on palm oil players, he reckons. Mr. D.I.Y. Group (M) may face higher labor costs, with an 8% wage hike factored into 2025 earnings estimates, he says. For every 1% increase in wages could result in a 0.8% cut in its 2025 net profit forecast, he adds. Given stronger consumption trends and stable earnings potential, Citi remains positive on Malaysia's consumer sector. (yingxian.wong@wsj.com)</p><p class=\"\">0732 GMT - German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine European Central Bank wage tracker should keep the momentum going, says Commerzbank Research's Michael Leister. \"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid,\" the head of interest rates strategy says in a note. That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year, Leister says. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, he says. The 10-year German Bund yield falls 2.5 basis points to 2.374%, tracking U.S. Treasury yields lower, according to Tradeweb. (emese.bartha@wsj.com)</p><p class=\"\">0730 GMT - Limiting the downside risks for Chinese markets and the yuan depend on the potential of fresh talks between the U.S. and China, writes Mansoor Mohi-uddin, chief economist at Bank of Singapore. Financial markets on Tuesday had a muted reaction to China's retaliatory tariffs of 10%-15% on select U.S. goods, but there's a chance of a stronger reaction down the line if negotiations don't see results, Mohi-uddin says. Should U.S. tariffs on China remain at 10% this year, the impact should be manageable, he notes, adding that the measures will trim about 0.5% from China's GDP growth this year from its 5.0% rate in 2024. However, should the tariffs be raised to 20%-30%, growth may fall closer to 4.0%, Mohi-uddin estimates. (kimberley.kao@wsj.com)</p><p class=\"\">0725 GMT - Japanese stocks ended higher, led by auto stocks, as fears about U.S. tariffs subside. Toyota Motor gained 3.1% after it raised earnings projections and reported third-quarter results. Meanwhile, Honda Motor climbed 8.2% following news that Nissan's board is planning to reject Honda's terms for a combination of the two automakers. Nissan Motor fell 4.9%. The Nikkei Stock Average rose 0.1% to 38831.48. Investors are focusing on U.S. tariff-related developments as well as earnings. USD/JPY is at 153.16, compared with 154.34 as of Tuesday 5 p.m. Eastern time. The 10-year Japanese government bond yield rises one basis point to 1.285%. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">0717 GMT - The yuan may still face more downward pressure, Maybank's FX analysts say in a research report. \"China remains the only country that President Trump has allowed tariff to take effect on,\" the analysts say. \"Notwithstanding the fact that his trade policies and end goals remain murky at this stage, the developments thus far suggest that China is still taking the brunt of his trade policies,\" the analysts say. Taking into account the tariffs' deadlines, a scenario of an impasse on U.S.-China negotiations would probably prompt the PBOC to \"relent\" on USD/CNY fixings and allow USD/CNY to trend higher, the analysts add. USD/CNH is little changed at 7.2861. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002422:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002420:0",
            "title": "Canadian Dollar Continues to Recover From Tariff Hit — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002420:0/",
            "pub_date": "2025-02-05 16:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463876:0",
            "title": "Getlink's ElecLink Interconnector Set to Come Back Online After Final Assessments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Getlink  said the ElecLink electricity interconnector between France and the UK is set to be gradually brought back into service from Wednesday, according to a same-day release. </p><p class=\"\">The tunnel and railway operator is carrying out final assessments and testing, which is scheduled to be completed on Feb. 10. The company estimates a 25 million-euro impact from the suspension of activity for the first weeks of 2025. </p><p class=\"\">The interconnector's operations have been suspended since Sept. 25, 2024, after a fault was detected.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463876:0/",
            "pub_date": "2025-02-05 16:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463879:0",
            "title": "Nama Chemicals Unit Terminates Wastewater Treatment Contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nama Chemicals (SASE:2210) subsidiary Jubail Chemical Industries, or Jana, terminated two wastewater treatment deals with Green Dimension Co. for Environmental Services and Confident Engineering International. </p><p class=\"\">The Saudi chemical manufacturer said Wednesday that the alliance breached its contracts for Jana's chloride and epoxy resins plants and failed to remedy the breaches despite a grace period. </p><p class=\"\">The company said it reserves all its legal and financial rights to pursue compensation and damages.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463879:0/",
            "pub_date": "2025-02-05 16:37:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}