{
    "data": [
        {
            "id": "DJN_DN20250204014511:0",
            "title": "Nissan to Reject Honda's Merger Terms, Putting Deal in Peril — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sean McLain and Megumi Fujikawa</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">The two Japanese automakers said on Dec. 23 that they planned to combine under a structure in which Honda and Nissan would both be subsidiaries of a single holding company.</p><p class=\"\">In recent days, Honda presented a new proposal that would have made Nissan a subsidiary of Honda instead of the more equal structure originally planned, according to a person familiar with the negotiations. The person said Nissan found the new proposal unacceptable and planned to reject it.</p><p class=\"\">The person said Nissan and Honda would continue other cooperation that predates the merger talks, including collaboration on software and electric vehicles.</p><p class=\"\">Honda said it was continuing to discuss the potential combination with Nissan and aimed to decide on a general plan by mid-February.</p><p class=\"\">Nissan shares had jumped on the initial merger announcement in December but fell back in the following weeks. Nissan shares were up about 1% in Tokyo trading Wednesday. Honda shares rose 2.5%.</p><p class=\"\">If the automakers' plan to combine falls apart, it would raise pressure on Nissan to reassure lenders, employees and customers that it can survive amid stiff competition in the U.S. and China. Nissan has lost ground in both markets.</p><p class=\"\">Nissan said in November that it would lay off 9,000 workers and slash its factory capacity by one-fifth to cut costs.</p><p class=\"\">Write to Sean McLain at sean.mclain@wsj.com and Megumi Fujikawa at megumi.fujikawa@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511:0/",
            "pub_date": "2025-02-05 12:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW02X:0",
            "title": "Toyota raises full-year profit outlook by 9%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  raised its full-year operating profit forecast by 9% on Wednesday, in a sign of confidence in its ability to ride out any potential U.S. tariffs.</p><p class=\"\">The world's biggest-selling automaker raised its profit forecast for the current year through March 2025 to 4.7 trillion yen ($30.7 billion) versus 4.3 trillion yen expected previously.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW02X:0-toyota-raises-full-year-profit-outlook-by-9/",
            "pub_date": "2025-02-05 12:36:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463692:0",
            "title": "Ann Joo Resources to Buy Remaining 45% Stake in Konsortia Etiqa for MYR96 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ann Joo Resources  unit Ann Joo Management Services agreed to acquire the remaining 45% stake it does not own in industrial land firm Konsortia Etiqa for 96 million ringgit. </p><p class=\"\">The stake, comprising 67,500 shares, will be purchased from Ong Tee Thong, according to a Tuesday Malaysian bourse filing. </p><p class=\"\">The steel company will finance the deal via its internal funds, it said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463692:0/",
            "pub_date": "2025-02-05 12:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014697_20250204014697:0",
            "title": "Perusahaan Gas Negara Target Price Set at IDR2,000 by Maybank Sekuritas Indonesia >PGAS.JK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014697_20250204014697:0/",
            "pub_date": "2025-02-05 12:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014697_20250204014698:0",
            "title": "Perusahaan Gas Negara Started at Buy by Maybank Sekuritas Indonesia >PGAS.JK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014697_20250204014698:0/",
            "pub_date": "2025-02-05 12:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463693:0",
            "title": "Lithium Energy Gets Environmental Impact Assessment Approval for Argentinian Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lithium Energy  received Environmental Impact Assessment approval to further explore the central and northern blocks of the Solaroz Lithium Brine Project in Argentina, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">The company will perform the majority of the next phase of exploration and evaluation activities in the two blocks as they hold the majority of the existing lithium resources in the project, the filing said. </p><p class=\"\">Under an amended sale agreement, Lithium Energy is selling its interest in the Solaroz project to CNGR Netherlands New Energy (CNNET) for $63 million. Since Jan. 1, CNNET has been funding local operations and development in the project by providing $15 million in loan financing, added the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463693:0/",
            "pub_date": "2025-02-05 12:38:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463689:0",
            "title": "Keyfield International Unit Charters Vessel, Workboat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keyfield International (KLSE: KEYFIELD) unit Keyfield Offshore executed two separate deals for the charters of one anchor-handling tug supply vessel and one dynamic positioning two accommodation work boat. </p><p class=\"\">The charter of the anchor handling tug supply vessel is expected to begin in the first week of April, for 720 days, plus an option to extend for another 180 days. The vessel will be deployed in the United Arab Emirates, according to a Tuesday Malaysian bourse filing. </p><p class=\"\">Meanwhile, the charter of one dynamic positioning 2 accommodation workboat is expected to begin in mid-February, for 150 days, plus an option to extend for another 120 days. The vessel will be deployed in Malaysia, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463689:0/",
            "pub_date": "2025-02-05 12:38:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014699:0",
            "title": "Japan's Wage Growth Set to Improve While Facing Strong Headwinds — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014699:0/",
            "pub_date": "2025-02-05 12:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0G9:0",
            "title": "India's Tata Power gains on Q3 profit rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tata Power  rise 3.5% to 372 rupees</p><p class=\"\">** Co said consolidated net profit rose 8.2% Y/Y to 10.31 bln rupees ($118.3 mln); rev from ops up 5.1%</p><p class=\"\">** Co aided by better margin in its solar engineering, procurement and construction segment</p><p class=\"\">** Co also interested in setting up small modular nuclear reactors, its CEO Praveer Sinha said on Tuesday</p><p class=\"\">** Over FY 2025-2027, earnings growth to be driven by capacity addition and solar cell or module manufacturing - Antique Stock Broking</p><p class=\"\">** Brokerage says execution of solar EPC order book and transmission line commissioning also key growth drivers</p><p class=\"\">** 20 analysts covering the stock on avg have a \"hold\" rating; median PT is 462 rupees - LSEG data</p><p class=\"\">** Stock gained 18% in 2024</p><p class=\"\">($1 = 87.1270 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0G9:0-india-s-tata-power-gains-on-q3-profit-rise/",
            "pub_date": "2025-02-05 12:39:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463533:0",
            "title": "Deutsche Bank Research Says UBS Group Q4 2024 Results Solid; Divisional Mix 'Not Ideal'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Deutsche Bank Research said Tuesday that UBS Group's  latest earnings report was \"a significant beat but not ideal mix.\"</p><p class=\"\">As such, analysts kept the Swiss stock on hold with a price target of 29 francs. </p><p class=\"\">\"Overall UBS reported solid 4Q24 results,\" the note said. \"The divisional mix could have been better with Global Wealth Management only in line and Personal &amp; Corporate Banking</p><p class=\"\">missing expectation.\"</p><p class=\"\">The research firm added that UBS \"continues to deliver\" since its 2023 emergency takeover of Credit Suisse but that the estimate 2026 11.4x EPS and 1.25x tangible book value have already factored in \"a lot of profitability improvement to come.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463533:0/",
            "pub_date": "2025-02-05 12:40:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463691:0",
            "title": "Halcyon Agri Decides Against Providing Business Updates for Q1, Q3 Amid Delisting Notice",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Halcyon Agri  has decided not to continue with the company's business updates for Q1 and Q3, starting from the third quarter of 2024, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">This follows the company receiving a notification of delisting from the Singapore Exchange and is already making preparations for its delisting in relation to an exit offer proposal.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463691:0/",
            "pub_date": "2025-02-05 12:40:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014688:0",
            "title": "Toyota Raises Revenue, Net-Profit Views for FY Ending March",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014688:0/",
            "pub_date": "2025-02-05 12:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DS:0",
            "title": "Australia's tech stocks near two-month highs on Wall St boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australian tech stocks  rise 1.9%, in tandem with its U.S. peers on optimism for Sino-U.S. trade breakthrough </p><p class=\"\">** Tech index hits its highest since Dec. 10; set for second consecutive session of gains</p><p class=\"\">** Nine of 11 index members gains, led by hotel booking firm Siteminder , up 4%, and software maker WiseTech , up 3.4%</p><p class=\"\">** Broader ASX200 benchmark  up 0.6% on the day</p><p class=\"\">** Tech index has gained ~6% this year, 3x the ASX200's rise</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DS:0-australia-s-tech-stocks-near-two-month-highs-on-wall-st-boost/",
            "pub_date": "2025-02-05 12:32:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463687:0",
            "title": "De La Rue Launches Sale Process Amid Control Transfer Talks with Pension SuperFund Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">De La Rue  launched a formal sales process after receipt of preliminary approaches from multiple third parties amid discussions regarding a transfer of control to Pension SuperFund Capital entities. </p><p class=\"\">The UK banknote printer is inviting expressions of interest for all its share capital, according to a Tuesday filing. Deutsche Numis is overseeing the process that will run until March 31. </p><p class=\"\">The company initiated the process even though talks with Pension SuperFund entities continue regarding a potential takeover offer of 1.25 pounds sterling per share. De La Rue said the deadline for the entities to finalize their intention for the company is no longer in effect in light of the sale process.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463687:0/",
            "pub_date": "2025-02-05 12:33:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0E2:0",
            "title": "India bond yields dip ahead of anticipated RBI rate easing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indian government bond yields trend marginally lower in early deals on Wednesday, as market participants remain focused on the Reserve Bank of India's monetary policy decision, with rising bets of an interest rate cut.</p><p class=\"\">The 10-year bond yield (IN067934G=CC) was at 6.6644% as of 10:00 a.m. IST, compared with Tuesday's close of 6.6732%.</p><p class=\"\">\"The bias will remain on the bullish side but we do not expect any major levels to be broken before the policy outcome,\" a trader with a private bank said.</p><p class=\"\">The central bank is widely expected to cut rates for the first time in nearly five years in Governor Sanjay Malhotra's first monetary policy review, aiming to boost economic growth which is seen falling to a four-year low.</p><p class=\"\">A majority of economists and market participants are expecting a 25-basis-point cut on Friday.</p><p class=\"\">The RBI has also proactively started infusing liquidity into the banking system, which was an ask by market participants. </p><p class=\"\">In the secondary market, the RBI has bought bonds worth 310 billion rupees ($3.56 billion), while buying bonds worth 200 billion rupees through an open market operation (OMO) last week. </p><p class=\"\">Of the total purchases, one-fourth comprised the benchmark paper. </p><p class=\"\">The central bank has also infused around 440 billion rupees through a $5.1 billion forex swap last week. On the radar is a 56-day repo on Feb. 7 followed by two more OMO purchases of 200 billion rupees each on Feb. 13, and Feb. 20.</p><p class=\"\">Most market participants expect the RBI to continue buying back bonds not only in this financial year, but the next as well.</p><p class=\"\">The purchases could be worth 2 trillion rupees next fiscal year, said Ashhish Vaidya, managing director and treasurer - global financial markets, DBS Bank India. Vaidya said the slight rise in the gross borrowing target is immaterial.</p><p class=\"\"> ($1 = 87.1425 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0E2:0-india-bond-yields-dip-ahead-of-anticipated-rbi-rate-easing/",
            "pub_date": "2025-02-05 12:33:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463685:0",
            "title": "Jiangling Motors Logs Higher Vehicle Sales, Lower Production in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jiangling Motors  logged sales of 21,359 units in January, up 2.2% from 20,899 units the previous year. </p><p class=\"\">Production was down 5.9% year over year to 20,643 units from 21,939 units, according to a Wednesday filing with the Shenzhen bourse.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463685:0/",
            "pub_date": "2025-02-05 12:34:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0F5:0",
            "title": "BlackRock plans to hire 1,200 people in India ramp-up, Bloomberg News reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Blackrock  plans to hire nearly 1,200 people to expand its two support hubs in India, Bloomberg News reported on Tuesday, citing people familiar with the matter.</p><p class=\"\">The world's largest asset manager wants to build out its artificial intelligence capabilities in India with the expansion, the report added. </p><p class=\"\">The iHubs, as the centers are known, are in the country's financial hub Mumbai and Gurugram, which is near the national capital New Delhi.</p><p class=\"\">The new hires will increase total headcount to roughly 3,500 in the two cities, and include more engineers and data experts, according to the report. </p><p class=\"\">Blackrock is also inheriting a so-called global capabilities center in India's IT hub Bengaluru, through its proposed deal to acquire data provider Preqin, Bloomberg reported. That center will have roughly 1,500 staff members. </p><p class=\"\">Blackrock did not immediately respond to a Reuters request for comment. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0F5:0-blackrock-plans-to-hire-1-200-people-in-india-ramp-up-bloomberg-news-reports/",
            "pub_date": "2025-02-05 12:34:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0GI:0",
            "title": "India stocks, rupee, swaps, call at 10:00 a.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was down 0.1% to 78,504, while the broader NSE Nifty 50  was little changed at 23,571, as positive momentum in energy stocks was countered by losses in consumer stocks. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  declined 0.07% versus the U.S. dollar to 87.13, pressured by a bearish outlook amidst persistent portfolio outflows and expectations of a rate cut by the RBI later this week. </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN067934G=CC) was quoted at 100.8725 rupees, with the yield down 1 bp at 6.6644%, with the major focus staying on the central bank monetary policy decision.</p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) was down 2 basis points at 6.29%, while the five-year swap rate (INR5YMIBROIS=CC) declined nearly 2 bps to 6.0575%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 6.50%, and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.21%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0GI:0-india-stocks-rupee-swaps-call-at-10-00-a-m-ist/",
            "pub_date": "2025-02-05 12:35:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463690:0",
            "title": "Hotel Properties Obtains Tax Concessions for 5.50% Perpetual Securities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hotel Properties  said holders of its SG$160 million worth of 5.50% perpetual securities would be given tax concessions by the Inland Revenue Authority of Singapore (IRAS). </p><p class=\"\">The company applied to the IRAS for a ruling to grant tax concessions to holders, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">The bonds are part of the company's SG$1.0 billion multicurrency debt issuance program.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463690:0/",
            "pub_date": "2025-02-05 12:35:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463686:0",
            "title": "Market Chatter: Investment Corp. of Dubai Reportedly Plans ALEC IPO in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Investment Corp. of Dubai, or ICD, is reportedly looking to raise up to $500 million from the initial public offering of construction company ALEC Engineering &amp; Contracting as early as mid-2025. </p><p class=\"\">Discussions regarding the size and time of the offering are still ongoing and a final decision is yet to be taken, Bloomberg News reported Tuesday, citing people familiar with the matter. </p><p class=\"\">An earlier report stated that ALEC engaged Emirates NBD Capital and JPMorgan Chase &amp; Co., while the Dubai government's principal investment arm ICD tapped Moelis &amp; Co. for the planned offering. However, more banks can be appointed to arrange the offering. </p><p class=\"\">ALEC did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463686:0/",
            "pub_date": "2025-02-05 12:35:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014658:0",
            "title": "Toyota Motor 3Q Rev Y12.391T Vs. Y12.041T >7203.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014658:0/",
            "pub_date": "2025-02-05 12:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014656:0",
            "title": "Toyota Motor 3Q Net Y2.193T Vs. Net Y1.358T >7203.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014656:0/",
            "pub_date": "2025-02-05 12:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014661:0",
            "title": "Toyota 3Q Net Profit Beat Y1.175T Expected in Poll of Analysts by Quick",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014661:0/",
            "pub_date": "2025-02-05 12:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463688:0",
            "title": "New Zealand Shares Fall as China Responds to US Tariffs; Unemployment Rate Rises to 5.1% in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand shares fell Wednesday, while Asia-Pacific equities traded mixed as investors weighed China's retaliation against US tariffs. </p><p class=\"\">The S&amp;P/NZX 50 Index was down 0.5%, or 60.45 points, to close at 12,844.59. </p><p class=\"\">Health technology stocks led the decline, followed by industrial services and distribution services. </p><p class=\"\">Asia-Pacific peers were mixed, with Hong Kong's Hang Seng down 0.5%, Australia's ASX 200 up 0.5%, and Japan's Nikkei 225 flat. Returning from a long break, Chinese equities were in the red with the Shanghai SSE down 0.4%. </p><p class=\"\">Overnight, Wall Street shrugged off China's countermeasures against US tariffs as equities climbed. The Nasdaq Composite jumped 1.4%, the S&amp;P 500 rose 0.7%, and the Dow Jones Industrial Average gained 0.3%. </p><p class=\"\">On Tuesday, China announced additional tariffs of 15% on imported coal and liquefied natural gas from the US, as well as 10% tariffs on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. These duties will take effect Feb. 10. </p><p class=\"\">Bank of America Research analysts said China's response \"leaves room for potential negotiations,\" although US President Donald Trump said Tuesday he was in \"no rush\" to speak with China President Xi Jinping. </p><p class=\"\">In domestic news, the unemployment rate jumped to 5.1% in the December 2024 quarter from 4.8% in the preceding three-month period, in line with expectations, Stats NZ data showed Wednesday. </p><p class=\"\">In corporate news, Air New Zealand's  group capacity dropped 1.2% year on year in December impacted by lower aircraft availability due to maintenance requirements. </p><p class=\"\">SKY Network Television  Chief Financial Officer Ciara McGuigan has resigned, effective immediately. She will be succeeded by Andrew Hirst in an interim capacity. The company's shares finished more than 1% lower.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463688:0-new-zealand-shares-fall-as-china-responds-to-us-tariffs-unemployment-rate-rises-to-5-1-in-q4-2024/",
            "pub_date": "2025-02-05 12:29:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0RO:0",
            "title": "Indonesia's Q4 GDP at 5%, in line with poll forecast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy grew 5.02% in the final quarter of 2024 from a year earlier driven by household spending and investment, official data showed on Wednesday, close to analysts' forecasts and little changed from the rate in the previous quarter.</p><p class=\"\">Analysts polled by Reuters had expected annual growth of 4.98%, after the economy had grown 4.95% in the third quarter.</p><p class=\"\">On a non-seasonally adjusted basis, gross domestic product (GDP) rose 0.53% in the October-December quarter from the previous three months, Statistics Indonesia data showed.</p><p class=\"\">For all of 2024, the economy grew 5.03% from 2023.</p><p class=\"\">Growth in Southeast Asia's largest economy has hovered around 5% since the COVID-19 pandemic, a solid pace but far behind new President Prabowo Subianto's 8% target.</p><p class=\"\">The growth outlook this year is clouded by the prospect of U.S. tariffs disrupting trade and weakening global demand, the central bank said last month when it downgraded its 2025 growth forecast to a range of 4.7%-5.5% from 4.8%-5.6%.</p><p class=\"\">Bank Indonesia has cut interest rates twice since September, by a total of 50 basis points, to try to stimulate the economy. </p><p class=\"\">Prabowo's administration has also launched programmes the government believes would boost growth, including providing electricity tariff discounts to bolster purchasing power, free meals for school children, and building affordable housing.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0RO:0-indonesia-s-q4-gdp-at-5-in-line-with-poll-forecast/",
            "pub_date": "2025-02-05 12:29:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW00D:0",
            "title": "Toyota - Toyota Battery Manufacturing North Carolina To Begin Production And Shipments Of Batteries For North American EVs In April",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TOYOTA BATTERY MANUFACTURING NORTH CAROLINA TO BEGIN PRODUCTION AND SHIPMENTS OF BATTERIES FOR NORTH AMERICAN EVS IN APRIL</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW00D:0-toyota-toyota-battery-manufacturing-north-carolina-to-begin-production-and-shipments-of-batteries-for-north-american-evs-in-april/",
            "pub_date": "2025-02-05 12:29:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014680:0",
            "title": "Wellington Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in NZ$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Air New Zealand                 0.64       0.64       unch       unch <br/>  Auckland Intl Airport           8.75       8.85      -0.10      -1.07 <br/>  Contact Energy                  9.29       9.29       unch       unch <br/>  Fisher &amp; Paykel Health         34.60      35.92      -1.32      -3.67 <br/>  Fletcher Building               2.86       2.85      +0.01      +0.35 <br/>  Spark New Zealand               2.90       2.92      -0.02      -0.86 <br/>  Warehouse Group                 1.04       1.02      +0.02      +1.96 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014680:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014681:0",
            "title": "Toyota Maintains FY Group Vehicle-Sales Forecast at 10.85M Units",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014681:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014677_20250204014677:0",
            "title": "SGX Sicom May RSS3 Rubber Up 0.8 Cent at 244.0 U.S. Cents/Kg",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014677_20250204014677:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014676_20250204014676:0",
            "title": "SGX Sicom March RSS3 Rubber Untraded at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014676_20250204014676:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}