{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309117:0",
            "title": "McDonald's 2025 Outlook Likely Modest Amid Limited Earnings Growth, FX Headwinds, Oppenheimer Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">McDonald's  outlook for 2025 is likely to be modest, with limited earnings growth potential and foreign exchange headwinds, Oppenheimer said in a note Tuesday. </p><p class=\"\">Ahead of McDonald's Q4 earnings release on Feb. 10, Oppenheimer analysts said they re-evaluated their Perform rating, seeking reasons for a more optimistic 2025 outlook. It concluded that current market expectations for 2025, including a projected 2.7% increase in US same-store sales, are reasonable and that it does not foresee \"a new path for earnings upside,\" the report said. </p><p class=\"\">Oppenheimer projects the fast-food giant's 2025 earnings per share at $12.12, below the consensus of $12.40, mainly due to foreign exchange impacts. While global same-store sales and Earnings Before Interest and Taxes, or EBIT margins are in line, \"we struggle to identify the [same-store sales] and margin upside required to take a more bullish stance on shares,\" Oppenheimer said. </p><p class=\"\">McDonald's launched the \"McValue\" platform with a focus on its $5 meal deal, but the firm suggests its impact on sales growth may be limited, especially in the second half of 2025, Oppenheimer said, adding that it sees more attractive growth opportunities in the restaurant sector with Yum Brands. </p><p class=\"\">Oppenheimer forecasts Q4 EPS of $2.81, slightly below the Wall Street's $2.84, with global same-store sales estimated at -0.4%, and revised 2025 and 2026 EPS estimates to $12.12 and $13.09, both below the Street's forecasts of $12.40 and $13.43, the report said. </p><p class=\"\">Oppenheimer reiterated its perform rating on McDonald's.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309117:0/",
            "pub_date": "2025-02-05 01:41:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1R4:0",
            "title": "US energy firms rise as Trump set to reimpose 'maximum pressure' on Iran",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** S&amp;P 500 Energy index  rises 2.1% as oil prices pare earlier losses </p><p class=\"\">** Brent crude futures  up 0.4% at $76.29 per barrel</p><p class=\"\">** U.S. West Texas Intermediate crude futures  down 0.4% at $72.81 a barrel. It fell more than 3% earlier in the session to its lowest since late December, amid trade war fears between United States and China</p><p class=\"\">** Oil rose after an official said U.S. President Donald Trump plans to restore his \"maximum pressure\" campaign on Iran in bid to drive down Iranian oil exports to zero, which offset some weakness from tariff drama between Washington and Beijing</p><p class=\"\">** Shares of oil and gas majors Exxon Mobil  up 2.8% and Chevron  up 2.6%</p><p class=\"\">** Phillips 66 , Valero Energy , APA Corp  and Marathon Petroleum  up between 4.2% and 7%; among top pct. gainers on energy index</p><p class=\"\">** Oilfield services firms Halliburton  and SLB  up 3% and 2.8%, respectively</p><p class=\"\">** Refiners PBF Energy  and HF Sinclair  up 7.8% and 5.9%, respectively</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1R4:0-us-energy-firms-rise-as-trump-set-to-reimpose-maximum-pressure-on-iran/",
            "pub_date": "2025-02-05 01:42:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NT:0",
            "title": "S&P 500 gains on energy boost; Trump-Xi talks in focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">PepsiCo down after forecasting annual profit below estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Merck falls on dour 2025 forecast</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Indexes up: Dow 0.08%, S&amp;P 500 0.59%, Nasdaq 1.16%</li></ul></span></div><span><p class=\"\">        The S&amp;P 500 climbed on Tuesday, aided by energy stocks, while investors focused on upcoming talks between U.S. President Donald Trump and his Chinese counterpart Xi Jinping after Beijing imposed retaliatory tariffs.  </p><p class=\"\">    Seven of the 11 S&amp;P 500 sectors traded higher, with energy stocks  leading the gains with a 2% rise, paring earlier losses.  </p><p class=\"\">    Trump and Xi were set to talk later in the day, White House trade adviser Peter Navarro said at a Politico Live event, as new 10% tariffs on Chinese imports took effect, which China countered with levies on U.S. goods.  </p><p class=\"\">Trump had said over the weekend that he would impose a 25% tariff on goods from Mexico and Canada, but agreed to a 30-day pause on Monday, in return for border and crime concessions from both countries.</p><p class=\"\">    Megacaps also rose, aiding a recovery in indexes from a tepid start to the session. Alphabet  was up 1.6% ahead of its quarterly results, which are due after markets close, while Nvidia  advanced 2.5%.   </p><p class=\"\">        Palantir  jumped 23.7% after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates.</p><p class=\"\">    \"The fundamentals of the market are still solid and earnings growth is great, but every time the President (Trump) speaks and says he's going to do something, the market reacts drastically,\" said Paul Stanley, chief investment officer, Granite Bay Wealth Management.  </p><p class=\"\">    \"Palantir just had a great earnings report, and everybody reacts to those big public companies right now and thinks that it's going to have the same impact on all other companies.\"  </p><p class=\"\">        At 11:55 a.m. ET, the Dow Jones Industrial Average  rose 36.97 points, or 0.08%, to 44,458.88, the S&amp;P 500  gained 35.15 points, or 0.59%, to 6,029.72, and the Nasdaq Composite  gained 225.54 points, or 1.16%, to 19,617.84.</p><p class=\"\">        Biotechnology firm Illumina  dropped 5.9%, while PVH Corp , the holding company for brands including Calvin Klein, shed 0.9% after China placed the companies in its \"unreliable entity list\". </p><p class=\"\">The last-minute change helped the three major U.S. stock indexes pare some of the heavy losses suffered earlier on Monday and closed trading well off session lows.</p><p class=\"\">Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise.</p><p class=\"\">    A Labor Department report showed U.S. job openings stood at 7.6 million in December, compared to an estimated 8 million, according to economists polled by Reuters.  </p><p class=\"\">    In earnings-driven moves, PepsiCo  fell 4.2% after it forecast annual profit below expectations and missed quarterly revenue estimates.</p><p class=\"\">Merck  dropped 10.7% after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenues.</p><p class=\"\">    PayPal  fell 10.1% after the digital payments giant's operating margin     shrank     in the fourth quarter.  </p><p class=\"\">    Advancing issues outnumbered decliners by a 2.74-to-1 ratio on the NYSE, and by a 2.16-to-1 ratio on the Nasdaq.  </p><p class=\"\">    The S&amp;P 500 posted 21 new 52-week highs and 15 new lows, while the Nasdaq Composite recorded 45 new highs and 88 new lows.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NT:0-s-p-500-gains-on-energy-boost-trump-xi-talks-in-focus/",
            "pub_date": "2025-02-05 01:42:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0RK:0",
            "title": "Venezuela oil exports rise on Chevron's cargoes, more supply to China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Venezuela's oil exports rose 15% to some 867,000 barrels per day in January, driven by an increase in shipments by U.S. major Chevron Corp  from its joint ventures with state firm PDVSA, and more cargoes to China, data based on vessel movements showed.</p><p class=\"\">The administration of former U.S. President Joe Biden last year did not renew a broad authorization for sanctioned Venezuela to freely export its oil, but granted individual licenses to some PDVSA partners and customers, allowing exports to flow to markets such as the U.S., Europe and India.</p><p class=\"\">President Donald Trump has said the U.S. does not need Venezuela's oil, but has not taken any action to amend or revoke licenses as his government makes initial contacts with Venezuelan President Nicolas Maduro, whose re-election last year was not recognized by Washington.</p><p class=\"\">In January, Chevron increased exports of Venezuelan oil to 294,000 bpd, the highest since the U.S. producer began shipments under its license in early 2023, and above a previous high of 280,000 bpd in October, according to LSEG data and PDVSA's internal exports records. </p><p class=\"\">All Chevron's cargoes went to the U.S. for processing at its own refineries and sales to others. </p><p class=\"\">China remained the largest market for Venezuela's oil last month with 442,000 bpd, 21% above the 364,000 bpd shipped to that destination in December. </p><p class=\"\">Venezuela's exports to Europe doubled to 63,000 bpd from 30,500 bpd in December, while shipments to India averaged 60,100 bpd, in line with previous months. Exports to Maduro's political ally Cuba declined to less than 10,000 bpd of fuel, from 29,000 bpd the previous month.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:925.5813953488372px;aspect-ratio:1.5426356589147285\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0RK-04e328578a6300e4432f013c81be2c1f-resized.webp\" type=\"images/webp\"/><img alt=\"Shipments of crude and fuel from Venezuela increased 15% in January as some partners of state company PDVSA exported more to the United States and Europe under U.S. licenses\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0RK-04e328578a6300e4432f013c81be2c1f-resized.jpeg\" style=\"background-color:#f5ebe0\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Venezuelan oil exports rise as PDVSA's partners ship more</span></figcaption></figure></span></p><p class=\"\">Stable crude processing operations in Venezuela's largest oil producing region, the Orinoco Belt, contributed to higher exports, according to one of the internal documents.</p><p class=\"\">However, inventories of heavy crude there, which are essential for exports, fell to 6.2 million barrels from 7.5 million barrels at the end of December, which could lead to lower exports this month. </p><p class=\"\">Venezuela also exported 360,000 metric tons of oil byproducts and petrochemicals in January, above the 209,000 tons of the previous month.</p><p class=\"\">PDVSA and its joint ventures imported 111,000 bpd of heavy naphtha and other fuels last month, below the 130,000 bpd of December, according to the data.   </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0RK:0-venezuela-oil-exports-rise-on-chevron-s-cargoes-more-supply-to-china/",
            "pub_date": "2025-02-05 01:43:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009156:0",
            "title": "Tempur Sealy Cleared to Close Purchase of Mattress Firm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Tempur Sealy International said that it expects to close its previously announced acquisition of mattress specialty retailer Mattress Firm Group on Wednesday.</p><p class=\"\">The company said the closing follows the ruling from the U.S. District Court for the Southern District of Texas denying the motion by the Federal Trade Commission for a preliminary injunction to halt the closing of the proposed acquisition.</p><p class=\"\">The FTC has indicated that it will not seek emergency relief from the Fifth Circuit, and won't prevent the transaction from closing.</p><p class=\"\">Last July, the FTC voted to block Tempur Sealy's proposed $4 billion acquisition of Mattress Firm due to competition and pricing concerns. The regulator said the acquisition of Mattress Firm would give the world's largest mattress supplier and manufacturer the ability and incentive to suppress competition and raise prices for mattresses for millions of consumers.</p><p class=\"\">Tempur Sealy said last September that it expected to close the deal in late 2024 or early 2025, after the anticipated completion of the litigation process.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009156:0/",
            "pub_date": "2025-02-05 01:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0XY:0",
            "title": "Corn basis mixed; soy bids mostly flat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Spot basis bids for corn were mixed at processing sites and grain elevators in the U.S. Midwest on Tuesday, firming in a few locations where demand outstripped farmer offerings and softening in others.</p><p class=\"\">* Farmer sales of corn and soybeans increased last month as Chicago Board of Trade corn futures climbed to multi-month highs, but demand from some end-users has eased in the wake of the influx of grain. </p><p class=\"\">* The corn basis fell by 2 cents at Decatur, Illinois, a key processing site, and at an ethanol plant in Linden, Indiana. But the basis improved at a Cedar Rapids, Iowa, processor and at elevators in Lincoln, Nebraska, and Toledo, Ohio.</p><p class=\"\">* Soybean basis bids were mostly flat, although the spot basis fell by a nickel a bushel at a Morristown, Indiana, crushing facility.</p><p class=\"\">* Falling profit margins for crushers may limit their demand for soybeans following an aggressive crushing pace in recent months. The U.S. Department of Agriculture reported on Monday that U.S. processors crushed a record-high 217.7 million bushels of soybeans in December, near an average of analyst expectations.  </p><p class=\"\">* Chicago Board of Trade corn and soy futures turned higher by mid-session on Tuesday, buoyed by a setback in the dollar  and optimism about grain demand after U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> on Monday suspended his threat of steep tariffs on <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/mexico/\" rel=\"nofollow\" target=\"_blank\">Mexico</a> and <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/canada/\" rel=\"nofollow\" target=\"_blank\">Canada</a>. </p><p class=\"\">* As of 11:24 a.m. CST (1724 GMT), CBOT March corn (CH25) was up 6-1/2 cents at $4.95-1/4 a bushel and March soybeans (SH25) were up 11-1/2 cents at $10.69-3/4 a bushel. </p><p class=\"\">  Basis values are quoted against CBOT futures in cts/bu:    </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">ELEVATORS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">CINCINNATI OH</p></td><td><p class=\"\">+5</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 1</p></td><td><p class=\"\">-2</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">BURNS HARBOR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DES MOINES IA</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">LINCOLN NE</p></td><td><p class=\"\">-35</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 5</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">PROCESSORS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DECATUR IL</p></td><td><p class=\"\">-4</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 2</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">+0</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">MORRISTOWN IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-10</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 5</p></td></tr><tr><td><p class=\"\">LAFAYETTE IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-12</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">CEDAR RAPIDS IA</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 3</p></td><td><p class=\"\">-35</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">COUNCIL BLUFFS IA</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">LINCOLN NE</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">BLAIR NE</p></td><td><p class=\"\">-18</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">RIVER TERMINALS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">TOLEDO OH</p></td><td><p class=\"\">-10</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 3</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">SENECA IL</p></td><td><p class=\"\">-14</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 1</p></td><td><p class=\"\">-27</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">SAVANNA IL</p></td><td><p class=\"\">-36</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td><p class=\"\">-41</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DAVENPORT IA</p></td><td><p class=\"\">-28</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td><p class=\"\">-32</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">ETHANOL PLANTS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">LINDEN IN</p></td><td><p class=\"\">-12</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 2</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">UNION CITY IN</p></td><td><p class=\"\">+6</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">ANNAWAN IL</p></td><td><p class=\"\">-20</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">COUNCIL BLUFFS IA</p></td><td><p class=\"\">-22</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">SRW WHEAT</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">TOLEDO OH</p></td><td><p class=\"\">-30</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">CINCINNATI OH</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">N</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">BURNS HARBOR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr></tbody></table></div><p class=\"\">NOTE: 0 = Option price, UNC = Unchanged, UNQ = Unquoted</p><p class=\"\">NC = Not comparable, DP = Delayed price, N/A = Not available,</p><p class=\"\"> F = January, H = March, K = May, N = July</p><p class=\"\">Q = August, U = September, X = November, Z = December</p><p class=\"\">--------------------------------------------------------</p><p class=\"\">LINKS: (0#USCSHGRN-PM)</p><p class=\"\">For U.S. forward basis spreadsheets, please click:</p><p class=\"\">     (CORN/BASIS), (SOYA/BASIS), (WHEAT/BASIS), (MILO/BASIS)</p><p class=\"\">- CBOT corn report </p><p class=\"\">- CBOT soybean report </p><p class=\"\">- CBOT wheat report </p><p class=\"\">- U.S. grain barge freight values </p><p class=\"\">- U.S. Midwest cash grain PM </p><p class=\"\">- U.S. CIF/FOB Gulf Grain  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0XY:0-corn-basis-mixed-soy-bids-mostly-flat/",
            "pub_date": "2025-02-05 01:44:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX3CtTry:0",
            "title": "Savouring February: A Month of Festivals and Celebrations in The Bahamas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nassau, The Bahamas, Feb.  04, 2025  (GLOBE NEWSWIRE) — As the last vestiges of winter’s chill linger across the Northern Hemisphere, The Bahamas continues to stand as a beacon of warmth, beckoning travelers to its sun-kissed shores. February in The Bahamas is not just about escaping the cold; it’s an invitation to dive deep into a vibrant culture, indulge in a calendar brimming with festivals, and revel in the natural splendour of the islands. Whether you’re looking for romance, adventure, or cultural immersion, February offers something special for everyone amidst the serene beauty and hospitable spirit of The Bahamas.</p><p class=\"\">Check out what’s new and upcoming for those travelling to The Bahamas in February:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Routes </strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Delta Airlines – </strong>Winter travelers rejoice! Delta has restarted its weekly nonstop service from Detroit Metropolitan Wayne County Airport (DTW) to Lynden Pindling International Airport (NAS) in The Bahamas. As the sole direct flight between these two destinations, it’s the perfect getaway for those in the metro Detroit and upper Midwest regions looking for a direct escape to The Bahamas’ beautiful islands.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong><strong class=\"root-Tkn6WL2y\">Events</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bahamas Romance Week</strong><strong class=\"root-Tkn6WL2y\"> (30 Jan. – 6 Feb.):</strong> The Bahamas Ministry of Tourism, Investments &amp; Aviation teams up with The Bahamas Bridal Association for the debut of “Bahamas Romance Week.” This unique event promises a week of love-filled escapades and special offers for couples across 16 of the Out Islands, creating magical moments for all romantics seeking a Bahamian adventure.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Eleuthera’s Junkanoo Festival</strong><strong class=\"root-Tkn6WL2y\"> (1 Feb.):</strong> Celebrate Bahamian culture with this vibrant festival, showcasing colourful costumes, rhythmic music and dynamic dance performances. This sought-after event in Eleuthera epitomises the spirit of Junkanoo, inviting visitors to immerse themselves in Bahamian traditions and culture.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Eleuthera Food and Craft Festival</strong><strong class=\"root-Tkn6WL2y\"> (1 Feb.):</strong> Held annually in Eleuthera, this event features local craftsmen and artisans as well as food vendors offering delectable local dishes such as conch salad and guava duff. This event brings locals and visitors together to enjoy a grand cultural celebration.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Farmer’s Cay Festival</strong><strong class=\"root-Tkn6WL2y\"> (7-8 Feb.:</strong> In The Exumas, this festival is a local gem, offering a day of community, music, and celebration. It’s an opportunity to experience the Exuma way of life, with sailing races, local foods and a chance to mingle with welcoming residents.</li></ul><p class=\"\"><em>Looking ahead…</em></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Hope Town Songwriters Festival</strong><strong class=\"root-Tkn6WL2y\"> (11-16 Feb.):</strong> Located in The Abacos, this event brings together songwriters from around the globe, offering intimate acoustic performances in the picturesque setting of Hope Town, a picturesque island getaway located on Abaco’s Elbow Cay. It’s a celebration of music, storytelling and the serene beauty of the island.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nicholls Town Music, Arts, and Crafts Festival</strong><strong class=\"root-Tkn6WL2y\"> (7 March):</strong> Held every second Saturday of March annually, this festival on the island of Andros brings together local talent for a celebration of music, art and traditional Bahamian crafts made from wood, straw and shells, offering an enriching cultural experience.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">2nd Annual Nassau Paradise Island Wine and Food Festival <strong class=\"root-Tkn6WL2y\">(12-16 March):</strong> A culinary highlight of the season, this event features world-renowned chefs, wine tastings and culinary workshops, showcasing the gourmet side of The Bahamas. </li><li class=\"listItem-bmN0_SHH\">Cruisers Heritage and Cultural Festival (14-15 March): This event is a celebration of the island’s rich cultural heritage for visiting cruisers to Cat Island. Visitors can enjoy a weekend of activities that include a bonfire on the beach, storytelling, music, dance and healthy competition among boaters. The event is supported by local vendors selling native dishes and local artisans with their handcrafted products for display and sale.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">19th Annual Bahamian Music &amp; Heritage Festival</strong><strong class=\"root-Tkn6WL2y\"> (14-15 March): </strong>Taking place in George Town, Exuma, this annual festival features a line-up of The Bahamas’ most popular and talented musicians on the big stage. You can expect wood and conch shell carvings, sand jewellery, straw craft and blown glass jewellery all on display and available for purchase from local artisans. The kids will be entertained with storytelling while you shop. Bahamian dancing and cooking demonstrations will also be taking place during this unique festival. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Harvest Festival in Andros</strong><strong class=\"root-Tkn6WL2y\"> (29 March): </strong>Celebrate the agricultural abundance of Andros with this festival highlighting local farming practices, fresh produce and community spirit. The festival includes traditional Bahamian foods, beverages and confectionaries, as well as Androsia textile, arts and crafts. Family activities and entertainment which include: singing, music, dance, fashion shows and lively Junkanoo performances will also be features of the festival.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Promotions and Offers</strong></p><p class=\"\">For a complete list of deals and discounted packages in The Bahamas, visit <strong class=\"root-Tkn6WL2y\">www.bahamas.com/deals-packages</strong>.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bahamas Romance Week Specials:</strong> Dive into a world of romance with over 13 exclusive packages and offers tailored for lovebirds. Throughout the Bahamas Romance Week, from 30 January to 6 February 2025, couples can enjoy a variety of romantic experiences, including special room rates, sunset dinners, spa treatments and more. For a complete list of deals and to find the perfect romantic escape, visit the Bahamas Romance Week landing page.</li></ul><p class=\"\"><em> </em><strong class=\"root-Tkn6WL2y\">Recent Awards and Upcoming Openings</strong></p><p class=\"\">The Bahamas is once again being celebrated for its natural beauty with the Tropic of Cancer Beach in Little Exuma securing the top spot in the 2025 Best Caribbean Beaches list. This acknowledgement underscores the archipelago’s status as a premier beach destination. For the full list, including three other Bahamian recognitions, see Caribbean Journal’s Best Caribbean Beaches for 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Island Focus: </strong><strong class=\"root-Tkn6WL2y\">San</strong> <strong class=\"root-Tkn6WL2y\">Salvador</strong></p><p class=\"\">San Salvador, famed for being Christopher Columbus’s first reported landfall in the New World, offers a blend of historical intrigue and natural beauty. The island’s serene beaches, like the expansive Bonefish Bay, provide a tranquil retreat, while its diving sites, such as Riding Rock Wall, are renowned for their crystal-clear waters and vibrant marine life.</p><p class=\"\">San Salvador’s small-town charm allows visitors to connect with the local community, experiencing their warm hospitality and rich cultural heritage. From exploring ancient Lucayan Indian caves to enjoying the quiet luxury of secluded resorts, San Salvador encapsulates the true essence of Bahamian tranquility. Whether you want to delve into history, engage in water sports, or simply bask in the peace of island life, San Salvador offers an authentic escape from the everyday hustle and bustle.</p><p class=\"\">Don’t miss out on the unforgettable experiences and unbeatable deals that The Bahamas has to offer, this February. For more information on these exciting events and offerings, visit <strong class=\"root-Tkn6WL2y\">www.Bahamas.com</strong>. </p><p class=\"\"> ###</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong><strong class=\"root-Tkn6WL2y\">About The Bahamas:</strong></p><p class=\"\">The Bahamas has over 700 islands and cays, as well as 16 unique island destinations. Located only 50 miles off the coast of Florida, it offers a quick and easy way for travelers to escape their everyday. The island nation also boasts world-class fishing, diving, boating and thousands of miles of the Earth's most spectacular beaches for families, couples and adventurers to explore. See why It's Better in The Bahamas at www.bahamas.com or on Facebook, YouTube or Instagram.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">San Salvador      </li><li class=\"listItem-bmN0_SHH\">San Salvador      </li></ul><p class=\"\">Anita Johnson Patty</p><p class=\"\">The Bahamas Ministry of Tourism</p><p class=\"\">ajohnson@bahamas.com</p><p class=\"\">Bahamas USA</p><p class=\"\">FINN Bahamas</p><p class=\"\">Bahamasusa@finnpartners.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX3CtTry:0-savouring-february-a-month-of-festivals-and-celebrations-in-the-bahamas/",
            "pub_date": "2025-02-05 01:44:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009159_20250204009159:0",
            "title": "S&P 500 Rises 29.53 Points (0.49%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009159_20250204009159:0/",
            "pub_date": "2025-02-05 01:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009160_20250204009160:0",
            "title": "Nasdaq Composite Rises 190.50 Points (0.98%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009160_20250204009160:0/",
            "pub_date": "2025-02-05 01:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009158_20250204009158:0",
            "title": "DJIA Rises 41.78 Points (0.09%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009158_20250204009158:0/",
            "pub_date": "2025-02-05 01:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1S8:0",
            "title": "Robinhood suspends trading in Super Bowl betting contracts after CFTC directive",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Robinhood  said on Tuesday it had suspended trading in Super Bowl betting contracts after the brokerage received a request from the U.S. Commodity Futures Trading Commission.  </p><p class=\"\">\"We are heeding their directive to cease offering these contracts despite the fact that the CFTC has not deemed Kalshi's football championship contracts illegal,\" said Lucas Moskowitz, Robinhood's general counsel. </p><p class=\"\">The trading platform had launched the event contracts on Monday to let U.S. customers wager on the outcome of the Super Bowl clash, seeking to tap into the betting mania around one of the most iconic sporting events in the country.  </p><p class=\"\">The company said it had rolled out the product to 1% of its customers and those who already placed the trades will get the option to close their positions or take them to resolution.  </p><p class=\"\">Event derivatives trading involves buying and selling contracts that let traders speculate on the outcomes of specific events, including elections, economic data releases and policy decisions.</p><p class=\"\">These products have enjoyed a warm reception, despite being relatively new and widely seen as high-risk, especially after a U.S. court struck down the CFTC's efforts to block KalshiEX's election betting contracts. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1S8:0-robinhood-suspends-trading-in-super-bowl-betting-contracts-after-cftc-directive/",
            "pub_date": "2025-02-05 01:45:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS5l33ra:0",
            "title": "Frost & Sullivan Report Highlights SMX's Plastic Cycle Token as a Next Generation Carbon Credit...With More Opportunities for Success",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MIAMI, FLORIDA / ACCESS Newswire / February 4, 2025 / SMX Ltd. , a pioneering technology company specializing in digitizing physical assets and materials for the circular economy, is proud to announce the release of a new Frost &amp; Sullivan report analyzing the transformative potential of its Plastic Cycle Token system.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:432.44444444444446px;max-width:1200px;aspect-ratio:2.774922918807811\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACS5l33ra-da6409a3bee86124124f6da3f06ef112-resized.webp\" type=\"images/webp\"/><img alt=\"SMX logo\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_ACS5l33ra-da6409a3bee86124124f6da3f06ef112-resized.jpeg\" style=\"background-color:#cad3d9\"/></picture></div></figure></span></p><strong class=\"root-Tkn6WL2y\">SMX logo</strong><p class=\"\">SMX logo</p><p class=\"\">In the report, Frost &amp; Sullivan note that, <!-- -->\"The introduction of the Plastic Cycle Token into the market has the potential to revolutionize how businesses and consumers perceive and interact with plastic recycling. Economic incentives provided by the token system encourage increased rates of recycling and innovation in plastic use reduction strategies. Stakeholders along the entire value chain can participate, making for holistic change which is sustainable.\"</p><p class=\"\">Frost &amp; Sullivan further highlight how SMX's Plastic Cycle Token system is set to transform plastic waste management with technology that embeds molecular markers into plastics, enabling full lifecycle traceability and accountability from production to reuse. This ensures compliance with Extended Producer Responsibility (EPR) regulations while unlocking new revenue streams through tokenized plastic credits. By integrating blockchain, traceability tools, and market-driven incentives, the Plastic Cycle Token creates a self-sustaining ecosystem that benefits manufacturers, recyclers, global populations, and financial institutions.</p><p class=\"\">To explore the full findings of Frost &amp; Sullivan's report, read the complete analysis here: (LINK).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Plastic Cycle Token</strong></p><p class=\"\">For decades, carbon credits have been the go-to tool for addressing environmental challenges, but they often fail to account for the real-world flow of materials. With over 400 million metric tons of plastic waste generated annually, much of it remains outside traditional sustainability frameworks. SMX Ltd. , a leader in traceability solutions, is changing that with the Plastic Cycle Token (PCT)-a breakthrough in plastic waste accountability.</p><p class=\"\">Unlike carbon credits, which lack direct material verification, PCTs are tied to actual plastic flows. SMX's technology allows plastics to be marked, tracked, and verified throughout their lifecycle, ensuring that each traded token represents real plastic being recycled and reintroduced into supply chains. This creates a transparent and measurable system that benefits industries struggling to meet sustainability mandates.</p><p class=\"\">Rather than penalizing companies with rigid quotas and taxes-especially in the EU-SMX's approach incentivizes participation in the circular economy. Beverage giants like Coca-Cola and PepsiCo, constantly under regulatory scrutiny, can use PCTs to demonstrate verifiable recycling efforts. The same applies to MedTech firms dealing with sterile packaging, aviation companies using lightweight composites, and energy firms seeking supply chain transparency. By ensuring the traceability of plastics across industries, PCTs help businesses improve ESG performance without sacrificing efficiency.</p><p class=\"\">With real-time tracking and verifiable proof of plastic usage, PCTs eliminate the guesswork in sustainability reporting. This transparency appeals to all parties across the supply chain that are focused on ESG accountability, allowing them to distinguish genuine sustainability efforts from corporate greenwashing. By shifting from penalties to incentives, SMX is not only addressing the global plastic crisis-it is pioneering a market-driven solution that makes environmental responsibility measurable, transparent, and economically viable.</p><p class=\"\">About SMX (Security Matters) Public Limited Company</p><p class=\"\">As global businesses face new and complex challenges relating to carbon neutrality and meeting new governmental and regional regulations and standards, SMX is able to offer players along the value chain access to its marking, tracking, measuring and digital platform technology to transition more successfully to a low-carbon economy.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></em></p><p class=\"\">The information in this press release includes \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, but are not limited to, statements regarding expectations, hopes, beliefs, intentions or strategies regarding the future. In addition, any statements that refer to projections, forecasts or other characterizations of future events or circumstances, including any underlying assumptions, are forward-looking statements. The words \"anticipate,\" \"believe,\" \"contemplate,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"intends,\" \"may,\" \"will,\" \"might,\" \"plan,\" \"possible,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"would\" and similar expressions may identify forward-looking statements, but the absence of these words does not mean that a statement is not forward-looking. Forward-looking statements in this press release may include, for example: matters relating to the Company's fight against abusive and possibly illegal trading tactics against the Company's stock; successful launch and implementation of SMX's joint projects with manufacturers and other supply chain participants of steel, rubber and other materials; changes in SMX's strategy, future operations, financial position, estimated revenues and losses, projected costs, prospects and plans; SMX's ability to develop and launch new products and services, including its planned Plastic Cycle Token; SMX's ability to successfully and efficiently integrate future expansion plans and opportunities; SMX's ability to grow its business in a cost-effective manner; SMX's product development timeline and estimated research and development costs; the implementation, market acceptance and success of SMX's business model; developments and projections relating to SMX's competitors and industry; and SMX's approach and goals with respect to technology. These forward-looking statements are based on information available as of the date of this press release, and current expectations, forecasts and assumptions, and involve a number of judgments, risks and uncertainties. Accordingly, forward-looking statements should not be relied upon as representing views as of any subsequent date, and no obligation is undertaken to update forward-looking statements to reflect events or circumstances after the date they were made, whether as a result of new information, future events or otherwise, except as may be required under applicable securities laws. As a result of a number of known and unknown risks and uncertainties, actual results or performance may be materially different from those expressed or implied by these forward-looking statements. Some factors that could cause actual results to differ include: the ability to maintain the listing of the Company's shares on Nasdaq; changes in applicable laws or regulations; any lingering effects of the COVID-19 pandemic on SMX's business; the ability to implement business plans, forecasts, and other expectations, and identify and realize additional opportunities; the risk of downturns and the possibility of rapid change in the highly competitive industry in which SMX operates; the risk that SMX and its current and future collaborators are unable to successfully develop and commercialize SMX's products or services, or experience significant delays in doing so; the risk that the Company may never achieve or sustain profitability; the risk that the Company will need to raise additional capital to execute its business plan, which may not be available on acceptable terms or at all; the risk that the Company experiences difficulties in managing its growth and expanding operations; the risk that third-party suppliers and manufacturers are not able to fully and timely meet their obligations; the risk that SMX is unable to secure or protect its intellectual property; the possibility that SMX may be adversely affected by other economic, business, and/or competitive factors; and other risks and uncertainties described in SMX's filings from time to time with the Securities and Exchange Commission.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional Disclaimers and Disclosures:</strong> This is sponsored content. Hawk Point Media Group, LLC. (HPM) has been compensated, or expects to be, to produce and distribute digital content for SMX Ltd. It should be expressly understood that HPM is not operated by a licensed broker, a dealer, or a registered investment adviser. It should also be expressly understood that under no circumstances does any information published herein represent a recommendation to buy or sell a security. HPM reports/releases are commercial advertisements and are for general information purposes ONLY. The information made available by HPM is not intended to be, nor does it constitute, investment advice or recommendations. The contributors do NOT buy and sell securities covered before or after any particular article, report and/or publication. HPM holds ZERO shares of stock in SMX Ltd.. While HPM does not own or market shares, it is prudent to expect that those hiring HPM including that company's owners, employees, and affiliates, may sell some or even all of the SMX Ltd. shares that they own, if any, during and/or after this engagement period. Always do your own due diligence prior to investing in any publicly traded company. For a full disclaimer and disclosure statement, click <em>HERE</em><em>.</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Ken Ellis</p><p class=\"\">ken@hawkpointmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> SMX (Security Matters)</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS5l33ra:0/",
            "pub_date": "2025-02-05 01:45:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSbjwj8a:0",
            "title": "Agronomics Limited Announces Director/PDMR Shareholding",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">Jim Mellon - Director's Dealing and PDMR</strong></em></p><p class=\"\">DOUGLAS, ISLE OF MAN / ACCESS Newswire / February 4, 2025 / Agronomics (\"Agronomics\" or the \"Company\"), a leading listed company in the field of clean food, has been notified that Galloway Limited, a company indirectly wholly owned by Executive Chair Jim Mellon, bought 1,300,000 shares of the Company at an average price of 3.80 pence per share on 4 February 2025.</p><p class=\"\">Following this purchase, Jim Mellon's interest is in a total of 160,406,551 Ordinary Shares of the Company, representing 15.89% of the total issued capital. Of this total, 152,710,944 Ordinary Shares are held by Galloway Limited and 2,313,646 Ordinary Shares are held by Shellbay Investments Limited, companies which are both indirectly wholly owned by Jim Mellon, and 5,381,961 Ordinary Shares are held directly by Mr Mellon. Denham Eke is a director of both Galloway Limited and Shellbay Investments Limited.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">1</p></td><td colspan=\"2\"><p class=\"\">Details of the person discharging managerial responsibilities / person closely associated</p></td></tr><tr><td><p class=\"\">a)</p></td><td><p class=\"\">Name</p></td><td><p class=\"\">Jim Mellon</p></td></tr><tr><td><p class=\"\">2</p></td><td colspan=\"2\"><p class=\"\">Reason for notification</p></td></tr><tr><td><p class=\"\">a)</p></td><td><p class=\"\">Position / status</p></td><td><p class=\"\">Executive Chair</p></td></tr><tr><td><p class=\"\">b)</p></td><td><p class=\"\">Initial notification/Amendment</p></td><td><p class=\"\">Initial</p></td></tr><tr><td><p class=\"\">3</p></td><td colspan=\"2\"><p class=\"\">Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor</p></td></tr><tr><td><p class=\"\">a)</p></td><td><p class=\"\">Name</p></td><td><p class=\"\">Agronomics Limited</p></td></tr><tr><td><p class=\"\">b)</p></td><td><p class=\"\">LEI</p></td><td><p class=\"\">21380029M8MPIEQ3TL31</p></td></tr><tr><td><p class=\"\">4</p></td><td colspan=\"2\"><p class=\"\">Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; and (iv) each place where transactions have been conducted</p></td></tr><tr><td><p class=\"\">a)</p></td><td><p class=\"\">Description of the financial instrument, type of instrument</p><p class=\"\">Identification code</p></td><td><p class=\"\">Ordinary shares of £0.000001</p><p class=\"\">ISIN IM00B6QH1J21</p></td></tr><tr><td></td><td><p class=\"\">Nature of the transaction</p></td><td><p class=\"\">Market purchase of Ordinary Shares</p></td></tr><tr><td><p class=\"\">c)</p></td><td><p class=\"\">Price(s) and volumes(s)</p></td><td><p class=\"\">Purchase of 1,300,000 Ordinary Shares in total @ 3.80 pence per share</p></td></tr><tr><td><p class=\"\">d)</p></td><td><p class=\"\">Aggregated information</p></td><td><p class=\"\">Aggregated Volume: 1,300,000 Ordinary Shares</p><p class=\"\">Aggregated purchase price: £49,400.00</p></td></tr><tr><td><p class=\"\">e)</p></td><td><p class=\"\">Date of the transaction</p></td><td><p class=\"\">4 February 2025</p></td></tr><tr><td><p class=\"\">f)</p></td><td><p class=\"\">Place of the transaction</p></td><td><p class=\"\">London (LSE)</p></td></tr></tbody></table></div><p class=\"\">THIS ANNOUNCEMENT CONTAINS INSIDE INFORMATION FOR THE PURPOSES OF THE MARKET ABUSE REGULATION (EU No. 596/2014) AS IT FORMS PART OF UK DOMESTIC LAW BY VIRTUE OF THE EUROPEAN UNION (WITHDRAWAL) ACT 2018. UPON THE PUBLICATION OF THIS ANNOUNCEMENT VIA A REGULATORY INFORMATION SERVICE, THIS INSIDE INFORMATION IS NOW CONSIDERED TO BE IN THE PUBLIC DOMAIN AND SUCH PERSONS SHALL THEREFORE CEASE TO BE IN POSSESSION OF INSIDE INFORMATION.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Agronomics</strong></p><p class=\"\">Agronomics is a leading London-listed company focussing on investment opportunities within the field of clean food. The Company has established a portfolio of over 20 companies in this rapidly advancing sector. It seeks to invest in companies owning technologies with defensible intellectual property that offer new ways of producing food and materials with a focus on products historically derived from animals. These technologies are driving a major disruption in agriculture, offering solutions to improve sustainability, as well as addressing human health, animal welfare and environmental damage. This disruption will decouple supply chains from the environment and animals and improve food security for the world's expanding population. A full list of Agronomics' portfolio companies is available at https://agronomics.im/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information please contact:</strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Agronomics Limited</p></td><td><p class=\"\">Beaumont Cornish Limited</p></td><td><p class=\"\">Canaccord Genuity Limited</p></td><td><p class=\"\">Cavendish Capital Markets Limited</p></td><td><p class=\"\">Peterhouse Capital Limited</p></td><td><p class=\"\">SEC Newgate</p></td></tr><tr><td><p class=\"\">The Company</p></td><td><p class=\"\">Nomad</p></td><td><p class=\"\">Joint Broker</p></td><td><p class=\"\">Joint Broker</p></td><td><p class=\"\">Joint Broker</p></td><td><p class=\"\">Public Relations</p></td></tr><tr><td><p class=\"\">Jim Mellon</p><p class=\"\">Denham Eke</p></td><td><p class=\"\">Roland Cornish</p><p class=\"\">James Biddle</p></td><td><p class=\"\">Andrew Potts</p><p class=\"\">Harry Pardoe</p><p class=\"\">Alex Aylen (Head of Equities)</p></td><td><p class=\"\">Giles Balleny</p><p class=\"\">Michael Johnson</p><p class=\"\">Charlie Combe</p></td><td><p class=\"\">Lucy Williams</p><p class=\"\">Charles Goodfellow</p></td><td><p class=\"\">Bob Huxford</p><p class=\"\">Anthony Hughes</p></td></tr><tr><td><p class=\"\">+44 (0) 1624 639396</p><p class=\"\">info@agronomics.im</p></td><td><p class=\"\">+44 (0) 207 628 3396</p></td><td><p class=\"\">+44 (0) 207 523 8000</p></td><td><p class=\"\">+44 (0) 207 397 8900</p></td><td><p class=\"\">+44 (0) 207 469 0936</p></td><td><p class=\"\">agronomics@secnewgate.co.uk</p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nominated Adviser</strong></p><p class=\"\">Beaumont Cornish Limited (\"Beaumont Cornish\") is the Company's Nominated Adviser and is authorised and regulated by the FCA. Beaumont Cornish's responsibilities as the Company's Nominated Adviser, including a responsibility to advise and guide the Company on its responsibilities under the AIM Rules for Companies and AIM Rules for Nominated Advisers, are owed solely to the London Stock Exchange. Beaumont Cornish is not acting for and will not be responsible to any other persons for providing protections afforded to customers of Beaumont Cornish nor for advising them in relation to the proposed arrangements described in this announcement or any matter referred to in it.</p><p class=\"\">This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Agronomics Limited</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSbjwj8a:0/",
            "pub_date": "2025-02-05 01:45:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009114:0",
            "title": "With Energy Tariffs on U.S., China Fires a Blank — Commodities Roundup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET MOVEMENTS:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Brent crude oil is down 0.1% to $76.02 a barrel</li><li class=\"listItem-bmN0_SHH\">European benchmark gas is down 0.6% to 52.35 euros a megawatt-hour</li><li class=\"listItem-bmN0_SHH\">Gold futures are up 0.6% at $2,873.00 a troy ounce</li><li class=\"listItem-bmN0_SHH\">LME three-month copper futures are up 0.4% at $9,148.00 a metric ton</li></ul><p class=\"\">TOP STORY:</p><p class=\"\">With Energy Tariffs on U.S., China Fires a Blank</p><p class=\"\">China's tariffs on oil, gas and coal appear calibrated to avoid serious disturbance to global energy markets.</p><p class=\"\">Beijing said it would impose 15% tariffs on supercooled natural gas and coal from the U.S. as part of its response to President Trump's new levies on Chinese imports. Oil imports will face a 10% tariff from Feb. 10.</p><p class=\"\">International natural-gas benchmarks were little changed in morning trading Tuesday. Meanwhile, U.S. crude prices unwound Monday's gains. Those had been spurred by the prospect of charges on Canadian oil supplies to the U.S., before Prime Minister Justin Trudeau and President Trump agreed a tariff pause.</p><p class=\"\">OTHER STORIES:</p><p class=\"\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</p><p class=\"\">Steel prices started rising for some U.S. companies even before President Trump announced tariffs on Canada and Mexico. Executives said they are bracing for more to come.</p><p class=\"\">Trump on Saturday announced 25% tariffs on all imports from Mexico and Canada starting Tuesday. On Monday, he said he would hold off for a month as talks got under way between the U.S. and its neighbors.</p><p class=\"\">--</p><p class=\"\">OMV's Net Profit Rises Despite Weak Refining Margins</p><p class=\"\">OMV's fourth-quarter net profit jumped despite weak refining margins dragging on its financial results.</p><p class=\"\">The Austrian oil-and-gas company said Tuesday that its quarterly net profit was 301 million euros ($311.4 million) compared with 236 million euros for the same quarter a year prior.</p><p class=\"\">--</p><p class=\"\">Tullow Oil Names Richard Miller as Interim CEO</p><p class=\"\">Tullow Oil named Richard Miller as interim chief executive officer ahead of Rahul Dhir stepping down in mid-February.</p><p class=\"\">The oil-and-gas producer said Tuesday that Miller would take on the role temporarily from Feb. 14 while it continues to search for a permanent replacement.</p><p class=\"\">--</p><p class=\"\">Archer Daniels Midland Posts Fall in 4Q Revenue, Outlines Cost-Cutting Plan</p><p class=\"\">Archer Daniels Midland posted a rise in profit but lower revenue in the fourth quarter, and outlined up to $750 million in cost-saving measures amid softer market conditions.</p><p class=\"\">The food-production and ethanol company on Monday posted a net profit of $567 million, or $1.17 a share, compared with $565 million, or $1.06 a share, for the same period a year earlier.</p><p class=\"\">--</p><p class=\"\">PepsiCo 4Q Revenue Slips on Volume Drop for Frito-Lay, Quaker</p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\">The Purchase, N.Y., snacks and soda maker posted fourth-quarter net income of $1.52 billion, or $1.11 a share, for the quarter ended Dec. 28. That is up from $1.3 billion, or 94 cents a share, in the same quarter a year before.</p><p class=\"\">MARKET TALKS:</p><p class=\"\">Russian Wheat Prices on the Rise — Market Talk</p><p class=\"\">1219 ET - Higher prices for Russian wheat are Providing support for CBOT wheat futures. Agricultural research firm SovEcon says that the average domestic price for Russian wheat has risen to 15,526 rubles, or $158 per metric ton. In U.S. dollars, that's up 9% since the start of the year, according to SovEcon. The firm says that exporters have been increasingly buying up Russian wheat in recent months, supporting the higher price. However, exports fell back in January, SovEcon says — and Russia's ability to supply wheat to the world may prove to be weaker in 2025 due to troubled weather this winter. CBOT wheat is up 1.1%. (kirk.maltais@wsj.com)</p><p class=\"\">--</p><p class=\"\">U.S. Natural Gas Futures Give Back Gains — Market Talk</p><p class=\"\">0936 ET - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Rise to Fresh Record as Uncertainty Around Trump Policies Lingers — Market Talk</p><p class=\"\">1641 GMT - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Grain Futures Show Restrained Reaction to China Tariffs — Market Talk</p><p class=\"\">0928 ET - New U.S. tariffs on Chinese goods were met with retaliation from China, resulting in selling in CBOT soybean futures overnight. But that selling has moderated, with the most-active soybean contract now down only 0.3% pre-market. Traders who have spoken to WSJ say that a lot of market activity has become reactive to new headlines, but is showing restraint in light of trade uncertainty. \"I think the trade is well braced for this,\" says Terry Reilly of Marex. Reilly adds that many traders likely \"learned their lesson\" after handling the fallout of the trade war with China in Trump's first term. (kirk.maltais@wsj.com)</p><p class=\"\">--</p><p class=\"\">Oil Plunges on Trade War Fears — Market Talk</p><p class=\"\">1425 GMT - Crude prices extend losses in midday trade amid heightened fears of a trade war between the U.S. and China that could hurt global growth and increase inflationary pressures. Brent crude is down 2.3% to $74.22 a barrel, while WTI falls 3.3% to $70.75 a barrel. Both benchmarks erased all the previous session's gains, also due to easing concerns over immediate disruption of Canadian and Mexican oil flows after U.S. President Trump agreed to hold off imposing tariffs on the two neighboring countries. \"The next key support levels to watch are $69.50 and $66,\" says Razan Hilal, market analyst at Forex. \"A deeper decline could signal the start of a more extended bearish trend.\" (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">ADM Cuts Jobs Due to Tough Ag Market — Market Talk</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">--</p><p class=\"\">Base Metal Prices Mixed; Threat of Tariffs Weighs on Sector — Market Talk</p><p class=\"\">1329 GMT - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">China's Counter Tariffs to Have Limited Impact on Oil Market, Commerzbank Says — Market Talk</p><p class=\"\">1245 GMT - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Fall But Keep Near Record High on Safe-haven Demand — Market Talk</p><p class=\"\">1131 GMT - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Palm Oil Ends Lower After Trump Pauses Tariff on Mexico, Canada — Market Talk 1009 GMT - Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p><p class=\"\">--</p><p class=\"\">Europe's Gas Price Eases But Remains Near 15-Month High — Market Talk</p><p class=\"\">0950 GMT - European natural-gas prices ease but continue to hover around their 15-month high, with the benchmark Dutch TTF down 0.9% to 53.32 euros a megawatt hour. \"The gas prices in Europe have continued to grow, and TTF is currently on par with the levels we saw at the end of 2023,\" DNB Markets analysts say. However, \"we still see that the market expects significant LNG volumes to reach the market in 2026, pushing the price down.\" The EU needs more LNG to meet its storage-filling target of 90% by Nov. 1., but inventories have been depleting fast and the bloc barely reached the Feb. 1 target of 50%. As of Sunday, EU gas storage was 52.6% full, with particularly high daily net withdrawals in Germany due to low wind-power generation. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Metal Prices Mixed in Uncertain Trading After Tariff Agreement — Market Talk</p><p class=\"\">0944 GMT - Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Slip on Last-Minute Tariff Deal But Stay Close to High — Market Talk</p><p class=\"\">0926 GMT - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Oil Falls Amid Tariff Turmoil — Market Talk</p><p class=\"\">0859 GMT - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Comex Gold Futures' Bullish Technical Setup Has Strengthened, Chart Shows — Market Talk</p><p class=\"\">0810 GMT - Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research's Joseph Chai says in a research report. Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800/oz level, leaving its bullish bias intact, Chai says. The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900/oz level, Chai says. The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, the analyst adds. Spot gold is 0.1% lower at $2,812.28/oz. (ronnie.harui@wsj.com)</p><p class=\"\">--</p><p class=\"\">Mondelez, Kellogg Among Companies to Be Hit By Tariff Hikes — Market Talk</p><p class=\"\">1853 ET - If President Donald Trumps ends up implementing 25% tariff hikes to Canada and Mexico goods, the consumption-related companies that would be impacted the most would be in the produce goods and alcohol spaces, BofA Securities analyst Bryan Spillane tells WSJ. \"This would drive produce prices higher, especially for fruits,\" Spillane says, adding that 40% of the U.S. produce comes from Mexico. Other companies in the grocery space that would get hit by tariffs and higher prices are Mondelez International and WK Kellogg, given that they don't produce essential food and would see their volumes go down, Spillane says. Mondelez makes about half of its Oreos in Mexico, and Kellogg recently closed two U.S. plants and expanded an existing facility in Ontario. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">Write to Barcelona Editors at barcelonaeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009114:0/",
            "pub_date": "2025-02-05 01:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309116:0",
            "title": "Tempur Sealy Expects to Close Mattress Firm Group Acquisition on Wednesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tempur Sealy International  said it anticipates completing the acquisition of Mattress Firm Group on Wednesday after the US District Court for the Southern District of Texas denied the Federal Trade Commission's motion to halt the closing. </p><p class=\"\">The FTC signaled it won't take other steps to prevent the closing of the transaction, Tempur Sealy said Tuesday in a statement.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309116:0/",
            "pub_date": "2025-02-05 01:36:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:5963570da094b:0",
            "title": "Disney's Q1 Earnings in Focus: Streaming Growth vs. Theme Park Challenges",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Walt Disney  is set to report first-quarter earnings on Wednesday before markets open, with analysts closely watching the company's profitability, streaming growth, and theme park performance.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Q1 Earnings Expectations</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">EPS forecast:</strong> $1.43 (+17% YoY)</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue forecast:</strong> $24.55 billion (+5% YoY)</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Buyback target:</strong> $3 billion for FY2025</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Key Business Highlights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Streaming Growth &amp; Box Office Success: Hits like <em>Moana 2</em> and <em>Mufasa: The Lion King</em> have bolstered Disney's earnings outlook.</li><li class=\"listItem-bmN0_SHH\">Experiences Segment Challenges: Analysts are monitoring theme park attendance, with hurricanes Helene and Milton and cruise ship pre-opening costs weighing on results.</li><li class=\"listItem-bmN0_SHH\">Future Profit Growth: Disney reaffirmed its FY2025 profit forecast for high single-digit growth, rising to double-digit EPS growth in FY2026 and FY2027, even as it increases investments in theme parks and cruise lines.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Analyst Insights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">BofA analyst Jessica Reif Ehrlich called Q1 the trough quarter of the fiscal year but noted that Los Angeles wildfires have not significantly impacted Disneyland attendance so far.</li><li class=\"listItem-bmN0_SHH\">Guggenheim analyst Michael Morris projected a 5% decline in Q1 experiences revenue, recovering to +4% in Q2 and 7% full-year growth.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Historical Performance</strong></strong></p><p class=\"\">Over the last two years, Disney has beaten EPS estimates 88% of the time and revenue estimates 50% of the time.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:5963570da094b:0-disney-s-q1-earnings-in-focus-streaming-growth-vs-theme-park-challenges/",
            "pub_date": "2025-02-05 01:37:24",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009125:0",
            "title": "STOXX Europe 600 Index Ends 0.22% Higher at 536.04 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 600 Index is up 1.19 points or 0.22% today to 536.04</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Third highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its record close of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 52-week high of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 11.02% from its 52-week low of 482.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 10.12% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 2025 closing high of 539.53 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.48% from its 2025 closing low of 508.19 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 28.42 points or 5.60%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009125:0/",
            "pub_date": "2025-02-05 01:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009127:0",
            "title": "FTSE 100 Index Ends 0.15% Lower at 8570.77 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 Index is down 12.79 points or 0.15% today to 8570.77</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 103.19 points or 1.19% over the last two trading days</li><li class=\"listItem-bmN0_SHH\">Largest two day point and percentage decline since Friday, Dec. 20, 2024</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its record close of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 35.23% since the pre-Brexit vote level of 6338.10 hit Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 52-week high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 14.09% from its 52-week low of 7512.28 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 11.58% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 2025 closing high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.50% from its 2025 closing low of 8201.54 hit Tuesday, Jan. 14, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 397.75 points or 4.87%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009127:0/",
            "pub_date": "2025-02-05 01:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:092aef0ad094b:0",
            "title": "Sugar Prices Climb on Reduced Indian Sugar Output",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">March NY world sugar #11 (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/SB*0/overview\" rel=\"nofollow\" target=\"_blank\">SBH25</a>) today is up +0.31 (+1.61%), and March London ICE white sugar #5 (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/SW*0/overview\" rel=\"nofollow\" target=\"_blank\">SWH25</a>) is up +9.80 (+1.91%).</p><p class=\"\">Sugar prices today are climbing, with NY sugar posting a 4-week high and London sugar posting a 7-week high. Reduced sugar output in India is boosting prices after Centrum reported today that India's 2024/25 sugar production from October 1 to January 31 was down -12.2% y/y to 16.5 MMT.</p><p class=\"\">Strength in the Brazilian real (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/forex/quotes/%5EUSDBRL/overview\" rel=\"nofollow\" target=\"_blank\">^USDBRL</a>) is also lifting sugar prices as the real climbed to a 2-1/2 month high against the dollar today. The stronger real discourages export selling from Brazil's sugar producers. </p><p class=\"\">Sugar prices have been in a 4-month-long downtrend. On January 21, NY sugar posted a 5-1/2 month nearest-futures low, and London sugar posted a 3-1/2 year low. An improving global sugar supply outlook is weighing on sugar prices. On January 20, India said it would allow its sugar mills to export 1 MMT of sugar this season, easing its restrictions placed on sugar exports in 2023. India has restricted sugar exports since October 2023 to maintain adequate domestic supplies. India allowed mills to export only 6.1 MMT of sugar during the 2022/23 season to September 30 after allowing exports of a record 11.1 MMT in the previous season. </p><p class=\"\">On November 21, the International Sugar Organization (ISO) reduced its 2024/25 global sugar deficit forecast to -2.51 MMT, compared to an August forecast of -3.58 MMT. ISO also raised its 2023/24 global sugar surplus estimate to 1.31 MMT from an August projection of 200,000 MT. </p><p class=\"\">The outlook for higher sugar production in Thailand is bearish for sugar prices. On October 29, Thailand's Office of the Cane and Sugar Board projected that Thailand's 2024/25 sugar production would jump by +18% y/y to 10.35 MMT. Thailand produced 8.77 MMT of sugar in the 2023/24 season that ended in April. Thailand is the world's third-largest sugar producer and the second-largest sugar exporter.</p><p class=\"\">Sugar found support last Wednesday after Czarnikow cut its Thailand 2024/25 sugar production estimate to 10.8 MMT from a previous forecast of 11.6 MMT.</p><p class=\"\">Drought and excessive heat last year caused fires in Brazil that damaged sugar crops in Brazil's top sugar-producing state of Sao Paulo. Sugar cane industry group Orplana said that as many as 2,000 fire outbreaks affected up to 80,000 hectares of planted sugarcane in Sao Paulo. Green Pool Commodity Specialists noted that as much as 5 MMT of sugar cane may have been lost due to the fires. Conab, Brazil's government crop forecasting agency, cut its 2024/25 Brazil sugar production estimate from November 21 to 44 MMT from a previous forecast of 46 MMT, citing lower sugarcane yields due to drought and excessive heat. Unica reported today that cumulative 2024/25 Center-South sugar output through mid-January is down -5.5% y/y to 39.794 MMT. </p><p class=\"\">Sugar has support from signs of smaller sugar production in India, the world's second-largest producer. The ISM projects India's 2024/25 sugar production to fall -15% y/y to a 5-year low of 27.27 MMT.</p><p class=\"\">As a supportive factor for sugar prices, the ISO on August 30 forecasted 2024/25 global sugar production of 179.3 MMT, down -1.1% y/y from 181.3 MMT in 2023/24. </p><p class=\"\">The USDA, in its bi-annual report released November 21, projected that global 2024/25 sugar production would climb +1.5% y/y to a record 186.619 MMT and that global 2024/25 human sugar consumption would increase +1.2% y/y to a record 179.63 MMT. The USDA also forecasted that 2024/25 global sugar ending stocks would decline -6.1% y/y to 45.427 MMT. </p><p class=\"\"><em>On the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Did Markets See Follow-Through Activity Overnight?</li><li class=\"listItem-bmN0_SHH\">Commodity Market Roundup- January’s Top Performers and Underperformers</li><li class=\"listItem-bmN0_SHH\">What Were Long-Term Monthly Charts Showing at the End of January?</li><li class=\"listItem-bmN0_SHH\">Is Coffee Moving to Even Higher Highs?</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:092aef0ad094b:0-sugar-prices-climb-on-reduced-indian-sugar-output/",
            "pub_date": "2025-02-05 01:38:11",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309121:0",
            "title": "Scotiabank Previews This Week's Policy Meeting at India's Central Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Reserve Bank of India is expected to cut its repo rate by 25bps to 6.25% on Thursday with a minority expecting a hold, said Scotiabank. </p><p class=\"\">Food price drivers of inflation have ebbed sharply, noted the bank. It may wish to evaluate the contents of this weekend's Indian budget. </p><p class=\"\">One question concerns whether the RBI provides a stimulus boost to the economy and whether the government remains on the same broad fiscal path. The finance minister said at her last 2024 budget that they wish to \"keep fiscal deficit each year such that the central government debt would be on a declining path as a percentage of GDP,\" .</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309121:0/",
            "pub_date": "2025-02-05 01:38:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009130:0",
            "title": "STOXX Europe 50 Index Ends 0.11% Higher at 4577.55 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 50 Index is up 5.12 points or 0.11% today to 4577.55</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 13 of the past 15 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.69% from its record close of 5183.24 hit Tuesday, May 2, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 52-week high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 9.02% from its 52-week low of 4198.67 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 7.86% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 2025 closing high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.06% from its 2025 closing low of 4316.04 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 268.92 points or 6.24%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009130:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009131:0",
            "title": "EURO STOXX 50 Index Ends 0.89% Higher at 5264.59 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The EURO STOXX 50 Index is up 46.68 points or 0.89% today to 5264.59</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 14 of the past 16 trading days</li><li class=\"listItem-bmN0_SHH\">Off 3.66% from its record close of 5464.43 hit Monday, March 6, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 52-week high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 15.16% from its 52-week low of 4571.60 hit Monday, Aug. 5, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 12.23% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 2025 closing high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.07% from its 2025 closing low of 4871.45 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 368.61 points or 7.53%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009131:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009128:0",
            "title": "DAX Ends 0.36% Higher at 21505.70 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX is up 77.46 points or 0.36% today to 21505.70</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its record close of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 52-week high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 27.40% from its 52-week low of 16880.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 26.26% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 2025 closing high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.04% from its 2025 closing low of 19906.08 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 1596.56 points or 8.02%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009128:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009129:0",
            "title": "CAC 40 Index Ends 0.66% Higher at 7906.40 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 Index is up 51.48 points or 0.66% today to 7906.40</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up three of the past four trading days</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its record close of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fifth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its 52-week high of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.89% from its 52-week low of 7130.04 hit Tuesday, Aug. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 3.50% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.55% from its 2025 closing high of 7950.17 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.57% from its 2025 closing low of 7282.22 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 525.66 points or 7.12%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009129:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009135:0",
            "title": "U.S. Stocks Stage Small Recovery — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Caitlin McCabe and Krystal Hur</p><p class=\"\">U.S. stocks staged a small recovery Tuesday, despite China's retaliation against the new U.S. tariffs.</p><p class=\"\">The moves were milder than Monday's big swings, and some signs of investor anxiety remained.</p><p class=\"\">Among the notable moves:</p><p class=\"\">Stocks indexes largely rose. The Dow industrials was little changed, while the S&amp;P 500 rose 0.6%. The tech-heavy Nasdaq Composite led gains, up over 1.2%.</p><p class=\"\">The Cboe Volatility Index, or VIX, fell below 18, after surging Monday. The \"fear gauge\" is higher than the average of about 16 over the past year, but far from panic territory.</p><p class=\"\">Yields on benchmark Treasury notes were little changed. The 10-year yield traded around 4.54%, compared with 4.542% Monday.</p><p class=\"\">The WSJ Dollar Index edged down. The Canadian dollar advanced against the dollar, as did the Chinese yuan, while the euro and British pound slipped.</p><p class=\"\">Oil prices were volatile. U.S. crude futures slid below $71 a barrel, before rebounding back above $72.</p><p class=\"\">Bitcoin prices traded around $99,000.</p><p class=\"\">Write to Caitlin McCabe at caitlin.mccabe@wsj.com and Krystal Hur at krystal.hur@wsj.com</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009135:0/",
            "pub_date": "2025-02-05 01:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009136:0",
            "title": "Russia's Threat to Undersea Internet Cables Can't Be Ignored — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Justin Sherman</p><p class=\"\">Justin Sherman is the founder and CEO of Global Cyber Strategies , a research and advisory firm, and a nonresident senior fellow at the Atlantic Council.</p><p class=\"\">Headed into 2025, a ship did something that Finland, and many in the West, saw as a new level of Russian provocation: It dragged its anchor and severed undersea cables in the Baltic Sea.</p><p class=\"\">Finnish forces seized the ship, \"Eagle S,\" and immediately launched an investigation. They initially suspected a Kremlin-directed plot to disrupt Baltic internet communications and sow chaos in Europe. Some European and U.S. officials say the episode may have been accidental, but the incident should remind the West that both unintentional and intentional damage to undersea cables remain potent geopolitical and national security issues. Russian threats to global undersea cables demand a robust, multilaterally coordinated response that takes in cable repairs, cybersecurity, and defensive planning.</p><p class=\"\">Submarine cables carry 99% of internet traffic between continents. These 500-plus cables, about as thick as a garden hose, are critical for worldwide information flows, commerce, scientific research, and even military communications; today's internet wouldn't exist without them. U.S. and European companies have long played leading roles in building and maintaining the network, and combinations of private- and public-sector entities around the globe, from Brazil to China to Kenya, collaborate to connect these expensive, logistically intensive projects from city to city, country to country, and continent to continent.</p><p class=\"\">This vital infrastructure is damaged hundreds of times a year. It's almost always an accident. A boat moves close to a shoreline, doesn't properly check its maps for cables in the area, and then accidentally rips up or damages a cable with a dragging anchor.</p><p class=\"\">Damaging one cable won't collapse the global internet. But it isn't harmless, either. Damaging or destroying cables in certain regions can disrupt some data flows, have the effect of encouraging traffic to flow via other routes, force repair ships to be sent out, and much more. And many companies often underappreciate the nature of global military and intelligence threats to subsea cables. They are primed to think more about risks of resilience than spying and sabotage.</p><p class=\"\">But the continuing investigation in the Baltic Sea captures the real-time uncertainty that unfolds when a poorly timed cable cut, heightened geopolitical tensions, and questions of nation-state sabotage collide. The Eagle S is an oil tanker flying under the Cook Islands flag, formally making it a private vessel unconnected to the Kremlin's halls.</p><p class=\"\">It is plausible that the Eagle S, like many ships, genuinely made an accidental cut by dragging its anchor. That would hardly be an outlier. Cable repair ships are deployed regularly to Band-Aid together the result of a boat captain's negligence. Just because the ship may be Russia-linked doesn't inherently make it a sinister agent.</p><p class=\"\">Nonetheless, there is reason for suspicion about Russia's plans. Russia's General Staff Main Directorate for Deep Sea Research, or GUGI, is expanding its fleet of ships, subs, and naval drones that could spy on or damage cables. Doing so would fit into the Kremlin's view of the internet as a vital part of modern competition and conflict — a vulnerability for the Kremlin and a weapon to be used against its enemies. Such an operation would also fit into the purposes of Moscow's so-called shadow fleet, a covert collection of oil tankers and ships that register in lax jurisdictions beyond Russia (such as the Cook Islands), move freely around the world, and help Russia circumvent oil sanctions and execute operations.</p><p class=\"\">European and U.S. investigators may uncover what really happened, but the public may not get that information.</p><p class=\"\">The ability to repair cables quickly should be a focus for Western governments, along with their allies and partners in South Korea, Japan, Australia, and elsewhere. Repair has long fallen to the private sector, which has generally handled it well. Governments should ensure that the private sector's repair capabilities remain robust and that considerable Chinese involvement in cable repairs isn't a vector for adversarial espionage. The U.S. Cable Ship Security Program, which puts private ships on standby for national security-relevant repairs, may be a model for Finland and others.</p><p class=\"\">Cybersecurity needs more attention, too. Poorly secured, remote cable management systems give attackers another way to disrupt or degrade data flows. Governments have influence through the cable licenses they issue. They could build heightened cybersecurity requirements into their license requirements.</p><p class=\"\">Finally, the U.S., the U.K., Finland, and others should incorporate undersea infrastructure into defensive planning. If the Russian President Vladimir Putin's regime genuinely sees itself at war with NATO, countries cannot rule out what the Kremlin might do in the near future, including potentially expanding the Ukraine conflict. U.S. officials have voiced similar concerns about China, asking whether Taiwan-area cable cuts would escalate in a full-scale invasion.</p><p class=\"\">Repair ships must take notice, too. Pulling a cable up from the seabed and fixing it, even in stormy waters, is a different animal entirely when bullets and missiles fly overhead. Governments should help companies plan for those kinds of difficult scenarios. Multilateral exercises, threat intelligence-sharing, and security capacity-building partnerships could all help mitigate these risks.</p><p class=\"\">We may not ever know if what happened in the Baltic was sabotage or something more benign. Regardless, the cuts should make clearer than ever to the West that cable security is best when first designed during planning — not a panicked response.</p><p class=\"\">Guest commentaries like this one are written by authors outside the Barron's newsroom. They reflect the perspective and opinions of the authors. Submit feedback and commentary pitches to  ideas@barrons.com .</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009136:0/",
            "pub_date": "2025-02-05 01:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009089:0",
            "title": "Meta on Track for Record Winning Streak — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms Inc Class A (META) is currently at $704.08, up $6.62 or 0.95%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be new all-time high (Based on available data back to May 18, 2012)</li><li class=\"listItem-bmN0_SHH\">Currently up 12 consecutive days; up 15.18% over this period</li><li class=\"listItem-bmN0_SHH\">Longest winning streak on record (Based on available data back to May 18, 2012)</li><li class=\"listItem-bmN0_SHH\">Best 12 day stretch since the 12 days ending Aug. 15, 2024, when it rose 16.01%</li><li class=\"listItem-bmN0_SHH\">Up 20.25% year-to-date</li><li class=\"listItem-bmN0_SHH\">Up 54.84% from 52 weeks ago (Feb. 6, 2024), when it closed at $454.72</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 63.67% from its 52-week closing low of $430.17 on April 30, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $706.97</li><li class=\"listItem-bmN0_SHH\">Up 1.36% at today's intraday high</li></ul><p class=\"\">All data as of 12:09:01 PM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009089:0-meta-on-track-for-record-winning-streak-data-talk/",
            "pub_date": "2025-02-05 01:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009088:0",
            "title": "Canada Net Change Percentage Gainers & Losers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              GAINERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>NXT Energy Solutions         SFD      0.28     0.08     36.59        24,042 <br/>Silver Elephant Mining      ELEF       0.2     0.04     25.00       133,291 <br/>RTG Mining                   RTG     0.025     0.01     25.00        20,000 <br/>Northcliff Resources         NCF      0.03     0.01     20.00        44,000 <br/>Willow Biosciences          WLLW      0.03     0.01     20.00       325,000 <br/>Western Resources            WRX      0.04     0.01     14.29         5,318 <br/>Dorel Industries Cl B      DII.B      4.93     0.49     11.04         3,510 <br/>Bri-Chem                     BRY     0.355     0.04     10.94         6,500 <br/>RF Capital Group             RCG     10.88     0.88      8.80        22,861 <br/>Hammond Manufacturing A    HMM.A      9.71     0.76      8.49        44,306 <br/> <br/>                              LOSERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Ascendant Resources         ASND     0.045    -0.01    -18.18       195,500 <br/>BriaCell Therapeutics        BCT      6.25    -1.05    -14.38        23,960 <br/>Star Diamond                DIAM     0.035    -0.01    -12.50       207,505 <br/>Karnalyte Resources          KRN      0.09    -0.01    -10.00         6,250 <br/>Meridian Mining UK           MNO     0.395    -0.03     -7.06       144,652 <br/>Wallbridge Mining             WM      0.07    -0.01     -6.67       441,861 <br/>Pieridae Energy              PEA     0.245    -0.02     -5.77        50,000 <br/>Excellon Resources           EXN     0.085    -0.01     -5.56       121,881 <br/>Greenlane Renewables         GRN      0.09    -0.01     -5.26         1,850 <br/>Colabor Group                GCL      0.83    -0.04     -4.60        18,500 <br/> <br/> <br/>Only includes stocks with at least 1,000 shares traded today. <br/> <br/>Data are delayed at least 15 minutes. <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009088:0/",
            "pub_date": "2025-02-05 01:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2DO:0",
            "title": "PayPal Holdings Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc  reported quarterly adjusted earnings of $1.19​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $1.48.  The mean expectation of thirty four analysts for the quarter was for earnings of $1.12 per share. Wall Street expected results to range from $1.09  to $1.22 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 4.2% to $8.37 billion from a year ago; analysts expected $8.26 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc's reported EPS for the quarter was $1.11​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $1.12 billion.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc shares had risen by 4.9% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 0.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 22 \"strong buy\" or \"buy,\" 23 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the business support services peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for PayPal Holdings Inc is $94.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 05:30 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.12</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.07</p></td><td><p class=\"\">1.20</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.99</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.22</p></td><td><p class=\"\">1.40</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2DO:0-paypal-holdings-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 01:31:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009095:0",
            "title": "Why Some Firms Are Turning Operations and Support Staff Into Financial Advisors — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anne Field</p><p class=\"\">In 2023, the partners at Frisch Financial decided it was time to hire another financial advisor. The Melville, N.Y., firm, with about $800 million in assets under management, had grown a lot over the preceding 10 years and quite simply needed a fifth person with previous experience who could work with existing clients, bring on board new ones, and become a full-fledged wealth manager.</p><p class=\"\">So the partners were surprised when an unexpected job candidate stepped up: Denise Jackson, who had been with the firm about 20 years, working in a variety of operational, administrative, and customer service jobs. But after the initial surprise, the partners decided the move seemed like a good idea, despite the expected learning curve. \"She knew all the clients. She knew the relationship management software. She knew the operational and service side of things,\" says Shawn Gallagher, a principal at the firm. \"It made sense.\"</p><p class=\"\">There aren't exact numbers for how many support people are becoming advisors, but Jackson appears to represent a trend. \"It's very prevalent right now,\" says Andrew Blake, associate director of wealth management at Cerulli Associates, a financial-services research firm. As the number of advisors set to retire increases and firms struggle to find replacements, tapping support professionals who understand a firm's backbone and inner workings or how things are done at similar enterprises seems like a logical move. If the person is familiar with the company's clients, it can be another plus. \"It's a clear advantage over someone else,\" Blake says.</p><p class=\"\">Of course, moving from operations and support to the financial advisory part of the business isn't a slam dunk. It requires learning a new set of capabilities. \"The job of an advisor is very different from what they were doing before,\" says Gallagher.</p><p class=\"\">Skipping ahead. Previous support experience can help an individual move through the development process faster than they might without that background. Take Jackson. Around the time she expressed interest in filling the new advisor role, the firm had also introduced a four-phase career path for advisors.</p><p class=\"\">The career path starts with financial-planning analysts, who have to learn the firm's software and other basic tasks, and ends with wealth advisors, who are lead advisors, part of the investment committee, and responsible for bringing in business, among other responsibilities. Because of her familiarity with the firm's administrative and other processes, Jackson was able to skip the first phase and go right to the second, associate financial planner. In that role, she sits in on client meetings with a lead advisor, contributing to the discussion when they address such areas as financial planning, as well as doing premeeting prep work, and necessary follow-up. The next step for Jackson, who is currently enrolled in classes to prepare for the Certified Financial Plan exam, is financial planner, which would allow her to assume a role almost like that of a lead advisor.</p><p class=\"\">The power of operational knowledge. For many firms, experience working in operations and other support roles is a definite plus, especially if the individuals already work for the organization. In some cases, practices opt for operations people even when the candidate comes from a different enterprise.</p><p class=\"\">About a year ago, Donald LaGrange and his colleagues at Dallas-based Murphy &amp; Sylvest Wealth Management, wanted to add another advisor to the 10-year-old firm's Elmhurst, Ill., office. \"We generally look for someone who's more proven\" than someone in operations, he says. But then they were introduced through a mutual friend to Scott Long, who was working for an Oakbrook, Ill., retail branch of Fidelity Investments in an operations role. LaGrange figured it would be helpful to have someone who knew the inner workings of a large custodian, \"how to meet all the paper requirements, and was comfortable with that part of the business,\" he says. Long wasn't looking to make a change, but he clicked with the firm's owners, had his Series 7 and 66, and decided to give the advisor role a try.</p><p class=\"\">The Murphy &amp; Sylvest Wealth Management team understood that hiring Long would require a different learning process — one that would combine tried-and-true methods with efforts tailored to his situation. \"We knew we had to commit to Scott's technical development,\" says LaGrange. For starters, that involved Long sitting in on meetings with existing clients in both Elmhurst and Dallas. He still regularly attends meetings with Paul Nolte, senior wealth advisor in the Elmhurst office, and Nolte's clients, doing a postmortem afterward.</p><p class=\"\">Long also turns to different team members for help with their areas of expertise when working with clients. LaGrange, a retired army officer, for example, has met with Long and a few military veteran clients. Long has called on an estate-planning expert when he needed that knowledge. In addition, LaGrange and another advisor usually create the financial plans for Long's clients.</p><p class=\"\">Long works in a hybrid capacity, handling projects like making sure account forms are filled out correctly, for his clients, as well as for Nolte's. His experience is typical of operations professionals transitioning to an advisor role at other enterprises. About one-third of advisors in their first three years at a firm continue to have client service support and operations duties, according to Cerulli's Blake.</p><p class=\"\">Business development options. For some support people, the biggest hurdle to making the transition to advisor tends to be business development. For individuals who just don't succeed or enjoy looking for new clients, the best solution, if available, may be to avoid rainmaker duties, and focus on being a \"service advisor,\" suggests Alex Stickelman, chief compliance officer at Rossby Financial. \"In some firms, they leave lead generation up to the financial advisor,\" she says. \"But at others, there's a servicing advisor who is fully licensed but not responsible for generating business.\"</p><p class=\"\">Ultimately, operations people turned advisors say their previous experience creates an understanding of clients they couldn't have developed otherwise. \"Clients want to know what to expect, what happens next,\" says Long. \"If you've done it all firsthand, you can provide insights into the whole process.\"</p><p class=\"\">Write to advisor.editors@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009095:0/",
            "pub_date": "2025-02-05 01:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}