{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXpQ3lK:0",
            "title": "Pan American Energy Announces Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NOT FOR DISTRIBUTION TO UNITED STATES NEWS WIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES</p><p class=\"\">CALGARY, Alberta, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Pan American Energy Corp. </strong>(<strong class=\"root-Tkn6WL2y\">CSE: PNRG | OTCQB: PAANF | FRA: SS60</strong>) (\"<strong class=\"root-Tkn6WL2y\">Pan American</strong>” or the \"<strong class=\"root-Tkn6WL2y\">Company</strong>”) announces that it intends to complete a non-brokered private placement financing (the “<strong class=\"root-Tkn6WL2y\">Common Share Private Placement</strong>”) of up to 4,350,000 common shares in the capital of the Company (the “<strong class=\"root-Tkn6WL2y\">Common Shares</strong>”) at a price of C$0.18 per Common Share for aggregate gross proceeds of up to $783,000, and a concurrent non-brokered private placement financing (the “<strong class=\"root-Tkn6WL2y\">Warrant Private Placement</strong>” and, together with the Common Share Private Placement, the “<strong class=\"root-Tkn6WL2y\">Private Placements</strong>”) of up to 4,850,000 common share purchase warrants (each, a “<strong class=\"root-Tkn6WL2y\">Warrant</strong>”) at a price of C$0.05 per Warrant for aggregate proceeds of up to $242,500. Each Warrant issued pursuant to the Warrant Private Placement will entitle the holder thereof to purchase a common share in the capital of the Company at an exercise price of $0.18 for a period of 24 months from the date of issuance.</p><p class=\"\">Closing of the Private Placements is anticipated to occur on or about February 28, 2025. Closing is subject to the satisfaction of certain conditions, including, but not limited to, the receipt of all necessary regulatory and other approvals for the Private Placements. The net proceeds of the Private Placements are intended to be used for exploration activities at the Company’s Big Mack Property, for general administrative expenditures and for general working capital purposes.</p><p class=\"\">Subject to compliance with applicable regulatory requirements and in accordance with National Instrument 45-106 – Prospectus Exemptions (“<strong class=\"root-Tkn6WL2y\">NI 45-106</strong>”), the Common Shares issuable under the Common Share Private Placement will be offered for sale to purchasers resident in all of the provinces of Canada (except Quebec) pursuant to the listed issuer financing exemption under Part 5A.2 of NI 45-106 (the “<strong class=\"root-Tkn6WL2y\">LIFE Exemption</strong>”). Because the Common Share Private Placement is to be completed pursuant to the LIFE Exemption, the Common Shares issued to subscribers in the Common Share Private Placement will not be subject to resale restrictions in accordance with applicable Canadian securities laws. The Warrants issued pursuant to the Warrant Private Placement (and, to the extent that any Warrants are exercised within four months and one day of the date of issuance, any common shares issued upon the exercise of such Warrants) will be subject to a hold period of four months and one day from the date of issuance pursuant to applicable Canadian securities laws.</p><p class=\"\">There is an offering document dated February 4, 2025 related to the Common Share Private Placement that can be accessed under the Company’s profile at www.sedarplus.ca and on the Company’s website at www.panam-energy.com. This offering document contains additional detail regarding the Common Share Private Placement, including additional detail regarding the expected use of proceeds from the Private Placements. Prospective investors in the Common Share Private Placement should read this offering document before making an investment decision.</p><p class=\"\">The securities described herein have not been and will not be registered under the United States Securities Act of 1933, as amended, or any U.S. state securities laws, and may not be offered or sold in the United States absent registration or available exemptions from such registration requirements. This press release does not constitute an offer to sell or a solicitation of an offer to buy any securities in the United States, or in any jurisdiction in which such offer, solicitation or sale would be unlawful.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Pan American Energy Corp. </strong></p><p class=\"\">Pan American Energy Corp.  (OTCQB: PAANF) (FSE: SS60) is an exploration stage company engaged principally in the acquisition, exploration and development of mineral properties containing battery metals in North America.</p><p class=\"\">The Company has executed an option agreement in Canada with Magabra Resources pursuant to which it has acquired a 75% interest in the Big Mack Lithium Project, 80 km north of Kenora, Ontario. The Company can earn an additional 15% interest in Big Mack, for a total of 90% interest.</p><p class=\"\">To register for investor updates, please visit https://panam-energy.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">On Behalf of the Board of Directors</strong></p><p class=\"\">Paul Gorman</p><p class=\"\">Interim CEO</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\">Phone:(587)885-5970</p><p class=\"\">Email: info@panam-energy.com</p><p class=\"\">Cautionary Note Regarding Forward-Looking Statements</p><p class=\"\">Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words “could”, “intend”, “expect”, “believe”, “will”, “projected”, “estimated” and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on the Company’s current belief or assumptions as to the outcome and timing of such future events.</p><p class=\"\">In particular, this press release contains forward-looking information relating to, among other things, the Private Placements, including the total anticipated proceeds, the expected use of proceeds and the closing (including the proposed closing date) of the Private Placements. Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information, including the assumption that the Company will close the Private Placements on the timeline anticipated, will raise the anticipated amount of gross proceeds from the Private Placements and will use the proceeds of the Private Placements as anticipated. Those assumptions and factors are based on information currently available to the Company. Although such statements are based on reasonable assumptions of the Company’s management, there can be no assurance that any conclusions or forecasts will prove to be accurate.</p><p class=\"\">Forward-looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include: the risk that the Private Placements do not close on the timeline expected, or at all; the risk that the Company raises less than the anticipated amount of gross proceeds from the Private Placements; the risk that the Company does not use the proceeds from the Private Placements as currently expected; risks inherent in the exploration and development of mineral deposits, including risks relating to changes in project parameters as plans continue to be redefined and the risk that exploration and development activities will cost more than the amount budgeted for such activities by the Company; access and supply risks; operational risks; regulatory risks, including risks relating to the acquisition of the necessary licenses and permits; financing, capitalization and liquidity risks; and title and environmental risks. The forward-looking information contained in this release is made as of the date hereof, and the Company is not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward-looking information. The foregoing statements expressly qualify any forward-looking information contained herein.</p><p class=\"\">The Canadian Securities Exchange (CSE) has not reviewed, approved, or disapproved the contents of this press release.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXpQ3lK:0-pan-american-energy-announces-private-placement/",
            "pub_date": "2025-02-05 07:52:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1HS:0",
            "title": "Soybean barge basis firms, corn barge bids ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Basis bids for soybeans shipped by barge to the U.S. Gulf Coast ticked higher on Tuesday, and corn bids eased, as a second day of volatile trading in the grain and oilseed futures markets cooled some buyers' interest, traders said.</p><p class=\"\">* One market source said the pause in trade tensions between the U.S. and two of its top markets - Mexico and China - helped assuage traders' tariff bearish concerns. </p><p class=\"\">* But uncertainty over whether trade tensions will grow between the U.S. and top soy buyer China continued to weigh on the export market, traders said.</p><p class=\"\">* The U.S. Department of Agriculture confirmed private sales of 132,000 metric tons of U.S. corn to South Korea for shipment in the 2024/25 marketing year.</p><p class=\"\">* A group of South Korean flour mills issued a tender to purchase about 50,000 metric tons of milling wheat to be sourced from the United States only, European traders said on Tuesday.</p><p class=\"\">* Chicago Board of Trade soybean futures  jumped to their highest level since July, wheat futures  reached their highest level since November and corn prices  hovered near an October 2023 high reached last week.</p><p class=\"\">* Traders said they are closely tracking weather risks for South American crops, with drought in Argentina and excess rain in Brazil.</p><p class=\"\">* CIF Gulf soybean barges loaded in January were bid 2 cents higher than Monday, at 60 cents over CBOT March (SH25) futures, with no offers. February soybean barge bids were steady at 62 cents over futures.</p><p class=\"\">        * FOB export premiums for February soybean loadings turned 2 cents higher at 77 cents over futures.</p><p class=\"\">* CIF January corn barge bids were down a penny at 70 cents over CBOT March (CH25) futures, with no offers. February corn export premiums held flat at 78 cents over futures.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1HS:0-soybean-barge-basis-firms-corn-barge-bids-ease/",
            "pub_date": "2025-02-05 07:52:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446635:0",
            "title": "Japan Nominal Wage Growth Surges Amid Winter Bonuses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nominal wages in Japan rose 4.8% year-on-year in December 2024, up from 3.9% in November, driven by a significant increase in winter bonuses.</p><p class=\"\">This exceeded market expectations of a 3.8% growth and marked the highest wage growth in nearly three decades.</p><p class=\"\">Inflation-adjusted real wages, which reflect consumer purchasing power, also increased by 0.6% in December, marking the second consecutive month of positive growth.</p><p class=\"\">The surge was largely attributed to a 6.8% rise in special payments, primarily from companies' winter bonuses.</p><p class=\"\">The Bank of Japan has emphasized the need for broad-based wage hikes to support higher borrowing costs.</p><p class=\"\">However, a labor ministry official noted, \"Although monthly wages and base salaries are rising compared to the past, they are not keeping pace with prices.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446635:0-japan-nominal-wage-growth-surges-amid-winter-bonuses/",
            "pub_date": "2025-02-05 07:53:25",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA4TJSG3:0",
            "title": "Fuelpositive Provides Update On Filing Of Annual Financial Statements And Cease Trade Order",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FuelPositive Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FUELPOSITIVE PROVIDES UPDATE ON FILING OF ANNUAL FINANCIAL STATEMENTS AND CEASE TRADE ORDER</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FUELPOSITIVE CORP - ENGAGED IN CAPITAL-RAISING INITIATIVES AND DISCUSSIONS WITH MANITOBA GOVERNMENT</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA4TJSG3:0-fuelpositive-provides-update-on-filing-of-annual-financial-statements-and-cease-trade-order/",
            "pub_date": "2025-02-05 07:53:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463578:0",
            "title": "ANZ Group Holdings Buys Back Nearly 330,000 Ordinary Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ANZ Group Holdings  bought back 327,696 ordinary shares for AU$9.9 million, according to a Wednesday filing with the Australian and New Zealand bourses. </p><p class=\"\">UBS Securities Australia and Macquarie Securities brokered the transaction, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463578:0/",
            "pub_date": "2025-02-05 07:55:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:d08745f0d094b:0",
            "title": "SEC is scaling back its crypto enforcement unit: Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The US Securities and Exchange Commission is reportedly starting to scale back its 50-staff crypto enforcement unit.</p><p class=\"\">Some of the lawyers in the crypto unit will be assigned to other departments in the agency, The New York Times reported on Feb. 4, citing five people with knowledge of the matter, </p><p class=\"\">One of the crypto unit’s top lawyers was also moved from the SEC’s enforcement arm, which some complained was an unfair demotion, according to the sources.</p><p class=\"\">The report comes just hours after SEC Commission Hester Peirce outlined the regulator’s new approach to regulating the crypto markets, including evaluating the security status of crypto assets and potentially providing “retroactive relief” for certain token offerings. </p><p class=\"\">Peirce likened the SEC’s old approach as “careening” down the road while incessantly slamming on the enforcement breaks. </p><p class=\"\">“The crypto road trip on which the newly announced Crypto Task Force has embarked likewise should be more enjoyable and less risky than the crypto road trip the Commission has taken the industry on for the last decade,” she said. </p><p class=\"\">This is a developing story, and further information will be added as it becomes available.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:d08745f0d094b:0-sec-is-scaling-back-its-crypto-enforcement-unit-report/",
            "pub_date": "2025-02-05 07:40:17",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204013364:0",
            "title": "Chipotle's sales have been 'volatile.' Can new menu items, kitchen upgrades and AI smooth things out?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Bill Peters</p><p class=\"\">Some analysts said tougher comparisons, harsher weather and holiday timing may have put pressure on the fast-casual chain's recent sales</p><p class=\"\">Shares of Chipotle Mexican Grill Inc. slid after hours on Tuesday, after the Mexican fast-casual restaurant chain reported fourth-quarter sales and forecast full-year same-store sales growth that disappointed Wall Street.</p><p class=\"\">The company said it expects same-store sales for the year to increase in \"the low- to mid-single-digit range.\" Analysts polled by FactSet expected 5.4%.</p><p class=\"\">For the fourth quarter, Chipotle (CMG) reported revenue of $2.845 billion, up 13.1% year over year, with same-store sales up 5.4%. The company reported adjusted earnings per share of 25 cents.</p><p class=\"\">Analysts polled by FactSet expected Chipotle to report adjusted earnings per share of 24 cents, on sales of $2.85 billion and a same-store sales gain of 5.7%.</p><p class=\"\">Shares fell 3.1% after hours on Tuesday.</p><p class=\"\">Heading into the results, analysts were focused on whether the chain could keep up same-store sales growth this year, following solid trends last year, as shoppers grappling with higher costs of living remain picky about dining out.</p><p class=\"\">While fast-food chains, after raising prices, have tried to win back consumers with value deals, some analysts say customers believe they can get a better meal at fast-casual chains for not much more. But some analysts said tougher comparisons, harsher weather and holiday timing may have put pressure on Chipotle's recent sales.</p><p class=\"\">Still, Stifel analysts, in a note on Sunday, said items like Chipotle's smoked brisket likely remained popular, and said potential new limited-time offerings next month, along with efforts to upgrade kitchens, would help demand and service.</p><p class=\"\">-Bill Peters</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204013364:0/",
            "pub_date": "2025-02-05 07:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463577:0",
            "title": "Australian Banks Offers Assistance to Customers Impacted by Queensland Floods",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Australian Banking Association is offering financial relief to bank customers affected by recent severe floods in north Queensland, according to a Tuesday announcement from the group. </p><p class=\"\">AMP , ANZ Group Holdings , Bank of Queensland , Bendigo and Adelaide Bank , Commonwealth Bank of Australia , Macquarie Group , National Australia Bank , Suncorp  and Westpac Banking  are part of the association. </p><p class=\"\">The banks will offer a number of measures based on individual circumstances. This includes the deferral of upcoming credit card payments and the deferral of scheduled loan repayments, per the statement. </p><p class=\"\">They will also offer emergency increases in credit limit, restructuring of existing loans, waiver or refunds for fees and charges, as well as additional finance to help cover cash flow shortages. </p><p class=\"\">Macquarie shares fell almost 1% in early trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463577:0/",
            "pub_date": "2025-02-05 07:47:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013799:0",
            "title": "Brookfield Enters Contest for Australia's $1.9 Billion Insignia Financial — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Stuart Condie</p><p class=\"\">SYDNEY--Brookfield Asset Management made a US$1.93 billion proposal for Insignia Financial, becoming the Australian wealth manager's third suitor.</p><p class=\"\">Insignia on Wednesday said that Brookfield made a non-binding proposal of 4.60 Australian dollars, or US$2.88, a share. That is the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\">Brookfield's proposal is for cash or shares in an unlisted post-takeover entity, Insignia said.</p><p class=\"\">Brookfield, which made the approach through its Brookfield Capital Partners (U.K.) unit, already owns financial-services businesses in Australia. Local acquisitions include lender and asset manager La Trobe Financial, which cost US$1.1 billion in 2022.</p><p class=\"\">ASX-listed Insignia, which has opened its books to CC Capital and Bain, granted Brookfield limited due diligence on a non-exclusive basis in the hope of attracting a binding offer.</p><p class=\"\">Write to Stuart Condie at stuart.condie@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013799:0/",
            "pub_date": "2025-02-05 07:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013802:0",
            "title": "Artisan Partners Asset Management to Pay Higher Div for 4Q, Revenue and Earnings Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Beckerman</p><p class=\"\">Artisan Partners Asset Management declared a variable quarterly dividend and an annual special dividend that will pay more than their predecessors and posted higher fourth-quarter earnings.</p><p class=\"\">The investment firm's quarterly payout will be 84 cents, up from 82 cents for the third quarter. The special dividend is 50 cents a share, compared with a 34-cent payout a year ago.</p><p class=\"\">Artisan said fourth-quarter revenue was $297 million, up from $249 million in the 2023 fourth quarter. Adjusted earnings per share increased to $1.05 from 78 cents.</p><p class=\"\">Shares rose 2.8% to $45.81 after hours.</p><p class=\"\">Write to Josh Beckerman at josh.beckerman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013802:0/",
            "pub_date": "2025-02-05 07:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463576:0",
            "title": "Meteoric Resources Hits High-Grade Mineralization at Agostinho Prospect in Brazil; Shares Up 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meteoric Resources  struck high-grade mineralization following drilling activities at the Agostinho Prospect within its Caldeira rare earth ionic clay project in Brazil, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">Notable intercepts include up to 19,183 parts per million of total rare earth oxides (TREO) and enriched magnetic rare earth oxide (MREO) of up to 6,691 parts per million. It also reported MREO peak zones up to 38% of TREO with an average of 30.4%, up 7.4% from the Global Resource average, per the filing. </p><p class=\"\">The mining company's shares were up 5% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463576:0/",
            "pub_date": "2025-02-05 07:48:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013809:0",
            "title": "Nikkei May Rise as Fears About U.S. Tariffs Subside — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013809:0/",
            "pub_date": "2025-02-05 07:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:2ca32d1619e65:0",
            "title": "C3.ai Director Richard C Levin Sells 12,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Levin Richard C</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$358,080</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1577526/000141588925003018/xslF345X05/form4-02042025_110212.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">C3.ai Director, Richard C Levin, sold 12,000 shares of Class A Common Stock on February 3, 2025, at a weighted average price of $29.84 per share, totaling $358,080. Following the transaction, Levin directly owns 161,664 shares of the company.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1577526/000141588925003018/xslF345X05/form4-02042025_110212.xml\" rel=\"nofollow\" target=\"_blank\">C3.ai, Inc. [ AI ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:2ca32d1619e65:0-c3-ai-director-richard-c-levin-sells-12-000-shares/",
            "pub_date": "2025-02-05 07:50:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013790:0",
            "title": "Mattel Expects Banner Year for Barbie — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mattel CEO Ynon Kreiz says on a call with analysts that the company expects Barbie's performance to improve in 2025. The famous doll posted declining gross billings--which measures sales to retailers before adjustments--throughout 2024. This was largely due to a comparison to 2023 figures, which were highly inflated due to the blockbuster \"Barbie\" movie, Kreiz says. This year, though, the doll will face easier year-over-year comparisons, he says. And the company plans to optimize demand creation, release new products and lean further into momentum with adult fans. Mattel shares rise 10% after the company guides for higher profit and revenue in 2025. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013790:0/",
            "pub_date": "2025-02-05 07:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013792:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1845 ET - Mattel CEO Ynon Kreiz says on a call with analysts that the company expects Barbie's performance to improve in 2025. The famous doll posted declining gross billings--which measures sales to retailers before adjustments--throughout 2024. This was largely due to a comparison to 2023 figures, which were highly inflated due to the blockbuster \"Barbie\" movie, Kreiz says. This year, though, the doll will face easier year-over-year comparisons, he says. And the company plans to optimize demand creation, release new products and lean further into momentum with adult fans. Mattel shares rise 10% after the company guides for higher profit and revenue in 2025. (connor.hart@wsj.com)</p><p class=\"\">1832 ET - As reporting season gets underway, Citi identifies Australian real-estate investment trusts that could positively surprise with their results. It thinks Ingenia Communities's earnings guidance could beat consensus hopes on stronger sales. Analyst Howard Penny tips Goodman to update its data center pipeline, driving growth expectations. \"Stronger than consensus expected sales growth, and positive spreads could support growth\" for mall owner Scentre, Citi says. And turning to GPT, Citi expects its annual result to start \"setting a foundation for medium-term growth off a reasonable value.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1831 ET - Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1828 ET - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1818 ET - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1814 ET - California increased its minimum wages for fast-food workers last year, prompting restaurants to increase prices and hurt their sales in the process. Chipotle Mexican Grill said sales in its restaurants and across the industry remain depressed in the state as a result. Chipotle said it's holding off additional price increases for now beyond a nationwide 2% increase taken in December. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1724 ET - Brambles may disappoint some investors by deciding against upgrading its annual guidance at its first-half result announcement, according to its bull at UBS. Analyst Andre Fromyhr writes in a note that the stronger U.S. dollar makes Brambles' free cashflow guidance more challenging than when it was announced. Even so, he expects the global pallet giant to maintain guidance. Fromyhr reckons that Brambles needs to consistently deliver US$800 million annual free cashflow without strong price growth or dropping capex before the stock rerates further. UBS lifts its target price 18% to A$22.50 and keeps a buy rating on the stock, which is at A$19.26 ahead of the open. (stuart.condie@wsj.com)</p><p class=\"\">1714 ET - Profit margins of Australian companies have probably already troughed at mid-cycle levels, UBS says. Many of Australia's biggest listed companies will report earnings this month, giving investors the chance to do a pulse check on trading conditions. Strategist Richard Schellbach highlights prior concerns about companies' ability to maintain profit margins. But these concerns were unfounded, UBS says, as management was able to pass costs on to their customers. \"The latest monthly data points still show business selling prices moving commensurately with their input costs,\" UBS says. And with the unemployment rate remaining low over the past six months, \"this dynamic of being able to pass through costs remains favorable in most industries,\" UBS adds. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1711 ET - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1658 ET - NextDC's bull at Citi sees a lack of contract announcements and not worries over the impact of DeepSeek as the most likely explanation for the data-center operator's share-price underperformance. Analyst Siraj Ahmed acknowledges that the stock has lagged peers, but tells clients in a note that the accelerated fit-out of Melbourne centers suggests that new contract wins are probably on the way. He cuts his target price on the stock by 6.5% to A$18.70 but reiterates his buy rating. Shares are at A$14.74 ahead of the open. (stuart.condie@wsj.com)</p><p class=\"\">1656 ET - Mondelez International said it expects adjusted earnings per share to decline about 10% in 2025 due to cocoa cost inflation. The Chicago-based food and snack company produces Oreo, Toblerone and Cadbury chocolate, among other cocoa-based products. High cocoa prices have forced the snack giant to raise some prices in recent quarters. \"Our teams are well-equipped to stay agile and take the necessary actions to navigate this challenging operating environment,\" CEO Dirk Van de Put said. Shares fall 4.5% after hours. (roshan.fernandez@wsj.com)</p><p class=\"\">1629 ET - Australian shares look set to reclaim some of their recent tariff-driven losses when the local market opens. ASX futures are up by 0.6% ahead of Wednesday's session, suggesting that the S&amp;P/ASX 200 benchmark index will rally from its 1.9% decline across consecutive losses so far this week. U.S. indices provided a positive lead, bouncing despite China's announcement of retaliatory tariffs. The DJIA rose 0.3%, the S&amp;P 500 gained 0.7%, and the Nasdaq Composite put on 1.35%. ASX 200 companies scheduled to report earnings on Wednesday include Beach Energy. Real-estate investor BWP Trust said its first-half profit rose almost threefold on the same time a year earlier. (stuart.condie@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013792:0/",
            "pub_date": "2025-02-05 07:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV3AT:0",
            "title": "Carlisle Companies Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Carlisle Companies Inc  reported quarterly adjusted earnings of $4.47​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $4.17.  The mean expectation of eight analysts for the quarter was for earnings of $4.42 per share. Wall Street expected results to range from $4.31  to $4.54 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 0.4% to $1.12 billion from a year ago; analysts expected $1.16 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Carlisle Companies Inc's reported EPS for the quarter was $3.57​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $162.8 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Carlisle Companies Inc shares had risen by 3.4% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.1% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 3 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the construction supplies &amp; fixtures peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Carlisle Companies Inc is $467.50 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:35 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">4.42</p></td><td><p class=\"\">4.47</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">5.82</p></td><td><p class=\"\">5.78</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">5.97</p></td><td><p class=\"\">6.24</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.82</p></td><td><p class=\"\">3.72</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV3AT:0-carlisle-companies-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:36:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV188:0",
            "title": "Keppel Says Close To Interim FUM Target Of S$100 Billion By End-2026",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLOSE TO INTERIM FUM TARGET OF S$100 BILLION BY END-2026, HOPEFUL OF ACHIEVING IT AHEAD OF SCHEDULE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV188:0-keppel-says-close-to-interim-fum-target-of-s-100-billion-by-end-2026/",
            "pub_date": "2025-02-05 07:36:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463560:0",
            "title": "Yokohama Rubber Completes Acquisition of Goodyear's Off-the-Road Tire Business",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Yokohama Rubber Co.  finalized the acquisition of Goodyear's mining and construction machinery tire business, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The Japanese tire maker said the move strengthens its off-highway tire segment under its medium-term growth plan, Yokohama Transformation 2026. </p><p class=\"\">The company plans to consolidate the acquired business from the first quarter of 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463560:0/",
            "pub_date": "2025-02-05 07:36:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463575:0",
            "title": "ASX Small-Cap Stocks to Watch",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Investors are likely to keep an eye on the following small-cap stocks listed on the Australian Securities Exchange. </p><p class=\"\">Golden State Mining </p><p class=\"\">Golden State Mining submitted heritage survey requests for the Yule and Southern Cross East projects in Western Australia, while a geochemical results review is underway to assess the drilling potential at the Canning Hill project. </p><p class=\"\">Westar Resources </p><p class=\"\">Westar Resources received heritage approvals for proposed reverse circulation drilling at the Mindoolah Gold Mining Center, within the Mindoolah gold project in Western Australia. The program is expected to start in mid-February. </p><p class=\"\">FMR Resources </p><p class=\"\">FMR Resources said the refinement of very low frequency-electromagnetic targets and 3D inversion modeling confirmed conductive trends, enhancing planned drill targets at its Fairfield copper project in Canada. </p><p class=\"\">Magnum Mining and Exploration </p><p class=\"\">Magnum Mining and Exploration lodged a prospectus with the Australian Securities and Investments Commission regarding a pro-rata entitlement offer of two new shares for every five shares held on Feb. 10, along with one free attaching option for every share applied for. The entitlement offer will raise up to AU$1.9 million by issuing up to 323.7 million shares at AU$0.006 apiece and 323.7 million options exercisable at AU$0.012 within three years. </p><p class=\"\">Sipa Resources </p><p class=\"\">Sipa Resources is acquiring four new gold projects, three in South Australia and one in Western Australia, with plans for exploration underway. The initial focus is on gold-in-calcrete sampling on the Tunkillia North project in South Australia.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463575:0-asx-small-cap-stocks-to-watch/",
            "pub_date": "2025-02-05 07:38:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1B2:0",
            "title": "Keppel Proposes Final Cash Dividend Of SG 19.0 CTS/Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PROPOSED FINAL CASH DIVIDEND OF  SG 19.0 CTS/SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1B2:0-keppel-proposes-final-cash-dividend-of-sg-19-0-cts-share/",
            "pub_date": "2025-02-05 07:38:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013770:0",
            "title": "South Korea January Inflation Accelerates Faster Than Expected — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">South Korea's headline inflation accelerated at a faster-than-expected pace in the first month of the year to stay above the central bank's 2% target.</p><p class=\"\">The benchmark consumer-price index rose 2.2% in January from a year earlier, following a 1.9% gain in December, on higher prices for groceries and energy products, the country's statistics office said Wednesday.</p><p class=\"\">The latest print, the highest since July, beat the median forecast from 11 economists in a Wall Street Journal poll tipping a 2.0% gain for January.</p><p class=\"\">The pickup in price growth was largely led by Lunar New Year holiday-driven demand for agricultural and fishery products as well as higher gasoline and diesel prices, according to analysts.</p><p class=\"\">Compared with the prior month, the index gained 0.7% in January, also beating the median forecast in the WSJ poll for a 0.5% increase. In December, consumer prices rose 0.4% from the previous month.</p><p class=\"\">Core CPI, which strips out volatile food and energy prices, rose 1.9% from a year earlier in January and gained 0.5% from the previous month.</p><p class=\"\">South Korea's largely subdued inflation, alongside weakening exports growth, has opened up room for the central bank to ease monetary policy settings further.</p><p class=\"\">Both the Bank of Korea and the government forecast that inflation will trend lower in 2025 after years of efforts to curb price pressures. Inflation averaged 2.3% in 2024.</p><p class=\"\">The BOK, which in November forecast that inflation would cool to 1.9% this year, is set to revise its outlook later in February, amid growing downside risks.</p><p class=\"\">The finance ministry in January projected that inflation will average 1.8% in 2025, down from its earlier forecast of 2.1%.</p><p class=\"\">The BOK in January kept its policy rate unchanged after back-to-back rate cuts in October and November but signaled that more easing is coming down the road.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013770:0-south-korea-january-inflation-accelerates-faster-than-expected-update/",
            "pub_date": "2025-02-05 07:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463574:0",
            "title": "Westpac Banking Confirms Investment in Lawpath to Grow Small Business Lending",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Westpac Banking  confirmed its investment and partnership with legal services provider Lawpath to support startups and small-to-medium-sized businesses, the company said in a statement on Wednesday. </p><p class=\"\">An Australian Financial Review report earlier today said the investment is AU$10 million. </p><p class=\"\">Lawpath is an online platform that provides businesses access to affordable legal, accounting, and compliance technology services, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463574:0/",
            "pub_date": "2025-02-05 07:39:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1WQ:0",
            "title": "Singapore's Keppel annual profit rises 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Singapore's Keppel Ltd  posted a 5% rise in its full-year underlying profit on Wednesday, helped by strong performance across it segments.</p><p class=\"\">The asset manager's net profit from continuing operations for the 12 months ended Dec. 31 rose to S$1.06 billion ($784.20 million), from S$1.02 billion recorded a year earlier. </p><p class=\"\">($1 = 1.3517 Singapore dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1WQ:0-singapore-s-keppel-annual-profit-rises-5/",
            "pub_date": "2025-02-05 07:39:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:88fc8ab1545d0:0",
            "title": "Apple Director Arthur D. Levinson Sells 1,516 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Levinson Arthur D</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$343,146</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1214128/000032019325000019/xslF345X05/wk-form4_1738711997.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Arthur D. Levinson, serving as a Director at Apple, sold 1,516 shares of Common Stock on February 3, 2025, at a price of $226.3501 per share, totaling $343,146. Following this transaction, Levinson directly owns 4,159,576 shares and indirectly owns 56,000 shares through his spouse.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1214128/000032019325000019/xslF345X05/wk-form4_1738711997.xml\" rel=\"nofollow\" target=\"_blank\">Apple Inc. [ AAPL ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:88fc8ab1545d0:0-apple-director-arthur-d-levinson-sells-1-516-shares/",
            "pub_date": "2025-02-05 07:40:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1ZK:0",
            "title": "Simon Property beats estimates for quarterly funds from operations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Commercial real estate investment trust Simon Property Group  beat market expectations for fourth-quarter funds from operations on Tuesday, as leasing demand remained steady for its U.S. malls and premium outlets.</p><p class=\"\">The company saw revenue growth across its businesses while maintaining cost discipline, and said it plans to open premium outlets in Jakarta, Indonesia in March.</p><p class=\"\">Simon Property expects 2025 net income in a range of $6.95 to $7.20 per share, above analysts' average estimate of $6.58, according to data compiled by LSEG.</p><p class=\"\">The company saw occupancy rise to 96.5% as of Dec. 31, compared with 95.8% last year. Base minimum rent per square foot was $58.26, a 2.5% increase.</p><p class=\"\">It reported FFO, a key measure of performance of a REIT, of $3.68 per share for the quarter, above $3.41 per share that analysts had estimated.</p><p class=\"\">Quarterly revenue from lease income came in at $1.43 billion, compared with $1.40 billion analysts had estimated.</p><p class=\"\">Shares of the company were largely unchanged in trading after the bell. Its stock rose 21% in 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1ZK:0-simon-property-beats-estimates-for-quarterly-funds-from-operations/",
            "pub_date": "2025-02-05 07:40:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013736:0",
            "title": "Nufarm's Earnings at Risk From U.S.-China Tariff Blows — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crop chemicals producer Nufarm's earnings likely aren't immune from tit-for-tat trade measures taken by the U.S. and China, contends Macquarie. The U.S. has imposed an additional 10% tariff on Chinese imports, prompting Beijing to respond. Macquarie highlights that 28% of Nufarm's earnings are from North America, and the company relies heavily on sourcing agricultural chemicals from China to sell into markets including the U.S. Nufarm's costs are likely to rise as the trade war unfolds. Still, Nufarm has some production in the U.S. and recently upgraded its manufacturing capacity in Australia so has \"some ability to self-source,\" says Macquarie. It retains a neutral call on Nufarm. (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013736:0/",
            "pub_date": "2025-02-05 07:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013732:0",
            "title": "Finning Sees Growth in Chile, Mixed Results in Canada — Commodity Comment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Stephen Nakrosis</p><p class=\"\">Finning International, the world's largest Caterpillar dealer, said growing demand for copper is underpinning its outlook for Chile, while its outlook for Western Canada is mixed.</p><p class=\"\">On the South America outlook:</p><p class=\"\">Finning said in Chile it is seeing \"growing global demand for copper, strong copper prices, capital deployment into large-scale brownfield expansions, and customer confidence to invest in brownfield and greenfield projects.\" It added it is also seeing \"a broad-based level of quoting, tender, and award activity for mining equipment, product support, and technology solutions.\"</p><p class=\"\">While activity levels and outlook remain positive, Finning said it is expecting a more challenging environment when attracting and retaining qualified labor.</p><p class=\"\">The company also said it expects demand from large contractors supporting mining operations, with infrastructure construction activity remaining steady.</p><p class=\"\">Finning said it continues to take a low-risk approach in Argentina. However, at the same time, it is positioning itself to capture opportunities, particularly in the oil and gas and mining sectors, it said. \"The operating environment remains dynamic, and we continue to closely monitor the government's new rules and policies, some of which are helping drive large-scale investment.\"</p><p class=\"\">On the Western Canada outlook:</p><p class=\"\">Finning said it has a mixed outlook for Western Canada, as it expects large customers to continue practicing spending discipline as they work to achieve operating cost targets. However, these customers are expected to renew, maintain, and rebuild aging fleets going forward, the company said.</p><p class=\"\">While ongoing commitments from federal and provincial governments and private sector projects will support activity in the construction sector, it is expected these projects will take time to advance, Finning said.</p><p class=\"\">The company also said it sees opportunities for its power systems business in the face of growing demand for reliable, efficient and sustainable electric power solutions across communities in Western Canada.</p><p class=\"\">On UK and Ireland operations:</p><p class=\"\">Demand in the U.K. construction sector is expected to remain soft, Finning said.</p><p class=\"\">\"In power systems, quoting activity remains strong, driven by healthy demand for primary and backup power generation, particularly in the data center market,\" the company added.</p><p class=\"\">Write to Stephen Nakrosis at stephen.nakrosis@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013732:0-finning-sees-growth-in-chile-mixed-results-in-canada-commodity-comment/",
            "pub_date": "2025-02-05 07:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSlZwsJa:0",
            "title": "Petroff Amshen LLP Urges New Yorkers to Review Credit Reports for Hidden Errors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inaccurate credit reports can lead to denied loans, higher interest rates, and lost job opportunities. Petroff Amshen LLP highlights the importance of proactive credit monitoring and offers legal assistance to correct discrepancies, empowering consumers to protect their financial future.</p><p class=\"\">NEW YORK CITY, NEW YORK / ACCESS Newswire / February 4, 2025 / Petroff Amshen LLP is shedding light on the complexities of credit reports and the impact they have on financial stability and opportunity. In today's financial landscape, credit reports influence everything from loan approvals to employment decisions. Yet, many consumers remain unaware of the hidden inaccuracies that can undermine their financial standing. Petroff Amshen LLP emphasizes the importance of understanding and maintaining accurate credit reports to safeguard against unexpected setbacks.</p><p class=\"\">A credit report is more than just a collection of numbers; it serves as a detailed record of an individual's financial history. Compiled by major credit reporting agencies like Equifax, Experian, and TransUnion, these reports contain personal information, credit accounts, public records, and a list of entities that have accessed the report. Lenders, employers, and landlords rely on this information to assess creditworthiness and reliability. Despite their significance, credit reports are not immune to errors, and even small discrepancies have major financial repercussions.</p><p class=\"\">Petroff Amshen LLP frequently encounters cases where clients face hurdles due to errors on their credit reports. Unrecognized charges, outdated information, and duplicate entries are some of the most common issues consumers face. Fraudulent activity or clerical errors can result in debts being falsely attributed to individuals. Outdated debts that should no longer appear on credit reports can negatively impact credit scores, while duplicate entries can inflate the amount owed, prejudicing lenders' perceptions.</p><p class=\"\">The firm urges consumers to be proactive in reviewing their credit reports. By law, New York residents are entitled to a free credit report once a year from each of the three major credit reporting agencies. Petroff Amshen LLP advises individuals to take advantage of this opportunity and thoroughly review all three major reports for any inconsistencies. Documenting any discrepancies and maintaining records of disputed charges is crucial. Submitting disputes directly to the credit reporting agencies with clear evidence ensures a stronger case for correction.</p><p class=\"\">Taking swift action is essential, but resolving credit report errors is not always straightforward. Some issues require persistent follow-ups to ensure corrections are made within the legally mandated timeframe. When disputes become complex or errors persist despite multiple attempts, seeking legal assistance can be the most effective course of action. Petroff Amshen LLP offers dedicated services to navigate these challenges, leveraging federal and state laws to hold credit bureaus accountable. The firm meticulously reviews each case, identifying errors and managing all communication with credit bureaus and creditors, ultimately alleviating the burden on clients.</p><p class=\"\">Beyond resolving errors, Petroff Amshen LLP believes in educating their clients so they can understand how credit reports function and the rights afforded to them under the law. This allows consumers to better protect themselves from future issues. This proactive approach not only addresses immediate concerns but also fosters long-term financial stability.</p><p class=\"\">Accurate credit reports are essential for accessing financial opportunities, securing housing, and advancing careers. Petroff Amshen LLP is committed to ensuring that consumers' credit histories reflect their true financial position. By advocating for consumer rights and providing professional legal assistance, the firm plays a critical role in helping individuals regain control of their financial futures. For those facing credit report discrepancies or seeking guidance, Petroff Amshen LLP offers the knowledge and legal support necessary to navigate these challenges.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Gabriel Botero</p><p class=\"\"><em>Media Relations</em></p><p class=\"\">media@petroffamshen.com</p><p class=\"\">(718) 336-4200</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Petroff Amshen LLP</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSlZwsJa:0/",
            "pub_date": "2025-02-05 07:31:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV3AG:0",
            "title": "DXC Technology Co reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DXC Technology Co  reported quarterly adjusted earnings of 92 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 87 cents.  The mean expectation of eleven analysts for the quarter was for earnings of 77 cents per share. Wall Street expected results to range from 72 cents to 82 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 5.1% to $3.23 billion from a year ago; analysts expected $3.25 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DXC Technology Co's reported EPS for the quarter was 31 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $57 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DXC Technology Co shares had risen by 10.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 11.7% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 8 \"hold\" and 3 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the it services &amp; consulting peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for DXC Technology Co is $22.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.77</p></td><td><p class=\"\">0.92</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.72</p></td><td><p class=\"\">0.93</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.58</p></td><td><p class=\"\">0.74</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.83</p></td><td><p class=\"\">0.97</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV3AG:0-dxc-technology-co-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:31:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013739:0",
            "title": "Four Australian Property Owners That Could Beat Market Expectations — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">As reporting season gets underway, Citi identifies Australian real-estate investment trusts that could positively surprise with their results. It thinks Ingenia Communities's earnings guidance could beat consensus hopes on stronger sales. Analyst Howard Penny tips Goodman to update its data center pipeline, driving growth expectations. \"Stronger than consensus expected sales growth, and positive spreads could support growth\" for mall owner Scentre, Citi says. And turning to GPT, Citi expects its annual result to start \"setting a foundation for medium-term growth off a reasonable value.\" (david.winning@wsj.com; @dwinningWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013739:0/",
            "pub_date": "2025-02-05 07:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}