{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1HI:0",
            "title": "Equinor ASA reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA  reported quarterly adjusted earnings of 63 cents​​ per share for the quarter ended December 31, identical to the same quarter last year.  The lone analyst forecast for the quarter was for earnings of 62 cents per share. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 7.2% to $26.42 billion from a year ago; analysts expected $25.97 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA's reported EPS for the quarter was 73 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $2 billion.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Equinor ASA shares had risen by 4.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 23.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the integrated oil &amp; gas peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Equinor ASA is $29.39 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 11:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.62</p></td><td><p class=\"\">0.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.74</p></td><td><p class=\"\">0.79</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.85</p></td><td><p class=\"\">0.84</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.80</p></td><td><p class=\"\">0.96</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1HI:0-equinor-asa-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 20:00:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr7NGvkh:0",
            "title": "Changes in the KONE Executive Board",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>KONE Oyj<p class=\"\">KONE Corporation, stock exchange release, February 5, 2025, at 2:00 p.m. EET</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Changes in the KONE Executive Board</strong></p><p class=\"\">Nicolas Alchal has been appointed Executive Vice President, Commercial &amp; Operations as of April 1, 2025. He continues to be part of the KONE Executive Board, reporting to Philippe Delorme, President and CEO. Nicolas will continue in his current role as interim Executive Vice President for KONE’s Europe organization, until Karla Lindahl returns from parental leave in late March.</p><p class=\"\">Nicolas succeeds Axel Berkling who has decided to step down from his position as Executive Vice President for Commercial &amp; Operations as of March 31. Following this date, Axel will continue to serve the company as an Executive Advisor until the end of August 2025, after which he will pursue other opportunities outside of KONE. </p><p class=\"\">Kaori Uehigashi has been appointed Executive Vice President, Strategy &amp; Transformation as of early May 2025. She continues to be a member of the Executive Board, reporting to Philippe Delorme, having served as the interim leader for the Strategy &amp; Transformation organization since January 2024. </p><p class=\"\">“I want to thank Axel for his outstanding commitment to KONE over the past 26 years. He has been a member of the KONE Executive Board since 2016, and we have greatly benefited from his extensive business acumen and values-based leadership. I wish him all the best in his future endeavors. I also want to congratulate Nicolas and Kaori and look forward to their continued contributions in driving KONE’s strategy forward together with the rest of the Executive Board,” says Philippe Delorme, President and CEO.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Kaija Bridger, Executive Vice President, People and Communications, tel. +358 20 4751</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sender:</strong></p><p class=\"\">KONE Corporation</p><p class=\"\">Philippe Delorme</p><p class=\"\">President and CEO</p><p class=\"\">Kaija Bridger</p><p class=\"\">Executive Vice President, People &amp; Communications</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About KONE</strong></p><p class=\"\">At KONE, our purpose is to shape the future of cities. As a global leader in the elevator and escalator industry, we move two billion people every day, making their journeys safe, convenient, and reliable with smart and sustainable People Flow®. In 2024, KONE had annual sales of EUR 11.0 billion, and at the end of the year over 60,000 employees in close to 70 countries. KONE class B shares are listed on the Nasdaq Helsinki Ltd. in Finland.</p><p class=\"\">www.kone.com</p><p class=\"\">https://news.cision.com/kone-oyj/r/changes-in-the-kone-executive-board%2Cc4101011</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr7NGvkh:0-changes-in-the-kone-executive-board/",
            "pub_date": "2025-02-05 20:00:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1HL:0",
            "title": "GSK plc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc  reported quarterly adjusted earnings of 59 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 72 cents.  The mean expectation of two analysts for the quarter was for earnings of 44 cents per share. Wall Street expected results to range from 37 cents to 50 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 4% to $10.40 billion from a year ago; analysts expected $9.68 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc's reported EPS for the quarter was 26 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GSK plc shares had risen by 3.0% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 4 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the pharmaceuticals peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for GSK plc is $41.50 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 11:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">0.59</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.24</p></td><td><p class=\"\">1.29</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">1.10</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.91</p></td><td><p class=\"\">1.09</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1HL:0-gsk-plc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 20:00:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309610:0",
            "title": "Calibre Mining Adds 30% to Contained Gold at Leprechaun Open Pit of Valentine Gold Mine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Calibre Mining  on Wednesday released additional drill results from its Leprechaun open pit at the Valentine gold mine in Newfoundland and Labrador, adding 30% to contained gold. </p><p class=\"\">The results of drilling have so far demonstrated 29% more ore tonnes at a 1% higher grade for 30% more gold than the comparable area in the 2022 mineral reserve model at an ore-waste cut-off of 0.38 grams per tonne (g/t) gold. </p><p class=\"\">The grade distribution indicates that applying a higher cut-off grade will result in processing higher grade material, Calibre CEO Darren Hall said in a release. </p><p class=\"\">At a 0.7 g/t cut-off, the reserve model estimated 660,000 tonnes at 2.02 g/t but the ore control model for a similar tonnage results in 18% higher grade by increasing the cut-off to 1.0 g/t. </p><p class=\"\">The findings could result in increased metal production and extend the mine life, Hall noted.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309610:0/",
            "pub_date": "2025-02-05 20:00:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309713:0",
            "title": "Earnings Flash (DAY.TO) DAYFORCE INC. Posts Q4 Revenue US$465.2 Million, vs. FactSet Est of C$651.0M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309713:0/",
            "pub_date": "2025-02-05 20:00:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004729:0",
            "title": "Fiserv Reports Fourth Quarter and Full Year 2024 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(12:01 GMT) </strong>*Fiserv 4Q EPS $1.64 &gt;FI<br/><strong class=\"root-Tkn6WL2y\">(12:01 GMT) </strong>*Fiserv 4Q Net $938M &gt;FI<br/><strong class=\"root-Tkn6WL2y\">(12:01 GMT) </strong>*Fiserv 4Q Rev $5.25B &gt;FI<br/><strong class=\"root-Tkn6WL2y\">(12:01 GMT) </strong>*Fiserv 4Q Adj EPS $2.51 &gt;FI<br/><strong class=\"root-Tkn6WL2y\">(12:01 GMT) </strong>Press Release: Fiserv Reports Fourth Quarter and Full Year 2024 Results</p><p class=\"\">Fiserv Reports Fourth Quarter and Full Year 2024 Results</p><p class=\"\">GAAP revenue growth of 7% both in the quarter and for the full year;</p><p class=\"\">GAAP EPS increased 13% in the quarter and 8% for the full year;</p><p class=\"\">Operating cash flow was $6.63 billion for the full year;</p><p class=\"\">Organic revenue growth of 13% in the quarter and 16% for the full year;</p><p class=\"\">Adjusted EPS increased 15% in the quarter and 17% for the full year;</p><p class=\"\">Free cash flow was $5.23 billion for the full year;</p><p class=\"\">Company expects 2025 organic revenue growth of 10% to 12%</p><p class=\"\">and adjusted EPS of $10.10 to $10.30, or growth of 15% to 17%</p><p class=\"\">MILWAUKEE--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Fiserv, Inc. , a leading global provider of payments and financial services technology solutions, today reported financial results for the fourth quarter and full year 2024.</p><p class=\"\">Fourth Quarter and Full Year 2024 GAAP Results</p><p class=\"\">GAAP revenue for the company increased 7% to $5.25 billion in the fourth quarter of 2024 compared to the prior year period, with 11% growth in the Merchant Solutions segment and 3% growth in the Financial Solutions segment. GAAP revenue for the company increased 7% to $20.46 billion for the full year 2024 compared to the prior year, with 10% growth in the Merchant Solutions segment and 4% growth in the Financial Solutions segment.</p><p class=\"\">GAAP earnings per share was $1.64 in the fourth quarter and $5.38 for the full year 2024, an increase of 13% and 8%, respectively, compared to the prior year periods. The full year 2024 included a $595 million non-cash impairment charge related to one of the company's equity method investments, as well as a $147 million non-cash settlement charge in the fourth quarter for terminated pension plans. The full year 2023 included a $172 million gain related to the sale of the company's financial reconciliation business.</p><p class=\"\">GAAP operating margin was 31.8% and 28.7% in the fourth quarter and full year 2024 compared to 29.4% and 26.3% in the fourth quarter and full year 2023. GAAP operating margin in the Merchant Solutions segment was 39.2% and 37.0% in the fourth quarter and full year 2024 compared to 37.7% and 34.1% in the fourth quarter and full year 2023. GAAP operating margin in the Financial Solutions segment was 51.7% and 47.3% in the fourth quarter and full year 2024 compared to 48.4% and 45.9% in the fourth quarter and full year 2023. Net cash provided by operating activities was $6.63 billion for the full year 2024.</p><p class=\"\">\"Fiserv's track record of growth and consistency continued through 2024 — our fourth year in a row of double-digit organic revenue growth and 39(th) consecutive year of double-digit adjusted earnings per share growth,\" said Frank Bisignano, Chairman and Chief Executive Officer of Fiserv. \"The strength and sustainability of Fiserv's performance is a testament to our unparalleled business model which generates high recurring revenue, strong incremental margin, and healthy free cash flow.\"</p><p class=\"\">Fourth Quarter and Full Year 2024 Non-GAAP Results and Additional Information</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Adjusted revenue increased 7% to $4.90 billion in the fourth quarter   and 7% to $19.12 billion for the full year 2024 compared to the prior   year periods.     </li><li class=\"listItem-bmN0_SHH\">Organic revenue growth was 13% in the fourth quarter of 2024, led by   23% growth in the Merchant Solutions segment and 4% growth in the   Financial Solutions segment.     </li><li class=\"listItem-bmN0_SHH\">Organic revenue growth was 16% for the full year 2024, led by 27%   growth in the Merchant Solutions segment and 6% growth in the Financial   Solutions segment.     </li><li class=\"listItem-bmN0_SHH\">Adjusted earnings per share increased 15% to $2.51 in the fourth   quarter and 17% to $8.80 for the full year 2024 compared to the prior   year periods.     </li><li class=\"listItem-bmN0_SHH\">Adjusted operating margin increased 180 basis points to 42.9% in the   fourth quarter and 170 basis points to 39.4% for the full year 2024   compared to the prior year periods.     </li><li class=\"listItem-bmN0_SHH\">Adjusted operating margin increased 150 basis points to 39.2% in the   Merchant Solutions segment and 320 basis points to 51.7% in the Financial   Solutions segment in the fourth quarter of 2024, compared to the prior   year period.     </li><li class=\"listItem-bmN0_SHH\">Adjusted operating margin increased 290 basis points to 37.0% in the   Merchant Solutions segment and 130 basis points to 47.3% in the Financial   Solutions segment for the full year 2024, compared to the prior year.     </li><li class=\"listItem-bmN0_SHH\">The company repurchased 6.1 million shares of common stock for $1.3   billion in the fourth quarter and 33.9 million shares of common stock for   $5.5 billion in the full year 2024.     </li><li class=\"listItem-bmN0_SHH\">In January 2025, Fiserv was named one of Fortune(R) World's Most   Admired Companies(TM), a recognition received by the company for 10 of   the last 11 years.   </li></ul><p class=\"\">Outlook for 2025</p><p class=\"\">Fiserv expects organic revenue growth of 10% to 12% and adjusted earnings per share of $10.10 to $10.30, representing growth of 15% to 17%, for 2025.</p><p class=\"\">\"We are confident in our ability to meet or beat the medium-term outlook provided at our November 2023 investor conference, as ongoing Merchant and Financial Solutions initiatives are having early success,\" said Bisignano. \"Our 2025 guidance reflects a continuation of our product, client and distribution strategies and our commitment to operational excellence to drive outperformance.\"</p><p class=\"\">Segment Realignment</p><p class=\"\">The company realigned its reportable segments during the first quarter of 2024 to correspond with changes in its business designed to further enhance operational performance in the delivery of its integrated portfolio of products and solutions to its financial institution clients (\"Segment Realignment\"). The company's new reportable segments are Merchant Solutions and Financial Solutions. Segment results for the three months and full year ended December 31, 2023 have been recast to reflect the Segment Realignment.</p><p class=\"\">Earnings Conference Call</p><p class=\"\">The company will discuss its fourth quarter and full year 2024 results in a live webcast at 7 a.m. CT on Wednesday, February 5, 2025. The webcast, along with supplemental financial information, can be accessed on the investor relations section of the Fiserv website at investors.fiserv.com. A replay will be available approximately one hour after the conclusion of the live webcast.</p><p class=\"\">About Fiserv</p><p class=\"\">Fiserv, Inc. , a Fortune 500(TM) company, aspires to move money and information in a way that moves the world. As a global leader in payments and financial technology, the company helps clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and digital banking solutions; card issuer processing and network services; payments; e-commerce; merchant acquiring and processing; and the Clover(R) cloud-based point-of-sale and business management platform. Fiserv is a member of the S&amp;P 500(R) Index and one of Fortune(R) World's Most Admired Companies(TM) . Visit fiserv.com and follow on social media for more information and the latest company news.</p><p class=\"\">Use of Non-GAAP Financial Measures</p><p class=\"\">In this news release, the company supplements its reporting of information determined in accordance with generally accepted accounting principles (\"GAAP\"), such as revenue, operating income, operating margin, net income attributable to Fiserv, diluted earnings per share and net cash provided by operating activities, with \"adjusted revenue,\" \"adjusted revenue growth,\" \"organic revenue,\" \"organic revenue growth,\" \"adjusted operating income,\" \"adjusted operating margin,\" \"adjusted net income,\" \"adjusted earnings per share,\" \"adjusted earnings per share growth,\" and \"free cash flow.\" Management believes that adjustments for certain non-cash or other items and the exclusion of certain pass-through revenue and expenses should enhance shareholders' ability to evaluate the company's performance, as such measures provide additional insights into the factors and trends affecting its business. Therefore, the company excludes these items from its GAAP financial measures to calculate these unaudited non-GAAP measures. The corresponding reconciliations of these unaudited non-GAAP financial measures to the most comparable GAAP measures are included in this news release, except for forward-looking measures where a reconciliation to the corresponding GAAP measures is not available due to the variability, complexity and limited visibility of the non-cash and other items described below that are excluded from the non-GAAP outlook measures. See page 15 for additional information regarding the company's forward-looking non-GAAP financial measures.</p><p class=\"\">Examples of non-cash or other items may include, but are not limited to, non-cash intangible asset amortization expense associated with acquisitions; non-cash impairment and terminated pension plan settlement charges; severance costs; merger and integration costs; gains or losses from the sale of businesses, certain assets or investments; and certain discrete tax benefits and expenses. The company excludes these items to more clearly focus on the factors management believes are pertinent to the company's operations, and management uses this information to make operating decisions, including the allocation of resources to the company's various businesses.</p><p class=\"\">The company adjusts its non-GAAP results to exclude amortization of acquisition-related intangible assets as such amounts are inconsistent in amount and frequency and are significantly impacted by the timing and/or size of acquisitions. Management believes that the adjustment of acquisition-related intangible asset amortization supplements GAAP information with a measure that can be used to assess the comparability of operating performance. Although the company excludes amortization from acquisition-related intangible assets from its non-GAAP expenses, management believes that it is important for investors to understand that such intangible assets were recorded as part of purchase accounting and contribute to revenue generation.</p><p class=\"\">Management believes organic revenue growth is useful because it presents revenue growth excluding the impact of foreign currency fluctuations, acquisitions, dispositions and the impact of the company's postage reimbursements. Management believes free cash flow is useful to measure the funds generated in a given period that are available for debt service requirements and strategic capital decisions. Management believes this supplemental information enhances shareholders' ability to evaluate and understand the company's core business performance.</p><p class=\"\">These unaudited non-GAAP measures may not be comparable to similarly titled measures reported by other companies and should be considered in addition to, and not as a substitute for, revenue, operating income, operating margin, net income attributable to Fiserv, diluted earnings per share and net cash provided by operating activities or any other amount determined in accordance with GAAP.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">This news release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding anticipated organic revenue growth, adjusted earnings per share, adjusted earnings per share growth and other statements regarding our future financial performance. Statements can generally be identified as forward-looking because they include words such as \"believes,\" \"anticipates,\" \"expects,\" \"could,\" \"should,\" \"confident,\" \"likely,\" \"plan,\" or words of similar meaning. Statements that describe the company's future plans, outlook, objectives or goals are also forward-looking statements.</p><p class=\"\">Forward-looking statements are subject to assumptions, risks and uncertainties that may cause actual results to differ materially from those contemplated by such forward-looking statements. The factors that could cause the company's actual results to differ materially include, among others, the following: the company's ability to compete effectively against new and existing competitors and to continue to introduce competitive new products and services on a timely, cost-effective basis; changes in customer demand for the company's products and services; the ability of the company's technology to keep pace with a rapidly evolving marketplace; the success of the company's merchant alliances, some of which are not controlled by the company; the impact of a security breach or operational failure in the company's business, including disruptions caused by other participants in the global financial system; losses due to chargebacks, refunds or returns as a result of fraud or the failure of the company's vendors and merchants to satisfy their obligations; changes in local, regional, national and international economic or political conditions, including those resulting from heightened inflation, rising interest rates, a recession, bank failures, or intensified international hostilities, and the impact they may have on the company and its employees, clients, vendors, supply chain, operations and sales; the effect of proposed and enacted legislative and regulatory actions affecting the company or the financial services industry as a whole; the company's ability to comply with government regulations and applicable card association and network rules; the protection and validity of intellectual property rights; the outcome of pending and future litigation and governmental proceedings; the company's ability to successfully identify, complete and integrate acquisitions, and to realize the anticipated benefits associated with the same; the impact of the company's strategic initiatives; the company's ability to attract and retain key personnel; volatility and disruptions in financial markets that may impact the company's ability to access preferred sources of financing and the terms on which the company is able to obtain financing or increase its costs of borrowing; adverse impacts from currency exchange rates or currency controls; changes in corporate tax and interest rates; and other factors included in \"Risk Factors\" in the company's Annual Report on Form 10-K for the year ended December 31, 2023, and in other documents that the company files with the Securities and Exchange Commission, which are available at http://www.sec.gov. You should consider these factors carefully in evaluating forward-looking statements and are cautioned not to place undue reliance on such statements. The company assumes no obligation to update any forward-looking statements, which speak only as of the date of this news release.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                        Fiserv, Inc. <br/>        Condensed Consolidated Statements of Income <br/>     (In millions, except per share amounts, unaudited) <br/> <br/>                  Three Months Ended         Year Ended <br/>                      December 31,          December 31, <br/>                      2024      2023      2024      2023 <br/>                     ------    ------    ------    ------ <br/>Revenue <br/>Processing and <br/> services         $   4,260   $ 4,025   $16,637   $15,630 <br/>Product                 991       892     3,819     3,463 <br/>                     ------    ------    ------    ------ <br/>Total revenue         5,251     4,917    20,456    19,093 <br/>                     ------    ------    ------    ------ <br/> <br/>Expenses <br/>Cost of <br/> processing and <br/> services             1,320     1,265     5,363     5,332 <br/>Cost of product         699       577     2,650     2,338 <br/>Selling, <br/> general and <br/> administrative       1,564     1,624     6,564     6,576 <br/>Net (gain) loss <br/> on sale of <br/> businesses and <br/> other assets            --         5        --      (167) <br/>                     ------    ------    ------    ------ <br/>Total expenses        3,583     3,471    14,577    14,079 <br/>                     ------    ------    ------    ------ <br/> <br/>Operating <br/> income               1,668     1,446     5,879     5,014 <br/>Interest <br/> expense, net          (323)     (284)   (1,195)     (976) <br/>Other expense, <br/> net                   (161)      (59)     (178)     (140) <br/>                     ------    ------    ------    ------ <br/> <br/>Income before <br/> income taxes <br/> and loss from <br/> investments in <br/> unconsolidated <br/> affiliates           1,184     1,103     4,506     3,898 <br/>Income tax <br/> provision             (193)     (210)     (641)     (754) <br/>Loss from <br/> investments in <br/> unconsolidated <br/> affiliates             (43)       (4)     (685)      (15) <br/>                     ------    ------    ------    ------ <br/> <br/>Net income              948       889     3,180     3,129 <br/>Less: net <br/> income <br/> attributable <br/> to <br/> noncontrolling <br/> interests               10        19        49        61 <br/>                     ------    ------    ------    ------ <br/> <br/>Net income <br/> attributable <br/> to Fiserv        $     938   $   870   $ 3,131   $ 3,068 <br/>                     ======    ======    ======    ====== <br/> <br/>GAAP earnings <br/> per share <br/> attributable <br/> to Fiserv -- <br/> diluted          $    1.64   $  1.45   $  5.38   $  4.98 <br/> <br/>Diluted shares <br/> used in <br/> computing <br/> earnings per <br/> share <br/> attributable <br/> to Fiserv            571.4     602.7     582.1     615.9 <br/> <br/>Earnings per share is calculated using actual, unrounded <br/>amounts. <br/> <br/> <br/>                           Fiserv, Inc. <br/>                     Reconciliation of GAAP to <br/>        Adjusted Net Income and Adjusted Earnings Per Share <br/>        (In millions, except per share amounts, unaudited) <br/> <br/>                         Three Months Ended        Year Ended <br/>                             December 31,          December 31, <br/>                          2024        2023     2024        2023 <br/>                          -----       -----    -----       ----- <br/> <br/>GAAP net income <br/> attributable to <br/> Fiserv                  $  938      $  870   $3,131      $3,068 <br/>Adjustments: <br/>   Merger and <br/>    integration costs <br/>    (1)                      22          38       81         158 <br/>   Severance costs           80          22      157          74 <br/>   Amortization of <br/>    acquisition-related <br/>    intangible assets <br/>    (2)                     335         378    1,420       1,623 <br/>   Non wholly-owned <br/>    entity activities <br/>    (3)                      22          31      100         133 <br/>   Impairment of equity <br/>    method investments <br/>    (4)                      25          --      635          -- <br/>   Non-cash settlement <br/>    charge for <br/>    terminated pension <br/>    plans (5)               147          --      147          -- <br/>   Net (gain) loss on <br/>    sale of businesses <br/>    and other assets <br/>    (6)                      --           5       --        (167) <br/>   Canadian tax law <br/>    change (7)               --          --       --          27 <br/>   Tax impact of <br/>    adjustments (8)        (132)        (94)    (548)       (355) <br/>   Argentine Peso <br/>    devaluation (9)          --          71       --          71 <br/>                          -----       -----    -----       ----- <br/>Adjusted net income      $1,437      $1,321   $5,123      $4,632 <br/>                          =====       =====    =====       ===== <br/> <br/>GAAP earnings per share <br/> attributable to Fiserv <br/> - diluted               $ 1.64      $ 1.45   $ 5.38      $ 4.98 <br/>Adjustments -- net of <br/>income taxes: <br/>   Merger and <br/>    integration costs <br/>    (1)                    0.03        0.05     0.11        0.21 <br/>   Severance costs         0.11        0.03     0.22        0.10 <br/>   Amortization of <br/>    acquisition-related <br/>    intangible assets <br/>    (2)                    0.47        0.50     1.95        2.11 <br/>   Non wholly-owned <br/>    entity activities <br/>    (3)                    0.03        0.04     0.14        0.17 <br/>   Impairment of equity <br/>    method investments <br/>    (4)                    0.07          --     0.85          -- <br/>   Non-cash settlement <br/>    charge for <br/>    terminated pension <br/>    plans (5)              0.16          --     0.16          -- <br/>   Net (gain) loss on <br/>    sale of businesses <br/>    and other assets <br/>    (6)                      --        0.01       --       (0.19) <br/>   Canadian tax law <br/>    change (7)               --          --       --        0.04 <br/>   Argentine Peso <br/>    devaluation (9)          --        0.12       --        0.12 <br/>                          -----       -----    -----       ----- <br/>Adjusted earnings per <br/> share                   $ 2.51      $ 2.19   $ 8.80      $ 7.52 <br/>                          =====       =====    =====       ===== <br/> <br/>GAAP earnings per share <br/> attributable to Fiserv <br/> growth                      13%                   8% <br/>Adjusted earnings per <br/> share growth                15%                  17% <br/> <br/> <br/>See pages 3-4 for disclosures related to the use of non-GAAP financial <br/>measures. Earnings per share is calculated using actual, unrounded amounts. <br/> <br/>(1)    Represents acquisition and related integration costs incurred in <br/>       connection with acquisitions. Merger and integration costs associated <br/>       with integration activities for the full year 2024 primarily include <br/>       $23 million of third-party professional service fees, $22 million of <br/>       share-based compensation, and $14 million related to a legal <br/>       settlement. Merger and integration costs associated with integration <br/>       activities for the full year 2023 primarily include $70 million of <br/>       third-party professional service fees and $35 million of share-based <br/>       compensation. <br/>(2)    Represents amortization of intangible assets acquired through <br/>       acquisition, including customer relationships, software/technology and <br/>       trade names. This adjustment does not exclude the amortization of other <br/>       intangible assets such as contract costs (sales commissions and <br/>       deferred conversion costs), capitalized and purchased software, <br/>       financing costs and debt discounts. See additional information on page <br/>       14 for an analysis of the company's amortization expense. <br/>(3)    Represents the company's share of amortization of acquisition-related <br/>       intangible assets at its unconsolidated affiliates, as well as the <br/>       minority interest share of amortization of acquisition-related <br/>       intangible assets at its subsidiaries in which the company holds a <br/>       controlling financial interest. <br/>(4)    Represents a non-cash impairment of certain equity method investments <br/>       during 2024, primarily related to the company's Wells Fargo Merchant <br/>       Services joint venture, recorded within loss from investments in <br/>       unconsolidated affiliates in the consolidated statement of income. <br/>(5)    Represents a non-cash settlement charge associated with the <br/>       terminations of the company's defined benefit pension plans in the <br/>       United Kingdom and United States. Settlements of the terminated plans <br/>       were completed in the fourth quarter of 2024. <br/>(6)    Represents a net gain for the full year primarily associated with the <br/>       sale of the company's financial reconciliation business during 2023. <br/>(7)    Represents the impact of a multi-year retroactive Canadian tax law <br/>       change, enacted in June 2023, related to the Goods and Services Tax / <br/>       Harmonized Sales Tax (GST/HST) treatment of payment card services. <br/>(8)    The tax impact of adjustments is calculated using a tax rate of 20% for <br/>       both the full year 2024 and 2023, which approximates the company's <br/>       annual effective tax rate, exclusive of actual tax impacts of an <br/>       aggregate $196 million benefit associated with the impairment of <br/>       certain equity method investments and the settlement charge for <br/>       terminated pension plans during 2024, and a $48 million provision <br/>       associated with the net gain on sale of businesses during 2023. <br/>(9)    On December 12, 2023, the Argentina government announced economic <br/>       reforms, including a significant devaluation of the Argentine Peso. <br/>       This adjustment represents the corresponding one-day foreign currency <br/>       exchange loss from the remeasurement of the company's Argentina <br/>       subsidiary's monetary assets and liabilities in Argentina's highly <br/>       inflationary economy. <br/> <br/> <br/>                              Fiserv, Inc. <br/>                      Financial Results by Segment <br/>                        (In millions, unaudited) <br/> <br/>                           Three Months Ended           Year Ended <br/>                              December 31,             December 31, <br/>                          2024        2023         2024         2023 <br/>                          -----       -----       ------       ------ <br/>Total Company <br/>Revenue                  $5,251      $4,917      $20,456      $19,093 <br/>Adjustments: <br/>   Postage <br/>    reimbursements         (349)       (320)      (1,333)      (1,247) <br/>   Deferred revenue <br/>    purchase accounting <br/>    adjustments              --           3           --           19 <br/>                          -----       -----       ------       ------ <br/>Adjusted revenue         $4,902      $4,600      $19,123      $17,865 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating income         $1,668      $1,446      $ 5,879      $ 5,014 <br/>Adjustments: <br/>   Merger and <br/>    integration costs <br/>    (1)                      22          38           81          158 <br/>   Severance costs           80          22          157           74 <br/>   Amortization of <br/>    acquisition-related <br/>    intangible assets       335         378        1,420        1,623 <br/>   Net (gain) loss on <br/>    sale of businesses <br/>    and other assets         --           5           --         (167) <br/>   Canadian tax law <br/>    change                   --          --           --           27 <br/>                          -----       -----       ------       ------ <br/>Adjusted operating <br/> income                  $2,105      $1,889      $ 7,537      $ 6,729 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating margin           31.8%       29.4%        28.7%        26.3% <br/>Adjusted operating <br/> margin                    42.9%       41.1%        39.4%        37.7% <br/> <br/>Merchant Solutions <br/>(\"Merchant\") (2) <br/>Revenue                  $2,499      $2,261      $ 9,631      $ 8,722 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating income         $  979      $  851      $ 3,561      $ 2,974 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating margin           39.2%       37.7%        37.0%        34.1% <br/> <br/>Financial Solutions <br/>(\"Financial\") <br/>Revenue                  $2,401      $2,331      $ 9,477      $ 9,101 <br/>Adjustments: <br/>   Deferred revenue <br/>    purchase accounting <br/>    adjustments              --           3           --           19 <br/>                          -----       -----       ------       ------ <br/>Adjusted revenue         $2,401      $2,334      $ 9,477      $ 9,120 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating income         $1,241      $1,128      $ 4,485      $ 4,178 <br/>Adjustments: <br/>   Deferred revenue <br/>    purchase accounting <br/>    adjustments              --           3           --           19 <br/>                          -----       -----       ------       ------ <br/>Adjusted operating <br/> income                  $1,241      $1,131      $ 4,485      $ 4,197 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating margin           51.7%       48.4%        47.3%        45.9% <br/>Adjusted operating <br/> margin                    51.7%       48.5%        47.3%        46.0% <br/> <br/> <br/> <br/>                              Fiserv, Inc. <br/>                  Financial Results by Segment (cont.) <br/>                        (In millions, unaudited) <br/> <br/>                           Three Months Ended           Year Ended <br/>                              December 31,             December 31, <br/>                          2024        2023         2024         2023 <br/>                          -----       -----       ------       ------ <br/>Corporate and Other <br/>Revenue                  $  351      $  325      $ 1,348      $ 1,270 <br/>Adjustments: <br/>   Postage <br/>    reimbursements         (349)       (320)      (1,333)      (1,247) <br/>                          -----       -----       ------       ------ <br/>Adjusted revenue         $    2      $    5      $    15      $    23 <br/>                          =====       =====       ======       ====== <br/> <br/>Operating loss           $ (552)     $ (533)     $(2,167)     $(2,138) <br/>Adjustments: <br/>   Merger and <br/>    integration costs        22          35           81          139 <br/>   Severance costs           80          22          157           74 <br/>   Amortization of <br/>    acquisition-related <br/>    intangible assets       335         378        1,420        1,623 <br/>   Net (gain) loss on <br/>    sale of businesses <br/>    and other assets         --           5           --         (167) <br/>   Canadian tax law <br/>    change                   --          --           --           27 <br/>                          -----       -----       ------       ------ <br/>Adjusted operating loss  $ (115)     $  (93)     $  (509)     $  (442) <br/>                          =====       =====       ======       ====== <br/> <br/> <br/> <br/>See pages 3-4 for disclosures related to the use of non-GAAP financial <br/>measures. Operating margin percentages are calculated using actual, unrounded <br/>amounts. <br/> <br/>(1)    Includes deferred revenue purchase accounting adjustments within the <br/>       Financial segment related to the 2019 acquisition of First Data <br/>       Corporation. Adjustments for this residual activity concluded as of <br/>       December 31, 2023. <br/>(2)    For all periods presented in the Merchant segment, there were no <br/>       adjustments to GAAP measures presented and thus the adjusted measures <br/>       are equal to the GAAP measures presented. <br/> <br/> <br/>                             Fiserv, Inc. <br/>           Condensed Consolidated Statements of Cash Flows <br/>                       (In millions, unaudited) <br/>                                                       Year Ended <br/>                                                      December 31, <br/>                                                    2024      2023 <br/>                                                   ------    ------ <br/>Cash flows from operating activities <br/>Net income                                        $ 3,180   $ 3,129 <br/>   Adjustments to reconcile net income to net <br/>   cash provided by operating activities: <br/>      Depreciation and other amortization           1,672     1,479 <br/>      Amortization of acquisition-related <br/>       intangible assets                            1,423     1,642 <br/>      Amortization of financing costs and debt <br/>       discounts                                       43        41 <br/>      Share-based compensation                        367       342 <br/>      Deferred income taxes                          (662)     (511) <br/>      Net gain on sale of businesses and other <br/>       assets                                          --      (167) <br/>      Loss from investments in unconsolidated <br/>       affiliates                                     685        15 <br/>      Distributions from unconsolidated <br/>       affiliates                                      39        55 <br/>      Non-cash settlement charge for terminated <br/>      pension plans                                   147        -- <br/>      Non-cash foreign currency exchange loss          92        76 <br/>      Other operating activities                      (17)      (27) <br/>      Changes in assets and liabilities, net of <br/>      effects from acquisitions and <br/>      dispositions: <br/>         Trade accounts receivable                   (169)       23 <br/>         Prepaid expenses and other assets           (398)     (790) <br/>         Contract costs                              (267)     (246) <br/>         Accounts payable and other liabilities       426       (54) <br/>         Contract liabilities                          70       155 <br/>                                                   ------    ------ <br/>Net cash provided by operating activities           6,631     5,162 <br/>                                                   ------    ------ <br/> <br/>Cash flows from investing activities <br/>Capital expenditures, including capitalized <br/> software and other intangibles                    (1,569)   (1,388) <br/>Net proceeds from sale of businesses and other <br/> assets                                                --       234 <br/>Merchant cash advances, net                          (801)       -- <br/>Payments for acquisitions of businesses, net of <br/> cash acquired                                         --       (13) <br/>Distributions from unconsolidated affiliates           60       136 <br/>Purchases of investments                             (155)      (39) <br/>Proceeds from sale of investments                      61         5 <br/>Other investing activities                             --        (3) <br/>                                                   ------    ------ <br/>Net cash used in investing activities              (2,404)   (1,068) <br/>                                                   ------    ------ <br/> <br/>Cash flows from financing activities <br/>Debt proceeds                                       6,783     5,567 <br/>Debt repayments                                    (5,396)   (3,015) <br/>Net borrowings from (repayments of) commercial <br/> paper and short-term borrowings                      278    (1,456) <br/>Payments of debt financing costs                      (28)      (38) <br/>Proceeds from issuance of treasury stock               97       101 <br/>Purchases of treasury stock, including employee <br/> shares withheld for tax obligations               (5,837)   (4,827) <br/>Settlement activity, net                               --      (527) <br/>Distributions paid to noncontrolling interests <br/> and redeemable noncontrolling interest               (55)      (34) <br/>Payment to acquire noncontrolling interest of <br/> consolidated subsidiary                               --       (56) <br/>Payments of acquisition-related contingent <br/> consideration                                         (3)      (35) <br/>Other financing activities                             (4)      (36) <br/>                                                   ------    ------ <br/>Net cash used in financing activities              (4,165)   (4,356) <br/>                                                   ------    ------ <br/>Effect of exchange rate changes on cash and cash <br/> equivalents                                          (32)       33 <br/>                                                   ------    ------ <br/>Net change in cash and cash equivalents                30      (229) <br/>Cash and cash equivalents, beginning balance        2,963     3,192 <br/>                                                   ------    ------ <br/>Cash and cash equivalents, ending balance         $ 2,993   $ 2,963 <br/>                                                   ======    ====== <br/> <br/> <br/>                             Fiserv, Inc. <br/>                Condensed Consolidated Balance Sheets <br/>                       (In millions, unaudited) <br/> <br/>                                                        December 31, <br/>                                                        2024     2023 <br/>                                                       ------   ------ <br/>Assets <br/>Cash and cash equivalents                             $ 1,236  $ 1,204 <br/>Trade accounts receivable -- net                        3,725    3,582 <br/>Prepaid expenses and other current assets               3,087    2,344 <br/>Settlement assets                                      15,429   27,681 <br/>                                                       ------   ------ <br/>Total current assets                                   23,477   34,811 <br/> <br/>Property and equipment -- net                           2,374    2,161 <br/>Customer relationships -- net                           5,868    7,075 <br/>Other intangible assets -- net                          4,072    4,135 <br/>Goodwill                                               36,584   37,205 <br/>Contract costs -- net                                     996      968 <br/>Investments in unconsolidated affiliates                1,506    2,262 <br/>Other long-term assets                                  2,299    2,273 <br/>                                                       ------   ------ <br/>Total assets                                          $77,176  $90,890 <br/>                                                       ======   ====== <br/> <br/>Liabilities and Equity <br/>Accounts payable and other current liabilities        $ 4,799  $ 4,355 <br/>Short-term and current maturities of long-term debt     1,110      755 <br/>Contract liabilities                                      819      761 <br/>Settlement obligations                                 15,429   27,681 <br/>                                                       ------   ------ <br/>Total current liabilities                              22,157   33,552 <br/> <br/>Long-term debt                                         23,730   22,363 <br/>Deferred income taxes                                   2,477    3,078 <br/>Long-term contract liabilities                            263      250 <br/>Other long-term liabilities                               863      978 <br/>                                                       ------   ------ <br/>Total liabilities                                      49,490   60,221 <br/> <br/>Redeemable noncontrolling interest                         --      161 <br/> <br/>Fiserv shareholders' equity                            27,068   29,857 <br/>Noncontrolling interests                                  618      651 <br/>                                                       ------   ------ <br/>Total equity                                           27,686   30,508 <br/>                                                       ------   ------ <br/>Total liabilities and equity                          $77,176  $90,890 <br/>                                                       ======   ====== <br/> <br/> <br/> <br/>                               Fiserv, Inc. <br/>     Selected Non-GAAP Financial Measures and Additional Information <br/>                         (In millions, unaudited) <br/> <br/>Organic Revenue       Three Months Ended               Year Ended <br/>Growth (1)               December 31,                 December 31, <br/>--------------- <br/>                   2024     2023     Growth     2024      2023     Growth <br/>---------------    -----    -----   --------   ------    ------   -------- <br/> <br/>Total Company <br/>   Adjusted <br/>    revenue       $4,902   $4,600             $19,123   $17,865 <br/>   Currency <br/>    impact (2)       294       --               1,621        -- <br/>   Acquisition <br/>    adjustments       (1)      --                 (10)       -- <br/>   Divestiture <br/>    adjustments       (2)      (5)                (15)      (46) <br/>                   -----    -----              ------    ------ <br/>   Organic <br/>    revenue       $5,193   $4,595    13%      $20,719   $17,819    16% <br/>                   =====    =====              ======    ====== <br/> <br/>Merchant <br/>   Adjusted <br/>    revenue       $2,499   $2,261             $ 9,631   $ 8,722 <br/>   Currency <br/>    impact (2)       274       --               1,499        -- <br/>   Acquisition <br/>    adjustments       (1)      --                 (10)       -- <br/>                   -----    -----              ------    ------ <br/>   Organic <br/>    revenue       $2,772   $2,261    23%      $11,120   $ 8,722    27% <br/>                   =====    =====              ======    ====== <br/> <br/>Financial <br/>   Adjusted <br/>    revenue       $2,401   $2,334             $ 9,477   $ 9,120 <br/>   Currency <br/>    impact (2)        20       --                 122        -- <br/>   Divestiture <br/>    adjustments       --       --                  --       (23) <br/>                   -----    -----              ------    ------ <br/>   Organic <br/>    revenue       $2,421   $2,334     4%      $ 9,599   $ 9,097     6% <br/>                   =====    =====              ======    ====== <br/> <br/>Corporate and <br/>Other <br/>   Adjusted <br/>    revenue       $    2   $    5             $    15   $    23 <br/>   Divestiture <br/>    adjustments       (2)      (5)                (15)      (23) <br/>                   -----    -----              ------    ------ <br/>   Organic        $   --   $   --             $    --   $    -- <br/>    revenue <br/>                   =====    =====              ======    ====== <br/> <br/> <br/>See pages 3-4 for disclosures related to the use of non-GAAP financial <br/>measures. Organic revenue growth is calculated using actual, unrounded <br/>amounts. <br/> <br/>(1)    Organic revenue growth is measured as the change in adjusted revenue <br/>       (see pages 9-10) for the current period excluding the impact of foreign <br/>       currency fluctuations and revenue attributable to acquisitions and <br/>       dispositions, divided by adjusted revenue from the prior period <br/>       excluding revenue attributable to dispositions. <br/>(2)    Currency impact is measured as the increase or decrease in adjusted <br/>       revenue for the current period by applying prior period foreign <br/>       currency exchange rates to present a constant currency comparison to <br/>       prior periods. <br/> <br/> <br/>  Fiserv, Inc. Selected Non-GAAP Financial Measures and Additional <br/>            Information (cont.) (In millions, unaudited) <br/> <br/>                                                     Year Ended <br/>Free Cash Flow                                      December 31, <br/>--------------------------------------------- <br/>                                                  2024      2023 <br/>---------------------------------------------    ------    ------ <br/> <br/>Net cash provided by operating activities       $ 6,631   $ 5,162 <br/>Capital expenditures                             (1,569)   (1,388) <br/>Adjustments: <br/>   Distributions paid to noncontrolling <br/>    interests and redeemable noncontrolling <br/>    interest                                        (55)      (34) <br/>   Distributions from unconsolidated <br/>    affiliates included in cash flows from <br/>    investing activities                             60       136 <br/>   Severance, merger and integration payments       179       169 <br/>   Tax payments on adjustments                      (36)      (34) <br/>   Other                                             23         5 <br/>                                                 ------    ------ <br/>      Free cash flow                            $ 5,233   $ 4,016 <br/>                                                 ======    ====== <br/> <br/> <br/>                           Three Months Ended       Year Ended <br/>Total Amortization (1)        December 31,          December 31, <br/>---------------------- <br/>                               2024      2023        2024    2023 <br/>----------------------       --------   -------      -----   ----- <br/> <br/>Acquisition-related <br/> intangible assets        $       334  $    381   $  1,423  $1,642 <br/>Capitalized software <br/> and other intangibles            167       133        631     493 <br/>Purchased software                 57        58        232     225 <br/>Financing costs and <br/> debt discounts                    10        11         43      41 <br/>Sales commissions                  29        27        113     110 <br/>Deferred conversion <br/> costs                             26        24        108      85 <br/>                             --------   -------      -----   ----- <br/>   Total amortization     $       623  $    634   $  2,550  $2,596 <br/>                             ========   =======      =====   ===== <br/> <br/> <br/>See pages 3-4 for disclosures related to the use of non-GAAP financial <br/>measures. <br/> <br/>(1)    The company adjusts its non-GAAP results to exclude amortization of <br/>       acquisition-related intangible assets as such amounts are inconsistent <br/>       in amount and frequency and are significantly impacted by the timing <br/>       and/or size of acquisitions. Management believes that the adjustment of <br/>       acquisition-related intangible asset amortization supplements the GAAP <br/>       information with a measure that can be used to assess the comparability <br/>       of operating performance. Although the company excludes amortization <br/>       from acquisition-related intangible assets from its non-GAAP expenses, <br/>       management believes that it is important for investors to understand <br/>       that such intangible assets were recorded as part of purchase <br/>       accounting and contribute to revenue generation. Amortization of <br/>       intangible assets that relate to past acquisitions will recur in future <br/>       periods until such intangible assets have been fully amortized. Any <br/>       future acquisitions may result in the amortization of additional <br/>       intangible assets. <br/> </pre><p class=\"\">Fiserv, Inc.</p><p class=\"\">Full Year Forward-Looking Non-GAAP Financial Measures</p><p class=\"\">Reconciliations of unaudited non-GAAP financial measures to the most comparable GAAP measures are included in this news release, except for forward-looking measures where a reconciliation to the corresponding GAAP measures is not available due to the variability, complexity and limited visibility of these items that are excluded from the non-GAAP outlook measures. The company's forward-looking non-GAAP financial measures for 2025, including organic revenue growth, adjusted earnings per share and adjusted earnings per share growth, are designed to enhance shareholders' ability to evaluate the company's performance by excluding certain items to focus on factors and trends affecting its business.</p><p class=\"\">Organic Revenue Growth - The company's organic revenue growth outlook for 2025 excludes the impact of foreign currency fluctuations, acquisitions, dispositions and the impact of the company's postage reimbursements. The currency impact is measured as the increase or decrease in the expected adjusted revenue for the period by applying prior period foreign currency exchange rates to present a constant currency comparison to prior periods.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                Growth <br/>                             ------------ <br/>2025 Revenue                   9% - 11% <br/>   Postage reimbursements       (0.5)% <br/>                             ------------ <br/>2025 Adjusted revenue        8.5% - 10.5% <br/>                             ============ <br/> <br/>   Currency impact               1.5% <br/>   Acquisition adjustments       --% <br/>   Divestiture adjustments       --% <br/>                             ------------ <br/>2025 Organic revenue          10% - 12% <br/>                             ============ <br/> </pre><p class=\"\">Adjusted Earnings Per Share - The company's adjusted earnings per share outlook for 2025 excludes certain non-cash or other items such as non-cash intangible asset amortization expense associated with acquisitions; non-cash impairment charges; merger and integration costs; severance costs; gains or losses from the sale of businesses, certain assets and investments; and certain discrete tax benefits and expenses. The company estimates that amortization expense in 2025 with respect to acquired intangible assets will decrease approximately 10% compared to the amount incurred in 2024.</p><p class=\"\">Other adjustments to the company's financial measures that were incurred in 2024 are presented in this news release; however, they are not necessarily indicative of adjustments that may be incurred throughout 2025 or beyond. Estimates of these impacts and adjustments on a forward-looking basis are not available due to the variability, complexity and limited visibility of these items.</p><p class=\"\">FI-G</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205957861/en/</p><p class=\"\">CONTACT:    Media Relations:</p><p class=\"\">Sophia Marshall</p><p class=\"\">Senior Vice President, Communications</p><p class=\"\">Fiserv, Inc.</p><p class=\"\">470-351-9908</p><p class=\"\">sophia.marshall@fiserv.com</p><p class=\"\">Investor Relations:</p><p class=\"\">Julie Chariell</p><p class=\"\">Senior Vice President, Investor Relations</p><p class=\"\">Fiserv, Inc.</p><p class=\"\">212-515-0278</p><p class=\"\">julie.chariell@fiserv.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004729:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004729_20250205004731:0",
            "title": "Fiserv 4Q Rev $5.25B >FI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004729_20250205004731:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004729_20250205004730:0",
            "title": "Fiserv 4Q Net $938M >FI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004729_20250205004730:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004729_20250205004729:0",
            "title": "Fiserv 4Q EPS $1.64 >FI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004729_20250205004729:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004729_20250205004732:0",
            "title": "Fiserv 4Q Adj EPS $2.51 >FI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004729_20250205004732:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004628_20250205004734:0",
            "title": "Dayforce 4Q Net $10.8M >DAY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004628_20250205004734:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004628_20250205004735:0",
            "title": "Dayforce 4Q EPS 7c >DAY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004628_20250205004735:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004628_20250205004741:0",
            "title": "Dayforce 4Q Adj EPS 60c >DAY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004628_20250205004741:0/",
            "pub_date": "2025-02-05 20:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004444_20250205004447:0",
            "title": "Uber Technologies 4Q Delivery Gross Bookings $20.13B >UBER",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004444_20250205004447:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004444_20250205004468:0",
            "title": "Uber Technologies 4Q Adjusted Ebitda Margin 4.2% of Gross Bookings >UBER",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004444_20250205004468:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004444_20250205004466:0",
            "title": "Uber Technologies 4Q Adjusted Ebitda $1.84B >UBER",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004444_20250205004466:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004421:0",
            "title": "Uber Announces Results for Fourth Quarter and Full Year 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Rev $12B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Net $6.9B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Delivery Gross Bookings Up 18% &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Delivery Gross Bookings $20.1B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Mobility Gross Bookings Up 18% &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Mobility Gross Bookings $22.8B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Gross Bookings $44.2B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Trips Up 18% &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q EPS $3.21 &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Trips 3.1B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Freight Gross Bookings 0% &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Freight Gross Bookings $1.27B &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Monthly Active Platform Consumers Up 14% &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>*Uber Technologies 4Q Monthly Active Platform Consumers 171M &gt;UBER<br/><strong class=\"root-Tkn6WL2y\">(11:55 GMT) </strong>Press Release: Uber Announces Results for Fourth Quarter and Full Year 2024</p><p class=\"\">Uber Announces Results for Fourth Quarter and Full Year 2024</p><p class=\"\">Gross Bookings grew 18% year-over-year and 21% year-over-year on a constant currency basis</p><p class=\"\">Income from operations of $770 million; Adjusted EBITDA of $1.8 billion, up 44% year-over-year</p><p class=\"\">Operating cash flow of $1.8 billion; Free cash flow of $1.7 billion</p><p class=\"\">SAN FRANCISCO--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Uber Technologies, Inc.  today announced financial results for the quarter and full year ended December 31, 2024.</p><p class=\"\">\"Uber ended 2024 with our strongest quarter ever, as growth accelerated across MAPCs, trips, and Gross Bookings,\" said Dara Khosrowshahi, CEO. \"Our performance has been powered by rapid innovation and execution across multiple priorities, including the massive opportunity presented by autonomous vehicles. We enter 2025 with clear momentum and will continue to be relentless against our long-term strategy.\"</p><p class=\"\">\"Record demand in both Mobility and Delivery helped us grow Gross Bookings faster than the high end of our guidance, and we closed out 2024 exceeding our three-year outlook for Gross Bookings, Adjusted EBITDA, and free cash flow,\" said Prashanth Mahendra-Rajah, CFO. \"We believe we remain undervalued despite these strong fundamentals, and plan to be active and opportunistic buyers of our stock.\"</p><p class=\"\">Financial Highlights for Fourth Quarter 2024</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Gross Bookings grew 18% year-over-year (\"YoY\") to $44.2 billion, or 21%   on a constant currency basis, with Mobility Gross Bookings of $22.8   billion (+18% YoY or +24% YoY constant currency) and Delivery Gross   Bookings of $20.1 billion (+18% YoY or +18% YoY constant currency). Trips   during the quarter grew 18% YoY to 3.1 billion, or approximately 33   million trips per day on average.     </li><li class=\"listItem-bmN0_SHH\">Revenue grew 20% YoY to $12.0 billion, or 21% on a constant currency   basis. Combined Mobility and Delivery revenue grew 23% YoY to $10.7   billion, or 24% on a constant currency basis.     </li><li class=\"listItem-bmN0_SHH\">Income from operations was $770 million, up $118 million YoY.     </li><li class=\"listItem-bmN0_SHH\">Net income attributable to Uber Technologies, Inc. was $6.9 billion,   which includes a $6.4 billion benefit from a tax valuation release and a   $556 million benefit (pre-tax) due to net unrealized gains related to the   revaluation of Uber's equity investments.     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA grew 44% YoY to $1.8 billion. Adjusted EBITDA margin as   a percentage of Gross Bookings was 4.2%, up from 3.4% in Q4 2023.     </li><li class=\"listItem-bmN0_SHH\">Net cash provided by operating activities was $1.8 billion and free   cash flow, defined as net cash flows from operating activities less   capital expenditures, was $1.7 billion.     </li><li class=\"listItem-bmN0_SHH\">Unrestricted cash, cash equivalents, and short-term investments were   $7.0 billion at the end of the fourth quarter. We redeemed $2.0 billion   of our outstanding debt in Q4 2024.   </li></ul><p class=\"\">Outlook for Q1 2025</p><p class=\"\">For Q1 2025, we anticipate:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Gross Bookings of growth of 17% to 21% YoY on a constant currency   basis.   <br/> -- <br/> This translates to reported Gross Bookings of $42.0 billion to   $43.5 billion as our outlook assumes a roughly 5.5 percentage   point currency headwind to total reported YoY growth (including a   roughly 7 and 4 percentage point currency headwind to Mobility and   Delivery growth, respectively).         </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $1.79 billion to $1.89 billion, which represents 30%   to 37% YoY growth.   </li></ul><p class=\"\">Financial and Operational Highlights for Fourth Quarter 2024</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                 Three Months Ended <br/>                    December 31, <br/>                 ------------------- <br/>(In millions, <br/>except                                             % Change (Constant <br/>percentages)       2023        2024    % Change      Currency (1) ) <br/>--------------    ------      ------  ----------  -------------------- <br/> <br/>Monthly Active <br/> Platform <br/> Consumers <br/> (\"MAPCs\")           150         171    14% <br/>Trips              2,601       3,068    18% <br/>Gross Bookings   $37,575   $  44,197    18%         21% <br/>Revenue          $ 9,936   $  11,959    20%         21% <br/>Income from <br/> operations      $   652   $     770    18% <br/>Net income <br/> attributable <br/> to Uber <br/> Technologies, <br/> Inc. (2)        $ 1,429   $   6,883    ** <br/>Adjusted EBITDA <br/> (1)             $ 1,283   $   1,842    44% <br/>Net cash <br/> provided by <br/> operating <br/> activities      $   823   $   1,750   113% <br/>Free cash flow <br/> (1)             $   768   $   1,706   122% <br/> <br/> <br/>(1)   See \"Definitions of Non-GAAP Measures\" and \"Reconciliations of Non-GAAP <br/>      Measures\" sections herein for an explanation and reconciliations of <br/>      non-GAAP measures used throughout this release. <br/>(2)   Q4 2023 net income includes a $1.0 billion net benefit (pre-tax) from <br/>      revaluations of Uber's equity investments. Q4 2024 net income includes a <br/>      $6.4 billion benefit from a tax valuation release and a $556 million net <br/>      benefit (pre-tax) from revaluations of Uber's equity investments. <br/>** Percentage not meaningful. <br/> </pre><p class=\"\">Full Year 2024 Financial and Operational Highlights</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                  Year Ended December <br/>                          31, <br/>                 --------------------- <br/>(In millions, <br/>except                                                    % Change <br/>percentages)          2023      2024     % Change    (Constant Currency) <br/>--------------       -------   -------  ----------  --------------------- <br/> <br/>Trips                  9,448    11,273    19% <br/>Gross Bookings    $  137,865  $162,773    18%          21% <br/>Revenue           $   37,281  $ 43,978    18%          19% <br/>Income from <br/> operations       $    1,110  $  2,799   152% <br/>Net income <br/> attributable <br/> to Uber <br/> Technologies, <br/> Inc. (2)         $    1,887  $  9,856    ** <br/>Adjusted EBITDA <br/> (1)              $    4,052  $  6,484    60% <br/>Net cash <br/> provided by <br/> operating <br/> activities <br/> (3)              $    3,585  $  7,137    99% <br/>Free cash flow <br/> (1), (3)         $    3,362  $  6,895   105% <br/> <br/> <br/>(1)   See \"Definitions of Non-GAAP Measures\" and \"Reconciliations of Non-GAAP <br/>      Measures\" sections herein for an explanation and reconciliations of <br/>      non-GAAP measures used throughout this release. <br/>(2)   Net income for the year ended December 31, 2023 includes a $1.6 billion <br/>      net benefit (pre-tax) from revaluations of Uber's equity investments. <br/>      Net income for the year ended December 31, 2024 includes a $6.4 billion <br/>      benefit from a tax valuation release and a $1.8 billion net benefit <br/>      (pre-tax) from revaluations of Uber's equity investments. <br/>(3)   Net cash provided by operating activities and free cash flow during the <br/>      year ended December 31, 2023 includes an approximately $622 million cash <br/>      outflow related to payments of HMRC VAT for multiple assessments for the <br/>      period of March 2022 to March 2023. <br/>** Percentage not meaningful. <br/> </pre><p class=\"\">Results by Offering and Segment</p><p class=\"\">Gross Bookings</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                   Three Months Ended <br/>                      December 31, <br/>                 ----------------------- <br/>(In millions, <br/>except                                                      % Change <br/>percentages)           2023        2024    % Change    (Constant Currency) <br/>--------------   ---  ------      ------  ----------  --------------------- <br/> <br/>Gross <br/>Bookings: <br/>   Mobility        $  19,285   $  22,798   18%           24% <br/>   Delivery           17,011      20,126   18%           18% <br/>   Freight             1,279       1,273   --%           --% <br/>                 ---  ------      ------ <br/>      Total        $  37,575   $  44,197   18%           21% <br/>                 ===  ======      ====== <br/> </pre><p class=\"\">Revenue</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                   Three Months Ended <br/>                      December 31, <br/>                 ---------------------- <br/>(In millions, <br/>except                                                     % Change <br/>percentages)          2023        2024    % Change    (Constant Currency) <br/>--------------   ---  -----      ------  ----------  --------------------- <br/> <br/>Revenue: <br/>   Mobility        $  5,537   $   6,911    25%          26% <br/>   Delivery           3,119       3,773    21%          20% <br/>   Freight            1,280       1,275    --%          --% <br/>                 ---  -----      ------ <br/>      Total        $  9,936   $  11,959    20%          21% <br/>                 ===  =====      ====== <br/> </pre><p class=\"\">Revenue Margin</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>               Three Months Ended December 31, <br/>            ------------------------------------- <br/>                   2023               2024 <br/>---------   ------------------  ----------------- <br/> <br/>Mobility           28.7%              30.3% <br/>Delivery           18.3%              18.7% <br/> </pre><p class=\"\">Adjusted EBITDA and Segment Adjusted EBITDA</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                        Three Months Ended December 31, <br/>                   ----------------------------------------- <br/>(In millions, <br/>except <br/>percentages)               2023                 2024           % Change <br/>----------------   ---  -----------          -----------      ---------- <br/> <br/>Segment Adjusted <br/>EBITDA: <br/>   Mobility          $        1,446       $        1,769         22% <br/>   Delivery                     476                  727         53% <br/>   Freight                      (14)                 (22)       (57)% <br/>Corporate G&amp;A and <br/> Platform R&amp;D <br/> (1)                           (625)                (632)        (1)% <br/>                   ---  -----------          ----------- <br/>      Adjusted <br/>       EBITDA <br/>       (2)           $        1,283       $        1,842         44% <br/>                   ===  ===========          =========== <br/> <br/> <br/>(1)   Includes costs that are not directly attributable to our reportable <br/>      segments. Corporate G&amp;A also includes certain shared costs such as <br/>      finance, accounting, tax, human resources, information technology and <br/>      legal costs. Platform R&amp;D also includes mapping and payment technologies <br/>      and support and development of the internal technology infrastructure. <br/>      Our allocation methodology is periodically evaluated and may change. <br/>(2)   \"Adjusted EBITDA\" is a non-GAAP measure as defined by the SEC. See <br/>      \"Definitions of Non-GAAP Measures\" and \"Reconciliations of Non-GAAP <br/>      Measures\" sections herein for an explanation and reconciliations of <br/>      non-GAAP measures used throughout this release. <br/> </pre><p class=\"\">Financial Highlights for the Fourth Quarter 2024 (continued)</p><p class=\"\">Mobility</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $6.9 billion: Mobility Revenue grew 25% YoY and 8%   quarter-over-quarter (\"QoQ\"). The YoY increase was primarily attributable   to an increase in Mobility Gross Bookings due to an increase in Trip   volumes. Mobility Revenue Margin of 30.3% increased 160 bps YoY and   decreased 20 bps QoQ.     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $1.8 billion: Mobility Adjusted EBITDA increased 22%   YoY, and Mobility Adjusted EBITDA margin was 7.8% of Gross Bookings   compared to 7.5% in Q4 2023 and 8.0% in Q3 2024. Mobility Adjusted EBITDA   margin improvement YoY was primarily driven by cost leverage from higher   volume.   </li></ul><p class=\"\">Delivery</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $3.8 billion: Delivery Revenue grew 21% YoY and 9% QoQ. The   YoY increase was primarily attributable to an increase in Delivery Gross   Bookings due to an increase in Trip volumes, and an increase in   advertising revenue. Delivery Revenue Margin of 18.7% increased 40 bps   YoY and 10 bps QoQ.     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA of $727 million: Delivery Adjusted EBITDA increased 53%   YoY, and Delivery Adjusted EBITDA margin was 3.6% of Gross Bookings,   compared to 2.8% in Q4 2023 and 3.4% in Q3 2024. Delivery Adjusted EBITDA   margin improvement YoY was primarily driven by cost leverage from higher   volume and increased advertising revenue.   </li></ul><p class=\"\">Freight</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue of $1.3 billion: Freight Revenue was flat YoY and decreased 3%   QoQ. Revenue was flat YoY driven by a decrease in revenue per load as a   result of the challenging freight market cycle, partially offset by an   increase in volume.     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA loss of $22 million: Freight Adjusted EBITDA decreased   $8 million YoY. Freight Adjusted EBITDA margin as a percentage of Gross   Bookings decreased 60 bps YoY to (1.7%).   </li></ul><p class=\"\">Corporate</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Corporate G&amp;A and Platform R&amp;D: Corporate G&amp;A and Platform R&amp;D expenses   of $632 million, compared to $625 million in Q4 2023, and $601 million in   Q3 2024. Corporate G&amp;A and Platform R&amp;D as a percentage of Gross Bookings   decreased 20 bps YoY and remained flat QoQ. The YoY decrease was   primarily due to improved fixed cost leverage.   </li></ul><p class=\"\">GAAP and Non-GAAP Costs and Operating Expenses</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cost of revenue excluding D&amp;A: GAAP cost of revenue was $7.2 billion.   Non-GAAP cost of revenue was $7.2 billion, representing 16.4% of Gross   Bookings, compared to 16.1% and 16.5% in Q4 2023 and Q3 2024,   respectively. On a YoY basis, non-GAAP cost of revenue as a percentage of   Gross Bookings increased primarily due to an increase in insurance   expense.     </li><li class=\"listItem-bmN0_SHH\">GAAP and Non-GAAP operating expenses (Non-GAAP operating expenses   exclude certain amounts as further detailed in the \"Reconciliations of   Non-GAAP Measures\" section):   <br/> -- <br/> Operations and support: GAAP operations and support was $678   million. Non-GAAP operations and support was $624 million,   representing 1.4% of Gross Bookings, compared to 1.7% and 1.6% in   Q4 2023 and Q3 2024, respectively. On a YoY basis, non-GAAP   operations and support as a percentage of Gross Bookings decreased   due to improved fixed cost leverage.     <br/> -- <br/> Sales and marketing: GAAP sales and marketing was $1.2 billion.   Non-GAAP sales and marketing was $1.2 billion, representing 2.7%   of Gross Bookings, compared to 2.4% and 2.6% in Q4 2023 and Q3   2024, respectively. On a YoY basis, non-GAAP sales and marketing   as a percentage of Gross Bookings increased due to an increase in   consumer promotion spend.     <br/> -- <br/> Research and development: GAAP research and development was $785   million. Non-GAAP research and development was $525 million,   representing 1.2% of Gross Bookings, compared to 1.3% and 1.2% in   Q4 2023 and Q3 2024, respectively. On a YoY basis, non-GAAP   research and development as a percentage of Gross Bookings   decreased due to improved fixed cost leverage.     <br/> -- <br/> General and administrative: GAAP general and administrative was   $1.1 billion. Non-GAAP general and administrative was $550 million,   representing 1.2% of Gross Bookings, compared to 1.5% and 1.3% in   Q4 2023 and Q3 2024, respectively. On a YoY basis, non-GAAP   general and administrative as a percentage of Gross Bookings   decreased due to a decrease in employee headcount costs.       </li></ul><p class=\"\">Operating Highlights for the Fourth Quarter 2024</p><p class=\"\">Platform</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Monthly Active Platform Consumers (\"MAPCs\"): MAPCs was 171 million, an   increase of 14% YoY.     </li><li class=\"listItem-bmN0_SHH\">Trips: Trips on our platform grew 18% YoY to 3.1 billion. Monthly trips   per MAPC reached an all-time high and grew 3% YoY to 6.0.     </li><li class=\"listItem-bmN0_SHH\">Supporting earners: Drivers and couriers earned an aggregate $20.0   billion (including tips) during the quarter, with earnings up 16% YoY, or   22% on a constant currency basis.     </li><li class=\"listItem-bmN0_SHH\">Autonomous deployments and partnerships: Launched autonomous   ride-hailing service in Abu Dhabi in partnership with WeRide, marking the   first time autonomous vehicles are available on the Uber platform outside   of the US.Additionally, began delivering Uber Eats orders in Austin and   Dallas via autonomous sidewalk robots in partnership with Avride, and in   Osaka in partnership with Cartken. Lastly, formed a joint initiative with   NVIDIA to collaborate on new solutions to support the development of   AI-powered autonomous driving technology.     </li><li class=\"listItem-bmN0_SHH\">Membership: Uber One member base reached 30 million, growing roughly   60% YoY. Launched Uber One membership plans in 6 new countries, bringing   the total number of countries with Uber One membership plans to 34,   including all Delivery countries. Additionally, launched Uber One for   Students to new countries across the EMEA, APAC, and LatAm regions.     </li><li class=\"listItem-bmN0_SHH\">Delta partnership: This spring, Uber will become Delta's exclusive   rideshare and delivery partner in the US. Uber customers will have the   opportunity to earn Delta SkyMiles on qualifying Uber rides and Uber Eats   orders.     </li><li class=\"listItem-bmN0_SHH\">AI enhancements: Significantly expanded application of AI to assist   with customer service requests, providing support agents with summaries   of customer comments, guidance on resolution steps, and personalized   reply suggestions.   </li></ul><p class=\"\">Mobility</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Focus on affordability: Launched UberX Share at 10 major airports in   the US and internationally. Additionally, expanded Uber Shuttle service   to LaGuardia Airport, adding a new stop from downtown Manhattan, and   increased service during peak times.     </li><li class=\"listItem-bmN0_SHH\">Uber for Teens expansion: Expanded Uber for Teens to 26 new countries   across the EMEA, APAC, and LatAm regions. Uber Teens is now live in over   50 countries, covering the vast majority of our global Trip volumes. Also   launched Teen profiles, enabling teens to use their own payment methods   and cash.     </li><li class=\"listItem-bmN0_SHH\">Uber Business Black: Launched Uber Business Black in the US, UK and   Brazil, a new ride type for corporate travelers featuring luxury vehicles,   increased flexibility, and first class customer service.     </li><li class=\"listItem-bmN0_SHH\">Taxi expansion: In Japan, partnered with a leading taxi dispatch   provider that will bring up to 20,000 vehicles onto the platform. Demand   in Japan remains robust, driven by increasing usage by domestic riders as   well as international travelers.     </li><li class=\"listItem-bmN0_SHH\">Refreshed Uber Courier service: Rebranded and redesigned Uber Connect   as Uber Courier to better reflect the variety of use cases the service   provides. Also expanded the Saver feature in the US and Mexico, and   launched a scheduling feature globally.   </li></ul><p class=\"\">Delivery</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">SNAP EBT payment acceptance: US customers can now use their SNAP EBT   benefits to order groceries from participating locations through the Uber   Eats app, starting with Albertsons Companies-owned brands and Walgreens   locations nationwide.     </li><li class=\"listItem-bmN0_SHH\">Uber Direct momentum: Expanded partnership between Uber Direct and   Toast Delivery Services, allowing restaurants on Toast's platform to save   on delivery fees, expand their delivery radius, and leverage Uber's   extensive delivery network. Partnered with several additional merchants,   including P.F. Chang's in the US as well as Burger King in the UK,   hardware retailer Bunnings in Australia, and our first Uber Direct   partnership in Poland with Media Markt.     </li><li class=\"listItem-bmN0_SHH\">Grocery &amp; Retail fulfillment enhancements: Launched new Shopper Pick &amp;   Pack feature in select markets, providing flexibility for earners to   solely shop for orders and hand deliveries off to couriers. Also   introduced functionality to redirect orders if the selected store is   temporarily closed or low on inventory. Lastly, completed a tech   migration enabling merchants using their employees for order fulfillment   to utilize the same fulfillment technology as Uber's earners.     </li><li class=\"listItem-bmN0_SHH\">Festive holiday features: Launched several features over the holidays,   including a holiday shopping hub, Christmas tree delivery in partnership   with Lowe's, and Uber Carolers in select cities.   </li></ul><p class=\"\">Freight</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Broker Access: Launched Broker Access, a new capacity-as-a-service   solution that provides freight brokers with direct access to Uber   Freight's technology platform and network of fully vetted carriers. The   program streamlines load booking and execution, provides end-to-end load   visibility, and mitigates fraud.   </li></ul><p class=\"\">Recent Developments</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Accelerated share repurchase: In January 2025, entered into an   accelerated share repurchase (\"ASR\") agreement to repurchase $1.5 billion   shares of Uber common stock, as part of our previously announced $7.0   billion share repurchase authorization.   </li></ul><p class=\"\">Webcast and conference call information</p><p class=\"\">A live audio webcast of our fourth quarter ended December 31, 2024 earnings release call will be available at https://investor.uber.com/, along with the earnings press release and slide presentation. The call begins on February 5, 2025 at 5:00 AM (PT) / 8:00 AM (ET). This press release, including the reconciliations of certain non-GAAP measures to their nearest comparable GAAP measures, is also available on that site.</p><p class=\"\">We also provide announcements regarding our financial performance and other matters, including SEC filings, investor events, press and earnings releases, on our investor relations website (https://investor.uber.com/), and our blogs (https://uber.com/blog) and X accounts (@uber and @dkhos), as a means of disclosing material information and complying with our disclosure obligations under Regulation FD.</p><p class=\"\">About Uber</p><p class=\"\">Uber's mission is to create opportunity through movement. We started in 2010 to solve a simple problem: how do you get access to a ride at the touch of a button? More than 58 billion trips later, we're building products to get people closer to where they want to be. By changing how people, food, and things move through cities, Uber is a platform that opens up the world to new possibilities.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">This press release contains forward-looking statements regarding our future business expectations which involve risks and uncertainties. Actual results may differ materially from the results predicted, and reported results should not be considered as an indication of future performance. Forward-looking statements include all statements that are not historical facts and can be identified by terms such as \"anticipate, \" \"believe,\" \"contemplate,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"hope,\" \"intend,\" \"may,\" \"might,\" \"objective,\" \"ongoing,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"target,\" \"will,\" or \"would\" or similar expressions and the negatives of those terms. Forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. These risks, uncertainties and other factors relate to, among others: competition, managing our growth and corporate culture, financial performance, investments in new products or offerings, our ability to attract drivers, consumers and other partners to our platform, our brand and reputation and other legal and regulatory developments, particularly with respect to our relationships with drivers and couriers and the impact of the global economy, including rising inflation and interest rates. For additional information on other potential risks and uncertainties that could cause actual results to differ from the results predicted, please see our most recent quarterly report on Form 10-Q for the quarter ended September 30, 2024 and subsequent annual reports, quarterly reports and other filings filed with the Securities and Exchange Commission from time to time. All information provided in this release and in the attachments is as of the date of this press release and any forward-looking statements contained herein are based on assumptions that we believe to be reasonable as of this date. Undue reliance should not be placed on the forward-looking statements in this press release, which are based on information available to us on the date hereof. We undertake no duty to update this information unless required by law.</p><p class=\"\">Non-GAAP Financial Measures</p><p class=\"\">To supplement our financial information, which is prepared and presented in accordance with generally accepted accounting principles in the United States of America (\"GAAP\"), we use the following non-GAAP financial measures: Adjusted EBITDA; Free cash flow; Non-GAAP Costs and Operating Expenses as well as, revenue growth rates in constant currency. The presentation of this financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP. We use these non-GAAP financial measures for financial and operational decision-making and as a means to evaluate period-to-period comparisons. We believe that these non-GAAP financial measures provide meaningful supplemental information regarding our performance by excluding certain items that may not be indicative of our recurring core business operating results.</p><p class=\"\">We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance and when planning, forecasting, and analyzing future periods. These non-GAAP financial measures also facilitate management's internal comparisons to our historical performance. We believe these non-GAAP financial measures are useful to investors both because (1) they allow for greater transparency with respect to key metrics used by management in its financial and operational decision-making and (2) they are used by our institutional investors and the analyst community to help them analyze the health of our business.</p><p class=\"\">There are a number of limitations related to the use of non-GAAP financial measures. In light of these limitations, we provide specific information regarding the GAAP amounts excluded from these non-GAAP financial measures and evaluating these non-GAAP financial measures together with their relevant financial measures in accordance with GAAP.</p><p class=\"\">For more information on these non-GAAP financial measures, please see the sections titled \"Key Terms for Our Key Metrics and Non-GAAP Financial Measures,\" \"Definitions of Non-GAAP Measures\" and \"Reconciliations of Non-GAAP Measures\" included at the end of this release. In regards to forward looking non-GAAP guidance, we are not able to reconcile the forward-looking non-GAAP Adjusted EBITDA measure to the closest corresponding GAAP measure without unreasonable efforts because we are unable to predict the ultimate outcome of certain significant items. These items include, but are not limited to, significant legal settlements, unrealized gains and losses on equity investments, tax and regulatory reserve changes, restructuring costs and acquisition and financing related impacts.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                         UBER TECHNOLOGIES, INC. <br/>                  CONDENSED CONSOLIDATED BALANCE SHEETS <br/>                              (In millions) <br/>                                (Unaudited) <br/> <br/>                         As of December 31, 2023  As of December 31, 2024 <br/>                         -----------------------  ------------------------ <br/>Assets <br/>   Cash and cash <br/>    equivalents            $           4,680        $            5,893 <br/>   Short-term <br/>    investments                          727                     1,084 <br/>   Restricted cash and <br/>    cash equivalents                     805                       545 <br/>   Accounts receivable, <br/>    net                                3,404                     3,333 <br/>   Prepaid expenses and <br/>    other current <br/>    assets                             1,681                     1,390 <br/>                         ---  --------------      ---  --------------- <br/>      Total current <br/>       assets                         11,297                    12,245 <br/>Restricted cash and <br/> cash equivalents                      1,519                     2,172 <br/>Restricted investments                 4,779                     7,019 <br/>Investments                            6,101                     8,460 <br/>Equity method <br/> investments                             353                       302 <br/>Property and equipment, <br/> net                                   2,073                     1,952 <br/>Operating lease <br/> right-of-use assets                   1,241                     1,158 <br/>Intangible assets, net                 1,425                     1,125 <br/>Goodwill                               8,151                     8,066 <br/>Deferred tax assets                      170                     6,171 <br/>Other assets                           1,590                     2,574 <br/>                         ---  --------------      ---  --------------- <br/>      Total assets         $          38,699        $           51,244 <br/>                         ===  ==============      ===  =============== <br/>Liabilities, <br/>redeemable <br/>non-controlling <br/>interests and equity <br/>   Accounts payable        $             790        $              858 <br/>   Short-term insurance <br/>    reserves                           2,077                     2,754 <br/>   Operating lease <br/>    liabilities, <br/>    current                              190                       175 <br/>   Accrued and other <br/>    current <br/>    liabilities                        6,397                     7,689 <br/>                         ---  --------------      ---  --------------- <br/>      Total current <br/>       liabilities                     9,454                    11,476 <br/>Long-term insurance <br/> reserves                              4,909                     7,042 <br/>Long-term debt, net of <br/> current portion                       9,459                     8,347 <br/>Operating lease <br/> liabilities, <br/> non-current                           1,550                     1,454 <br/>Other long-term <br/> liabilities                             645                       449 <br/>                         ---  --------------      ---  --------------- <br/>      Total liabilities               26,017                    28,768 <br/>                         ---  --------------      ---  --------------- <br/> <br/>Redeemable <br/> non-controlling <br/> interests                               654                        93 <br/>                         ---  --------------      ---  --------------- <br/>Equity <br/>   Common stock                           --                        -- <br/>   Additional paid-in <br/>    capital                           42,264                    42,801 <br/>   Accumulated other <br/>    comprehensive loss                  (421)                     (517) <br/>   Accumulated deficit               (30,594)                  (20,726) <br/>                         ---  --------------      ---  --------------- <br/>      Total Uber <br/>       Technologies, <br/>       Inc. <br/>       stockholders' <br/>       equity                         11,249                    21,558 <br/>   Non-redeemable <br/>    non-controlling <br/>    interests                            779                       825 <br/>                         ---  --------------      ---  --------------- <br/>      Total equity                    12,028                    22,383 <br/>                         ---  --------------      ---  --------------- <br/>      Total <br/>       liabilities, <br/>       redeemable <br/>       non-controlling <br/>       interests and <br/>       equity              $          38,699        $           51,244 <br/>                         ===  ==============      ===  =============== <br/> <br/> <br/> UBER TECHNOLOGIES, INC. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (In <br/>  millions, except share amounts which are reflected in thousands, and per <br/>                         share amounts) (Unaudited) <br/> <br/>                            Three Months Ended <br/>                               December 31,         Year Ended December 31, <br/>                         ------------------------  -------------------------- <br/>                            2023         2024         2023         2024 <br/>                          ---------    ---------    ---------    --------- <br/>Revenue                  $    9,936   $   11,959   $   37,281   $   43,978 <br/>Costs and expenses <br/>Cost of revenue, <br/> exclusive of <br/> depreciation and <br/> amortization shown <br/> separately below             6,057        7,234       22,457       26,651 <br/>Operations and support          702          678        2,689        2,732 <br/>Sales and marketing             935        1,209        4,356        4,337 <br/>Research and <br/> development                    784          785        3,164        3,109 <br/>General and <br/> administrative                 603        1,114        2,682        3,639 <br/>Depreciation and <br/> amortization                   203          169          823          711 <br/>                          ---------    ---------    ---------    --------- <br/>      Total costs and <br/>       expenses               9,284       11,189       36,171       41,179 <br/>                          ---------    ---------    ---------    --------- <br/>      Income from <br/>       operations               652          770        1,110        2,799 <br/>Interest expense               (155)        (117)        (633)        (523) <br/>Other income (expense), <br/> net                          1,331          256        1,844        1,849 <br/>                          ---------    ---------    ---------    --------- <br/>Income before income <br/> taxes and income <br/> (loss) from equity <br/> method investments           1,828          909        2,321        4,125 <br/>Provision for (benefit <br/> from) income taxes             133       (6,002)         213       (5,758) <br/>Income (loss) from <br/> equity method <br/> investments                      5          (10)          48          (38) <br/>                          ---------    ---------    ---------    --------- <br/>Net income including <br/> non-controlling <br/> interests                    1,700        6,901        2,156        9,845 <br/>      Less: net income <br/>       (loss) <br/>       attributable to <br/>       non-controlling <br/>       interests, net <br/>       of tax                   271           18          269          (11) <br/>                          ---------    ---------    ---------    --------- <br/>Net income attributable <br/> to Uber Technologies, <br/> Inc.                    $    1,429   $    6,883   $    1,887   $    9,856 <br/>                          =========    =========    =========    ========= <br/>Net income per share <br/>attributable to Uber <br/>Technologies, Inc. <br/>common stockholders: <br/>   Basic                 $     0.69   $     3.27   $     0.93   $     4.71 <br/>                          =========    =========    =========    ========= <br/>   Diluted               $     0.66   $     3.21   $     0.87   $     4.56 <br/>                          =========    =========    =========    ========= <br/>Weighted-average <br/>shares used to compute <br/>net income per share <br/>attributable to common <br/>stockholders: <br/>   Basic                  2,060,885    2,105,899    2,035,651    2,094,602 <br/>                          =========    =========    =========    ========= <br/>   Diluted                2,121,929    2,141,426    2,091,782    2,150,508 <br/>                          =========    =========    =========    ========= <br/> <br/> <br/>                    UBER TECHNOLOGIES, INC. <br/>        CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS <br/>                         (In millions) <br/>                          (Unaudited) <br/> <br/>                      Three Months Ended   Year Ended December <br/>                         December 31,              31, <br/>                      ------------------  --------------------- <br/>                        2023      2024      2023      2024 <br/>                       ------    ------    ------    ------- <br/>Cash flows from <br/>operating <br/>activities <br/>Net income including <br/> non-controlling <br/> interests            $ 1,700   $ 6,901   $ 2,156   $  9,845 <br/>Adjustments to <br/>reconcile net <br/>income to net cash <br/>provided by <br/>operating <br/>activities: <br/>   Depreciation and <br/>    amortization          203       176       823        737 <br/>   Bad debt expense        29        14        92         61 <br/>   Stock-based <br/>    compensation          469       419     1,935      1,796 <br/>   Loss from sale <br/>   of investments          --        --        74         -- <br/>   Gain on business <br/>    divestitures         (204)       --      (204)        -- <br/>   Deferred income <br/>    taxes                  (6)   (6,128)       26     (6,027) <br/>   Accretion of <br/>    discounts on <br/>    marketable debt <br/>    securities, net       (62)      (62)     (154)      (251) <br/>   Impairments of <br/>    goodwill, <br/>    long-lived <br/>    assets and other <br/>    assets                  9        --        86         -- <br/>   Loss (income) <br/>    from equity <br/>    method <br/>    investments, <br/>    net                    (5)       10       (48)        38 <br/>   Unrealized gain <br/>    on debt and <br/>    equity <br/>    securities, net    (1,000)     (556)   (1,610)    (1,832) <br/>   Unrealized <br/>    foreign currency <br/>    transactions          (18)      135       138        308 <br/>   Other                   39        68       106         88 <br/>Change in assets <br/>and liabilities, <br/>net of impact of <br/>business <br/>acquisitions and <br/>disposals: <br/>   Accounts <br/>    receivable           (395)      246      (758)      (142) <br/>   Prepaid expenses <br/>    and other <br/>    assets               (281)      (30)   (1,462)      (694) <br/>   Operating lease <br/>    right-of-use <br/>    assets                 50        59       191        196 <br/>   Accounts payable       (22)       62        64         86 <br/>   Accrued insurance <br/>    reserves              614       658     2,230      2,819 <br/>   Accrued expenses <br/>    and other <br/>    liabilities          (254)     (158)       80        330 <br/>   Operating lease <br/>    liabilities           (43)      (64)     (180)      (221) <br/>                       ------    ------    ------    ------- <br/>      Net cash <br/>       provided by <br/>       operating <br/>       activities         823     1,750     3,585      7,137 <br/>                       ------    ------    ------    ------- <br/>Cash flows from <br/>investing <br/>activities <br/>Purchases of <br/> property and <br/> equipment                (55)      (44)     (223)      (242) <br/>Purchases of <br/> non-marketable <br/> equity securities        (10)       (1)      (52)      (289) <br/>Purchases of <br/> marketable <br/> securities            (2,844)   (3,020)   (8,774)   (12,765) <br/>Proceeds from <br/> maturities and <br/> sales of marketable <br/> securities             2,076     4,437     5,069     10,204 <br/>Proceeds from sale <br/> of equity method <br/> investments               --        --       721         17 <br/>Other investing <br/> activities                14        61        33       (102) <br/>                       ------    ------    ------    ------- <br/>      Net cash <br/>       provided by <br/>       (used in) <br/>       investing <br/>       activities        (819)    1,433    (3,226)    (3,177) <br/>                       ------    ------    ------    ------- <br/>Cash flows from <br/>financing <br/>activities <br/>Proceeds from the <br/> issuance of common <br/> stock under the <br/> Employee Stock <br/> Purchase Plan             45        53       130        156 <br/>Issuance of term <br/> loan and notes, net <br/> of issuance costs      1,703        --     2,824      3,972 <br/>Purchase of Capped <br/> Calls                   (141)       --      (141)        -- <br/>Principal repayment <br/> on term loan and <br/> notes                 (1,525)   (2,000)   (2,675)    (3,986) <br/>Principal repayment <br/> on Careem Notes           --        --       (25)        -- <br/>Principal payments <br/> on finance leases        (53)      (50)     (171)      (172) <br/>Repurchases of <br/> common stock              --      (555)       --     (1,252) <br/>Redemption of <br/> non-controlling <br/> interests                 --      (851)       --       (851) <br/>Other financing <br/> activities                17         6       (37)        46 <br/>                       ------    ------    ------    ------- <br/>      Net cash <br/>       provided by <br/>       (used in) <br/>       financing <br/>       activities          46    (3,397)      (95)    (2,087) <br/>                       ------    ------    ------    ------- <br/>Effect of exchange <br/> rate changes on <br/> cash and cash <br/> equivalents, and <br/> restricted cash and <br/> cash equivalents          89      (179)       63       (267) <br/>                       ------    ------    ------    ------- <br/>      Net increase <br/>       (decrease) in <br/>       cash and cash <br/>       equivalents, <br/>       and <br/>       restricted <br/>       cash and cash <br/>       equivalents        139      (393)      327      1,606 <br/>Cash and cash <br/>equivalents, and <br/>restricted cash and <br/>cash equivalents <br/>Beginning of period     6,865     9,003     6,677      7,004 <br/>                       ------    ------    ------    ------- <br/>End of period         $ 7,004   $ 8,610   $ 7,004   $  8,610 <br/>                       ======    ======    ======    ======= <br/> </pre><p class=\"\">Other Income (Expense), Net</p><p class=\"\">The following table presents other income (expense), net (in millions):</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                   Three Months Ended <br/>                      December 31,        Year Ended December 31, <br/>                ------------------------  ------------------------ <br/>                 2023           2024          2023        2024 <br/>                 -----          ----          -----       ----- <br/> <br/>                                   (Unaudited) <br/>Interest <br/> income         $  160       $   191       $    484      $  721 <br/>Foreign <br/> currency <br/> exchange <br/> gains <br/> (losses), <br/> net                 3          (169)          (182)       (391) <br/>Gain on <br/> business <br/> divestitures <br/> (1)               204            --            204          -- <br/>Loss on sale <br/> of <br/> investments        --            --            (74)         -- <br/>Unrealized <br/> gain on debt <br/> and equity <br/> securities, <br/> net (2)         1,000           556          1,610       1,832 <br/>Acquisition <br/> termination <br/> fee                --          (236)            --        (236) <br/>Other, net         (36)          (86)          (198)        (77) <br/>                 -----          ----          -----       ----- <br/>Other income <br/> (expense), <br/> net            $1,331       $   256       $  1,844      $1,849 <br/>                 =====          ====          =====       ===== <br/> <br/> <br/>(1)   During the three and twelve months ended December 31, 2023, gain on <br/>      business divestitures represents a $204 million gain on the sale of <br/>      interest in our Careem non-ridesharing business. <br/>(2)   During the three months ended December 31, 2023, unrealized gain on debt <br/>      and equity securities, net primarily represents changes in the fair <br/>      value of our equity securities including: a $659 million net unrealized <br/>      gain on our Aurora investment, a $414 million net unrealized gain on our <br/>      Didi investment, partially offset by a $91 million net unrealized loss <br/>      on our Grab investment. <br/>      During the year ended December 31, 2023, unrealized gain on debt and <br/>      equity securities, net primarily represents changes in the fair value of <br/>      our equity securities including: a $985 million net unrealized gain on <br/>      our Aurora investment, a $443 million net unrealized gain on our Didi <br/>      investment, a $84 million net unrealized gain on our Joby investment, <br/>      and a $80 million net unrealized gain on our Grab investment. <br/>      During the three months ended December 31, 2024, unrealized gain on debt <br/>      and equity securities, net primarily represents changes in the fair <br/>      value of our equity securities including: a $493 million net unrealized <br/>      gain on our Grab investment, a $124 million net unrealized gain on our <br/>      Aurora investment, a $79 million net unrealized gain on our Joby <br/>      investment, partially offset by a $86 million net unrealized loss on our <br/>      Delivery Hero investment, and a $75 million net unrealized loss on our <br/>      Didi investment. <br/>      During the year ended December 31, 2024, unrealized gain on debt and <br/>      equity securities, net primarily represents changes in the fair value of <br/>      our equity securities including: a $723 million net unrealized gain on <br/>      our Grab investment, a $629 million net unrealized gain on our Aurora <br/>      investment, and a $357 million net unrealized gain on our Didi <br/>      investment. <br/> </pre><p class=\"\">Stock-Based Compensation Expense</p><p class=\"\">The following table summarizes total stock-based compensation expense by function (in millions):</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                    Three Months Ended     Year Ended December <br/>                       December 31,                31, <br/>                  ----------------------  ---------------------- <br/>                        2023       2024       2023       2024 <br/>                  ----  ----  ---  -----      -----      ----- <br/> <br/>                                   (Unaudited) <br/>Operations and <br/> support             $    52    $     47   $    184   $    218 <br/>Sales and <br/> marketing                22          23         96         91 <br/>Research and <br/> development             298         260      1,215      1,104 <br/>General and <br/> administrative           97          89        440        383 <br/>                  ----  ----  ---  -----      -----      ----- <br/>Total                $   469    $    419   $  1,935   $  1,796 <br/>                  ====  ====  ===  =====      =====      ===== <br/> <br/> </pre><p class=\"\">Key Terms for Our Key Metrics and Non-GAAP Financial Measures</p><p class=\"\">Adjusted EBITDA. Adjusted EBITDA is a Non-GAAP measure. We define Adjusted EBITDA as net income (loss), excluding (i) income (loss) from discontinued operations, net of income taxes, (ii) net income (loss) attributable to non-controlling interests, net of tax, (iii) provision for (benefit from) income taxes, (iv) income (loss) from equity method investments, (v) interest expense, (vi) other income (expense), net, (vii) depreciation and amortization, (viii) stock-based compensation expense, (ix) certain legal, tax, and regulatory reserve changes and settlements, (x) goodwill and asset impairments/loss on sale of assets, (xi) acquisition, financing and divestitures related expenses, (xii) restructuring and related charges and (xiii) other items not indicative of our ongoing operating performance.</p><p class=\"\">Adjusted EBITDA margin. We define Adjusted EBITDA margin as Adjusted EBITDA as a percentage of Gross Bookings. We define incremental margin as the change in Adjusted EBITDA between periods divided by the change in Gross Bookings between periods.</p><p class=\"\">Aggregate Driver and Courier Earnings. Aggregate Driver and Courier Earnings refers to fares (net of Uber service fee, taxes and tolls), tips, Driver incentives and Driver benefits.</p><p class=\"\">Driver(s). The term Driver collectively refers to independent providers of ride or delivery services who use our platform to provide Mobility or Delivery services, or both.</p><p class=\"\">Driver or restaurant earnings. Driver or restaurant earnings refer to the net portion of the fare or the net portion of the order value that a Driver or a restaurant retains, respectively. These are generally included in aggregate Drivers and Couriers earnings.</p><p class=\"\">Driver incentives. Driver incentives refer to payments that we make to Drivers, which are separate from and in addition to the Driver's portion of the fare paid by the consumer after we retain our service fee to Drivers. For example, Driver incentives could include payments we make to Drivers should they choose to take advantage of an incentive offer and complete a consecutive number of trips or a cumulative number of trips on the platform over a defined period of time. Driver incentives are recorded as a reduction of revenue or cost of revenue, exclusive of depreciation and amortization. These incentives are generally included in aggregate Drivers and Couriers earnings.</p><p class=\"\">Free cash flow. Free cash flow is a Non-GAAP measure. We define free cash flow as net cash flows from operating activities less capital expenditures.</p><p class=\"\">Gross Bookings. We define Gross Bookings as the total dollar value, including any applicable taxes, tolls, and fees, of: Mobility rides, Delivery orders (in each case without any adjustment for consumer discounts and refunds, Driver and Merchant earnings, and Driver incentives) and Freight revenue. Gross Bookings do not include tips earned by Drivers. Gross Bookings are an indication of the scale of our current platform, which ultimately impacts revenue.</p><p class=\"\">Monthly Active Platform Consumers (\"MAPCs\"). We define MAPCs as the number of unique consumers who completed a Mobility ride or received a Delivery order on our platform at least once in a given month, averaged over each month in the quarter. While a unique consumer can use multiple product offerings on our platform in a given month, that unique consumer is counted as only one MAPC.</p><p class=\"\">Revenue Margin. We define Revenue Margin as revenue as a percentage of Gross Bookings.</p><p class=\"\">Segment Adjusted EBITDA. We define each segment's Adjusted EBITDA as segment revenue less direct costs and expenses of that segment as well as any applicable exclusions from Adjusted EBITDA.</p><p class=\"\">Segment Adjusted EBITDA margin. We define each segment's Adjusted EBITDA margin as the segment Adjusted EBITDA as a percentage of segment Gross Bookings.</p><p class=\"\">Trips. We define Trips as the number of completed consumer Mobility rides and Delivery orders in a given period. For example, an UberX Share ride with three paying consumers represents three unique Trips, whereas an UberX ride with three passengers represents one Trip. We believe that Trips are a useful metric to measure the scale and usage of our platform.</p><p class=\"\">Definitions of Non-GAAP Measures</p><p class=\"\">We collect and analyze operating and financial data to evaluate the health of our business and assess our performance. In addition to revenue, net income (loss), income (loss) from operations, and other results under GAAP, we use: Adjusted EBITDA; Free cash flow; Non-GAAP Costs and Operating Expenses; as well as, revenue growth rates in constant currency, which are described below, to evaluate our business. We have included these non-GAAP financial measures because they are key measures used by our management to evaluate our operating performance. Accordingly, we believe that these non-GAAP financial measures provide useful information to investors and others in understanding and evaluating our operating results in the same manner as our management team and board of directors. Our calculation of these non-GAAP financial measures may differ from similarly-titled non-GAAP measures, if any, reported by our peer companies. These non-GAAP financial measures should not be considered in isolation from, or as substitutes for, financial information prepared in accordance with GAAP.</p><p class=\"\">Adjusted EBITDA</p><p class=\"\">We define Adjusted EBITDA as net income (loss), excluding (i) income (loss) from discontinued operations, net of income taxes, (ii) net income (loss) attributable to non-controlling interests, net of tax, (iii) provision for (benefit from) income taxes, (iv) income (loss) from equity method investments, (v) interest expense, (vi) other income (expense), net, (vii) depreciation and amortization, (viii) stock-based compensation expense, (ix) certain legal, tax, and regulatory reserve changes and settlements, (x) goodwill and asset impairments/loss on sale of assets, (xi) acquisition, financing and divestitures related expenses, (xii) restructuring and related charges and (xiii) other items not indicative of our ongoing operating performance.</p><p class=\"\">We have included Adjusted EBITDA because it is a key measure used by our management team to evaluate our operating performance, generate future operating plans, and make strategic decisions, including those relating to operating expenses. Accordingly, we believe that Adjusted EBITDA provides useful information to investors and others in understanding and evaluating our operating results in the same manner as our management team and board of directors. In addition, it provides a useful measure for period-to-period comparisons of our business, as it removes the effect of certain non-cash expenses and certain variable charges.</p><p class=\"\">Legal, tax, and regulatory reserve changes and settlements</p><p class=\"\">Legal, tax, and regulatory reserve changes and settlements are primarily related to certain significant legal proceedings or governmental investigations related to worker classification definitions, or tax agencies challenging our non-income tax positions. These matters have limited precedent, cover extended historical periods and are unpredictable in both magnitude and timing, therefore are distinct from normal, recurring legal, tax and regulatory matters and related expenses incurred in our ongoing operating performance.</p><p class=\"\">Limitations of Non-GAAP Financial Measures and Adjusted EBITDA Reconciliation</p><p class=\"\">Adjusted EBITDA has limitations as a financial measure, should be considered as supplemental in nature, and is not meant as a substitute for the related financial information prepared in accordance with GAAP. These limitations include the following:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA excludes certain recurring, non-cash charges, such as   depreciation of property and equipment and amortization of intangible   assets, and although these are non-cash charges, the assets being   depreciated and amortized may have to be replaced in the future, and   Adjusted EBITDA does not reflect all cash capital expenditure   requirements for such replacements or for new capital expenditure   requirements;     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA excludes stock-based compensation expense, which has   been, and will continue to be for the foreseeable future, a significant   recurring expense in our business and an important part of our   compensation strategy;     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA excludes certain restructuring and related charges,   part of which may be settled in cash;     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA excludes other items not indicative of our ongoing   operating performance;     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA does not reflect period to period changes in taxes,   income tax expense or the cash necessary to pay income taxes;     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA does not reflect the components of other income   (expense), net, which primarily includes: interest income; foreign   currency exchange gains (losses), net; and unrealized gain (loss) on debt   and equity securities, net; and     </li><li class=\"listItem-bmN0_SHH\">Adjusted EBITDA excludes certain legal, tax, and regulatory reserve   changes and settlements that may reduce cash available to us.   </li></ul><p class=\"\">Constant Currency</p><p class=\"\">We compare the percent change in our current period results from the corresponding prior period using constant currency disclosure. We present constant currency growth rate information to provide a framework for assessing how our underlying revenue performed excluding the effect of foreign currency rate fluctuations. We calculate constant currency by translating our current period financial results using the corresponding prior period's monthly exchange rates for our transacted currencies other than the U.S. dollar.</p><p class=\"\">Free Cash Flow</p><p class=\"\">We define free cash flow as net cash flows from operating activities less capital expenditures.</p><p class=\"\">Non-GAAP Costs and Operating Expenses</p><p class=\"\">Costs and operating expenses are defined as: cost of revenue, exclusive of depreciation and amortization; operations and support; sales and marketing; research and development; and general and administrative expenses. We define Non-GAAP costs and operating expenses as costs and operating expenses excluding: (i) stock-based compensation expense, (ii) certain legal, tax, and regulatory reserve changes and settlements, (iii) goodwill and asset impairments/loss on sale of assets, (iv) acquisition, financing and divestiture related expenses, (v) restructuring and related charges and (vi) other items not indicative of our ongoing operating performance.</p><p class=\"\">Reconciliations of Non-GAAP Measures</p><p class=\"\">Adjusted EBITDA</p><p class=\"\">The following table presents reconciliations of Adjusted EBITDA to the most directly comparable GAAP financial measure for each of the periods indicated:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                       Three Months Ended  Year Ended December <br/>                          December 31,             31, <br/>                       ------------------  -------------------- <br/>(In millions)            2023      2024      2023      2024 <br/>--------------------    ------    ------    ------    ------ <br/>Adjusted EBITDA <br/>reconciliation: <br/>Net income <br/> attributable to Uber <br/> Technologies, Inc.    $ 1,429   $ 6,883   $ 1,887   $ 9,856 <br/>Add (deduct): <br/>   Net income (loss) <br/>    attributable to <br/>    non-controlling <br/>    interests, net of <br/>    tax                    271        18       269       (11) <br/>   (Income) loss from <br/>    equity method <br/>    investments             (5)       10       (48)       38 <br/>   Provision for <br/>    (benefit from) <br/>    income taxes           133    (6,002)      213    (5,758) <br/>   Other (income) <br/>    expense, net        (1,331)     (256)   (1,844)   (1,849) <br/>   Interest expense        155       117       633       523 <br/>                        ------    ------    ------    ------ <br/>Income from <br/> operations                652       770     1,110     2,799 <br/>Add (deduct): <br/>   Depreciation and <br/>    amortization           203       169       823       711 <br/>   Stock-based <br/>    compensation <br/>    expense                469       419     1,935     1,796 <br/>   Legal, tax, and <br/>    regulatory <br/>    reserve changes <br/>    and settlements        (73)      462         9     1,123 <br/>   Goodwill and asset <br/>    impairments/loss <br/>    on sale of <br/>    assets                  (1)        6        84         3 <br/>   Acquisition, <br/>    financing and <br/>    divestitures <br/>    related expenses         9         9        36        25 <br/>   Loss on lease <br/>    arrangements, <br/>    net                      8         2         4         2 <br/>   Restructuring and <br/>    related charges, <br/>    net                     16         5        51        25 <br/>                        ------    ------    ------    ------ <br/>Adjusted EBITDA        $ 1,283   $ 1,842   $ 4,052   $ 6,484 <br/>                        ======    ======    ======    ====== <br/> <br/> </pre><p class=\"\">Free Cash Flow</p><p class=\"\">The following table presents reconciliations of free cash flow to the most directly comparable GAAP financial measure for each of the periods indicated:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                   Three Months Ended   Year Ended December <br/>                      December 31,              31, <br/>                   ------------------  --------------------- <br/>(In millions)       2023    2024        2023        2024 <br/>----------------    ----    -----       -----       ----- <br/>Free cash flow <br/>reconciliation: <br/>Net cash provided <br/> by operating <br/> activities        $ 823   $1,750      $3,585      $7,137 <br/>   Purchases of <br/>    property and <br/>    equipment        (55)     (44)       (223)       (242) <br/>                    ----    -----       -----       ----- <br/>Free cash flow     $ 768   $1,706      $3,362      $6,895 <br/>                    ====    =====       =====       ===== <br/> </pre><p class=\"\">Non-GAAP Costs and Operating Expenses</p><p class=\"\">The following tables present reconciliations of Non-GAAP costs and operating expenses to the most directly comparable GAAP financial measure for each of the periods indicated:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                     Three Months Ended <br/>                       ----------------------------------------------- <br/>                         December 31,     September     December 31, <br/>(In millions)                2023         30, 2024          2024 <br/>--------------------   ----------------  -----------  ---------------- <br/>Non-GAAP Cost of <br/>revenue exclusive of <br/>depreciation and <br/>amortization <br/>reconciliation: <br/>GAAP Cost of revenue <br/> exclusive of <br/> depreciation and <br/> amortization            $    6,057        $   6,761    $    7,234 <br/>      Restructuring <br/>       and related <br/>       charges                   (9)              --            (2) <br/>                       ---  -------      ---  ------  ---  ------- <br/>   Non-GAAP Cost of <br/>    revenue exclusive <br/>    of depreciation <br/>    and amortization     $    6,048        $   6,761    $    7,232 <br/>                       ===  =======      ===  ======  ===  ======= <br/> <br/> <br/>                                        Three Months Ended <br/>                          ---------------------------------------------- <br/>                           December 31,   September 30,    December 31, <br/>(In millions)                  2023            2024            2024 <br/>-----------------------   --------------  --------------  -------------- <br/>Non-GAAP Operating <br/>Expenses <br/>   Non-GAAP Operations <br/>   and support <br/>   reconciliation: <br/>   GAAP Operations and <br/>    support                 $    702        $    687        $    678 <br/>      Restructuring and <br/>       related charges            (3)             (1)             (1) <br/>      Goodwill and asset <br/>       impairments/loss <br/>       on sale of <br/>       assets                     --              --              (6) <br/>      Acquisition, <br/>       financing and <br/>       divestitures <br/>       related expenses           (1)             --              -- <br/>      Stock-based <br/>       compensation <br/>       expense                   (52)            (50)            (47) <br/>                          ---  -----      ---  -----      ---  ----- <br/>   Non-GAAP Operations <br/>    and support             $    646        $    636        $    624 <br/>                          ===  =====      ===  =====      ===  ===== <br/> <br/>   Non-GAAP Sales and <br/>   marketing <br/>   reconciliation: <br/>   GAAP Sales and <br/>    marketing               $    935        $  1,096        $  1,209 <br/>      Restructuring and <br/>       related charges            (1)             --              -- <br/>      Stock-based <br/>       compensation <br/>       expense                   (22)            (23)            (23) <br/>                          ---  -----      ---  -----      ---  ----- <br/>   Non-GAAP Sales and <br/>    marketing               $    912        $  1,073        $  1,186 <br/>                          ===  =====      ===  =====      ===  ===== <br/> <br/>   Non-GAAP Research <br/>   and development <br/>   reconciliation: <br/>   GAAP Research and <br/>    development             $    784        $    774        $    785 <br/>      Restructuring and <br/>       related charges            (3)             (1)             -- <br/>      Stock-based <br/>       compensation <br/>       expense                  (298)           (268)           (260) <br/>                          ---  -----      ---  -----      ---  ----- <br/>   Non-GAAP Research and <br/>    development             $    483        $    505        $    525 <br/>                          ===  =====      ===  =====      ===  ===== <br/> <br/>   Non-GAAP General and <br/>   administrative <br/>   reconciliation: <br/>   GAAP General and <br/>    administrative          $    603        $    630        $  1,114 <br/>      Legal, tax, and <br/>       regulatory <br/>       reserve changes <br/>       and settlements            73              --            (462) <br/>      Goodwill and <br/>      asset <br/>      impairments/loss <br/>      on sale of <br/>      assets                       1              --              -- <br/>      Restructuring and <br/>       related charges            --              (2)             (2) <br/>      Acquisition, <br/>       financing and <br/>       divestitures <br/>       related expenses           (8)             (8)             (9) <br/>      Loss on lease <br/>       arrangements, <br/>       net                        (8)             --              (2) <br/>      Stock-based <br/>       compensation <br/>       expense                   (97)            (97)            (89) <br/>                          ---  -----      ---  -----      ---  ----- <br/>   Non-GAAP General and <br/>    administrative          $    564        $    523        $    550 <br/>                          ===  =====      ===  =====      ===  ===== <br/> </pre><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205669831/en/</p><p class=\"\">CONTACT:    Investors and analysts: investor@uber.com</p><p class=\"\">Media: press@uber.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004421:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:fd063960e8830:0",
            "title": "LiveWire Group, Inc. Reports 2024 Fourth Quarter and Full Year Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LiveWire Group, Inc., a company focused on the electric motorcycle sector, has released its financial results for the fourth quarter and full year of 2024. The company, which is majority-owned by Harley-Davidson, Inc., has been working on several initiatives to navigate market dynamics and reposition itself for 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, LiveWire reported a consolidated revenue of $10.8 million, a decrease of 29% compared to the same period in 2023. The full year revenue was $26.6 million, down 30% from the previous year. The company’s net loss for the fourth quarter was $22.8 million, an improvement from the $33.1 million loss in the same period last year. For the full year, the net loss was $93.9 million, compared to $109.6 million in 2023.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">LiveWire's S2 Del Mar® was awarded MCN’s Best Electric Bike of 2024. The company also announced the production of two new models, Mulholland and Alpinista, off the S2 platform. Additionally, LiveWire collaborated with KYMCO on an electric maxi-scooter project leveraging the S2 platform. The company completed the consolidation of its business operations in Milwaukee, Wisconsin, and reduced consolidated selling, administrative, and engineering expenses by $12.6 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">LiveWire has aligned its go-to-market strategy with Europe, moving to a wholesale model and entering the Spanish and Italian markets. The company expects to reduce its cash burn by 40% or more in 2025 compared to 2024. The company also plans to continue establishing its leadership in the EV space with its world-class products and best-in-the-industry retail partners.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Karim Donnez, CEO of LiveWire, commented, “In 2024, we undertook several initiatives to navigate the market dynamics and turned challenges into opportunities to reposition the business for 2025. We now expect to reduce our cash burn by 40% or more in 2025 compared to 2024. The Company plans to continue establishing its leadership in the EV space. With our world-class products, first-class team, and best-in-the-industry retail partners, we will continue to relentlessly improve the fundamentals of the business and position ourselves for long-term success.”</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For the full year 2025, LiveWire expects to sell between 1,000 to 1,500 electric motorcycle revenue units. The company also projects an operating loss of $70 to $80 million for the year.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1898795/000189879525000017/lvwr-20250205.htm\" rel=\"nofollow\" target=\"_blank\">LiveWire Group, Inc. [ LVWR ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:fd063960e8830:0-livewire-group-inc-reports-2024-fourth-quarter-and-full-year-financial-results/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:5245005034044:0",
            "title": "Kennametal Fiscal 2025 Second Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kennametal Inc., a global leader in industrial technology, has released its financial results for the second quarter of fiscal 2025, ending December 31, 2024. The company reported a mixed performance with some positive cash flow metrics but also highlighted challenges in certain markets.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the second quarter of fiscal 2025, Kennametal reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Sales of $482 million, a 3% decrease from $495 million in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Earnings per diluted share (EPS) of $0.23, down from $0.29 in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Adjusted EPS of $0.25, compared to $0.30 in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Operating income of $32 million, or a 6.6% margin, up from $28 million, or a 5.7% margin, in the prior year quarter.</li><li class=\"listItem-bmN0_SHH\">Year-to-date cash from operations of $101 million, up from $88 million in the prior year.</li><li class=\"listItem-bmN0_SHH\">Free operating cash flow of $57 million, up from $36 million in the prior year.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">The company experienced a 3% decrease in sales, primarily due to a 6% organic sales decline, partially offset by a favorable business days effect of 3%. The Metal Cutting segment saw a 4% decrease in sales, while the Infrastructure segment's sales remained flat. The company also achieved incremental year-over-year restructuring savings of approximately $6 million.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Kennametal returned approximately $31 million to shareholders through $15 million in share repurchases and $16 million in dividends. The company also announced additional restructuring actions expected to deliver annualized run rate pre-tax savings of approximately $15 million by the end of fiscal 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Sanjay Chowbey, President and CEO, commented, \"This quarter we once again generated strong cash flow from operations. However, conditions in a number of our end markets, primarily in EMEA, continued to weaken resulting in sales at the lower end of our expectations.\" He also noted that the company has reduced its full-year outlook due to these challenging conditions.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For the third quarter of fiscal 2025, Kennametal expects sales to be between $480 million and $500 million, with an adjusted EPS of $0.20 to $0.30. For the full fiscal year, the company now expects sales to be between $1.950 billion and $2.0 billion, with an adjusted EPS of $1.05 to $1.30. The company also anticipates free operating cash flow to be greater than 125% of adjusted net income.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/55242/000005524225000017/kmt-20250205.htm\" rel=\"nofollow\" target=\"_blank\">KENNAMETAL INC [ KMT ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:5245005034044:0-kennametal-fiscal-2025-second-quarter-results/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004400_20250205004442:0",
            "title": "Harley-Davidson Sees 2025 LiveWire Operating Loss $70M-$80M >HOG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004400_20250205004442:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:28cecf131caa0:0",
            "title": "Harley-Davidson 8-K Filing Analysis",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Harley-Davidson, Inc., a leading manufacturer of motorcycles, has released its fourth quarter and full year 2024 financial results, providing insights into its performance amidst challenging market conditions. The company also shared its outlook for 2025.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the full year 2024, Harley-Davidson reported a diluted EPS of $3.44, a decrease from $4.87 in 2023. The company's revenue for the year was $5.19 billion, down 11% from the previous year. Operating income also saw a significant decline, dropping 47% to $417 million.</p><p class=\"\">In the fourth quarter of 2024, the company experienced a diluted EPS loss of $0.93, with revenue falling 35% to $688 million. The operating loss for the quarter was $193 million, compared to a loss of $21 million in the same period last year.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Harley-Davidson's global motorcycle shipments for 2024 were 148,862 units, a 17% decrease from the previous year. In North America, retail sales of Touring, Trike, and CVO motorcycles increased by more than 8%. However, global retail sales of new motorcycles were down 7% for the year.</p><p class=\"\">The company launched new Street Glide and Road Glide touring motorcycles, contributing to nearly 5% growth in the U.S. Touring segment and driving Harley-Davidson's market share to 74.5% in 2024.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Harley-Davidson repurchased $450 million worth of shares (12.5 million shares) on a discretionary basis and paid cash dividends of $91 million. The company also generated $1.1 billion of cash from operating activities and ended the year with $1.6 billion in cash and cash equivalents.</p><p class=\"\">LiveWire, Harley-Davidson's electric motorcycle segment, reported a 31% decrease in revenue for the full year, with an operating loss of $110 million. The company sold 612 electric motorcycles in 2024, down from 660 in 2023.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Jochen Zeitz, Chairman, President, and CEO of Harley-Davidson, commented on the results, stating, \"In 2024, we saw our performance being significantly impacted by the continued cyclical headwinds for discretionary products, including the high-interest rate environment affecting consumer confidence. The decisions we have made and the bold actions we have taken as part of our Hardwire strategy are continuing to strengthen our foundation for the future.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">For 2025, Harley-Davidson expects HDMC revenue to be flat to down 5% and operating income margin to be between 7.0% and 8.0%. HDFS operating income is projected to decline by 10% to 15%. LiveWire is expected to sell between 1,000 and 1,500 electric motorcycles, with an operating loss of $70 to $80 million. The company anticipates diluted earnings per share to be flat to down 5% and plans capital investments of $225 to $250 million.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/793952/000079395225000005/hog-20250205.htm\" rel=\"nofollow\" target=\"_blank\">HARLEY-DAVIDSON, INC. [ HOG ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:28cecf131caa0:0-harley-davidson-8-k-filing-analysis/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004460:0",
            "title": "Emerson Reports First Quarter 2025 Results; Updates 2025 Outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Emerson Reports First Quarter 2025 Results; Updates 2025 Outlook</p><p class=\"\">PR Newswire</p><p class=\"\">ST. LOUIS, Feb. 5, 2025</p><p class=\"\">ST. LOUIS, Feb. 5, 2025 /PRNewswire/ — Emerson  today reported results(1) for its first quarter ended December 31, 2024 and updated its full year outlook for fiscal 2025. Emerson also declared a quarterly cash dividend of $0.5275 per share of common stock payable March 10, 2025 to stockholders of record on February 14, 2025.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>(dollars in millions, except per share)   2024 Q1  2025 Q1   Change <br/>----------------------------------------  -------  -------  -------- <br/>Underlying Orders(2)                                          1 % <br/>----------------------------------------  -------  -------  -------- <br/>Net Sales                                 $4,117   $4,175     1 % <br/>   Underlying Sales(3)                                        2 % <br/>----------------------------------------  -------  -------  -------- <br/>Pretax Earnings                            $175     $775 <br/>   Margin                                  4.2 %   18.6 %   1440 bps <br/>----------------------------------------  -------  -------  -------- <br/>Adjusted Segment EBITA(4)                 $1,014   $1,169 <br/>   Margin                                 24.6 %   28.0 %   340 bps <br/>----------------------------------------  -------  -------  -------- <br/>GAAP Earnings Per Share                    $0.29    $1.02    252 % <br/>Adjusted Earnings Per Share(5)             $1.22    $1.38     13 % <br/>----------------------------------------  -------  -------  -------- <br/>Operating Cash Flow                        $444     $777      75 % <br/>Free Cash Flow                             $367     $694      89 % <br/>----------------------------------------  -------  -------  -------- <br/> </pre><p class=\"\">Management Commentary</p><p class=\"\">\"Emerson began the fiscal year on a strong note, exceeding first quarter expectations for incremental operating margins and earnings per share with strong cash flow generation,\" said Emerson President and Chief Executive Officer Lal Karsanbhai. \"Our record gross profit margin and adjusted segment EBITA margin reflect the strength of our transformed industrial technology portfolio and Emerson Management System, as well as the talent and dedication of our world-class team.\"</p><p class=\"\">Karsanbhai continued, \"We reiterate our guide for underlying sales, earnings per share and cash flow driven by resilient demand in process and hybrid markets, expected second half discrete recovery and our proven ability to execute. Our team remains energized, and we look forward to continuing the positive momentum across our business, including progressing in the final phase of our portfolio transformation.\"</p><p class=\"\">2025 Outlook</p><p class=\"\">The following tables summarize the fiscal year 2025 guidance framework and does not include any impact from the recently announced portfolio transactions(6) related to AspenTech and Safety &amp; Productivity. The 2025 outlook assumes returning approximately $3.2 billion to shareholders through approximately $2.0 billion of share repurchases and approximately $1.2 billion of dividend payments. Guidance figures are approximate.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                                     2025 Q2         2025 <br/>------------------------------------------------  -------------  ------------- <br/>Net Sales Growth                                  (0.5%) - 0.5%   1.5% - 3.5% <br/>Underlying Sales Growth                              1% - 2%        3% - 5% <br/>------------------------------------------------  -------------  ------------- <br/>Earnings Per Share                                $1.01 - $1.05  $4.42 - $4.62 <br/>   Amortization of Intangibles                       $0.31         $1.21 <br/>   Restructuring / Related Costs                     $0.04         $0.14 <br/>   Acquisition / Divestiture Fees and Related <br/>    Costs                                            $0.02         $0.08 <br/>Adjusted Earnings Per Share                       $1.38 - $1.42  $5.85 - $6.05 <br/>------------------------------------------------  -------------  ------------- <br/>Operating Cash Flow                                              $3.6B - $3.7B <br/>Free Cash Flow                                                   $3.2B - $3.3B <br/>------------------------------------------------  -------------  ------------- <br/> <br/> <br/> <br/>(1) Results are presented on a continuing operations basis. <br/>(2) Underlying orders do not include AspenTech. <br/>(3) Underlying sales excludes the impact of currency translation, and <br/>significant acquisitions and divestitures. <br/>(4) Adjusted segment EBITA represents segment earnings excluding restructuring <br/>and intangibles amortization expense. <br/>(5) Adjusted EPS excludes intangibles amortization expense, restructuring and <br/>related costs, the amortization of acquisition-related inventory step-up, <br/>acquisition/divestiture gains, losses, fees and related costs, and discrete <br/>taxes. <br/>(6) Guidance includes Safety &amp; Productivity and assumes AspenTech at our <br/>current ownership of 57% outstanding shares. <br/> </pre><p class=\"\">Conference Call</p><p class=\"\">Today, beginning at 7:30 a.m. Central Time / 8:30 a.m. Eastern Time, Emerson management will discuss the first quarter results during an investor conference call. Participants can access a live webcast available at www.emerson.com/investors at the time of the call. A replay of the call will be available for 90 days. Conference call slides will be posted in advance of the call on the company website.</p><p class=\"\">About Emerson</p><p class=\"\">Emerson  is a global technology and software company providing innovative solutions for the world's essential industries. Through its leading automation portfolio, including its majority stake in AspenTech, Emerson helps hybrid, process and discrete manufacturers optimize operations, protect personnel, reduce emissions and achieve their sustainability goals. For more information, visit Emerson.com.</p><p class=\"\">Forward-Looking and Cautionary Statements</p><p class=\"\">Statements in this press release that are not strictly historical may be \"forward-looking\" statements, which involve risks and uncertainties, and Emerson undertakes no obligation to update any such statements to reflect later developments. These risks and uncertainties include the scope, duration and ultimate impacts of the Russia-Ukraine and other global conflicts, as well as economic and currency conditions, market demand, pricing, protection of intellectual property, cybersecurity, tariffs, competitive and technological factors, inflation, among others, as set forth in the Company's most recent Annual Report on Form 10-K and subsequent reports filed with the SEC. The outlook contained herein represents the Company's expectation for its consolidated results, other than as noted herein.</p><p class=\"\">Emerson uses our Investor Relations website, www.Emerson.com/investors, as a means of disclosing information which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website, in addition to following our press releases, SEC filings, public conference calls, webcasts and social media. The information contained on, or that may be accessed through, our website is not incorporated by reference into, and is not a part of, this document.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>Investors:        Media: <br/>----------------  -------------------------------------- <br/>Colleen Mettler   Joseph Sala / Greg Klassen <br/>(314) 553-2197    Joele Frank, Wilkinson Brimmer Katcher <br/>                  (212) 355-4449 <br/> </pre><p class=\"\">(tables attached)</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                                                Table 1 <br/>                                                           ----------------- <br/>                          EMERSON AND SUBSIDIARIES <br/>                       CONSOLIDATED OPERATING RESULTS <br/>             (AMOUNTS IN MILLIONS EXCEPT PER SHARE, UNAUDITED) <br/> <br/>                                                Quarter Ended Dec 31 <br/>                                        ------------------------------------ <br/>                                              2023               2024 <br/>                                        -----------------  ----------------- <br/> <br/>Net sales                                $          4,117   $          4,175 <br/> Cost and expenses <br/>    Cost of sales                                   2,201              1,940 <br/>    SG&amp;A expenses                                   1,277              1,224 <br/>    Other deductions, net                             451                228 <br/>    Interest expense, net                              44                  8 <br/>    Interest income from related <br/>    party(1)                                         (31)                 -- <br/>                                        -----------------  ----------------- <br/>Earnings from continuing operations <br/> before income taxes                                  175                775 <br/> Income taxes                                          16                182 <br/>                                        -----------------  ----------------- <br/>Earnings from continuing operations                   159                593 <br/> Discontinued operations, net of tax                 (27)                 -- <br/>                                        -----------------  ----------------- <br/>Net earnings                                          132                593 <br/> Less: Noncontrolling interests in <br/>  subsidiaries                                       (10)                  8 <br/>                                        -----------------  ----------------- <br/>Net earnings common stockholders        $             142  $             585 <br/>                                        -----------------  ----------------- <br/> <br/>Earnings common stockholders <br/> Earnings from continuing operations    $             169  $             585 <br/> Discontinued operations                             (27)                 -- <br/>                                        -----------------  ----------------- <br/>Net earnings common stockholders        $             142  $             585 <br/>                                        -----------------  ----------------- <br/> <br/> Diluted avg. shares outstanding                    573.3              571.1 <br/> <br/>Diluted earnings per share common <br/>stockholders <br/> Earnings from continuing operations    $            0.29  $            1.02 <br/> Discontinued operations                           (0.04)                 -- <br/>                                        -----------------  ----------------- <br/>Diluted earnings per common share       $            0.25  $            1.02 <br/> <br/> <br/>                                                Quarter Ended Dec 31 <br/>                                        ------------------------------------ <br/>                                              2023               2024 <br/>                                        -----------------  ----------------- <br/>Other deductions, net <br/> Amortization of intangibles            $             274  $             229 <br/> Restructuring costs                                   83                 11 <br/> Other                                                 94               (12) <br/>                                        -----------------  ----------------- <br/>Total                                   $             451  $             228 <br/>                                        =================  ================= <br/> <br/>(1) Represents interest on the Copeland note receivable <br/> <br/> <br/>                                                                Table 2 <br/>                                                            ---------------- <br/>                          EMERSON AND SUBSIDIARIES <br/>                        CONSOLIDATED BALANCE SHEETS <br/>                      (DOLLARS IN MILLIONS, UNAUDITED) <br/> <br/> <br/>                                           Sept 30, 2024      Dec 31, 2024 <br/>                                         -----------------  ---------------- <br/>Assets <br/>    Cash and equivalents                  $          3,588  $          2,834 <br/>    Receivables, net                                 2,927             2,694 <br/>    Inventories                                      2,180             2,200 <br/>    Other current assets                             1,497             1,466 <br/>                                         -----------------  ---------------- <br/> Total current assets                               10,192             9,194 <br/>    Property, plant &amp; equipment, net                 2,807             2,743 <br/>    Goodwill                                        18,067            17,906 <br/>    Other Intangibles                               10,436            10,025 <br/>    Other                                            2,744             2,742 <br/>                                         -----------------  ---------------- <br/>Total assets                               $        44,246   $        42,610 <br/>                                         =================  ================ <br/> <br/>Liabilities and equity <br/>    Short-term borrowings and current <br/>     maturities of long-term debt        $             532  $          1,066 <br/>    Accounts payable                                 1,335             1,260 <br/>    Accrued expenses                                 3,875             3,632 <br/>                                         -----------------  ---------------- <br/> Total current liabilities                           5,742             5,958 <br/>    Long-term debt                                   7,155             6,557 <br/>    Other liabilities                                3,840             3,716 <br/>Equity <br/>    Common stockholders' equity                     21,636            20,490 <br/>    Noncontrolling interests in <br/>     subsidiaries                                    5,873             5,889 <br/>                                         -----------------  ---------------- <br/> Total equity                                       27,509            26,379 <br/>                                         -----------------  ---------------- <br/>Total liabilities and equity               $        44,246   $        42,610 <br/>                                         =================  ================ <br/> <br/> <br/>                                                              Table 3 <br/>                                                         ----------------- <br/>                         EMERSON AND SUBSIDIARIES <br/>                  CONSOLIDATED STATEMENTS OF CASH FLOWS <br/>                     (DOLLARS IN MILLIONS, UNAUDITED) <br/> <br/>                                           Three Months Ended Dec 31 <br/>                                     ------------------------------------- <br/>                                            2023               2024 <br/>                                      -----------------  ----------------- <br/>Operating activities <br/> Net earnings                         $             132  $             593 <br/> Earnings from discontinued <br/> operations, net of tax                              27                 -- <br/> Adjustments to reconcile net <br/> earnings to net cash provided by <br/> operating activities: <br/>       Depreciation and amortization                422                383 <br/>       Stock compensation                            74                 68 <br/>       Amortization of <br/>       acquisition-related <br/>       inventory step-up                            231                 -- <br/>       Changes in operating working <br/>        capital                                   (238)              (154) <br/>       Other, net                                 (204)              (113) <br/>                                      -----------------  ----------------- <br/>           Cash from continuing <br/>            operations                              444                777 <br/>           Cash from discontinued <br/>           operations                              (29)                 -- <br/>                                      -----------------  ----------------- <br/>           Cash provided by <br/>            operating activities                    415                777 <br/>                                      -----------------  ----------------- <br/> <br/>Investing activities <br/> Capital expenditures                              (77)               (83) <br/> Purchases of businesses, net of <br/>  cash and equivalents acquired                 (8,339)               (37) <br/> Other, net                                        (37)               (22) <br/>                                      -----------------  ----------------- <br/>   Cash from continuing operations              (8,453)              (142) <br/>   Cash from discontinued <br/>   operations                                         1                 -- <br/>                                      -----------------  ----------------- <br/>   Cash used in investing activities            (8,452)              (142) <br/>                                      -----------------  ----------------- <br/> <br/>Financing activities <br/> Net increase in short-term <br/>  borrowings                                      2,647                  2 <br/> Payments of long-term debt                          --                (2) <br/> Dividends paid                                   (300)              (301) <br/> Purchases of common stock                        (175)              (899) <br/> AspenTech purchases of common <br/> stock                                             (72)                 -- <br/> Other, net                                        (45)               (91) <br/>   Cash provided by (used in) <br/>    financing activities                          2,055            (1,291) <br/>                                      -----------------  ----------------- <br/> <br/> Effect of exchange rate changes on <br/>  cash and equivalents                                7               (98) <br/>                                      -----------------  ----------------- <br/>Decrease in cash and equivalents                (5,975)              (754) <br/> Beginning cash and equivalents                   8,051              3,588 <br/>                                      -----------------  ----------------- <br/>Ending cash and equivalents           $           2,076   $          2,834 <br/>                                      =================  ================= <br/> <br/> <br/>                                                                       Table 4 <br/>      ------------------------------------------------------------------------ <br/>                           EMERSON AND SUBSIDIARIES <br/>                          SEGMENT SALES AND EARNINGS <br/>                       (DOLLARS IN MILLIONS, UNAUDITED) <br/> <br/>The following tables show results for the Company's segments on an adjusted <br/>segment EBITA basis and are intended to supplement the Company's results of <br/>operations, including its segment earnings which are defined as earnings <br/>before interest and taxes. The Company defines adjusted segment and total <br/>segment EBITA as segment earnings excluding intangibles amortization expense, <br/>and restructuring and related expense. Adjusted segment and total segment <br/>EBITA, and adjusted segment and total segment EBITA margin are measures used <br/>by management and may be useful for investors to evaluate the Company's <br/>segments' operational performance. <br/> <br/> <br/> <br/>                                   Quarter Ended Dec 31 <br/>                ---------------------------------------------------------- <br/>                      2023               2024         Reported  Underlying <br/>                -----------------  -----------------  --------  ---------- <br/>Sales <br/> Final Control  $             940  $             976       4 %         5 % <br/> Measurement &amp; <br/>  Analytical                  947                975       3 %         4 % <br/> Discrete <br/>  Automation                  613                580     (5) %       (4) % <br/> Safety &amp; <br/>  Productivity                322                312     (3) %       (3) % <br/>                -----------------  -----------------  --------  ---------- <br/>Intelligent <br/> Devices         $          2,822   $          2,843       1 %         2 % <br/> <br/> Control <br/>  Systems &amp; <br/>  Software                    675                690       2 %         3 % <br/> Test &amp; <br/>  Measurement                 382                359     (6) %       (5) % <br/> AspenTech                    257                303      18 %        18 % <br/>                -----------------  -----------------  --------  ---------- <br/>Software and <br/> Control         $          1,314   $          1,352       3 %         4 % <br/> <br/> Eliminations                (19)               (20) <br/>                -----------------  -----------------  --------  ---------- <br/>Total            $          4,117   $          4,175       1 %         2 % <br/> <br/> <br/> <br/>Sales Growth by Geography <br/>                             Quarter Ended <br/>                                 Dec 31 <br/>                             ------------- <br/>Americas                               3 % <br/>Europe                               (2) % <br/>Asia, Middle East &amp; Africa             4 % <br/> <br/> <br/> <br/>                                                                Table 4 cont. <br/>----------------------------------------------------------------------------- <br/> <br/>                      Quarter Ended Dec 31           Quarter Ended Dec 31 <br/>                  -----------------------------  ---------------------------- <br/>                              2023                           2024 <br/>                  -----------------------------  ---------------------------- <br/>                                    Adjusted          As          Adjusted <br/>                   As Reported        EBITA         Reported        EBITA <br/>                      (GAAP)        (Non-GAAP)       (GAAP)       (Non-GAAP) <br/>                  --------------  -------------  -------------  ------------- <br/>Earnings <br/> Final Control     $         194  $         223  $         236  $         260 <br/> Margins                  20.6 %         23.6 %         24.2 %         26.6 % <br/> Measurement &amp; <br/>  Analytical                 235            258            285            296 <br/> Margins                  24.9 %         27.3 %         29.2 %         30.4 % <br/> Discrete <br/>  Automation                  97            116             98            112 <br/> Margins                  15.8 %         18.9 %         16.9 %         19.3 % <br/> Safety &amp; <br/>  Productivity                68             74             67             73 <br/> Margins                  21.1 %         23.1 %         21.6 %         23.8 % <br/>                  --------------  -------------  -------------  ------------- <br/>Intelligent <br/> Devices           $         594  $         671  $         686  $         741 <br/> Margins                  21.0 %         23.8 %         24.1 %         26.1 % <br/> <br/> Control Systems <br/>  &amp; Software                 149            155            193            200 <br/> Margins                  22.1 %         23.1 %         27.9 %         28.8 % <br/> Test &amp; <br/>  Measurement               (78)            101           (13)             91 <br/> Margins                (20.4) %         26.5 %        (3.6) %         25.5 % <br/> AspenTech                  (35)             87             15            137 <br/> Margins                (13.7) %         33.6 %          4.8 %         45.1 % <br/>                  --------------  -------------  -------------  ------------- <br/>Software and <br/> Control          $           36  $         343  $         195  $         428 <br/> Margins                   2.8 %         26.1 %         14.4 %         31.6 % <br/> <br/>Corporate items <br/>and interest <br/>expense, net: <br/>---------------- <br/> Stock <br/>  compensation              (74)           (44)           (68)           (66) <br/> Unallocated <br/>  pension and <br/>  postretirement <br/>  costs                       31             31             27             27 <br/> Corporate and <br/>  other                    (399)           (38)           (57)           (34) <br/> Interest <br/>  expense, net              (44)             --            (8)             -- <br/> Interest income <br/> from related <br/> party(1)                     31             --             --             -- <br/> <br/>Pretax Earnings <br/> / Adjusted <br/> EBITA             $         175  $         963  $         775  $       1,096 <br/> Margins                   4.2 %         23.4 %         18.6 %         26.3 % <br/> <br/>Supplemental <br/>Total Segment <br/>Earnings: <br/>---------------- <br/>Adjusted Total <br/> Segment EBITA                    $       1,014                 $       1,169 <br/> Margins                                 24.6 %                        28.0 % <br/> <br/>(1) Represents interest on the Copeland note receivable. <br/> <br/> <br/> <br/>                                                                                                      Table 4 cont. <br/>------------------------------------------------------------------------------------------------------------------- <br/> <br/>                            Quarter Ended Dec 31                                Quarter Ended Dec 31 <br/>                ---------------------------------------------       --------------------------------------------- <br/>                                    2023                                                2024 <br/>                ---------------------------------------------       --------------------------------------------- <br/>                                           Restructuring                                       Restructuring <br/>                   Amortization of               and                   Amortization of               and <br/>                    Intangibles(1)        Related Costs(2)              Intangibles(1)        Related Costs(2) <br/>                ---------------------  ----------------------       ---------------------  ---------------------- <br/> Final Control  $                  22  $                    7       $                  22  $                    2 <br/> Measurement &amp; <br/>  Analytical                       20                       3                          10                       1 <br/> Discrete <br/>  Automation                        9                      10                           8                       6 <br/> Safety &amp; <br/>  Productivity                      6                      --                           6                      -- <br/>                ---------------------  ----------------------       ---------------------  ---------------------- <br/>Intelligent <br/> Devices        $                  57   $                  20       $                  46  $                    9 <br/> <br/> Control <br/>  Systems &amp; <br/>  Software                          5                       1                           5                       2 <br/> Test &amp; <br/>  Measurement                     139                      40                         105                     (1) <br/> AspenTech                        122                      --                         122                      -- <br/>                ---------------------  ----------------------  ---  ---------------------  ---------------------- <br/>Software and <br/> Control         $                266   $                  41        $                232  $                    1 <br/> <br/> Corporate                         --                      26  (3)                     --                       3 <br/>                ---------------------  ----------------------       ---------------------  ---------------------- <br/>Total            $                323   $                  87        $                278   $                  13 <br/> <br/>(1) Amortization of intangibles includes $49 and $49 reported in cost of sales for the three months ended December <br/>31, 2023 and 2024, respectively. <br/>(2) Restructuring and related costs includes $4 reported in cost of sales for the three months ended December 31, <br/>2023. The three months ended December 31, 2024 includes $2 reported in selling, general and administrative <br/>expenses. <br/>(3) Corporate restructuring of $26 for the three months ended December 31, 2023 is comprised entirely of <br/>integration-related stock compensation expense attributable to NI. <br/> <br/> <br/> <br/>                                         Quarter Ended Dec 31 <br/>                                -------------------------------------- <br/>Depreciation and Amortization          2023                2024 <br/>                                ------------------  ------------------ <br/> Final Control                  $               40  $               40 <br/> Measurement &amp; Analytical                       40                  31 <br/> Discrete Automation                            22                  21 <br/> Safety &amp; Productivity                          14                  15 <br/>                                ------------------  ------------------ <br/>Intelligent Devices                            116                 107 <br/> <br/> Control Systems &amp; Software                     21                  23 <br/> Test &amp; Measurement                            151                 118 <br/> AspenTech                                     123                 124 <br/>                                ------------------  ------------------ <br/>Software and Control                           295                 265 <br/> <br/> Corporate                                      11                  11 <br/>                                ------------------  ------------------ <br/>Total                            $             422   $             383 <br/>                                ==================  ================== <br/> <br/> <br/> <br/>                                                                    Table 5 <br/>--------------------------------------------------------------------------- <br/>                         EMERSON AND SUBSIDIARIES <br/>                 ADJUSTED CORPORATE AND OTHER SUPPLEMENTAL <br/>                      (DOLLARS IN MILLIONS, UNAUDITED) <br/> <br/>The following table shows the Company's stock compensation and corporate <br/>and other expenses on an adjusted basis. The Company's definition of <br/>adjusted stock compensation excludes integration-related stock compensation <br/>expense. The Company's definition of adjusted corporate and other excludes <br/>corporate restructuring and related costs, first year purchase accounting <br/>related items and transaction fees, and certain gains, losses or <br/>impairments. This metric is useful for reconciling from total adjusted <br/>segment EBITA to the Company's consolidated adjusted EBITA. <br/> <br/>                                          Quarter Ended Dec 31 <br/>                             ---------------------------------------------- <br/>                                               2023                    2024 <br/>                             ----------------------  ---------------------- <br/> Stock compensation (GAAP)   $                 (74)  $                 (68) <br/>   Integration-related <br/>    stock compensation <br/>    expense(1)                                   30                       2 <br/>                             ----------------------  ---------------------- <br/> Adjusted stock <br/>  compensation (non-GAAP)    $                 (44)  $                 (66) <br/> <br/>                                          Quarter Ended Dec 31 <br/>                             ---------------------------------------------- <br/>                                               2023                    2024 <br/>                             ----------------------  ---------------------- <br/> Corporate and other (GAAP)   $               (399)  $                 (57) <br/> Corporate restructuring <br/>  and related costs                              --                       3 <br/> Acquisition / divestiture <br/>  costs                                         130                      20 <br/> Amortization of <br/> acquisition-related <br/> inventory step-up                              231                      -- <br/>                             ----------------------  ---------------------- <br/> Adjusted corporate and <br/>  other (non-GAAP)           $                 (38)  $                 (34) <br/> <br/> <br/> <br/>(1) Integration-related stock compensation expense relates to NI and includes <br/>$26 and $-- reported as restructuring costs for the three months ended <br/>December 31,  2023 and 2024, respectively <br/> <br/> <br/>                                                                     Table 6 <br/>---------------------------------------------------------------------------- <br/>                          EMERSON AND SUBSIDIARIES <br/>                      ADJUSTED EBITA &amp; EPS SUPPLEMENTAL <br/>              (AMOUNTS IN MILLIONS EXCEPT PER SHARE, UNAUDITED) <br/> <br/>The following tables, which show results on an adjusted EBITA basis and <br/>diluted earnings per share on an adjusted basis, are intended to supplement <br/>the Company's discussion of its results of operations herein. The Company <br/>defines adjusted EBITA as earnings excluding interest expense, net, income <br/>taxes, intangibles amortization expense, restructuring expense, first year <br/>purchase accounting related items and transaction fees, and certain gains, <br/>losses or impairments. Adjusted earnings per share excludes intangibles <br/>amortization expense, restructuring expense, first year purchase accounting <br/>related items and transaction-related costs, and certain gains, losses or <br/>impairments. Adjusted EBITA, adjusted EBITA margin, and adjusted earnings <br/>per share are measures used by management and may be useful for investors to <br/>evaluate the Company's operational performance. <br/> <br/>                                                 Quarter Ended Dec 31 <br/>                                          ---------------------------------- <br/>                                                2023              2024 <br/>                                          ----------------  ---------------- <br/>Pretax earnings                           $            175  $            775 <br/> Percent of sales                                    4.2 %            18.6 % <br/> Interest expense, net                                  44                 8 <br/> Interest income from related party(1)                (31)                -- <br/> Amortization of intangibles                           323               278 <br/> Restructuring and related costs                        87                13 <br/> Acquisition/divestiture fees and <br/>  related costs                                        134                22 <br/> Amortization of acquisition-related <br/> inventory step-up                                     231                -- <br/>                                          ----------------  ---------------- <br/>Adjusted EBITA                            $            963   $         1,096 <br/> Percent of sales                                   23.4 %            26.3 % <br/> <br/>                                                 Quarter Ended Dec 31 <br/>                                          ---------------------------------- <br/>                                                2023              2024 <br/>                                          ----------------  ---------------- <br/>GAAP earnings from continuing operations <br/> per share                                $           0.29  $           1.02 <br/> Amortization of intangibles                          0.36              0.31 <br/> Restructuring and related costs                      0.12              0.02 <br/> Acquisition/divestiture fees and <br/>  related costs                                       0.17              0.03 <br/> Amortization of acquisition-related <br/> inventory step-up                                    0.38                -- <br/> Discrete taxes                                     (0.10)                -- <br/>                                          ----------------  ---------------- <br/>Adjusted earnings from continuing <br/> operations per share                     $           1.22  $           1.38 <br/>                                          ----------------  ---------------- <br/> <br/>(1) Represents interest on the Copeland note receivable <br/> <br/> <br/> <br/>                                                                                                          Table 6 cont. <br/>----------------------------------------------------------------------------------------------------------------------- <br/>                                            Quarter Ended December 31, 2024 <br/>                                                                                                Net          Diluted <br/>                                                              Earnings         Non-           Earnings       Earnings <br/>                              Pretax             Income      from Cont.     Controlling        Common           Per <br/>                             Earnings             Taxes         Ops.       Interests(3)     Stockholders       Share <br/>                           ------------       ------------  ------------  --------------  ---------------  ------------ <br/>As reported (GAAP)         $        775       $        182  $        593  $            8  $           585  $       1.02 <br/> Amortization of <br/>  intangibles                       278  (1)            62           216              41              175          0.31 <br/> Restructuring and <br/>  related costs                      13  (2)            --            13              --               13          0.02 <br/> Acquisition/divestiture <br/>  fees and related costs             22                  5            17              --               17          0.03 <br/>                           ------------       ------------  ------------  --------------  ---------------  ------------ <br/>Adjusted (non-GAAP)         $     1,088       $        249  $        839   $          49  $           790  $       1.38 <br/> Interest expense, net                8 <br/>                           ------------ <br/>Adjusted EBITA (non-GAAP)   $     1,096 <br/> <br/> <br/> <br/>(1) Amortization of intangibles includes $49 reported in cost of sales. <br/>(2) Restructuring and related costs includes $2 reported in selling, general <br/>and administrative expenses. <br/>(3) Represents the non-controlling interest in AspenTech applied to <br/>AspenTech's share of each adjustment presented herein and eliminated from <br/>Emerson's consolidated results. <br/> <br/> <br/>                                                                                                        Table 7 <br/>--------------------------------------------------------------------------------------------------------------- <br/>                                           EMERSON AND SUBSIDIARIES <br/>                             ASPENTECH CONTRIBUTION TO EMERSON RESULTS SUPPLEMENTAL <br/>                               (AMOUNTS IN MILLIONS EXCEPT PER SHARE, UNAUDITED) <br/> <br/>The following tables reconcile the financial results of AspenTech reported to its shareholders with the amounts <br/>included in Emerson's consolidated financial results. Emerson currently owns approximately 57 percent of the <br/>common shares outstanding of AspenTech, a separately traded public company (NASDAQ: AZPN), and consolidates <br/>AspenTech in its financial results. The 43 percent non-controlling interest in AspenTech is removed from <br/>Emerson's net earnings common stockholders through the non-controlling interest line item. AspenTech is also <br/>one of Emerson's segments and its GAAP segment earnings is reconciled below to its consolidated impact to <br/>clarify that certain items are reported outside of its segment earnings within Emerson corporate, including <br/>interest income and stock compensation. <br/> <br/>                                        Quarter Ended December 31, 2024 <br/>--------------------------------------------------------------------------------------------------------------- <br/>                                                      Earnings                          Net          Diluted <br/>                                        Income           from          Non-           Earnings       Earnings <br/>                   Pretax                Taxes          Cont.       Controlling        Common           Per <br/>                   Earnings            (Benefit)         Ops.       Interests(4)    Stockholders       Share <br/>                -------------       --------------  -------------  -------------  ---------------  ------------ <br/>Standalone <br/> reporting <br/> (GAAP)         $          17  (1)  $          (3)  $          20 <br/> Other                     --                    2            (2) <br/>                -------------       --------------  ------------- <br/>Reported in <br/> Emerson <br/> consolidation <br/> (GAAP)                    17                  (1)             18              8               10  $       0.02 <br/>Adjustments: <br/>-------------- <br/> Amortization <br/>  of <br/>  intangibles             122  (2)              26             96             41               55          0.09 <br/>                -------------       --------------  -------------  -------------  ---------------  ------------ <br/>Adjusted <br/> (Non-GAAP)      $        139        $          25   $        114  $          49  $            65  $       0.11 <br/> Interest <br/>  income                 (17)  (3) <br/> Stock <br/>  compensation             15  (3) <br/>                ------------- <br/>Adjusted <br/> segment EBITA <br/> (non- GAAP)     $        137 <br/> <br/>Reconciliation to Segment EBIT <br/>--------------------------------------------------------------------------------------------------------------- <br/>Pre-tax <br/> earnings       $          17 <br/> Interest <br/>  income                 (17)  (3) <br/> Stock <br/>  compensation             15  (3) <br/>                ------------- <br/>Segment EBIT <br/> (GAAP)         $          15 <br/> Amortization <br/>  of <br/>  intangibles             122  (2) <br/>                ------------- <br/>Adjusted <br/> segment EBITA <br/> (non- GAAP)     $        137 <br/> <br/> <br/> <br/>(1) Amount reflects AspenTech's pretax earnings for the three months ended <br/>December 31, 2024 as reported in its quarterly earnings release 8-K. <br/>(2) Amortization of intangibles includes $49 reported in cost of sales. <br/>(3) Reported in Emerson corporate line items. <br/>(4) Represents the non-controlling interest in AspenTech applied to each <br/>adjustment presented herein and eliminated from Emerson's consolidated <br/>results. <br/> <br/> <br/>Reconciliations of Non-GAAP Financial Measures &amp; Other                 Table 8 <br/>                                                                       ------- <br/> <br/>Reconciliations of Non-GAAP measures with the most directly <br/>comparable GAAP measure (dollars in millions, except per share <br/>amounts). See tables 4 through 7 for additional non-GAAP <br/>reconciliations. <br/> <br/> <br/> <br/>2025 Q1 Underlying                (Favorable) /   (Acquisitions) / <br/>Sales Change           Reported   Unfavorable FX    Divestitures    Underlying <br/>---------------------  --------  ---------------  ----------------  ---------- <br/> Final Control              4 %              1 %              -- %         5 % <br/> Measurement &amp; <br/>  Analytical                3 %              1 %              -- %         4 % <br/> Discrete Automation      (5) %              1 %              -- %       (4) % <br/> Safety &amp; <br/>  Productivity            (3) %             -- %              -- %       (3) % <br/>---------------------  --------  ---------------  ----------------  ---------- <br/>Intelligent Devices         1 %              1 %              -- %         2 % <br/>---------------------  --------  ---------------  ----------------  ---------- <br/> Control Systems &amp; <br/>  Software                  2 %              1 %              -- %         3 % <br/> Test &amp; Measurement       (6) %              1 %              -- %       (5) % <br/> AspenTech                 18 %             -- %              -- %        18 % <br/>---------------------  --------  ---------------  ----------------  ---------- <br/>Software and Control        3 %              1 %              -- %         4 % <br/>---------------------  --------  ---------------  ----------------  ---------- <br/>Emerson                     1 %              1 %              -- %         2 % <br/>---------------------  --------  ---------------  ----------------  ---------- <br/> <br/> <br/> <br/>                                    2025 Q2        2025 <br/>Underlying Growth Guidance          Guidance      Guidance <br/>-------------------------------  -------------  ----------- <br/>Reported (GAAP)                  (0.5%) - 0.5%  1.5% - 3.5% <br/> (Favorable) / Unfavorable FX         1.5 pts     1.5 pts <br/> (Acquisitions) / Divestitures               -            - <br/>-------------------------------  -------------  ----------- <br/>Underlying (non-GAAP)                  1% - 2%      3% - 5% <br/>-------------------------------  -------------  ----------- <br/> <br/> <br/> <br/>                                                                                                                Adjusted <br/>2024 Q1                                           Amortization          Restructuring            Adjusted        Segment <br/>Adjusted                              EBIT              of                and Related             Segment         EBITA <br/>Segment EBITA          EBIT           Margin       Intangibles               Costs                 EBITA         Margin <br/>--------------  -------------------  --------  -------------------  ----------------------  ------------------  -------- <br/> Final Control   $              194    20.6 %  $                22  $                    7  $              223    23.6 % <br/> Measurement &amp; <br/>  Analytical                    235    24.9 %                   20                       3                 258    27.3 % <br/> Discrete <br/>  Automation                     97    15.8 %                    9                      10                 116    18.9 % <br/> Safety &amp; <br/>  Productivity                   68    21.1 %                    6                      --                  74    23.1 % <br/>--------------  -------------------  --------  -------------------  ----------------------  ------------------  -------- <br/>Intelligent <br/> Devices         $              594    21.0 %  $                57    $                 20  $              671    23.8 % <br/>--------------  -------------------  --------  -------------------  ----------------------  ------------------  -------- <br/> Control <br/>  Systems &amp; <br/>  Software                      149    22.1 %                    5                       1                 155    23.1 % <br/> Test &amp; <br/>  Measurement                  (78)  (20.4) %                  139                      40                 101    26.5 % <br/> AspenTech                     (35)  (13.7) %                  122                      --                  87    33.6 % <br/>--------------  -------------------  --------  -------------------  ----------------------  ------------------  -------- <br/>Software and <br/> Control        $                36     2.8 %   $              266    $                 41  $              343    26.1 % <br/>--------------  -------------------  --------  -------------------  ----------------------  ------------------  -------- <br/> <br/> <br/> <br/>                                                                                                              Adjusted <br/>2025 Q1                                         Amortization          Restructuring            Adjusted        Segment <br/>Adjusted                             EBIT             of                and Related             Segment         EBITA <br/>Segment EBITA          EBIT          Margin      Intangibles               Costs                 EBITA         Margin <br/>--------------  ------------------  -------  -------------------  ----------------------  ------------------  -------- <br/> Final Control  $              236   24.2 %  $                22  $                    2  $              260    26.6 % <br/> Measurement &amp; <br/>  Analytical                   285   29.2 %                   10                       1                 296    30.4 % <br/> Discrete <br/>  Automation                    98   16.9 %                    8                       6                 112    19.3 % <br/> Safety &amp; <br/>  Productivity                  67   21.6 %                    6                      --                  73    23.8 % <br/>--------------  ------------------  -------  -------------------  ----------------------  ------------------  -------- <br/>Intelligent <br/> Devices        $              686   24.1 %  $                46  $                    9  $              741    26.1 % <br/>--------------  ------------------  -------  -------------------  ----------------------  ------------------  -------- <br/> Control <br/>  Systems &amp; <br/>  Software                     193   27.9 %                    5                       2                 200    28.8 % <br/> Test &amp; <br/>  Measurement                 (13)  (3.6) %                  105                     (1)                  91    25.5 % <br/> AspenTech                      15    4.8 %                  122                      --                 137    45.1 % <br/>--------------  ------------------  -------  -------------------  ----------------------  ------------------  -------- <br/>Software and <br/> Control        $              195   14.4 %   $              232  $                    1  $              428    31.6 % <br/>--------------  ------------------  -------  -------------------  ----------------------  ------------------  -------- <br/> <br/> <br/> <br/>Total Adjusted Segment EBITA            2024 Q1               2025 Q1 <br/>-------------------------------   --------------------  -------------------- <br/>Pretax earnings (GAAP)            $                175  $                775 <br/> Margin                                          4.2 %                18.6 % <br/>--------------------------------  --------------------  -------------------- <br/> Corporate items and interest <br/>  expense, net                                     455                   106 <br/> Amortization of intangibles                       323                   278 <br/> Restructuring and related costs                    61                    10 <br/>--------------------------------  --------------------  -------------------- <br/>Adjusted segment EBITA <br/> (non-GAAP)                        $             1,014   $             1,169 <br/> Margin                                         24.6 %                28.0 % <br/>--------------------------------  --------------------  -------------------- <br/> <br/> <br/> <br/>                                                               2025E ($ in <br/>Free Cash Flow         2024 Q1               2025 Q1            billions) <br/>--------------   --------------------  --------------------  --------------- <br/>Operating cash <br/> flow (GAAP)     $                444  $                777      $3.6 - $3.7 <br/> Capital <br/>  expenditures                   (77)                  (83)           (0.4) <br/>---------------  --------------------  --------------------  --------------- <br/>Free cash flow <br/> (non-GAAP)      $                367  $                694      $3.2 - $3.3 <br/>---------------  --------------------  --------------------  --------------- <br/> <br/> <br/> <br/>Note 1: Underlying sales and orders exclude the impact of currency translation <br/>and significant acquisitions and divestitures. <br/>Note 2: All fiscal year 2025E figures are approximate, except where range is <br/>given. <br/> </pre><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/emerson-reports-first-quarter-2025-results-updates-2025-outlook-302368226.html</p><p class=\"\">SOURCE Emerson</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004460:0/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0a902e956a197:0",
            "title": "Capri Holdings Limited Announces Third Quarter Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Capri Holdings Limited, a global fashion luxury group, has released its financial results for the third quarter of Fiscal 2025, which ended on December 28, 2024. The company, known for its iconic brands Versace, Jimmy Choo, and Michael Kors, reported a challenging quarter with significant declines in revenue and profitability.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the third quarter of Fiscal 2025, Capri Holdings reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue decreased by 11.6% on a reported basis and 11.4% in constant currency, totaling $1.26 billion.</li><li class=\"listItem-bmN0_SHH\">Adjusted operating margin stood at 6.0%.</li><li class=\"listItem-bmN0_SHH\">Adjusted earnings per share (EPS) were $0.45.</li><li class=\"listItem-bmN0_SHH\">Net loss was $547 million, or $(4.61) per share, driven by a non-cash impairment charge of $602 million.</li><li class=\"listItem-bmN0_SHH\">Gross profit was $812 million with a gross margin of 64.4%.</li><li class=\"listItem-bmN0_SHH\">Cash flow from operating activities was an inflow of $309 million, while free cash flow was an inflow of $278 million.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Capri Holdings' performance across its brands showed varied results:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Versace:</strong> Revenue decreased by 15.0% to $193 million, with operating loss widening to $21 million.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Jimmy Choo:</strong> Revenue fell by 4.2% to $159 million, with an operating loss of $6 million.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Michael Kors:</strong> Revenue declined by 12.1% to $909 million, with operating income of $147 million.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Capri Holdings has undertaken several strategic initiatives to manage its financial position and future growth:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Entered into an amended and restated senior secured credit agreement, replacing the existing $1.5 billion revolving credit facility and adding a new term loan of $700 million.</li><li class=\"listItem-bmN0_SHH\">Repayment of the $450 million delayed draw term loan and the €450 million Versace term loan.</li><li class=\"listItem-bmN0_SHH\">Reduction in net debt to $1.12 billion from $1.60 billion last year.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">John D. Idol, Chairman and CEO of Capri Holdings, commented on the results, stating, \"Overall our business remained challenged during the quarter and we were disappointed with our results. We are reevaluating our strategic initiatives to improve current sales trends. Looking ahead, we expect our performance to improve throughout fiscal year 2026 positioning us to return to growth in fiscal 2027 and beyond.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Capri Holdings provided guidance for the remainder of Fiscal 2025 and Fiscal 2026:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">For Fiscal 2025, the company expects total revenue of approximately $4.4 billion and adjusted operating income of approximately $100 million.</li><li class=\"listItem-bmN0_SHH\">For Fiscal 2026, the company anticipates total revenue of approximately $4.1 billion and adjusted operating income of approximately $150 million.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1530721/000153072125000012/cpri-20250205.htm\" rel=\"nofollow\" target=\"_blank\">Capri Holdings Ltd [ CPRI ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:0a902e956a197:0-capri-holdings-limited-announces-third-quarter-fiscal-2025-results/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLX9176A9:0",
            "title": "BRIEF-Emerson Electric Q1 Adjusted EPS USD 1.38 Vs. IBES Estimate USD 1.28",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - Emerson Electric Q1 free cash flow USD 694 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q1 EPS USD 1.02</li><li class=\"listItem-bmN0_SHH\">Q1 pretax profit USD 775 million</li><li class=\"listItem-bmN0_SHH\">Q1 sales USD 4,175 million vs. IBES estimate USD 4,231 million</li><li class=\"listItem-bmN0_SHH\">Q1 operating cash flow USD 777 million</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLX9176A9:0-brief-emerson-electric-q1-adjusted-eps-usd-1-38-vs-ibes-estimate-usd-1-28/",
            "pub_date": "2025-02-05 19:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309692:0",
            "title": "Earnings Flash (HOG) Harley-Davidson Posts Q4 Net Loss $-0.93 a Share, vs. FactSet Est of $-0.66",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309692:0/",
            "pub_date": "2025-02-05 19:55:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_PLXEAB3B0:0",
            "title": "BRIEF-Uber Q4 Revenue USD 11,959 Million Vs. IBES Estimate USD 11,766 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 05 (Reuters) - Uber Q4 free cash flow USD 1,706 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q4 net income USD 6,883 million</li><li class=\"listItem-bmN0_SHH\">Q4 gross bookings USD 44,197 million</li><li class=\"listItem-bmN0_SHH\">Q4 adjusted EBITDA USD 1,842 million vs. IBES estimate USD 1,849 million</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_PLXEAB3B0:0-brief-uber-q4-revenue-usd-11-959-million-vs-ibes-estimate-usd-11-766-million/",
            "pub_date": "2025-02-05 19:55:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW17E:0",
            "title": "Capri forecasts annual revenue below estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Capri Holdings  forecast annual revenue below estimates on Wednesday, as the Michael Kors owner grappled with slowing demand for luxury goods and persistent declines in the Americas and Asia.</p><p class=\"\">The company expects annual net revenue of $4.4 billion, compared with analysts' estimates of $4.5 billion, according to data compiled by LSEG.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW17E:0-capri-forecasts-annual-revenue-below-estimates/",
            "pub_date": "2025-02-05 19:49:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464007:0",
            "title": "Nyab Bags SEK154 Million Road Network Operation, Maintenance Contract in Sweden",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nyab (, NYAB.HE) signed a deal initially valued at 154 million kronor with the Swedish Transport Administration to operate and maintain state public roads in Boden, Norrbotten County in Sweden. </p><p class=\"\">The four-year contract, with an extension option for an additional two years, covers both summer and winter maintenance of the 832-kilometer road network, the construction company said Wednesday. </p><p class=\"\">The project is scheduled to begin on Sept. 1.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464007:0/",
            "pub_date": "2025-02-05 19:49:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004304_20250205004304:0",
            "title": "Harley-Davidson 4Q North America Harley-Davidson Retail Motorcycle Sales Down 13% >HOG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004304_20250205004304:0/",
            "pub_date": "2025-02-05 19:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205004297_20250205004297:0",
            "title": "Harley-Davidson 4Q Motorcycles Sold 25,700 >HOG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205004297_20250205004297:0/",
            "pub_date": "2025-02-05 19:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}