{
    "data": [
        {
            "id": "DJN_DN20250204000266_20250204000266:0",
            "title": "Dassault Systemes Issues 2025 View",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000266_20250204000266:0/",
            "pub_date": "2025-02-04 13:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV07E:0",
            "title": "Software firm Dassault Systemes unveils 2025 outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">French software company Dassault Systemes  on Tuesday forecast total revenue growth of between 6% and 8% for 2025, above the 5% rise seen last year, citing their competitive positioning.</p><p class=\"\">The group, which sells its software to automakers, plane makers and industrial companies, also expects diluted earnings per share of between 1.36 euros and 1.39 euros ($1.43) euros. </p><p class=\"\">($1 = 0.9718 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV07E:0-software-firm-dassault-systemes-unveils-2025-outlook/",
            "pub_date": "2025-02-04 14:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE2wCYxk:0",
            "title": "Lugman Group withdraws from purchase of “Industrial Park Fechenheim”",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AD HOC ANNOUNCEMENT PURSUANT TO ART. 53 LR</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">MUTTENZ, 4 FEBRUARY 2025</strong></p><p class=\"\">Clariant, a sustainability-focused specialty chemical company, today announced that due to the execution of certain pre-emption rights by the City of Frankfurt, the Lugman Group has executed its right of withdrawal from the transaction to purchase the real estate property “Industrial Park Fechenheim” as announced on 17 September 2024. </p><p class=\"\">As previously communicated, the transaction was expected to result in proceeds of EUR 95 million in cash and a book gain of around CHF 70 million in the company’s EBITDA in 2025. </p><p class=\"\">Clariant remains committed to divest the “Industrial Park Fechenheim” as the company has no operational activities in the industrial park. The park is located east of Frankfurt am Main and covers approximately 428 000 square meters. </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>  CORPORATE MEDIA RELATIONS         Jochen DubielPhone +41 61 469 63 63 jochen.dubiel@clariant.com                  Ellese CaruanaPhone +41 61 469 63 63 ellese.caruana@clariant.com                  Luca LavinaPhone +41 61 469 63 63 luca.lavina@clariant.com                       Follow us on X, Facebook, LinkedIn, Instagram.  </td><td>  INVESTOR RELATIONS         Andreas SchwarzwälderPhone +41 61 469 63 73 andreas.schwarzwaelder@clariant.com                  Thijs BouwensPhone +41 61 469 63 73 thijs.bouwens@clariant.com                                         </td></tr><tr><td colspan=\"2\">       This media release contains certain statements that are neither reported financial results nor other historical information. This document also includes forward-looking statements. Because these forward-looking statements are subject to risks and uncertainties, actual future results may differ materially from those expressed in or implied by the statements. Many of these risks and uncertainties relate to factors that are beyond Clariant’s ability to control or estimate precisely, such as future market conditions, currency fluctuations, the behavior of other market participants, the actions of governmental regulators and other risk factors such as: the timing and strength of new product offerings; pricing strategies of competitors; the company’s ability to continue to receive adequate products from its vendors on acceptable terms, or at all, and to continue to obtain sufficient financing to meet its liquidity needs; and changes in the political, social and regulatory framework in which the Company operates or in economic or technological trends or conditions, including currency fluctuations, inflation and consumer confidence, on a global, regional or national basis. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this document. Clariant does not undertake any obligation to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date of these materials.          www.clariant.com         Clariant is a focused specialty chemical company led by the overarching purpose of ‘Greater chemistry – between people and planet’. By connecting customer focus, innovation, and people the company creates solutions to foster sustainability in different industries. On 31 December 2023, Clariant totaled a staff number of 10 481 and recorded sales of CHF 4.377 billion in the fiscal year for its continuing businesses. As of January 2023, the Group conducts its business through the three Business Units Care Chemicals, Catalysts, and Adsorbents &amp; Additives. Clariant is based in Switzerland.  </td></tr></tbody></table></div><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Clariant Media Release_Clariant divestment Fechenheim withdrawal_20250204_EN      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE2wCYxk:0-lugman-group-withdraws-from-purchase-of-industrial-park-fechenheim/",
            "pub_date": "2025-02-04 14:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L5N3OO0HU:0",
            "title": "Investors seek answers on Novo Nordisk's next-gen obesity drug CagriSema",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Novo Nordisk losing ground to Eli Lilly in obesity drug race</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">CagriSema trial data wiped $125 billion off Novo shares</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Investors frustrated at silence from company after data release</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Novo may disclose more info from trial at Q4 results on Feb. 5</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">CagriSema trial participants say drug effective, side-effects difficult</li></ul></span></div><span><p class=\"\">    Novo Nordisk  is under pressure from investors for more information about its next-generation obesity drug candidate CagriSema amid a lack of clarity over trial results that hammered its shares in December.</p><p class=\"\">Novo believes CagriSema could be more powerful than its blockbuster weight-loss injection Wegovy, but investors are worried whether it will be good enough to retake the lead from rival Eli Lilly  in the competitive obesity drug market. </p><p class=\"\">In interviews with Reuters, five patients who participated in the trial that reported in December - or are part of a separate late-stage study - said the weekly injection helped them shed pounds quickly, but that they encountered what they characterised as significant side-effects including nausea, constipation and fatigue.</p><p class=\"\">In its December read-out, Novo said the most common adverse events in the trial were gastrointestinal and the vast majority were mild to moderate and diminished over time, consistent with CagriSema's broader class of GLP-1 receptor agonist drugs.</p><p class=\"\">Novo declined to comment for this story as it is in the regulatory quiet period ahead of quarterly results on Wednesday.</p><p class=\"\">While anecdotal, the interviews with the five patients shed some light on the experiences of those taking CagriSema and could hint at answers to questions sparked by the data about potential side-effects and the dosing regimen.</p><p class=\"\">Weaker than expected data from the trial was a blow to Novo's ambitions to find a more powerful competitor to Lilly's Zepbound, also known as Mounjaro.</p><p class=\"\">CagriSema combines semaglutide, the active ingredient in Wegovy that mimics gut hormone GLP-1, with a separate molecule called cagrilintide that mimics pancreatic hormone amylin.    </p><p class=\"\">One participant in the trial that reported in December said she repeatedly fainted during her first six months on CagriSema. Over the 68-week trial, she lost 29% of her body weight.</p><p class=\"\">\"I guess it's quite normal to feel awful when you lose 30 to 40 kilograms in the span of six months,\" said Jane, who asked to be identified by her middle name to protect her anonymity.</p><p class=\"\">After reaching the highest dose, she stopped losing weight as rapidly. \"I got used to it (the medicine). I felt better,\" she said.</p><p class=\"\">In December, Novo said people who adhered to the CagriSema treatment plan achieved overall weight loss of 22.7% after 68 weeks, with 40.4% losing 25% or more. </p><p class=\"\">That was lower than the 25% across-the-board weight loss it expected. The disappointment wiped as much as $125 billion off Novo's value on the day.</p><p class=\"\">Novo also said only 57.3% of patients reached the highest dose of the medicine, but didn't explain why. Was it because patients suffered side-effects or because they lost weight on lower doses? Both could explain why they didn't progress to the highest dose.</p><p class=\"\">Some investors and analysts were also surprised the trial used a \"flexible\" protocol, permitting patients to change their dose strength instead of adhering to a schedule. </p><p class=\"\">They said this could be a factor in the low take-up of the highest dose. Novo has said it will start a new trial by June. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:920.5128205128204px;aspect-ratio:1.534188034188034\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L5N3OO0HU-1f1487ed8d976957e9df96389705e409-resized.webp\" type=\"images/webp\"/><img alt=\"Investors worry that Novo has lost its first-mover advantage in the obesity drug race\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L5N3OO0HU-1f1487ed8d976957e9df96389705e409-resized.jpeg\" style=\"background-color:#393a39\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Eli Lilly is outperforming Novo Nordisk</span></figcaption></figure></span></p><p class=\"\">IN THE DARK</p><p class=\"\">In interviews with Reuters, more than a dozen investors and analysts called for more clarity about factors they say are weighing on Novo's shares. They hope to get more information at Wednesday's quarterly results.</p><p class=\"\">But Novo may be limited in what it can say as it prepares to release full data and trial protocol at a scientific conference later this year, expected to be the American Diabetes Association meeting in June. </p><p class=\"\">Lukas Leu, fund manager at healthcare-focused Bellevue Asset Management in Switzerland, which holds Novo shares, said he was disappointed Novo did not disclose the flexible dosing earlier or explain its reasons for doing so. </p><p class=\"\">Novo's prior major semaglutide trials permitted participants to stay on lower doses if they experienced \"unacceptable side-effects\". </p><p class=\"\">In the STEP trial, which studied semaglutide for weight loss, 89.6% of patients completing the trial were receiving the highest dose.</p><p class=\"\">\"With CagriSema, people are assuming the worst – on efficacy the drug is not better than Lilly's tirzepatide, on tolerability that it is worse, and that it is harder to manufacture,\" said Barclays analyst Emily Field, referring to the active ingredient in Lilly's Zepbound/Mounjaro.</p><p class=\"\">\"We don't necessarily agree with all those viewpoints, but given lack of additional commentary from the company, I understand why people are taking such a negative approach.\"</p><p class=\"\">'LIFE CHANGING'</p><p class=\"\">Reuters interviewed two people who participated in the CagriSema trial that reported in December, called REDEFINE-1, and three in an ongoing Phase III trial, called REDEFINE-4, which is testing CagriSema against Zepbound/Mounjaro. </p><p class=\"\">REDEFINE-1 patients did not know until after the trial ended which drug they received. REDEFINE-4 patients know which drug they are getting.</p><p class=\"\">Michelle Rivera, who lives in Dallas, Texas, said she struggled to eat after she began taking CagriSema in the REDEFINE-4 trial.</p><p class=\"\">\"Literally nothing was appetising,\" said Rivera, who has lost about 22% of her weight. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:787.4306839186692px;aspect-ratio:1.3123844731977818\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L5N3OO0HU-1e892529c22c7597161cc79df3aca2f4-resized.webp\" type=\"images/webp\"/><img alt=\"The chart shows U.S. prescriptions for Novo Nordisk's Wegovy and Eli Lilly's Zepbound over a six month period (august 2024 to January 2025).\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L5N3OO0HU-1e892529c22c7597161cc79df3aca2f4-resized.jpeg\" style=\"background-color:#f8f9f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Zepbound overtakes Wegovy in U.S. prescriptions</span></figcaption></figure></span></p><p class=\"\">Rivera has taken CagriSema for a year and has six months left on the trial. Her appetite slowly returned after about six months on the drug. But she still eats much smaller portions, prioritising protein, water and fibre to fight constipation.</p><p class=\"\">Her trial investigators were receptive to participants not increasing their dose if side-effects bothered them, she said. She kept to the recommended schedule and reached the maximum dose after about six months.</p><p class=\"\">Another participant in the ongoing trial, Leigh, who asked to be identified by her middle name, said nausea, fatigue and brain fog she experiences in the 24 hours after her weekly CagriSema injection are so bad that she sometimes can't leave bed.</p><p class=\"\">She has, however, kept to the recommended dosing protocol in the hope of losing more weight. After a year on CagriSema, she has lost about 18% of her weight. The medicine is \"life changing\", she said. </p><p class=\"\">But when she finishes the trial this summer, she wants to explore whether a maintenance dose of a GLP-1 medicine would help her sustain weight loss without such intense side-effects.</p><p class=\"\">\"What I'm dealing with now, it's not sustainable,\" she said.            </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L5N3OO0HU:0-investors-seek-answers-on-novo-nordisk-s-next-gen-obesity-drug-cagrisema/",
            "pub_date": "2025-02-04 14:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OU1ES:0",
            "title": "France in focus as Europe's electricity import needs swell: Maguire",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Growing tension across Europe's electricity markets has sharpened focus on the region's most dependable and integrated exporter of clean power: France. </p><p class=\"\">France is the largest supplier of clean electricity to Europe's top electricity importers, and has played a critical role in helping to cap regional electricity costs in recent years by exporting record volumes of clean power.</p><p class=\"\">France's status as a key electricity supplier may now become even more important after the government of Norway - another major electricity exporter - lost a key coalition partner last week in a dispute over European Union (EU) energy policies. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:524.6785058175137px;max-width:1200px;aspect-ratio:2.287114845938375\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-7bfcf1c30467909ae97261091a7a8ded-resized.webp\" type=\"images/webp\"/><img alt=\"Both France &amp; Norway lifted electricity exports to record highs in 2024\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-7bfcf1c30467909ae97261091a7a8ded-resized.jpeg\" style=\"background-color:#456329\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Both France &amp; Norway lifted electricity exports to record highs in 2024</span></figcaption></figure></span></p><p class=\"\">Norway's eurosceptic Centre Party, which held eight of Norway's 20 cabinet positions, quit the government over disagreements on the adoption of EU energy directives tied to greater output and use of renewable power.</p><p class=\"\">The coalition breakdown leaves Norway's Labour Party to rule alone until planned elections in September, and raises questions about whether Norway will remain a major clean power exporter. </p><p class=\"\">Labour trails in polls to more conservative parties that are against adopting strict energy export targets.</p><p class=\"\">That potential decline in Norway's power exports means that  Europe's largest electricity importers - which include Germany, Italy and the United Kingdom - look set to become even more reliant on France for supplies. </p><p class=\"\">GROWING DEPENDENCE</p><p class=\"\">Electricity import needs across Europe have surged since 2022, when Russia's full-scale invasion of Ukraine snarled natural gas flows across the region and forced power firms to increase imports to replace lost local power output.</p><p class=\"\">Scores of households and offices across Europe have switched from gas boilers to electric heating systems, while the regional transportation fleet and industry are becoming increasingly electrified.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:387.38642437199354px;max-width:1200px;aspect-ratio:3.0976821192052983\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-7c7ee8fbad0971165261e2119984c04d-resized.webp\" type=\"images/webp\"/><img alt=\"Italy, Germany &amp; the United Kingdom are among the largest electricity importers in Europe\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-7c7ee8fbad0971165261e2119984c04d-resized.jpeg\" style=\"background-color:#405525\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Italy, Germany &amp; the United Kingdom are among the largest electricity importers in Europe</span></figcaption></figure></span></p><p class=\"\">Within mainland Europe, Germany has become particularly dependent on electricity imports, and in 2024 imported nearly six times more electricity than it averaged annually from 2015 to 2021, according to data portal energy-charts.info.</p><p class=\"\">Italy, which has been Europe's top power importer for years, increased electricity imports by around 20% from the 2015-2021 average to new highs in 2024. </p><p class=\"\">The United Kingdom also posted record electricity imports in 2024, which were roughly 100% above the 2015 to 2021 average.</p><p class=\"\">COMMON DENOMINATOR</p><p class=\"\">In 2024, France was the single largest electricity supplier to the United Kingdom and Germany, and the second-largest supplier to Italy after Switzerland. </p><p class=\"\">Norway was the second largest electricity supplier to the UK last year, and the fourth largest supplier to Germany.</p><p class=\"\">If Norway's power flows start to decline going forward, major importers will be forced to rely more on France and other suppliers. </p><p class=\"\">FRANCE AT FULL FLOW</p><p class=\"\">The key risk for Europe's top electricity importers is the potential downturn in output in France and in other large electricity exporters including Switzerland and Denmark.</p><p class=\"\">France started 2025 with the largest monthly power output total in more than three years, at 75,577 gigawatt hours (GWh), according to LSEG.</p><p class=\"\">That total was roughly 5% above January 2024, and 37% above the average monthly output from 2022 to 2024.</p><p class=\"\">The key driver behind this output surge has been France's nuclear network, which bumped production by 8% from January 2024  to the highest since at least the start of 2022.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1074.4849445324883px;aspect-ratio:1.7908082408874804\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-1bf29e6e3575096d1e8e240d5cb5a7c1-resized.webp\" type=\"images/webp\"/><img alt=\"France's power output hit multi-year highs in early 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OU1ES-1bf29e6e3575096d1e8e240d5cb5a7c1-resized.jpeg\" style=\"background-color:#635126\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">France's power output hit multi-year highs in early 2025</span></figcaption></figure></span></p><p class=\"\">The completion of key plant maintenance and the start-up of a new reactor have been key factors behind the nuclear output gains, and should allow France's nuclear power stations to sustain relatively high production rates going forward. </p><p class=\"\">However, ongoing issues with corrosion at older plants mean that drops in overall production cannot be ruled out later in 2025, especially if the availability of cooling water from rivers is impeded by warm weather in the summer. </p><p class=\"\">Europe's total electricity supplies could also be affected by any downturn in hydro power output in Switzerland and Austria.</p><p class=\"\">Regional hydro output scaled record levels in 2024 following  floods during the summer, and allowed for Switzerland and Austria to boost electricity exports from the year before.</p><p class=\"\">However, snow coverage across Europe's main alpine regions remains below the long-term average so far in 2025, and may limit hydro production later in the year.</p><p class=\"\">An extension to the current spell of below-normal wind speeds is another threat to regional electricity supplies. </p><p class=\"\">Germany, Europe's top wind power producer, is in the midst of a multi-month stretch of low wind speeds, while wind output in Denmark - one of Europe's top power exporters - dropped by 20% in January 2025 from January 2024 levels, LSEG data shows. </p><p class=\"\">Any further below-par wind output in northern Europe may not only reduce exportable supplies from Denmark but also increase the import needs of Germany, and place even greater pressure on France to sustain its high levels of electricity exports.    </p><p class=\"\">The opinions expressed here are those of the author, a market analyst for Reuters.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OU1ES:0-france-in-focus-as-europe-s-electricity-import-needs-swell-maguire/",
            "pub_date": "2025-02-04 14:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU1XR:0",
            "title": "Amundi posts in-line Q4 inflows on risk-averse products",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Amundi's Q4 net inflows of 20.5 billion euros</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">ETFs and ETCs bring 10.5 billion euros in Q4 net inflows</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Amundi open to acquisitions amid consolidation, CEO says</li></ul></span></div><span><p class=\"\">    Amundi , Europe's biggest fund manager, posted in-line quarterly inflows on Tuesday, as demand for risk-averse products remained strong over the last three months of the year.</p><p class=\"\">Net inflows in the fourth quarter were 20.5 billion euros, bringing total assets under management (AUM) to a record 2.24 trillion euros ($2.30 trillion) at the end of December, up 10% from a year earlier.</p><p class=\"\">Demand for safe investments such as medium and long-term assets through exchange-traded funds and exchange-traded commodities brought 10.5 billion euros of net inflows, bringing total ETF AUM to 268 billion euros at the end of December, up 30% from a year earlier.</p><p class=\"\">In a call with reporters, Amundi Chief Executive Valerie Baudson signaled the group was still open to acquisitions, as the industry reignited a race to size after BNP Paribas, France's biggest bank, announced a 5.1 billion-euro acquisition of AXA's asset management arm.</p><p class=\"\">\"We are still a potential market consolidator,\" she said. </p><p class=\"\">Amundi was among the rival bidders for AXA IM, people with knowledge of the matter have told Reuters. French bank BPCE and Italian insurer Generali announced the tie-up of their respective asset management activities two weeks ago.</p><p class=\"\">Amundi's fourth-quarter adjusted net income was 377 million euros, up 20.5% and beating the 348-million euro analyst average estimate.</p><p class=\"\">Adjusted net revenues over the period were up by close to 15% from a year earlier to 924 million euros. Amundi said it will propose a dividend of 4.25 euros per share at its shareholder meeting in May.</p><p class=\"\">\"The very beginning of 2025 confirms a very good sales dynamic, and we're confident about 2025 given all the partnerships and discussions we have with our customers,\" Baudson told reporters.</p><p class=\"\">The group said it had achieved its main targets under its 2025 strategic plan a year in advance, including its goals around cost income and average annual net income growth.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU1XR:0-amundi-posts-in-line-q4-inflows-on-risk-averse-products/",
            "pub_date": "2025-02-04 14:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFNbjKKPh:0",
            "title": "LIFE: Improved chemistry successfully tested in sensor",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bergen, Norway, 4 February 2025: Today, Lifecare ASA (LIFE), a clinical stage medical sensor company developing the next generation Continuous Glucose Monitor (CGM), can announce that chemistry with improved sensitivity has been successfully tested in Lifecare’s CGM-sensor.</p><p class=\"\">Reference is made to Lifecare’s stock exchange announcement 14 January 2025, regarding up to fivefold improvement in sensor chemistry sensitivity, with a new generation of Lifecare’s proprietary chemistry.</p><p class=\"\">Lifecare’s laboratory in Mainz, Germany, has now completed the first tests of the improved chemistry in implants similar to those used in the company's long-term studies. These implants have been subjected to laboratory testing. Similar to the initial and very promising tests of the chemistry in macro-test cells, the first analyses show promising responses after testing the chemistry in miniaturized sensors. This contributes to our expectation that the chemistry can lead to significantly improved sensor sensitivity. The actual function of the implants in-vitro will be subject to ongoing testing, after which the implants with improved sensor chemistry later will be subjected to long-term studies in-vivo.</p><p class=\"\">The sensor sensitivity defines the potential to detect small changes of glucose levels and is an important performance parameter for CGM. The accuracy of CGM’s is commonly referred to based on Mean Absolute Relative Difference (MARD), where a MARD lower than 10% indicates clinically acceptable accuracy. In Q2 2023, data from Lifecare's Clinical Development Study LFC-SEN-001 confirmed that our CGM system had achieved a MARD of 9,7%. The improved chemistry sensitivity can impact the MARD, however this is subject to further testing.</p><p class=\"\">In a product perspective the most prominent benefit of enhanced sensor sensitivity is improvement of the sensor signal-to-noise ratio. This leads to improved data readings and enhanced sensor performance, as well as simplifying algorithms and data processing efficiency.</p><p class=\"\">- Any validation of the improved chemistry sensitivity represents a confirmatory advance for our sensor technology. However, it is particularly promising that the improved chemistry sensitivity now has been subject to initial validation in a near-real-world test scenario. Lifecare's team of researchers and developers continuously strives for improved precision and quality in glucose monitoring to ensure better outcomes for patients with diabetes, says Joacim Holter, Lifecare CEO.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFNbjKKPh:0-life-improved-chemistry-successfully-tested-in-sensor/",
            "pub_date": "2025-02-04 14:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463211:0",
            "title": "Sumitomo Chemical's Nine-Month Profit Plunges 29%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sumitomo Chemical  recorded a 29% decline in attributable profit for the nine months ended Dec. 31, 2024, to 12.9 billion yen from 18 billion yen in the year-ago period, a Monday Tokyo bourse filing said. </p><p class=\"\">Basic earnings per share stood at 138.02 yen for the three quarters, down from 192.78 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The chemical company's revenue rose by 7.3% to 231.1 billion yen in the nine months from 215.5 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 17.5 billion yen, a basic EPS of 178.89 yen per share, a revenue of 309 billion yen, and a total dividend of 90 yen per share for the fiscal year ending March 31. </p><p class=\"\">Shares of the company were up over 5% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463211:0/",
            "pub_date": "2025-02-04 14:00:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrhPTZB:0",
            "title": "Year-end report January-December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Billerud AB<p class=\"\">Robust fourth quarter concluded a year of improved results and launch of new strategy</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key highlights</strong></p><p class=\"\">•    Net sales growth of 20%, supported by both regions</p><p class=\"\">•    Continued excellent profit delivery in North America</p><p class=\"\">•    Improved profitability in Europe</p><p class=\"\">•    Cash conversion of 95% and further strengthened financial position</p><p class=\"\">•    The Board of Directors proposes a dividend of SEK 3.50 per share (2.00)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Quarterly data</strong></p><p class=\"\">•    Net sales increased by 20% to SEK 11,468 million (9,566)</p><p class=\"\">•    Adjusted EBITDA* SEK 1,443 million (774)</p><p class=\"\">•    Adjusted EBITDA margin 13% (8)</p><p class=\"\">•    Operating profit SEK 1,091 million (-191) including items affecting comparability of SEK 373 million (-244)</p><p class=\"\">•    Net profit SEK 806 million (-330)</p><p class=\"\">•    Earnings per share SEK 3.24 (-1.33)</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook for Q1</strong></p><p class=\"\">•    Solid market conditions for Region North America</p><p class=\"\">•    Normal conditions for Region Europe except for cartonboard and coated liner that will remain weak</p><p class=\"\">•    Pricing continues to offset input cost increase</p><p class=\"\">•    Temporarily lower sales volumes in Region Europe</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Comments by the CEO</strong></p><p class=\"\">We delivered robust financial performance in the fourth quarter and ended 2024 on a good note. During the fourth quarter, we recorded outstanding net sales growth of +20% driven by better-than-expected volume growth, enabling a solid adjusted EBITDA margin of 13%, up 5% pts vs year ago. Once again, our North American region recorded impressive results with 17% net sales growth and 19% EBITDA margin. I am also satisfied with our result in Region Europe which, despite softer market conditions, managed to grow the topline by 16% and achieve an EBITDA margin of 12%.</p><p class=\"\">2024 was characterized by challenging and rapidly changing market conditions. It was nevertheless a year with significantly improved financial performance versus 2023. Our proactive actions, discipline and flexible approach with strong focus on items we can control have served us well. Our net sales grew by 5% through volume growth, mix and price management. We successfully limited the fixed cost increase below inflation and delivered another sizable contribution to the efficiency enhancement program. This means that we reached the program target of SEK 1.5 billion well ahead of schedule. The cash conversion in the fourth quarter of 95% was strong. Our healthy operating cash flow and strong balance sheet will support necessary mill maintenance, selective value-creating strategic investments as well as dividends to our shareholders. The Board of Directors proposes a dividend of SEK 3.50, which is an increase of 75% versus last year and in line with our dividend policy.</p><p class=\"\">At the Capital Markets Day in December, we shared the new strategic framework for Billerud. Going forward, we will be more predictable in terms of our strategic choices. Our new vision, “We make high performance packaging materials for a low carbon society”, sets the strategic direction. The safety of our people remains the number one priority. Our current safety performance is unsatisfactory, and we need to improve. To successfully deliver on our strategy, we will amplify the focus on value creation, prioritize profitability over growth and promote a stronger performance culture. Our new long-term financial targets emphasize the importance of capital efficiency, profitability and cash generation.</p><p class=\"\">We continue to be impressed with our North American operations that consistently deliver outstanding results. We are well positioned with local production in the attractive Midwest region and remain committed to specialty and graphic paper. However, as the latter is in secular decline, we need to improve our capacity utilization. Hence, we will evolve towards packaging materials, benefitting on market opportunities, our attractive location and cost-competitive asset base. We will invest a total of SEK 1.4 billion, whereof most in Escanaba and during 2025, to enable this transition towards paperboard production. Our sales and marketing efforts have already started, with numerous promising customer trials ongoing for our US produced containerboard Tribute® and cartonboard Voyager®.</p><p class=\"\">In the European operations, the focus will be to strengthen performance through the existing asset base. We have clarified the roles for each product category to match market opportunities, our commercial / manufacturing capabilities and flexible production footprint. Securing cost competitive wood supply and improving mill efficiency will be instrumental enablers to succeed. Going forward, the investments beyond normal maintenance will be limited.</p><p class=\"\">Sustainability is embedded in everything we do, contributing towards a low-carbon future. We are committed to Science Based Targets and have a clear transition plan for CO2e emission reductions until 2030. In Europe, we are already an industry leader in terms of carbon footprint derived from production, so for the next five years the greatest positive climate impact will be in the North American region.</p><p class=\"\">As we enter 2025, geopolitical and macroeconomic uncertainty remains high. In Region Europe, we seem to have passed the bottom of the curve and are starting to see early signs of improved market sentiment in many of our product categories. Market conditions in North America remain solid and in line with a well performing US economy. With the import tariffs that the new presidential administration in the US has introduced, Billerud is well positioned and will likely increase its local capacity utilization and sales volumes within North America.</p><p class=\"\">Although the pulp and paper markets have been challenging over the past years, Billerud is in a strong position to evolve and strengthen. Long-term, we are a firm believer in fiber-based packaging to replace fossil-based materials. Billerud has attractive positions in core markets due to our superior product performance and manufacturing expertise. We are at our best when we work with customers and applications requiring lighter, stronger and more sustainable materials. With our updated strategy, modest investment level and strong balance sheet we have a solid foundation. We now look forward to continuing to execute and deliver our strategy.</p><p class=\"\">Ivar Vatne</p><p class=\"\"><em>President and CEO</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth quarter</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales and results</strong></p><p class=\"\">Net sales for the fourth quarter increased by 20% to SEK 11,468 million (9,566). Currency changes had a positive impact of 2%. The currency-neutral net sales increased by 18%, mainly due to increased sales volumes in both regions and higher sales prices compared to last year. The sales volumes totaled 940 ktons (872), positively impacted by inventory reductions and higher than normal market pulp sales in Region Europe. Both regions had production curtailments.</p><p class=\"\">Adjusted EBITDA improved to SEK 1,443 million (774), corresponding to a margin of 13% (8). The Group’s result increased mainly as a result of sales growth and efficiency gains which were only partly offset by higher input costs in Region Europe. Annual maintenance shutdowns were in the quarter carried out at the Frövi and Escanaba mills, with a total cost impact of SEK 109 million.</p><p class=\"\">Items classified as affecting comparability in the fourth quarter totaled SEK 373 million (-244). The items affecting comparability were costs for the US transformation program of SEK 89 million, positive result effects from two transfers of pension obligations and related assets in the US of SEK 389 million, released provisions for restructuring costs related to personnel reductions of SEK 58 million, and a positive result of the revaluation of biological assets in the associated company BSÖ Holding AB Group of SEK 15 million.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Market development and outlook</strong></p><p class=\"\">In the fourth quarter, Billerud experienced normal market conditions for most of the product categories. Demand for coated liner and cartonboard was weak. Sales prices were largely maintained, except for market pulp where the price decreased. Input costs increased in Europe, while they were stable in North America. </p><p class=\"\">For the first quarter of 2025, Billerud expects normal market conditions for most categories in Region Europe except for coated liner and cartonboard which are expected to remain weak. Sales volumes in Region Europe are estimated to be 30–60 ktons lower than in the fourth quarter. Prices for liquid packaging board have been raised from 1 January. Solid conditions for graphic and specialty paper in North America are expected and Billerud announced a price increase on coated freesheet (CFS) rolls graphic paper in January. Total input costs are expected to increase, mainly for wood in Europe and logistics in the US, as well as seasonally higher energy costs in both regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Events in the quarter</strong></p><p class=\"\">On 1 October, Billerud agreed on a transfer of pension obligations and related assets in the US, which resulted in a positive result effect of USD 25 million. On 27 November, Billerud agreed on another transfer of pension obligations and related assets in the US, which had a positive result effect of USD 12 million. The combined result effect of these transfers amounted to SEK 389 million and were in the fourth quarter reported as an item affecting comparability. The transfers of pension obligations and related assets had no cash flow impact.</p><p class=\"\">On 2 December, ahead of Billerud’s Capital Markets Day, the Board of Directors decided on a strategic investment program of SEK 1.2 billion in the Escanaba mill and SEK 0.2 billion in the Quinnesec mill, that will enable a transition towards paperboard production in North America. The Board of Directors also decided on new, long-term financial targets for Billerud. As the premises for pulp, paper and packaging production in Europe have changed structurally since 2022 with elevated fiber costs, the EBITDA margin target was adjusted to above 15% over a business cycle. In parallel, a target for return on capital employed (ROCE) was reintroduced, and a target for cash conversion was introduced. The financial policy governing the company’s indebtedness and dividends to shareholders remained unchanged.  </p><p class=\"\">Billerud announced on 12 December that its targets for reducing its CO2e emissions had been approved by the Science Based Targets initiative. Billerud commits to reduce its scope 1 and 2 emissions by 42% by 2030, with 2022 as base year, and to reduce its scope 3 emissions by 25% within the same timeframe. </p><p class=\"\">On 20 December, Billerud announced that Jaakko Nikkilä is the new President, Billerud Europe from 1 May 2025. Jaakko Nikkilä has extensive experience in both international sales and production of fiber-based packaging materials and has recently served as Executive Vice President in UPM, where he has been a member of the Group Executive Team since 2019.</p><p class=\"\">Matthew Hirst, who decided to leave Billerud, remained in the role as President Billerud Europe until 31 January 2025. From 1 February to 30 April, Ivar Vatne will be interim President, Region Europe. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\">* For key figures and a reconciliation of alternative performance measures including adjusted EBITDA, adjusted operating profit, adjusted EBITDA margin, adjusted operating profit margin, adjusted ROCE and interest-bearing net debt/adjusted EBITDA, see pages 14-16.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information:</strong></p><p class=\"\">Andrei Krés, CFO, +46 8 553 335 72</p><p class=\"\">Lena Schattauer, Director Investor Relations, +46 8 553 335 10</p><p class=\"\">ir@billerud.com</p><p class=\"\">This information constituted inside information prior to publication. This is information that Billerud AB (publ) is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 07.00 CET on 4 February 2025.</p><p class=\"\">https://news.cision.com/billerud-ab/r/year-end-report-january-december-2024%2Cc4099935</p><p class=\"\">The full report (PDF)</p><p class=\"\">Excel tables web Q4 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrhPTZB:0-year-end-report-january-december-2024/",
            "pub_date": "2025-02-04 14:00:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr1SjZP8:0",
            "title": "Flex LNG - Key information relating to the cash distribution for the fourth quarter 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Flex LNG<p class=\"\">February 4, 2025</p><p class=\"\">Hamilton, Bermuda</p><p class=\"\">Key information relating to the cash distribution to be paid by Flex LNG Ltd. (\"Company\") for the fourth quarter 2024. The distribution will be made from the Company's Contributed Surplus Account.</p><p class=\"\">Please note that from May 28, 2024, the standard settlement cycle for transactions executed in securities traded on the New York Stock Exchange (\"NYSE\") will be shortened from T+2 to T+1 (of which T equals trading date), while the Oslo Stock Exchange (\"OSE\") will continue to settle its trades on a T+2 basis.</p><p class=\"\">As a result, there will be different dates between the two stock exchanges, as set out below. During these interim days, investors may be restricted to move shares between NYSE and OSE.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">NYSE shareholders:</strong></p><p class=\"\">Distribution amount: $0.75</p><p class=\"\">Declared currency: USD</p><p class=\"\">Last day including right: February 19, 2025</p><p class=\"\">Ex-date: February 20, 2025</p><p class=\"\">Record date: February 20, 2025</p><p class=\"\">Payment date: March 5, 2025</p><p class=\"\">Date of approval: February 3, 2025</p><p class=\"\">***</p><p class=\"\">OSE shareholders with shares registered in Euronext Securities Oslo:</p><p class=\"\">Distribution amount: $0.75</p><p class=\"\">Declared currency: USD to be distributed in NOK</p><p class=\"\">Last day including right: February 18, 2025</p><p class=\"\">Ex-date: February 19, 2025</p><p class=\"\">Record date: February 20, 2025</p><p class=\"\">Payment date: March 10, 2025</p><p class=\"\">Date of approval: February 3, 2025</p><p class=\"\">For further questions regarding the timing of payments, please contact your bank, broker, nominee, or other financial intermediary.</p><p class=\"\">For more info please contact:</p><p class=\"\">Knut Traaholt, Chief Financial Officer of Flex LNG Management AS</p><p class=\"\">Telephone: +47 23 11 40 00</p><p class=\"\">Email: IR@flexlng.com</p><p class=\"\">About Flex LNG</p><p class=\"\">Flex LNG is a shipping company focused on the growing market for Liquefied Natural Gas (LNG). Our fleet consists of thirteen LNG carriers on the water and all of our vessels are state-of-the-art ships with the latest generation two-stroke propulsion (MEGI and X-DF). These modern ships offer significant improvements in fuel efficiency and thus also carbon footprint compared to the older steam and four-stroke propelled ships. Flex LNG is listed on the New York Stock Exchange as well as Oslo Stock Exchange under the ticker FLNG.</p><p class=\"\">This information is subject to the disclosure requirements pursuant to section 5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">https://news.cision.com/flex-lng/r/flex-lng---key-information-relating-to-the-cash-distribution-for-the-fourth-quarter-2024%2Cc4099954</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr1SjZP8:0-flex-lng-key-information-relating-to-the-cash-distribution-for-the-fourth-quarter-2024/",
            "pub_date": "2025-02-04 14:00:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr3zKtVx:0",
            "title": "Flex LNG - Fourth Quarter 2024 Presentation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Flex LNG<p class=\"\">February 4, 2025</p><p class=\"\">Hamilton, Bermuda</p><p class=\"\">Please find enclosed the presentation of Flex LNG Ltd.’s fourth quarter 2024 results which will be presented in a live video webcast today at 15:00 CET (09:00 a.m. EST).</p><p class=\"\">In order to watch the webcast, use the following link:</p><p class=\"\">Fourth Quarter 2024 Earnings Presentation</p><p class=\"\">A Q&amp;A session will be held after the webcast. Information on how to submit questions will be given at the beginning of the session.</p><p class=\"\">In conjunction with the quarterly results, we have published a short teaser with the highlights of the fourth quarter. The video can be accessed through the following link:</p><p class=\"\">YouTube Link</p><p class=\"\">The short video and the fourth quarter 2024 presentation can also be accessed on our website www.flexlng.com  </p><p class=\"\">For further information, please contact:</p><p class=\"\">Mr. Knut Traaholt, Chief Financial Officer of Flex LNG Management AS</p><p class=\"\">Telephone: +47 23 11 40 00</p><p class=\"\">Email: ir@flexlng.com</p><p class=\"\">This information is subject to the disclosure requirements pursuant to section 5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">https://news.cision.com/flex-lng/r/flex-lng---fourth-quarter-2024-presentation%2Cc4099955</p><p class=\"\">Flex LNG Q4 2024 Presentation</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr3zKtVx:0-flex-lng-fourth-quarter-2024-presentation/",
            "pub_date": "2025-02-04 14:00:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr3y4sYg:0",
            "title": "Flex LNG - Fourth Quarter 2024 Earnings Release",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Flex LNG<p class=\"\">February 4, 2025</p><p class=\"\">Hamilton, Bermuda</p><p class=\"\">Flex LNG Ltd. (\"Flex LNG\" or the “Company”) today announced its unaudited financial results for the three months and year ended December 31, 2024.</p><p class=\"\">Highlights:</p><p class=\"\">* Vessel operating revenues of $90.9 million for the fourth quarter 2024, compared to $90.5 million for the third quarter 2024. The fourth quarter 2024 include $1.4 million in EU ETS revenue. An equivalent amount has been recorded under Voyage Expenses for the period.</p><p class=\"\">* Net income of $45.2 million and basic earnings per share of $0.84 for the fourth quarter 2024, compared to net income of $17.4 million and basic earnings per share of $0.32 for the third quarter 2024.</p><p class=\"\">* Average Time Charter Equivalent (\"TCE\") rate of $75,319 per day for the fourth quarter 2024, compared to $75,426 per day for the third quarter 2024.</p><p class=\"\">* Adjusted EBITDA of $68.7 million for the fourth quarter 2024, compared to $70.4 million for the third quarter 2024.</p><p class=\"\">* Adjusted net income of $30.8 million for the fourth quarter 2024, compared to $28.7 million for the third quarter 2024.</p><p class=\"\">* Adjusted basic earnings per share of $0.57 for the fourth quarter 2024, compared to $0.53 for the third quarter 2024.</p><p class=\"\">* In October 2024, we closed the new $160 million JOLCO lease for Flex Endeavour, and thereby completing the $430 million in new financings according to plan with net proceeds of about $97 million.</p><p class=\"\">* In November 2024, we signed an amendment under the Flex Enterprise $150 million Facility to convert the non-amortizing term loan tranche of $83.7 million to a non-amortizing revolving credit facility. The Company's revolving credit facility capacity therefore increased to $413.7 million in the fourth quarter of 2024.</p><p class=\"\">* In November 2024, the charterer of Flex Courageous and Flex Resolute, agreed to amend and extend by way of addendum to the existing time charters, to include a new firm period from 2029 to 2032 following the last two-year option under the original time charter contract. The addendum includes additional options for the Charterer to extend each vessel by up to seven years in periods of two years, two years and three years.</p><p class=\"\">* In November 2024, Flex Constellation signed a new time charter contract with a large Asian utility and asset backed LNG trader for a period of 15 years. The charter will commence during the first or second quarter of 2026, and has a firm period ending in 2041. The contract includes options for the charterer to extend the vessel by additional two years up to 2043.</p><p class=\"\">* The Company declared a dividend for the fourth quarter 2024 of $0.75 per share. The dividend is payable on or about March 5, 2025 to shareholders, on record as of February 20, 2025.</p><p class=\"\">Øystein M. Kalleklev, CEO of Flex LNG Management AS, commented:</p><p class=\"\">“We are pleased to deliver stellar financial performance for the fourth quarter in line with our previous guidance. Our Time Charter Equivalent rate for the fleet of $75,319/day was slightly ahead of guidance of $73-75,000/day. Adjusted EBITDA was $68.7 million, also in line with guidance of close to $70 million. We recorded substantial profits on our portfolio of interest rate swaps as we increased our interest rate hedging significantly during the interest rate slump at the beginning of September. During the fourth quarter, interest rates rallied, and we therefore booked $20.1 million of gains on these derivatives of which $5.1 million were realized during the quarter. Hence, adjusted net income for the fourth quarter came in at $30.8 million, corresponding to earnings per share and adjusted earnings per share of $0.84 and $0.57 respectively.</p><p class=\"\">During 2024, and in the fourth quarter particularly, we were able to secure new attractive backlog which will insulate us from the current market weakness. In November, we announced extension of the Time Charters for Flex Courageous and Flex Resolute where we added up to 10 years of new charter period for each ship from 2029 onwards, in which the three first years are firm. During the first quarter of 2024, the charterer also extended these time charters by two years each from 2025 to 2027 with a further option to extend these two ships from 2027 to 2029, coinciding with the new charter period from 2029. Furthermore, in December, we announced a new 15-year Time Charter for Flex Constellation from 2026 to 2041 where the charterer has the option to extend the ship up to 2043. Flex LNG is thus very well positioned with 62 years of minimum charter backlog equal to about five years of contract backlog per ship, on average. Furthermore, this backlog may grow to 96 years in the event charterers utilize all their extension options.</p><p class=\"\">In the latter part of 2024, we also carried out some further optimization of our balance sheet with two refinancings worth $430 million enabling us to raise net cash proceeds of $97 million while at the same time both lowering our interest costs and increasing our debt maturity profile. Additionally, we increased our non-amortizing revolving credit facilities from $330 million to $414 million which reduces the cost of having such on-demand credit accessible. As a result, we closed the year with $437 million of cash-at-hand with first debt maturity in 2028.</p><p class=\"\">The short to medium term outlook for LNG shipping is challenging given the numerous ship deliveries ahead of ramped up new export capacity. As such, we think 2024 to 2027 will probably resemble the period 2014 to 2017. There is one key difference, we will likely see a sharp increase in the demolition of older, less efficient tonnage, primarily steam tonnage which will prepare the ground for improved markets, similar to what was experienced in 2017. In any case, Flex LNG utilized the upturn in 2021 to 2023 well to build both a fortress balance sheet and charter backlog and we are well prepared for the current weak market. We are therefore guiding financial performance in 2025 to be in line with what we achieved in 2024.</p><p class=\"\">Our dividend is also steady with the Board once again declaring an ordinary quarterly dividend per share of $0.75. This is our fourteenth ordinary quarterly dividend of $0.75 per share and when adding the special dividends, we will have paid out $610 million of dividends to our shareholders the last 3.5 years.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fourth Quarter 2024 Result Presentation</strong></p><p class=\"\">In connection with the earnings release, a video webcast will be held at today 15:00 CET (09:00 a.m. EST).</p><p class=\"\">In order to attend the live video webcast use the following link:</p><p class=\"\">Fourth Quarter 2024 Earnings Presentation</p><p class=\"\">A Q&amp;A session will be held after the webcast. Information on how to submit questions will be given at the beginning of the session.</p><p class=\"\">In conjunction with the quarterly results, we have published a short teaser with the highlights of the fourth quarter. The video can be accessed through the following link:</p><p class=\"\">YouTube Link</p><p class=\"\">The presentation material which will be used in the live video webcast can be downloaded on www.flexlng.com and replay details will also be available at this website.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Mr. Knut Traaholt, Chief Financial Officer of Flex LNG Management AS</p><p class=\"\">Telephone: +47 23 11 40 00</p><p class=\"\">Email: ir@flexlng.com</p><p class=\"\">This information is subject to the disclosure requirements pursuant to section 5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">Matters discussed in this press release may constitute forward-looking statements. The Private Securities Litigation Reform Act of 1995 provides safe harbour protections for forward-looking statements in order to encourage companies to provide prospective information about their business. Forward-looking statements include statements concerning plans, objectives, goals, strategies, future events or performance, and underlying assumptions and other statements, which are other than statements of historical facts. The Company desires to take advantage of the safe harbour provisions of the Private Securities Litigation Reform Act of 1995 and is including this cautionary statement in connection with this safe harbour legislation. The words \"believe,\" \"expect,\" \"forecast,\" \"anticipate,\" \"estimate,\" \"intend,\" \"plan,\" \"possible,\" \"potential,\" \"pending,\" \"target,\" \"project,\" \"likely,\" \"may,\" \"will,\" \"would,\" \"should,\" \"could\" and similar expressions identify forward-looking statements.</p><p class=\"\">The forward-looking statements in this press release are based upon various assumptions, many of which are based, in turn, upon further assumptions, including without limitation, management’s examination of historical operating trends, data contained in the Company’s records and other data available from third parties. Although management believes that these assumptions were reasonable when made, because these assumptions are inherently subject to significant uncertainties and contingencies which are difficult or impossible to predict and are beyond the Company’s control, there can be no assurance that the Company will achieve or accomplish these expectations, beliefs or projections. As such, these forward-looking statements are not guarantees of the Company’s future performance, and actual results and future developments may vary materially from those projected in the forward-looking statements. The Company undertakes no obligation, and specifically declines any</p><p class=\"\">obligation, except as required by applicable law or regulation, to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. New factors emerge from time to time, and it is not possible for the Company to predict all of these factors. Further, the Company cannot assess the effect of each such factor on its business or the extent to which any factor, or combination of factors, may cause actual results to be materially different from those contained in any forward-looking statement.</p><p class=\"\">In addition to these important factors, other important factors that, in the Company’s view, could cause actual results to differ materially from those discussed in the forward-looking statements include: unforeseen liabilities, future capital expenditures, the strength of world economies and currencies, inflationary pressures and central bank policies intended to combat overall inflation and rising interest rates and foreign exchange rates, general market conditions, including fluctuations in charter rates and vessel values, changes in demand in the LNG tanker market, the impact of public health threats, changes in the Company’s operating expenses, including bunker prices, drydocking and insurance costs, the fuel efficiency of the Company’s vessels, the market for the Company’s vessels, availability of financing and refinancing, ability to comply with covenants in such financing arrangements, failure of counterparties to fully perform their contracts with the Company, changes in governmental rules and regulations or actions taken by regulatory authorities, including those that may limit the commercial useful lives of LNG tankers, customers' increasing emphasis on environmental and safety concerns, potential liability from pending or future litigation, global and regional economic and political conditions or developments, armed conflicts, including the war between Russia and Ukraine, as well as the developments in the Middle East, including continued conflicts between Israel and Hamas and the conflict regarding the Houthi attack in the Red Sea, trade wars, tariffs, embargoes and strikes, the impact of the U.S. presidential and congressional election results affecting the economic, future government laws and regulations and trade policy matters, such as the imposition of tariffs and</p><p class=\"\">other import restrictions, business disruptions, including supply chain disruption and congestion, due to natural or other disasters or otherwise, potential physical disruption of shipping routes due to accidents, climate-related incidents, or political events, vessel breakdowns and instances of off-hire, and other factors, including those that may be described from time to time in the reports and other documents that the Company files with or furnishes to the U.S. Securities and Exchange Commission (“Other Reports”). For a more complete discussion of certain of these and other risks and uncertainties associated with the Company, please refer to the Other Reports.</p><p class=\"\">https://news.cision.com/flex-lng/r/flex-lng---fourth-quarter-2024-earnings-release%2Cc4099956</p><p class=\"\">Flex LNG - Earnings Release Q4 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr3y4sYg:0-flex-lng-fourth-quarter-2024-earnings-release/",
            "pub_date": "2025-02-04 14:00:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_IndgnpMv:0",
            "title": "Inderes Oyj’s Financial Statements Release 2024: Revenue, profit and cash flow grew in a challenging market",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inderes Oyj, Company announcement 4 February 2025 at 8:00 am EET</p><p class=\"\">Inderes Oyj’s Financial Statements Release 2024: Revenue, profit and cash flow grew in a challenging market</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures in January-December 2024</strong></p><p class=\"\">*Adjusted for consolidated goodwill amortization and the associated company's (HC Andersen Capital) consolidated goodwill amortization</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures in October-December 2024</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures</strong></p><p class=\"\">*Adjusted for consolidated goodwill amortization and the associated company's (HC Andersen Capital) consolidated goodwill amortization</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Outlook</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Guidance for 2025</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Background for the outlook</strong></p><p class=\"\">In 2024, Inderes’ revenue grew by 7% and EBITA by 17%. Cash flow from operating activities after investments grew by 106% to 2.8 MEUR. Our ability to generate strong cash flow again enables a growing dividend and strategic growth investments. The fourth quarter was weak, as expected, due to timing between quarters, expenses incurred in late 2024 and the weak revenue development in Sweden. As a whole, second half of the year improved from the previous year. <strong class=\"root-Tkn6WL2y\">CEO Mikael Rautanen:</strong></p><p class=\"\">The largest businesses, Equity Research and Events, remained in single-digit growth in a market we estimated to decline in 2024. The Software business achieved several breakthroughs and strong growth of 40%. This is an example of the organization’s ability to maintain the discipline to make good investments in long-term growth initiatives, even when it requires compromising short-term profitability. Recent successes have given us the courage to accelerate our efforts and grow the Software team already in late 2024.</p><p class=\"\">In the fourth quarter, a leading European IR event provider chose Videosync as its online events platform. The agreement is commercially important and shows that we have made the right choices in the global competition of event platforms. Videosync is already by far the most common platform for IR events in the Nordics and, going forward, also more widely in Europe. Our proprietary technology scales and connects investors and listed companies increasingly internationally.</p><p class=\"\">In Denmark, Inderes’ strategic partner HC Andersen Capital's (HCA) revenue grew over 20% despite the very difficult market. HCA has successfully expanded its IR offering with the support of Inderes. Each of Inderes’ main products now has paying customers in Denmark.</p><p class=\"\">In Sweden, we are making a change of pace after two years following the acquisition. The results have not been sufficient. We are updating our sales strategy and reorganizing around sales. We are strengthening the autonomy of our product lines to identify clearer focus areas and to get in to the customers.</p><p class=\"\">In Finland, Inderes' foundation is solid, and growth was moderate even though the market declined in 2024. I remain optimistic regarding the revitalization of the IPO market. We continue to see signs that projects are being concretely launched.</p><p class=\"\">Based on the lessons learned so far on the internationalization journey, we will refine our strategy during the spring, and the updated strategy will be presented at a Capital Markets Day in May. It is already clear that from an international perspective, our markets are full of dysfunctional structures waiting to be disrupted and exposed to more efficient competition. Almost 80% of listed SMEs do not have analyst coverage in Europe. Investors do not have equal access to information about companies. Too low liquidity is a shared problem of both listed companies and investors.</p><p class=\"\">This was our third fiscal year as a listed company. The listing has been the right stepping stone for us to take the company to the next level. Thank you to the Inderes team, community, customers and owners for the trust in the journey so far.</p><p class=\"\">Inderes’ target is to increase the absolute profit distribution each year, which includes dividend distributions and share buybacks. <!-- -->The Board of Directors’ proposal for measures concerning the company's profit</p><p class=\"\">Inderes will host an earnings call in Finnish today at 9:30 EET. At the event, CEO  and CFO  will review the company's financial performance and strategy for the financial year 2024. <strong class=\"root-Tkn6WL2y\">Webcast</strong> <strong class=\"root-Tkn6WL2y\">Mikael Rautanen</strong> <strong class=\"root-Tkn6WL2y\">Mikko Wartiovaara</strong></p><p class=\"\">In addition, CEO  will present the key points of the Financial Statements Release in English in an earnings call hosted by HC Andersen Capital on 5 February 2025, at 16:30 EET. <strong class=\"root-Tkn6WL2y\">Mikael Rautanen</strong></p><p class=\"\">You can follow the Finnish webcast starting at 9:30 EET on 4 February 2025, at . https://inderes.videosync.fi/q4-2024</p><p class=\"\">You can follow the English webcast starting at 16:30 EET on 5 February 2025, at . https://hca.videosync.fi/2025-02-05-inderes/register</p><p class=\"\">As usual, participants can ask questions during the webcast using the chat function of the video platform or by using the platform’s talk back function. The presentation material will be published before the events on the company's website at . www.group.inderes.fi</p><p class=\"\">This release is a summary of Inderes Oyj's financial statements release for 2024. The complete financial statements bulletin is attached to this company release as a pdf file and is also available on the company's website at  <em>.</em> <em>www.group.inderes.fi/en</em></p><p class=\"\">Mikael RautanenCEO, Inderes Oyjmikael.rautanen@inderes.fi tel. +358 50 346 0321Jori-Pekka Rautalahtitel. +358 50 382 9323 <strong class=\"root-Tkn6WL2y\">Contact information:</strong> <strong class=\"root-Tkn6WL2y\">Certified Adviser:Sisu Partners Oy</strong></p><p class=\"\">jori-pekka.rautalahti@sisupartners.com</p><p class=\"\">Juha Karttunentel. +358 40 555 4727</p><p class=\"\">juha.karttunen@sisupartners.com</p><p class=\"\">Inderes is a Nordic investor media connecting investors and listed companies. We provide in-depth equity research and investor relations solutions to help over 400 listed companies better serve the Nordic investor community. Inderes operates in Sweden, Finland, Denmark, and Norway and is listed on Nasdaq First North Growth Market. Read more:  <strong class=\"root-Tkn6WL2y\">Inderes in brief</strong></p><p class=\"\">https://group.inderes.com/en/</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue increased by 7.1% to 18.4 MEUR (17.2), recurring revenue accounted for 60.4% (61.0%) of revenue</li><li class=\"listItem-bmN0_SHH\">Sweden’s revenue was 3.9 MEUR (3.6) and its share of total revenue was 21.2% (21.3%)</li><li class=\"listItem-bmN0_SHH\">EBITA totaled 2.1 MEUR (1.8) and the EBITA margin was 11.6% (10.6%)</li><li class=\"listItem-bmN0_SHH\">Adjusted EPS was EUR 0.95 (0.80)*</li><li class=\"listItem-bmN0_SHH\">Cash flow after investments increased by 106% to EUR 2.8 (1.4) million</li><li class=\"listItem-bmN0_SHH\">Inderes provided services to 427 (427) listed companies in the past 12 months</li><li class=\"listItem-bmN0_SHH\">The Inderes platform had a reach of 19.1 (19.6) million visits in 2024 and the number of active members was 66 (74) thousand at the end of the period</li><li class=\"listItem-bmN0_SHH\">The Board of Directors proposes to the Annual General Meeting that a dividend of EUR 0.87 (0.85) per share to be paid in two instalments</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue increased by 1.0% to 4.2 MEUR (4.2)</li><li class=\"listItem-bmN0_SHH\">Recurring revenue grew by 6.0% to 2.8 MEUR (2.7) and accounted for 66.4% (63.3%) of total revenue</li><li class=\"listItem-bmN0_SHH\">Project revenue decreased by -7.7% to 1.4 MEUR (1.5)</li><li class=\"listItem-bmN0_SHH\">Sweden's revenue was 0.9 MEUR (1.0), the revenue accounted for 20.6% (23.7%) of total revenue</li><li class=\"listItem-bmN0_SHH\">EBITA totaled 0.0 MEUR (0.2) and the EBITA margin was 0.9% (5.7%)</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Revenue will grow from the previous year (18.4) MEUR</li><li class=\"listItem-bmN0_SHH\">Relative profitability measured by EBITA % excluding non-recurring items improves from the previous year (11.6%)</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The target market for main product areas is expected to remain stable or grow slightly in 2025</li><li class=\"listItem-bmN0_SHH\">Revenue will increase driven by new products and openings of new markets</li><li class=\"listItem-bmN0_SHH\">Company accelerates investments to international growth</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The adjusted earnings per share in 2024 were EUR 0.95 (0.80).</li><li class=\"listItem-bmN0_SHH\">The company’s distributable funds amount to EUR 11.3 (10.7) million.</li><li class=\"listItem-bmN0_SHH\">Inderes’ Board of Directors proposes to the Annual General Meeting that a dividend of EUR 0.87 (0.85) per share be distributed in two installments.<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">According to the proposal, the first dividend installment of EUR 0.43 per share would be paid to shareholders registered in the company's shareholders' register maintained by Euroclear Finland Oy on the record date of 14 April 2025. According to the proposal, the first dividend installment would be paid on 23 April 2025.</li><li class=\"listItem-bmN0_SHH\">According to the proposal, the second dividend installment of EUR 0.44 per share would be paid to shareholders registered in the company's shareholders' register maintained by Euroclear Finland Oy on the preliminary record date of 16 October 2025. According to the proposal, the second dividend installment would be paid on 23 October 2025.</li></ul></li><li class=\"listItem-bmN0_SHH\">Inderes’ Annual General Meeting is scheduled to be held in Helsinki on Thursday, 10 April, 2025.</li></ul><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>MEUR</td><td>10-12/2024</td><td>10-12/2023</td><td>1-12/2024</td><td>1-12/2023</td></tr><tr><td>Revenue</td><td>4.2</td><td>4.2</td><td>18.4</td><td>17.2</td></tr><tr><td>Revenue growth</td><td>1.0%</td><td>8.0%</td><td>7.1%</td><td>27.1%</td></tr><tr><td>Share of recurring revenue, %</td><td>66.4%</td><td>63.3%</td><td>60.4%</td><td>61.0%</td></tr><tr><td>EBITA</td><td>0.0</td><td>0.2</td><td>2.1</td><td>1.8</td></tr><tr><td>EBITA-%</td><td>0.9%</td><td>5.7%</td><td>11.6%</td><td>10.6%</td></tr><tr><td>EBIT</td><td>-0.1</td><td>0.0</td><td>1.2</td><td>0.8</td></tr><tr><td>EBIT %</td><td>-3.2%</td><td>-0.5%</td><td>6.4%</td><td>4.5%</td></tr><tr><td>Earnings per share</td><td></td><td></td><td>0.26</td><td>0.05</td></tr><tr><td>Adjusted EPS*</td><td></td><td></td><td>0.95</td><td>0.80</td></tr><tr><td>Cash flow after investments</td><td></td><td></td><td>2.8</td><td>1.4</td></tr><tr><td>Equity ratio</td><td></td><td></td><td>54.8%</td><td>46.8%</td></tr><tr><td>Net gearing</td><td></td><td></td><td>-8.2%</td><td>-27.9%</td></tr><tr><td>Average number of employees</td><td>121</td><td>118</td><td>119</td><td>117</td></tr></tbody></table></div><strong class=\"root-Tkn6WL2y\">Attachments</strong>Financial_Statements_Release_Q4_2024_EN.pdf</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_IndgnpMv:0-inderes-oyj-s-financial-statements-release-2024-revenue-profit-and-cash-flow-grew-in-a-challenging-market/",
            "pub_date": "2025-02-04 14:00:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000180_20250204000188:0",
            "title": "Hana Financial Group 4Q Net Profit Missed FactSet-Compiled Consensus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000188:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000180_20250204000186:0",
            "title": "Hana Financial Group 4Q Net KRW521.10B Vs. Net KRW459.70B >086790.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000186:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000183:0",
            "title": "BNP Paribas: Each Interim Dividend Will Amount to 50% of the Net EPS of 1H",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000183:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000182:0",
            "title": "BNP Paribas: 2025 Semi-annual Interim Dividend to Be Paid out in Late September",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000182:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000181_20250204000181:0",
            "title": "BNP Paribas to Implement a Semi-annual Interim Dividend Starting in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000181_20250204000181:0/",
            "pub_date": "2025-02-04 13:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463203:0",
            "title": "Number of Chinese Private Pension Funds Sales Agencies Grows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The number of China's private pension fund sales agencies increased to 52 in 2024 from 37 in 2022, Xinhua News Agency reported Monday, citing the Asset Management Association of China. </p><p class=\"\">Of the number, 19 are commercial lenders, including the Industrial and Commercial Bank of China  and the Agricultural Bank of China  while 25 are securities firms and eight are independent sales institutions, the report said. </p><p class=\"\">The government piloted its private pension scheme in a number of cities in 2022 and rolled out the program nationwide in December 2024, the report said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463203:0/",
            "pub_date": "2025-02-04 13:53:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463209:0",
            "title": "Bank Albilad Posts Higher FY24 Net Profit, Total Operations Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bank Albilad (SASE:1140) said Tuesday that its net profit and total operations profit for full-year 2024 jumped year over year. </p><p class=\"\">Net profit for the 12 months ended Dec. 31, 2024, was 2.81 billion Saudi riyals, compared with 2.37 billion riyals a year ago. EPS moved to 2.26 riyals from 1.91 riyals. </p><p class=\"\">The Saudi Arabia-listed bank's total operations profit was over 5.67 billion riyals, compared with 5.30 billion riyals earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463209:0/",
            "pub_date": "2025-02-04 13:53:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463210:0",
            "title": "Welspun Enterprises' Consolidated Profit Declines in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Welspun Enterprises'  consolidated profit attributable to shareholders fell to 775 million Indian rupees in the fiscal third quarter from 894.9 million rupees a year earlier, according to a Monday filing by the infrastructure services provider. </p><p class=\"\">Earnings per share for the quarter ended Dec. 31, 2024, dropped to 5.16 rupees from 5.20 rupees in the year-ago period. </p><p class=\"\">Revenue from operations in fiscal Q3 climbed year on year to 8.67 billion rupees from 7.07 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463210:0/",
            "pub_date": "2025-02-04 13:53:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000190:0",
            "title": "UBS: Noncore and Legacy Risk Weighted Assets Reduced by $3B in 4Q",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000190:0/",
            "pub_date": "2025-02-04 13:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000208:0",
            "title": "UBS Backs 2026 Targets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000208:0/",
            "pub_date": "2025-02-04 13:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000211:0",
            "title": "UBS Confirms Financial Targets and Ambitions for 2026 Exit Rate and 2028",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000211:0/",
            "pub_date": "2025-02-04 13:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000180_20250204000210:0",
            "title": "Hana Financial Group 2024 Rev KRW81.629T, Up 17% >086790.SE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000180_20250204000210:0/",
            "pub_date": "2025-02-04 13:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_JCN95756a:0",
            "title": "Fujitsu launches gen AI software analysis and visualization service to support optimal modernization planning",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KAWASAKI, Japan, Feb 4, 2025 - (JCN Newswire) - Fujitsu today announced the launch of a software analysis and visualization service. Available in Japan from February, this service will support enterprise and organizational modernization by investigating and analyzing software, visualizing black-box application structures and characteristics, and generating design documents using generative AI. This comprehensive approach enables a robust understanding of current systems and facilitates the creation of optimal modernization plans.</p><p class=\"\">The service comprises two components: software analysis and visualization, which visualizes the application structure and specifications of existing systems; and software design document reverse engineering, which generates design documents from software. Leveraging Fujitsu's expertise gained from analyzing the system assets of over 600 companies, this service provides comprehensive support, from gaining a robust understanding of company software to streamlining and optimizing software for migration to new systems, evaluating migration difficulty level during mainframe-to-open-environment migration, and even generating design documents using generative AI.</p><p class=\"\">Leveraging the core technology of Fujitsu's AI service, Fujitsu Kozuchi, the design document reverse engineering service generates user-friendly design documents from large datasets. This AI-powered service can significantly improve efficiency, with projections of a 50% improvement for retail customers compared to manual methods.</p><p class=\"\">Fujitsu is currently advancing the utilization of generative AI across a comprehensive range of phases within system integration (SI) projects, encompassing modernization initiatives and extending from requirements definition to operational maintenance. The strategic application of generative AI to tasks traditionally executed manually by engineers - including the creation of design documentation and source code throughout the design, development, and testing phases - is intended to yield significant increases in efficiency. The Fujitsu software analysis and visualization service, which enables the use of generative AI at the requirement definition stage of the SI process, represents one of the many ways that Fujitsu is accelerating SI transformation by leveraging generative AI to the maximum extent towards productivity and quality improvements.</p><p class=\"\">Overview of the Software Analysis and Visualization Service</p><p class=\"\">1. The software analysis and visualization service visualizes complex software to facilitate smooth system migrations</p><p class=\"\">This service supports a comprehensive understanding, streamlining, and optimization of software applications, as well as evaluating migration difficulty level. Through the automated creation of software maps that visualize application functional structures - representing the application as a building depicted on a map, it allows for a rapid and intuitive grasp of the current state of the software. Additionally, it categorizes all software by programming language, identifying unused items and similar source code. In evaluating migration difficulty level, it efficiently selects mainframe functions necessary for the application using a standardized process based on Fujitsu's modernization experience. From this selection, it extracts functions that pose obstacles to migration from mainframe to open environments and evaluates the difficulty of porting.</p><p class=\"\">2. The software design document reverse engineering service leverages generative AI to support the creation of high-quality design documents</p><p class=\"\">Departing from conventional analysis methodologies that mechanically parse source code line-by-line based on predefined rules and verify against documented results to ascertain system structure, Fujitsu combines the Fujitsu Knowledge Graph Enhanced Retrieval Augmented Generation (RAG) for Software Engineering to achieve a substantial enhancement in the quality of both asset comprehension and design document generation.</p><p class=\"\">This technology leverages a large language model (LLM) to significantly enhance the accuracy and completeness of software analysis and design information generation. The process involves constructing an asset knowledge graph from existing design documentation and static analysis of the source code (obtained through either conventional tools or LLM-based analysis). A proprietary RAG function then facilitates the precise identification and extraction of relevant knowledge for design information generation. This targeted information, combined with the source code, is input into the LLM, resulting in an approximately 40% improvement in the quality of generated design information compared to source-code-only methods.</p><p class=\"\">Furthermore, to mitigate the risk of LLM hallucinations, this technology incorporates a mechanism to refine input information and detect instances of LLM forgetting. This results in approximately 95% prevention of forgetting and enables the generation of accurate design information, leading to anticipated improvements in the efficiency of human review processes.</p><p class=\"\">Future Plans</p><p class=\"\">To further enhance productivity and bolster support for client modernization efforts, Fujitsu will widely expand the scope of generative AI application. Future developments will include interactive capabilities for verifying current application specifications and assessing the impact of source code changes. This commitment to innovation will significantly contribute to the successful realization of our clients' digital transformation (DX) objectives.</p><p class=\"\">About Fujitsu</p><p class=\"\">Fujitsu's purpose is to make the world more sustainable by building trust in society through innovation. As the digital transformation partner of choice for customers in over 100 countries, our 124,000 employees work to resolve some of the greatest challenges facing humanity. Our range of services and solutions draw on five key technologies: Computing, Networks, AI, Data &amp; Security, and Converging Technologies, which we bring together to deliver sustainability transformation. Fujitsu Limited  reported consolidated revenues of 3.7 trillion yen (US$26 billion) for the fiscal year ended March 31, 2024 and remains the top digital services company in Japan by market share. Find out more: www.fujitsu.com.</p><p class=\"\">Press Contacts</p><p class=\"\">Fujitsu Limited</p><p class=\"\">Public and Investor Relations Division</p><p class=\"\">Inquiries</p><p class=\"\">Source: Fujitsu Ltd</p><p class=\"\">Copyright 2025 JCN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_JCN95756a:0-fujitsu-launches-gen-ai-software-analysis-and-visualization-service-to-support-optimal-modernization-planning/",
            "pub_date": "2025-02-04 13:55:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_S8N3O505O:0",
            "title": "UBS reports Q4 net profit of $770 mln, beating expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  on Tuesday reported a net profit attributable to shareholders of $770 million in the fourth quarter, which compares with an average estimate of $438 million in a company-provided poll of analysts.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_S8N3O505O:0-ubs-reports-q4-net-profit-of-770-mln-beating-expectations/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000148:0",
            "title": "UBS 4Q Rev $11.635B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000148:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000151:0",
            "title": "Analysts Saw UBS 4Q Underlying Pretax Profit at $1.38B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000151:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000133_20250204000150:0",
            "title": "Analysts Saw UBS 4Q Revenue at $11.51B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000133_20250204000150:0/",
            "pub_date": "2025-02-04 13:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}