{
    "data": [
        {
            "id": "DJN_DN20260226011813_20260226011848:0",
            "title": "SMCP: Action Plan Is Delivering as Expected",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011848:0/",
            "pub_date": "2026-02-27 00:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011813_20260226011841:0",
            "title": "SMCP CEO: Group Delivered Resilient Sales Growth in 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011841:0/",
            "pub_date": "2026-02-27 00:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011813_20260226011838:0",
            "title": "SMCP 2025 Adj Ebitda EUR231.3M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011838:0/",
            "pub_date": "2026-02-27 00:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226014397:0",
            "title": "Have a parent over 65? Get ready to join the caregiving crisis.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Beth Pinsker</span></p><p class=\"\"><span>This is what family caregivers are up against as the population ages, Pew found</span></p><p class=\"\"><span>Caregiving can be both draining and fulfilling.</span></p><p class=\"\"><span>Nearly a quarter of Americans who have a parent over the age of 65 are engaged in some kind of caregiving activity for them - and the rest are probably headed in that direction, according to a new report from the Pew Research Center. Caregiving incidence goes up to 31% among those with a parent who is 75 or older.</span></p><p class=\"\"><span>The data in \"Family Caregiving in an Aging America\" is part of Pew's overall American Trends Panel. Director of research Kim Parker said they didn't go into the study specifically to find the prevalence of caregivers, but once they saw it, they dug deeper to find out what life looks like for these people.</span></p><p class=\"\"><span>The chief observation: It's a bumpy road. Caregivers are pulled in different directions, since most are also working. They report that caregiving has a more negative than positive impact on a person's emotional well-being, physical health, financial situation, career and social life. At the same time, it has a more positive effect on their relationship with their parents.</span></p><p class=\"\"><span>\"It's so real,\" said Parker. \"It shows the nuance of the experience.\"</span></p><p class=\"\"><span>The aging of the baby boom generation is the main force driving this caregiving crisis: About 10,000 baby boomers are turning 65 every day. As Pew notes in other research, there were 76 million births during the baby boom generation, and the oldest among that group are now hitting 80. The U.S. did not reach that number of births again until 1989, with the generation known as millennials, and they are the ones now doing the bulk of the caregiving.</span></p><p class=\"\"><span>The type of responsibilities also varied in Pew's family caregiver research. About half of caregivers regularly assisted a parent with errands, housework and home repairs. Around 40% helped manage healthcare and another 40% helped with household finances. Only 16% said they regularly helped with more hands-on personal care like bathing and dressing, while 15% said they did this occasionally.</span></p><p class=\"\"><span>\"Caregiving doesn't look like the same thing for all families,\" said Jason Resendez, chief executive of the National Alliance for Caregiving, which regularly does research on caregiving. \"You might be really engaged in one type of caregiving at first that evolves into more intense caregiving over time.\"</span></p><p class=\"\"><span>Resendez noted that his group's research also shows a dichotomy in the emotional experience of caregiving - it's hard, but at the same time fulfilling. \"One of the realities of caregiving is that it's deeply personal and emotional. It's so hard to provide care,\" he said. \"Our data also shows 50% find a deep sense of purpose with that care. That points to folks finding meaning in this hard work.\"</span></p><p class=\"\"><span>That was the case for Amy Goyer, who was a caregiver for both of her parents and a sister and is now a caregiving expert and columnist for AARP. \"The positive and negative are not mutually exclusive,\" she said. \"It can bring you closer, and it can be incredibly draining, full of unpredictability and fear and loss and grief, and can all affect your mental well-being. It's not an either/or. You can have positives and feel joy.\"</span></p><p class=\"\"><span>Solutions to the caregiving crisis</span></p><p class=\"\"><span>What's the solution for making things easier? Money.</span></p><p class=\"\"><span>Short of solving for sickness and death, caregivers were strongly in favor of solutions that provided more resources to them. The most popular was tax credits for caregivers, with 78% support. Caregivers were also in favor of resources for respite care, requiring employers to provide paid leave for caregiving and direct payments to caregivers.</span></p><p class=\"\"><span>There was some political divergence in the responses, with Democrats leaning more favorable to these proposals than Republicans. But among both groups, more supported these ideas than were against them.</span></p><p class=\"\"><span>\"We've seen these findings in other solutions, like support for paid family leave,\" said Parker. \"There is sometimes broad bipartisan support. It takes you beyond party.\"</span></p><p class=\"\"><span>Resendez typically sees responses shift more according to income level than political leanings. \"Households with more than $50,000 in income are more favorable to tax credits. Those earning under $50,000 want more direct payment options,\" he said. But either way, he added, \"people want their care to be valued.\"</span></p><p class=\"\"><span>Caregivers also need each other, Goyer emphasized. Her work revolves around connecting caregivers with each other to provide support. \"It's a puzzle that you put together. It's not one thing that will make the caregiver situation work,\" she said. \"It's about financial help, flexible work, tax breaks, but also connecting with other caregivers. A lot of people feel that support isn't there for them today, and it makes them feel very alone.\"</span></p><p class=\"\"><span>Got a question about investing, how it fits into your overall financial plan and what strategies can help you make the most out of your money? You can write to me at beth.pinsker@marketwatch.com. Please put \"Fix My Portfolio\" in the subject line.</span></p><p class=\"\"><span>You can also join the Retirement conversation in our Facebook community: Retire Better with MarketWatch.</span></p><p class=\"\"><span>By submitting your story to Dow Jones &amp; Co., the publisher of MarketWatch, you understand and agree that we may use your story, or versions of it, in all media and platforms, including via third parties.</span></p><p class=\"\"><span>More Fix My Portfolio</span></p><p class=\"\"><span>My small church wants to sell some property, but the trustees can't agree on what to do with the money</span></p><p class=\"\"><span>I'm almost 65 and live abroad. Should I skip signing up for Medicare?</span></p><p class=\"\"><span>Escape the 'gay tax' while planning for retirement with these three mindset shifts</span></p><p class=\"\"><span>-Beth Pinsker</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226014397:0/",
            "pub_date": "2026-02-27 00:43:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EduVzGM3a:0",
            "title": "REG - Euronext Dublin - Euronext Dublin Market Cancellation Notice (EURONEXT DUBLIN) [89220]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89220</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EduVzGM3a:0-reg-euronext-dublin-euronext-dublin-market-cancellation-notice-euronext-dublin-89220/",
            "pub_date": "2026-02-27 00:43:33",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011813_20260226011851:0",
            "title": "SMCP Saw Strong Improvement of Profitability",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011851:0/",
            "pub_date": "2026-02-27 00:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938083:0",
            "title": "ASE: Operating profit and cash flow rebounded, with 2026 growth expected despite payment headwinds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Adjusted for one-offs, operating profit and cash flow improved, led by dedicated solutions and banking, while payment faced headwinds from Turkish client losses and India/UAE write-offs. 2026 outlook is positive, with growth expected from efficiency gains and selective acquisitions.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938083:0-ase-operating-profit-and-cash-flow-rebounded-with-2026-growth-expected-despite-payment-headwinds/",
            "pub_date": "2026-02-27 00:44:57",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938085:0",
            "title": "MDWD: Phase III chronic wound trial and expanded manufacturing drive growth, with key catalysts ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>A late-stage biologic firm highlighted its FDA-approved burn treatment and Phase III chronic wound asset, both leveraging a proprietary enzymatic platform. Key catalysts include expanded manufacturing, a pivotal Phase III readout by late 2026, and significant government funding.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938085:0-mdwd-phase-iii-chronic-wound-trial-and-expanded-manufacturing-drive-growth-with-key-catalysts-ahead/",
            "pub_date": "2026-02-27 00:44:59",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:0176493db8eb6:0",
            "title": "Year-End Report 2025 – Q4",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The fourth quarter of 2025 represented a transformative shift for Byhmgard AB in connection with the completion of the reverse listing in November, whereby Byhmgard Construct AB was acquired by the previously listed company Spiffbet AB, which subsequently changed its name to Byhmgard AB (publ).</span></strong></p><p class=\"\"><span>During the quarter, focus was placed on the integration of operations and the implementation of measures to strengthen the Group’s financial position and establish a stable platform for continued development within battery energy storage systems (BESS) and critical energy infrastructure.</span></p><p class=\"\"><span>In parallel with the integration process, the Company continued to execute on its growth strategy. On December 30, the Company signed its largest agreement to date — a BESS project in Finland with an order value of SEK 43 million — confirming market demand for the Company’s business model of developing and packaging energy storage projects for investors and industrial clients.</span></p><p class=\"\"><span>During the quarter, Byhmgard also strengthened its strategic position through international partnerships in China and initiated the establishment of Joint Ventures in Italy and Finland.</span></p><p class=\"\"><span>Subsequent to the end of the quarter, an additional agreement with Solarigo System Oy was signed with an order value of SEK 33 million, which, together with previous orders, contributes to a strengthened foundation for continued growth during 2026.</span></p><p class=\"\"><span>Byhmgard currently operates through two complementary business areas: development of proprietary BESS projects and the sale of turnkey energy solutions. The Company intends to continue scaling its project portfolio through strategic partnerships and investments in critical energy infrastructure.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Significant Events During the Fourth Quarter of 2025</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>On October 20, 2025, an Extraordinary General Meeting in Spiffbet AB resolved to acquire Byhmgard AB.</span></li><li class=\"listItem-bmN0_SHH\"><span>On November 24, 2025, Byhmgard Construct AB was approved for listing on Nordic Growth Market through a reverse acquisition of Spiffbet AB.</span></li><li class=\"listItem-bmN0_SHH\"><span>On November 25, 2025, changes in the Company’s management were announced in connection with the transaction.</span></li><li class=\"listItem-bmN0_SHH\"><span>On November 27, 2025, the name change from Spiffbet AB to Byhmgard AB (publ) was registered.</span></li><li class=\"listItem-bmN0_SHH\"><span>On December 1, 2025, the Company entered into a strategic partnership with Jiangxi Ship Group regarding large-scale BESS projects in Europe.</span></li><li class=\"listItem-bmN0_SHH\"><span>On December 11, 2025, a Joint Venture in Italy was established as part of the Company’s international expansion strategy.</span></li><li class=\"listItem-bmN0_SHH\"><span>On December 15, 2025, CTO Johan Thorsted increased his shareholding in the Company by 385,000 shares.</span></li><li class=\"listItem-bmN0_SHH\"><span>On December 30, 2025, the Company entered into an agreement with Solarigo System Oy regarding a BESS project with an order value of approximately SEK 43 million.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Significant Events After the End of the Reporting Period</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>On January 2, 2026, CFO Dragan Cadjo increased his shareholding in the Company by 270,000 shares.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 7, 2026, the Company announced its intention to acquire a 30 MW battery energy storage project in Latvia.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 13, 2026, Patrik Bloemer was appointed Head of Engineering.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 14, 2026, Board member Fredrik Crafoord increased his shareholding by 5,000,000 shares.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 21, 2026, Chairman of the Board Mikael Odenberg increased his shareholding to 550,000 shares.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 22, 2026, the Finnish subsidiary Byhmgard Oy was established together with Several Oy, in which Byhmgard AB holds a 90 percent ownership stake.</span></li><li class=\"listItem-bmN0_SHH\"><span>On January 23, 2026, an Extraordinary General Meeting, based on an established second balance sheet for liquidation purposes (KBR 2) showing that the share capital had been fully restored, resolved that the Company’s operations shall continue.</span></li><li class=\"listItem-bmN0_SHH\"><span>On February 9, 2026, an additional order from Solarigo System Oy was signed regarding a BESS project with an order value of approximately SEK 33 million.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For additional information, please contact:</span></strong></p><p class=\"\"><span>Christian Byhmer, CEO. Mobile: 073-528 91 90,</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Byhmgard</span></strong></p><p class=\"\"><span>Byhmgard AB develops, construct and invest in utility scale energy storage projects (BESS) in Europe. The business involves project development, EPC, software optimization and long term operations. The company vision is to deliver critical energy infrastructure to enable Europes energy transition smarter and more cost efficient.</span></p><p class=\"\"><em><span>This information is information that Byhmgard is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 2026-02-26 17:45 CET.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/4ecc073f-ad2a-4c28-8ed1-14c96293eb89/byhmgard-bokslutskommunike-q4-2025-swedish.pdf\" rel=\"nofollow\" target=\"_blank\">Byhmgard Bokslutskommuniké Q4 2025 Swedish</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:0176493db8eb6:0-year-end-report-2025-q4/",
            "pub_date": "2026-02-27 00:45:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011866:0",
            "title": "Viridien : 2025 annual results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Paris (France), February 26, 2026</span></p><p class=\"\"><span>2025 annual results</span></p><p class=\"\"><span>Strong performance driving significant</span></p><p class=\"\"><span>cash generation and deleveraging</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Segment revenue of $1,165m, up +4% year-on-year   </span></li><li class=\"listItem-bmN0_SHH\"><span>Geoscience revenue up +10% to $444m, driven by all our three core basins   as well as the Middle East, and Earth Data revenue up +6% to $406m,   fueled by market appetite for high-end data and sector consolidation   </span></li><li class=\"listItem-bmN0_SHH\"><span>Strong improvement in profitability, supported by operating efficiency   gains across all business lines. Segment adjusted EBITDAs of $551m, up   +21% year-on-year, representing a 47% margin vs 41% in 2024   </span></li><li class=\"listItem-bmN0_SHH\"><span>IFRS Net Income of $71m, up +40% compared with 2024   </span></li><li class=\"listItem-bmN0_SHH\"><span>Significant Net Cash Flow generation of $107m, exceeding the FY 2025   guidance of $100m   </span></li><li class=\"listItem-bmN0_SHH\"><span>Continued reduction in Net Debt (excluding IFRS 16) to $753m   </span></li><li class=\"listItem-bmN0_SHH\"><span>FY 2026 guidance: expected Net Cash Flow generation of $100m </span></li></ul><p class=\"\"><span>Sophie Zurquiyah, Chair and CEO of Viridien: \"2025 was a pivotal year in advancing the asset-light strategy and financial transformation we initiated in 2018. Leveraging our proven competitive edge as an advanced technology and digital expert, we delivered very strong operational performance and generated substantial cash, fully allocated to debt reduction. This performance reflects the strength of our business model, driven by highly skilled, excellence-focused teams and deep expertise in high-performance computing. In 2026, assuming a comparable business environment, we expect to generate a further $100 million in Net Cash Flow, with seasonality consistent with 2025. This will be dedicated to additional deleveraging, further strengthening the Group's financial structure.\"</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(in millions of $)  Q4 2025  Q4 2024  Change (%)  FY 2025  FY 2024  Change (%) </span><br/><span>Segment figures </span><br/><span>Revenue                 277      339        -18%    1,165    1,117         +4% </span><br/><span>Adjusted EBITDAs        135      157        -14%      551      455        +21% </span><br/><span>IFRS figures(1) </span><br/><span>Revenue                 312      427        -27%    1,071    1,211        -12% </span><br/><span>EBITDAs                 174      216        -20%      461      516        -11% </span><br/><span>Operating Income         89       49        +81%      237      143        +65% </span><br/><span>Net Income               52       29        +78%       71       51        +40% </span><br/><span>Net Cash Flow            45       22       +106%      107       56        +92% </span><br/><span>Net Debt (incl. </span><br/><span> IFRS16)                888      921         -4%      888      921         -4% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span> </span></pre><p class=\"\"><span>KEY HIGHLIGHTS PER BUSINESS LINE(2)</span></p><p class=\"\"><span>Data, Digital and Energy Transition (DDE): Strong contribution across the board</span></p><p class=\"\"><span>Segment revenue at $850, up +8% year-on-year, with solid performance in both businesses.</span></p><p class=\"\"><span>Geoscience (GEO)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Revenue at $444m (+10%)   </span></li><li class=\"listItem-bmN0_SHH\"><span>Large OBN projects across our three core basins remained the main   activity drivers, while the Middle East also showed solid momentum   </span></li><li class=\"listItem-bmN0_SHH\"><span>Productivity per employee up +13% to $387k. Computing power increased to   690 petaflops (+33% year on year) and will continue to expand with the   planned investments in the US HPC infrastructure over the next years </span></li></ul><p class=\"\"><span>Earth Data (EDA)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Revenue at $406m (+6%)   </span></li><li class=\"listItem-bmN0_SHH\"><span>Good progress on the Laconia multi-client OBN project in the U.S. Gulf,   with the addition of a Phase 3 expanding the area covered to the south;   continued expansion in Brazil's Equatorial Margin, where the Group has   secured permits; new and reprocessing activity in the North Sea,   particularly the Utsira North OBN project; and meaningful transfer fees   linked to sector consolidation </span></li></ul><p class=\"\"><span>Overall, growth in DDE New Businesses has slowed, as clients have refocused on their core Oil &amp; Gas activities. However, HPC and digital continue to show solid momentum, supported by ongoing commercial discussions.</span></p><p class=\"\"><span>Segment adjusted EBITDAs at $549m, up +20% year on year, with the margin expanding to 65% versus 58% in 2024, driven by further operating efficiency improvements and the significant flow-through from EDA's late sales. EDA Cash EBITDA at $178m, up +137% compared with 2024.</span></p><p class=\"\"><span>Sensing and Monitoring (SMO): Resilient land segment and continued growth in non-energy activities</span></p><p class=\"\"><span>Segment revenue at $315m in 2025, down -5% year-on-year. Within legacy businesses, land-based solutions closed the year up +2%, supported by a broadly diversified portfolio of contracts across geographies and scales, but only partially offset the slowdown in marine revenues. SMO New Businesses remained dynamic, increasing +8% versus 2024 and now representing 19% of SMO's total revenue.</span></p><p class=\"\"><span>Segment adjusted EBITDAs at $32m, down -10% compared to 2024. Against lower activity levels and a strongly adverse currency effect (driven by US dollar depreciation while SMO's cost base is primarily in euros) the cost-reduction efforts implemented over the past 24 months to lower SMO's break-even point helped limit the impact on profitability.</span></p><p class=\"\"><span>Segment adjusted operating income at $9m, up +114% year-on-year, with the margin more than doubling, positioning SMO well for improved profitability as activity recovers.</span></p><p class=\"\"><span>CONSOLIDATED IFRS FIGURES(3)</span></p><p class=\"\"><span>Profit &amp; Loss: Net Income up a significant +40%</span></p><p class=\"\"><span>Consolidated IFRS revenue for 2025 came in at $1,071m, down -12% year-on-year, with a $94m negative impact related to IFRS15 restatements. Over the period, these adjustments primarily relate to major survey projects conducted by Earth Data in the US Gulf and Norway. EBITDAs stood at $461m, down -11%, reflecting the same effect.</span></p><p class=\"\"><span>IFRS Net Income reached $71m, up a strong +40% compared to 2024, after notably accounting for -$229m of leases and D&amp;A, -$107m net cost of financial debt, -$38m of other financial losses largely related to bond refinancing and foreign exchange impacts, and -$23m of income taxes.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(in millions of $)  Q4 2025  Q4 2024  Change (%)  FY 2025  FY 2024  Change (%) </span><br/><span>EUR/$ exchange </span><br/><span> rate                  1.12     1.09         +3%     1.12     1.09         +3% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span>Revenue                 312      427        -27%    1,071    1,211        -12% </span><br/><span>EBITDAs                 174      216        -20%      461      516        -11% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span>Operating income         89       49        +81%      237      143        +65% </span><br/><span>Equity from </span><br/><span> investment               0       -1        n.a.       -1        0        +70% </span><br/><span>Net cost of </span><br/><span> financial debt         -28      -24        +18%     -107      -97        +10% </span><br/><span>Other financial </span><br/><span> income (loss)           -3        5        n.a.      -38        4        n.a. </span><br/><span>Income taxes             -6        1        n.a.      -23      -13        +68% </span><br/><span>                    -------  -------  ----------  -------  -------  ---------- </span><br/><span>Net Income (loss) </span><br/><span> from continuing </span><br/><span> operations              52       29        +77%       69       36        +90% </span><br/><span>Net Income (loss) </span><br/><span> from discontinued </span><br/><span> operations               0        0        n.a.        3       15        -81% </span><br/><span>                    -------  -------  ----------  -------  -------  ---------- </span><br/><span>Consolidated Net </span><br/><span> Income (loss)           52       29        +78%       71       51        +40% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span> </span></pre><p class=\"\"><span>Cash Flow Statement and Debt: Net Cash Flow nearly doubled, with a strong reduction in Net Debt</span></p><p class=\"\"><span>Net Cash Flow of $107m generated in 2025, nearly doubling compared with $56m in 2024 and exceeding full-year 2025 guidance ($100m). Viridien collected $29m of the unpaid PEMEX(4) receivables outstanding at the end of Q3 2025. This cash was allocated to the repayment of a $28m asset-backed facility related to the Group's HPC infrastructure. From an accounting perspective, both items are included in Net Cash Flow as they are linked to operations. The PEMEX collection is reflected in changes in working capital, while the repayment of the asset-backed facility is recorded under other financing activities.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                                           Change                      Change </span><br/><span>(in millions of $)      Q4 2025  Q4 2024    (%)     FY 2025  FY 2024    (%) </span><br/><span>Segment EBITDAs             139      128       +9%      556      422      +32% </span><br/><span>Income tax paid              -2       -2      -32%      -16      -12      +26% </span><br/><span>Change in working </span><br/><span> capital &amp; provisions        20       30      -35%      -62       48     -229% </span><br/><span>Other cash items              0        0      -41%       -1       -1      +92% </span><br/><span>Cash from Operating </span><br/><span> Activity                   156      155       +1%      477      457       +4% </span><br/><span>                        -------  -------  --------  -------  -------  -------- </span><br/><span>Total capex                 -35      -81      -57%     -207     -285      -27% </span><br/><span>Acquisitions and </span><br/><span> proceeds of assets          12        6      +96%       14        7     +110% </span><br/><span>Cash from Investing </span><br/><span> Activity                   -22      -75      -70%     -193     -278      -31% </span><br/><span>                        -------  -------  --------  -------  -------  -------- </span><br/><span>Paid cost of debt           -50      -43      +16%      -92      -86       +7% </span><br/><span>Lease repayment             -11      -12      -13%      -55      -56       -2% </span><br/><span>Other financing </span><br/><span> activities                 -28        0      n.s.      -29       -1      n.s. </span><br/><span>Cash from Financing </span><br/><span> Activity                   -89      -56      +60%     -175     -142      +23% </span><br/><span>                        -------  -------  --------  -------  -------  -------- </span><br/><span>Discontinued </span><br/><span> operations </span><br/><span> acquisitions                 0       -3     -109%       -1       19      n.a. </span><br/><span>Net Cash Flow                45       22     +106%      107       56      +92% </span><br/><span>                        -------  -------  --------  -------  -------  -------- </span><br/><span>Refinancing costs paid </span><br/><span> (fees + call </span><br/><span> premium)                     0        0      n.a.      -42        0      n.a. </span><br/><span>Repayment and issuance </span><br/><span> of debt                    -99      -49     +100%     -203      -69     +192% </span><br/><span>Forex and other               1      -12      n.a.        8      -11      n.a. </span><br/><span>Net increase </span><br/><span> (decrease) in Cash         -54      -40      +35%     -129      -25     +408% </span><br/><span>                        -------  -------  --------  -------  -------  -------- </span><br/><span> </span></pre><p class=\"\"><span>Viridien has been highly active over the past two years in managing its liabilities, in line with its commitment to deleverage the Group and optimize financing costs.</span></p><p class=\"\"><span>In 2025, in addition to repaying the $28m asset-backed facility, the Group fully utilized the 10% annual optional redemption at 103% included in its bond documentation, repaying $97m of outstanding bonds. This redemption was executed in two transactions, in mid-October and mid-December 2025. In total, $43m was repaid on the USD-denominated tranche and EUR46m ($54m) on the EUR-denominated tranche, reducing the remaining outstanding principal to $407m and EUR430m ($505m), respectively.</span></p><p class=\"\"><span>As of December 31, 2025, Viridien maintained a strong liquidity position, including a $125m RCF(5) .</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(in millions of $)   Dec. 31, 2025  Dec. 31, 2024  Change (%) </span><br/><span>                     -------------  -------------  ---------- </span><br/><span>Liquidity                      273            392        -30% </span><br/><span>Cash                           173            302        -43% </span><br/><span>Undrawn RCF                    100             90        +11% </span><br/><span>                     -------------  -------------  ---------- </span><br/><span>Gross Debt                   1,061          1,223        -13% </span><br/><span>Bonds                       895(6)          1,049        -15% </span><br/><span>Other borrowings                13             31        -58% </span><br/><span>Accrued interests               18             18         -4% </span><br/><span>Lease liabilities              135            125         +9% </span><br/><span>                     -------------  -------------  ---------- </span><br/><span>Net Debt                       888            921         -4% </span><br/><span>-------------------  -------------  -------------  ---------- </span><br/><span> </span></pre><p class=\"\"><span>GOVERNANCE</span></p><p class=\"\"><span>On November 19, 2025, the Group announced its decision to reinstate a separated governance structure from the next General Meeting, to be held on June 3, 2026, by splitting the roles of Chair and CEO.</span></p><p class=\"\"><span>From that date, subject to approval by the General Meeting, Sophie Zurquiyah will become non-executive Chair of the Board and will step down from her executive responsibilities. As she reaches the end of her second term as CEO, the Board of Directors unanimously supports her remaining as Chair to ensure strategic continuity and guide Viridien's long-term vision. Since 2018, her leadership has repositioned Viridien as an asset-light, technology-driven company with a stronger financial foundation and a more diversified portfolio.</span></p><p class=\"\"><span>The Board also unanimously approved the appointment of Henning Berg as Viridien's new CEO, effective June 3, 2026. Henning Berg brings more than 27 years of experience in the oil and gas services industry, including several senior global leadership roles at SLB. He will join the Group on March 3, 2026, as Chief Operating Officer, ensuring a structured and gradual transition to the CEO role. His appointment as Director will also be submitted for approval at the upcoming General Meeting</span></p><p class=\"\"><span>OUTLOOK</span></p><p class=\"\"><span>While short-term energy price volatility may result in some industry caution and softer activity in the first half of 2026, we anticipate a recovery in the second half. Under an overall business environment comparable to last year, Viridien expects to deliver around $100 million of Net Cash Flow in FY26, with a seasonal profile similar to 2025 and full allocation to further deleveraging. This target incorporates the planned Phase 1 expansion of our US HPC infrastructure and assumes a normalization of working capital, including PEMEX.</span></p><p class=\"\"><span>Looking further ahead, the structural dynamics of global energy supply increasingly point toward a new exploration upcycle(7) . Frontier discoveries and offshore deepwater developments, areas where Viridien holds clear technological leadership, will be critical to sustaining production and reinforce our confidence in the Group's medium- and long-term trajectory.</span></p><p class=\"\"><span>***</span></p><p class=\"\"><span>Q4 2025 conference call details</span></p><p class=\"\"><span>The press release and presentation will be made available on www.viridiengroup.com at 5:45 p.m. (CET).</span></p><p class=\"\"><span>An English-language conference call is scheduled today at 6:00 p.m. (CET).</span></p><p class=\"\"><span>Participants must register for the conference call by clicking here to receive a dial-in number and PIN code. Participants may also join the live webcast by clicking here.</span></p><p class=\"\"><span>A replay of the conference call will also be available, for a period of 12 months, on the Company's website www.viridiengroup.com.</span></p><p class=\"\"><span>Status of the Statutory Auditors' procedures</span></p><p class=\"\"><span>The Board of Directors met on February 26, 2026, and closed the consolidated financial statements as of December 31, 2025. Audit procedures were completed, and the Statutory Auditors are in the process of issuing a report with an unqualified opinion.</span></p><p class=\"\"><span>Next financial information</span></p><p class=\"\"><span>2026 first-quarter results: May 5, 2026 (after market close)</span></p><p class=\"\"><span>About Viridien</span></p><p class=\"\"><span>Viridien (www.viridiengroup.com) is an advanced technology, digital and Earth data company that pushes the boundaries of science for a more prosperous and sustainable future. With our ingenuity, drive and deep curiosity we discover new insights, innovations, and solutions that efficiently and responsibly resolve complex natural resources, digital, energy transition and infrastructure challenges. Viridien employs around 3,200 people worldwide and is listed as VIRI on the Euronext Paris SA (</span><span>).</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><p class=\"\"><span>Disclaimer</span></p></div></section><p class=\"\"><span>Certain information included in this press release is not historical data but forward-looking statements. These forward-looking statements are based on current beliefs and assumptions, including, but not limited to, assumptions about current and future business strategies and the environment in which Viridien operates, and involve known and unknown risks, uncertainties and other factors, which may cause actual results or performance, or the results or other events, to be materially different from those expressed or implied in such forward-looking statements. These risks and uncertainties include those discussed or identified in Chapter 2 \"Risk Management and Internal Control\" of the Universal Registration Document dated March 6, 2025, filed with the French Financial Markets Authority (AMF) under number D. 25-0075 and available on the Group's website (www.viridiengroup.com) and on the AMF website (www.amffrance.org). These forward-looking statements and information are not guarantees of future performance. Forward-looking statements speak only as of the date of this press release. This press release does not contain or constitute an offer of securities or an invitation or inducement to invest in securities in France, the United States, or any other area.</span></p><p class=\"\"><span>Investors contact</span></p><p class=\"\"><span>VP Investor Relations and Corporate Finance</span></p><p class=\"\"><span>Alexandre Leroy</span></p><p class=\"\"><span>alexandre.leroy@viridiengroup.com</span></p><p class=\"\"><span>+33 6 85 18 44 31</span></p><p class=\"\"><span>Media contact</span></p><p class=\"\"><span>Brunswick</span></p><p class=\"\"><span>Aurélia de Lapeyrouse - +33 6 21 06 40 33</span></p><p class=\"\"><span>Hugues Boëton - +33 6 79 99 27 15</span></p><p class=\"\"><span>Tristan Roquet Montégon - +33 6 37 00 52 57</span></p><p class=\"\"><span>viridien@brunswickgroup.com</span></p><p class=\"\"><span>APPENDICES</span></p><p class=\"\"><span>Quarterly financial statements are unaudited and not subject to any review.</span></p><p class=\"\"><span>Key Segment P&amp;L figures</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(in millions of $)  Q4 2025  Q4 2024  Change (%)  FY 2025  FY 2024  Change (%) </span><br/><span>EUR/$ exchange </span><br/><span> rate                  1.12     1.09         +3%     1.12     1.09         +3% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span>Segment Revenue         277      339        -18%    1,165    1,117         +4% </span><br/><span>   DDE                  211      238        -11%      850      787         +8% </span><br/><span>      Geoscience        111      107         +3%      444      404        +10% </span><br/><span>      Earth Data        100      131        -23%      406      383         +6% </span><br/><span>   SMO                   66      100        -34%      315      330         -5% </span><br/><span>      Land               21       55        -62%      160      157         +2% </span><br/><span>      Marine             28       29         -6%       94      117        -19% </span><br/><span>      Other              17       16         +9%       60       56         +8% </span><br/><span>------------------                    ----------                    ---------- </span><br/><span>Segment EBITDAs         139      128         +9%      556      422        +32% </span><br/><span>                    -------  -------  ----------  -------  -------  ---------- </span><br/><span>Adjusted Segment </span><br/><span> EBITDAs                135      157        -14%      551      455        +21% </span><br/><span>   DDE                  141      150         -7%      549      458        +20% </span><br/><span>   SMO                    2       18        -91%       32       35        -10% </span><br/><span>   Corporate and </span><br/><span>    other                -7      -11        -36%      -29      -38        -22% </span><br/><span>------------------                    ----------                    ---------- </span><br/><span>Segment Operating </span><br/><span> Income                  65       33        +97%      244      113       +116% </span><br/><span>                    -------  -------  ----------  -------  -------  ---------- </span><br/><span>Adjusted Segment </span><br/><span> Operating Income        61       89        -31%      240      173        +39% </span><br/><span>   DDE                   71       89        -20%      261      206        +27% </span><br/><span>   SMO                   -4       11        n.a.        9        4       +114% </span><br/><span>   Corporate and </span><br/><span>    other                -6      -11        -43%      -30      -38        -20% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span>EDA Cash EBITDA          66       44        +50%      178       75       +137% </span><br/><span>------------------  -------  -------  ----------  -------  -------  ---------- </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011866:0/",
            "pub_date": "2026-02-27 00:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011871:0",
            "title": "Slide Insurance Is Maintained at Overweight by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(16:45 GMT) </span></strong><span>Slide Insurance Price Target Raised to $24.00/Share From $22.00 by Piper Sandler</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011871:0/",
            "pub_date": "2026-02-27 00:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011813_20260226011873:0",
            "title": "SMCP Intends to Continue Rolling out Its Strategic Roadmap",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011873:0/",
            "pub_date": "2026-02-27 00:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226011813_20260226011878:0",
            "title": "SMCP Backs 2026 View",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226011813_20260226011878:0/",
            "pub_date": "2026-02-27 00:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EdubjY9Ha:0",
            "title": "REG - Euronext Dublin - GEM Cancellation Notice (EURONEXT DUBLIN) [89218]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89218</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EdubjY9Ha:0-reg-euronext-dublin-gem-cancellation-notice-euronext-dublin-89218/",
            "pub_date": "2026-02-27 00:37:17",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5940Ua:0",
            "title": "REG - J.P. Morgan Sec PLC Wizz Air Holdings - Placing of shares in Wizz Air Holdings Plc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5940U  J.P. Morgan Securities PLC.  26 February 2026   </span><p class=\"\"><span>26 February 2026</span></p><p class=\"\"><span>Not for release, publication or distribution, in whole or in part, directly or indirectly, in or into the United States, Australia, Canada, Japan or South Africa or in any other jurisdiction in which the release, publication or distribution would be unlawful or require registration.</span></p><p class=\"\"><span>This announcement does not constitute an offer to sell or the solicitation of an offer to purchase the securities described herein, nor shall there be any sale of the securities referred to herein in or into any jurisdiction where such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.</span></p><p class=\"\"><span>Neither this communication nor anything contained herein shall form the basis of, or be relied upon in connection with, any offer or commitment whatsoever in any jurisdiction. Any offer to acquire shares pursuant to the Placement (as defined below) will be made, and any investor should make its investment decision solely on the basis of, publicly available information.</span></p><p class=\"\"><span>PRESS RELEASE</span></p><p class=\"\"><span>Proposed secondary placing of ordinary shares in Wizz Air Holdings Plc by investment funds managed by Indigo Partners LLC.</span></p><p class=\"\"><span>Indigo Partners LLC (\"Indigo Partners\") today announces that investment funds managed by it intend to sell, through Indigo Hungary LP and Indigo Maple Hill, L.P. (the \"Sellers\"), approximately 10 million ordinary shares in Wizz Air Holdings Plc (the \"Company\" or \"Wizz Air\"), corresponding to approximately 9.7% of the Company's existing share capital, through a placing of ordinary shares via an accelerated bookbuild offering to institutional investors only (the \"Placement\").</span></p><p class=\"\"><span>Books will open immediately following the publication of this announcement and may be closed at short notice. The results of the Placement and the offer price will be announced as soon as practicable after completion of the bookbuilding process.</span></p><p class=\"\"><span>As of today, the Sellers own 24,684,895 ordinary shares in the Company, representing approximately 23.9% of the issued ordinary share capital and voting rights in the Company. The Indigo Shareholders also hold convertible shares and convertible notes in the Company as detailed in Wizz Air's 2025 Annual Report and Accounts. The number of ordinary shares the Sellers will hold after the Placement will be announced following completion of the Placement.</span></p><p class=\"\"><span>The Placement is driven by certain investors in the funds managed by Indigo Partners seeking to realise their investment following an extended holding period.</span></p><p class=\"\"><span>Investors are reminded that the Board of Wizz previously resolved to treat certain ordinary shares in the Company held by Non-Qualifying Nationals as Restricted Shares in order to continue to comply with the Ownership and Control Requirement under European Union law following Brexit.  Holders of Restricted Shares are not able to attend or speak or vote at any general meetings of the Company in respect of such shares. Investors should refer to the RNS announcement by the Company on 29 December 2020 entitled \"Disenfranchisement of Ordinary Shares\" and the Wizz Air 2025 Annual Report and Accounts for further information.</span></p><p class=\"\"><span>The Sellers have engaged Morgan Stanley &amp; Co. International plc (\"Morgan Stanley\") and J.P. Morgan Securities plc (\"J.P. Morgan\") as bookrunners (the \"Joint Bookrunners\") in connection with the Placement. Subject to customary exceptions, the Indigo Partners will not make additional sales of shares for 90 days without the consent of the Joint Bookrunners. In addition, the Indigo Partners may sell additional shares to a private equity sponsor or strategic investor provided the purchaser is then subject to the same lock-up terms as the Indigo Partners.</span></p><p class=\"\"><span>No shares are being sold or issued by the Company and the Company will not receive any proceeds from the Placement.</span></p><p class=\"\"><span>Important notices</span></p><p class=\"\"><span>This announcement is not for distribution, directly or indirectly, in or into the United States (including its territories and possessions, any state of the United States and the District of Columbia, the \"United States\"), Australia, Canada, Japan or South Africa or any other jurisdiction in which the distribution or announcement would be unlawful. The distribution of this announcement and the offer and sale of the shares in certain jurisdictions may be restricted by law and persons into whose possession this document or other information referred to herein comes should inform themselves about and observe any such restriction. Any failure to comply with these restrictions may constitute a violation of the securities laws of any such jurisdiction.</span></p><p class=\"\"><span>The shares are not being offered to the public in any jurisdiction and may not be offered to the public in any jurisdiction in circumstances which would require the preparation or registration of any prospectus or offering document relating to the shares in such jurisdiction. This announcement is not a prospectus and does not constitute or form part of any offer or solicitation to purchase or subscribe for securities in the United States, Canada, South Africa, Australia or Japan or any other jurisdiction in which such offers or sales are unlawful. No action has been taken by the Sellers, the Joint Bookrunners or any of their affiliates to permit a public offering of the shares or possession or distribution of this announcement in any jurisdiction where action for that purpose is required. Persons into whose possession this announcement comes are required to inform themselves about and to observe any such restrictions.</span></p><p class=\"\"><span>The securities referred to herein have not been, and will not be, registered under the U.S. Securities Act of 1933, as amended (the \"U.S. Securities Act\"), or under the securities laws of any state of the United States, and may not be offered or sold, directly or indirectly, in the United States except pursuant to an available exemption from, or in a transaction not subject to, the registration requirements of the U.S. Securities Act and the securities laws of any state or other jurisdiction of the United States. There will be no public offer of securities in the United States or elsewhere.</span></p><p class=\"\"><span>In member states of the European Economic Area (the \"EEA\"), this announcement and any offer if made subsequently is directed exclusively at persons who are \"qualified investors\" within the meaning of article 2(e) of the Prospectus Regulation (Regulation (EU) 2017/1129) (\"Qualified Investors\").</span></p><p class=\"\"><span>In the United Kingdom, this announcement and any offer if made subsequently is directed exclusively at persons who are \"qualified investors\" as defined in paragraph 15 of Schedule 1 to the Public Offers and Admissions to Trading Regulations 2024, and: (i) who have professional experience in matters relating to investments falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\") or (ii) who fall within Article 49(2)(a) to (d) of the Order, or (iii) to whom it may otherwise lawfully be communicated (all such persons together with Qualified Investors in the EEA being referred to herein as \"Relevant Persons\"). This document is directed only at Relevant Persons and must not be acted on or relied on by persons who are not Relevant Persons. Any investment or investment activity to which this document relates is available only to Relevant Persons and will be engaged in only with Relevant Persons.</span></p><p class=\"\"><span>This document includes statements that are, or may be deemed to be, forward-looking statements. These forward-looking statements may be identified by the use of forward-looking terminology, including the terms \"intends\", \"expects\", \"will\", or \"may\", or, in each case, their negative or other variations or comparable terminology, or by discussions of strategy, plans, objectives, goals, future events or intentions. These forward-looking statements include all matters that are not historical facts. No assurances can be given that the forward-looking statements in this document will be realised. As a result, no undue reliance should be placed on these forward-looking statements as a prediction of actual results or otherwise.</span></p><p class=\"\"><span>In connection with the Placement, the Joint Bookrunners and any of their respective affiliates may take up a portion of the shares in the Placement as a principal position and in that capacity may retain, purchase, sell, offer to sell for their own accounts such shares and other securities of the Company or related investments in connection with the Placement or otherwise. Accordingly, references in this announcement to the shares being sold, offered, subscribed, acquired, placed or otherwise dealt in should be read as including any issue or offer to, or subscription, acquisition, placing or dealing by, the Joint Bookrunners and any of their respective affiliates acting in such capacity. In addition, the Joint Bookrunners and any of their respective affiliates may have entered or may enter into financing arrangements (including swaps or contracts for differences) with investors in connection with which the Joint Bookrunners and any of their respective affiliates may from time to time acquire, hold or dispose of shares in the Company. The Joint Bookrunners do not intend to disclose the extent of any such investment or transactions otherwise than in accordance with any legal or regulatory obligations to do so.</span></p><p class=\"\"><span>Any communications that a transaction is or that the book is \"covered\" (i.e. indicated demand from investors in the book equals or exceeds the amount of the securities being offered) are not any indications or assurances that the book will remain covered or that the transaction and securities will be fully distributed by the Joint Bookrunners. The Joint Bookrunners reserve their right to take up a portion of the securities in the offering as a principal position at any stage at their sole discretion, inter alia, to take account of the objectives of the Sellers, MiFID II requirements and in accordance with allocation policies.</span></p><p class=\"\"><span>Neither of the Joint Bookrunners or any of their affiliates or their or their affiliates' directors, officers, employees, advisers or agents, accepts any responsibility or liability whatsoever for or makes any representation or warranty, express or implied, as to the truth, accuracy or completeness of the information in this announcement (or whether any information has been omitted from the announcement) whether written, oral or in a visual or electronic form, and howsoever transmitted or made available or for any loss howsoever arising from any use of this announcement or its contents or otherwise arising in connection therewith. No prospectus or offering document has been or will be prepared in connection with this secondary offering. Any investment decision to buy securities in the secondary offering must be made solely on the basis of publicly available information. Such information is not the responsibility of, and has not been independently verified by, any of the Sellers, the Joint Bookrunners or any of their respective affiliates.</span></p><p class=\"\"><span>The Joint Bookrunners are acting on behalf of the Sellers and no one else in connection with the Placement and will not be responsible to any other person for providing the protections afforded to any of its clients or for providing advice in relation to the Placement.</span></p><p class=\"\"><span>Each of Morgan Stanley and J.P. Morgan are authorised by the Prudential Regulatory Authority (\"PRA\") and regulated by the Financial Conduct Authority and the PRA, are acting on behalf of the Sellers only in connection with the Placement and no one else, and will not be responsible to anyone other than the Sellers for providing the protections offered to clients of Morgan Stanley and J.P. Morgan, nor for providing advice in relation to the Ordinary Shares or the Placement.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  IOESEFFMMEMSEDE</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5940Ua:0-reg-j-p-morgan-sec-plc-wizz-air-holdings-placing-of-shares-in-wizz-air-holdings-plc/",
            "pub_date": "2026-02-27 00:37:24",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2I1:0",
            "title": "Viridian Therapeutics Inc reports results for the quarter ended September 30 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Viridian Therapeutics Inc </span><span> reported a quarterly adjusted loss of 34 cents​​ per share for the quarter ended September 30, higher than the same quarter last year, when the company reported EPS of $-1.00.  The mean expectation of fifteen analysts for the quarter was for a loss of $1.08 per share. Wall Street expected results to range from $-1.30 to -60 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 53.5% to $70.57 million from a year ago; analysts expected $12.73 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Viridian Therapeutics Inc's reported EPS for the quarter was a loss of $1.08​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $28.17 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Viridian Therapeutics Inc shares had fallen by 7.0% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 17 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the biotechnology &amp; medical research peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Viridian Therapeutics Inc is $42.00, about 31.1% above its last closing price of $28.94</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 04:38 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-1.08</span></p></td><td><p class=\"\"><span>-1.08</span></p></td><td><p class=\"\"><span>Met</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-1.08</span></p></td><td><p class=\"\"><span>-0.34</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-1.01</span></p></td><td><p class=\"\"><span>-1.00</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>-0.97</span></p></td><td><p class=\"\"><span>-0.87</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2I1:0-viridian-therapeutics-inc-reports-results-for-the-quarter-ended-september-30-earnings-summary/",
            "pub_date": "2026-02-27 00:38:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226011597:0",
            "title": "If you can't beat the market, you'd better hope it tanks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Mark Hulbert</span></p><p class=\"\"><span>Investment professionals rarely outperform in a bull market. If you want stock picking to pay off, you're essentially rooting for a crash.</span></p><p class=\"\"><span>Will this year bring a bear market?</span></p><p class=\"\"><span>If this really is a time for stock pickers to get greedy, then a market downturn is likely.</span></p><p class=\"\"><span>Investment advisers hoping for a return of a \"stock-pickers market\" should be careful what they wish for. I'm referring to the age-old distinction between an investment environment in which most stocks march to the beats of their own individual drummers (a so-called \"market of stocks\") and its opposite, an environment in which most stocks rise and fall in tandem with each other (a so-called \"stock market\").</span></p><p class=\"\"><span>In a \"stock market\" the best strategy is simply investing in a broad stock-market index fund, while in a \"market of stocks\" the strategy most likely to beat the market is picking and choosing individual stocks.</span></p><p class=\"\"><span>There have been a rash of declarations that we have entered a market-of-stocks environment. Bloomberg even declared that \"for stock pickers, now might be the time to get greedy.\" But what many analysts don't appreciate is that the distinction between these two market environments is correlated with the market's cycle. Stock picking is far more likely to be successful when the overall market is falling than when it's rising. To hope for a \"market of stocks\" is functionally equivalent in many ways to hoping for a bear market.</span></p><p class=\"\"><span>This functional equivalence is illustrated in the accompanying chart. Each dot represents one of the calendar years since 1981; its place on the vertical axis represents the percentage of investment newsletter portfolios that beat the Wilshire 5000 Total Market Index XX:W5000FLT in that calendar year (as measured by the portfolios tracked by my performance auditing firm). Each dot's place along the horizontal axis reflects the Wilshire 5000's return in that year.</span></p><p class=\"\"><span>Notice the steep downwardly sloping trendline that best fits these dots, the statistical significance of which is quite high (as signified by its impressive r-squared). That means, on average, more portfolios beat the market when the stock market is falling - and vice versa. The implication: If it's really time for stock pickers to get greedy, then the market as a whole is likely to fall.</span></p><p class=\"\"><span>Last year is a good case in point. The broad market, as measured by the Wilshire 5000's total return, gained 17.1% in 2025 - well-above the U.S. stock market's long-term average rate of return. Sure enough, stock pickers struggled: Just 31% of monitored investment newsletter portfolios beat the market, in fact. A similarly low proportion of actively-managed equity funds and ETFs beat the market, according to Morningstar's Active/Passive Barometer - just 38%.</span></p><p class=\"\"><span>Of course, none of this discussion sheds any light on whether there actually will be a bear market in 2026, and therefore whether or not the odds favor stock picking. But unless you have an unusually good crystal ball about when the next bear market will begin, there's no reason to change your investment strategy for making money in the stock market.</span></p><p class=\"\"><span>Mark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com</span></p><p class=\"\"><span>More: The small-cap 'recovery' is a myth built on unprofitable stocks. What history says comes next.</span></p><p class=\"\"><span>Also read: 9 of the stock market's 10 most-watched valuation indicators are now in 'sell' territory</span></p><p class=\"\"><span>-Mark Hulbert</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226011597:0/",
            "pub_date": "2026-02-27 00:39:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938045:0",
            "title": "BALL: Strong execution, disciplined spending, and robust demand position for continued profitable growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Management highlighted strong execution on strategic pillars, robust demand for cans, and disciplined capital allocation. Operational excellence and incentive alignment are driving cost savings and profitable growth, with 90% of 2027 capacity already sold and further EPS growth expected.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938045:0-ball-strong-execution-disciplined-spending-and-robust-demand-position-for-continued-profitable-growth/",
            "pub_date": "2026-02-27 00:39:26",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938046:0",
            "title": "SJ: Strong utility pole growth and disciplined capital allocation drive robust 2025 performance",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Solid 2025 results featured strong utility pole growth, stable residential lumber sales, and resilient margins despite railway tie headwinds. Strategic acquisitions and capacity expansions position the company for continued growth, with robust cash flow and disciplined capital allocation supporting future objectives.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938046:0-sj-strong-utility-pole-growth-and-disciplined-capital-allocation-drive-robust-2025-performance/",
            "pub_date": "2026-02-27 00:39:27",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938047:0",
            "title": "LYB: Disciplined cash management, revised sustainability targets, and strategic portfolio actions drive outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong cash generation and disciplined capital allocation led to a 50% dividend cut and robust liquidity. Market outlook is supported by low inventories and capacity rationalization, while sustainability targets were revised to reflect delayed projects. APS turnaround and MoReTec-1 recycling remain strategic priorities.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938047:0-lyb-disciplined-cash-management-revised-sustainability-targets-and-strategic-portfolio-actions-drive-outlook/",
            "pub_date": "2026-02-27 00:39:27",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938048:0",
            "title": "VST: Record financials, major acquisitions, and long-term PPAs drive strong growth outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 results driven by strategic acquisitions, long-term nuclear PPAs, and robust demand growth. Strong cash generation and disciplined capital allocation position the company for continued growth, with significant opportunities from data center and hyperscaler demand.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938048:0-vst-record-financials-major-acquisitions-and-long-term-ppas-drive-strong-growth-outlook/",
            "pub_date": "2026-02-27 00:39:29",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938049:0",
            "title": "LLYVK: F1 and MotoGP posted record growth, strong financials, and expanded global reach",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delivered strong revenue and Adjusted OIBDA growth in both F1 and MotoGP, with record attendance, robust digital engagement, and successful new partnerships. Deleveraging continues, and new media rights deals and expanded event calendars position both segments for further growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938049:0-llyvk-f1-and-motogp-posted-record-growth-strong-financials-and-expanded-global-reach/",
            "pub_date": "2026-02-27 00:39:32",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938050:0",
            "title": "GPRK: Strong 2025 results, portfolio transformation, and disciplined growth outlook despite market headwinds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 saw operational and financial outperformance, with production and EBITDA above guidance despite lower oil prices. Transformative acquisitions in Colombia and Argentina set the stage for significant growth, while cost discipline and hedging support resilience.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938050:0-gprk-strong-2025-results-portfolio-transformation-and-disciplined-growth-outlook-despite-market-headwinds/",
            "pub_date": "2026-02-27 00:39:32",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM11G:0",
            "title": "Vance visits competitive Wisconsin district to sell Trump's economic vision",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Nandita Bose</span></p><p class=\"\"><span>    U.S. Vice President JD Vance traveled on Thursday to a competitive district in Wisconsin, as the White House steps up efforts to protect the narrow Republican majority in the House of Representatives ahead of November's midterm elections.</span></p><p class=\"\"><span>Vance will visit Plover, part of Wisconsin's third congressional district, represented by Republican Derrick Van Orden. It's one of two Republican-held seats in the state that Democrats are targeting this cycle.</span></p><p class=\"\"><span>The vice president is set to tour a manufacturing facility to underscore President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> economic message following his State of the Union address on Tuesday. </span></p><p class=\"\"><span>During that speech, Trump promoted his efforts on a sweep of kitchen-table economic issues - housing, healthcare and utility bills - but he stopped short of acknowledging that many Americans are still struggling with the high cost of food and housing.</span></p><p class=\"\"><span>Some Republican Party strategists have warned that, without a more emphatic message on inflation, Republicans are at risk of losing control of Congress in the November election.</span></p><p class=\"\"><span>Vance's trip is part of a White House push to showcase the president and top administration officials in key battleground areas to highlight Trump's economic agenda. Later this week, the president is expected to visit Texas for an event focused on energy and the economy.</span></p><p class=\"\"><span>National Democrats said this week they are ramping up spending in the Wisconsin district, where Van Orden won re-election in 2024 by fewer than three percentage points.</span></p><p class=\"\"><span>Trump carried the district by seven points in 2024, part of a sweep of battleground states that propelled him to victory over Democrat Kamala Harris. The president endorsed Van Orden in the 2026 race 10 months ago.</span></p><p class=\"\"><span>The trip will mark Vance's second visit to the district. He traveled to La Crosse, Wisconsin, in August to promote Trump's tax and spending law.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM11G:0-vance-visits-competitive-wisconsin-district-to-sell-trump-s-economic-vision/",
            "pub_date": "2026-02-27 00:39:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1J4:0",
            "title": "EQT Says Co Exits Remaining Stake In Azelis Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>EQT AB </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQT EXITS REMAINING STAKE IN AZELIS GROUP</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EQT  - SALE RESULTED IN AGGREGATE GROSS PROCEEDS OF EUR 190 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1J4:0-eqt-says-co-exits-remaining-stake-in-azelis-group/",
            "pub_date": "2026-02-27 00:40:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EduBxhSQa:0",
            "title": "REG - Euronext Dublin - GEM Notice (EURONEXT DUBLIN) [89219]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89219</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EduBxhSQa:0-reg-euronext-dublin-gem-notice-euronext-dublin-89219/",
            "pub_date": "2026-02-27 00:40:24",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938005:0",
            "title": "MEG: Record revenue, EBITDA, and cash flow in 2025; strong 2026 outlook with resumed M&A",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 results with 19.3% revenue growth and 21.3% EBITDA growth, driven by strong organic performance and margin expansion. 2026 guidance targets up to $900M revenue and 15% EBITDA margin, with robust cash flow and resumed M&amp;A planned for the back half of the year.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938005:0-meg-record-revenue-ebitda-and-cash-flow-in-2025-strong-2026-outlook-with-resumed-m-a/",
            "pub_date": "2026-02-27 00:29:12",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938006:0",
            "title": "LNTH: 2026 revenue guidance set at $1.4–$1.45B, with new launches to drive growth from 2027",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Full-year 2025 revenue grew slightly to $1.546 billion, with strong Q4 results and key acquisitions expanding the radiodiagnostic portfolio. 2026 guidance anticipates $1.4–$1.45 billion in revenue, EPS of $5.00–$5.25, and major new product launches expected to drive growth from 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938006:0-lnth-2026-revenue-guidance-set-at-1-4-1-45b-with-new-launches-to-drive-growth-from-2027/",
            "pub_date": "2026-02-27 00:29:13",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1AR:0",
            "title": "Bayer AG - Radium-223 Dichloride Plus Enzalutamide Demonstrates Significant Overall Survival Benefit In Peace-3 Trial",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bayer AG </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>RADIUM-223 DICHLORIDE PLUS ENZALUTAMIDE DEMONSTRATES SIGNIFICANT OVERALL SURVIVAL BENEFIT IN PEACE-3 TRIAL IN PATIENTS WITH METASTATIC CASTRATION-RESISTANT PROSTATE CANCER WITH BONE METASTASES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1AR:0-bayer-ag-radium-223-dichloride-plus-enzalutamide-demonstrates-significant-overall-survival-benefit-in-peace-3-trial/",
            "pub_date": "2026-02-27 00:29:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM0YO:0",
            "title": "US bonds moderately higher on safe-haven buying fueled by Iran fears",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US-Iran talks in focus as war fears rise</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US initial jobless claims  rise in latest week, but better than expected</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Markets bracing for US seven-year note auction</span></li></ul></span></div><span><p class=\"\"><span>By Gertrude Chavez-Dreyfuss</span></p><p class=\"\"><span>    U.S. Treasury prices edged higher on Thursday on the back of some safe-haven bids as investors grew nervous about tensions involving Iran, also pricing in expectations that the Federal Reserve will hold interest rates steady at least for the first half of the year.</span></p><p class=\"\"><span>Iran and the United States are holding indirect talks in Geneva over their long-running nuclear dispute to avert a conflict after U.S. President Donald Trump ordered a huge military build-up in the region.</span></p><p class=\"\"><span>Iran, which says its nuclear program is peaceful, has agreed in principle to accept curbs to its nuclear activities in return for the lifting of sanctions but rejects tying the talks to other issues.</span></p><p class=\"\"><span>\"There's some fear here of what's going on with Iran,\" said Stan Shipley, fixed income strategist, at Evercore ISI in New York. \"The question is: are we going to war with Iran? So there's some flight to safety here.\"</span></p><p class=\"\"><span>At the same time, bond investors continued to factor in a more gradual pace of easing from the Federal Reserve in 2026 given the recent batch of data showing a steadier economy that will likely avoid recession this year and next.</span></p><p class=\"\"><span>Thursday's economic data supported that view. Initial claims for state unemployment benefits rose 4,000 to a seasonally adjusted 212,000 for the week ended February 21, data showed. Economists polled by Reuters had forecast 215,000 claims.</span></p><p class=\"\"><span>U.S. fed funds futures on Thursday priced in about 55 bps on easing this year, equivalent to about two rate cuts of 25 bps each, a scenario that has been in place since the start of the year. The first rate cut is not expected until July or September.</span></p><p class=\"\"><span>In late morning trading, the benchmark 10-year yield fell 3.2 basis points to 4.016% </span><span>, while 30-year yields slid 2.2 bps to 4.672% (US30YT=RR).</span></p><p class=\"\"><span>FLATTENING CURVE</span></p><p class=\"\"><span>On the front end of the curve, the two-year yield, which reflects rate expectations, was down 2.5 bps at 3.446% (US2YT=RR).</span></p><p class=\"\"><span>The yield curve was slightly flatter on the day, with the gap between two-year and 10-year yields slipping to 56 bps (US2US10=TWEB) from 57.9 bps late on Wednesday. It was last at 57.2 bps.</span></p><p class=\"\"><span>The curve has been flattening, a move in which short-term yields rise relative to longer-dated Treasuries, in 11 of the last 12 sessions. At one point, the 2/10 curve had been narrowing its gap for 10 consecutive sessions, the longest such stretch since November 2015.</span></p><p class=\"\"><span>Analysts attributed the flattening to expectations of fewer rate cuts and a January nonfarm payrolls report that showed an unexpected increase in new jobs.</span></p><p class=\"\"><span>Also on Thursday, the U.S. Treasury will auction $44 billion in seven-year notes and J.P. Morgan said the note could be difficult to absorb given the low level yields, suggesting this debt has become a little more expensive. Since the last auction, seven-year yields have declined by roughly more than 20  bps and now trading near their six-month lows. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM0YO:0-us-bonds-moderately-higher-on-safe-haven-buying-fueled-by-iran-fears/",
            "pub_date": "2026-02-27 00:29:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}