{
    "data": [
        {
            "id": "DJN_DN20250205008497:0",
            "title": "CRH to Sell Stake in SigmaRoc",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Nina Kienle</p><p class=\"\">CRH said it intends to sell its shares in U.K. building-material company SigmaRoc.</p><p class=\"\">The Irish building-materials supplier on Wednesday said it intends to sell up to 172 million shares via bookbuilding, representing approximately 15.4% of SigmaRoc's issued share capital.</p><p class=\"\">Following the transaction, CRH will exit its interest in SigmaRoc in full, the company said.</p><p class=\"\">The final number of shares to be sold, as well as the price, will be announced as soon as practical, CRH said.</p><p class=\"\">Write to Nina Kienle at nina.kienle@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008497:0/",
            "pub_date": "2025-02-06 01:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSrxx1Za:0",
            "title": "OneMain Financial: Do's and Don'ts of Buying a Car",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW YORK, NY / ACCESS Newswire / February 5, 2025 / <strong class=\"root-Tkn6WL2y\">NEW YORK, NY /</strong> <strong class=\"root-Tkn6WL2y\">ACCESS Newswire</strong> <strong class=\"root-Tkn6WL2y\">/ February 5, 2025 /</strong> Buying a car can be complicated because it requires a buyer to make several decisions, like which make and model to go with and choosing between dealer financing or a personal loan to buy a car. Although the car-buying process can be exciting, there are potential pitfalls that car buyers can sometimes fall into. Below is a list of dos and don'ts to simplify the car-buying experience.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What to do when buying a car</strong></p><p class=\"\">Potential car buyers can shop online, go to an auto dealership, or browse classified ads that list new and used vehicles. In every case, the following steps should be taken once a borrower finds a car they love.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Look up the book value</strong>: The sticker price on the car is not the book value of the vehicle. That can be found by researching vehicle valuation websites. Another number to look for is the fair market value, which may vary slightly from the book value. Either number can be the starting place for price negotiations.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Add up the cost of ownership:</strong> The cost of ownership comes after the car's initial purchase. It includes loan payments, interest, insurance, gas, maintenance, and other miscellaneous expenses. Affordability is determined by this cost, not whether the buyer can come up with a down payment on the purchase date.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Get pre-approved before going to the dealership:</strong> Pre-approval from a bank or online lender gives the buyer a better understanding of their budget and prevents them from falling in love with a car that is out of their price range. It can also give the buyer negotiating power at the dealership. With a set interest rate and loan amount, the buyer can negotiate a better price for the vehicle.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Always test-drive the vehicle:</strong> A potential car buyer should never purchase a vehicle without test-driving it first. It's best to bring a mechanic along to evaluate the car on the spot. If that's not possible, the buyer should use their best instincts and take the vehicle in for a full mechanical checkup within a few days after purchasing.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Be prepared to walk away</strong>: Auto dealerships are notorious for hiring high-pressure salespeople to close deals. A buyer should be prepared to walk away if the deal doesn't seem right or doesn't fall in line with their budget.</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">What not to do when buying a car</strong></p><p class=\"\">The \"don'ts\" of car buying occur primarily in the negotiation stage. The following actions should be avoided if the buyer wants the best price on a new or used vehicle.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't buy based on price alone</strong>: There's an old saying about getting what you pay for. Paying a little more for a better-quality vehicle is better than getting stuck with a lemon because the \"price was right.\"</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't give up your leverage during negotiations</strong>: A buyer should never tell a car salesperson what's in their budget or how much they want their monthly payment to be. That's giving up leverage during the negotiation process.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Don't agree to buy before all questions have been answered: It's best not to leave anything unsaid during the negotiation phase. Ask every relevant question, and don't sign the purchase agreement until all of them have been answered.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\">Don't go over budget:</strong> Buyers should never stretch their budget too far when buying a car. Not being able to afford the monthly car payments will create financial challenges in other areas. It's best to stick with what they can reasonably afford.</p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Don't rely only on dealer financing: Several financing options exist for buying a car. Dealer financing is only one of them. A loan from a lender other than the dealership might have better terms and a lower interest rate. So, shopping around before making the final decision is more beneficial.</p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Bottom Line</strong></p><p class=\"\">Always know the value of the vehicle being bought and how much it will cost to own. Test drive the vehicle before buying it and be prepared to walk away if the deal doesn't feel right. Don't buy based on price. Don't give up leverage in negotiations. Don't agree to buy a car when there are unanswered questions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sources:</strong></p><p class=\"\">https://www.gobankingrates.com/saving-money/car/biggest-dos-donts-when-buying-first-car/</p><p class=\"\">https://cars.usnews.com/cars-trucks/advice/dos-and-donts-of-car-buying</p><p class=\"\">https://www.consumerreports.org/buying-a-car/dos-and-donts-when-buying-a-car-from-a-dealer-a5825423505/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SPONSORED CONTENT</strong></p><p class=\"\">About OneMain Financial</p><p class=\"\">View Website</p><p class=\"\">OneMain Financial is the leader in offering nonprime customers responsible access to credit and is dedicated to improving the financial well-being of hardworking Americans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CONTACT:</strong></p><p class=\"\">Sonakshi Murze</p><p class=\"\">Manager</p><p class=\"\">sonakshi.murze@iquanti.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> OneMain Financial</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSrxx1Za:0/",
            "pub_date": "2025-02-06 01:04:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310307:0",
            "title": "SOL Global Receives Second Advance Under $4 Million Debenture Unit Financing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SOL Global Investments (SOL.CN) on Wednesday said it received the second advance in full, under its previously closed fully subscribed $4-million private placement offering of units announced on Jan. 21. </p><p class=\"\">Subscribers under the offering had agreed to buy $4 million of units under their subscription agreements, in four equal advances of $1 million each, with the third and fourth advances expected to be advanced to the company on Feb. 18, and March 4, respectively. </p><p class=\"\">Each unit consists of one $1,000 principal amount unsecured convertible debenture, and 1,818 share purchase warrants. </p><p class=\"\">SOL Global intends to use 75% of proceeds to buy Solana Tokens at prevailing market prices through reputable cryptocurrency exchanges and the remaining proceeds for working capital and general corporate purposes. </p><p class=\"\">Shares of the company were last seen down $0.025, or 7%, at $0.32 on the Canadian Securities Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310307:0/",
            "pub_date": "2025-02-06 01:04:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446800:0",
            "title": "European Stocks Rise on Earning Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">European markets reversed losses to close higher on Wednesday, driven by strong earnings across various sectors.</p><p class=\"\">The Stoxx 50 rose 0.1%, while the broader Stoxx 600 gained 0.4%.</p><p class=\"\">Traders assessed earnings reports from companies like Handelsbanken, AkzoNobel, and Credit Agricole.</p><p class=\"\">Banco Santander led the Stoxx 600 with a 7% gain after posting record quarterly profits.</p><p class=\"\">Pharmaceutical giant GSK climbed 6% after raising its long-term sales forecast and reporting higher full-year core operating profits.</p><p class=\"\">Denmark’s Novo Nordisk rose nearly 3% after exceeding fourth-quarter profit estimates, fueled by strong demand for its obesity drugs.</p><p class=\"\">French oil major TotalEnergies also outperformed expectations, despite a 21% drop in full-year adjusted net income, with shares up 1.7%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446800:0-european-stocks-rise-on-earning-reports/",
            "pub_date": "2025-02-06 01:04:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSBMnFYa:0",
            "title": "Nexscient(R) Signs LOI for Acquisition of Generative AI Application",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">AI-Powered Media Toolkit for Content Creation</strong></em></p><p class=\"\">LOS ANGELES, CA / ACCESS Newswire / February 5, 2025 / Nexscient, Inc. (OTCQB:NXNT), a leading innovator in artificial intelligence (\"AI\") applications and intelligent enterprise solutions, today announced the signing of a non-binding Letter of Intent (\"LOI\") to acquire AI Media Toolkit, a software application that offers seamless access to a consolidated array of Generative AI (\"GenAI\") tools.</p><p class=\"\">Facilitated by its NXNT Labs division, Nexscient plans to incorporate AI Media Toolkit into a Software-as-a-Service (\"SaaS\") platform that will offer clients a flexible subscription service to a unified suite of GenAI tools. The SaaS platform expects to deliver a simplified user experience, allowing subscribers to access advanced GenAI capabilities, such as text generation, image creation, video synthesis, and audio production, all through an intuitive interface. This approach eliminates the need for expensive infrastructure or extensive technical expertise, enabling organizations to quickly integrate AI-driven solutions into their workflows. Additionally, the subscription model will offer businesses the ability to scale their usage based on demand, making it a cost-effective solution for enterprises navigating the dynamic landscape of content creation.</p><p class=\"\">\"The addition of AI Media Toolkit to our portfolio marks a significant milestone in our mission to revolutionize enterprise solutions with cutting-edge artificial intelligence,\" stated Fred E. Tannous, CEO of Nexscient, Inc. \"As the demand for GenAI tools continues to grow, this strategic move positions Nexscient as a key player in enabling businesses to harness the power of AI for seamless, efficient, and innovative content creation. We are excited about the opportunities this acquisition will bring, not only for our company but also for the industries we serve.\"</p><p class=\"\">The demand for AI-powered content creation tools has surged in recent years, driven by the rapid expansion of digital media, e-commerce, and personalized marketing. According to a research report published by Custom Market Insights, the Global AI Powered Content Creation Market was valued at $2.3 Billion in 2024 and is expected to reach $7.9 Billion by 2033, growing at a Compounded Annual Growth Rate (\"CAGR\") of 7.7% during the forecast period, reflecting the growing reliance on advanced technologies to meet the needs of a dynamic and competitive digital landscape. Businesses are increasingly seeking scalable, cost-effective solutions to generate high-quality content for social media, websites, advertising campaigns, and customer engagement.</p><p class=\"\">By offering the AI Media Toolkit as a unified subscription service, Nexscient is not only simplifying access to cutting-edge AI tools but also building a recurring revenue stream that supports the company's long-term growth strategy. This move further underscores Nexscient's dedication to democratizing AI technologies and empowering enterprises to achieve greater creativity, efficiency, and scalability in their content creation processes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nexscient, Inc.</strong></p><p class=\"\">Nexscient® is an emerging-growth company that's building a collaborative network of intelligent enterprise applications and technologies through internal development, synergistic acquisitions, and capital investments in companies involved in machine learning, artificial intelligence, and the Industrial Internet of Things technologies. Our flagship product, AegisOne, introduces a subscription-based, Software-as-a-Service platform that incorporates innovative technologies to offer intelligent enterprise solutions for businesses across several industries. As part of our growth strategy, we also seek to acquire and integrate synergistic companies and technologies into our collaborative network, further expanding our service offerings while enhancing shareholder value. For more information, please visit https://nexscient.ai.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This release contains statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements appear in a number of places in this release and include all statements that are not statements of historical fact regarding the intent, belief or current expectations of Nexscient, Inc., its directors or its officers with respect to, among other things: (i) financing plans; (ii) trends affecting its financial condition or results of operations; (iii) growth strategy and operating strategy; and (iv) performance of our products and services. You can identify these statements by the use of the words \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"plans,\" \"expects,\" \"anticipates,\" \"continue,\" \"estimate,\" \"project,\" \"intend,\" \"likely,\" \"forecast,\" \"probable,\" \"potential,\" and similar expressions and variations thereof are intended to identify forward-looking statements. Investors are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, many of which are beyond Nexscient, Inc.'s ability to control, and actual results may differ materially from those projected in the forward-looking statements as a result of various factors. These risks and uncertainties also include such additional risk factors as are discussed in the Company's filings with the U.S. Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended June 30, 2024, Forms 10-Q and 8-K, and in other filings we make with the Securities and Exchange Commission from time to time. These documents are available on the SEC Filings section of the Investor Relations section of our website at https://nexscient.ai. The Company cautions readers not to place undue reliance upon any such forward-looking statements, which speak only as of the date made. The Company undertakes no obligation to update any forward-looking statement to reflect events or circumstances after the date on which such statement is made.</p><p class=\"\">#######</p><p class=\"\">COMPANY CONTACT:</p><p class=\"\">Investor Relations</p><p class=\"\">ir@nexscient.com</p><p class=\"\">(800) 785-6070</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Nexscient, Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSBMnFYa:0/",
            "pub_date": "2025-02-06 01:04:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSK0Cvka:0",
            "title": "St. George's University Announces New Admissions Partnership with McMaster University's W Booth School",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TRUE BLUE, GRENADA AND HAMILTON, ON / ACCESS Newswire / February 5, 2025 / St. George's University (SGU) has launched a new admissions partnership with the W Booth School in the Faculty of Engineering at McMaster University. This partnership will grant qualified BTech Biotechnology students fast-track admission into the St. George's University School of Medicine.</p><p class=\"\">\"St. George's University is delighted to offer this new opportunity for aspiring doctors from the W Booth School to pursue degrees in medicine with us,\" said Dr. Marios Loukas, Dean of St. George's University School of Medicine. \"SGU is tremendously proud to partner with the W Booth School to create more avenues for qualified Canadian students to become practicing physicians while helping to address Canada's ongoing physician shortage.\"</p><p class=\"\">The partnership creates a BTech in Biotechnology to Doctor of Medicine pathway that provides students who have successfully completed the Bachelor of Technology in Biotechnology at the W Booth School and meet the requirements for entry with admission to the four-year MD program at SGU. Booth students interested in pursuing the pathway must maintain a strong overall GPA and a strong GPA in prerequisite coursework.</p><p class=\"\">Qualified students will be eligible to complete the basic sciences component of the SGU MD program in either two years of study in Grenada or one year at Northumbria University in the United Kingdom and one year in Grenada. Students' clinical rotations will take place with SGU's affiliate network of more than 75 hospitals and health systems in the United States, Canada, and the United Kingdom offering clinical and ambulatory training.</p><p class=\"\">\"This opportunity significantly broadens the academic and career horizons for our BTech-Biotechnology graduates, offering invaluable global experience,\" says Heather Sheardown, Dean of Engineering at McMaster. \"We eagerly anticipate our first alumni embarking on this journey, gaining the academic and practical expertise needed to make meaningful contributions to healthcare.\"</p><p class=\"\">BTech Biotechnology students who are accepted into the pathway with a sufficiently high overall GPA and sciences GPA will be awarded a scholarship of US $85,000 at SGU School of Medicine. Students will also be eligible to be considered for all of SGU's School of Medicine scholarships. SGU granted more than US $71 million in scholarships in the 2023-2024 academic year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About St. George's University</strong></p><p class=\"\">St. George's University is a center of international education, drawing students and faculty from 140 countries to the island of Grenada, in the West Indies, to its programs in medicine, veterinary medicine, public health, science, and business. SGU is affiliated with educational institutions worldwide, including the United States, the United Kingdom, Canada, Australia, Ireland, and the Netherlands. The University's over 28,000 graduates include physicians, veterinarians, scientists, and public health and business professionals across the world. St. George's University School of Medicine is accredited by the Grenada Medical and Dental Council, which has been recognized by the World Federation for Medical Education (WFME). For more information, visit www.sgu.edu.</p><p class=\"\">About McMaster University — Faculty of Engineering</p><p class=\"\">The Faculty of Engineering plays a key role in helping McMaster University earn its reputation as one of Canada's most innovative and research-intensive universities. McMaster Engineering has a reputation for groundbreaking programs and research, leading faculty and aspiring students. It attracts around $44 million in annual research funding in more than 20 research centres, institutes, and networks whose interdisciplinary pursuits cross departmental and Faculty boundaries. Outside the university, the Faculty of Engineering collaborates with partners in universities, government and more than 130 companies in Canada and abroad.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact (SGU):</strong></p><p class=\"\">Evan Cobb</p><p class=\"\">ecobb@sgu.edu</p><p class=\"\">(203) 606-3127</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact (W Booth School):</strong></p><p class=\"\">Keiko Kataoka</p><p class=\"\">kataokak@mcmaster.ca</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> St. George's University</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSK0Cvka:0/",
            "pub_date": "2025-02-06 01:04:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008561:0",
            "title": "Stockholm Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX Stockholm 30 Index      2,629.11      -9.36      -0.35 <br/>  Index Components <br/>  ABB                           591.40      -5.80      -0.97 <br/>  Alfa Laval                    473.60     -14.20      -2.91 <br/>  Assa Abloy Series B           329.50      -4.10      -1.23 <br/>  AstraZeneca                 1,524.50      +2.50      +0.16 <br/>  Atlas Copco A                 184.80      -0.40      -0.22 <br/>  Atlas Copco Series B          163.05      -0.90      -0.55 <br/>  Boliden                       333.20      -1.30      -0.39 <br/>  Electrolux Series B            95.72      -1.02      -1.05 <br/>  Ericsson B                     82.94      -0.28      -0.34 <br/>  Essity Series B               275.40      -0.40      -0.15 <br/>  Evolution Gaming Group        829.40     -12.60      -1.50 <br/>  Getinge Series B              215.20      +0.70      +0.33 <br/>  H&amp;M Hennes &amp; Mauritz B        148.00      -0.30      -0.20 <br/>  Hexagon Series B              126.50      -2.85      -2.20 <br/>  Investor Series B             308.65      +1.95      +0.64 <br/>  Kinnevik Series B              89.91      +2.43      +2.78 <br/>  Nibe Industrier Series B       43.61      +0.12      +0.28 <br/>  Nordea Bank                   127.70      -0.85      -0.66 <br/>  Saab AB Series B              238.30      +0.65      +0.27 <br/>  Samhaellsbyggnadsbolaget        5.52      +0.09      +1.73 <br/>  Sandvik                       223.60      -3.00      -1.32 <br/>  Sinch                          24.14      +0.55      +2.33 <br/>  Skandinaviska Enskilda A      156.00      +0.05      +0.03 <br/>  SKF Series B                  214.10      -4.30      -1.97 <br/>  Svenska Cellulosa Ser B       151.60      -0.40      -0.26 <br/>  Svenska Handelsbnkn Ser A     123.90      +2.00      +1.64 <br/>  Swedbank Series A             241.20      +1.40      +0.58 <br/>  Tele2 Series B                122.85      +1.30      +1.07 <br/>  Telia                          33.55      +0.77      +2.35 <br/>  Volvo Series B                305.20      -1.90      -0.62 <br/>Prices in Swedish Krona <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008561:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008557:0",
            "title": "Oslo Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Oslo Stock Exch Equity      1,415.16      -6.87      -0.48 <br/>  Index Components <br/>  Norsk Hydro                    66.10      -0.28      -0.42 <br/>  Tomra Systems                 165.90      +1.30      +0.79 <br/>  Storebrand                    131.80      -0.90      -0.68 <br/>  DnB Bank                      243.00      +2.80      +1.17 <br/>  Kongsberg Gruppen           1,310.00     -16.00      -1.21 <br/>  Nordic Semiconductor          136.10     +23.75     +21.14 <br/>  Subsea 7                      187.90      +0.30      +0.16 <br/>  Mowi                          217.50      -1.70      -0.78 <br/>  Frontline                     206.00      -3.60      -1.72 <br/>  Orkla                         102.60      -0.10      -0.10 <br/>  TGS                           111.00      -0.80      -0.72 <br/>  Telenor                       138.40      -0.50      -0.36 <br/>  Equinor                       266.35     -11.45      -4.12 <br/>  Norwegian Air Shuttle          10.40      -0.19      -1.79 <br/>  Yara International            335.10      -1.50      -0.45 <br/>  Aker BP                       245.00      +4.20      +1.74 <br/>  SalMar                        572.00      +1.00      +0.18 <br/>  Wallenius Wilhelmsen           90.40      -1.00      -1.09 <br/>  Gjensidige Forsikring         232.00      -2.40      -1.02 <br/>  BW LPG                        147.50      +1.40      +0.96 <br/>  MPC Container Ships            18.48      -0.37      -1.96 <br/>  Hafnia                         60.75      -1.50      -2.41 <br/>  Hoegh Autoliners              102.70      -1.80      -1.72 <br/>  Var Energi                     34.57      -0.40      -1.14 <br/>  Golden Ocean Group            105.00      -1.25      -1.18 <br/>Prices in Krone <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008557:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008555:0",
            "title": "Madrid Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  Banco Santander               110,472,696         5.40        +0.41        +8.29 <br/>  Urbas Grupo Financiero         31,229,000         0.00         unch         unch <br/>  Banco de Sabadell              13,870,091         2.28        +0.01        +0.26 <br/>  Unicaja Banco                   8,231,304         1.46        +0.01        +0.97 <br/>  Amper                           7,474,577         0.13        +0.00        +1.75 <br/>  CaixaBank                       7,192,154         5.90        -0.04        -0.71 <br/>  Intl Consld Airlines Grp        7,150,331         4.22        +0.04        +1.00 <br/>  BBVA                            6,888,527        11.03        +0.03        +0.27 <br/>  Telefonica                      6,458,427         3.98        +0.06        +1.48 <br/>  Iberdrola                       5,334,011        13.78        +0.09        +0.62 <br/>  Obrascon Huarte Lain            4,957,602         0.36        +0.00        +0.44 <br/>  Repsol                          3,119,539        11.45        -0.04        -0.30 <br/>  Mapfre                          2,226,502         2.71        +0.04        +1.50 <br/>  Nyesa Valores                   2,215,900         0.01         0.00        -3.45 <br/>  Grifols                         1,941,837         8.28        +0.16        +1.95 <br/>  Sacyr                           1,924,306         3.19        -0.04        -1.12 <br/>  Bankinter                       1,790,937         8.16        -0.02        -0.29 <br/>  Industria Diseno Textil         1,625,178        52.16        -0.18        -0.34 <br/>  Indra Sistemas                  1,417,448        16.60        -0.25        -1.48 <br/>  Redeia                          1,215,238        16.63        +0.18        +1.09 <br/>  Enagas                          1,071,108        12.24        -0.06        -0.49 <br/>  Solaria Energia y Medio         1,019,344         7.79        +0.05        +0.65 <br/>  Endesa                            994,925        22.01        +0.22        +1.01 <br/>  Airtificial Intelligence          993,917         0.11        +0.00        +0.38 <br/>  Tubos Reunidos                    987,802         0.56         unch         unch <br/>  Cellnex Telecom                   865,109        32.50        +0.53        +1.66 <br/>  Acerinox                          741,364         9.90        +0.09        +0.92 <br/>  Prosegur Cash                     707,678         0.58        +0.01        +1.21 <br/>  Ferrovial                         688,381        40.76        -0.06        -0.15 <br/>  Tubacex                           569,576         3.60        +0.02        +0.42 <br/>  Grupo Ezentis                     532,405         0.10         0.00        -1.04 <br/>  ENCE Energia y Celulosa           515,697         3.49        -0.03        -0.91 <br/>  Gestamp Automocion                477,803         2.59        -0.03        -1.15 <br/>  Tecnicas Reunidas                 477,406        14.75        +0.78        +5.58 <br/>  Amadeus IT Group                  425,192        72.00        +0.60        +0.84 <br/>  Linea Directa Aseguradora         372,468         1.24        +0.02        +1.80 <br/>  Acciona Energias Renovbl          334,258        18.26        +0.37        +2.07 <br/>  Nueva Expresion Textil            329,852         0.37        -0.01        -1.34 <br/>  Fluidra                           308,058        23.28        -0.36        -1.52 <br/>  Faes Farma                        264,028         3.57        +0.01        +0.42 <br/>  Melia Hotels Intl                 257,412         7.18        -0.13        -1.78 <br/>  Puig Brands                       252,147        18.31        +0.01        +0.05 <br/>  Talgo                             248,492         3.91        -0.04        -1.01 <br/>  ACS Activ Construccion            213,526        48.94        -0.12        -0.24 <br/>  Logista Integral                  206,660        29.46        +0.20        +0.68 <br/>  Naturgy Energy Group              196,152        24.48        -0.20        -0.81 <br/>  Deoleo                            186,598         0.19        +0.00        +0.78 <br/>  Atresmedia                        176,556         4.51        +0.00        +0.11 <br/>  Audax Renovables                  167,530         1.51        -0.01        -0.53 <br/>  ArcelorMittal                     167,479        24.37        +0.16        +0.66 <br/>Prices in Euros <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008555:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008554:0",
            "title": "Madrid Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  IBEX 35 Index              12,536.70    +163.90      +1.32 <br/>  Index Components <br/>  Acciona                       109.80      +1.30      +1.20 <br/>  Acciona Energias Renovbl       18.26      +0.37      +2.07 <br/>  Acerinox                        9.90      +0.09      +0.92 <br/>  ACS Activ Construccion         48.94      -0.12      -0.24 <br/>  Aena SME                      212.00      +3.40      +1.63 <br/>  Amadeus IT Group               72.00      +0.60      +0.84 <br/>  ArcelorMittal                  24.37      +0.16      +0.66 <br/>  Banco de Sabadell               2.28      +0.01      +0.26 <br/>  Banco Santander                 5.40      +0.41      +8.29 <br/>  Bankinter                       8.16      -0.02      -0.29 <br/>  BBVA                           11.03      +0.03      +0.27 <br/>  CaixaBank                       5.90      -0.04      -0.71 <br/>  Cellnex Telecom                32.50      +0.53      +1.66 <br/>  Enagas                         12.24      -0.06      -0.49 <br/>  Endesa                         22.01      +0.22      +1.01 <br/>  Ferrovial                      40.76      -0.06      -0.15 <br/>  Fluidra                        23.28      -0.36      -1.52 <br/>  Grifols                         8.28      +0.16      +1.95 <br/>  Iberdrola                      13.78      +0.09      +0.62 <br/>  Indra Sistemas                 16.60      -0.25      -1.48 <br/>  Industria Diseno Textil        52.16      -0.18      -0.34 <br/>  Inmobiliaria Colonial           5.47      +0.08      +1.39 <br/>  Intl Consld Airlines Grp        4.22      +0.04      +1.00 <br/>  Laboratorios Farma Rovi        65.70      +0.45      +0.69 <br/>  Logista Integral               29.46      +0.20      +0.68 <br/>  Mapfre                          2.71      +0.04      +1.50 <br/>  Merlin Properties SOCIMI       11.15      +0.20      +1.83 <br/>  Naturgy Energy Group           24.48      -0.20      -0.81 <br/>  Puig Brands                    18.31      +0.01      +0.05 <br/>  Redeia                         16.63      +0.18      +1.09 <br/>  Repsol                         11.45      -0.04      -0.30 <br/>  Sacyr                           3.19      -0.04      -1.12 <br/>  Solaria Energia y Medio         7.79      +0.05      +0.65 <br/>  Telefonica                      3.98      +0.06      +1.48 <br/>  Unicaja Banco                   1.46      +0.01      +0.97 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008554:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008550:0",
            "title": "ICE Canola Market Weakens at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WINNIPEG, Manitoba--The ICE Futures canola market was weaker at midday Wednesday, taking back Tuesday's gains as losses in outside markets weighed on values.</p><p class=\"\">Sharp declines in crude oil spilled into world vegetable oil markets on Wednesday, with Chicago soyoil, European rapeseed and Malaysian palm oil all lower.</p><p class=\"\">The temporary pause on tariff threats from the United States remained somewhat supportive, although the likelihood of continued chaos from the Trump administration kept some caution in all markets.</p><p class=\"\">Solid end user demand and tightening supply projections provided underlying support for canola, with values also holding above most major moving averages from a chart standpoint.</p><p class=\"\">An estimated 19,500 canola contracts traded as of 11:53 ET.</p><p class=\"\">Prices in Canadian dollars per metric tonne at 11:53 ET:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>           Price      Change <br/>Mar       637.60     dn 9.60 <br/>May       645.50     dn 9.00 <br/>Jul       650.50     dn 8.60 <br/>Nov       636.30     dn 6.70 <br/> </pre><p class=\"\">Source: Commodity News Service Canada, news@marketsfarm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008550:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008553:0",
            "title": "Helsinki Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX Helsinki 25 Index       4,521.15     +10.83      +0.24 <br/>  Index Components <br/>  Huhtamaki                      34.70      -0.46      -1.31 <br/>  Kesko Series B                 17.44      -1.00      -5.42 <br/>  Kone B                         49.43      +0.39      +0.80 <br/>  Metsa Board Series B            4.55      -0.08      -1.73 <br/>  Wartsila                       19.29      +1.36      +7.59 <br/>  Nokia                           4.58      +0.07      +1.55 <br/>  Sampo Series A                 39.36       unch       unch <br/>  TietoEVRY                      18.42      +0.02      +0.11 <br/>  Kemira Oyj                     21.06      -0.12      -0.57 <br/>  Nokian Renkaat                  6.22      -0.62      -9.04 <br/>  Konecranes                     58.35      -0.15      -0.26 <br/>  UPM-Kymmene                    27.40      -0.54      -1.93 <br/>  Outokumpu Oyj                   3.08      -0.01      -0.29 <br/>  Stora Enso R                   10.40      -0.16      -1.52 <br/>  Fortum                         14.06      +0.15      +1.04 <br/>  Elisa                          42.44      +0.88      +2.12 <br/>  Nordea Bank                    11.26      -0.04      -0.31 <br/>  Neste                          11.75      -0.16      -1.34 <br/>  Cargotec                       47.25      -0.12      -0.25 <br/>  Orion Series B                 52.28      +0.62      +1.20 <br/>  Metso                           9.24      -0.15      -1.56 <br/>  Valmet                         25.96      +0.13      +0.50 <br/>  QT Group                       80.00      +0.95      +1.20 <br/>  Kojamo                         10.01      +0.18      +1.83 <br/>  Mandatum                        4.75      +0.03      +0.68 <br/>Prices in Euro <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008553:0/",
            "pub_date": "2025-02-06 01:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE1dm5n:0",
            "title": "From Emerging Markets to Heritage Architecture, the Christie’s International Real Estate Global Luxury Forecast Reveals Themes Shaping Luxury Real Estate in 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Annual report features insight and predictions from Christie’s International Real Estate affiliates around the world</p><p class=\"\">CHICAGO, Feb.  05, 2025  (GLOBE NEWSWIRE) — 2025 will bring a shift toward heritage architectural styles, a heightened interest in security and privacy, and a spotlight on up-and-coming markets including Madrid and the Balkans, according to the Christie’s International Real Estate 2025 Global Luxury Forecast.  </p><p class=\"\">Unveiled today, the annual report examines key trends and factors shaping the global luxury real estate market, with insights from broker-owners and leading agents within the network of more than 100 independent brokerage firms around the world.   </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Headlines from the 2025 forecast include:</strong> </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A growing emphasis on home security:</strong> Home security is of growing importance in the luxury market, and homeowners are adding both high-tech and analog amenities like intelligent camera systems, radar systems for waterfront homes, ballistic entry doors, biometrics and private neighborhood security details. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A move toward “heritage architecture”:</strong> Today’s high-net-worth buyers are expressing a renewed preference for architectural styles that reflect the history and natural qualities of their surroundings versus modern forms that have dominated new-home construction over the past decade plus. Examples include rustic homes in mountainous regions in the U.S., and Victorian and Regency designs in the U.K.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The impact of a changing climate:</strong> Well before the outbreak of the devastating Los Angeles wildfires, brokers and agents had identified climate-related events as having a major impact on the luxury market in 2025. Brokerage affiliates in San Francisco, Dubai, Naples, Fla., and Geneva, Switzerland, share how climate issues are affecting homebuying, and the ways governments and builders are planning for the future. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2025’s hottest trends and amenities: </strong>Around the world, infrared saunas, car showrooms, and toy barns are set to top the list of must-have amenities for luxury homes in the coming year. In addition, biophilic design is becoming more sought after as HNWIs focus on environmental impact and healthy living.  </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Emerging luxury markets:</strong> Madrid, Perth, the Balkan nations of Albania and Bulgaria, and Monmouth County, New Jersey make the list of 2025’s up-and-coming markets to watch, enticing luxury home buyers and investors with local incentives, relative value, and strong potential for appreciation and return on investment.   </p><p class=\"\">The report also takes a look at the Christie’s International Real Estate network’s most significant home sales in 2024 and the market trends they underscore. These include the sale of a record-breaking $152 million private island in Palm Beach, Fla., a $36 million countryside estate in England, and a $90 million Los Angeles mansion purchased with Bitcoin.  </p><p class=\"\">“Global luxury real estate is thriving, and always evolving,” said Thad Wong, co-CEO of Christie’s International Real Estate. “We hope that these insights, shared by the experts who know their markets inside and out and are able to spot trends early will empower buyers and sellers to make confident, well-informed decisions in today’s market and beyond.” </p><p class=\"\">Findings in the Christie’s International Real Estate 2025 Global Luxury Forecast are based on a survey of independent Christie’s International Real Estate affiliates across North America, the Caribbean, Europe, the Middle East, Africa and Asia. </p><p class=\"\">### </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Christie’s International Real Estate</strong>  </p><p class=\"\">Christie’s International Real Estate has successfully marketed high-value real estate around the world for more than 30 years. Through its invitation-only Affiliate network spanning nearly 50 countries and territories, Christie’s International Real Estate offers incomparable services to a global clientele at the luxury end of the residential property market. For more information, please visit christiesrealestate.com.  </p><p class=\"\">Christie’s International Real Estate operates as a distinct luxury brand under the ownership of Compass , the largest residential real estate brokerage in the United States by sales volume. Founded in 2012 and based in New York City, Compass provides an end-to-end platform that empowers residential real estate agents to deliver exceptional service to seller and buyer clients. For more information, please visit www.compass.com. </p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">1041 Lakeshore Boulevard, Lake Tahoe, Nevada      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE1dm5n:0-from-emerging-markets-to-heritage-architecture-the-christie-s-international-real-estate-global-luxury-forecast-reveals-themes-shaping-luxury-real-estate-in-2025/",
            "pub_date": "2025-02-06 01:05:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310286:0",
            "title": "Update: FirstService Down 4% as Q4 Earnings Miss Estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates shares.)</p><p class=\"\">FirstService  share were last seen down lost 4.3% after the company on Wednesday reported fourth-quarter results that missed analysts' forecasts. </p><p class=\"\">The company booked adjusted earnings of US$1.34 per share, below the FactSet projection of US$1.37 per share but higher than US$1.11 per share reported a year ago. </p><p class=\"\">FirstService's GAAP EPS stood at US$0.71, missing the FactSet estimate of US$0.89 but an increase from US$0.14 posted in the previous year. </p><p class=\"\">Revenue rose to US$1.37 billion in the three months ended Dec. 31 from $1.08 billion in the same quarter of the previous year. Adjusted EBITDA increased to US$137.9 million from US$103.3 million. </p><p class=\"\">\"Our teams were focused on driving healthy profitable growth which is reflected in the strong top-line and improved margins year,\" CEO Scott Patterson said. \"This momentum and continued operational execution reinforces our expectations for a strong 2025.\"</p><p class=\"\">The company's shares were last seen down $11.23 to $249.34 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310286:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008386:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1159 ET - The threat of U.S. tariffs on imports from its northern neighbor brought out waves of calls on social media for Canadians to buy local products in place of American goods. Canada's largest private sector union wants to go further, and has written to the country's largest grocery chains urging them to buy Canadian. Unifor in a letter to the CEOs of Empire, Loblaw and Metro encouraged them to prioritize Canadian products in response to President Trump's threatened levies. It also wants grocers to make it easier for consumers to prioritize Canadian items on their shelves, supporting domestic industries and jobs. \"Canadian workers and their families are ready to defend against the Trump tariff threat and we need Canadian grocers to do their part,\" says Unifor national President Lana Payne. (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">1156 ET - Stanley Black &amp; Decker had a mixed quarter in which a big tax benefit drove its earnings beat, Edward Jones analyst Faisal Hersi says in a research note. Organic revenue was higher than anticipated, which was a nice surprise, but operating profitability fell short of expectations, even as it improved sequentially due to the company's cost-cutting efforts and improving supply-chain expenses, Hersi says. The tool market is still choppy and do-it-yourself work remains weak, while professional demand is solid, the analyst says. He expects mixed demand across the company's markets to persist near-term, though tools volume should keep recovering this year. Shares fall 2% to $84.97. (dean.seal@wsj.com)</p><p class=\"\">1153 ET - The market's stock reaction to PayPal earnings was overblown, especially considering underlying numbers such as transaction margin dollar growth, Bernstein analysts say in a research note. The digital-payments company also continued growing incrementality of many initiatives such as modern experiences, debit cards and Venmo. \"These initiatives, along with consumer habituation drivers such as debit cards, can support Branded volume growth in 2025,\" the analysts say. Overall, PayPal appears to be under more solid footing under the new management team, the analysts add, noting that they expect slightly more favorable risk-reward in the near-term. Shares rise 2.2% following a 13% drop on Tuesday. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">1149 ET - Finning International's answers to the threat of U.S. tariffs will be to reduce its cost profile. In an earnings call, executives said that its response to the near-term market environment of slower growth and higher uncertainty, \"we are focused on managing working capital levels and evaluating opportunities to create further sustainable cost efficiency.\" In particular, the focus will be to improve the cost-structure in Canada. And the company already has good model to follow: \"leveraging the structural changes and overhead reduction strategy demonstrated in our U.K. operations.\" (adriano.marchese@wsj.com)</p><p class=\"\">1139 ET - Griffon CEO Ronald Kramer says on a call with analysts that he's comfortable backing the company's 2025 outlook, calling the tariff situation extremely fluid. \"Similar to tariffs in 2018, we expect to mitigate the effects of changing tariff policy through a combination of price, supply renegotiations and further diversifying our global supply chain,\" he says. The company has \"significant amounts\" of product coming from China in its lawn and garden and Hunter Fan businesses, but those are the only area where tariffs could have an effect, Kramer adds. Shares rise 10% after reporting better-than-expected earnings in its fiscal 1Q. (connor.hart@wsj.com)</p><p class=\"\">1131 ET - Inflated cocoa costs melted into Mondelez International's earnings in 4Q, and they are likely too large to be fully offset by raising prices, Edward Jones analyst Brittany Quatrochi says. The snack maker's 2025 outlook was more disappointing than expected, with adjusted earnings per share set to fall 10%. Underlying sales growth remains solid across regions, despite cocoa prices pulling down operating income across the globe by 28%. Mondelez said in an earnings call it plans to raise prices, but low-cost distribution will be especially crucial for emerging international markets as the company generates about 70% of its sales outside of North America, Quatrochi says. Shares rise 1.7%. (katherine.hamilton@wsj.com)</p><p class=\"\">1124 ET - Mondelez International expects adjusted earnings per share to fall 10% in 2025 due to elevated cocoa costs, after the snack maker said operating income declined 28% in the fourth quarter primarily due to that inflation. If chocolate costs remain high, Mondelez plans to gradually increase prices in the second half of this year, especially in developed markets, but the company said consumer confidence is still rocky, which could pose challenges to its pricing plan. Chief financial officer Luca Zaramella said he expects earnings per share to grow again in 2026, either from price increases or cocoa costs normalizing. (katherine.hamilton@wsj.com)</p><p class=\"\">1120 ET - Harley-Davidson CEO Jochen Zeitz says the company's electric motorcycle spinoff \"needs to perform\" following another disappointing year. LiveWire sold 612 bikes in 2024, far below its expectation of up to 1,500 bikes, and lost $110 million. Its CEO, Karim Donnez, says the company is cutting costs and hopes to succeed in Europe with a new \"maxi-scooter.\" Harley owns nearly 90% of LiveWire, and some analysts say the spinoff's losses are dragging down Harley's financial results. Zeitz says while the slow adoption of EV vehicles has hurt LiveWire, \"we'll obviously have to look at some optionalities\" if results don't improve. (john.keilman@wsj.com)</p><p class=\"\">1112 ET - Home Depot and Lowe's might report a better 4Q than Wall Street expects given recent results from the home-improvement chains' suppliers, Stanley Black &amp; Decker, Sherwin-Williams and Scotts Miracle-Gro, Davidson analyst Michael Baker says in a research note. Stanley Black &amp; Decker reports 2% organic growth in tools and outdoor products, an improvement from the 4% decline last quarter and the best increase since 2Q of 2021, the analyst says. Sherwin-Williams' consumer brands business, which is Lowe's main paint supplier, was flat in North America instead of down in the high-single digit percentage range like the three prior quarters, he says. And Scotts Miracle-Gro showed an acceleration of its gains from the prior quarter, the analyst says. (dean.seal@wsj.com)</p><p class=\"\">1047 ET - Shares of grain merchant and oilseed processor Bunge were down about 6% after the company reported a lower quarterly profit that missed analyst expectations because of supply gluts for crops and the meal and oil they are processed into. Bunge CEO told analysts on a call that the future for the agriculture market is hard to predict given the Trump Administration's threats of trade wars and what will happen to the U.S.' biofuels policies that drive the industry. \"We definitely are in an environment has less visibility than the normal with the trade disruptions and some of the uncertainty around U.S. biofuels,\" Heckman said. He added that the company's proposed acquisition of rival trader Viterra will help it weather any trade fights by increasing the company's ability to source crops from around the world. (patrick.thomas@wsj.com)</p><p class=\"\">1029 ET - GSK has to prove its pipeline is packed with new blockbuster treatments to withstand investors' concerns over its vaccine business slowdown in China and the U.S., AJ Bell investment director Russ Mould says. Further worries over the likely appointment of vaccine-sceptic Robert F Kennedy Jr. as Secretary of Health and Human Services in the U.S. still linger, he says. The British pharma giant's posted a second consecutive drop in sales in the fourth quarter, driven by a 19% decline in sales of its flu shots and a 52% plunge for its respiratory treatment Arexvy. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p><p class=\"\">1025 ET - GSK's 2025 outlook is promising, fueled by the sales growth expectations for its specialty medicines, Quilter Cheviot healthcare analyst Sheena Berry says in a note. The British pharma giant's clinical results for its chronic-cough drug candidate and regulatory decisions on a potential comeback of its blood-disorder treatment Blenrep are crucial for the group's future trajectory, she says. Shares are up 6.7% at 14.73 pounds.(helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008386:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008384:0",
            "title": "Canadian Private-Sector Union Pushes Grocers to Prioritize Local Items — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The threat of U.S. tariffs on imports from its northern neighbor brought out waves of calls on social media for Canadians to buy local products in place of American goods. Canada's largest private sector union wants to go further, and has written to the country's largest grocery chains urging them to buy Canadian. Unifor in a letter to the CEOs of Empire, Loblaw and Metro encouraged them to prioritize Canadian products in response to President Trump's threatened levies. It also wants grocers to make it easier for consumers to prioritize Canadian items on their shelves, supporting domestic industries and jobs. \"Canadian workers and their families are ready to defend against the Trump tariff threat and we need Canadian grocers to do their part,\" says Unifor national President Lana Payne. (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008384:0/",
            "pub_date": "2025-02-06 00:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0ZQ:0",
            "title": "Wall Street mixed, Treasury yields slide amid mixed earnings, data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Alphabet earnings weigh on AI stocks</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Record U.S. imports widens trade gap, services weaken</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Wall Street struggled for direction and benchmark Treasury yields slid on Wednesday as disappointing earnings and mixed economic data counterbalanced easing jitters of a spreading global trade war.</p><p class=\"\">The S&amp;P 500 joined the tech-heavy Nasdaq in negative territory in the wake of disappointing earnings from Alphabet  fueled doubts about the payoff of investment in artificial intelligence. </p><p class=\"\">Simmering in the background are worries of escalating tit-for-tat tariff moves.</p><p class=\"\">\"We think the leaders of other countries don't really understand Trump's art of the deal,\" said Jay Hatfield, CEO and portfolio manager at InfraCap in New York. \"The threat of 25% was not meant to be the real tariff rate.\"</p><p class=\"\">\"We think the tariffs are quite bullish for the stock market,\" Hatfield added, saying that 5% or 10% tariffs across the board \"will fund a major corporate tax decrease.\" </p><p class=\"\">Markets appeared to look past President Donald Trump's eyebrow raising declaration that the United States would take over the Gaza Strip, a move underscored the likelihood of market volatility under the new administration.</p><p class=\"\">On the economic front, a stronger-than-expected ADP reading was offset by a surprise deceleration in the services sector, while record high imports pushed the U.S. trade deficit sharply wider.   </p><p class=\"\">        The Dow Jones Industrial Average  rose 71.80 points, or 0.16%, to 44,628.41, the S&amp;P 500  fell 0.02 points, or 0.00%, to 6,037.71 and the Nasdaq Composite  fell 42.30 points, or 0.21%, to 19,612.17.</p><p class=\"\">European stocks reversed an early selloff and were last higher, powered in part by healthcare stocks as Novo Nordisk's  blockbuster drug Wegovy sales more than doubled in the fourth quarter. </p><p class=\"\">        MSCI's gauge of stocks across the globe <!-- -->EURONEXT:IACWI<!-- --> rose 2.27 points, or 0.26%, to 869.19.</p><p class=\"\">The STOXX 600  index rose 0.36%, while Europe's broad FTSEurofirst 300 index (.FTEU3) rose 7.22 points, or 0.34% Emerging market stocks <!-- -->CBOE:EFS<!-- --> rose 3.55 points, or 0.32%, to 1,096.53. MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) closed higher by 0.45%, to 576.91, while Japan's Nikkei  rose 33.11 points, or 0.09%, to 38,831.48.</p><p class=\"\">U.S. Treasury yields dropped to their lowest level since mid-December in the wake of the disappointing services data, as investors continue to grapple with uncertainties arising from tariff skirmishes.</p><p class=\"\">        The yield on benchmark U.S. 10-year notes  fell 8.9 basis points to 4.424%, from 4.513% late on Tuesday. The 30-year bond (US30YT=RR) yield fell 9.2 basis points to 4.6556% from 4.748% late on Tuesday.</p><p class=\"\">The 2-year note (US2YT=RR) yield, which typically moves in step with interest rate expectations for the Federal Reserve, fell 4 basis points to 4.174%, from 4.214% late on Tuesday.</p><p class=\"\">The dollar softened as risk of a global trade war appeared to wane.</p><p class=\"\">The dollar index , which measures the greenback against a basket of currencies including the yen and the euro, fell 0.54% to 107.47, with the euro  up 0.37% at $1.0415. Against the Japanese yen , the dollar weakened 1.31% to 152.31.</p><p class=\"\">The Mexican peso &lt; MXN=&gt; weakened 0.53% versus the dollar at 20.621.</p><p class=\"\">The Canadian dollar  strengthened 0.21% versus the greenback to C$1.43 per dollar.</p><p class=\"\">        In cryptocurrencies, bitcoin  gained 1.24% to $97,701.41. Ethereum (ETH=) rose 4.32% to $2,754.13.</p><p class=\"\">Oil prices dropped as rising U.S. supply and worries of a new Sino-U.S. trade war overshadowed President Trump's renewed effort to eliminate Iranian oil exports.</p><p class=\"\">U.S. crude  fell 2.19% to $71.13 a barrel and Brent  fell to $74.68 per barrel, down 1.99% on the day.</p><p class=\"\">Gold resumed its rally as trade war jitters continue to attract investors to the safe-haven metal, sending it to fresh record highs.</p><p class=\"\">Spot gold  rose 0.97% to $2,869.39 an ounce. U.S. gold futures (GCc1) rose 0.62% to $2,871.10 an ounce.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0ZQ:0-wall-street-mixed-treasury-yields-slide-amid-mixed-earnings-data/",
            "pub_date": "2025-02-06 00:59:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX2VxMtD:0",
            "title": "TrendPulse Quantitative Think Tank Center Leads Innovation in FinTech Under Johnathan Walker",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Denver, CO, Feb.  05, 2025  (GLOBE NEWSWIRE) — TrendPulse Quantitative Think Tank Center continues  to lead innovation in the financial technology (FinTech) space, under  the guidance of Johnathan Walker. The center’s commitment to integrating  advanced technologies into financial strategies has created  groundbreaking tools for investors looking to stay ahead of market  trends, manage risk more effectively, and streamline investment  processes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pioneering Financial Technology</strong></p><p class=\"\">In  an era where the financial landscape is rapidly evolving, TrendPulse  has positioned itself at the forefront of FinTech innovation. The center  has developed cutting-edge solutions that integrate powerful data  analytics, machine learning, and automation to reshape investment  strategies. By combining quantitative investment models with  state-of-the-art technology, TrendPulse provides investors with the  tools they need to make better decisions and drive growth in an  increasingly competitive market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Empowering Investors with Data and Automation</strong></p><p class=\"\">A key pillar of TrendPulse’s success has been its ability to harness the power of data and automation. Under Johnathan Walker’s leadership, the center has introduced machine learning algorithms that analyze vast amounts of market data, enabling real-time predictions and automated trading. These tools allow investors to react quickly to market changes, optimize their portfolios, and execute strategies with minimal manual intervention. As a result, investors can capitalize on opportunities faster and more efficiently, significantly improving their potential for returns.</p><p class=\"\">The center’s use of automated systems also reduces human error, enhances accuracy, and provides a scalable solution that adapts to changing market conditions. Whether institutional investors or individual clients, TrendPulse’s automated solutions make it easier for users to optimize their investments while minimizing risks.</p><p class=\"\">Transforming Investment Strategy with Predictive Analytics</p><p class=\"\">One of the standout features of TrendPulse’s offerings is its use of predictive analytics to forecast market trends and guide decision-making. By leveraging advanced algorithms and big data, the center helps investors identify emerging opportunities, detect potential risks, and allocate assets more strategically. This approach enables investors to stay ahead of the curve, making data-driven decisions that have a higher probability of success.</p><p class=\"\">TrendPulse’s predictive tools have proven particularly valuable for identifying undervalued assets, recognizing short-term trading opportunities, and optimizing long-term investment strategies. The integration of these data-driven insights ensures that investors are not just reacting to market movements, but proactively shaping their portfolios for better outcomes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Vision for the Future of FinTech</strong></p><p class=\"\">Looking forward, TrendPulse Quantitative Think Tank Center aims to further expand its FinTech capabilities. The center plans to incorporate even more advanced technologies such as artificial intelligence and blockchain into its offerings, providing an even greater level of sophistication in its investment tools. Johnathan Walker’s vision for the future is clear: to provide users with next-generation technology that empowers them to navigate the complexities of modern financial markets with confidence.</p><p class=\"\">The goal is not just to keep up with market changes, but to stay ahead of them. By continuously refining its investment tools and integrating the latest technological advancements, TrendPulse remains at the cutting edge of the FinTech industry.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Building a Stronger Investment Ecosystem</strong></p><p class=\"\">TrendPulse is not just creating innovative tools for individual investors; it is also fostering a broader investment ecosystem. The center has built a collaborative platform where investors can share knowledge, engage in discussions, and learn from each other. By promoting a community-driven environment, TrendPulse ensures that users not only have access to advanced technologies but also a network of like-minded individuals who are committed to shared financial success.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Conclusion</strong></p><p class=\"\">TrendPulse Quantitative Think Tank Center’s commitment to innovation in financial technology is reshaping the way investors approach the markets. Through advanced data analytics, machine learning, and automation, the center has empowered users to make smarter, data-driven decisions. As Johnathan Walker continues to lead the charge, TrendPulse will undoubtedly remain at the forefront of the FinTech revolution, providing investors with the tools, insights, and community needed to succeed in a rapidly evolving financial landscape.</p><p class=\"\">Michael Harris</p><p class=\"\">TrendPulse</p><p class=\"\">contact-at-trendpulse-ai.com</p><p class=\"\">https://www.trendpulse-ai.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX2VxMtD:0-trendpulse-quantitative-think-tank-center-leads-innovation-in-fintech-under-johnathan-walker/",
            "pub_date": "2025-02-06 01:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008427_20250205008427:0",
            "title": "Tele2 Appoints Petr Cermak as Exec Vice President",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008427_20250205008427:0/",
            "pub_date": "2025-02-06 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205008399:0",
            "title": "Summit Materials Announces Stockholder Approval of Quikrete Transaction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Summit Materials Announces Stockholder Approval of Quikrete Transaction</p><p class=\"\">PR Newswire</p><p class=\"\">DENVER, Feb. 5, 2025</p><p class=\"\">DENVER, Feb. 5, 2025 /PRNewswire/ — Summit Materials, Inc.  (\"Summit,\" \"Summit Materials\" or the \"Company\"), a leading producer of aggregates and cement, today announced that the Company has obtained all requisite stockholder approvals in connection with the proposed acquisition by Quikrete Holdings, Inc. (\"Quikrete\"). Summit will disclose the final, certified voting results on a Form 8-K with the U.S. Securities and Exchange Commission (\"SEC\").</p><p class=\"\">As previously announced, the proposed transaction is expected to close within the first quarter of 2025, subject to the satisfaction of remaining customary closing conditions. Upon completion of the transaction, Summit will become a privately held subsidiary of Quikrete and its common stock will no longer be traded on the NYSE.</p><p class=\"\">Advisors</p><p class=\"\">Morgan Stanley &amp; Co. LLC and Evercore are acting as financial advisors to Summit, and Davis Polk &amp; Wardwell LLP is acting as legal advisor. Wells Fargo is acting as exclusive financial advisor to Quikrete, and Troutman Pepper Locke LLP and Covington &amp; Burling LLP are acting as legal counsel. Wells Fargo has provided a debt financing commitment for the Merger.</p><p class=\"\">About Summit Materials, Inc.</p><p class=\"\">Summit Materials is a market-leading producer of aggregates and cement with vertically integrated operations that supply ready-mix concrete and asphalt in select markets. Summit is a geographically diverse, materials-led business of scale that offers customers in the United States and British Columbia, Canada high quality products and services for the public infrastructure, residential and non-residential end markets. Summit has a strong track record of successful acquisitions since its founding and continues to pursue high-return growth opportunities in new and existing markets. For more information about Summit Materials, please visit www.summit-materials.com.</p><p class=\"\">About Quikrete Holdings, Inc.</p><p class=\"\">Quikrete Holdings, Inc. (Quikrete) is a privately owned family business founded in 1940. It is a leading building materials company based in Atlanta, Georgia. From the original yellow bag of premixed concrete, today Quikrete's portfolio of brands includes Quikrete, Spec Mix, Rinker Materials, U.S. Pipe, Contech Engineered Solutions, Keystone Hardscapes, Pavestone, Custom Building Products, QPR, and other leading brands. The products produced by the collection of brands include packaged cementitious products, pavers, retaining wall systems, masonry units, tile grouts and thin sets, concrete pipe, box culverts, corrugated metal pipe, ductile iron pipe, engineered storm water systems, structural precast, and steel pedestrian and vehicular bridges. The company services the US and Canadian commercial construction, residential, and infrastructure markets. This broad array of products and expertise allows Quikrete to provide nearly every product required for most any type of construction project.</p><p class=\"\">Cautionary Statement Regarding Forward-Looking Statements</p><p class=\"\">This communication includes \"forward-looking statements\" within the meaning of the federal securities laws, which involve risks and uncertainties. Forward-looking statements include all statements that do not relate solely to historical or current facts, and you can identify forward-looking statements because they contain words such as \"believes, \" \"expects,\" \"may,\" \"will,\" \"should,\" \"seeks,\" \"intends,\" \"trends,\" \"plans,\" \"estimates,\" \"projects\" or \"anticipates\" or similar expressions that concern our strategy, plans, expectations or intentions. All statements made relating to our estimated and projected earnings, margins, costs, expenditures, cash flows, growth rates and financial results are forward-looking statements. Such forward-looking statements include but are not limited to statements about the Merger, including statements that are not historical facts. These forward-looking statements are subject to risks, uncertainties and other factors that may cause our actual results, performance or achievements to be materially different from future results, performance or achievements expressed or implied by such forward-looking statements. We derive many of our forward-looking statements from our operating budgets and forecasts, which are based upon many detailed assumptions. While we believe that our assumptions are reasonable, it is very difficult to predict the effect of known factors, and, of course, it is impossible to anticipate all factors that could affect our actual results. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that the results or conditions described in such statements or our objectives and plans will be realized. Important factors could affect our results and could cause results to differ materially from those expressed in our forward-looking statements, including but not limited to the factors discussed in the section entitled \"Risk Factors\" in the Company's Annual Report on Form 10-K for the fiscal year ended December 30, 2023, and Quarterly Report on Form 10-Q for the fiscal quarter ended March 30, 2024, each as filed with the SEC, and any factors discussed in the section entitled \"Risk Factors\" in any of our subsequently filed SEC filings; and the following:  (i) the occurrence of any event, change, or other circumstance that could give rise to the right of one or both of the parties to terminate the definitive transaction agreement between the Company and Purchaser, including in circumstances requiring the Company to pay a termination fee; (ii) potential litigation relating to the Merger that could be instituted against the parties to the definitive transaction agreement or their respective directors or officers, including the effects of any outcomes related thereto; (iii) the possibility that the Merger does not close when expected or at all because required regulatory or other approvals and other conditions to closing are not received or satisfied on a timely basis or at all; (iv) reputational risk and potential adverse reactions of customers, employees or other business partners and the businesses generally, including those resulting from the announcement of the Merger; (v) the risk that any announcements relating to the Merger could have adverse effects on the market price of the Company's common stock; (vi) significant transaction costs associated with the Merger; and (vii) the diversion of management's attention and time from ongoing business operations and opportunities on Merger-related matters. All subsequent written and oral forward-looking statements attributable to us, or persons acting on our behalf, are expressly qualified in their entirety by these cautionary statements. Any forward-looking statement that we make herein speaks only as of the date of this communication. We undertake no obligation to publicly update or revise any forward-looking statement as a result of new information, future events or otherwise, except as required by law.</p><p class=\"\">All subsequent written and oral forward-looking statements attributable to us, or persons acting on our behalf, are expressly qualified in their entirety by these cautionary statements. Any forward-looking statement that we make herein speaks only as of the date of this communication. We undertake no obligation to publicly update or revise any forward-looking statement as a result of new information, future events or otherwise, except as required by law.</p><p class=\"\">Contacts:</p><p class=\"\">Andy Larkin</p><p class=\"\">VP, Investor Relations</p><p class=\"\">Summit Materials, Inc.</p><p class=\"\">andy.larkin@summit-materials.com</p><p class=\"\">720-618-6013</p><p class=\"\">Jim Barron/Benjamin Spicehandler/Danielle Berg</p><p class=\"\">FGS Global</p><p class=\"\">Summit@fgsglobal.com</p><p class=\"\">Patrick Lenow</p><p class=\"\">Vice President, Marketing &amp; Communications</p><p class=\"\">Quikrete Holdings, Inc.</p><p class=\"\">404-634-9100</p><p class=\"\">Patrick.Lenow@quikrete.com</p><p class=\"\">View original content to download multimedia:https://www.prnewswire.com/news-releases/summit-materials-announces-stockholder-approval-of-quikrete-transaction-302369068.html</p><p class=\"\">SOURCE Summit Materials, Inc.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205008399:0/",
            "pub_date": "2025-02-06 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX7vJmTv:0",
            "title": "Enterprises Now Migrating Thousands of VMware Virtual Machines to Platform9’s Private Cloud in Weeks at One-Tenth of the Cost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SAN JOSE, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — Platform9, the enterprise private cloud company, today announced that enterprises are migrating tens of thousands of VMware virtual machines (VMs) to Platform9’s private cloud using its vJailbreak open source product.</p><p class=\"\">Industry analysts estimate large-scale VMware migrations will take 18-48 months to complete, with costs ranging from $300 to $3,000 per VM. With Platform9, migrations can happen in weeks to months and at one-tenth of the cost.</p><p class=\"\">“A Fortune 500 enterprise has contracted with Platform9 to migrate 40,000 VMs at $35 per VM to Platform’s Private Cloud Director and this customer will be migrating more than 200 VMs per day using vJailbreak by next month. This customer evaluated multiple alternatives, including Nutanix, Hyper-V, Proxmox and Red Hat, and chose Private Cloud Director because it is the only solution that that provided all the enterprise-ready virtualization features they needed while integrating seamlessly with their existing third-party storage,” said Madhura Maskasky, co-founder and VP of product at Platform9. Maskasky helped develop VMware vCloud Director, VMware’s original private cloud offering used by the world’s largest enterprises that is now a precursor to Broadcom’s VMware Cloud Foundation.</p><p class=\"\">“Platform9 is unique because of the flexibility it provides by offering a best-of-breed virtualization platform, automated VM migration tooling and built-in Kubernetes management capabilities that enable our longer term vision of cloud-native apps,” said Justin Kuss, VP of IT at Rackspace, who is modernizing a VMware based environment.</p><p class=\"\">vJailbreak is the only solution that orchestrates all the aspects of migration – reducing risk and manual labor and increasing customer confidence. Key features include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Delightful, modern UX focused on migration from VMware with point and click simplicity.</li><li class=\"listItem-bmN0_SHH\">Scalable architecture that can span to multiple migration agents to migrate 100s of VMs concurrently.</li><li class=\"listItem-bmN0_SHH\">Discovery of VMs and their associated metadata, storage and network configuration and easily porting those across.</li><li class=\"listItem-bmN0_SHH\">Live migration of VMs using change-block-tracking; with only a few minutes of downtime required to turn off the original and power on the newly migrated copy.</li><li class=\"listItem-bmN0_SHH\">Automation for common migration pain points, such as dynamic volumes, uninstalling and handling VMware tools, IP addresses, MAC addresses, secondary disks and system identifiers.</li><li class=\"listItem-bmN0_SHH\">Planned support for raw device mappings and clustered VMs.</li><li class=\"listItem-bmN0_SHH\">Planned support for in-place rolling migration of an entire VMware cluster, into a KVM based cluster.</li></ul><p class=\"\">Platform9 launched Private Cloud Director last quarter to give enterprises the simplest private cloud experience with all of the critical enterprise features of VMware: VM High Availability, Cluster Rebalancing, VM Live Migration, Distributed Virtual Switches, Software Defined Networking and interoperability with all existing hardware investments including third party storage.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Platform9</strong></p><p class=\"\">Platform9 is the leader in simplifying enterprise private clouds. The company’s flagship product, Private Cloud Director, has all of VMware’s enterprise-grade features today along with private cloud features for the future. Platform9 was founded by a team of VMware cloud pioneers and has over tens of thousands of nodes in production at some of the world’s largest enterprises. Platform9 is an inclusive, globally distributed company backed by prominent investors, committed to driving private cloud innovation and efficiency. For more information, go to: https://platform9.com/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media and Analyst Contact:</strong></p><p class=\"\">Amber Rowland</p><p class=\"\">amber@therowlandagency.com</p><p class=\"\">+1-650-814-4560</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX7vJmTv:0-enterprises-now-migrating-thousands-of-vmware-virtual-machines-to-platform9-s-private-cloud-in-weeks-at-one-tenth-of-the-cost/",
            "pub_date": "2025-02-06 01:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1OA:0",
            "title": "GSK, gold miners shares push Britain's FTSE 100 higher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">FTSE 100 up 0.6%, FTSE 250 up 0.5%</li></ul></span></div><span><p class=\"\">        UK's FTSE 100 firmed on Wednesday after two straight days of losses, buoyed by gains in shares of heavyweight GSK and gold miners, while investors turned their focus to the Bank of England's rate decision this week. </p><p class=\"\">The blue-chip FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- --> ended 0.6% higher, while the domestically focussed mid-cap FTSE 250 (.FTMC) firmed 0.5%. </p><p class=\"\">GSK  jumped 7.6% after the launched a 2 billion pounds ($2.5 billion) share buyback and lifted its long-term sales target to nearly $50 billion. </p><p class=\"\">Meanwhile, precious metal miners (.FTNMX551030) surged 3.6%, as gold prices hit another record high. Fresnillo  climbed 5.8%, boosted further by J.P.Morgan naming it its \"top pick.\" </p><p class=\"\">    All eyes will be on the Bank of England's monetary policy decision on Thursday, with markets having fully priced in a 25-basis-point cut.  </p><p class=\"\">    \"We expect the BoE to cut rates by 25bp and easing guidance will be strengthened relative to market expectations. At least one 25bp cut per quarter should be in play as growth risks remain heavily to the downside,\" said Geoff Yu, senior market strategist at BNY.      </p><p class=\"\">Ferrexpo  slumped 8% to the bottom of the mid-cap index, extending losses to the second session after the miner on Tuesday said a civil claim worth 157 billion hryvnias ($3.77 billion) was filed against its Ukrainian unit.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1OA:0-gsk-gold-miners-shares-push-britain-s-ftse-100-higher/",
            "pub_date": "2025-02-06 01:00:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr358w8y:0",
            "title": "Teneo.ai explores the conditions for carrying out a directed share issue of approximately SEK 50 million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Teneo AI AB<p class=\"\">NOT FOR RELEASE, PUBLICATION OR DISTRIBUTION IN WHOLE OR IN PART, DIRECTLY OR INDIRECTLY, IN OR INTO THE UNITED STATES, AUSTRALIA, BELARUS, CANADA, NEW ZEALAND, HONG KONG, JAPAN, RUSSIA, SINGAPORE, SOUTH AFRICA, SOUTH KOREA, OR ANY OTHER JURISDICTION WHERE SUCH RELEASE, PUBLICATION OR DISTRIBUTION WOULD BE UNLAWFUL OR WOULD REQUIRE REGISTRATION OR ANY OTHER MEASURES. PLEASE REFER TO IMPORTANT INFORMATION AT THE END OF THE PRESS RELEASE.</p><p class=\"\">Teneo AI AB (“Teneo.ai” or the “Company”) has appointed Pareto Securities AB (“Pareto Securities”) to explore the conditions for carrying out a directed share issue of approximately SEK 50 million to Swedish and international institutional investors (the “Directed Share Issue”). The Board of Directors may, subject to the successful completion of the Directed Share Issue and subject to an extraordinary general meeting authorizing the Board of Directors to resolve on issue of new shares, resolve on a share issue at a subscription price corresponding to the subscription price in the Directed Share Issue with preferential rights for existing shareholders (the “Repair Issue”). </p><p class=\"\">The Directed Share Issue is intended to be carried out with deviation from the shareholders' preferential rights partly pursuant to the authorization granted to the Board of Directors by the annual general meeting on 26 June 2024. Therefore, the Directed Share Issue is divided into two separate tranches. The first tranche will consist of up to 74,628,848 shares that may be issued within the authorization resolved by the annual general meeting on 26 June 2024 (\"<strong class=\"root-Tkn6WL2y\">Tranche 1</strong>\"). The second tranche will be issued to pre-agreed investors (\"<strong class=\"root-Tkn6WL2y\">Tranche 2</strong>\"). Tranche 2 is subject to approval from a subsequent extraordinary general meeting (the \"<strong class=\"root-Tkn6WL2y\">EGM</strong>\"). The completion of Tranche 1 is not conditional upon the completion of Tranche 2 and settlement for Tranche 1 is expected to take place on or about 10 February 2025 on a delivery versus payment basis.</p><p class=\"\">The subscription price for the shares in the Directed Share Issue and the total number of new shares will be determined through an accelerated book building procedure which will begin immediately after publication of this press release and end before the commencement of trading on Nasdaq First North Growth Market on 6 February 2025. The book building procedure may, at the discretion of the Company in consultation with Pareto Securities, close earlier or later and may be cancelled at any time. The Company will announce the result of the Directed Share Issue through a press release after the book building procedure is completed. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Background and rationale</strong></p><p class=\"\">The Board of Directors of Teneo.ai assesses that the existing working capital is not sufficient to meet the strong and growing demand during the next twelve months. Furthermore the Company will secure the existing cash covenant under its loan agreement with Capital Four. The Company is experiencing strong demand for its solutions and sees an opportunity to accelerate growth. In light of this, the Board of Directors has decided to evaluate the possibility of raising capital through the Directed Share Issue to address the capital need and enable the Company to effectively deliver on the increased demand.</p><p class=\"\">The net proceeds from the Directed Share Issue are intended to be used primarily for investments in sales and marketing in the US, focusing on the Genesys and AWS ecosystems, and secondarily in the UK and Northern Europe. The investments will focus on hiring staff and running marketing activities and campaigns to support the go-to-market strategy. To facilitate integration for players within the Genesys and AWS ecosystems, the net proceeds will also be used to further develop the Teneo platform with customized plug-ins. Finally, the net proceeds will be used to cover ongoing operational costs until the Company achieves self-financing.</p><p class=\"\">The Board of Directors has made an overall assessment and carefully considered the possibility to raise capital through a new share issue with preferential rights for the Company's shareholders instead and has made the assessment that it currently, for several reasons, is more advantageous for the Company and the shareholders to raise capital through a directed share issue. A rights issue would take significantly longer time, which could impair the Company's financial flexibility and entail an exposure to market volatility and risk reducing the ability to raise capital. The Company further assesses that a rights issue, under current market conditions, would entail higher costs related to considerations to potential guarantee undertakings. In addition, a directed share issue provides the opportunity to further diversify and strengthen the Company's shareholder base with institutional investors in order to increase the liquidity of the Company's shares, and the execution of a directed share issue can take place at a lower cost and with less complexity than a rights issue. In the current volatile market environment - which may entail that the conditions for capital raises can change rapidly - the Company deems it prudent to act on the prevailing opportunity and to raise further capital from reputable institutional and professional investors. Considering the above, the Board of Directors has made the assessment that a directed issue of shares with deviation from the shareholders' preferential rights is the most favorable alternative for the Company, and thus that it is in the shareholders' interest to carry out the Directed Share Issue.</p><p class=\"\">Since the subscription price in the Directed Share Issue will be determined through a book building procedure, it is the Board of Directors' assessment that the subscription price will be on market terms as it reflects prevailing market conditions and investor demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Extraordinary general meeting and potential repair issue</strong></p><p class=\"\">Provided that the Board of Directors resolves on the Directed Share Issue, the Board of Directors will summon to the EGM to approve Tranche 2, which is not based on the authorization of the annual general meeting, and to authorize the Board of Directors to resolve on the potential Repair Issue. The notice to the EGM is expected to be published shortly after the announcement of the result of the accelerated book building procedure.</p><p class=\"\">Subject to the successful completion of the Directed Share Issue, the Board of Directors may resolve on the Repair Issue at a subscription price corresponding to the subscription price in the Directed Share Issue, provided that the EGM authorizes the Board of Directors to resolve on the potential Repair Issue. Investors participating in the Directed Share Issue will, however, be required to undertake not to participate in the potential Repair Issue, and not to exercise or transfer any subscription rights obtained in the potential Repair Issue. New investors will be able to apply for subscription of shares in the potential Repair Issue without preferential right. No prospectus will be prepared in connection with the Repair Issue. The Company will prepare and publish a disclosure document in the form prescribed by Regulation (EU) 2024/2809 Annex IX for the Repair Issue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Lock-up</strong></p><p class=\"\">In connection with the Directed Share Issue, the Company has undertaken, subject to customary exceptions, not to issue additional shares for a period of six months after the announcement of the outcome of the Directed Share Issue (the \"<strong class=\"root-Tkn6WL2y\">Lock-Up</strong>\"). However, the potential Repair Issue and any rights issue carried out by the Company following completion of the Directed Share Issue if the Repair Issue is not completed, is not covered by the Lock-Up. Provided that the Directed Share Issue is completed, shareholding board members and shareholding members of the management team, including the Company's CEO Per Ottosson and the Company's CFO Fredrik Törgren will undertake, subject to customary exceptions and provided that the Directed Issue is carried out, not to sell any securities in Teneo.ai for a period of 90 calendar days after the announcement of the outcome of the Directed Share Issue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advisers</strong></p><p class=\"\">Pareto Securities is Sole Manager and Bookrunner, Advokatfirman Schjødt is legal adviser to the Company and Advokatfirman Lindahl is legal adviser to Pareto Securities in connection with the Directed Share Issue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, contact</strong></p><p class=\"\">Per Ottosson, CEO, Teneo.ai</p><p class=\"\">E-mail: per.ottosson@teneo.ai</p><p class=\"\">This information is such that Teneo AI AB is obliged to disclose pursuant to the EU Market Abuse Regulation. The information was released for public disclosure, through the agency of the contact person above, on 5 February 2025 at 18:00 CET.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Teneo AI AB</strong></p><p class=\"\">Teneo.ai (SSME:TENEO) is at the forefront of AI-driven automation for voice and text-based customer service. Our Teneo platform leverages cutting-edge Conversational AI, Generative AI, and Large Language Models to enhance the efficiency and effectiveness of customer interactions. We simplify Voice AI integration, ensuring a seamless experience that reduces losses in automated conversations and maximizes the value of existing technology investments.</p><p class=\"\">Our innovative solutions help businesses expand their customer base, boost revenue, and reduce churn, enabling the realization of the Agentless Contact Center concept. This approach delivers tangible ROI through lower cost as contact center agents are freed to conduct higher value tasks, improved customer satisfaction (CSAT), first contact resolution (FCR), and call containment.</p><p class=\"\">Proudly serving global leaders like AT&amp;T, HelloFresh, Swisscom, and Telefónica, Teneo.ai has revolutionized customer service automation, directly automating up to 40% of operations and achieving up to 50% cost savings. Our patented technology integrates effortlessly with any Conversational AI platform, supporting both chat and voice applications. This integration enhances critical metrics such as growth, FCR, CSAT, and Net Promoter Score (NPS), ensuring our clients achieve superior outcomes in customer service.</p><p class=\"\">Teneo.ai is listed on Nasdaq First North Growth Market in Stockholm with short name TENEO. Redeye is the Company's Certified Adviser.</p><p class=\"\">Learn more at www.teneo.ai/investors.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Important information</strong></p><p class=\"\">This press release does not constitute an offer, or a solicitation of any offer, to buy or subscribe for securities in the Company. The release, announcement or distribution of this press release may, in certain jurisdictions, be subject to restrictions according to law. The recipients of this press release in jurisdictions where this press release has been published or distributed shall inform themselves of and follow any such restrictions. The recipient of this press release is responsible for using this press release, and the information contained herein, in accordance with applicable rules in each jurisdiction. </p><p class=\"\">This press release is not a prospectus for the purposes of the Prospectus Regulation (EU) 2017/1129 (the “<strong class=\"root-Tkn6WL2y\">Prospectus Regulation</strong>”) and has not been approved or reviewed by any regulatory authority in any jurisdiction. Teneo.ai has not authorized any offer to the public of shares or rights in any Member State of the EEA and no prospectus has been or will be prepared in connection with the Directed Share Issue or the Repair Issue. In connection to the Repair Issue, the Company will prepare and publish a disclosure document in the form prescribed by Regulation (EU) 2024/2809 Annex IX. In any EEA Member State, this communication is only addressed to and is only directed to “qualified investors” in that Member State within the meaning of the Prospectus Regulation.</p><p class=\"\">This press release does not constitute or form part of an offer or solicitation to purchase or subscribe for securities in the United States. The securities referred to herein may not be sold in the United States absent registration or an exemption from registration under the US Securities Act of 1933, as amended (the “<strong class=\"root-Tkn6WL2y\">Securities Act</strong>”), and may not be offered or sold within the United States absent registration or an applicable exemption from, or in a transaction not subject to, the registration requirements of the Securities Act. There is no intention to register any securities referred to herein in the United States or to make a public offering of the securities in the United States. </p><p class=\"\">The information in this press release may not be announced, published, copied, reproduced or distributed, directly or indirectly, in whole or in part, within or into Australia, Belarus, Canada, Hong Kong, Japan, New Zealand, Russia, Singapore, South Africa, South Korea, the United States, or in any other jurisdiction where such announcement, publication or distribution of the information would not comply with applicable laws and regulations or where such actions are subject to legal restrictions or would require additional registration or other measures than what is required under Swedish law. Actions taken in violation of this instruction may constitute a crime against applicable securities laws and regulations.</p><p class=\"\">In the United Kingdom, this document and any other materials in relation to the securities described herein is only being distributed to, and is only directed at, and any investment or investment activity to which this document relates is available only to, and will be engaged in only with, “qualified investors” (within the meaning of the United Kingdom version of the EU Prospectus Regulation (2017/1129/ EU) which is part of United Kingdom law by virtue of the European Union (Withdrawal) Act 2018) who are (i) persons having professional experience in matters relating to investments who fall within the definition of “investment professionals” in Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005 (the “<strong class=\"root-Tkn6WL2y\">Order</strong>”); or (ii) high net worth entities falling within Article 49(2)(a) to (d) of the Order (all such persons together being referred to as “relevant persons”). In the United Kingdom, any investment or investment activity to which this communication relates is available only to, and will be engaged in only with, relevant persons. Persons who are not relevant persons should not take any action on the basis of this press release and should not act or rely on it.</p><p class=\"\">This announcement does not identify or suggest, or purport to identify or suggest, the risks (direct or indirect) that may be associated with an investment in the new shares. Any investment decision in connection with the Directed Share Issue must be made on the basis of all publicly available information relating to the Company and the Company’s shares. Such information has not been independently verified by Pareto Securities. Pareto Securities is acting for the Company in connection with the transaction and no one else and will not be responsible to anyone other than the Company for providing the protections afforded to its clients nor for giving advice in relation to the Directed Share Issue or any other matter referred to herein.</p><p class=\"\">This press release does not constitute an invitation to warrant, subscribe, or otherwise acquire or transfer any securities in any jurisdiction. This press release does not constitute a recommendation for any investors' decisions regarding the Directed Share Issue. Each investor or potential investor should conduct a self-examination, analysis and evaluation of the business and information described in this press release and any publicly available information. The price and value of the securities can decrease as well as increase. Achieved results do not provide guidance for future results. Neither the contents of the Company's website nor any other website accessible through hyperlinks on the Company's website are incorporated into or form part of this press release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-looking statements</strong></p><p class=\"\">This press release contains forward-looking statements that reflect the Company’s intentions, beliefs, or current expectations about and targets for the Company’s future results of operations, financial condition, liquidity, performance, prospects, anticipated growth, strategies and opportunities and the markets in which the Company operates. Forward-looking statements are statements that are not historical facts and may be identified by words such as “believe”, “expect”, “anticipate”, “intend”, “may”, “plan”, “estimate”, “will”, “should”, “could”, “aim” or “might”, or, in each case, their negative, or similar expressions. The forward-looking statements in this press release are based upon various assumptions, many of which are based, in turn, upon further assumptions. Although the Company believes that the expectations reflected in these forward-looking statements are reasonable, it can give no assurances that they will materialize or prove to be correct. Because these statements are based on assumptions or estimates and are subject to risks and uncertainties, the actual results or outcome could differ materially from those set out in the forward-looking statements as a result of many factors. Such risks, uncertainties, contingencies and other important factors could cause actual events to differ materially from the expectations expressed or implied in this release by such forward-looking statements. The Company does not guarantee that the assumptions underlying the forward-looking statements in this press release are free from errors and readers of this press release should not place undue reliance on the forward-looking statements in this press release. The information, opinions and forward-looking statements that are expressly or implicitly contained herein speak only as of its date and are subject to change without notice. Neither the Company nor anyone else undertake to review, update, confirm or to release publicly any revisions to any forward-looking statements to reflect events that occur or circumstances that arise in relation to the content of this press release, unless it is required by law or Nasdaq First North Growth Market's Rulebook for Issuers of Shares.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Information to distributors </strong></p><p class=\"\">Solely for the purposes of the product governance requirements contained within: (a) EU Directive 2014/65/EU on markets in financial instruments, as amended (“<strong class=\"root-Tkn6WL2y\">MiFID II</strong>”); (b) Articles 9 and 10 of Commission Delegated Directive (EU) 2017/593 supplementing MiFID II; and (c) local implementing measures (together, the “<strong class=\"root-Tkn6WL2y\">MiFID II Product Governance Requirements</strong>”), and disclaiming all and any liability, whether arising in tort, contract or otherwise, which any “manufacturer” (for the purposes of the MiFID II Product Governance Requirements) may otherwise have with respect thereto, the shares in Teneo.ai have been subject to a product approval process, which has determined that such shares are: (i) compatible with an end target market of retail investors and investors who meet the criteria of professional clients and eligible counterparties, each as defined in MiFID II; and (ii) eligible for distribution through all distribution channels as are permitted by MiFID II (the “<strong class=\"root-Tkn6WL2y\">EU Target Market Assessment</strong>”). Solely for the purposes of each manufacturer's product approval process in the United Kingdom, the target market assessment in respect of the shares in the Company has led to the conclusion that: (i) the target market for such shares is only eligible counterparties, as defined in the FCA Handbook Conduct of Business Sourcebook, and professional clients, as defined in Regulation (EU) No 600/2014 as it forms part of domestic law by virtue of the European Union (Withdrawal) Act 2018 (“<strong class=\"root-Tkn6WL2y\">UK MiFIR</strong>”); and (ii) all channels for distribution of such shares to eligible counterparties and professional clients are appropriate (the “<strong class=\"root-Tkn6WL2y\">UK Target Market Assessment</strong>” and, together with the EU Target Market Assessment, the “<strong class=\"root-Tkn6WL2y\">Target Market Assessment</strong>”). Notwithstanding the Target Market Assessment, distributors should note that: the price of the shares in Teneo.ai may decline and investors could lose all or part of their investment; the shares in Teneo.ai offer no guaranteed income and no capital protection; and an investment in the shares in Teneo.ai is compatible only with investors who do not need a guaranteed income or capital protection, who (either alone or in conjunction with an appropriate financial or other adviser) are capable of evaluating the merits and risks of such an investment and who have sufficient resources to be able to bear any losses that may result therefrom. The Target Market Assessment is without prejudice to the requirements of any contractual, legal or regulatory selling restrictions in relation to the Directed Share Issue. Furthermore, it is noted that, notwithstanding the Target Market Assessment, Pareto Securities will only procure investors who meet the criteria of professional clients and eligible counterparties.</p><p class=\"\">For the avoidance of doubt, the Target Market Assessment does not constitute: (a) an assessment of suitability or appropriateness for the purposes of MiFID II or UK MiFIR; or (b) a recommendation to any investor or group of investors to invest in, or purchase, or take any other action whatsoever with respect to the shares in Teneo.ai.</p><p class=\"\">Each distributor is responsible for undertaking its own target market assessment in respect of the shares in Teneo.ai and determining appropriate distribution channels.</p><p class=\"\">https://news.cision.com/teneo-ai-ab/r/teneo-ai-explores-the-conditions-for-carrying-out-a-directed-share-issue-of-approximately-sek-50-mil%2Cc4101304</p><p class=\"\">Release</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr358w8y:0-teneo-ai-explores-the-conditions-for-carrying-out-a-directed-share-issue-of-approximately-sek-50-million/",
            "pub_date": "2025-02-06 01:00:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr53hWJc:0",
            "title": "Tele2 appoints Petr Cermak as new EVP Chief Commercial Officer and announces further changes to the leadership team",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Tele2 AB<p class=\"\">Stockholm - Tele2 AB (\"Tele2\") (Nasdaq Stockholm: TEL2 A and TEL2 B) appoints Petr Cermak as Executive Vice President, Chief Commercial Officer and part of the Group Leadership Team. In addition, Charlotte Hansson, EVP Chief Financial Officer and Hendrik de Groot, EVP Chief Commercial Officer will leave Tele2.</p><p class=\"\">Starting February 10, 2025, Petr Cermak assumes the role of EVP Chief Commercial Officer and joins Tele2’s Group Leadership Team, reporting to CEO Jean Marc Harion.</p><p class=\"\">Petr comes with extensive telecom experience and has throughout his career driven transformation and growth in competitive markets. He spent over three years at Telia, most recently as Group Chief Commercial and Strategy Officer, following his role as CEO of Telia Denmark. During his career, he lived nine years in Sweden and he brings international experience from leading consulting firms such as Bain &amp; Company and The Boston Consulting Group, where he advised global telecom operators on commercial excellence and market strategy.</p><p class=\"\">-          <!-- -->I am very pleased to welcome Petr to the team. His extensive telecom expertise, strategic mindset, and ability to drive change will be invaluable as we accelerate the transformation of Tele2 into a faster and stronger company, says Jean Marc Harion, CEO &amp; President at Tele2.</p><p class=\"\">As part of the ongoing evolution of Tele2’s management team, Charlotte Hansson, EVP CFO, and Hendrik de Groot, EVP CCO, are stepping down from their roles, effective immediately. Peter Landgren, currently Head of Financial Reporting &amp; Operations at Tele2, will assume the role of acting EVP CFO, effective from today. Tele2’s new permanent CFO will be appointed in the coming months.</p><p class=\"\">-          <!-- -->I thank Hendrik and Charlotte for their steadfast dedication and leadership during their time with Tele2. They have both been instrumental for Tele2’s commercial and financial progress in the past four years, and I wish them all the best in their future endeavors, Jean Marc Harion concludes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fredrik Hallstan, Head of External Communications Phone: +46 761 15 38 30</p><p class=\"\">Stefan Billing, Head of Investor Relations, Phone: +46 701 66 33 10</p><p class=\"\"><em> </em></p><p class=\"\">Tele2 is a leading telco with the purpose to enable a society of unlimited possibilities. Through our networks and services - ranging from mobile and fixed connectivity, telephony and data network services to TV, streaming and global IoT solutions - we are deeply connected to every aspect of today's digital lifestyle. By making our infrastructure more powerful, reliable and sustainable, we enable society to become that as well. Tele2 was founded in 1993 and is listed on Nasdaq Stockholm. In 2024, Tele2 generated revenue of SEK 30 billion and reported an underlying EBITDAaL of SEK 11 billion. For latest news and definitions of measures, please see our homepage www.tele2.com</p><p class=\"\">https://news.cision.com/tele2-ab/r/tele2-appoints-petr-cermak-as-new-evp-chief-commercial-officer-and-announces-further-changes-to-the-%2Cc4101261</p><p class=\"\">Release</p><p class=\"\">Petr Cermak - Executive Vice President, Chief Commercial Officer Tele2</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr53hWJc:0-tele2-appoints-petr-cermak-as-new-evp-chief-commercial-officer-and-announces-further-changes-to-the-leadership-team/",
            "pub_date": "2025-02-06 01:00:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr7l3jb3:0",
            "title": "Dometic successfully issues SEK 2.5 billion bonds",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Dometic Group<p class=\"\">Dometic Group AB (\"Dometic\") has today issued SEK 2.5 billion in the Swedish krona bond market. The bonds were issued across three tranches consisting of a 3-year Floating Rate Note with a coupon of 3m Stibor +275bps, a 3-year Fixed Rate Note with a coupon of 4.925% and a 5-year Floating Rate note with a coupon of 3m Stibor +325bps.</p><p class=\"\">The bonds have been issued under Dometic's EUR 1.5bn Euro Medium Term Note (\"EMTN\") program dated 14 June 2024 and is Dometic's first ever public transaction in the Swedish Krona bond market. The bonds will be listed on the Official List of Euronext Dublin.</p><p class=\"\">\"We are pleased with the success of our first ever public Swedish krona bond and the substantial investor interest in our home market. We have further broadened our sources of funding with the entry into this market. The funds will mainly be used to manage our current debt portfolio\", says Dometic's Chief Financial Officer Stefan Fristedt.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FOR FURTHER INFORMATION, PLEASE CONTACT</strong></p><p class=\"\">Rikard Tunedal, Head of Investor Relations</p><p class=\"\">Phone: +46 73 056 97 35</p><p class=\"\">Email: rikard.tunedal@dometic.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ABOUT DOMETIC</strong></p><p class=\"\">Dometic is a global outdoor tech company on a mission to make mobile living easy. Leveraging our core expertise in cooling, heating, power &amp; electronics, mobility, and space optimization, we empower more people to connect with nature and elevate their sense of freedom in the outdoors. We achieve this by creating smart, sustainable, and reliable products with outstanding design. Millions of people around the world use our products while camping and exploring nature with their cars, RVs, or boats. Our range of offerings includes installed products for land vehicles and boats, as well as standalone solutions for outdoor enthusiasts. We employ approximately 7,000 people globally and sell our products in more than 100 countries. In 2024, we reported net sales of SEK 25 billion (USD 2.3 billion) and are headquartered in Solna, Sweden.</p><p class=\"\">https://news.cision.com/dometic-group/r/dometic-successfully-issues-sek-2-5-billion-bonds%2Cc4101296</p><p class=\"\">SEK Bond Release ENG</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr7l3jb3:0-dometic-successfully-issues-sek-2-5-billion-bonds/",
            "pub_date": "2025-02-06 01:00:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446799:0",
            "title": "Copper Hits 13-week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Copper increased to a 13-week high of 4.41 USD/Lbs.</p><p class=\"\">Over the past 4 weeks, Copper gained 6.86%, and in the last 12 months, it increased 16.64%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446799:0-copper-hits-13-week-high/",
            "pub_date": "2025-02-06 01:00:31",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0ZH:0",
            "title": "Soitec Q3 FY'25 Revenue At EUR 226 Mln, Down 10% YoY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Soitec SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">REPORTS Q3 FY'25 REVENUE OF €226 MILLION, DOWN 10% YOY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY'25 GUIDANCE REVISED: REVENUE EXPECTED TO DECREASE BY HIGH SINGLE DIGIT YEAR-ON-YEAR AT CONSTANT EXCHANGE RATES AND PERIMETER (COMPARED TO FLAT PREVIOUSLY), AND EBITDA1 MARGIN2 EXPECTED BETWEEN 32% AND 34% (COMPARED TO AROUND 35% PREVIOUSLY)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTS LIMITED GROWTH FOR FY'26 DUE TO MARKET CONDITIONS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTS FY'25 EBITDA MARGIN BETWEEN 32% AND 34%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0ZH:0-soitec-q3-fy-25-revenue-at-eur-226-mln-down-10-yoy/",
            "pub_date": "2025-02-06 00:52:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX1VjKxP:0",
            "title": "City BBQ and Bikky get granular to fuel broad growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW YORK, Feb.  05, 2025  (GLOBE NEWSWIRE) — Bikky, a customer data platform built exclusively for multi-unit restaurants, announced a partnership with City BBQ, an award-winning fast-casual brand that’s smoking and serving up tastes of the nation.</p><p class=\"\">Founded in 1999 in Columbus OH, City BBQ has found steady success showcasing the breadth and depth of BBQ found across the country. The brand has been recognized by everyone from the Kansas City BBQ Association to Men’s Journal for their outstanding cuisine, most recently winning Nation’s Restaurant News Barbeque Showdown.</p><p class=\"\">With ambitious plans to expand nationwide—something few BBQ chains have done before—City BBQ wanted rich guest insights to guide their growth and ensure a best-in-class experience. Having worked with a restaurant CDP in a previous role, City BBQ’s Chief Brand Officer, Annica Conrad, directed the team to Bikky.</p><p class=\"\">“I knew Bikky would be instrumental in helping us achieve our goals,” said Conrad. “Their robust data brings a whole new level of sophistication to our marketing, menu, and operations.”</p><p class=\"\">With this partnership, City BBQ can track and analyze the long-term behavior of their guests, empowering the brand to measure promotions, campaigns, and menu changes with precision. The team recently used Bikky to gauge the impact of a month-long acquisition campaign in honor of their 25th anniversary. They offered every member in their loyalty program, and anyone who joined within the month, a 25 cent pulled pork sandwich.</p><p class=\"\">While redemption was extremely high, the brand wondered if new members were simply one-time value seekers or if they would return. Data from Bikky revealed a significantly higher return rate among new members compared to general visitors. “Before Bikky the promotion would have been a one and done because we had no way to understand the long-term impact or if it was worth repeating,” said Conrad. “With Bikky, we know for certain that it was an effective acquisition offer and we’ll likely run it again in the future.”</p><p class=\"\">City BBQ also finds tremendous value in Bikky’s segmentation capabilities, which allow for highly targeted communication and engagement. The team is now segmenting guests by location to benchmark return rates and menu preferences at each of their restaurants, and have experimented with personalized ads featuring guests’ most frequent orders. “We tested serving guests ads that feature their favorite products, and we’ve seen much better return rates on those particular ads.”</p><p class=\"\">Outside of marketing, Bikky is helping the brand optimize their menu and operations based on guest preferences. City BBQ had always known that their macaroni and cheese was a top-selling product, but Bikky’s insights showed that it’s the most popular item among new guests. “We didn’t realize how many new guests ate mac and cheese,” said Conrad. “Now we’re working hard to optimize that product because if it’s the first thing a new guest eats, it has to be the best it can be.” The team is keeping a close eye on which menu items rise to the top and which drive repeat visits so they're always on top of guests’ needs.</p><p class=\"\">Like many brands, City BBQ’s primary focus for 2025 is increasing traffic. They’re certain Bikky’s guest insights give them a serious advantage as they scale. “With Bikky we’re continually refining our loyalty program so it continues to grow traffic,” said Conrad. “We believe that understanding the behavior of new guests and increasing personalization through segmentation is the best way to deliver on our goals.”</p><p class=\"\">“We’re excited to support City BBQ as they scale to become the premier BBQ-focused fast casual brand in the nation,” says Abhinav Kapur, co-founder and CEO of Bikky. “They’re a clear leader in their category, and now at the forefront of how restaurant brands use customer data to grow traffic, frequency, and sales.”</p><p class=\"\">The fastest-growing, most innovative restaurants in today’s competitive market look to Bikky for insight into how their decisions impact key metrics like frequency and traffic. City BBQ joins a growing roster of brands, including Robeks, WaBa Grill, and Dave’s Hot Chicken, which rely on Bikky’s groundbreaking guest data and analytics platform.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About City BBQ</strong></p><p class=\"\">City Barbeque has been proudly serving the flavor of America since opening its first joint in 1999 and has consistently been recognized as a top BBQ spot, most recently winning the Nation’s Restaurant News BBQ Showdown. The company is also celebrated as an outstanding employer and community partner, hosting thousands of fundraisers for local charities and nonprofits. Today, teams at more than 70 locations smoke meats on site over local hickory wood and prepare homemade sides and desserts fresh every day. The growing fast-casual brand operates in ten states and counting, serving the city's best barbeque for dine-in, carryout, delivery, and catering.</p><p class=\"\">For more information, visit City Barbeque at www.citybbq.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Bikky</strong></p><p class=\"\">Bikky is a customer data platform exclusively for multi-unit restaurant brands.</p><p class=\"\">With Bikky, brands like Dave's Hot Chicken, Bojangles, and Robeks clearly understand how their marketing, menu, and operations impact guest traffic and frequency. By connecting with your entire tech stack—from POS to loyalty—Bikky delivers insight on up to 90% of your guest base, empowering you to make informed, fast decisions that drive incremental sales.</p><p class=\"\">Bikky is based in New York City and has raised nearly $15 million in funding to date.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Abhinav Kapur, Founder &amp; CEO, Bikky</p><p class=\"\">Abhinav@bikky.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX1VjKxP:0-city-bbq-and-bikky-get-granular-to-fuel-broad-growth/",
            "pub_date": "2025-02-06 00:52:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310290:0",
            "title": "Volcon Prices $12 Million Unit Offering; Shares Fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volcon  said Wednesday it priced a public offering of 6 million common units at $2 apiece for expected gross proceeds of about $12 million. </p><p class=\"\">Each unit consists of one common share or pre-funded warrant and one registered common warrant to purchase one share, the company said. </p><p class=\"\">The company said it expects the offering to close on or about Feb. 6 and plans to use the net proceeds for general corporate purposes and working capital. </p><p class=\"\">Volcon shares were down more than 44% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310290:0/",
            "pub_date": "2025-02-06 00:52:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446797:0",
            "title": "CAC 40 Edges Lower on Wednesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 fell 0.2% to close at 7,892 on Wednesday, with persistent trade tensions continuing to weigh, while investors focused on the latest corporate earnings reports and economic data.</p><p class=\"\">The heavyweight luxury sector extended its downturn, with LVMH, L'Oréal, and Kering, losing between 1% and 1.5%, amid ongoing concerns that the US-China trade war could hinder economic growth in the world’s largest economies.</p><p class=\"\">However, positive earnings results helped offset some of the losses.</p><p class=\"\">TotalEnergies saw a 1.7% increase after posting a $3.96 billion net profit for Q4, marking a 72% rise from the previous quarter.</p><p class=\"\">Crédit Agricole rose 0.8% after reporting a 27% increase in quarterly profits, while Publicis gained 2% following a 6.3% organic net revenue growth in Q4, surpassing both expectations and its own guidance.</p><p class=\"\">On the economic front, industrial production in December 2024 fell 0.4% month-on-month, worse than the expected 0.1% decline, reversing a revised 0.1% increase in November.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446797:0-cac-40-edges-lower-on-wednesday/",
            "pub_date": "2025-02-06 00:52:54",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        }
    ]
}