{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSt7kXka:0",
            "title": "Fantribe.com Announces Launch of Digital Fan Cards for Subscribers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-Fantribe.com to launch series of card brands blending physical card collectible to world of real money digital collectibles featuring Athletes, Celebrities and Creators</p><p class=\"\">MIAMI, FLORIDA / ACCESS Newswire / February 4, 2025 / Fantribe Inc. (www.Fantribe.com), a creator economy social platform recently acquired by public company Tritent International Corp. (Stock Symbol:TICJ), today announced the launch of Fantribe Digital Fan Cards-a groundbreaking way for fans to connect with their favorite athletes and celebrities like never before. More than just a collectible, Fantribe Fan cards will allow subscribers to unlock exclusive digital content, VIP experiences, watch parties, and special discounts. The first Fantribe Digital Fan cards are expected to be released March 31, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Are Fantribe Fancards?</strong></p><p class=\"\">Fantribe Digital cards are physical, premium-designed cards featuring your favorite athletes and celebrities. Each card is embedded with a unique QR code that, when scanned, grants access to exclusive digital content, behind-the-scenes footage, and even personal messages from the athletes, celebrities and creators themselves. But that's just the beginning.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Unlock VIP Experiences</strong></p><p class=\"\">Fantribe Fancards go beyond digital content-owning one can grant you access to VIP events, meet-and-greets, and even once-in-a-lifetime experiences with your favorite celebrities. Whether it's an invite to an intimate gathering, a backstage pass, or a private watch party, Fantribe Digital Fan cards provide real-world perks that take fandom to the next level.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Parties with the Stars</strong></p><p class=\"\">Imagine watching your favorite shows, concerts, or events alongside the celebrities themselves. Fantribe Digital Fan cards offer exclusive access to virtual and in-person watch parties through the Fantribe mobile app, allowing you to experience moments like never before, with behind-the-scenes commentary and interactive fan engagement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exclusive Discounts &amp; Perks</strong></p><p class=\"\">As a Fantribe card holder, you're not just collecting a card-you're unlocking a world of rewards. Enjoy discounts on exclusive merchandise, early access to special events, and other perks that bring you closer to the stars you admire.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Limited-Edition &amp; Collectible</strong></p><p class=\"\">Each Fantribe digital card is a limited-edition release, making it a highly sought-after collectible. Whether you're a longtime fan or just starting your collection, these cards hold unique value, both as memorabilia and as a gateway to unforgettable experiences.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Future of Fan Engagement</strong></p><p class=\"\">Fantribe digital cards will redefine what it means to be a fan, bridging the gap between athletes, celebrities, creators and their supporters in an interactive and meaningful way.</p><p class=\"\">\"Physical trading cards have always been a beloved medium for sports fans to connect with their favorite players and teams,\" said Michael Friedman, CEO of Fantribe. Every athlete partnering with Fantribe as a creator will have his or her own card series, and offer their fans a digital trading card that can receive multiple, new digital experiences from the creator on demand. Fans that love cardboard collectibles can now also have a personal digital experiences every month with the athlete or celebrity they follow and admire.\"</p><p class=\"\">Over the coming months, Fantribe will introduce a series of licensed digital trading collections that blend popular sports stars, celebrities and creators including behind-the-scenes clips, VIP experiences and brand offers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fantribe Inc.</strong></p><p class=\"\">Fantribe is an end-to-end community engagement digital platform that bridges the gap between athletes, creators, and their fans through premium, engaging, and monetisable experiences. The platform when completed with expected launch in March 2025, will allow athletes, celebs and creators of all types to integrate and import their existing social platforms from Instagram, Tik Tok, Facebook and others for access for Fans. Fans will receive points for accessing the creator platform under the freemium model used for purchase of goods, memorabilia and brands offered by Fantribe creators. Fantribe functions will include one-to-one chat, video streaming, e-commerce, and push campaigns for brand endorsements to its users. As a wholly owned subsidiary of Tritent International Corp. , Fantribe is committed to empowering creators and redefining the $250 billion creator economy. For more information about Fantribe and how it offers a stable and reliable alternative in the evolving digital landscape, visit www.fantribe.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Tritent International Corp.</strong></p><p class=\"\">Tritent International Corp. is a publicly traded company and diversified corporation focusing on strategic alliances within the Real Estate, Energy and Logistic sector. Our strategy is aimed towards the acquisition of controlling equity interests in disruptive companies by taking an active role to improve their growth, provide capital and management expertise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fantribe Inc.</p><p class=\"\">Michael Friedman, President</p><p class=\"\">Email: hello@fantribe.commichael@firstlevelcapital.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Fan Tribe Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSt7kXka:0/",
            "pub_date": "2025-02-04 23:17:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308966:0",
            "title": "Fox Plans to Launch Direct-to-Consumer Streaming Service by Year-end, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox  is targeting to launch a direct-to-consumer streaming service by the end of 2025, Chief Executive Lachlan Murdoch said Tuesday on the company's fiscal Q2 earnings call, according to a FactSet transcript. </p><p class=\"\">Murdoch did not provide many details regarding the upcoming streaming service but said the company has no plans of turning a traditional distribution customer into a direct-to-consumer one. \"And so our subscriber expectations will be modest and we're going to price the service accordingly,\" the executive said. </p><p class=\"\">Shares were over 4% higher in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308966:0/",
            "pub_date": "2025-02-04 23:17:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308975:0",
            "title": "Hain Celestial to Launch Distribution Center in Georgia; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hain Celestial Group  said Tuesday it will launch a distribution center in Savannah, Georgia, this month. </p><p class=\"\">This will mark the company's fourth distribution center in the US, it said. </p><p class=\"\">Hain Celestial shares were up more than 1% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308975:0/",
            "pub_date": "2025-02-04 23:17:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007785:0",
            "title": "LiveRamp Holdings Price Target Maintained With a $42.00/Share by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007785:0/",
            "pub_date": "2025-02-04 23:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OU0VQ:0",
            "title": "US job openings fall sharply in December; layoffs low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S. job openings dropped sharply in December, but low layoffs suggested that the labor market was not abruptly slowing down.</p><p class=\"\">Job openings, a measure of labor demand, decreased 556,000 to 7.6 million on the last day of December, the Labor Department's Bureau of Labor Statistics said in its Job Openings and Labor Turnover Survey, or JOLTS report, on Tuesday.</p><p class=\"\">Data for November was revised slightly higher to show 8.156 million vacancies instead of the previously reported 8.098 million. Economists polled by Reuters had forecast 8.0 million unfilled positions. </p><p class=\"\">Layoffs fell 29,000 to 1.771 million. It is, however, becoming harder for laid off workers to find new jobs as employers remain cautious about adding headcount. Hires increased 89,000 to 5.462 million.</p><p class=\"\">The Federal Reserve left its benchmark overnight interest rate unchanged in the 4.25%-4.50% range last week amid uncertainty over the economic impact of President Donald Trump's fiscal, trade and immigration policies. </p><p class=\"\">The policy rate has been reduced by 100 basis points since September when the U.S. central bank started its easing policy cycle. Fed Chair Jerome Powell told reporters \"we do not need to be in a hurry to adjust our policy stance.\" </p><p class=\"\">The central bank hiked the policy rate by 5.25 percentage points in 2022 and 2023 to tame inflation. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OU0VQ:0-us-job-openings-fall-sharply-in-december-layoffs-low/",
            "pub_date": "2025-02-04 23:18:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007793:0",
            "title": "U.S. Factory Orders Fell in December",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">Orders for goods from American manufacturers fell in December, a second straight month of declines, according to Commerce Department data released Tuesday.</p><p class=\"\">U.S. factory orders declined by 0.9% in the last month of 2024 to $578.5 billion, from $583.7 billion in November. Economists surveyed by The Wall Street Journal had expected factory orders to fall by 0.8% month over month.</p><p class=\"\">The latest November figure also reflected a downward revision from the Commerce Department's initial estimate a month ago.</p><p class=\"\">Despite the recent declines, factory orders overall have held relatively steady since mid-2022, following a sharp recovery from an initial downturn at the start of the 2020 pandemic.</p><p class=\"\">In December, orders for durable goods fell by 2.2% to $276.1 billion, including a 7.4% decrease in orders for transportation equipment. Nondurable-goods orders grew by 0.3% to 302.4 billion.</p><p class=\"\">U.S. factory shipments grew 0.6% to $589.7 billion, and unfilled orders fell by 0.5% to $1.396 trillion, after a previous stretch of five straight months of increases.</p><p class=\"\">Inventories grew in December for the second month in a row by 0.4% to $863.2 billion.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007793:0/",
            "pub_date": "2025-02-04 23:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007381:0",
            "title": "Spotify swings to a profit as subscribers top estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Gelsi</p><p class=\"\">User growth of 12% powers revenue past estimates</p><p class=\"\">Spotify Technology S.A. reported a fourth-quarter profit as the music streaming service's monthly active users climbed by double-digits over the year-ago period, sending shares of the company up sharply higher in premarket trading.</p><p class=\"\">Spotify (SPOT) said it expects to add 3 million net new monthly active users (MAUs) to 678 million by the end of the first quarter. That's a little bit above the FactSet consensus estimate of 677 million.</p><p class=\"\">Spotify ended the fourth quarter with about 675 million monthly active users, up 12% from the year-ago period and ahead of the previous  quarter by 5%.</p><p class=\"\">Spotify's monthly active user figure of 675 million also beat the Wall Street analyst consensus estimate of 664 million.</p><p class=\"\">Spotify also swung to a profit of  EUR1.76 a share from a loss of EUR0.36 in the year-ago quarter. The company was expected to earn  EUR1.99 a share.</p><p class=\"\">The company said its fourth-quarter revenue rose to EUR4.24 billion, ahead of the FactSet consensus estimate of  EUR 4.15 billion.</p><p class=\"\">Looking ahead, Spotify projected first-quarter revenue of EUR4.2 billion, slightly below the analyst estimate of just under EUR4.3 billion.</p><p class=\"\">Spotify's stock was up 8.8% in premarket trading.</p><p class=\"\">(This is a developing news story with updates to come.)</p><p class=\"\">-Steve Gelsi</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007381:0/",
            "pub_date": "2025-02-04 23:19:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204010530:0",
            "title": "Should Comcast split into three? This analyst says a breakup would mean big upside.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Emily Bary</p><p class=\"\">A Wolfe Research analyst argues Comcast's conglomerate structure is holding back the stock</p><p class=\"\">Comcast Corp. has plans to spin off some of its cable networks. But one analyst is now telling management to do a more dramatic restructuring.</p><p class=\"\">Wolfe Research's Peter Supino hasn't been shy about making suggestions to Comcast (CMCSA) Chief Executive Brian Roberts. When he was a Bernstein analyst five years ago, he wrote an open letter suggesting the company spin out NBCUniversal and Sky. \"Recently, when Comcast announced its intention to spin-out its cable TV networks, we thought 'yes, keep going!'\" Supino wrote on Tuesday.</p><p class=\"\">See more: Will Comcast's spinoff of some cable networks give the stock the desired bump?</p><p class=\"\">Today he's back with another open letter urging management to separate into three businesses. \"Three public companies with focused incentives could trade for 57% more\" than Comcast's Monday close of $33.19, he said in a lead-up to the letter.</p><p class=\"\">Comcast didn't immediately respond to a MarketWatch request for comment.</p><p class=\"\">Comcast is a sprawling business that operates television networks, movie studios and theme parks while also running a broadband business in the U.S. and the Sky pay-TV business in the U.K. Media peers Walt Disney Co. (DIS), Warner Bros. Discovery Inc. (WBD) and Charter Communications Inc. (CHTR) each do some of those things, but not all of them, and their stocks all trade for higher multiples of enterprise value to earnings before interest, taxes, depreciation and amortization, Supino noted.</p><p class=\"\">\"We believe that the market discounts Comcast's value severely because of concerns about returns on capital and instances of misalignment of leadership and shareholders,\" Supino wrote in the letter. \"We truly believe that as long as Comcast persists as a conglomerate, such concerns are likely to hamper the stock.\"</p><p class=\"\">Supino worried that it would be difficult for Comcast to accelerate its Xfinity cable business, which makes up more than half of its revenue but is besieged by competitive pressures. As he put it, \"very high cable broadband prices have attracted strong competition that many people prefer.\"</p><p class=\"\">Don't miss: Comcast seen taking 'one step forward, two steps back' in tough broadband market</p><p class=\"\">Add together broadcast television, Peacock streaming, cable networks and Sky, and you get another group unlikely to show an acceleration, in Supino's view. \"Comcast's media portfolio, excluding Universal and NBC Sports, has been disrupted and seemingly passed competitively,\" he wrote.</p><p class=\"\">Meanwhile, Comcast has a \"vibrant\" theme-park and movie business in Universal, according to Supino. But he thinks this unit has a hard time moving the needle for the overall company, Universal's studios and parks account for just 16% of gross revenue.</p><p class=\"\">A breakup of the company would create \"focused, long-term equity incentives to align and embolden management,\" Supino wrote.</p><p class=\"\">Were Comcast to make the move, it wouldn't be alone, as General Electric broke into three companies last year.</p><p class=\"\">-Emily Bary</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204010530:0/",
            "pub_date": "2025-02-04 23:19:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007796:0",
            "title": "Quest Diagnostics Is Maintained at Neutral by JP Morgan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007796:0/",
            "pub_date": "2025-02-04 23:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007792:0",
            "title": "Bombardier Shares Rally on Tariff Pause — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bombardier bounces back as investors breathe a sigh of relief for the month-long pause on tariffs on Canadian imports. Bombardier's business is particularly vulnerable to US tariffs considering many of its business jets are sold to US customers. The company's shares gyrated in the run-up to Trump's tariffs, falling nearly 12% on Monday before recovering throughout the day after the tariff pause was announced. Bombardier is 4.3% higher at C$86.34. (adriano.marchese@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007792:0/",
            "pub_date": "2025-02-04 23:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446583:0",
            "title": "US Stocks Rebound",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P 500 was up 0.5% and the Nasdaq gained 1.1% while the Dow Jones traded around the flatline on Tuesday, as traders attempt to shrug off concerns about the trade war while digesting fresh corporate results and key economic data.</p><p class=\"\">The 10% US tariffs on Chinese imports took effect today, prompting an immediate response from Beijing, but markets remain cautiously optimistic that further escalation could be avoided.</p><p class=\"\">Meanwhile, job openings in the US came below forecasts and factory orders fell more than anticipated, offering more evidence the Fed still has room to cut rates this year.</p><p class=\"\">Meanwhile, Alphabet is due to report quarterly results today after the closing bell.</p><p class=\"\">Merck sank about 10% after its 2025 sales guidance disappointed.</p><p class=\"\">Also, PepsiCo lost more than 2% after a revenue miss.</p><p class=\"\">On the other hand, Palantir soared about 22% after the company strong guidance and sales forecast and Pfizer gained about 2.4% after its earnings and revenue topped forecasts.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446583:0-us-stocks-rebound/",
            "pub_date": "2025-02-04 23:19:14",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308974:0",
            "title": "Rackspace Technology, Munster Technological University Team Up for Quantum Cloud Computing Hub on AWS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rackspace Technology  said Tuesday it is collaborating with Munster Technological University in Ireland to launch QCloud, a quantum cloud computing hub on Amazon's  Amazon Web Services. </p><p class=\"\">Financial terms of the collaboration were not disclosed. </p><p class=\"\">The partnership focuses on collaborative research and removing barriers to accessing quantum computing technologies, according to the company.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308974:0/",
            "pub_date": "2025-02-04 23:19:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSWMXq0a:0",
            "title": "Scotts and Landon Dickerson Team Up To Keep Philadelphia’s Fields Safe for Young Athletes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / <em><strong class=\"root-Tkn6WL2y\">Story by Emily Fazio</strong></em></p><p class=\"\">Originally published by MSN</p><p class=\"\">As the cost of youth sports continues to rise, many families are finding it harder to afford the activities their kids are passionate about. Beyond that, ensuring that families have safe, natural spaces to play is just as important. This is where Scotts, a long-standing leader in the lawn care industry, made a difference with its \"Keep It Real\" sweepstakes.</p><p class=\"\">Continue reading here</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ScottsMiracle-Gro</strong></p><p class=\"\">With approximately $3.6 billion in sales, the Company is the world's largest marketer of branded consumer products for lawn and garden care. The Company's brands are among the most recognized in the industry. The Company's Scotts®, Miracle-Gro®, and Ortho® brands are market-leading in their categories. The Company's wholly-owned subsidiary, The Hawthorne Gardening Company, is a leading provider of nutrients, lighting, and other materials used in the indoor and hydroponic growing segment. For additional information, visit us at www.scottsmiraclegro.com.</p><p class=\"\">The West Philly Panthers coaches and players meet with Philadelphia Eagles player Landon Dickerson to celebrate winning enough Scotts product for a full field makeover. © Scotts / Images provided by alansimpsonphotography.com</p><p class=\"\">View additional multimedia and more ESG storytelling from Scotts Miracle-Gro on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Scotts Miracle-Gro</p><p class=\"\">Website: https://www.3blmedia.com/profiles/scotts-miracle-gro</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Scotts Miracle-Gro</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSWMXq0a:0/",
            "pub_date": "2025-02-04 23:20:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1JD:0",
            "title": "Netflix crosses $1,000 mark for the first time",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of streaming giant Netflix  crossed the $1,000 mark for the first time on Tuesday; last up 2.1% at $1,006.2 </p><p class=\"\">** NFLX set to gain for the third straight session</p><p class=\"\">** NFLX reported on Jan. 21 after markets close a record 18.9 million subscribers in the holiday quarter</p><p class=\"\">** NFLX rose 83% in 2024; and is up 12% YTD </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1081.1688311688313px;aspect-ratio:1.801948051948052\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV1JD-d5a5c80d8e855e1a6aeb4db169ab498c-resized.webp\" type=\"images/webp\"/><img alt=\"Netflix crosses $1,000 mark for the first time\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV1JD-d5a5c80d8e855e1a6aeb4db169ab498c-resized.jpeg\" style=\"background-color:#1d1d1d\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Netflix crosses $1,000 mark for the first time</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1JD:0-netflix-crosses-1-000-mark-for-the-first-time/",
            "pub_date": "2025-02-04 23:12:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_APN2MM02R:0",
            "title": "US Dec factory orders data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 4 (Reuters) - For the U.S. Commerce Department's data on U.S. factory orders, shipments and unfilled orders, see:    https://www.census.gov/manufacturing/m3/prel/pdf/s-i-o.pdf</p><p class=\"\">((Washington newsroom, +1 202 898-8300, fax +1 202 898-8383, washington.economic.newsroom@reuters.com))</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_APN2MM02R:0-us-dec-factory-orders-data/",
            "pub_date": "2025-02-04 23:12:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308972:0",
            "title": "Citigroup Adjusts Price Target on PTC to $195 From $200",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PTC  has an average rating of overweight and mean price target of $215.72, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308972:0/",
            "pub_date": "2025-02-04 23:12:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308973:0",
            "title": "UBS Adjusts Price Target on Trivago to $2.75 From $1.95, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Trivago  has an average rating of hold and mean price target of $2.41, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308973:0/",
            "pub_date": "2025-02-04 23:13:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007725:0",
            "title": "Unemployment Seen Holding Steady — Data Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The following are median forecasts for this week's remaining U.S. data from a survey compiled by The Wall Street Journal.</p><p class=\"\">Forecasts were last updated Monday afternoon.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>DATE      TIME  RELEASE                       PERIOD     CONSENSUS    PREVIOUS <br/>Wednesday 0815  ADP Jobs                       Jan       +150K   (7)  +122K <br/>          0830  U.S. Trade Deficit             Dec       $96.8B  (22) $78.19B <br/>          0945  S&amp;P Global U.S. Svcs PMI       Jan        52.9   (8)   52.8* <br/>          1000  ISM Non-Mfg PMI                Jan        54.3   (22)  54.1 <br/>Thursday  0830  Jobless Claims                 Feb 1      214K   (18)  207K <br/>          0830  Productivity (Prelim)          4Q        +1.4%   (19) +2.2%** <br/>          0830  Unit Labor Costs (Prelim)      4Q        +3.3%   (17) +0.8%** <br/>Friday    0830  Nonfarm Payrolls               Jan       +169K   (26) +256K <br/>          0830  Unemployment Rate              Jan        4.1%   (26)  4.1% <br/>          0830  Avg. Hourly Wages M/M***       Jan       +0.3%   (25) +0.28% <br/>          0830  Avg. Hourly Wages Y/Y***       Jan       +3.7%   (15) +3.93% <br/>          1000  Consumer Sentiment             Feb        71.3   (18)  71.1**** <br/>                  (Prelim) <br/>          1000  Wholesale Inventories          Dec       -0.5%   (8)  -0.2% <br/>          1500  Consumer Credit                Dec      +$14.0B  (13) -$7.5B <br/> <br/>*Jan Flash Reading <br/>**3Q Final Reading <br/>***All private-sector workers <br/>****End-Jan Reading <br/> <br/>(Figures in parentheses refer to number of economists surveyed.) <br/> <br/>Write to Tim Merle at dataweekahead@wsj.com </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007725:0-unemployment-seen-holding-steady-data-week-ahead/",
            "pub_date": "2025-02-04 23:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007723:0",
            "title": "Cardinal Health Is Maintained at Neutral by JP Morgan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:14 GMT) </strong>Cardinal Health Price Target Raised to $145.00/Share From $142.00 by JP Morgan</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007723:0/",
            "pub_date": "2025-02-04 23:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV21C:0",
            "title": "Berry Global Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Berry Global Group Inc  reported quarterly adjusted earnings of $1.09​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $1.22.  The mean expectation of twelve analysts for the quarter was for earnings of 97 cents per share. Wall Street expected results to range from 90 cents to $1.12 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 16.4% to $2.39 billion from a year ago; analysts expected $2.34 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $14 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Berry Global Group Inc shares had risen by 3.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 33.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, seven analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 12 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the non-paper containers &amp; packaging peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Berry Global Group Inc is $75.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:13 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.97</p></td><td><p class=\"\">1.09</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.25</p></td><td><p class=\"\">2.27</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.06</p></td><td><p class=\"\">2.18</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.91</p></td><td><p class=\"\">1.95</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV21C:0-berry-global-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:14:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446580:0",
            "title": "Oil Attempts Rebound Amid Iran Sanctions Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WTI crude oil futures rebounded to just below $73 per barrel on Tuesday after hitting a session low of $70.65, as expectations grew that the US would tighten sanctions on Iran.</p><p class=\"\">President Trump is set to restore \"maximum pressure\" on Iran, aiming to cut off its oil exports completely and counter its regional influence.</p><p class=\"\">This move would include new sanctions and stricter enforcement against violators.</p><p class=\"\">Earlier, crude prices fell due to escalating US-China trade tensions.</p><p class=\"\">China retaliated against US tariffs with levies on American coal, LNG, and crude oil, raising fears of weaker global demand.</p><p class=\"\">Meanwhile, OPEC+ confirmed plans to gradually increase oil output from April.</p><p class=\"\">Investors are also watching US oil stockpile data, with analysts expecting a rise in crude inventories but a decline in gasoline and distillate stocks.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446580:0-oil-attempts-rebound-amid-iran-sanctions-concerns/",
            "pub_date": "2025-02-04 23:14:37",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007739_20250204007740:0",
            "title": "Novartis Sets High Bar for Potential Obesity Deals, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007739_20250204007740:0/",
            "pub_date": "2025-02-04 23:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007739_20250204007742:0",
            "title": "Novartis Continues to Develop In-House Obesity Projects, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007739_20250204007742:0/",
            "pub_date": "2025-02-04 23:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007734:0",
            "title": "Fox Plans to Launch New Streaming Service by Year-End — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Flint and Dean Seal</p><p class=\"\">Fox Corp. said it plans to launch a direct-to-consumer subscription streaming service that will include content from Fox News and Fox Sports by the end of 2025, its biggest foray yet into subscription streaming.</p><p class=\"\">Chief Executive Lachlan Murdoch said the new offering is meant to complement pay-TV subscriptions, not replace them. The company has previously resisted developing a broad streaming offering because it didn't want to cannibalize the revenue it receives from pay-TV distributors.</p><p class=\"\">\"We see the traditional cable bundle as still the most value for our customers and frankly the most value for our company,\" Murdoch told analysts on a call Tuesday discussing the company's most recent quarterly results.</p><p class=\"\">Murdoch provided few details on the service, including its price point or whether all Fox News and sports content would be included. He said expectations for subscriber numbers would be modest.</p><p class=\"\">Fox has taken baby steps into streaming thus far. It owns the popular free, advertiser-supported streaming service Tubi. Tubi plans to air the Super Bowl live on Sunday.</p><p class=\"\">Fox News has a streaming service called Fox Nation, which carries a mix of original content and some material from its Fox News channel. The service, which has more than 2 million subscribers, costs as much as $7.99 a month and doesn't include a live feed of the channel.</p><p class=\"\">Fox's fiscal second quarter, which ended Dec. 31, was boosted by strong advertising revenue from the election season and sports.</p><p class=\"\">The media company reported net income of $373 million, or 81 cents a share, up from $109 million, or 23 cents a share, in the same quarter a year ago.</p><p class=\"\">Stripping out one-time items, adjusted earnings were 96 cents a share. Analysts polled by FactSet had been expecting 69 cents a share.</p><p class=\"\">Revenue rose 20% to $5.08 billion, above analyst projections for $4.87 billion, according to FactSet.</p><p class=\"\">Fox's cable-network business, which includes Fox Sports 1, Fox Business and Fox News, posted a 31% jump in revenue from higher affiliate fees that offset a decline in subscribers. Advertising revenue was up 32% on higher news ratings, prices and digital ad sales, along with higher ratings for Major League Baseball's postseason.</p><p class=\"\">The company's television segment logged 16% higher revenue thanks to the strong MLB ratings, higher prices for National Football League advertisements, political ads and growth for ad-supported video on demand at the Tubi subsidiary.</p><p class=\"\">Write to Joe Flint at Joe.Flint@wsj.com and Dean Seal at dean.seal@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007734:0/",
            "pub_date": "2025-02-04 23:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007736:0",
            "title": "Clorox Is Maintained at Neutral by JP Morgan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007736:0/",
            "pub_date": "2025-02-04 23:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:ca6d27434094b:0",
            "title": "Bitcoin Price On The Brink: Failure To Hold This Level May Trigger Crash To $74,000",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitcoin (BTC) and other cryptocurrencies are experiencing renewed selling pressure as escalating trade tensions between the United States and China lead to fresh tariffs on both sides. The largest cryptocurrency dropped to as low as $91,000 on Monday, while major altcoins like Ethereum (ETH) and Solana (SOL) also faced losses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CME Bitcoin Futures Open Interest Drops 4%</strong></p><p class=\"\">The most recent installment of tariffs comes after the US enacted a 10% tax on all items from China, leading China to respond with its own tariffs on certain US imports, such as oil and liquefied natural gas, starting February 10. </p><p class=\"\">In another development, China has launched an inquiry into Google LLC over supposed antitrust infringements, intensifying the tension between the two economic giants.</p><p class=\"\">This market turbulence has wiped out the benefits from a short relief rally on Monday, which occurred after the Trump administration decided to postpone tariffs on Mexico and Canada for a month. The weekend’s initial declaration of US tariffs had already triggered a steep drop in cryptocurrency prices.</p><p class=\"\">Investor trust in riskier assets has been notably affected, as US investors pulled a net $235 million from a set of 12 Bitcoin-centric exchange-traded funds (ETFs) on Monday.</p><p class=\"\">Moreover, open interest in Bitcoin futures contracts on the Chicago Mercantile Exchange (CME) Group Inc.’s derivatives market decreased by 4%, reflecting a more cautious attitude among institutional investors.</p><p class=\"\">President Donald Trump, recognized for his pro-crypto position, has unintentionally brought more uncertainty to digital asset markets. </p><p class=\"\">Although cryptocurrencies experienced a rise following Trump’s election, the market now faces a difficult landscape marked by geopolitical strife and regulatory obstacles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Historical Trends Suggest Potential For Deeper Corrections</strong></p><p class=\"\">As of this writing, Bitcoin was trading at $98,970, about 13% shy of its all-time high. Meanwhile, US ETFs investing in Ethereum witnessed record trading volumes on Monday, with significant liquidation of leveraged positions rattled by ongoing trade uncertainties. </p><p class=\"\">The iShares Ethereum Trust, led by BlackRock, accounted for nearly half of the $1.5 billion in trading volume among a group of nine ETFs. ETH plummeted by as much as 27% on Monday, leading to over $600 million in liquidations within perpetual futures markets, according to Bloomberg data.</p><p class=\"\">Analyzing current price trends, crypto analyst Ali Martinez identified $92,180 as a critical support level for Bitcoin, based on MVRV (Market Value to Realized Value) pricing bands. </p><p class=\"\">If this support level fails, the next target could be $74,400. Despite the recent price correction, Bitcoin traders are still enjoying a profit margin of 3.36%. </p><p class=\"\">Historically, local bottoms have formed when profit margins drop below -12%, suggesting that Bitcoin could have further downside potential before reaching a true bottom.</p><p class=\"\">Additionally, the MVRV Momentum indicator has remained in negative territory since the beginning of the year, signaling ongoing market weakness. </p><p class=\"\">Featured image from DALL-E, chart from TradingView.com</p></span></div>",
            "link": "https://www.tradingview.com/news/newsbtc:ca6d27434094b:0-bitcoin-price-on-the-brink-failure-to-hold-this-level-may-trigger-crash-to-74-000/",
            "pub_date": "2025-02-04 23:15:02",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308969:0",
            "title": "BofA Securities Raises Price Target on Palantir Technologies to $125 From $90, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies  has an average rating of hold and mean price target of $82.25, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308969:0/",
            "pub_date": "2025-02-04 23:08:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308970:0",
            "title": "UBS Adjusts Price Target on TripAdvisor to $18 From $17, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TripAdvisor  has an average rating of hold and mean price target of $17.36, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308970:0/",
            "pub_date": "2025-02-04 23:08:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308747:0",
            "title": "US RealClearMarkets/TIPP Economic Optimism Index Rises Slightly to 52.0 in February From 51.9 in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308747:0/",
            "pub_date": "2025-02-04 23:08:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463512:0",
            "title": "Saudi Cement Co Lifts Dividend for H2 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saudi Cement Co (SASE:3030) said Tuesday its board recommended a cash dividend of 1.5 riyals per share for the second half of 2024, up from the prior-year period's 1 riyal per share. </p><p class=\"\">The latest dividend amounts to a total of 229.5 million riyals. The cement manufacturer will later disclose the distribution date.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463512:0/",
            "pub_date": "2025-02-04 23:08:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}