{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463696:0",
            "title": "Sweden's Saab Opens Manufacturing Center in UK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saab (SAAB-B.ST) opened a new three-building manufacturing facility in Hampshire, UK, according to a Tuesday release. </p><p class=\"\">The Swedish defense and security company will develop, manufacture and support its radar systems and underwater robotics portfolio at the campus in Fareham.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463696:0/",
            "pub_date": "2025-02-05 12:48:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463699:0",
            "title": "Frasers Logistics & Commercial Trust Reports 94.3% Occupancy in Fiscal Q1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Frasers Logistics &amp; Commercial Trust  reported an occupancy rate of 94.3% for the fiscal first quarter ended Dec. 31, 2024, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">Weighted average lease expiry or WALE stood at 4.6 years, while the trust leased around 175,000 square meter of space during the period. </p><p class=\"\">The trust reported a total portfolio value of SG$6.8 billion across 114 properties as of Dec. 31, 2024. </p><p class=\"\">Shares of the trust were up over 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463699:0/",
            "pub_date": "2025-02-05 12:49:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014706:0",
            "title": "Perusahaan Gas Negara's Earnings Performance Likely Solid, Steady — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Perusahaan Gas Negara's earnings performance is likely to be solid and steady, Maybank Sekuritas Indonesia analysts say in a research report. The brokerage likes the Indonesian natural-gas distributor for its strong free cash flow generation, which offers flexibility for reinvestment, debt repayment and high dividends. The company serves industries such as power, food and chemicals, and is expanding to include households, the analysts note. The brokerage anticipates the company to deliver stable revenue of $2.9 billion per year for 2025-2026. It initiates coverage of the stock with a buy rating and a target price of IDR2,000.00. Shares are 1.6% higher at IDR1,610.00. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014706:0/",
            "pub_date": "2025-02-05 12:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014707:0",
            "title": "Global Energy Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy markets. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0450 GMT - Perusahaan Gas Negara's earnings performance is likely to be solid and steady, Maybank Sekuritas Indonesia analysts say in a research report. The brokerage likes the Indonesian natural-gas distributor for its strong free cash flow generation, which offers flexibility for reinvestment, debt repayment and high dividends. The company serves industries such as power, food and chemicals, and is expanding to include households, the analysts note. The brokerage anticipates the company to deliver stable revenue of $2.9 billion per year for 2025-2026. It initiates coverage of the stock with a buy rating and a target price of IDR2,000.00. Shares are 1.6% higher at IDR1,610.00. (ronnie.harui@wsj.com)</p><p class=\"\">0309 GMT - China's countermeasures to impose tariffs on U.S. energy products should have limited impact, Citi analysts Oscar Yee and Desmond Law say in a research note. The U.S. only accounted for around 2% and 6% of China's 2024 crude oil and liquefied natural gas imports, respectively, making it easy to diversify to other sources, they say. The analysts note market focus should be on whether Beijing imposes further tariffs on ethane, propane and polyethylene, which could have much bigger impact, given that the U.S. represents around 99%, 59% and 17%, respectively, of China's 2024 imports. (sherry.qin@wsj.com)</p><p class=\"\">0248 GMT - China's tariffs announced Tuesday may have limited near-term impact on energy prices, Goldman Sachs commodities analysts say in a research report. \"Neither global supply nor demand of these commodities are changed by China's tariffs,\" the analysts say. \"Impacted U.S. volumes are likely to easily find alternative buying markets, while China replaces impacted import volumes with alternative suppliers,\" they add. However, there could be a potential pause in new long-term liquefied natural gas contract talks between China buyers and U.S. LNG facilities. Given that most proposed U.S. LNG facilities require that a substantial portion of their capacity is contracted under long-term deals to obtain financing, such a pause might delay new U.S. LNG export facilities reaching a final investment decision, the analysts add. (ronnie.harui@wsj.com)</p><p class=\"\">0129 GMT - Oil futures edge higher in Asian trading. However, near-term prices for global crude oil are likely to remain capped due to supply risks and potential trade challenges, says Hassan Fawaz, GivTrade's chairman and founder. Trade tensions between the U.S. and China may also affect demand levels, he says. Caution could dominate, leading to pressure on oil prices, he says. Front-month WTI crude oil futures rise 0.2% to $72.85/bbl; front-month Brent crude oil futures are up 0.1% at $76.28/bbl. (amanda.lee@wsj.com)</p><p class=\"\">2328 GMT - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2318 GMT - Risks to Macquarie's balance sheet from its investments in renewable energy look manageable to Morgan Stanley. Analyst Andrei Stadnik estimates some A$2 billion of Macquarie's principal investments, or 18%, are in green energy. Still, only 10% of investments by Corio--Macquarie's unit focused on offshore wind-energy developments--are in the U.S. and exposed to policy shifts by the Trump administration. \"Elsewhere, we estimate Macquarie booked a A$50 million gain on sale of Formosa 2 offshore wind in Asia, so offshore wind transactions are continuing,\" Morgan Stanley says. \"Nonetheless, we have baked in a A$150 million 2H impairment charge for principal investments in renewables.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1917 GMT - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1906 GMT - U.S. natural gas futures lose ground, but end above the day's lows as weather forecasts shift between colder and milder. The impact of China's decision to slap a 15% retaliatory tariff on imports of U.S. LNG is difficult to gauge, forecaster NatGasWeather.com says in a note. \"Weather trends the next few days will continue to be very important and are likely to dictate the direction of trade.\" The Nymex front month settles down 3% at $3.253/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">1336 GMT - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">1425 GMT - Crude prices extend losses in midday trade amid heightened fears of a trade war between the U.S. and China that could hurt global growth and increase inflationary pressures. Brent crude is down 2.3% to $74.22 a barrel, while WTI falls 3.3% to $70.75 a barrel. Both benchmarks erased all the previous session's gains, also due to easing concerns over immediate disruption of Canadian and Mexican oil flows after U.S. President Trump agreed to hold off imposing tariffs on the two neighboring countries. \"The next key support levels to watch are $69.50 and $66,\" says Razan Hilal, market analyst at Forex. \"A deeper decline could signal the start of a more extended bearish trend.\" (giulia.petroni@wsj.com)</p><p class=\"\">1310 GMT - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">1245 GMT - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014707:0/",
            "pub_date": "2025-02-05 12:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0HC:0",
            "title": "Toyota to set up wholly owned EV, battery unit in China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  will establish a wholly owned company in Shanghai to develop and produce electric vehicles and batteries for the Lexus brand, with production set to start in 2027, the world's top-selling automaker said on Wednesday.</p><p class=\"\">In a statement, Toyota said the unit would develop a new Lexus EV and that initial production capacity would be about 100,000 units a year. About 1,000 new jobs are planned in the start-up phase, it said.</p><p class=\"\">Toyota also said it would partner with the Shanghai municipal government for carbon-neutral initiatives, aiming to \"contribute to the Chinese government's goal of achieving carbon neutrality by 2060\".</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0HC:0-toyota-to-set-up-wholly-owned-ev-battery-unit-in-china/",
            "pub_date": "2025-02-05 12:50:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0GR:0",
            "title": "Toyota raises full-year profit outlook by 9% to nearly $31 bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Toyota Motor  raised its full-year operating profit forecast by 9% on Wednesday, in a sign of confidence in its ability to ride out any potential U.S. tariffs.</p><p class=\"\">The world's top-selling automaker raised its profit forecast for the current year through March 2025 to 4.7 trillion yen ($30.7 billion) versus 4.3 trillion yen expected previously.</p><p class=\"\">The upward revision took into account progress in strengthening its earnings power, backed by efforts to improve the competitiveness of its products, Toyota said in presentation materials.</p><p class=\"\">Toyota made the revision despite posting a weaker-than-expected result for the third quarter, its second successive quarterly profit decline.</p><p class=\"\">Operating profit for the three months through December totalled 1.22 trillion yen, down 28% from 1.68 trillion yen a year earlier and compared with the 1.42 trillion yen average of nine analyst estimates in an LSEG poll.</p><p class=\"\">Over recent quarters, its profit was pushed higher by strong hybrid vehicle demand in the U.S. and other major markets.</p><p class=\"\">        Last week, Toyota reported global group unit sales of 10.8 million vehicles for 2024, making it the world's best-selling automaker for a fifth successive year.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0GR:0-toyota-raises-full-year-profit-outlook-by-9-to-nearly-31-bln/",
            "pub_date": "2025-02-05 12:50:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014709_20250204014709:0",
            "title": "Thai Credit Bank Target Price Raised to THB26.12 From THB26.00 by CGS International >CREDIT.TH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014709_20250204014709:0/",
            "pub_date": "2025-02-05 12:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463702:0",
            "title": "Market Chatter: IMF Calls for Trade Truce Among US, China, Canada, Mexico",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The International Monetary Fund called on the US, China, Canada, and Mexico to ease tensions and keep global trade on track, Reuters reported Wednesday. </p><p class=\"\">A spokesperson said the IMF is monitoring US tariff plans targeting China, Canada, and Mexico, adding that all parties would benefit from finding constructive solutions to disputes and ensuring the flow of trade, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463702:0/",
            "pub_date": "2025-02-05 12:51:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014710:0",
            "title": "Toyota Shares Extend Gains, Now Up 1.9% After 3Q Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014710:0/",
            "pub_date": "2025-02-05 12:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463705:0",
            "title": "Asian Paints' Consolidated Profit Declines in Fiscal Q3; Shares Down 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asian Paints  witnessed a decline in its consolidated attributable profit to 11.1 billion Indian rupees in the fiscal third quarter ended Dec. 31, 2024, against 14.5 billion rupees a year ago. </p><p class=\"\">Earnings per share contracted to 11.58 rupees compared with the year-ago figure of 15.10 rupees, according to a Tuesday filing to the Indian stock exchanges by the paint manufacturer. The EPS was lower than the 13.04 rupees estimated by analysts polled by Visible Alpha. </p><p class=\"\">Revenue from operations in fiscal Q3 declined to 85.5 billion rupees from 91.0 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down nearly 4% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463705:0/",
            "pub_date": "2025-02-05 12:53:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0GV:0",
            "title": "Australia's Audeara jumps over 20% on order win",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Audeara  rise 21.6% to A$0.045, easing from a jump of as much as 24.4%</p><p class=\"\">** Hearing-aid developer gets second purchase order from Avedis Zildjian worth $917,000 (A$1.47 mln)</p><p class=\"\">** Over 1 mln shares traded, 74x the 30-day daily avg</p><p class=\"\">** Despite the surge, the stock is still down ~10% YTD</p><p class=\"\"> ($1 = 1.6010 Australian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0GV:0-australia-s-audeara-jumps-over-20-on-order-win/",
            "pub_date": "2025-02-05 12:53:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463700:0",
            "title": "United Arab Bank's FY24 Net Profit, Total Income Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">United Arab Bank (ADX:UAB) said Tuesday that its net profit and total income for the full-year 2024 rose year over year. </p><p class=\"\">Net profit after tax for the 12 months ended Dec. 31, 2024, was 301 million Emirati dirhams, compared with 255 million dirhams earlier. EPS moved to 0.15 dirham from 0.12 dirham. </p><p class=\"\">The Abu Dhabi-listed bank's total income was 606 million dirhams, compared with 576 million dirhams a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463700:0/",
            "pub_date": "2025-02-05 12:54:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW02R:0",
            "title": "Wall St futures slip, dollar gives ground to yen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China sets firm fix for yuan, soothing devaluation worry</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar loses ground to yen, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Asian stock markets struggled to make headway on Wednesday as Wall Street futures took a knock from earnings disappointment, and the dollar backtracked on the yen following a fall in Treasury yields.</p><p class=\"\">Investors were also nonplussed by comments from President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.</p><p class=\"\">The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead.</p><p class=\"\">The mood was helped a little when Beijing set a firm fix for its yuan, countering concerns it might allow the currency to slide to offset the impact of tariffs on its exports.</p><p class=\"\">China has so far made a relatively restrained response to Trump's added 10% in tariffs, announcing levies that covered just $14 billion of U.S. exports to China.</p><p class=\"\">\"The measures are fairly modest, at least relative to U.S. moves, and have clearly been calibrated to try to send a message to the U.S. without inflicting too much damage,\" said Julian Evans-Pritchard, head of China economics at Capital Economics.</p><p class=\"\">\"The risk is that China's retaliation proves too modest to exert any real pressure on the U.S. to reverse tariffs, but sufficiently defiant to trigger a further escalation.\"</p><p class=\"\">A survey did show China's services activity expanded at a slower pace in January, but analysts suspected much of that was due to the timing of the Lunar New Year holidays.</p><p class=\"\">Chinese blue chips  returned from holiday with a minor dip of 0.2%. </p><p class=\"\">MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) added 0.6%, and South Korea's main index (KS11) bounced 1.2%. Japan's Nikkei  went flat as the yen rose broadly along with local bond yields.</p><p class=\"\">EUROSTOXX 50 futures  fell 0.5%, while FTSE futures  eased 0.2% and DAX futures  0.4% amid the lingering risk of U.S. taxes on trade.</p><p class=\"\">YEN RALLIES</p><p class=\"\">Having bounced on Tuesday, Wall Street futures ran into selling when Alphabet earnings missed forecasts as it ramped up spending on capex. Its shares dived 7.6% in extended trading, wiping $192 billion off its market capitalisation. </p><p class=\"\">S&amp;P 500 futures  fell 0.4% and Nasdaq futures  lost 0.5% in response. Results out Wednesday include Uber, Ford, Qualcomm and Walt Disney.</p><p class=\"\">The delays to tariffs on Canada and Mexico had at least eased worries the Federal Reserve might be severely restricted in how far it could cut interest rates and prompted a bounce in fund futures (0#FF:).</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) were back at 4.224% and off a peak of 4.282% hit on Monday. </p><p class=\"\">The pullback in yields coincided with a retreat in the dollar from its peaks, with the dollar index  down at 108.050 from Monday's spike top of 109.880. </p><p class=\"\">The euro firmed to $1.0380 , a remarkable round trip from the two-year trough of $1.0125 struck at the start of the week. Likewise, the dollar had recoiled to 1.4327 Canadian dollars  from a 22-year high of 1.4792.</p><p class=\"\">The dollar also slipped 0.7% on the Japanese yen to touch a seven-week low at 153.09 , breaking support at 153.72.</p><p class=\"\">Japanese government bond yields hit new multi-year highs after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.</p><p class=\"\">In commodity markets, gold hit a fresh all-time high at $2,848 an ounce  aided in part by the pullback in the dollar and yields. </p><p class=\"\">Oil prices were weighed by China's tariffs on imports of U.S. oil, but found support from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent  fell 35 cents to $75.85 a barrel, while U.S. crude  lost 22 cents to $72.48 per barrel.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW02R:0-wall-st-futures-slip-dollar-gives-ground-to-yen/",
            "pub_date": "2025-02-05 12:55:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463694:0",
            "title": "Sunrise Energy Metals Updates New South Wales Scandium Project Resource Estimate; Shares Rise Over 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sunrise Energy Metals  updated the mineral resource estimate for the firm's wholly-owned Syerston scandium project in New South Wales, according to a Wednesday Australian bourse filing. </p><p class=\"\">The updated resource estimate confirmed a global scandium resource comprising 60.3 million tonnes at 390 parts-per-million grade of scandium. </p><p class=\"\">The estimate will form the basis of a development plan and updated feasibility study for a stand-alone scandium mine and processing facility. </p><p class=\"\">The updated estimate is based on a total of 1,940 drill holes over 73,870 meters of drilling and includes 47,817 assays. </p><p class=\"\">The firm's shares rose over 4% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463694:0/",
            "pub_date": "2025-02-05 12:41:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463695:0",
            "title": "Kudelski to Cut 160 Roles Globally to Streamline Operations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kudelski  intends to reduce its global workforce by 160 positions as it looks to streamline its operations. </p><p class=\"\">As part of the reorganization, the Swiss digital security company will cut 40 to 45 positions in Switzerland, according to a Tuesday release. The plan will also involve the restructuring of its Nagravision business. </p><p class=\"\">The reorganization, which is expected to be mostly implemented by the first half, is estimated to reduce costs, enable the company to focus on its advanced security solutions, refine its global go-to-market approach, and enhance its overall efficiency and customer-centricity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463695:0/",
            "pub_date": "2025-02-05 12:42:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW098:0",
            "title": "Turkey - Factors To Watch on Feb 5",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Here are news, reports and events that may affect Turkish financial markets on Wednesday.</p><p class=\"\">The lira  traded at 35.95 against the U.S. dollar at 0239 GMT after closing at 35.94 on Tuesday.</p><p class=\"\">The main BIST 100 share index  closed 0.33% higher at 9,807.10 points on Tuesday.</p><p class=\"\">GLOBAL MARKETS</p><p class=\"\">Asian stock markets tried to steady on Wednesday amid hopes U.S. tariffs would not be as painful for the global economy as feared just a day ago, though Wall Street futures took a knock from a sharp drop in Alphabet  shares as earnings disappointed.</p><p class=\"\">ERDOGAN SCHEDULE</p><p class=\"\">President Tayyip Erdogan will make a speech at his AK Party's women's branch congress in Ankara (1100 GMT).</p><p class=\"\">Erdogan will then hold a joint news conference with Germany's President Frank-Walter Steinmeier at the presidential palace following their talks (1730 GMT).</p><p class=\"\">FOREIGN MINISTER</p><p class=\"\">Foreign Minister Hakan Fidan will give a televised interview to state-owned Anadolu news agency (0800 GMT).</p><p class=\"\">TRADE MINISTER</p><p class=\"\">Trade Minister Omer Bolat will attend a garment industry fair in Istanbul (0700 GMT).</p><p class=\"\">OPPOSITION</p><p class=\"\">Main opposition CHP leader Ozgur Ozel will visit southeastern province of Adiyaman a day before the second anniversary of the deadly earthquake.</p><p class=\"\">Right-wing opposition parties Iyi Party (0630 GMT) and New Path Party (0730 GMT) will hold their weekly parliamentary meetings.</p><p class=\"\">SHARAA IN ANKARA</p><p class=\"\">Turkish President Tayyip Erdogan said he and Syria's newly appointed president, Ahmed al-Sharaa, had discussed in Ankara on Tuesday steps to be taken against Kurdish militants in northeast Syria.</p><p class=\"\">Turkish transport and manufacturing firms eye big expansion plans for Syria in what some expect will be a tripling of trade.</p><p class=\"\">For other related news, double-click on:</p><p class=\"\">Turkish politics (TR-POL)</p><p class=\"\">Turkish equities (TR-E)</p><p class=\"\">Turkish money (TR-M)</p><p class=\"\">Turkish debt (TR-D)</p><p class=\"\">Turkish hot stocks (TR-HOT)</p><p class=\"\">Forex news (FRX)</p><p class=\"\">All emerging market news (EMRG)</p><p class=\"\">All Turkish news </p><p class=\"\">For real-time quotes, double click on:</p><p class=\"\">Istanbul National-100 stock index , interbank lira trading (IYIX=), lira bond trading (0#TRTSYSUM=IS)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW098:0-turkey-factors-to-watch-on-feb-5/",
            "pub_date": "2025-02-05 12:44:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446667:0",
            "title": "UAE Non-Oil Business Activity Growth Remains Robust",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global United Arab Emirates PMI edged down to 55 in January 2025 from December’s nine-month high of 55.4.</p><p class=\"\">Still, the latest reading indicated a strong improvement in the country's non-oil private sector, with firms reporting sharp increases in new orders and output, driven by favorable market conditions and a growing client base.</p><p class=\"\">At the same time, purchasing activity expanded and delivery times improved.</p><p class=\"\">Firms reported only a mild increase in staff numbers, although the pace of hiring was the fastest since August 2024.</p><p class=\"\">However, the rate of backlog accumulation accelerated to its highest level in eight months.</p><p class=\"\">On prices, input cost inflation eased to a 13-month low, despite higher costs for transport and machinery, and a quicker rise in salaries.</p><p class=\"\">Meanwhile, firms raised their selling prices for the first time in four months.</p><p class=\"\">Despite positive demand trends, concerns around competitive pressures curbed optimism, pushing business confidence to its lowest level in over two years.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446667:0-uae-non-oil-business-activity-growth-remains-robust/",
            "pub_date": "2025-02-05 12:45:26",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014511:0",
            "title": "Nissan to Reject Honda's Merger Terms, Putting Deal in Peril — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sean McLain and Megumi Fujikawa</p><p class=\"\">Nissan's board is planning to reject Honda's terms for a combination of the two automakers, putting in danger a merger plan announced less than two months ago, people familiar with the matter said Wednesday.</p><p class=\"\">Nissan's board was scheduled to meet later Wednesday, and the people cautioned that no final decision to kill the deal has been made.</p><p class=\"\">The two Japanese automakers said on Dec. 23 that they planned to combine under a structure in which Honda and Nissan would both be subsidiaries of a single holding company.</p><p class=\"\">In recent days, Honda presented a new proposal that would have made Nissan a subsidiary of Honda instead of the more equal structure originally planned, according to a person familiar with the negotiations. The person said Nissan found the new proposal unacceptable and planned to reject it.</p><p class=\"\">The person said Nissan and Honda would continue other cooperation that predates the merger talks, including collaboration on software and electric vehicles.</p><p class=\"\">Honda said it was continuing to discuss the potential combination with Nissan and aimed to decide on a general plan by mid-February.</p><p class=\"\">Nissan shares had jumped on the initial merger announcement in December but fell back in the following weeks. Nissan shares were up about 1% in Tokyo trading Wednesday. Honda shares rose 2.5%.</p><p class=\"\">If the automakers' plan to combine falls apart, it would raise pressure on Nissan to reassure lenders, employees and customers that it can survive amid stiff competition in the U.S. and China. Nissan has lost ground in both markets.</p><p class=\"\">Nissan said in November that it would lay off 9,000 workers and slash its factory capacity by one-fifth to cut costs.</p><p class=\"\">Write to Sean McLain at sean.mclain@wsj.com and Megumi Fujikawa at megumi.fujikawa@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014511:0/",
            "pub_date": "2025-02-05 12:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW02X:0",
            "title": "Toyota raises full-year profit outlook by 9%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  raised its full-year operating profit forecast by 9% on Wednesday, in a sign of confidence in its ability to ride out any potential U.S. tariffs.</p><p class=\"\">The world's biggest-selling automaker raised its profit forecast for the current year through March 2025 to 4.7 trillion yen ($30.7 billion) versus 4.3 trillion yen expected previously.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW02X:0-toyota-raises-full-year-profit-outlook-by-9/",
            "pub_date": "2025-02-05 12:36:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463692:0",
            "title": "Ann Joo Resources to Buy Remaining 45% Stake in Konsortia Etiqa for MYR96 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ann Joo Resources  unit Ann Joo Management Services agreed to acquire the remaining 45% stake it does not own in industrial land firm Konsortia Etiqa for 96 million ringgit. </p><p class=\"\">The stake, comprising 67,500 shares, will be purchased from Ong Tee Thong, according to a Tuesday Malaysian bourse filing. </p><p class=\"\">The steel company will finance the deal via its internal funds, it said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463692:0/",
            "pub_date": "2025-02-05 12:37:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014697_20250204014697:0",
            "title": "Perusahaan Gas Negara Target Price Set at IDR2,000 by Maybank Sekuritas Indonesia >PGAS.JK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014697_20250204014697:0/",
            "pub_date": "2025-02-05 12:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014697_20250204014698:0",
            "title": "Perusahaan Gas Negara Started at Buy by Maybank Sekuritas Indonesia >PGAS.JK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014697_20250204014698:0/",
            "pub_date": "2025-02-05 12:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463693:0",
            "title": "Lithium Energy Gets Environmental Impact Assessment Approval for Argentinian Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lithium Energy  received Environmental Impact Assessment approval to further explore the central and northern blocks of the Solaroz Lithium Brine Project in Argentina, the company said in a Wednesday Australian bourse filing. </p><p class=\"\">The company will perform the majority of the next phase of exploration and evaluation activities in the two blocks as they hold the majority of the existing lithium resources in the project, the filing said. </p><p class=\"\">Under an amended sale agreement, Lithium Energy is selling its interest in the Solaroz project to CNGR Netherlands New Energy (CNNET) for $63 million. Since Jan. 1, CNNET has been funding local operations and development in the project by providing $15 million in loan financing, added the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463693:0/",
            "pub_date": "2025-02-05 12:38:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463689:0",
            "title": "Keyfield International Unit Charters Vessel, Workboat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keyfield International (KLSE: KEYFIELD) unit Keyfield Offshore executed two separate deals for the charters of one anchor-handling tug supply vessel and one dynamic positioning two accommodation work boat. </p><p class=\"\">The charter of the anchor handling tug supply vessel is expected to begin in the first week of April, for 720 days, plus an option to extend for another 180 days. The vessel will be deployed in the United Arab Emirates, according to a Tuesday Malaysian bourse filing. </p><p class=\"\">Meanwhile, the charter of one dynamic positioning 2 accommodation workboat is expected to begin in mid-February, for 150 days, plus an option to extend for another 120 days. The vessel will be deployed in Malaysia, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463689:0/",
            "pub_date": "2025-02-05 12:38:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014699:0",
            "title": "Japan's Wage Growth Set to Improve While Facing Strong Headwinds — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's cash earnings jumped in December, while Moody's Analytics' Stefan Angrick sees little evidence of sustained real wage growth. At first glance, the data suggests things are turning around as monthly cash earnings rose solidly, the economist says, adding that the devil is in the details. Though nominal pay growth is picking up, the gains are uneven, and real cash earnings climbed only 0.6% on year, he says, describing it \"a far more modest gain than the glossy nominal figure.\" The pay bump was also driven significantly by temporary factors, such as bonuses. Wage growth is likely to improve despite strong headwinds expected in 2025, including, but not limited to, a potential inflation spike, he adds. Much depends on the spring wage negotiations. If pay gains come in below 5%, that could delay the rate hikes, he adds. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014699:0/",
            "pub_date": "2025-02-05 12:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0G9:0",
            "title": "India's Tata Power gains on Q3 profit rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tata Power  rise 3.5% to 372 rupees</p><p class=\"\">** Co said consolidated net profit rose 8.2% Y/Y to 10.31 bln rupees ($118.3 mln); rev from ops up 5.1%</p><p class=\"\">** Co aided by better margin in its solar engineering, procurement and construction segment</p><p class=\"\">** Co also interested in setting up small modular nuclear reactors, its CEO Praveer Sinha said on Tuesday</p><p class=\"\">** Over FY 2025-2027, earnings growth to be driven by capacity addition and solar cell or module manufacturing - Antique Stock Broking</p><p class=\"\">** Brokerage says execution of solar EPC order book and transmission line commissioning also key growth drivers</p><p class=\"\">** 20 analysts covering the stock on avg have a \"hold\" rating; median PT is 462 rupees - LSEG data</p><p class=\"\">** Stock gained 18% in 2024</p><p class=\"\">($1 = 87.1270 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0G9:0-india-s-tata-power-gains-on-q3-profit-rise/",
            "pub_date": "2025-02-05 12:39:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463533:0",
            "title": "Deutsche Bank Research Says UBS Group Q4 2024 Results Solid; Divisional Mix 'Not Ideal'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Deutsche Bank Research said Tuesday that UBS Group's  latest earnings report was \"a significant beat but not ideal mix.\"</p><p class=\"\">As such, analysts kept the Swiss stock on hold with a price target of 29 francs. </p><p class=\"\">\"Overall UBS reported solid 4Q24 results,\" the note said. \"The divisional mix could have been better with Global Wealth Management only in line and Personal &amp; Corporate Banking</p><p class=\"\">missing expectation.\"</p><p class=\"\">The research firm added that UBS \"continues to deliver\" since its 2023 emergency takeover of Credit Suisse but that the estimate 2026 11.4x EPS and 1.25x tangible book value have already factored in \"a lot of profitability improvement to come.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463533:0/",
            "pub_date": "2025-02-05 12:40:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463691:0",
            "title": "Halcyon Agri Decides Against Providing Business Updates for Q1, Q3 Amid Delisting Notice",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Halcyon Agri  has decided not to continue with the company's business updates for Q1 and Q3, starting from the third quarter of 2024, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">This follows the company receiving a notification of delisting from the Singapore Exchange and is already making preparations for its delisting in relation to an exit offer proposal.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463691:0/",
            "pub_date": "2025-02-05 12:40:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014688:0",
            "title": "Toyota Raises Revenue, Net-Profit Views for FY Ending March",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014688:0/",
            "pub_date": "2025-02-05 12:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DS:0",
            "title": "Australia's tech stocks near two-month highs on Wall St boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Australian tech stocks  rise 1.9%, in tandem with its U.S. peers on optimism for Sino-U.S. trade breakthrough </p><p class=\"\">** Tech index hits its highest since Dec. 10; set for second consecutive session of gains</p><p class=\"\">** Nine of 11 index members gains, led by hotel booking firm Siteminder , up 4%, and software maker WiseTech , up 3.4%</p><p class=\"\">** Broader ASX200 benchmark  up 0.6% on the day</p><p class=\"\">** Tech index has gained ~6% this year, 3x the ASX200's rise</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DS:0-australia-s-tech-stocks-near-two-month-highs-on-wall-st-boost/",
            "pub_date": "2025-02-05 12:32:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}