{
    "data": [
        {
            "id": "DJN_DN20250204006573:0",
            "title": "Merck Shares Hit After Guidance Falls Short, Gardasil Challenge — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jared S. Hopkins and Denny Jacob</p><p class=\"\">Merck shares tumbled more than 7% Tuesday premarket after the drugmaker gave 2025 revenue guidance that fell short of analyst expectations and said it was pausing shipments to China of its top-selling vaccine Gardasil.</p><p class=\"\">Merck said it expected sales of $64.1 billion to $65.5 billion in 2025 and adjusted earnings of $8.88 to $9.03 a share. Both forecasts came in below the average analyst expectation for revenue of $67.07 billion, and adjusted earnings per share of $9.13.</p><p class=\"\">Merck's guidance was affected because it decided to pause shipments of Gardasil to China from February through at least the middle of the year, as the company's Gardasil business in China remains a challenge.</p><p class=\"\">Gardasil prevents cancers caused from the human papillomavirus and is the company's biggest-selling franchise behind blockbuster cancer therapy Keytruda.</p><p class=\"\">The vaccine's sales had been booming in China until last year when Merck said it had been affected by various economic issues, including an anticorruption effort by the government. The company has said it has been working on improving patient education and promotion of the vaccine.</p><p class=\"\">Gardasil sales in 2024 totaled roughly $8.6 billion, down 3% from the prior year. Fourth-quarter sales were about $1.6 billion, down 18% from a year ago in part because of the lower demand in China.</p><p class=\"\">Gardasil's China sales account for most of the shot's international revenue. The shot's sales could be key to helping Merck deal with revenue losses when Keytruda loses patent protection in 2028.</p><p class=\"\">Keytruda's fourth-quarter sales grew 21% to $7.8 billion, helping power company quarterly revenue to $15.6 billion. Analysts expected $15.5 billion. Keytruda sales totaled $29 billion in 2024.</p><p class=\"\">Chief Executive Robert Davis attributed growth in 2024 to Keytruda, the second-quarter launch of hypertension drug Winrevair and performance in the animal-health business.</p><p class=\"\">Stripping out certain one-time items, earnings came in at $1.72 a share; analysts polled by FactSet had expected $1.61 a share.</p><p class=\"\">Merck reported fourth-quarter net income of $3.74 billion, or $1.48 a share, compared with a loss of $1.23 billion, or 48 cents a share, a year earlier.</p><p class=\"\">Write to Jared S. Hopkins at jared.hopkins@wsj.com and Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006573:0/",
            "pub_date": "2025-02-04 23:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008035:0",
            "title": "Intesa Sanpaolo's Operating Profit, Outlook Surpass Expectations — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008035:0/",
            "pub_date": "2025-02-04 23:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463516:0",
            "title": "DOF Group Wins $30 Million Subsea Service Contracts in Asia-Pacific",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DOF Group  secured two subsea service contracts totaling $30 million in the Asia-Pacific region, according to a Tuesday release. </p><p class=\"\">The first contract involves using the DSV Skandi Singapore dive support vessel for saturation diving services in Malaysia. The vessel will be deployed in the second quarter, lasting 30 days. </p><p class=\"\">Under the second contract, the offshore and subsea vessels company will provide construction support services in Indonesia with a multipurpose vessel for seven weeks, beginning in the third quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463516:0/",
            "pub_date": "2025-02-04 23:38:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008044:0",
            "title": "U.S. Job Openings Fell in December; Other Hiring Metrics Steady",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">The number of open jobs in the U.S. fell by more than half a million in the last month of 2024, but other indicators of labor-market health stayed steady in December.</p><p class=\"\">Job openings ended December at 7.6 million, down by 556,000 from a month earlier and a decline of 1.3 million from a year earlier, according to the Job Openings and Labor Turnover Survey, published Tuesday by the Department of Labor.</p><p class=\"\">The hiring rate, at 3.4%, and the quits rate, at 2%, were both constant from November.</p><p class=\"\">Layoffs and discharges were also steady at a rate of 1.1%, the rate that has held since September. A total of about 1.8 million workers were laid off or discharged in December, little changed from a month earlier.</p><p class=\"\">Despite steadiness in December, labor-market metrics softened over the course of 2024 as hiring cooled and workers saw less opportunity to leave their jobs for new roles.</p><p class=\"\">The ratio of open jobs to unemployed workers peaked at around 2 in early 2022, but has fallen to closer to 1 in recent months.</p><p class=\"\">More up-to-date labor-market figures are on the way Friday, in the monthly jobs report for January.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008044:0-u-s-job-openings-fell-in-december-other-hiring-metrics-steady/",
            "pub_date": "2025-02-04 23:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008037:0",
            "title": "EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Edith Hancock</p><p class=\"\">European officials need to manage their expectations in diplomatic negotiations against a more volatile geopolitical environment, European Commission President Ursula von der Leyen said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\">\"This is a world where we can no longer take much for granted including the rules and norms that were built over the past 70 years,\" she said at a conference on Tuesday, adding that \"in this hot-headed world, Europe's best approach is to remain level-headed.\"</p><p class=\"\">Von der Leyen--one of the European Union's most powerful officials--said negotiators need a clear and reasonable idea of the world as it really is. \"Don't think in terms of pessimism or even optimism, think about in terms of what is possible,\" she said.</p><p class=\"\">The commission president said that no other economies in the world are as integrated in the same way as the EU and the U.S.</p><p class=\"\">\"We want to make it work, and not only because of our historic ties, but because it is simply smart business,\" she said. \"So our first priority is now to work on the many areas where the interests converge.\"</p><p class=\"\">Her comments come after U.S. President Trump signed an executive order on Feb. 1 placing extra 10% tariffs on all Chinese imports, as well as threatening measures against Canada and Mexico before postponing them as both countries agreed to boost border security. Trump blasted the U.S.'s trade relationship with the EU over the weekend, calling it an \"atrocity\" and complaining that the EU exports far more to the U.S. than it imports. He said fresh tariffs on the bloc will definitely happen.</p><p class=\"\">\"We know that there will be an increased use of threats and economic coercion tools such as sanctions, export controls and tariffs,\" commission chief von der Leyen said. \"Europe will safeguard its economic and national security, but it is important that we strike the right balance,\" she said.</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008037:0/",
            "pub_date": "2025-02-04 23:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0S6:0",
            "title": "Wall Street gains early; Palantir Technologies rallies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nasdaq up &gt;1%, S&amp;P 500 up ~0.5%, Dow edges green</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dec factory orders MM -0.9% vs -0.7% estimate</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dec JOLTS job openings 7.6M vs 8.0M estimate</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Euro STOXX 600 index up ~0.2%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar down; bitcoin falls &gt;2.5%; crude ~flat; gold up ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield edges up to ~4.56%</li></ul></span></div><span><p class=\"\">WALL STREET GAINS EARLY; PALANTIR TECHNOLOGIES RALLIES</p><p class=\"\">U.S. stocks are higher in morning Tuesday trading, with a more than 1% gain in the Nasdaq composite  leading the way up along with energy and technology shares.</p><p class=\"\">Shares of Palantir Technologies  are up about 27% and helping to boost the Nasdaq after the company late Monday gave an upbeat 2025 revenue outlook, and an executive at the company said Palantir recommends that its clients steer clear of Chinese startup DeepSeek's AI models.</p><p class=\"\">Energy  up about 2%, and tech  up about 1.4%, are the leading S&amp;P 500  sectors. Staples  and healthcare , both off around 0.9%, are the weakest groups.</p><p class=\"\">Keeping investors on edge, however, is news that China retaliated against new trade restrictions announced by U.S. President Donald Trump with counter tariffs.</p><p class=\"\">Here is the early market snapshot:</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:700.990099009901px;aspect-ratio:1.1683168316831682\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0S6-dc233eb279ef047a3aacf5b89653cdb6-resized.webp\" type=\"images/webp\"/><img alt=\"feb 4\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0S6-dc233eb279ef047a3aacf5b89653cdb6-resized.jpeg\" style=\"background-color:#e9e8ed\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">morning snapshot</span></figcaption></figure></span></p><p class=\"\">(Caroline Valetkevitch)</p><p class=\"\">     *****</p><p class=\"\">FOR TUESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">NASDAQ COMPOSITE: LOTS OF CHOP AS TRIES TO AVOID A BIGGER DROP - CLICK HERE</p><p class=\"\">WATCH OUT INVESTORS, IT'S THE YEAR OF THE SNAKE - CLICK HERE</p><p class=\"\">EQUITIES AND THE EURO: IT'S COMPLICATED - CLICK HERE</p><p class=\"\">A \"FASCINATING\" EARNINGS SEASON AHEAD FOR UK BANKS - CLICK HERE</p><p class=\"\">BACK TO EARNINGS - CLICK HERE</p><p class=\"\">EUROPE BEFORE THE BELL: HERE WE GO AGAIN - CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0S6:0-wall-street-gains-early-palantir-technologies-rallies/",
            "pub_date": "2025-02-04 23:39:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309000:0",
            "title": "Market Chatter: Grab Holdings Mulls Takeover of GoTo at $7 Billion Valuation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Grab Holdings  is considering a takeover of rival GoTo Group at a valuation of over $7 billion, Bloomberg reported Tuesday, citing people familiar with the matter. </p><p class=\"\">Grab is discussing an all-stock purchase valuing shares of GoTo at more than 100 Indonesian rupiah each, representing a roughly 20% premium over its current stock price, the people reportedly told Bloomberg. </p><p class=\"\">Grab did not immediately reply to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309000:0/",
            "pub_date": "2025-02-04 23:39:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309008:0",
            "title": "Arcturus Therapeutics Appoints Moncef Slaoui Chair Designate",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arcturus Therapeutics Holdings  said Tuesday it has appointed Moncef Slaoui as chair designate. </p><p class=\"\">Slaoui has been a member of the company's board since June 2024 and most recently served as chief scientific advisor to the White House's Operation Warp Speed, according to Arcturus.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309008:0/",
            "pub_date": "2025-02-04 23:39:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1LV:0",
            "title": "Miner Ferrexpo tumbles as Ukrainian unit faces $3.77 bln civil claim",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Miner Ferrexpo plc  down 9.7% at 93.6p; stock top loser on FTSE 250 index (.FTMC) </p><p class=\"\">** Says a civil claim worth UAH 157 billion ($3.77 billion) is filed against its Ukrainian unit Ferrexpo Poltava Mining (FPM) in relation to alleged sale of waste products, as well as illegal mining and selling subsoil</p><p class=\"\">** Adds that FPM is of the view that accusations and claim are without merit</p><p class=\"\">** Unit intends to defend its position in the Ukrainian courts</p><p class=\"\">** As of last close, stock down ~2% YTD </p><p class=\"\">($1 = 41.6800 hryvnias)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1LV:0-miner-ferrexpo-tumbles-as-ukrainian-unit-faces-3-77-bln-civil-claim/",
            "pub_date": "2025-02-04 23:39:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0MS:0",
            "title": "South African rand firms after change in Trump's tariff stance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    South Africa's rand edged higher on Tuesday as markets digested U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/topic/person/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a>'s changing tariff stance.</p><p class=\"\">At 1518 GMT, the rand traded at 18.68 against the dollar , about 0.2% stronger than Monday's close. The dollar  last traded about 0.4% weaker against a basket of currencies.</p><p class=\"\">Trump on Monday suspended his threat of steep tariffs on Mexico and Canada, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">The U.S. imposed tariffs on Chinese imports on Tuesday and China quickly responded.</p><p class=\"\">The rand traded turbulently on Monday, slumping almost 2% in early trade on news that Trump would suspend funding to <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/south-africa/\" rel=\"nofollow\" target=\"_blank\">South Africa</a> over land rights, but staged a recovery later to close roughly flat.</p><p class=\"\">\"What we are seeing is that Trump is looking for concessions, while he negotiates,\" Adam Phillips, treasury specialist at Umkhulu Treasury, said about the tariffs turmoil.</p><p class=\"\">\"What is clear is that a risk premium is being added into the foreign exchange market and this is going to be around for a while.\"</p><p class=\"\">On the stock market, the Top-40  index closed about 1.1% higher.</p><p class=\"\">South Africa's benchmark 2030 government bond (ZAR2030=) was stronger, with the yield down 5.5 basis points to 9.09%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0MS:0-south-african-rand-firms-after-change-in-trump-s-tariff-stance/",
            "pub_date": "2025-02-04 23:39:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309018:0",
            "title": "Utah Medical Products Keeps Quarterly Dividend at $0.305 a Share, Payable April 3 to Stockholders of Record March 14",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309018:0/",
            "pub_date": "2025-02-04 23:40:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008051:0",
            "title": "Ferrari Up Nearly 8%, On Track for Largest Percent Increase Since February 2024 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ferrari NV (RACE) is currently at $462.41, up $33.47 or 7.8%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Nov. 4, 2024, when it closed at $476.05</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Feb. 1, 2024, when it rose 12.58%</li><li class=\"listItem-bmN0_SHH\">Currently up three of the past four days</li><li class=\"listItem-bmN0_SHH\">Currently up two consecutive days; up 7.91% over this period</li><li class=\"listItem-bmN0_SHH\">Best two day stretch since the two days ending Feb. 2, 2024, when it rose 9.64%</li><li class=\"listItem-bmN0_SHH\">Up 8.84% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its all-time closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.16% from 52 weeks ago (Feb. 6, 2024), when it closed at $378.53</li><li class=\"listItem-bmN0_SHH\">Down 6.92% from its 52-week closing high of $496.79 on Aug. 30, 2024</li><li class=\"listItem-bmN0_SHH\">Up 22.71% from its 52-week closing low of $376.84 on Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $470.16; highest intraday level since Nov. 4, 2024, when it hit $480.74</li><li class=\"listItem-bmN0_SHH\">Up 9.61% at today's intraday high; largest intraday percent increase since Feb. 1, 2024, when it rose as much as 13.15%</li></ul><p class=\"\">All data as of 10:36:31 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008051:0/",
            "pub_date": "2025-02-04 23:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309014:0",
            "title": "Quebec Labor Union Vows Legal Action After Amazon Closes 7 Warehouses, Lays Off 1,700 Workers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309014:0/",
            "pub_date": "2025-02-04 23:40:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007969:0",
            "title": "Century Communities Sees Tariffs Hitting Remodelers Most — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007969:0/",
            "pub_date": "2025-02-04 23:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV22X:0",
            "title": "Ingredion Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc  reported quarterly adjusted earnings of $2.63​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.97.  The mean expectation of six analysts for the quarter was for earnings of $2.57 per share. Wall Street expected results to range from $2.53  to $2.60 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 6.3% to $1.80 billion from a year ago; analysts expected $1.87 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc's reported EPS for the quarter was $1.43​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $95 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Ingredion Inc shares had fallen by 2.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 3.5% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the food processing peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Ingredion Inc is $168.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:30 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">2.57</p></td><td><p class=\"\">2.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.58</p></td><td><p class=\"\">3.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.49</p></td><td><p class=\"\">2.87</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.06</p></td><td><p class=\"\">2.08</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV22X:0-ingredion-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:31:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSkZDJra:0",
            "title": "WSLA Alumnae Group Announces Winners of 2025 Women in Sustainability Leadership Awards",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">To Be Presented at WSLA Awards Ceremony During GreenBiz 25</p><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / One of the highlights of the GreenBiz 25 conference for sustainable business leaders, the Women in Sustainability Leadership Awards (WSLA Awards) will be presented at the 11th annual WSLA Awards ceremony Feb. 11, 2025, 6 pm - 8:30 pm MST at the Meritage Terrace of JW Marriott in Phoenix, AZ.</p><p class=\"\">The WSLA Awards will be hosted by the WSLA Alumnae Group, comprised of past WSLA Awards winners. This year's 11 honorees will join these other powerful women at the forefront of sustainability who are making a difference in the world by initiating lasting change. No other organization recognizes highly accomplished women in sustainability from such diverse, global, and multi-professional segments.</p><p class=\"\">And the WSLA Class of 2025 winners are….</p><p class=\"\">I<strong class=\"root-Tkn6WL2y\">rissol Arce</strong> - Senior Director, Sustainability at Northwestern Mutual</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Taryn Fuentes</strong> - Co-Founder of Carbon Real</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Irene Galindo</strong> - Second Councilor of Los Cabos</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Catherin Greene</strong>r - Founder, Greener Solutions Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Connie Hensler</strong> - Global Director of Environmental Management and Product Stewardship at Interface.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chris Hagler</strong> - Co-Founder and CEO of Impact Pathways</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Annie Lappé</strong> - Vice President, Strategy &amp; Impact at Pivot Energy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SheaJameel</strong>- Senior Director, Head of Sustainability for Marsh McLennan.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Christina Vernon Sanborn -</strong> Associate Principal, Sustainability Practice Leader at Mazzetti</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Dr. Cassandra Thiel</strong> - Assistant Professor at New York University; President and CEO of Clinically Sustainable Consulting LLC</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aurora Winslade</strong> - Director of Sustainability at Edison International.</p><p class=\"\">Said Rochelle Routman, WSLA Alumnae Group President and Chairperson of the Board, \"We look forward to welcoming these women leaders into the heart and soul of WSLA, which is an organization dedicated to recognizing women sustainability leaders that have a track record of selfless determination, persistence, and achievement. This award elevates these high achieving women, providing them with even greater influence to solve more complex challenges, which benefits all of us.</p><p class=\"\">Noted WSLA Alumnae Group Vice President and Board Member Lisa Colicchio, \"Congratulations to the WSLA winners of 2025! These women are champions of climate change leading the charge towards a sustainable future for all.\"</p><p class=\"\">The Feb. 11 WSLA Awards ceremony will feature opening words from GreenBiz Editor and WSLA Alumnae Group Board Member Heather Clancy, who will moderate a fireside chat in conversation with Laura Bishop, a WSLA Class of 2024 alumnae. Together they will explore the most pressing issues affecting life on earth.</p><p class=\"\">Tickets are $75. For more information and to purchase tickets, visit https://www.zeffy.com/en-US/ticketing/a20f99cd-5334-40a8-a6af-f41433ca6866</p><p class=\"\">Join an esteemed group of sponsors and enjoy great exposure with a prestigious audience before, during and after the event. To sponsor, see https://www.wsla.global/sponsors</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About WSLA</strong></p><p class=\"\">The WSLA Alumnae Group, a 501(c)(3) charitable organization, is a community of past Women in Sustainability Leadership Award winners: over 125 of the most influential women* trailblazers who have become a powerful force in the profession of creating a more sustainable world. The group's annual awards program, summits, service activities and mentorship opportunities continue to pave the way in sustainability and for future leaders in the field. For more information, visit https://www.wsla.global</p><p class=\"\">*<!-- -->WSLA welcomes a diversity of women to unite as a strong collective of unique lived experiences and perspectives committed to sustainability and impactful environmental stewardship. WSLA is a strong proponent, advocate, and practitioner of equity, diversity, inclusion, and justice and as such is an organization open to all women. Our definition of women is expansive and includes those who may identify as non-binary, genderqueer, gender-expansive, two-spirit, and otherwise do not exist within a gender binary.</p><p class=\"\"># # #</p><p class=\"\">PRESS CONTACT:</p><p class=\"\">Susan Bang</p><p class=\"\">HMTX Industries</p><p class=\"\">AT WSLA ALUMNAE GROUP:</p><p class=\"\">Rochelle Routman</p><p class=\"\">HMTX Industries</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read More</strong></p><p class=\"\">View additional multimedia and more ESG storytelling from WSLA Alumnae Group on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: WSLA Alumnae Group</p><p class=\"\">Website: https://www.3blmedia.com/profiles/wsla-alumnae-group</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> WSLA Alumnae Group</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSkZDJra:0/",
            "pub_date": "2025-02-04 23:31:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309007:0",
            "title": "Wells Fargo Adjusts Ulta Beauty Price Target to $360 From $370",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ulta Beauty  has an average rating of overweight and mean price target of $465.54, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309007:0/",
            "pub_date": "2025-02-04 23:31:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308957:0",
            "title": "Update: KKR Raises Offer for Fuji Soft to $63.45 a Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates to add details from KKR and change attributions throughout.)</p><p class=\"\">KKR  said Tuesday it has raised its offer for Fuji Soft to 9,850 Japanese yen ($63.45) per share, from 9,451 yen previously. </p><p class=\"\">The company said it extended the tender offer period to Feb. 19 from the previous Feb. 7 deadline. </p><p class=\"\">KKR said the higher price reflects Fuji Soft's stock trading above its previous offer and Bain Capital's announced, but uncommenced, bid of 9,600 yen per share. </p><p class=\"\">The new price represents a 0.51% premium over Fuji Soft's Feb. 3 closing price and a 51.42% premium over its six-month average before KKR's initial bid, KKR added. </p><p class=\"\">Fuji Soft did not immediately respond to MT Newswires' request for comment. </p><p class=\"\">Shares of KKR were down 6% in recent Tuesday trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308957:0/",
            "pub_date": "2025-02-04 23:31:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXQzFMZ:0",
            "title": "Kinematics Strengthens Global Leadership in Solar Tracker Intelligence with Completion of P4Q Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PHOENIX, Feb.  04, 2025  (GLOBE NEWSWIRE) — Kinematics, a global leader in intelligent motion control, today announced the successful completion of its acquisition of P4Q. By integrating P4Q's high-performance electronics portfolio—including over 1 million solar controllers deployed across 2,400 solar sites globally—with Kinematics' installed base of 2.9 million solar actuators, the combined company becomes the world's largest supplier of motion control technology for solar trackers supporting more than 134 gigawatts of solar installations worldwide.</p><p class=\"\">Kinematics has gained P4Q’s expertise in full-stack electronics, including their market-leading tracker controls brand, Suntrack®, to complement its innovative actuation systems. This acquisition allows Kinematics to provide a complete solution for solar tracker motion technology, simplifying design integration and supply for solar tracker OEMs, enabling the most advanced tracking systems for future installations and providing asset owners a path toward upgrading outdated systems.</p><p class=\"\">\"This acquisition creates increased scale, expanded global support, and unified motion control solutions,\" said John Payne, CEO of Kinematics. \"By combining our strengths, we're setting new standards for intelligent solar tracking technology. Our expanded portfolio of solutions will improve solar plant production, increase reliability, and enhance value to accelerate the growth and adoption of solar energy on a global scale.”</p><p class=\"\">“Our integration into Kinematics will enhance our business and create new opportunities for our team. Innovation is in our DNA, and we will continue providing disruptive solutions to our clients as well as excellent service,” said Aitor Alapont, CEO of P4Q.</p><p class=\"\">A cornerstone of the combined offering is P4Q's revolutionary Self-Powered Plus (SPP) Controller Technology. This innovative solution eliminates the need for traditional pony panels, freeing up space on the tracker surface, and reducing both capital expenditure and installation complexity, while also offering superior power availability under low irradiance conditions.</p><p class=\"\">The acquisition builds on Kinematics' recent innovations in motion control, including the breakthrough ST Series actuators launched in 2024. Featuring a maintenance-free design, the ST Series delivers up to 50% more holding torque in a smaller form factor, enhancing solar tracker performance and reliability - capabilities that will be further strengthened through the integration of both companies.</p><p class=\"\">“This milestone will create synergies, expand our portfolio of products and services, and optimize our global operations, undoubtedly providing a significant boost to all our business verticals,” said Noemí Pérez, Commercial Director at P4Q.</p><p class=\"\">The combined company will be headquartered in the U.S. with R&amp;D in the U.S., Europe, and APAC. Kinematics will now have six manufacturing centers, including the U.S. and Europe, and seven service centers located globally.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Kinematics</strong></p><p class=\"\">Founded in 1996, Kinematics is a global leader in precision motion control solutions, specializing in the design and manufacture of slew drives, slew rings, and actuation technology. With a strong focus on renewable energy, Kinematics supplies critical engineered systems, sensors, gears, and controllers that maximize the efficiency of solar installations worldwide, along with applications for the mobile industrial and satellite ground station sectors. The company is headquartered in Phoenix, Arizona, and operates globally with facilities in Asia and North America.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About P4Q</strong></p><p class=\"\">P4Q is a premier provider of IoT solutions, specializing in electronic devices, communication technologies, and cloud-based monitoring for solar tracking systems, medical diagnostic equipment, and more. The company also supports industries such as railway and industrial electronics. Renowned for its commitment to innovation and high-performance solutions, P4Q has established a strong reputation for excellence, particularly in the solar energy sector. Headquartered in Spain, P4Q serves clients across Europe, the Americas, and beyond.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press Contact:</strong></p><p class=\"\">Matt Clarke</p><p class=\"\">matt@teamsilverline.com</p><p class=\"\">301.467.7332</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a835f342-87fb-45f3-a382-21134f6fc8a4</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Kinematics completes its acquisition of P4Q</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Kinematics announced the successful completion of its acquisition of P4Q. </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXQzFMZ:0-kinematics-strengthens-global-leadership-in-solar-tracker-intelligence-with-completion-of-p4q-acquisition/",
            "pub_date": "2025-02-04 23:31:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV236:0",
            "title": "Silicon Laboratories Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Silicon Laboratories Inc  reported a quarterly adjusted loss of 11 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $-1.19.  The mean expectation of ten analysts for the quarter was for a loss of 11 cents per share. Wall Street expected results to range from -11 cents to -10 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 91.4% to $166.25 million from a year ago; analysts expected $166.08 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Silicon Laboratories Inc's reported EPS for the quarter was a loss of 73 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $23.82 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Silicon Laboratories Inc shares had risen by 8.5% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 7 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the semiconductors peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Silicon Laboratories Inc is $133.50 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">-0.11</p></td><td><p class=\"\">-0.11</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">-0.21</p></td><td><p class=\"\">-0.13</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">-0.64</p></td><td><p class=\"\">-0.56</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">-0.98</p></td><td><p class=\"\">-0.92</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV236:0-silicon-laboratories-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:32:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV23C:0",
            "title": "WEC Energy Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">WEC Energy Group Inc  reported quarterly adjusted earnings of $1.43​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.10.  The mean expectation of fourteen analysts for the quarter was for earnings of $1.42 per share. Wall Street expected results to range from $1.38  to $1.50 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 3% to $2.28 billion from a year ago; analysts expected $2.63 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WEC Energy Group Inc's reported EPS for the quarter was $1.43​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $453.5 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WEC Energy Group Inc shares had risen by 6.8% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 5.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, five analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" 11 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the electric utilities peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for WEC Energy Group Inc is $100.80 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.42</p></td><td><p class=\"\">1.43</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.70</p></td><td><p class=\"\">0.82</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.64</p></td><td><p class=\"\">0.67</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.92</p></td><td><p class=\"\">1.97</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV23C:0-wec-energy-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:33:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309010:0",
            "title": "Tigress Adjusts Price Target on AT&T to $32 From $30, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AT&amp;T  has an average rating of overweight and mean price target of $26.28, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309010:0/",
            "pub_date": "2025-02-04 23:33:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007994:0",
            "title": "U.S. Factory Orders Fell in December",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">Orders for goods from American manufacturers fell in December, a second straight month of declines, according to Commerce Department data released Tuesday.</p><p class=\"\">U.S. factory orders declined by 0.9% in the last month of 2024 to $578.5 billion, from $583.7 billion in November. Economists surveyed by The Wall Street Journal had expected factory orders to fall by 0.8% month over month.</p><p class=\"\">The latest November figure also reflected a downward revision from the Commerce Department's initial estimate a month ago.</p><p class=\"\">Despite the recent declines, factory orders overall have held relatively steady since mid-2022, following a sharp recovery from an initial downturn at the start of the 2020 pandemic.</p><p class=\"\">In December, orders for durable goods fell by 2.2% to $276.1 billion, including a 7.4% decrease in orders for transportation equipment. Nondurable-goods orders grew by 0.3% to 302.4 billion.</p><p class=\"\">U.S. factory shipments grew 0.6% to $589.7 billion, and unfilled orders fell by 0.5% to $1.396 trillion, after a previous stretch of five straight months of increases.</p><p class=\"\">Inventories grew in December for the second month in a row by 0.4% to $863.2 billion.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007994:0-u-s-factory-orders-fell-in-december/",
            "pub_date": "2025-02-04 23:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007026:0",
            "title": "Oil prices fall after U.S. imposes tariffs on China, Beijing retaliates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Myra P. SaefongWilliam Watts</p><p class=\"\">U.S.-China trade dispute fuels demand concerns</p><p class=\"\">Oil futures fell Tuesday morning, losing ground as the U.S. implemented an additional 10% tariff on China imports and Beijing retaliated with measures of its own.</p><p class=\"\">Crude prices saw gains Monday, but ended well off session highs after President Donald Trump delayed a 25% tariff on Mexico by a month. He later also announced a delay on Canada tariffs of 25% and a 10% levy on energy imports.</p><p class=\"\">Price moves</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">West Texas Intermediate crude CL00 for March delivery CL.1 CLH25 fell 42 cents, or 0.6%, to $72.74 a barrel on the New York Mercantile Exchange.</li><li class=\"listItem-bmN0_SHH\">April Brent crude BRN00 BRNJ25, the global benchmark, added 2 cents, or less than 0.1%, to $75.98 a barrel on ICE Futures Europe.</li><li class=\"listItem-bmN0_SHH\">March gasoline RBH25 shed 1.2% to $2.0929 a gallon, while March heating oil HOH25 lost 1.1% to $2.4369 a gallon.</li><li class=\"listItem-bmN0_SHH\">Natural gas for March delivery NGH25 traded at $3.202 per million British thermal units, down 4.4%, after climbing 10.1% Monday.</li></ul><p class=\"\">Market drivers</p><p class=\"\">An additional 10% tariff on China imports to the U.S. took effect Tuesday, while China announced a 15% tariff on U.S. coal and liquefied natural-gas products as well as a 10% tariff on crude oil, agricultural machinery and large-engine cars that go into effect next Monday.</p><p class=\"\">Intensified trade tensions with China serve to underscore worries about the world's second largest economy and world's largest crude importer.</p><p class=\"\">There's \"clear concern\" stemming from the view that two-party tariffs could lead to reduced demand, with front-month WTI pulling below the 50-day moving average of $72.10, said Chris Weston, head of research at Pepperstone, in market commentary. March WTI traded as low as $70.67 in Tuesday dealings.</p><p class=\"\">\"Let's see if the selling can build, but it takes a brave soul to counter the move lower here,\" he said. \"And while the prospect of some sort of positive agreement is still in the playbook, for now, the more probable scenario is that both sides increase the friction.\"</p><p class=\"\">Meanwhile, the delay to the Mexico and Canada tariffs, particularly Canadian oil, served to pressure markets Monday and early Tuesday, said analysts at ING. Many U.S. refiners are dependent on the type of heavy crude oil produced by Canada and the threat of tariffs had led to a rally for oil and gasoline futures early in Monday's session, leading prices to finish well off the day's highs.</p><p class=\"\">Oil traders have also been concerned about plans by the the Organization of the Petroleum Exporting Countries and their allies, also known as OPEC+, to boost production after the first quarter.</p><p class=\"\">\"This strategy had been previously agreed upon to reduce the production cuts in place since 2022 progressively,\"? said Antonio Di Giacomo, senior market analyst at XS.com, in market commentary. \"However, the market's reaction has been adverse, reflecting investors' fears of a possible oversupply.\"</p><p class=\"\">\"The OPEC+ decision comes when doubts persist about the strength of the global economy and energy consumption levels in key markets such as China and the United States,\" he said.</p><p class=\"\">-Myra P. Saefong -William Watts</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007026:0/",
            "pub_date": "2025-02-04 23:35:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007997:0",
            "title": "Estee Lauder Is Maintained at Market Perform by Telsey Advisory Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:35 GMT) </strong>Estee Lauder Price Target Maintained With a $76.00/Share by Telsey Advisory Group</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007997:0/",
            "pub_date": "2025-02-04 23:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309004:0",
            "title": "Unisys, Chicago Quantum Exchange Collaborate on Quantum Technology Applications",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unisys  said Tuesday it has formed a partnership with Chicago Quantum Exchange to drive industry-specific quantum technology applications. </p><p class=\"\">Chicago Quantum Exchange will give Unisys access to quantum researchers and talent to mutually explore and develop quantum technology tools to help solve challenges faced by businesses, Unisys said. </p><p class=\"\">The company's shares were up 2.3% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309004:0/",
            "pub_date": "2025-02-04 23:35:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308982:0",
            "title": "UBS Adjusts Price Target on SBA Communications to $280 From $290, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SBA Communications  has an average rating of overweight and mean price target of $250.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308982:0/",
            "pub_date": "2025-02-04 23:28:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308984:0",
            "title": "UBS Adjusts Price Target on Booking Holdings to $5,560 From $5,550, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Booking Holdings  has an average rating of overweight and mean price target of $5,378.74, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308984:0/",
            "pub_date": "2025-02-04 23:28:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308985:0",
            "title": "UBS Adjusts Price Target on Baker Hughes to $47 From $44, Keeps Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Baker Hughes Company  has an average rating of overweight and mean price target of $51.65, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308985:0/",
            "pub_date": "2025-02-04 23:28:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308981:0",
            "title": "Update - National Bank Commentary On B2Gold As Antelope Deposit PEA De-risks, Extends Otjikoto Mine Life",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Adds National Bank commentary in the eight paragraph)</p><p class=\"\">B2Gold  was edging lower Tuesday after it released a \"positive\" preliminary economic assessment of the Antelope deposit at the Otjikoto gold mine in Namibia. </p><p class=\"\">The underground gold mine has an initial life of mine of about 5 years, with average grade processed of 5.75 grams per tonne (g/t) gold over the life of mine. </p><p class=\"\">Life of mine gold production is about 327,000 ounces with an average gold recovery of 95%. Average annual gold production is estimated at about 65,000 ounces per year over the life of mine. </p><p class=\"\">Projected all-in sustaining costs are about US$1,095 per gold ounce over the life of mine. </p><p class=\"\">After-tax net present value at a discount rate of 5% is US$131 million, generating an after-tax internal rate of return of 35%. </p><p class=\"\">The company has budgeted $7 million for exploration at Otjikoto in 2025 to focus on expanding and refining the Antelope deposit, with 44,000 meters of drilling planned. </p><p class=\"\">Based on the PEA results, the company believes the Antelope deposit has the potential to become a small-scale, low-cost, underground gold mine that can supplement the low-grade stockpile production from 2028 to 2032. </p><p class=\"\">B2Gold kept its Outperform rating and C$6.25 price target at National Bank of Canada following the update. </p><p class=\"\">The price target was based on 4.5x EV/EBITDA NTM. </p><p class=\"\">National Bank expects sentiment for B2Gold to be constructive as it approaches finishing the Goose project early this year. </p><p class=\"\">\"Our thesis considers BTO's next leg of growth on the order of 600,000 oz/year via regional Goose ramp-up, regional production of Fekola, potential development of Gramalote, NAV-accretive exploration opportunities, strong balance sheet and peer-leading dividend yield, tempered by de-risking Goose in the development home stretch,\" the bank said. </p><p class=\"\">\"We expect sentiment to be constructive as it approaches finishing Goose early this year.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308981:0/",
            "pub_date": "2025-02-04 23:29:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}