{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310007:0",
            "title": "B. Riley Adjusts Cytokinetics' Price Target to $88 From $92, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cytokinetics  has an average rating of buy and mean price target of $81.61, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310007:0/",
            "pub_date": "2025-02-05 22:16:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006890:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0917 ET - A surge in Canadian exports in December and recent improvement in export-order survey indicators add to evidence the country's economy picked up momentum at the end of 2024, Capital Economics' Stephen Brown says. That puts some upside risk to the flash estimate GDP rebounded by only a modest 0.2% on-month in December after contracting 0.2% in November, he says. Brown adds the situation for exporters finally improved, at least until President Trump came within hours of imposing a 25% tariff. \"That risk is likely to hang over the economy for some time.\" (robb.stewart@wsj.com; @RobbMStewart)</p><p class=\"\">0910 ET - A surge in the U.S. trade deficit points to businesses getting in orders ahead of the imposition of tariffs on imports, says Thomas Ryan, an economist at Capital Economics. America's trade in goods and services with the rest of the world showed a sharply increased deficit in December to just shy of $100 billion, according to Commerce Department figures set out Wednesday. Imports rose and exports declined. \"The strength of imports appears largely driven by businesses rushing orders ahead of potential tariffs, a trend unlikely to reverse any time soon,\" Ryan tells investors in a note.(joshua.kirby@wsj.com; @joshualeokirby)</p><p class=\"\">0901 ET - Euro-denominated investment-grade bonds appear attractive due to strong demand and since the issuers are in good financial health, analysts at Amundi Investment Institute say in a note. \"We favor euro financials and subordinated debt, and investment-grade bonds over high-yield bonds,\" Amundi says. The analysts are cautious on bonds with lower ratings like triple C bonds. (miriam.mukuru@wsj.com)</p><p class=\"\">0901 ET - ADP's employment estimate indicates solid U.S. job growth in January. The payroll and HR-services provider figures that the economy added 183,000 jobs last month. It also sharply revises up its December estimate: now to 176,000, from 122,000 previously. Carl Weinberg and Mary Chen of High Frequency Economics warn that the ADP figure isn't a stellar predictor of official data, but say adds useful color. \"Right now, [the big picture] is one of still substantial increases in jobs by a fast-growing economy but a slowing trend in job creation,\" they write. \"Today's figures do not upset that trend.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0857 ET - Gold futures rise, keeping close to a fresh record set earlier in the session. Futures rise 0.2% to $2,880.80 a troy ounce, having hit $2,901.50 earlier in the day. Investors are increasingly seeking safe-haven in hard assets like gold, silver, copper and platinum, historically viewed as stores of value in times of financial uncertainty, Saxo Bank's Ole Hansen says in a note. The risk of sovereign debt crises, currency devaluations and systemic financial instability could further reinforce this trend, increasing the attractiveness of metals as a hedge against economic turbulence, Hansen writes. A shift away from U.S. dollar dominance is also underway as nations seek to reduce their greenback reliance for trade and reserve holdings, Hansen says. This is further supporting demand for gold and other stable commodities, as countries seek alternative to fiat currencies, he adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0857 ET - Goldman Sachs economists think the risks of tariff escalation remain very real. The bank's team now projects that the U.S. will enact a 10% global tariff on critical imports such as semiconductors and pharmaceuticals as its baseline forecast, as well as a tariff on cars from the EU. If its current expected scenario is implemented, the tariffs could erase most progress on inflation otherwise expected this year, leaving core PCE inflation at 2.6% over the 12 months through December, Goldman projects. If Canada and Mexico tariffs are implemented after all, inflation would instead increase, peaking just above 3%, Goldman writes. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0851 ET - The Polish zloty briefly rises to the highest level against the euro since April 2018 after the National Bank of Poland held interest rates at 5.75%. The decision to leave rates unchanged was almost completely priced in by the market but the central bank's restrictive policy stance over the past year is a key factor underpinning the zloty's strength, Capital Economics economist Nicholas Farr says. The NBP kept rates steady throughout 2024 and looks unlikely to cut rates in 2025 given the risk of higher inflation, he says. EUR/PLN last trades at 4.1991 after briefly falling to a low of 4.1931 after the decision from 4.1961 beforehand. (renae.dyer@wsj.com)</p><p class=\"\">0844 ET - Treasury yields and the dollar weaken as Trump's Gaza takeover proposal squeezes the trade war out of today's headlines. ADP reports 183,000 jobs created by private employers in January, up from an upwardly revised 176,000 in December and higher than consensus of 150,000 in a Wall Street Journal survey. Meanwhile, U.S. trade deficit widens to $98.4 billion in December from November's revised $78.9 billion and versus a forecast of $96.8 billion in a WSJ survey. Yields and the WSJ Dollar Index moved up after the ADP data, before weakening again. The 10-year is at 4.458% and the two-year at 4.187%. The WSJ Dollar Index falls 0.3%.(paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0820 ET - The Bank of England is expected to cut interest rates by 25 basis points to 4.50% on Thursday, TD Securities analysts say in a note. The BOE is likely to keep policy guidance unchanged, the analysts say. However, the likelihood of interest rate cuts at subsequent meetings is rising, TD Securities says. Markets place a 97% probability of a BOE rate cut this week, LSEG Refinitiv data shows. (miriam.mukuru@wsj.com.)</p><p class=\"\">0815 ET - The Japanese yen could rise further given the prospect of the Bank of Japan raising interest rates by more than markets expect, Rabobank's Jane Foley says in a note. \"The market consensus that the BOJ will hike interest rates again this year at an extremely modest pace is being tested,\" she says. Japanese wage growth data overnight was stronger than expected and BOJ former executive director Hideo Hayakawa told Bloomberg rates could rise more than markets predict. The summary of policymakers' opinions at the January BOJ meeting also signalled further rate rises. Rabobank retains a medium-term USD/JPY forecast of 145.00. USD/JPY falls 0.9% to 152.908, having earlier reached a near eight-week low of 152.555, according to FactSet.(renae.dyer@wsj.com)</p><p class=\"\">0812 ET - European fixed income markets offer better value than bond markets in the U.S., given the high risk of inflation in the latter, Edmond de Rothschild Asset Management's Benjamin Melman says in a note. \"The global inflation no longer appears to be retreating, notably in the U.S., due to uncertainties surrounding the Trump administration's programme,\" the global chief investment officer says. In fixed income markets, there is more value to be found in Europe, on account of the much higher risks on inflation forecasts in the U.S., he says. Edmond de Rothschild Asset Management has a preference for 'carry' strategies in the current environment, as the yields on money market instruments are expected to fall this year, he says. (emese.bartha@wsj.com)</p><p class=\"\">0743 ET - The Bank of England is expected to cut interest rates on Thursday and it could signal another rate cut in March, Peel Hunt's Kallum Pickering says in a note. The BOE is likely to keep monetary policy guidance unchanged with one-per-quarter interest rate cut, Pickering says. \"However, risks are skewed towards policymakers signaling a willingness to react more forcefully to economic weakness,\" he says. Markets expect a total of 84 basis points of BOE interest rate cuts in 2025, LSEG Refinitiv data show. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006890:0/",
            "pub_date": "2025-02-05 22:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006887:0",
            "title": "Canadian Export Growth Hints at Economic Pickup — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A surge in Canadian exports in December and recent improvement in export-order survey indicators add to evidence the country's economy picked up momentum at the end of 2024, Capital Economics' Stephen Brown says. That puts some upside risk to the flash estimate GDP rebounded by only a modest 0.2% on-month in December after contracting 0.2% in November, he says. Brown adds the situation for exporters finally improved, at least until President Trump came within hours of imposing a 25% tariff. \"That risk is likely to hang over the economy for some time.\" (robb.stewart@wsj.com; @RobbMStewart)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006887:0/",
            "pub_date": "2025-02-05 22:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006894:0",
            "title": "Canada Swings to C$708 Million Goods-Trade Surplus in December — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Robb M. Stewart</p><p class=\"\">OTTAWA--Canada swung to a global trade surplus for the first time in 10 months at the end of last year as the local currency continued to weaken and energy shipments to the U.S. rose.</p><p class=\"\">The country posted a merchandise-trade surplus in December of 708 million Canadian dollars, the equivalent of about $494.3 million, Statistics Canada said Wednesday. That was narrower than the C$1.03 billion surplus expected by economists and comes after November's deficit was revised upward by C$663 million to C$986 million.</p><p class=\"\">The shift for the month still left Canada with a deficit with the world of about C$7.2 billion, much wider than the C$610 million shortfall the year before.</p><p class=\"\">The country's merchandise exports in December increased 4.9% to C$69.46 billion, while imports rose 2.3% to C$68.76 billion, the data agency said. For the year, imports advanced 1.9% to outpace a 1.0% lift in global exports.</p><p class=\"\">Economic growth in Canada picked up over the final quarter of last year following a string of interest rate cuts by the central bank since June as inflation has cooled. There remains a great deal of uncertainty over what 2025 will bring as the country braces for possible U.S. tariffs on imports from Canada.</p><p class=\"\">The rise in exports in December was the largest since last February, though the growth was due in part to the sharp depreciation of the Canadian dollar to the U.S. dollar for a third month running, given a large portion of trade is completed in the U.S. currency. In volume terms, exports for the month were up 2.6% from November.</p><p class=\"\">Exports of energy products jumped 9.5% from the month before, with a rise in the value of crude oil. Exports of mineral products also rose strongly, and Canada shipped more motor vehicles and parts, as well as farm, fishing and intermediate food products for the month.</p><p class=\"\">In preparation for President Trump's threatened levies, some businesses accelerated shipments. A KPMG survey of 250 business leaders across Canada last month found 65% preemptively shipped goods or products ahead of Trump's inauguration and almost half have plans to shift investment and would set up operations or production south of the border to serve the U.S. market and reduce costs.</p><p class=\"\">Trump on Monday struck last-minute deals to delay by one month plans to levy hefty tariffs on Canada to see if in that time an \"economic deal\" with Canada can be structured. Trump has repeatedly complained about America's trade deficit with its northern neighbor.</p><p class=\"\">Statistics Canada's data showed Canada's long-standing surplus with the U.S. narrowed slightly last year to roughly C$102.2 billion from C$108.3 billion in 2023. Cross-border trade between the two countries topped the C$1 trillion mark for a third consecutive year in 2024, with the U.S. the destination for almost 76% of all exports and the source for some 62% of overall imports.</p><p class=\"\">Energy products remain the key to Canada's surplus with its neighbor. The country exported about C$176.2 billion of energy last year, roughly 88% of which went to the U.S.</p><p class=\"\">For December, Canada's exports to the U.S. were up 5.0% following a 6.7% rise the month before. The same month, imports of U.S. goods fell 1.5%, which widened the trade surplus between the countries to C$11.34 billion from C$8.19 billion in November.</p><p class=\"\">That came as Canada's deficit with countries other than the U.S. widened to roughly C$10.6 billion in December from C$9.2 billion the month before.</p><p class=\"\">When international trade in goods and international trade in services were combined, Canadian exports rose 4.1% in December, while imports increased 1.6%. As a result, Canada's trade incorporating both goods and services swung to a surplus of C$641 million in December from a C$1.43 billion deficit the month before.</p><p class=\"\">Combining both services and goods traded with the U.S. over the last year, and Canada recorded an overall trade surplus of about C$94.4 billion with its neighbor.</p><p class=\"\">Write to Robb M. Stewart at robb.stewart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006894:0-canada-swings-to-c-708-million-goods-trade-surplus-in-december-update/",
            "pub_date": "2025-02-05 22:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309996:0",
            "title": "Daktronics Sued by Shareholder Alta Fox Over Delaware Reincorporation Plan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Daktronics  shareholder Alta Fox Capital Management said Wednesday that it has filed a lawsuit against the company and its chief executive officer, Reece Kurtenbach, to block the company's plan to reincorporate in Delaware. </p><p class=\"\">Alta Fox, which owns 11.7 %of Daktronics, said it has filed a preliminary proxy statement urging shareholders to vote against the reincorporation proposal at an upcoming special meeting. </p><p class=\"\">Alta Fox said the timing of the proposal indicates that it is intended to thwart Alta's efforts to nominate new board members. The firm also criticized Daktronics' governance practices, such as its classified board structure and use of a poison pill. </p><p class=\"\">Alta Fox said that if the lawsuit is successful, it plans to call a special meeting to push for board declassification, poison pill removal, and the election of new directors. </p><p class=\"\">Daktronics did not immediately respond to MT Newswires' request for comment.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309996:0/",
            "pub_date": "2025-02-05 22:17:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006901:0",
            "title": "Announcement by Embraer S.A. of Offers to Purchase for Cash Certain Outstanding Securities Listed Below",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Announcement by Embraer S.A. of Offers to Purchase for Cash Certain Outstanding Securities Listed Below</p><p class=\"\">PR Newswire</p><p class=\"\">SÃO PAULO, Feb. 5, 2025</p><p class=\"\">SÃO PAULO, Feb. 5, 2025 /PRNewswire/ — Embraer S.A. (\"Embraer\")  announces commencement of the following offers to purchase:</p><p class=\"\">1.  Embraer's offer to purchase for cash any and all outstanding 5.400% senior unsecured guaranteed notes due 2027 (the \"Any and All Notes\") issued by Embraer Netherlands Finance B.V. (\"Embraer Finance\"), fully, unconditionally and irrevocably guaranteed by Embraer (the \"Any and All Offer\"):</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>  Title of      CUSIP /      Principal     Reference   Bloomberg      Fixed <br/>  Security        ISIN         Amount         U.S.     Reference     Spread <br/>                            Outstanding     Treasury    Page(1) <br/>                                            Security <br/>-------------  ----------  --------------  ----------  ----------  ----------- <br/>5.400% Senior  29082H AB8  US$522,035,000  4.125% due     FIT1       45 bps <br/>  Unsecured        /                        January <br/> Guaranteed    US29082HA                    31, 2027 <br/>  Notes due       B87 <br/>    2027 <br/>-------------  ----------  --------------  ----------  ----------  ----------- <br/> <br/> <br/>__________________ <br/>(1)  The applicable page on Bloomberg from which the Dealer Managers (as <br/>defined below) will quote the bid side price of the Reference U.S. Treasury <br/>Security. <br/> </pre><p class=\"\">2.  Embraer's offer to purchase for cash outstanding 6.950% senior unsecured guaranteed notes due 2028 (the \"Capped Notes\" and, together with the Any and All Notes, the \"Notes\") issued by Embraer Finance, fully, unconditionally and irrevocably guaranteed by Embraer, up to an aggregate principal amount not to exceed US$150,000,000 (subject to increase or decrease by Embraer in its sole discretion, the \"Maximum Principal Amount\") (the \"Capped Offer\" and, together with the Any and All Offer, the \"Offers\"):</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>  Title of     CUSIP / ISIN    Principal     Reference   Bloomberg    Fixed      Capped <br/>   Security                      Amount         U.S.     Reference  Spread(2)    Early <br/>                               Outstanding    Treasury    Page(1)                Tender <br/>                                              Security                         Payment(3) <br/>-------------  ------------  --------------  ----------  ---------  ---------  ---------- <br/>6.950% Senior   Regulation   US$479,254,000  4.250% due    FIT1      80 bps     US$50.00 <br/>  Unsecured     S: N29505                     January <br/>  Guaranteed      AA7 /                       15, 2028 <br/>  Notes due    USN29505AA70 <br/>     2028       Rule 144A: <br/>                  29082H <br/>                  AC6 / <br/>               US29082HAC60 <br/>-------------  ------------  --------------  ----------  ---------  ---------  ---------- <br/> <br/> <br/>__________________ <br/>(1)  The applicable page on Bloomberg from which the Dealer Managers will <br/>     quote the bid side price of the Reference U.S. Treasury Security. <br/>(2)  Inclusive of Capped Early Tender Payment. <br/>(3)  Per US$1,000 principal amount. The Capped Total Consideration (as defined <br/>     below) for Capped Notes validly tendered and not validly withdrawn on or <br/>     prior to the Capped Early Tender Date (as defined below) and accepted for <br/>     purchase is calculated using the applicable Fixed Spread and is inclusive <br/>     of the Capped Early Tender Payment. <br/> </pre><p class=\"\">Information on the Offers</p><p class=\"\">The Any and All Offer is scheduled to expire at 5:00 p.m., New York City time, on February 11, 2025, unless extended or earlier terminated by Embraer in its sole discretion (such time and date, as it may be extended or earlier terminated, the \"Any and All Expiration Date\"). Holders of Any and All Notes who validly tender (and do not validly withdraw) their Any and All Notes at or prior to the Any and All Expiration Date or deliver a properly completed and duly executed notice of guaranteed delivery at or prior 5:00 p.m., New York City time, February 13, 2025, will be eligible to receive the Any and All Total Consideration (as defined below). Validly tendered Any and All Notes may be validly withdrawn at any time at or prior to the Any and All Expiration Date, unless extended or earlier terminated by Embraer as described in that certain offer to purchase dated February 5, 2025, relating to the Any and All Offer and the Capped Offer (the \"Offer to Purchase\"), but not thereafter.</p><p class=\"\">The Capped Offer is scheduled to expire at 5:00 p.m., New York City time, March 6, 2025, unless extended or earlier terminated by Embraer in its sole discretion (such time and date, as it may be extended or earlier terminated, the \"Capped Expiration Date\" and, together with the Any and All Expiration Date, each an \"Expiration Date\"). Holders of Capped Notes who validly tender (and do not validly withdraw) their Capped Notes at or prior to 5:00 p.m., New York City time, on February 19, 2025, unless extended or earlier terminated by Embraer in its sole discretion (such time and date, as it may be extended or earlier terminated, the \"Capped Early Tender Date\") will be eligible to receive the Capped Total Consideration for the Capped Notes. Holders of Capped Notes who validly tender their Capped Notes after the Capped Early Tender Date but at or prior to the Capped Expiration Date in the manner described in the Offer to Purchase will not be eligible to receive the Capped Early Tender Payment and will, therefore, only be eligible to receive the Capped Tender Consideration. Validly tendered Capped Notes may be validly withdrawn at any time prior to the Capped Early Tender Date but not thereafter, except as the Capped Early Tender Date may extended or earlier terminated by Embraer in its sole discretion.</p><p class=\"\">The \"Any and All Total Consideration\" and the \"Capped Total Consideration\", as applicable, payable per US$1,000 principal amount of Notes validly tendered and accepted for purchase pursuant to the Offers, will be determined in the manner described in the Offer to Purchase by reference to the applicable Fixed Spread for such Notes specified in the tables above plus the applicable yield based on the bid-side price of the applicable U.S. Treasury Reference Security specified in the tables above at 11:00 a.m., New York City time, on the Any and All Price Determination Date and the Capped Price Determination Date, as applicable (each as defined in the Offer to Purchase). The \"Capped Tender Consideration\" equals the Capped Total Consideration, minus the Capped Early Tender Payment.</p><p class=\"\">If the aggregate principal amount of the Capped Notes validly tendered (and not validly withdrawn) at or prior to the Capped Early Tender Date or the Capped Expiration Date exceeds the Maximum Principal Amount, a prorated amount of the Capped Notes validly tendered (and not validly withdrawn) by holders of the Capped Notes at or prior to the Capped Early Tender Date or the Capped Expiration Date, as the case may be, will be accepted for purchase.</p><p class=\"\">Settlement</p><p class=\"\">Settlement of the Any and All Offer is expected to occur on the third business day following the Any and All Expiration Date, unless the Any and All Expiration Date is extended or earlier terminated by the Embraer in its sole discretion (the \"Any and All Settlement Date\"). Tendered Any and All Notes may be withdrawn at any time at or prior to the Any and All Expiration Date.</p><p class=\"\">Holders of the Capped Notes that have validly tendered and not validly withdrawn their Capped Notes at or prior to the Capped Early Tender Date and whose Capped Notes are accepted for purchase shall, if Embraer so elects, receive the Capped Total Consideration on the early settlement date, which date is expected to occur two business days following the Capped Early Tender Date (the \"Capped Early Settlement Date\"). If Embraer does not, in its sole discretion, elect to pay for such tendered Capped Notes prior to the Capped Expiration Date, then the Early Settlement Date will be the same as the final settlement date, which date is expected to occur two business days following the Capped Expiration Date (the \"Capped Final Settlement Date\" and, together with the Early Settlement Date and the Any and All Settlement Date, each a \"Settlement Date\").</p><p class=\"\">Conditions to Offers</p><p class=\"\">Embraer's obligation to purchase Notes in the Offers is conditioned on the satisfaction or waiver of a number of conditions described in the Offer to Purchase, including completion by Embraer Finance of a new debt financing on satisfactory terms and conditions (the \"Debt Financing\"). The Debt Financing will comprise Embraer Finance's issuance of new notes to be guaranteed by Embraer. There can be no assurance that Embraer Finance will complete timely, or at all, the Debt Financing or that the financing condition or any other condition will be satisfied.</p><p class=\"\">Neither of the Offers is conditioned upon the tender of any minimum principal amount of Notes of such series or of the other series. However, the Capped Offer is subject to the Maximum Principal Amount. Embraer Finance reserves the right, but is under no obligation, to increase or decrease the Maximum Principal Amount at any time without reinstating withdrawal rights or extending the Capped Early Tender Date, subject to compliance with applicable law. In the event of a termination of an Offer, neither the applicable consideration nor Accrued Interest will be paid or become payable to the holders of the applicable series of Notes, and the Notes tendered pursuant to such Offer will be promptly returned to the tendering holders. Embraer has the right, in its sole discretion, to not to accept any tenders of Notes for any reason and to amend or terminate the Offers at any time.</p><p class=\"\">Subsequent Redemptions or Repurchases From time to time after each applicable Expiration Date or termination or withdrawal of any of the Offers, Embraer or any of its affiliates may acquire any Notes that are not purchased pursuant to the Offers through open market purchases, privately-negotiated transactions, tender offers, exchange offers, redemptions or otherwise, upon such terms and at such prices as Embraer or any of its affiliates may determine, which may be more or less than the price to be paid pursuant to the Offers and could be for cash or other consideration. Embraer may also exercise its right to redeem any Notes not purchased in the Offers and that remain outstanding after the applicable Expiration Date pursuant to the respective indenture governing such series of Notes. As of the date of this press release, it is Embraer's intention, but Embraer is under no obligation, to redeem the Any and All Notes via the make-whole call following the consummation, termination or withdrawal of the Offers. There can be no assurance as to which, if any, of these alternatives or combinations thereof Embraer will choose to pursue in the future.</p><p class=\"\">For More Information</p><p class=\"\">The terms and conditions of the Offers are described in the Offer to Purchase. Copies of the Offer to Purchase are available at www.dfking.com/embraer and by request to D.F. King &amp; Co., Inc., the tender agent and information agent for the Offers (the \"Tender and Information Agent\"). Requests for copies of the Offer to Purchase should be directed to the Tender and Information Agent at +1 (800) 829-6554 (toll free) and +1 (212) 269-5550 (collect) or by e-mail to embraer@dfking.com.</p><p class=\"\">Embraer reserves the right, in its sole discretion, not to accept any tenders of Notes for any reason. Embraer is making the Offers only in those jurisdictions where it is legal to do so.</p><p class=\"\">Embraer has engaged Citigroup Global Markets Inc., Goldman Sachs &amp; Co. LLC, J.P. Morgan Securities LLC, Morgan Stanley &amp; Co. LLC and PNC Capital Markets LLC to act as the dealer managers (the \"Dealer Managers\") in connection with the Offers. The Dealer Managers can be contacted at their telephone numbers set forth on the back cover page of the Offer to Purchase with questions regarding the Offers.</p><p class=\"\">Disclaimer</p><p class=\"\">None of Embraer, the Dealer Managers, the Tender and Information Agent, the trustee for the Notes, or any of their respective affiliates, is making any recommendation as to whether holders should or should not tender any Notes in response to the Offers or expressing any opinion as to whether the terms of the Offers are fair to any holder. Holders of the Notes must make their own decision as to whether to tender any of their Notes and, if so, the principal amount of Notes to tender. Please refer to the Offer to Purchase for a description of the offer terms, conditions, disclaimers and other information applicable to the Offers.</p><p class=\"\">This press release is for informational purposes only and does not constitute an offer to purchase or the solicitation of an offer to sell any securities. The Offers are being made solely by means of the Offer to Purchase. The Offers are not being made to holders of the Notes in any jurisdiction in which the making or acceptance thereof would not be in compliance with the securities, blue sky or other laws of such jurisdiction. In those jurisdictions where the securities, blue sky or other laws require any tender offer to be made by a licensed broker or dealer, the Offers will be deemed to be made on behalf of Embraer by the Dealer Managers or one or more registered brokers or dealers licensed under the laws of such jurisdiction.</p><p class=\"\">This press release may contain forward-looking statements within the meaning of Section 27A of the U.S. Securities Act of 1933, as amended, and Section 21E of the U.S. Securities Exchange Act of 1934, as amended, including those related to the Offers. Forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future, and, accordingly, such results may differ from those expressed in any forward-looking statements.</p><p class=\"\">Embraer S.A.</p><p class=\"\">Antonio Carlos Garcia</p><p class=\"\">Head of Investor Relations</p><p class=\"\">+55 (11) 3040-6874</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/announcement-by-embraer-sa-of-offers-to-purchase-for-cash-certain-outstanding-securities-listed-below-302368924.html</p><p class=\"\">SOURCE Embraer S.A.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006901:0/",
            "pub_date": "2025-02-05 22:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:82d9d7c33aa1d:0",
            "title": "Reynolds Consumer Products Inc. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reynolds Consumer Products Inc., a leading manufacturer of household consumer products, has released its 2024 Form 10-K report, detailing the company's financial performance, business operations, strategic initiatives, and the challenges it faces. The report provides a comprehensive overview of the company's efforts to maintain its market-leading position through innovation, cost management, and strategic investments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">Reynolds Consumer Products Inc. reported the following key financial metrics for 2024:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Total Net Revenues</strong>: $3,695 million, reflecting a 2% decrease from the previous year primarily due to lower volume and pricing.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit</strong>: $978 million, representing a 4% increase driven by lower material and manufacturing costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Income from Operations</strong>: $549 million, a 7% increase attributed to improved cost management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Income</strong>: $352 million, an 18% increase due to lower interest expenses and effective tax rate reductions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Diluted EPS</strong>: $1.67, reflecting the company's improved profitability and cost efficiency.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\">Reynolds Consumer Products operates through four main segments, each contributing to its diverse product offerings:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: Reynolds Cooking &amp; Baking, Hefty Waste &amp; Storage, Hefty Tableware, and Presto Products. These segments offer products such as aluminum foil, trash bags, disposable tableware, and food storage solutions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong>: The company has a significant presence in North America, with 99% of sales occurring in this region. The United States alone accounts for 97% of total sales, highlighting the company's strong domestic market position.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong>: The company maintains a leading market share in several product categories, with over 50% of revenue coming from products that hold the #1 position in their respective categories, including Reynolds Wrap and Hefty trash bags.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong>: In 2024, the company introduced new sustainable product options, such as Reynolds Wrap 100% recycled aluminum and Hefty Compostable Printed Paper Plates, aligning with consumer demand for environmentally friendly products.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: Reynolds Consumer Products plans to continue investing in product innovation and sustainability to meet evolving consumer preferences. The company aims to maintain its market-leading position by expanding its product categories and enhancing its partnerships with retail partners.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives</strong></p> <p class=\"\">The company has undertaken several strategic initiatives to enhance its financial flexibility and support future growth:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Debt Management</strong>: Reynolds Consumer Products amended its External Debt Facilities, replacing the undrawn $250 million revolving facility with a $700 million revolving facility maturing in October 2029. This move aims to provide greater liquidity and support future growth initiatives.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Supply Chain Finance Program</strong>: The company initiated a Supply Chain Finance program to optimize working capital and improve supplier relationships.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Capital Management</strong>: The company made voluntary principal payments totaling $150 million on its Term Loan Facility in 2024, following $250 million in payments in 2023, to reduce its outstanding debt. It also declared and paid cash dividends totaling $0.92 per share in 2024, maintaining a consistent dividend payout to shareholders.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: Looking ahead, the company plans to continue its focus on debt reduction and capital management to ensure financial stability. It expects to maintain its quarterly dividend payments, subject to Board approval, and will leverage its enhanced revolving credit facility to support strategic investments and operational needs. The company is also assessing the impact of upcoming regulatory changes, such as the SEC's climate-related disclosure requirements, on its financial reporting and strategic planning.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Challenges and Risks</strong></p> <p class=\"\">Reynolds Consumer Products faces several key risks and challenges that could impact its business:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Consumer Preferences</strong>: The ability to anticipate and respond to changes in consumer preferences is crucial. Failure to do so could adversely affect sales and profitability.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Customer Relationships</strong>: Dependence on major customers like Walmart and Sam’s Club, which account for a significant portion of revenue, poses a risk. Consolidation among customers could increase pricing pressure.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Competitive Markets</strong>: Operating in competitive markets with threats from new entrants and existing competitors could impact demand and profitability.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Manufacturing and Supply Chain</strong>: Loss of key manufacturing facilities or suppliers could disrupt operations. Fluctuations in raw material, energy, and freight costs, including tariffs, could adversely affect financial results.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Labor and Workforce</strong>: Labor shortages and increased labor costs could impact operations and financial performance.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Environmental and Regulatory</strong>: Changes in consumer lifestyle and environmental concerns, along with new regulations, could affect demand for products and increase operational costs.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Economic Conditions</strong>: Economic downturns could reduce consumer demand and impact inventory management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Debt and Liquidity</strong>: Significant debt levels could limit financial flexibility and increase exposure to interest rate risks.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Cybersecurity</strong>: Increased cyber threats pose risks to IT and operational systems, potentially impacting business operations and reputation.</li></ul><p class=\"\">Management highlights the importance of innovation and maintaining strong customer relationships to mitigate these risks. The company is focused on developing new products and expanding into adjacent categories to drive growth. Additionally, efforts to manage costs and improve operational efficiencies are ongoing to address financial challenges.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1786431/000162828025003936/reyn-20241231.htm\" rel=\"nofollow\" target=\"_blank\">Reynolds Consumer Products Inc. [ REYN ] - 10-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:82d9d7c33aa1d:0-reynolds-consumer-products-inc-sec-10-k-report/",
            "pub_date": "2025-02-05 22:18:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310008:0",
            "title": "B. Riley Adjusts Aviat Networks' Price Target to $33 From $29, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aviat Networks  has an average rating of buy and mean price target of $36.17, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310008:0/",
            "pub_date": "2025-02-05 22:18:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309917:0",
            "title": "Hydreight Technologies Expands Telehealth Offerings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hydreight Technologies  on Wednesday said its VSDHOne platform now provides Nicotinamide Adenine Dinucleotide (NAD+) therapy through patch, injection, and nasal spray. </p><p class=\"\">\"NAD+ therapy has gained significant attention for its role in cellular health and longevity,\" said Hydreight Technologies Chief Executive Shane Madden. \"By integrating NAD+ into our VSDHOne platform, we are making it easier for patients to access this powerful coenzyme in multiple convenient formats, ensuring they can benefit from its potential impact on energy, cognition, and overall wellness.\"</p><p class=\"\">Shares of the company closed down $0.30 or 12.5%, at $2.10 on Tuesday on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309917:0/",
            "pub_date": "2025-02-05 22:18:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310002:0",
            "title": "Market Chatter: Apollo Global Developing Platform for Private Asset Trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Global Management  is working on a platform to enable trading of \"high-grade\" private assets, aiming to improve liquidity in the market, Bloomberg reported Wednesday, citing Eric Needleman who is head of Apollo Capital Solutions. </p><p class=\"\">The asset management firm is in talks with banks, exchanges, and fintech companies to offer real-time data and intraday pricing for private credit transactions, Needleman was reported as saying. </p><p class=\"\">Apollo has already executed trades with TPG's  TPG Angelo Gordon and has around 60 active clients trading its originated assets, Bloomberg said citing people familiar with the matter. </p><p class=\"\">Apollo did not immediately respond to MT Newswires' request for comment. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310002:0/",
            "pub_date": "2025-02-05 22:19:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw7TzwxS:0",
            "title": "Nevis Brands Inc. Announces Licensing Agreement and Expansion of Major Brands to Illinois",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">●     The Company has secured a licensing agreement withDrecisco Farms to produce and distribute Major™ in Illinois</p><p class=\"\">●  The Company has begun planning for production anddistribution is to begin in April 2025</p><p class=\"\">SEATTLE, WA, February 5th, 2024 – TheNewswire -Nevis Brands Inc. (CSE: NEVI, OTCQB:  NEVIF) (“Nevis,”“Nevis Brands” or the “Company”), a leading provider ofcannabis beverage products, announced today it has executed alicensing agreement with Drecisco Farms of Morton Grove, IL to produceand distribute Major(™)</p><p class=\"\">Drecisco  has licensed the full lineup of Major(™) and will leadwith the production of Major (™) shots in Blueberry, Fruit Punch andBlackberry Lemonade.  Major is a dosable 100mg THC beverage thatdelivers the effects of cannabis within 10-20 minutes of consumption.Over 5 million bottles of Major(™) have been sold since its initiallaunch in Washington State in 2019. </p><p class=\"\">According to Illinois government reported figures, cannabis sales inIllinois totaled almost 2 billion and has over 170 retaildispensaries.  Illinois is one of the largest cannabis markets in theUnited States.  Nevis expects Major(™) to be on sale in Illinois byApril 2025.</p><p class=\"\">“We have long sought to enter the Illinois market and believe wehave found the best possible licensee with Drecisco Farms,” saidJohn Kueber, Nevis Brands CEO.  “The Illinois cannabis market hasremained strong from a pricing and demand perspective and represents aseries of opportunities for Major(™) beverages.  With our recentlaunches in New Jersey, Mississippi, Missouri and Oklahoma in the lastyear, we are excited to replicate those successes.”</p><p class=\"\">Major is currently sold in 10 different states and also available inmost of the United States through its hemp derived THC product. Major is on track to sell over $15 million in retail sales in 2025.</p><p class=\"\">About Nevis Brands</p><p class=\"\">Nevis innovates and develops cannabis products that have been consumedby millions of consumers across the United States. Led by our flagshipbrand Major™ Nevis partners with leading cannabis productmanufacturers and distributors to enhance their product offerings.</p><p class=\"\">CONTACT INFORMATION: </p><p class=\"\">Investor Relations - John Kueber - investors@nevisbrands.com - Tel: 425-380-2151</p><p class=\"\">www.nevisbrands.com</p><p class=\"\">NEITHER THE CANADIAN SECURITIES EXCHANGE NOR ITS REGULATION SERVICESPROVIDER HAS REVIEWED OR ACCEPT RESPONSIBILITY FOR THE ADEQUACY ORACCURACY OF THIS RELEASE. Cautionary Statement Regarding“Forward-Looking” Information Some of the statements contained inthis news release are forward-looking statements and informationwithin the meaning of applicable securities laws. Forward-lookingstatements and information can be identified by the use of words suchas “expects”, “intends”, “is expected”, “potential”,“suggests” or variations of such words or phrases, or statementsthat certain actions, events or results “may”, “could”,“should”, “would”, “might” or “will” be taken, occuror be achieved. This forward-looking information is provided as of thedate of this news release. The forward-looking information reflectsour current expectations and assumptions and is subject to a number ofknown and unknown risks, uncertainties and other factors, which maycause actual results, performance, or achievements to be materiallydifferent from any anticipated future results, performance orexpectations expressed or implied by the forward-looking information.No assurance can be given that these assumptions will prove correct.Forward-looking statements and information are not historical factsand are subject to a number of risks and uncertainties beyond theCompany’s control. Investors are advised to consider the riskfactors under the heading “Risks and Uncertainties” in theCompany’s Form 2A, available at www.sedar.com for a discussion ofthe factors that could cause the Company’s actual results,performance and achievements to be materially different from anyanticipated future results, performance, or achievements expressed orimplied by the forward-looking information. Accordingly, readersshould not place undue reliance on forward-looking statements. TheCompany undertakes no obligation to update publicly or otherwiserevise any forward-looking statements, except as may be required bylaw.</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw7TzwxS:0-nevis-brands-inc-announces-licensing-agreement-and-expansion-of-major-brands-to-illinois/",
            "pub_date": "2025-02-05 22:20:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OU0HF:0",
            "title": "Aon and Swiss Re CorSo launch parametric US storm surge cover with Floodbase",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Aon, parametric specialist Floodbase and Swiss Re Corporate Solutions have announced a new parametric insurance product designed to cover hurricane-related storm surge risks for US corporations.</p><p class=\"\">The policy pays claims when storm surges exceed an agreed water height, measured using a variety of meteorological data sources. Payouts can be used to cover any financial loss associated with the event, not only physical damage.</p><p class=\"\">Storm surge damage can account for more than a third of losses from some hurricanes, Aon said, while traditional insurance policies can have high deductibles or exclusions for storm surge risks.</p><p class=\"\">Cole Mayer, head of parametric solutions at Aon, said: “Our data shows that storm surges can be a significant driver of losses for insurers, so we developed this collaborative parametric solution to help bolster existing levels of cover.</p><p class=\"\">\"The solution can function either as a standalone product or in conjunction with traditional and non-traditional insurance policies, to ensure that clients can secure comprehensive protection for their US storm surge exposures. It is part of a suite of Aon product offerings that together are helping to shape better decisions and more comprehensive sources of liquidity for clients.”</p><p class=\"\">Martin Hotz, head parametric natural catastrophe at Swiss Re Corporate Solutions, said: “Parametric insurance provides a fast, flexible and transparent way to cover financial losses caused by natural catastrophes.</p><p class=\"\">\"A substantial part of hurricane-related losses can be the result of storm surge, and with this innovative solution we can better assist corporations in exposed areas with a rapidly-paying cover that fits their individual risk management strategies.\"</p><p class=\"\">Annbjørg Medhaug, chief product and strategy officer at Floodbase, added: “The economic losses in the wake of major hurricanes are staggering. The inherent flexibility of this parametric storm surge product provides US coastal corporations with a much-needed solution to address their specific protection gaps.</p><p class=\"\">\"Floodbase is delighted to have collaborated with Aon and Swiss Re Corporate Solutions to develop this solution, which demonstrates our continuous commitment to uniting technology and risk capital in order to bring more comprehensive protection to cedants.”</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OU0HF:0-aon-and-swiss-re-corso-launch-parametric-us-storm-surge-cover-with-floodbase/",
            "pub_date": "2025-02-05 22:20:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310011:0",
            "title": "Stifel Adjusts Simon Property Group's Price Target to $178 From $175.50",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Simon Property Group  has an average rating of overweight and mean price target of $189.18, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310011:0/",
            "pub_date": "2025-02-05 22:20:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006819:0",
            "title": "Komodor Reports Record Business Results for 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Komodor Reports Record Business Results for 2024</p><p class=\"\">Company posts 200% increase in revenue and 400% jump in Fortune 500 customers</p><p class=\"\">TEL AVIV &amp; SAN FRANCISCO--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Komodor, the company that automates Kubernetes operations, health, performance and cost management, today announced that over the past twelve months ended January 31, it increased annual recurring revenue (ARR) by 200% and grew its enterprise customer base by more than 400%. These business results underline the market opportunity that Komodor is addressing with its ability to optimize Kubernetes environments and reduce the operational complexity associated with managing the world's leading containerization platform.</p><p class=\"\">\"2024 was a breakout year for Komodor in terms of customer acquisition with exponential demand among enterprises looking for practical, automated and scalable solutions to manage their sprawling Kubernetes environments,\" said Ben Ofiri, Co-Founder and CEO of Komodor. \"We are committed to delivering and enhancing a comprehensive management platform that simplifies operations, drives cost efficiency, and empowers both platform and development teams to achieve operational excellence with Kubernetes.\"</p><p class=\"\">Meeting Critical Market Needs</p><p class=\"\">The rapid adoption of Kubernetes has introduced unique operational challenges, with many organizations struggling to overcome \"day-two\" operational hurdles to maintain efficiency, reliability, and cost control. Komodor's focus on simplifying Kubernetes management addresses increasing demand among organizations for an automated solution that mitigates risks, such as configuration drift and resource inefficiencies, while providing actionable insights through AI-driven root cause analysis.</p><p class=\"\">An analysis of more than 1000 calls with enterprise Kubernetes users in 2024 revealed several pervasive pain points:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">86% lack effective troubleshooting and root cause analysis tools: Teams   frequently reported spending excessive time collecting and correlating   data across disparate systems.     </li><li class=\"listItem-bmN0_SHH\">70% encounter friction between infrastructure and development teams:   This gap in Kubernetes expertise creates delays in resolving incidents   and inefficiencies in resource allocation.     </li><li class=\"listItem-bmN0_SHH\">58% face migration and large-scale cluster fleet management challenges:   Multi-region and multi-tenant environments amplify operational challenges,   especially for visibility and configuration management.     </li><li class=\"listItem-bmN0_SHH\">40% cited configuration drift as a risk to stability: Misaligned   configurations across clusters hinder standardization and introduce   operational vulnerabilities.     </li><li class=\"listItem-bmN0_SHH\">30% struggle with cost optimization: Organizations frequently noted   unclear resource constraints and overspending on Kubernetes without   actionable insights to improve performance.   </li></ul><p class=\"\">These challenges highlight the market opportunity for Komodor to help organizations streamline Kubernetes management, reduce downtime, and enhance collaboration between teams.</p><p class=\"\">2024 Business Milestones</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">3X Increase in Revenue: Komodor ARR increased by 200% year over year.     </li><li class=\"listItem-bmN0_SHH\">Accelerated Enterprise Adoption: Komodor expanded its customer base   across industries such as financial services, retail, and technology,   reflecting the growing demand for solutions tailored to large-scale   Kubernetes environments. Its share of Fortune 500 customers increased by   400%.     </li><li class=\"listItem-bmN0_SHH\">More than 50% of Customers Expanded Deployments: The platform's ability   to automate troubleshooting, proactively manage risks, and optimize costs   led to a 60% increase in customers expanding their deployments with   additional licenses. Users emphasized time savings and reduced   operational friction as key benefits.     </li><li class=\"listItem-bmN0_SHH\">Customer Stickiness Jumps: 5X increase in user sessions, highlighting   the Komodor platform's exceptional value for resolving issues.     </li><li class=\"listItem-bmN0_SHH\">Product Innovation covers Full-Stack Capabilities and GenAI   Integration: Komodor continued to push the boundaries of Kubernetes   management with two major platform advancements.   </li></ul><p class=\"\">Its November release introduced centralized management for Kubernetes workloads and add-ons (CRDs and operators), filling critical visibility gaps and enhancing operational resilience for platform teams.</p><p class=\"\">Earlier in the year, Komodor integrated Klaudia, a pioneering GenAI agent, which simplifies and accelerates root-cause analysis, delivering tailored diagnostics and remediation guidance across the Kubernetes stack. These advancements empower teams to tackle complex issues with unmatched speed and precision, optimizing performance while bridging expertise gaps.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jim Hunnewell Joins as CRO: Seasoned sales leader with over 25 years of   experience in tech and startups including at Pulumi, GitHub, Sqreen, and   others joined Komodor to scale the business.     </li><li class=\"listItem-bmN0_SHH\">Amy Ariel Appointed CMO: Start-up go-to-market expert who led marketing   efforts for Ermetic until its acquisition by Tenable and previously   served as CMO at Meta Networks and CEO of Ariel Marketing, was added to   executive management team.   </li></ul><p class=\"\">About Komodor</p><p class=\"\">Komodor reduces the cost and complexity of managing large-scale Kubernetes environments by automating day-to-day operations, as well as health and cost optimization. The Komodor Platform proactively identifies risks that can impact application availability, reliability, and performance, while providing AI-assisted root-cause analysis, troubleshooting, and automated remediation playbooks. Fortune 500 companies in a wide range of industries rely on Komodor to empower developers, reduce TicketOps, and harness Kubernetes to accelerate their business. The company has received $67M in funding from Accel, Felicis, NFX Capital, OldSlip Group, Pitango First, Tiger Global, and Vine Ventures. For more information, visit komodor.com, join the Komodor Kommunity, and follow us on LinkedIn and X.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204427302/en/</p><p class=\"\">CONTACT:    Media:</p><p class=\"\">Marc Gendron</p><p class=\"\">Marc Gendron PR for Komodor</p><p class=\"\">marc@mgpr.net</p><p class=\"\">617-877-7480</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006819:0/",
            "pub_date": "2025-02-05 22:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACS6y9Cpa:0",
            "title": "Lights, Camera, Podcast! Oscar-Winning Duo Quentin Tarantino & Roger Avary Partner Exclusively with Libsyn for \"The Video Archives Podcast\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PITTSBURGH, PA / ACCESS Newswire / February 5, 2025 / Today, <strong class=\"root-Tkn6WL2y\">Liberated Syndication Inc.</strong> (\"Libsyn\"), the leading podcasting platform for creators and advertisers, announced an exclusive, multi-year advertising and hosting partnership with the blockbuster podcast, <strong class=\"root-Tkn6WL2y\">\"</strong>The Video Archives Podcast with Roger Avary &amp; Quentin Tarantino<strong class=\"root-Tkn6WL2y\">.\"</strong> The podcast gives listeners a cinematic backstage pass as two of Hollywood's most legendary storytellers revisit film classics, unearth hidden gems, and dish out their unfiltered takes - and it gives advertisers a unique opportunity to connect with an engaged audience of film enthusiasts through premium content.</p><p class=\"\">\"Libsyn is a wonderful partner, and we're thrilled to be working with them on 'The Video Archives Podcast,' Season 2,\" said <strong class=\"root-Tkn6WL2y\">Quentin Tarantino</strong>.</p><p class=\"\">Legendary filmmaker <strong class=\"root-Tkn6WL2y\">Quentin Tarantino</strong> <em>(Pulp Fiction, Once Upon a Time…In Hollywood)</em> and Academy Award-winning creator <strong class=\"root-Tkn6WL2y\">Roger Avary</strong> <em>(Pulp Fiction, The Rules of Attraction)</em> invite listeners to step back in time to Video Archives, the video rental store where their journey began. In 1983, the duo started working together at the original Manhattan Beach location, where they bonded over a shared love of cinema and built a reputation as local celebrities for their encyclopedic knowledge of classic and lesser-known films. Their curated recommendations not only brought new audiences to overlooked gems but also laid the foundation for their acclaimed collaboration on <em>Pulp Fiction</em>.</p><p class=\"\">Now, more than 30 years later, Quentin and Roger are revisiting that cinematic treasure trove on \"The Video Archives Podcast.\" Joined by their trusty producer <strong class=\"root-Tkn6WL2y\">Gala Avary</strong>, they'll dive into the original VHS tapes Quentin acquired in 1995 to rebuild the store in his home. Each episode features the trio rewatching and discussing movies, from controversial James Bond films to surprising exploitation flicks, the trio will expose fans to movies they didn't know they'd love, give awards to their favorites, and, of course, rate the quality of the video transfers. It's a nostalgic celebration of the films that shaped their passion for storytelling-and a unique invitation for fans to experience the magic of Video Archives.</p><p class=\"\">\"We're so happy to have Libsyn as our podcast advertising partner for Season 2 of ‘The Video Archives Podcast,' allowing us to continue to connect with listeners all over the globe,\" added <strong class=\"root-Tkn6WL2y\">Roger Avary</strong>.</p><p class=\"\">In addition to Libsyn's robust suite of <strong class=\"root-Tkn6WL2y\">hosting</strong> tools designed for podcasters to create and grow effortlessly, this partnership utilizes <strong class=\"root-Tkn6WL2y\">Libsyn Ads</strong>' advanced advertising solutions, including <strong class=\"root-Tkn6WL2y\">Host-Read</strong> and <strong class=\"root-Tkn6WL2y\">Automatic Ads</strong> offerings. These ad integrations allow podcast creators to seamlessly incorporate premium programmatic ads into their host-read programs. By leveraging Libsyn Ads' comprehensive advertising platform, \"The Video Archives Podcast\" will deliver targeted ads that resonate with their audience and drive impactful results for advertisers.</p><p class=\"\">\"Collaborating with Quentin and Roger on a podcast that champions the art of storytelling through film is truly inspiring,\" said <strong class=\"root-Tkn6WL2y\">Stephen Perlstein</strong>, Senior Vice President of Business Development at Libsyn Ads. \"Podcasts about film and entertainment continue to draw an ever-expanding audience, and this partnership provides a unique opportunity to connect engaged and passionate listeners with brands through authentic and impactful advertising experiences.\"</p><p class=\"\">Libsyn Ads empowers brands to effectively target and reach a fast-growing and coveted podcast audience and helps creators to monetize their audio and video content. The ad buying and management platform delivers end-to-end capabilities, streamlining the process for podcast advertisers to initiate and oversee highly targeted and measurable campaigns, while providing maximum returns for creators. For more information or to advertise on the \"The Video Archives Podcast,\" please contact ad-sales@libsyn.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Liberated Syndication</strong></p><p class=\"\">Celebrating our 20th year in podcasting, Liberated Syndication Inc. (\"Libsyn\") is the leading podcasting platform for creators and advertisers to host, distribute, monetize, amplify, and measure their audio and video content. The Company hosts more than 70,000 shows and delivers over 2.5 billion downloads annually to listeners globally. Libsyn Ads offers industry-leading podcast advertising solutions, serving as a comprehensive ad buying and management offering for creators, advertisers, and agencies to initiate and manage highly targeted campaigns across thousands of shows. Visit libsyn.com or investor.libsyn.com for more information on the Company and the platforms that it powers.</p><p class=\"\">#  #  #</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contacts:</strong> Ray Yeung + Nancy Zakhary | ray@relev8.co + nancy@relev8.co</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact:</strong> investor@libsyn.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Liberated Syndication, Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACS6y9Cpa:0/",
            "pub_date": "2025-02-05 22:09:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309998:0",
            "title": "Truist Adjusts Expedia Group's Price Target to $163 From $148, Keeps Hold Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Expedia Group  has an average rating of overweight and mean price target of $193.16, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309998:0/",
            "pub_date": "2025-02-05 22:09:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309999:0",
            "title": "Morgan Stanley Cuts Price Target on Estee Lauder to $81 From $85",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estee Lauder  has an average rating of Hold and mean price target of $80.16, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309999:0/",
            "pub_date": "2025-02-05 22:09:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX7JSfNS:0",
            "title": "Visadoro Golden Visas (Portugal) Launches Brand New Cancer Research Golden Visa For Visionary Philanthropists",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BELMONTE, Portugal, Feb.  05, 2025  (GLOBE NEWSWIRE) — Portugal terminated the real estate investment option under their Golden Visa in late 2023. This left investment funds, job creation, and donations towards cultural and research initiatives as the only remaining program options.</p><p class=\"\">And of the remaining choices, the Research Golden Visa track –<em> requiring a donation of at least </em><em>€</em><em>500,000</em> – has been the most frequently overlooked.</p><p class=\"\">This is all set to change in 2025, thanks to the launch of a groundbreaking new <strong class=\"root-Tkn6WL2y\">Research Golden Visa</strong> product by <strong class=\"root-Tkn6WL2y\">Visadoro</strong>, a Portuguese investment migration firm based out of Belmonte, Portugal.</p><p class=\"\">Collaborating with a prestigious Portuguese research institution, Visadoro has developed a Golden Visa eligible donation product that also serves as a cutting-edge cancer cover.</p><p class=\"\">Philanthropic donors making a minimum investment of €750,000 towards next-gen cancer research projects in Portugal can qualify for the Portuguese Golden Visa. Golden Visa holders qualify for a flexible “Plan B” type residency in Portugal, whereby they gain the <em>right</em> to live in Portugal full-time, without the <em>obligation to do so. </em></p><p class=\"\">This type of residency also offers a clear path to Permanent Residency (PR), and eventual Portuguese citizenship – with a minimum <!-- -->in-country presence requirement of only 7 days per year during the 5-year Temporary Residency stage.</p><p class=\"\">In addition, applicants participating in this program can also benefit from free cutting-edge cancer treatment in the event that they were to be diagnosed with cancer themselves.</p><p class=\"\">Moreover, the treatment cover can be extended to the primary donor’s spouse and up to two dependents over the age of 18, subject to additional financial contributions per dependent:</p><p class=\"\">To extend treatment coverage for a spouse, an additional contribution of €250,000 is required (i.e. €1 million in total). The minimum program contribution for a family of 3 is €1.5 million, and €2 million for a family of 4.</p><p class=\"\"><em>(</em><strong class=\"root-Tkn6WL2y\"><em>Note: </em></strong>the institution does not offer paediatric cancer treatment, however, minor dependents can be added as beneficiaries, and become eligible for treatment once they turn 18).</p><p class=\"\">In countries like the United States, gaining access to cutting-edge cancer treatments can literally cost millions of dollars, making the program’s benefits exceptionally attractive in terms of value for money.</p><p class=\"\">So for philanthropists already supporting oncology research, this program is a true no-brainer.</p><p class=\"\">The providers of conventional cancer insurance products typically run on a for-profit basis. Hence, pre-screening tends to be a prerequisite for obtaining cover, and care tends to be refused for applicants with pre-existing conditions.</p><p class=\"\">Not so in this instance: the collaborating research foundation actively encourages applications from individuals who could benefit.</p><p class=\"\">Hence, <strong class=\"root-Tkn6WL2y\">there are no pre-screening tests, and</strong> <!-- -->you cannot be precluded from program participation based on the fact that you’ve already been diagnosed with cancer.</p><p class=\"\">The institution’s research facilities are complemented by top-tier treatment facilities, where patients can look forward to a best-in-class treatment and care experience in the spectacular city of Lisbon.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Portuguese Golden Visas, Redefined For Good</strong></p><p class=\"\">In the past, the Golden Visa Program has drawn criticism based on allegations that foreign direct investments only benefited the real estate sector, and didn’t have a broad-based socio-economic impact.</p><p class=\"\">In contrast, contributions under the Cancer Research Golden Visa Program help to position Portugal at the forefront of global cancer research. It enables researchers to radically reduce the time it takes to take new medicines and treatment technologies from laboratory to bedside.</p><p class=\"\">And ultimately, it will serve to bring life-saving treatments to a far greater number of patients in need, both in Portugal and beyond.</p><p class=\"\">In the past, some Golden Visa applicants have also been accused of wanting to gain access to Portugal without integrating into the country, or making a valuable contribution to the public good.</p><p class=\"\">It is for precisely for this reason that Visadoro and its research partners developed this Golden Visa product; <!-- -->to attract visionary philanthropists who want to make a high-impact socio-economic contribution to their new home country.</p><p class=\"\">For these individuals, the program contribution is not a box-ticking exercise. Instead, they are societally conscious agents of change, seeking to put their wealth to work towards building a brighter future; both for their children, and for humanity as whole.</p><p class=\"\">Annually, global philanthropic giving towards cancer research is already a multi-billion-dollar sector.</p><p class=\"\">And now, thanks to this <strong class=\"root-Tkn6WL2y\">innovative</strong> <strong class=\"root-Tkn6WL2y\">Cancer Research Golden Visa</strong> product, donors in this sector can gain cutting-edge cancer treatment cover, in addition to the knowledge that they’re leaving the world in a better state than they found it in.</p><p class=\"\">The research foundation actively fosters deep relationships with their donors, and invites interested parties to pay a visit to their world-class facilities in Lisbon.</p><p class=\"\">According to Jose Mineiro, founder and CEO of Visadoro, the Cancer Research Golden Visa program is a logical extension of his company’s ethos of putting the Golden Visa program to work for the good of Portugal and its people.</p><p class=\"\">Visadoro are also involved in various developmental initiatives seeking to drive more direct investment and resource allocation in the Portuguese interior.</p><p class=\"\">Interested parties are invited to get in touch with the team at Visadoro at the below contact details.</p><p class=\"\">Alternatively, for more information,<strong class=\"root-Tkn6WL2y\"> Google “Cancer Research Golden Visa”</strong>, or visit <strong class=\"root-Tkn6WL2y\">www.ResearchGoldenVisa.com</strong>.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ISSUED BY:</strong></p><p class=\"\">VISADORO – VISAS WITH A PURPOSE</p><p class=\"\">Rua Pedro Alvares Cabral, 11</p><p class=\"\">Belmonte</p><p class=\"\">Portugal</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">WhatsApp:</strong> +351918196577</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Email: </strong>hello@visadoro.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Web: </strong>www.visadoro.com</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/42a6b538-77c0-4238-81eb-f26332ab4a4e</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Cancer Research Golden Visa Option Launched</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">The Cancer Research Golden Visa option is ideal for visionary philanthropists already supporting cancer research initiatives.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX7JSfNS:0-visadoro-golden-visas-portugal-launches-brand-new-cancer-research-golden-visa-for-visionary-philanthropists/",
            "pub_date": "2025-02-05 22:10:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006822:0",
            "title": "Tariff Front-Running Widens America's Trade Deficit — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A surge in the U.S. trade deficit points to businesses getting in orders ahead of the imposition of tariffs on imports, says Thomas Ryan, an economist at Capital Economics. America's trade in goods and services with the rest of the world showed a sharply increased deficit in December to just shy of $100 billion, according to Commerce Department figures set out Wednesday. Imports rose and exports declined. \"The strength of imports appears largely driven by businesses rushing orders ahead of potential tariffs, a trend unlikely to reverse any time soon,\" Ryan tells investors in a note.(joshua.kirby@wsj.com; @joshualeokirby)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006822:0/",
            "pub_date": "2025-02-05 22:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006834:0",
            "title": "SOUTHWEST AIRLINES DECLARES 184th QUARTERLY DIVIDEND",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SOUTHWEST AIRLINES DECLARES 184th QUARTERLY DIVIDEND</p><p class=\"\">PR Newswire</p><p class=\"\">DALLAS, Feb. 5, 2025</p><p class=\"\">DALLAS, Feb. 5, 2025 /PRNewswire/ — Southwest Airlines Co.  Board of Directors declared a quarterly cash dividend of $.18 per share to Shareholders of record at the close of business on March 12, 2025, on all shares then issued and outstanding. The quarterly dividend will be paid on April 2, 2025.</p><p class=\"\">SW-DSR</p><p class=\"\">View original content:https://www.prnewswire.com/news-releases/southwest-airlines-declares-184th-quarterly-dividend-302368917.html</p><p class=\"\">SOURCE Southwest Airlines Co.</p><p class=\"\">/CONTACT: Investor Contact: Southwest Airlines Investor Relations, 214-792-4415, www.southwestairlinesinvestorrelations.com; Media Contact: Southwest Airlines Media Relations, 214-792-4847, swamedia@wnco.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006834:0/",
            "pub_date": "2025-02-05 22:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:c77e3f22e5796:0",
            "title": "Parke Bancorp Director Jeffrey H Kripitz Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Kripitz Jeffrey H</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$152,619</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1324062/000131539925000007/xslF345X05/wk-form4_1738764239.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Jeffrey H Kripitz, a Director at Parke Bancorp, sold 7,559 shares of Common Stock on February 3 and 4, 2025, for a total sale amount of $152,619. The sales were executed at prices of $20.25 and a weighted average price of $20.19 per share, respectively. Following these transactions, Kripitz directly owns 60,454 shares and indirectly owns 175,305 shares of Parke Bancorp through various holdings.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1324062/000131539925000007/xslF345X05/wk-form4_1738764239.xml\" rel=\"nofollow\" target=\"_blank\">PARKE BANCORP, INC. [ PKBK ] - Form 4 - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:c77e3f22e5796:0-parke-bancorp-director-jeffrey-h-kripitz-sells-shares/",
            "pub_date": "2025-02-05 22:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:9c6c5e3953168:0",
            "title": "Akero Therapeutics COO Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Young Jonathan</td></tr><tr><td>Relationship</td><td>Chief Operating Officer</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$538,060</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1779805/000095017025014188/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Jonathan Young, Chief Operating Officer of Akero Therapeutics, sold 10,000 shares of Common Stock on February 3, 2025, under a Rule 10b5-1 trading plan. The transactions occurred at weighted average prices of $53.565 and $54.057, totaling $538,060. Following these sales, Young directly owns 251,147 shares and indirectly owns 60,000 shares through irrevocable trusts for his children.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1779805/000095017025014188/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Akero Therapeutics, Inc. [ AKRO ] - Form 4 - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:9c6c5e3953168:0-akero-therapeutics-coo-sells-shares/",
            "pub_date": "2025-02-05 22:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN12N9yf:0",
            "title": "Invitation to the presentation of Hexicon’s year-end report for 2024 on the 19th of February",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On the 19th of February at 08:00 a.m. (CET) Hexicon AB (publ) will publish its year-end report for 2024. At 10:00 a.m., the same day, Hexicon invites you to participate in a webcast presentation that will be held by the CEO of Hexicon, Marcus Thor.</p><p class=\"\">The webcast will be held in English. At the end of the presentation, participants are welcome to ask questions via the webcast. No pre-registration is required. After the presentation, a recorded version of the webcast will be available here: Financial Reports &amp; Presentations — hexicongroup</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Webcast:</strong></p><p class=\"\">If you want to participate via the webcast, please enter via the link below.</p><p class=\"\"> https://hexicon.events.inderes.com/q4-report-2024</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Phone Conference:</strong></p><p class=\"\">If you want to participate via phone conference, please click on the link below:</p><p class=\"\">https://conference.inderes.com/teleconference/?id=5009754</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN12N9yf:0-invitation-to-the-presentation-of-hexicon-s-year-end-report-for-2024-on-the-19th-of-february/",
            "pub_date": "2025-02-05 22:10:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Tnw78CWpZ:0",
            "title": "Lexaria Updates its Ongoing Human Study GLP-1-H24-4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\">Registered Phase-1b 12-week studyinvestigating safety, </p><p class=\"\">diabetes control, and weightloss</p><p class=\"\">Kelowna, British Columbia –February 5, 2025 – TheNewswire - Lexaria Bioscience Corp. (the “Company” or “Lexaria”), a global innovatorin drug delivery platforms, is pleased to provide progress updates onits Phase 1b, 12-week chronic study GLP-1-H24-4(the “Study”) underway in Australia. </p><p class=\"\">Lexaria has completed its submission to the humanresearch ethics committee (“HREC”) for its planned addition of Study Arm5 to evaluate performance of its DehydraTECH-tirzepatide formulation,pursuant to the positive findings it previously achieved andreleased for Human Pilot Study #3(GLP-1-H24-3).</p><p class=\"\">In addition, the Company is pleased to report that ithas received HREC approval for all 4 of the original arms for allclinical sites participating in the Study. Lexaria had previouslyreported it had received HRECapproval for the lead clinical site, and that it also had completedall clinical test article manufacturing.</p><p class=\"\">“Lexaria thanks its regulatory and clinical team fortheir efforts to complete these milestones,” said John Docherty,President and Chief Scientific Officer of Lexaria Bioscience Corp.“We are especially excited about the prospect of adding the5thArm to this Study following the results of ourHuman Pilot Study #3 which not only showed comparability in terms ofboth blood glucose reduction and increased levels of insulin butalso a significant reduction in adverse eventsrelated to the oral administration of Eli Lilly’s Zepbound®, onceprocessed with our proprietary DehydraTECH™ technology.”</p><p class=\"\">About The Study</p><p class=\"\">The Study is underway with 20 overweight, obese, pre-or type 2 diabetic patients for each of Study Arms 1-4, with Study Arm5 to test DehydraTECH-processed pure tirzepatide.  The 5th Arm is in theprocess of being added because of the previously announced positiveresults from Lexaria’s separate study Human Pilot Study#3. All drugs will be administereddaily by oral tablet or capsule – there are no drug injectionsinvolved in this Study as Lexaria is promoting a change in thestandard of care away from injections and instead embracing oralDehydraTECH delivery. </p><p class=\"\">Arm 1 of the Study is utilizing a proprietary, patentedDehydraTECH-CBD formulation. Our 2022 diabetes animalstudy DIAB-A22-1, utilizing DehydraTECH-CBDevidenced weight loss of 7% and reduced blood glucose levels of19.9%+/-7% (p&lt;0.05) during a multi-week rodent study without the additionof any GLP-1 drugs. Lexaria is looking forward to discovering inhumans whether DehydraTECH-CBD studied alone, or together withDehydraTECH-semaglutide as is being explored inArm 2, might offer some benefit of improved weight loss and/or reducedside effects as compared to Rybelsus® alone.</p><p class=\"\">Arms 2 and 3 of the Study are usingDehydraTECH-processed pure semaglutide and will be compared to StudyArm 4 which will use Rybelsus® tablets (semaglutide) that containsNovo Nordisk’s® proprietary salcoprozate sodium (“SNAC”)technology. It is a world-first that pure semaglutide processed withDehydraTECH technology without SNAC will be compared directly toSNAC-enabled Rybelsus® in a multiple week human study. </p><p class=\"\">In its first-ever GLP-1 study in humans reported in January2024, Lexaria discovered thatDehydraTECH processing of Rybelsus®-branded semaglutide, after asingle dose, improved blood sugar control and reached higher levels ofsemaglutide measured in blood, than did Rybelsus® alone. Also, inrodent study work reported in October2024, Lexaria was pleased to seecomparable performance of DehydraTECH-semaglutide without SNAC toDehydraTECH-processed Rybelsus® formulations including SNAC; whichLexaria previouslyreported may be due to DehydraTECHpreserving similar molecular properties in the gut for ingestedsemaglutide which has been shown to be integral to SNAC-enabledsemaglutide gut absorption.     </p><p class=\"\">Lexaria has several important objectives for thisStudy:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Is DehydraTECH processed: CBD, semaglutide, and/ortirzepatide safe over the Study duration in the Studypopulation? </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Does DehydraTECH-(pure) semaglutide outperformRybelsus®-semaglutide with its proprietary SNAC technology inmeasures of blood sugar control or weight loss? </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Does DehydraTECH processing enhance real world outcomessuch as weight loss and blood sugar control over the Studyduration? </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Does DehydraTECH processing of pure semaglutideevidence reduced side effects during daily dosing for 12 weeks, asDehydraTECH processing of Rybelsus® seemed to achieve in a prior humanstudy utilizing one single dailydose? </p></li></ul><p class=\"\">About Lexaria Bioscience Corp. &amp;DehydraTECH</p><p class=\"\">DehydraTECH™ is Lexaria’s patented drug deliveryformulation and processing platform technology which improves the wayactive pharmaceutical ingredients (APIs) enter the bloodstream throughoral delivery. Since 2016, Lexaria has developed and investigatedDehydraTECH with a variety of beneficial molecules in oral and topicalformats.  DehydraTECH has repeatedly demonstrated the ability toincrease bio-absorption and has also evidenced an ability to deliversome drugs more effectively across the blood brain barrier, whichLexaria believes to be of particular importance for centrally activecompounds. Lexaria operates a licensed in-house research laboratoryand holds a robust intellectual property portfolio with 46 patentsgranted and many patents pending worldwide. For more information,please visit www.lexariabioscience.com.</p><p class=\"\">CAUTION REGARDING FORWARD-LOOKINGSTATEMENTS</p><p class=\"\">This press release includes forward-looking statements.Statements as such term is defined under applicable securities laws.These statements may be identified by words such as\"anticipate,\" \"if,\" \"believe,\"\"plan,\" \"estimate,\" \"expect,\"\"intend,\" \"may,\" \"could,\"\"should,\" \"will,\" and other similar expressions.Such forward-looking statements in this press release include, but arenot limited to, statements by the company relating the Company’sability to carry out research initiatives, receive regulatoryapprovals or grants or experience positive effects or results from anyresearch or study. Such forward-looking statements are estimatesreflecting the Company's best judgment based upon current informationand involve a number of risks and uncertainties, and there can be noassurance that the Company will actually achieve the plans,intentions, or expectations disclosed in these forward-lookingstatements.  As such, you should not place undue reliance on theseforward-looking statements.  Factors which could cause actual resultsto differ materially from those estimated by the Company include, butare not limited to, government regulation and regulatory approvals,managing and maintaining growth, the effect of adverse publicity,litigation, competition, scientific discovery, the patent applicationand approval process, potential adverse effects arising from thetesting or use of products utilizing the DehydraTECH technology, theCompany’s ability to maintain existing collaborations and realizethe benefits thereof, delays or cancellations of planned R&amp;D thatcould occur related to pandemics or for other reasons, and otherfactors which may be identified from time to time in the Company'spublic announcements and periodic filings with the US Securities andExchange Commission on EDGAR. The Company provides links tothird-party websites only as a courtesy to readers and disclaims anyresponsibility for the thoroughness, accuracy or timeliness ofinformation at third-party websites. There is no assurance that any ofLexaria’s postulated uses, benefits, or advantages for the patentedand patent-pending technology will in fact be realized in any manneror in any part. No statement herein has been evaluated by the Food andDrug Administration (FDA).  Lexaria-associated products are notintended to diagnose, treat, cure or prevent any disease. Anyforward-looking statements contained in this release speak only as ofthe date hereof, and the Company expressly disclaims any obligation toupdate any forward-looking statements or links to third-party websitescontained herein, whether as a result of any new information, futureevents, changed circumstances or otherwise, except as otherwiserequired by law.</p><p class=\"\">INVESTOR CONTACT:</p><p class=\"\">George Jurcic - Head of InvestorRelations </p><p class=\"\">ir@lexariabioscience.com </p><p class=\"\">Phone: 250-765-6424, ext202</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Tnw78CWpZ:0-lexaria-updates-its-ongoing-human-study-glp-1-h24-4/",
            "pub_date": "2025-02-05 22:10:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310000:0",
            "title": "JPMorgan Downgrades Grab Holdings to Neutral From Overweight",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Grab Holdings  has an average rating of buy and mean price target of $5.60, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310000:0/",
            "pub_date": "2025-02-05 22:10:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309995:0",
            "title": "Sector Update: Energy Stocks Gain Pre-Bell Wednesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were advancing premarket Wednesday, with The Energy Select Sector SPDR Fund  0.1% higher. </p><p class=\"\">The United States Oil Fund  was 1% lower and the United States Natural Gas Fund  was down 0.2%. </p><p class=\"\">Front-month US West Texas Intermediate crude oil was down 1.1% at $71.87 per barrel at the New York Mercantile Exchange. Global benchmark North Sea Brent crude oil lost 1.2% to reach $75.31 per barrel, and natural gas futures were down 0.8% at $3.23 per 1 million British Thermal Units. </p><p class=\"\">Equinor  reported Q4 adjusted earnings that lagged analyst expectations in addition to posting lower revenue and other income for the quarter. The company also said it is cutting investment outlook to renewables and low carbon solutions to around $5 billion in total after project financing for 2025-2027. Equinor shares were down 3.6% pre-bell. </p><p class=\"\">TotalEnergies  shares rose 1.8% after it reported Q4 adjusted earnings and revenue that exceeded market expectations. </p><p class=\"\">Atmos Energy  shares were up 1% pre-bell Wednesday after it reported higher fiscal Q1 earnings late Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309995:0-sector-update-energy-stocks-gain-pre-bell-wednesday/",
            "pub_date": "2025-02-05 22:10:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309986:0",
            "title": "Roth MKM Adjusts Advanced Micro Devices Price Target to $140 From $200, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Advanced Micro Devices  has an average rating of overweight and mean price target of $156.90, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309986:0/",
            "pub_date": "2025-02-05 22:03:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006681_20250205006709:0",
            "title": "Trivago 4Q Rev EUR94.8M >TRVG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006681_20250205006709:0/",
            "pub_date": "2025-02-05 22:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006681_20250205006711:0",
            "title": "Trivago 4Q EPS EUR0.01 >TRVG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006681_20250205006711:0/",
            "pub_date": "2025-02-05 22:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006707:0",
            "title": "Pasithea Therapeutics Shares Rise After Positive Safety Review for Cancer Treatment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Pasithea Therapeutics  shares were up 67% to $3.46 in premarket trading after the company said that an external safety review committee recommended that its Phase 1 clinical trial of PAS-004 in advanced cancer should proceed to cohort 5, 22mg capsule, without modification.</p><p class=\"\">The biotechnology company said that this recommendation was based on the review of the safety data from three patients in cohort 4A, 15mg capsule, and the absence of any dose limiting toxicities.</p><p class=\"\">The Miami company also said that no rash had been observed to date in any of the first 14 patients who have been dosed with PAS-004 in either capsule or tablet formulation. Rash is a common adverse event that is observed at low doses with competitor inhibitors and may lead to the high discontinuation rate in real world practice.</p><p class=\"\">The continuing Phase 1 clinical trial is a multicenter, open-label, dose escalation 3+3 study design to evaluate the safety, tolerability, pharmacokinetic, pharmacodynamic, and preliminary efficacy of PAS-004 in patients with advanced solid tumors.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006707:0/",
            "pub_date": "2025-02-05 22:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}