{
    "data": [
        {
            "id": "DJN_DN20250204008452_20250204008453:0",
            "title": "US 42-Day Bills: Bid-To-Cover 2.80",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008452_20250204008453:0/",
            "pub_date": "2025-02-05 00:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008452_20250204008452:0",
            "title": "US 42-Day Bills: 4.250%; 71.47% At High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008452_20250204008452:0/",
            "pub_date": "2025-02-05 00:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008456:0",
            "title": "JBS to Spend $200M on Beef Plants — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">1132 ET - JBS, the world's largest meatpacker, says it's investing $200 million in two of its largest U.S. beef plants at a time when meatpackers are broadly struggling to make a profit because of a lack of cattle, driving up costs. The company said $150 million will go to its Cactus, Texas, plant to improve the part of the facility where carcasses are processed into primal cuts and expand its ground beef room. JBS says it will put $50 million toward its Greeley, Colo., plant to build a new distribution center. JBS said the investments will improve efficiencies and could increase production capacity at the two plants that both have the capability to slaughter about 6,000 cattle a day. \"We believe now is the time to invest in the United States,\" said Wesley Batista Filho, JBS' U.S. CEO. (patrick.thomas@wsj.com)</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1036 ET - After three years of underwhelming mergers and acquisition activity, 2025 may finally be the year that the market regains footing, Bain &amp; Company says in a report. While some companies continued M&amp;A during this time--navigating unfavorable market realities to deliver inorganic growth--many didn't have this option, the report says. Foundational shifts in technology, sector profit pools, and the broader global economy demanded a strategic response, the management-consulting firm says. \"We expect that the two biggest inhibitors to deals in 2024--namely, interest rates and regulatory challenges--will ease in 2025,\" it adds. (nina.kienle@wsj.com)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1001 ET - The average buyer's agent commission held steady at 2.37% in 4Q, down slightly from 2.45% a year prior, according to Redfin. Despite new commission rules by the National Association of Realtors implemented in August 2024, commissions saw only minor fluctuations, starting at 2.38% in July, dipping to 2.35% in August, and returning to 2.38% by December. A Redfin survey of 500 U.S. agents revealed that 48% said the average agent commission in their area remained about the same since the NAR settlement took effect, while 43% noted a decline. Moreover, 54% of agents reported increased negotiation efforts over commissions by clients, with only 6% seeing less negotiation. (chris.wack@wsj.com)</p><p class=\"\">0928 ET - New U.S. tariffs on Chinese goods were met with retaliation from China, resulting in selling in CBOT soybean futures overnight. But that selling has moderated, with the most-active soybean contract now down only 0.3% pre-market. Traders who have spoken to WSJ say that a lot of market activity has become reactive to new headlines, but is showing restraint in light of trade uncertainty. \"I think the trade is well braced for this,\" says Terry Reilly of Marex. Reilly adds that many traders likely \"learned their lesson\" after handling the fallout of the trade war with China in Trump's first term. (kirk.maltais@wsj.com)</p><p class=\"\">0922 ET - The dollar recovers some ground after yesterday's choppy session, which ended with a small decline in the WSJ Dollar Index as tariffs on Mexico and Canada were delayed. The trade war with China goes on and markets remain worried about the potential fallout of a prolonged period in which tariffs would loom over the global economy. BBH says in a report that investors should look through the noise and focus on the fact that the U.S. still has strong growth and elevated inflation, \"and a more hawkish Fed continues to favor higher U.S. yields and a stronger dollar.\" The greenback strengthens 0.3 against the yen and is stable versus the euro. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0918 ET - Much of the past few days has been about gauging how inflexible the Trump administration will be on tariffs; in other words, whether they're better understood as firm policy or a negotiating tool. Quick postponements of the Canada and Mexico tariffs point to the latter category, strategist Will Compernolle of FHN Financial writes. He notes China's retaliatory tariffs against the only barriers Trump has actually implemented so far don't start until Feb. 10. That \"implies room for negotiation, something traders may take as a sign these tariffs will not be long term,\" Compernolle writes. \"The trade relationship may nevertheless be scarred, but there's a sense, rightly or wrongly, the more maximalist policies will not be the equilibrium.\" (matt.grossman@wsj.com; @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008456:0/",
            "pub_date": "2025-02-05 00:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_AQN2K0IGW:0",
            "title": "U.S. 42-day cash management bills high rate 4.250%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">WASHINGTON, Feb 4 (Reuters) - The U.S. Treasury Department said its Dutch bidding auction of 42-day cash management bills brought these results:</p><p class=\"\">42-DAY CASH MANAGEMENT BILLS</p><p class=\"\">RATES</p><p class=\"\">High        4.250%    Median      4.240%    Low         4.180%    Investment  4.330%</p><p class=\"\">PRICE/ACCEPTANCES</p><p class=\"\">Price              99.504167    Accepted at high   71.47%    Bid-to-cover ratio 2.80</p><p class=\"\">AMOUNTS TENDERED AND ACCEPTED (dollars)</p><p class=\"\">Total accepted                 85,000,577,000    Total public bids tendered    237,871,616,000    Competitive bids accepted      84,651,911,000    Noncompetitive bids accepted      348,666,000    Fed add-ons                                 0</p><p class=\"\">BILLS DETAILS</p><p class=\"\">Issued date    Feb 06, 2025    Maturity date  March 20, 2025    CUSIP number   912797KJ5</p><p class=\"\">Dutch auctions are also called uniform-price auctions.Successful bidders pay only the price of the lowest acceptedbid, rather than the actual price they bid as in amultiple-price auction.</p><p class=\"\">For related historical price quotes please click on &lt;US/AUCTION&gt;</p><p class=\"\">((Washington newsroom, +1 202 898-8395, fax +1 202 898-8383, washington.economic.newsroom@reuters.com))</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_AQN2K0IGW:0-u-s-42-day-cash-management-bills-high-rate-4-250/",
            "pub_date": "2025-02-05 00:32:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NF:0",
            "title": "De La Rue begins formal sale process after interest from Edi Truell's consortium, others",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        UK banknote printer De La Rue  said on Tuesday it had commenced a formal sale process after it received preliminary takeover approaches from parties other than a consortium of British financier Edi Truell's companies. </p><p class=\"\">Shares of the company rose as much as 8.7% to 125 pence after the announcement. </p><p class=\"\">De La Rue said the consortium, which consists of Truell's Disruptive Capital GP and Pension SuperFund Capital (PSFC), has offered to buy it through the issuance of a debt instrument and a share buyback.</p><p class=\"\">    The proposed buyback is priced at 125 pence per share, which the consortium had earlier offered. </p><p class=\"\">    The consortium had in January proposed to buy De La Rue for $301 million.  </p><p class=\"\">    \"The company expects interested parties to submit an expression of interest by 31 March 2025,\" said the printer of the new King Charles III currency notes in the UK.  </p><p class=\"\">    De La Rue clarified that PSFC's earlier deadline to put a formal offer was no longer applicable.  </p><p class=\"\">    The company is also in talks for the sale of its     authentication arm     for $391.3 million, including debt, to U.S. rival Crane NXT .  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NF:0-de-la-rue-begins-formal-sale-process-after-interest-from-edi-truell-s-consortium-others/",
            "pub_date": "2025-02-05 00:32:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSfY9yYa:0",
            "title": "China Ratchets Up Export Restrictions on Defense-Critical Minerals to the U.S.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S. Urged to Accelerate Production of its Own Critical Minerals and Reduce its Dependence on China, Russia, and other Adversarial Nations</p><p class=\"\">CENTENNIAL, CO / ACCESS Newswire / February 4, 2025 / The People's Republic of China is ratcheting up efforts to deny the U.S. and its allies access to critical minerals that are essential to national defense and many commercial technologies, according to Mark Smith, Executive Chairman and CEO of NioCorp Developments Ltd. (\"<strong class=\"root-Tkn6WL2y\">NioCorp</strong>\" or the \"<strong class=\"root-Tkn6WL2y\">Company</strong>\") (<strong class=\"root-Tkn6WL2y\">NASDAQ:NB</strong>).</p><p class=\"\">According to the Feb. 4, 2025 Wall Street Journal, China implemented export restrictions of five additional critical minerals: tungsten, tellurium, bismuth, molybdenum, and indium (https://www.wsj.com/livecoverage/trump-tariffs-us-trade-stock-market-02-04-2025/card/china-restricts-exports-of-critical-minerals-in-retaliatory-move-e8omEEQJLU911Z1jt4gT). In December 2024, China <strong class=\"root-Tkn6WL2y\">banned the export</strong> of gallium and germanium, which are vital to many electronics and defense applications, and increased export restrictions on graphene.</p><p class=\"\">All of these minerals have applications in various defense and commercial technologies, but export blocks on other critical minerals cause much more damage to the Pentagon, according to Smith.</p><p class=\"\">\"With today's move, China is showing that it will not hesitate to deny the U.S. access to other critical minerals that are much more vital,\" Smith said. \"If they start restricting U.S. access to rare earths, for example, as they did for a brief time in 2010, we are in serious trouble.\"</p><p class=\"\">In another move aimed squarely at the Pentagon, China's Ministry of Commerce (MOFCOM) announced on January 1, 2025 the addition of 28 U.S. defense-sector companies to its Export Control List. That means that these companies, which include Raytheon, General Dynamics, Boeing, and others, may not import from China \"dual use\" goods and technologies that can be used in both commercial and defense systems.</p><p class=\"\">NioCorp and GreenMet (https://greenmet.com/) recently issued a warning to U.S. policymakers and manufacturers of coming export restrictions on defense-critical minerals: https://dailycaller.com/2025/01/31/smith-horn-china-missile-aimed-pentagon-xi-jinping/</p><p class=\"\">NioCorp is working to produce four sets of defense-critical minerals at its Elk Creek Critical Minerals Project in Nebraska, including niobium, scandium, titanium, and rare earths. For more information, see https://www.niocorp.com</p><p class=\"\"># # #</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FOR MORE INFORMATION:</strong></p><p class=\"\">Jim Sims, Corporate Communications Officer, NioCorp Developments Ltd., (720) 334-7066, jim.sims@niocorp.com</p><p class=\"\">@NioCorp $NB #EXIM #Niobium #Scandium #rareearth #neodymium #dysprosium #terbium #ElkCreek #EV #electricvehicle</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ABOUT NIOCORP</strong></p><p class=\"\">NioCorp is developing a critical minerals project in Southeast Nebraska that will produce niobium, scandium, and titanium. The Company also is evaluating the potential to produce several rare earths from the Project. Niobium is used to produce specialty alloys as well as High Strength, Low Alloy (\"HSLA\") steel, which is a lighter, stronger steel used in automotive, structural, and pipeline applications. Scandium is a specialty metal that can be combined with Aluminum to make alloys with increased strength and improved corrosion resistance. Scandium is also a critical component of advanced solid oxide fuel cells. Titanium is used in various lightweight alloys and is a key component of pigments used in paper, paint and plastics and is also used for aerospace applications, armor, and medical implants. Magnetic rare earths, such as neodymium, praseodymium, terbium, and dysprosium are critical to the making of Neodymium-Iron-Boron (\"NdFeB\") magnets, which are used across a wide variety of defense and civilian applications.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FORWARD-LOOKING STATEMENTS</strong></p><p class=\"\">This press release contains forward-looking statements within the meaning of the United States Private Securities Litigation Reform Act of 1995 and forward-looking information within the meaning of applicable Canadian securities laws (collectively \"forward-looking statements\"). Forward-looking statements may include, but are not limited to, statements regarding NioCorp's expectation that China will continue to restrict exports of defense-critical minerals to the U.S. and its allies; NioCorp's expectation that any access restrictions to Chinese rare earths would have significant and negative impacts to U.S. national security; NioCorp's expection of producing niobium, scandium, and titanium, and the potential of producing rare earths, at the Elk Creek Project; and NioCorp's ability to secure sufficient project financing to complete construction of the Elk Creek Project and move it to commercial production. Forward-looking statements are typically identified by words such as \"plan,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"outlook,\" \"estimate,\" \"forecast,\" \"project,\" \"continue,\" \"could,\" \"may,\" \"might,\" \"possible,\" \"potential,\" \"predict,\" \"should,\" \"would\" and other similar words and expressions, but the absence of these words does not mean that a statement is not forward-looking.</p><p class=\"\">The forward-looking statements are based on the current expectations of the management of NioCorp and are inherently subject to uncertainties and changes in circumstances and their potential effects and speak only as of the date of such statement. There can be no assurance that future developments will be those that have been anticipated. Forward-looking statements reflect material expectations and assumptions, including, without limitation, expectations and assumptions relating to: NioCorp's ability to receive sufficient project financing for the construction of the Elk Creek Project on acceptable terms or at all; our ability to service our existing debt and meet the payment obligations thereunder; the future price of metals; the stability of the financial and capital markets; and current estimates and assumptions regarding the business combination with GX Acquisition Corp. II (the \"Business Combination\") and the standby equity purchase agreement (the \"Yorkville Equity Facility Financing Agreement\" and, together with the Business Combination, the \"Transactions\") with YA II PN, Ltd., an investment fund managed by Yorkville Advisors Global, LP, and their benefits. Such expectations and assumptions are inherently subject to uncertainties and contingencies regarding future events and, as such, are subject to change. Forward-looking statements involve a number of risks, uncertainties or other factors that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, but are not limited to, those discussed and identified in public filings made by NioCorp with the U.S. Securities and Exchange Commission and with the applicable Canadian securities regulatory authorities and the following: NioCorp's ability to use the net proceeds of financings in a manner that will increase the value of shareholders' investment; NioCorp's ability to operate as a going concern; NioCorp's requirement of significant additional capital; NioCorp's ability to receive sufficient project financing for the construction of the Elk Creek Project on acceptable terms or at all; NioCorp's ability to receive a final commitment of financing from the Export-Import Bank of the United States on an acceptable timeline, on acceptable terms, or at all; NioCorp's ability to recognize the anticipated benefits of the Transactions, including NioCorp's ability to access the full amount of the expected net proceeds under the Yorkville Equity Facility Financing Agreement; NioCorp's ability to continue to meet the listing standards of Nasdaq; risks relating to NioCorp's common shares, including price volatility, lack of dividend payments and dilution or the perception of the likelihood of any of the foregoing; the extent to which NioCorp's level of indebtedness and/or the terms contained in agreements governing NioCorp's indebtedness or the Yorkville Equity Facility Financing Agreement may impair NioCorp's ability to obtain additional financing; covenants contained in agreements with NioCorp's secured creditors that may affect its assets; NioCorp's limited operating history; NioCorp's history of losses; the material weaknesses in NioCorp's internal control over financial reporting, NioCorp's efforts to remediate such material weaknesses and the timing of remediation; the possibility that NioCorp may qualify as a passive foreign investment company under the U.S. Internal Revenue Code of 1986, as amended (the \"Code\"); the potential that the Transactions could result in NioCorp becoming subject to materially adverse U.S. federal income tax consequences as a result of the application of Section 7874 and related sections of the Code; cost increases for NioCorp's exploration and, if warranted, development projects; a disruption in, or failure of, NioCorp's information technology systems, including those related to cybersecurity; equipment and supply shortages; variations in the market demand for, and prices of, niobium, scandium, titanium and rare earth products; current and future offtake agreements, joint ventures, and partnerships; NioCorp's ability to attract qualified management; estimates of mineral resources and reserves; mineral exploration and production activities; feasibility study results; the results of metallurgical testing; the results of technological research; changes in demand for and price of commodities (such as fuel and electricity) and currencies; competition in the mining industry; changes or disruptions in the securities markets; legislative, political or economic developments, including changes in federal and/or state laws that may significantly affect the mining industry; the impacts of climate change, as well as actions taken or required by governments related to strengthening resilience in the face of potential impacts from climate change; the need to obtain permits and comply with laws and regulations and other regulatory requirements; the timing and reliability of sampling and assay data; the possibility that actual results of work may differ from projections/expectations or may not realize the perceived potential of NioCorp's projects; risks of accidents, equipment breakdowns, and labor disputes or other unanticipated difficulties or interruptions; the possibility of cost overruns or unanticipated expenses in development programs; operating or technical difficulties in connection with exploration, mining, or development activities; management of the water balance at the Elk Creek Project site; land reclamation requirements related to the Elk Creek Project; the speculative nature of mineral exploration and development, including the risks of diminishing quantities of grades of reserves and resources; claims on the title to NioCorp's properties; potential future litigation; and NioCorp's lack of insurance covering all of NioCorp's operations.</p><p class=\"\">Should one or more of these risks or uncertainties materialize or should any of the assumptions made by the management of NioCorp prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements.</p><p class=\"\">All subsequent written and oral forward-looking statements concerning the matters addressed herein and attributable to NioCorp or any person acting on its behalf are expressly qualified in their entirety by the cautionary statements contained or referred to herein. Except to the extent required by applicable law or regulation, NioCorp undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date hereof to reflect the occurrence of unanticipated events.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> NioCorp Developments Ltd.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSfY9yYa:0/",
            "pub_date": "2025-02-05 00:32:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309056:0",
            "title": "ViaSat Facing Competitive Pressure From Starlink, Others in Key Verticals, Morgan Stanley Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ViaSat  shares are up about 8.5% year-to-date after the recent announcement of a sizeable government award, but competitive concerns related to Starlink and other companies are lingering, Morgan Stanley said Tuesday in a note to clients. </p><p class=\"\">Starlink's \"momentum in Aviation — a historical area of strength for [ViaSat] — continues to weigh on sentiment\" for ViaSat, the investment firm said. </p><p class=\"\">There's also \"limited near-term upside\" for ViaSat shares due to its \"own satellite capacity constraints and the potential for Aviation backlog churn risk as airlines appear to be warming to Starlink,\" the note said. </p><p class=\"\">The investment firm said it expects ViaSat's Aviation division to \"remain in focus\" ahead of the company's fiscal Q3 results, which are slated for after the close on Thursday. </p><p class=\"\">Morgan Stanley cut ViaSat's price target to $12 from $26, while keeping the company's rating at equalweight, saying that the \"competitive concerns [are] largely priced at current levels.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309056:0/",
            "pub_date": "2025-02-05 00:32:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008457:0",
            "title": "De La Rue Begins Formal Sale Process Following Additional Takeover Approaches",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Nina Kienle</p><p class=\"\">De La Rue started a formal sale process after receiving multiple takeover offers.</p><p class=\"\">The British software firm and bank note printer didn't provide further details on the new approaches, but said discussions with Pension SuperFund Capital and Disruptive Capital GP continue.</p><p class=\"\">On Jan. 9, the company received a preliminary conditional cash offer from the PSFC entities of 125 pence a share, valuing it at 245.125 million pounds ($305.2 million).</p><p class=\"\">The PSFC entities are now proposing a transaction structure including the issuance of a debt instrument and a share buyback, De La Rue said.</p><p class=\"\">There is no certainty as to any proposed transaction structure nor whether any such share buyback will be made, it added.</p><p class=\"\">As part of the formal sale process, the company invited interested parties to submit their interest by March 31.</p><p class=\"\">Write to Nina Kienle at nina.kienle@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008457:0/",
            "pub_date": "2025-02-05 00:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008458:0",
            "title": "Americans Kiss Job Hopping Goodbye — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">The U.S. job market is still solid. But more workers are staying put, because the chance to trade up to a better job is rarer.</p><p class=\"\">Americans quit 39.6 million jobs in 2024, down 11% from the year before and down 22% from a recent peak in 2022, according to Labor Department data published Tuesday. The share of employees who quit their jobs each month has fallen below the prepandemic level, and some economists expect more decreases ahead.</p><p class=\"\">It wasn't long ago that a revved-up U.S. labor market kicked off a frenzy of job switching. People jostled for better pay, better perks and more flexibility. Businesses obliged, since they were eager for workers as the economy reopened from the pandemic. The supercharged effect of the pandemic largely wore off this past summer, ending the hottest job market in a generation.</p><p class=\"\">Unemployment remains modest and the economy is still creating jobs. Layoffs are limited. The Labor Department will release its latest monthly jobs report on Friday, and economists expect another month of decent job growth and a steady unemployment rate at 4.1%.</p><p class=\"\">But there are now just 1.1 job openings per unemployed worker, down from a high of 2 in March 2022. For workers who do get laid off or who want a new role, the path to an offer is far more challenging.</p><p class=\"\">\"It's not immediately clear to me what's going to turn this around,\" said Neil Dutta, an economist at research firm Renaissance Macro.</p><p class=\"\">Hiring, along with quitting, has slowed, too. The share of workers hired into new jobs every month fell to an average of 3.5% in 2024, a decline from a recent peak of about 4.4% in 2021. Last year, Americans heard \"you're hired\" about 66 million times, down from 71 million in 2023. In the Conference Board's latest monthly survey released last week, far fewer people are now saying that jobs are plentiful compared with during the early 2020s. More complain they are hard to get.</p><p class=\"\">Workers in well-paid office jobs are encountering an especially challenging job market. Companies in tech, law and related industries hired fast a few years ago, and many now have less need for new employees. There are still plenty of jobs in hands-on industries such as healthcare and hospitality.</p><p class=\"\">\"The past 18 to 24 months have been just more of a steady malaise\" for top-level white-collar jobs, said Michael Distefano, chief executive of Korn Ferry's professional-search business. He said the office-job market has shown signs of picking up in 2025, but it will depend on whether Trump administration policies encourage business investment, and how the Federal Reserve sets monetary policy.</p><p class=\"\">The Fed's quest to tame inflation through high interest rates works in part by discouraging too much investment and hiring, because a hot job market can in turn lift wages and raise prices. The Fed paused further rate cuts last week with inflation still modestly above target, and traders are betting that the central bank might not bring rates lower again until June.</p><p class=\"\">As the race for talent has cooled, companies are more focused on controlling salary costs.</p><p class=\"\">Meta plans to cut 5% of its workforce this month. Its finance chief, Susan Li, told analysts last week that while the tech giant is still adding technical talent, it has eased off hiring business staff. RTX, the defense contractor formerly known as Raytheon, is investing in automation \"that will continue to drive productivity without the need to add head count,\" its CEO, Christopher Calio, said on the company's earnings call last week.</p><p class=\"\">What happens next depends on how well companies can keep a lid on costs without turning to layoffs — which have stayed at a low level after spiking early in the pandemic.</p><p class=\"\">\"This labor market has shown that it can keep cooling for a long time without things breaking,\" said Guy Berger, an economist at the Burning Glass Institute, an employment think tank. \"Forever? Probably not, but maybe there's more room for the labor market to cool in a mostly painless way.\"</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008458:0/",
            "pub_date": "2025-02-05 00:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463523:0",
            "title": "Eevia Health Sells Lead Eye-Health Compound Amid Funding Challenges",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eevia Health (EEVIA.ST) agreed to divest the intellectual property rights to its lead eye-health compound candidate, Retinari, to Havu Health for 800,000 euros. </p><p class=\"\">The Finland-based plant extracts supplier said Tuesday it decided to sell Retinari's rights to preserve the project's value after it failed to secure funding for the compound's safety study. Eevia noted that it will receive shares in Havu Health as part of the consideration. </p><p class=\"\">Retinari is an investigative compound indicated for the treatment of age-related macular degeneration.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463523:0/",
            "pub_date": "2025-02-05 00:34:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309058:0",
            "title": "National Bank Sees Margin Improvements Ahead For WSP Global",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">National Bank of Canada said it believes outperform-rated WSP Global , is likely to \"convert\" its EBITDA margin target of 20% to an exit one of 19% by 2027, ahead of the company's investor day, held to discuss its new three-year ambitions. </p><p class=\"\">The bank believes WSP, whose price target is $286, could be 3 to 4 times larger in the U.S. while continental Europe presents virtually a start-up territory in terms of size. Due to this, National Bank believes the growth algorithm will be \"highly influenced\" by M&amp;A opportunities which should become forthcoming given the company's premium valuation, ability to integrate, and very active private equity participants in the engineering consulting space before 2019, pointing to potential exits over the next 24 - 36 months. </p><p class=\"\">The bank expects M&amp;A activity in the global engineering consulting industry to pick up over the next few years despite the prospect of elevated financing costs. </p><p class=\"\">\"With 4 leading industry verticals in Infra, Building, Water/Environment, and Power, we believe the company's platform is highly diversified and much more robust relative to any point in its history and in the face of any dislocations (or opportunities) that could be presented,\" said National Bank analyst Maxim Sytchev in a note dated Feb. 3. </p><p class=\"\">National Bank believes these strategic buckets - EBITDA per employee growth, organic revenue CAGR likely in mid-to-high single-digit range, steadily improving margins, further improving FCF metrics, and building on strategic advisory expertise that creates a flywheel effect/pricing upside - \"should be\" or will be given emphasis at the Feb. 13 investor day. </p><p class=\"\">Shares of the company were last seen down $1.38 at $244.79 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309058:0/",
            "pub_date": "2025-02-05 00:34:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0MQ:0",
            "title": "Euro zone yields rise as markets weigh Trump's tariff plans",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Tariffs likely to be inflationary</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Central banks may have to cut rates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US central bank has more scope to sacrifice growth</li></ul></span></div><span><p class=\"\">    German bund yields rose on Tuesday, after falling for three days, as investors weighed the impact of U.S. President Donald Trump's paused tariffs on Canada and Mexico and levies on China took effect. </p><p class=\"\">In an instant response, China announced it was imposing tariffs on some U.S. imports. Trump on Monday suspended for a month threatened levies on Mexico and Canada just before they were due to kick in.</p><p class=\"\">Germany's 10-year bond yield (DE10YT=RR), the benchmark for the euro zone bloc, rose 1 basis point (bps) to 2.395%, after touching a one-month low of 2.359% on Monday. </p><p class=\"\">Yields move inversely to prices. </p><p class=\"\">Rabobank analysts said the market expected tariffs to have an inflationary impact on the euro zone in the short term, and a negative impact on growth, to which the European Central Bank would have to respond by cutting rates. </p><p class=\"\">\"The Federal Reserve can adopt a more cautious stance on the inflationary impact as it has more room to sacrifice growth without causing a recession (unlike the ECB),\" they added.</p><p class=\"\">The ECB cut borrowing costs for the fourth straight meeting last Thursday, a day after the Fed left rates unchanged.  </p><p class=\"\">Markets slightly pared bets on further ECB easing on Tuesday, after adding to bets on Monday, as investors digested the paused tariffs on Canada and Mexico. </p><p class=\"\">Traders were pricing around 85 basis points of further rate cuts for this year, compared to around 90 basis points of easing priced on Monday. </p><p class=\"\">Germany's two-year bond yield (DE2YT=RR), which is more sensitive to ECB rate expectations, was up 2 bps at 2.056%.</p><p class=\"\">Markets still readied for more volatility from tariff-related headlines, and braced for Trump to turn his attention to the European Union, which he has said he will target without specifying when.</p><p class=\"\">\"The modus operandi of the Trump administration has shifted somewhat, with the policy now being of imposing tariffs first and negotiating later,\" said Mohit Kumar, Chief European Economist at Jefferies. </p><p class=\"\">Italy's 10-year yield  was lower by 1 bps at 3.5%, and the gap between Italian and German yields (DE10IT10=RR) stood at 110 bps. </p><p class=\"\">The gap between French and German yields (DE10FR10=RR) - a gauge of the risk premium investors demand to hold French debt - narrowed to 72 bps.</p><p class=\"\">French Prime Minister Francois Bayrou forced the 2025 budget bill through parliament on Monday, betting that he has made enough concessions to his rivals to survive an inevitable no-confidence motion.</p><p class=\"\">French far-right leader Jordan Bardella said on Tuesday the worst thing for French people would be continued uncertainty over the budget, suggesting his party would not back no-confidence motions against the minority government.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0MQ:0-euro-zone-yields-rise-as-markets-weigh-trump-s-tariff-plans/",
            "pub_date": "2025-02-05 00:34:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008461:0",
            "title": "Copenhagen Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  OMX CPH 20 Index            2,026.90     -10.18      -0.50 <br/>  Index Components <br/>  Danske Bank                   212.10      +1.10      +0.52 <br/>  A.P. Moeller-Maersk A      10,600.00    +350.00      +3.41 <br/>  A.P. Moeller-Maersk B      10,905.00    +395.00      +3.76 <br/>  Carlsberg Series B            747.60      -3.40      -0.45 <br/>  GN Store Nord                 153.95     +11.95      +8.42 <br/>  NKT                           470.80      -2.00      -0.42 <br/>  Novo Nordisk Series B         592.60      -7.10      -1.18 <br/>  DSV                         1,424.00     +26.50      +1.90 <br/>  Jyske Bank                    516.50      +1.00      +0.19 <br/>  Coloplast Series B            798.80     -19.20      -2.35 <br/>  Rockwool Series B           2,496.00     +24.00      +0.97 <br/>  Demant                        282.20      +0.80      +0.28 <br/>  Vestas Wind Systems           101.05      +3.57      +3.66 <br/>  Genmab                      1,388.00      -5.50      -0.39 <br/>  Novonesis Series B            405.40      -2.30      -0.56 <br/>  Tryg                          144.90      -0.10      -0.07 <br/>  Pandora                     1,374.00      -6.00      -0.43 <br/>  Zealand Pharma                688.00     -19.50      -2.76 <br/>  ISS A/S                       137.20      -0.80      -0.58 <br/>  Oersted                       272.10      +1.30      +0.48 <br/>Prices in Kroner <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008461:0/",
            "pub_date": "2025-02-05 00:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0JV:0",
            "title": "Duperreault’s Mereo set for 1.4 ~$650mn launch with broad P&C and specialty appetite",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - The hotly anticipated launch of the rated carrier from industry veteran Brian Duperreault’s start-up Mereo has now been slated for 1.4, having secured ~$650mn in capital with the ambition of growing the pool to $1bn by the end of the year, The Insurer understands.</p><p class=\"\">This will mark Bermuda’s first meaningful reinsurance launch since Canopius Re was granted its Class 4 licence among a number of start-ups that began life during the pandemic. </p><p class=\"\">Mereo Insurance, the main balance sheet vehicle, was approved in December by the Bermuda Monetary Authority (BMA) as a Class 3B insurer. The vehicle is expected to secure an A- AM Best rating after receiving a preliminary A- financial strength assessment in February last year.</p><p class=\"\">It will underwrite across a broad spectrum of property, casualty and specialty classes and is looking to participate both on a proportional and non-proportional basis.</p><p class=\"\">The start-up's ILS fund – Mereo ILS Opportunities Limited – has also been approved by the BMA, with the Neil Strong-led vehicle understood to have already been active at 1 January after a successful initial fundraising.</p><p class=\"\">It has been a long journey for executive chairman Duperreault and his senior management team – led by London market stalwart David Croom-Johnson as CEO and CUO of Mereo Insurance – to get to the point of bringing a rated reinsurance start-up to the market.</p><p class=\"\">After a number of start-ups entered the market in 2020 and 2021, fundraising efforts for new balance sheet vehicles have proved challenging – despite some of the best reinsurance underwriting conditions in over a decade amid the hard market that came in at the start of 2023, at least in property cat.</p><p class=\"\">Instead, investors seeking underwriting risk have preferred the ILS market or to support existing balance sheets either through equity or by backing sidecar-style vehicles. </p><p class=\"\">As a result, even an industry heavyweight such as Duperreault – the former AIG, Marsh McLennan and Ace CEO – has faced a number of investor headwinds since the project's genesis in 2023.</p><p class=\"\">After initial suggestions of a 2024 launch, Mereo was most recently slated to begin underwriting at the start of 2025, but it was confirmed at the end of last year that it would not be taking part in 1 January reinsurance renewals via its rated balance sheet. </p><p class=\"\">Although it had received a preliminary A- financial strength assessment from AM Best in February last year, it was understood that while Mereoʼs capital was in place for 1.1, the final timing of rating approvals was too late to participate in January renewals.</p><p class=\"\">Mereo has reportedly secured support from private equity firm Susquehanna as a major investor. It has been reported there are six key investors made up of a mix of private equity and trade capital. </p><p class=\"\">However, determined not to miss out on the underwriting opportunity, it has been underwriting collateralised deals through its ILS fund, successfully deploying up to $250mn in capacity with “competitive” terms, according to sources.</p><p class=\"\">Mereo has been contacted for comment.</p><p class=\"\">Broad appetite</p><p class=\"\">According to its website, Mereo will have an appetite in its property book to support regional, nationwide and global carriers, with a focus on cat excess of loss business.</p><p class=\"\">It is expected to build a book that is 70 percent US and 30 percent international with a mix of wind, earthquake, wildfire, severe convective storm and flood exposures. </p><p class=\"\">Outside the US, targeted regions will include Europe, Canada, the Caribbean, Japan, Australia and New Zealand.</p><p class=\"\">In addition to cat, Mereo will look to write classes of property business including political violence, terror, nuclear, industry loss warranties and parametrics.</p><p class=\"\">Its specialty book is expected to cover a “broad” mix of classes including marine, energy, aviation, space, political risks, accident and health, crop and contingency, writing on a proportional and non-proportional basis, with a “modest” appetite for retro.</p><p class=\"\">Target clients are set to include global insurers, P&amp;C-focused carriers, Lloyd’s syndicates and MGAs.</p><p class=\"\">Meanwhile, in casualty, Mereo will look to write a “broad” mix of general and excess liability, professional indemnity, E&amp;O, D&amp;O and cyber, across target industries including marine, energy, transportation, financial lines, mid-market general liability and cyber.</p><p class=\"\">It will aim to access business through quota shares of “proven carriers with impressive track records”, according to its website.</p><p class=\"\">Seasoned management team</p><p class=\"\">In addition to former Aegis London CEO Croom-Johnson, members of the leadership team include ex-Hamilton CFO Jonathan Reiss, who holds the same role at Mereo Advisors and Mereo Insurance. JLT veteran Derek Walsh is chief legal counsel and COO of both entities, while former Fidelis executive Richard Holden serves as deputy CUO of Mereo Insurance and CUO of Mereo ILS.</p><p class=\"\">According to the start-up’s website, Lawrence Minicone is CEO of Mereo Advisors and CIO of Mereo Insurance, and Federico Waisman is chief analytics and risk officer for Mereo Insurance.</p><p class=\"\">Former IQUW, Securis and Execution Noble executive Strong is president of Mereo Advisors and Mereo Insurance and CEO of Mereo ILS.</p><p class=\"\">Duperreault is chairman of Mereo Advisors and Mereo Insurance. </p><p class=\"\">A 1 April launch for Mereo Insurance will put it in the mix during a renewal season that is heavily dominated by Australasia, including the key Japanese renewal, but which also includes a meaningful number of US deals.</p><p class=\"\">The next major renewal date is the US wind-heavy 1 June and 1 July renewals, led by Florida and the Southeast.</p><p class=\"\">The belated arrival of Mereo’s balance sheet vehicle will not represent the only reinsurance launch of note this year.</p><p class=\"\">In parallel, Oak Reinsurance – led by former RenaissanceRe European CUO Cathal Carr – is gearing up to make its mark. </p><p class=\"\">Based in London and underwriting through Lloyd's Syndicate 2843, Oak Re received approval to begin underwriting from 1 January 2025. With projected gross written premiums of $300mn for its inaugural year, Oak Re is backed by prominent capital providers, including Bain Capital and Hampden Agencies.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0JV:0-duperreault-s-mereo-set-for-1-4-650mn-launch-with-broad-p-c-and-specialty-appetite/",
            "pub_date": "2025-02-05 00:29:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008437:0",
            "title": "U.S. Gold Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">    New York (Dow Jones)--Engelhard Corp's base price for industrial <br/>gold bullion was $2,838.00 per troy ounce, up $26.00 from previous. <br/>    Handy &amp; Harman's base price for gold was $2,843.55 per troy ounce, <br/>up $17.45. The fabricated form price was $3,156.34, up $19.37. <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008437:0/",
            "pub_date": "2025-02-05 00:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008446:0",
            "title": "PayPal Says More Customers Are Buying Now, Paying Later — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008446:0/",
            "pub_date": "2025-02-05 00:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008448:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1050 ET - Generative artificial intelligence is here to stay, and set to have a profound impact on the mergers and acquisitions market, Bain &amp; Company says in a report. \"We expect that companies that master the use of generative AI in M&amp;A over the next five years will identify targets faster than their competitors,\" the management-consulting firm says. About one in five surveyed companies currently uses generative AI in M&amp;A processes, and more than half expect to integrate it into their dealmaking by 2027, according to the report. Late followers to adopt AI will be outbid for good deals and find themselves staying too long in the process for bad deals, Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1044 ET - Publicis' guidance for 2025 and the company's track record of being conservative in its initial outlook leave room for upgrades, CFRA's Danny Yeo Sze Wai says in a research note. The French advertising group ended the year with strong momentum in the fourth quarter, when organic net revenue growth of 6.3% beat expectations. \"[Publicis] is targeting 4%-5% of organic growth in net revenue for 2025, similar to its guidance for 2024. However, we still anticipate upside potential given its history of being conservative in terms of providing future projections,\" the analyst says. Shares in Publicis rise 1.6%. (adria.calatayud@wsj.com)</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p><p class=\"\">1038 ET - Intesa Sanpaolo's operating profit exceeded consensus and JPMorgan's estimates driven by higher revenue and lower provisions, JPM analysts say in a note. The Italian lender issued a higher-than-expected buyback of 2 billion euros and raised its 2025 net income target to well above 9 billion euros on the back of expected revenue growth and declining costs, the analysts say. \"Overall, fee trends are encouraging and the slight step-up in buyback amounts welcome,\" they say. Shares are up 1.6% at 4.24 euros.(helena.smolak@wsj.com)</p><p class=\"\">1037 ET - Canada's two railroads, Canadian Pacific Kansas City and Canadian National Railway, would be exposed in the event of a 25% tariff situation with the U.S., but RBC analysts think CPKC would be the most affected. CPKC has 41% of its revenue tied to cross-border trade, according to RBC. Sustained tariffs, the analysts say, over a longer period of time could derail its growth plans. \"Moreover, we see many of the company's Investor Day growth targets as dependent on cross-border trade and therefore flag risk to long-term consensus EPS growth estimates should tariffs at current levels be sustained,\" the analysts say. (adriano.marchese@wsj.com)</p><p class=\"\">1036 ET - After three years of underwhelming mergers and acquisition activity, 2025 may finally be the year that the market regains footing, Bain &amp; Company says in a report. While some companies continued M&amp;A during this time--navigating unfavorable market realities to deliver inorganic growth--many didn't have this option, the report says. Foundational shifts in technology, sector profit pools, and the broader global economy demanded a strategic response, the management-consulting firm says. \"We expect that the two biggest inhibitors to deals in 2024--namely, interest rates and regulatory challenges--will ease in 2025,\" it adds. (nina.kienle@wsj.com)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1018 ET - Bombardier bounces back as investors breathe a sigh of relief for the month-long pause on tariffs on Canadian imports. Bombardier's business is particularly vulnerable to US tariffs considering many of its business jets are sold to US customers. The company's shares gyrated in the run-up to Trump's tariffs, falling nearly 12% on Monday before recovering throughout the day after the tariff pause was announced. Bombardier is 4.3% higher at C$86.34. (adriano.marchese@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008448:0/",
            "pub_date": "2025-02-05 00:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008430:0",
            "title": "Evaxion Biotech Is Maintained at Buy by Lake Street",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:30 GMT) </strong>Evaxion Biotech Price Target Cut to $6.00/Share From $35.00 by Lake Street</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008430:0/",
            "pub_date": "2025-02-05 00:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1960230e5d086:0",
            "title": "Old Republic International Corp Officer Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Lange Jeffrey</td></tr><tr><td>Relationship</td><td>SVPUnderwriting &amp; Distribution</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$40,142</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1990259/000007426025000035/xslF345X05/wk-form4_1738686370.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Jeffrey Lange, SVPUnderwriting &amp; Distribution at Old Republic International Corp, sold 1,098 shares of Common Stock on January 31, 2025, at a price of $36.56 per share, totaling $40,142. Following the transaction, Lange directly owns 34,679 shares and indirectly owns 3,435 shares through the ORI 401(k). The direct ownership includes 20,015 unvested RSAs.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1990259/000007426025000035/xslF345X05/wk-form4_1738686370.xml\" rel=\"nofollow\" target=\"_blank\">OLD REPUBLIC INTERNATIONAL CORP [ ORI ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:1960230e5d086:0-old-republic-international-corp-officer-sells-shares/",
            "pub_date": "2025-02-05 00:30:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrKNvm2:0",
            "title": "FISKARS CORPORATION: ACQUISITION OF OWN SHARES 04.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Fiskars Corporation<p class=\"\"></p><p class=\"\">Fiskars Corporation</p><p class=\"\">Stock Exchange Release</p><p class=\"\">04.02.2025 at 18:30 EET/EEST</p><p class=\"\">FISKARS CORPORATION: ACQUISITION OF OWN SHARES 04.02.2025</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Date</p></td><td><p class=\"\">04.02.2025</p></td><td></td></tr><tr><td><p class=\"\">Exchange transaction</p></td><td><p class=\"\">Buy</p></td><td></td></tr><tr><td><p class=\"\">Share class</p></td><td><p class=\"\">FSKRS</p></td><td></td></tr><tr><td><p class=\"\">Amount </p></td><td><p class=\"\">1430</p></td><td></td></tr><tr><td><p class=\"\">Average price/share</p></td><td><p class=\"\">14.8366</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Highest price/share</p></td><td><p class=\"\">14.8600</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Lowest price/share</p></td><td><p class=\"\">14.8000</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Total price</p></td><td><p class=\"\">21,216.34</p></td><td><p class=\"\">EUR</p></td></tr></tbody></table></div><p class=\"\">The share buybacks are executed in compliance with Regulation No. 596/2014 of the European Parliament and Council (MAR) Article 5 and the Commission Delegated Regulation (EU) 2016/1052.</p><p class=\"\">The shares held by Fiskars Corporation on 04.02.2025:</p><p class=\"\"></p><p class=\"\">FSKRS  185,210</p><p class=\"\">On behalf of Fiskars Corporation</p><p class=\"\">Skandinaviska Enskilda Banken AB (Publ)</p><p class=\"\">Antti Salakka    Jaakko Kosunen</p><p class=\"\">For more information, please contact:</p><p class=\"\">Media and investor contacts</p><p class=\"\">Fiskars Corporation</p><p class=\"\">Tel. +358 50 458 4014</p><p class=\"\">communications@fiskars.com </p><p class=\"\">www.fiskarsgroup.com</p><p class=\"\">https://news.cision.com/fiskars-corporation/r/fiskars-corporation--acquisition-of-own-shares-04-02-2025%2Cc4100495</p><p class=\"\">FSKRS SBB 04022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrKNvm2:0-fiskars-corporation-acquisition-of-own-shares-04-02-2025/",
            "pub_date": "2025-02-05 00:30:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrHNtRg:0",
            "title": "Alma Media Corporation: Share repurchase 4.2.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Alma Media<div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Alma Media Corporation </td><td>ANNOUNCEMENT </td><td>4.2.2025</td></tr><tr><td colspan=\"3\">Alma Media Corporation: Share repurchase 4.2.2025</td></tr><tr><td>In the Helsinki Stock Exchange</td><td></td><td></td></tr><tr><td>Trade date          </td><td>4.2.2025</td><td></td></tr><tr><td>Bourse trade        </td><td>Buy</td><td></td></tr><tr><td>Share                 </td><td>ALMA</td><td></td></tr><tr><td>Amount            </td><td>874</td><td>Shares</td></tr><tr><td>Average price/ share   </td><td>11,8000</td><td>EUR</td></tr><tr><td>Total cost           </td><td>10 313,20</td><td>EUR</td></tr><tr><td colspan=\"3\">Alma Media Corporation now holds a total of 251 944 shares</td></tr><tr><td colspan=\"2\">including the shares repurchased on 4.2.2025</td><td></td></tr><tr><td colspan=\"3\">The share buybacks are executed in compliance with Regulation </td></tr><tr><td colspan=\"3\">No. 596/2014 of the European Parliament and Council (MAR) Article 5</td></tr><tr><td colspan=\"3\">and the Commission Delegated Regulation (EU) 2016/1052.</td></tr><tr><td colspan=\"2\">On behalf of Alma Media Corporation</td><td></td></tr><tr><td>Nordea Bank Oyj</td><td></td><td></td></tr><tr><td>Janne Sarvikivi          </td><td>Sami Huttunen</td><td></td></tr><tr><td colspan=\"2\">For more information, please contact:</td><td></td></tr><tr><td colspan=\"3\">Mikko Korttila, General Counsel, Alma Media Corporation</td></tr><tr><td>tel. +358 50 593 4589</td><td></td><td></td></tr><tr><td>www.almamedia.fi</td><td></td><td></td></tr></tbody></table></div><p class=\"\">http://publish.ne.cision.com//Release/ViewReleaseHtml/550A515C10529EE1E0C856B0705FC7D6</p><p class=\"\">Release</p><p class=\"\">Alma Media 4 2 trades</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrHNtRg:0-alma-media-corporation-share-repurchase-4-2-2025/",
            "pub_date": "2025-02-05 00:30:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrjRZrH:0",
            "title": "ALEXANDRIA GROUP OYJ: ACQUISITION OF OWN SHARES 04.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Alexandria Group Oyj<ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ALEXANDRIA GROUP OYJ</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">NOTIFICATION</p></li></ul><p class=\"\">04.02.2025 at 18:30 EET</p><p class=\"\">ALEXANDRIA GROUP OYJ: ACQUISITION OF OWN SHARES 04.02.2025</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Date</p></td><td><p class=\"\">04.02.2025</p></td><td></td></tr><tr><td><p class=\"\">Exchange transaction</p></td><td><p class=\"\">Buy</p></td><td></td></tr><tr><td><p class=\"\">Share class</p></td><td><p class=\"\">ALEX</p></td><td></td></tr><tr><td><p class=\"\">Amount</p></td><td><p class=\"\">250</p></td><td></td></tr><tr><td><p class=\"\">Average price/share</p></td><td><p class=\"\">9.2978</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Highest price/share</p></td><td><p class=\"\">9.3000</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Lowest price/share</p></td><td><p class=\"\">9.2500</p></td><td><p class=\"\">EUR</p></td></tr><tr><td><p class=\"\">Total price</p></td><td><p class=\"\">2,324.45</p></td><td><p class=\"\">EUR</p></td></tr></tbody></table></div><p class=\"\">The shares held by Alexandria Group Oyj on 04.02.2025:</p><p class=\"\"></p><p class=\"\">ALEX 50,462</p><p class=\"\">On behalf of Alexandria Group Oyj</p><p class=\"\">Skandinaviska Enskilda Banken AB (publ) Helsinki branch</p><p class=\"\">Antti Salakka Jaakko Kosunen</p><p class=\"\">For more information, please contact:</p><p class=\"\">Jan Åkesson</p><p class=\"\">CEO</p><p class=\"\">jan.akesson@alexandria.fi</p><p class=\"\">+358 40 731 2325</p><p class=\"\">https://news.cision.com/alexandria-group-oyj/r/alexandria-group-oyj--acquisition-of-own-shares-04-02-2025%2Cc4100481</p><p class=\"\">ALEX SBB 04022025</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrjRZrH:0-alexandria-group-oyj-acquisition-of-own-shares-04-02-2025/",
            "pub_date": "2025-02-05 00:30:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309054:0",
            "title": "Market Chatter: BP to Invest Up to $25 Billion in Kirkuk Oil, Gas Fields",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BP  is poised to spend up to $25 billion over the lifetime of a project to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday, citing a senior Iraqi oil official. </p><p class=\"\">BP did not immediately reply to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309054:0/",
            "pub_date": "2025-02-05 00:30:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC6MZfJ8:0",
            "title": "Hearts of Light Counseling & Consulting Releases New Book on Divorce Recovery by Therapist Angel Shaw",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mental Health Therapist Offers a Transformative Approach to Divorce Recovery in New Book</p><p class=\"\">Dallas, Texas--(Newsfile Corp. - February 4, 2025) - Hearts of Light Counseling &amp; Consulting announces the release of <em>From Heartbreak to Hope: A Journey Beyond Divorce</em>, a new book by licensed mental health therapist and founder Angel Shaw, M.Ed., LPC-S, NCC. Drawing from both professional expertise and personal experience, Shaw provides a comprehensive guide to emotional, financial, and personal healing after divorce. This transformative resource offers readers practical strategies for resilience, self-discovery, and renewed purpose.</p><p class=\"\">Angel Shaw, dressed in a polished pink suit, confidently addresses an audience while holding her book, From Heartbreak to Hope.</p><p class=\"\">Drawing from her <strong class=\"root-Tkn6WL2y\">professional expertise and personal journey</strong>, Shaw offers a <!-- -->practical guide to resilience, rediscovery, and renewal for those navigating the aftermath of divorce.</p><p class=\"\">\"As a therapist, I've helped many clients through difficult transitions, but when my own marriage ended, I had to apply those same strategies to myself,\" Shaw shares. <!-- -->\"This book is my way of guiding others through the process of healing, offering tools to rebuild confidence, purpose, and a fulfilling life beyond heartbreak.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Roadmap to Emotional and Financial Recovery</strong></p><p class=\"\"><em>From Heartbreak to Hope</em> provides:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Emotional coping strategies</strong> to manage grief, anxiety, and self-doubt<strong class=\"root-Tkn6WL2y\">Practical financial insights</strong> to regain stability after divorce</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Guided reflection exercises</strong> for personal growth and renewed confidence</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Faith-based perspectives</strong> on overcoming stigma and embracing new beginnings</p><p class=\"\">Beyond the book, Shaw collaborates with <!-- -->legal professionals, faith-based organizations, and community leaders to promote <!-- -->open conversations about co-parenting, emotional well-being, and financial independence post-divorce.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Free Webinar: Purpose After Pain</strong></p><p class=\"\">Shaw is hosting <strong class=\"root-Tkn6WL2y\">Purpose After Pain</strong>, a <!-- -->FREE webinar on February 18th at 7 PM CST to further support individuals navigating divorce. The webinar will offer expert insights on post-divorce transformation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Register here:</strong> https://www.eventbrite.com/e/purpose-after-pain-tickets-1117091102559</p><p class=\"\">For more information about <em>From Heartbreak to Hope: A Journey Beyond Divorce</em>, or to schedule an interview with Angel Shaw, please visit www.heartsoflightcc.com.</p><p class=\"\">Angel Shaw, M.Ed., LPC-S, NCC, smiles warmly while holding an open copy of From Heartbreak to Hope: A Journey Beyond Divorce.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Hearts of Light Counseling &amp; Consulting</strong></p><p class=\"\">Founded by Angel Shaw, M.Ed., LPC-S, NCC, Hearts of Light Counseling &amp; Consulting provides comprehensive mental health services to help individuals overcome life's challenges, rebuild their self-worth, and develop a renewed sense of purpose.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Press Inquiries</strong></p><p class=\"\">Hearts of Light Counseling &amp; Consulting</p><p class=\"\">https://www.heartsoflightcc.com/</p><p class=\"\">Angel Shaw </p><p class=\"\">info@heartsoflightcc.com</p><p class=\"\">(469) 640-0392</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239456</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC6MZfJ8:0-hearts-of-light-counseling-consulting-releases-new-book-on-divorce-recovery-by-therapist-angel-shaw/",
            "pub_date": "2025-02-05 00:30:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Ind8Z39k3:0",
            "title": "UNITED BANKERS PLC: ACQUISITION OF OWN SHARES 04.02.2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">United Bankers Plc</li><li class=\"listItem-bmN0_SHH\">NOTIFICATION</li></ul><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Date</td><td>04.02.2025</td><td></td></tr><tr><td>Exchange transaction</td><td>Buy</td><td></td></tr><tr><td>Share class</td><td>UNITED</td><td></td></tr><tr><td>Amount</td><td>167</td><td></td></tr><tr><td>Average price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Highest price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Lowest price/share</td><td>18.3000</td><td>EUR</td></tr><tr><td>Total price</td><td>3,056.10</td><td>EUR</td></tr></tbody></table></div><p class=\"\">UNITED 33,343</p><p class=\"\">04.02.2025 at 18:30</p><p class=\"\">UNITED BANKERS PLC: ACQUISITION OF OWN SHARES 04.02.2025</p><p class=\"\">The shares held by United Bankers Plc on 04.02.2025</p><p class=\"\">On behalf of United Bankers Plc</p><p class=\"\">Skandinaviska Enskilda Banken AB (Publ) Helsinki Branch</p><p class=\"\">Antti Salakka Janne Tiihonen</p><p class=\"\">For more information, please contact:John Ojanperä, CEO, United Bankers Plce-mail: Phone: 040 842 3472, 09 25 380 356</p><p class=\"\">john.ojanpera@unitedbankers.fi www.unitedbankers.fi</p><strong class=\"root-Tkn6WL2y\">Attachments</strong>UB SBB 04022025.xlsx</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Ind8Z39k3:0-united-bankers-plc-acquisition-of-own-shares-04-02-2025/",
            "pub_date": "2025-02-05 00:30:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9CwWSV:0",
            "title": "FirstService Declares 10% Increase to Quarterly Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TORONTO, Feb.  04, 2025  (GLOBE NEWSWIRE) — FirstService Corporation (TSX: FSV; NASDAQ: FSV) (\"<strong class=\"root-Tkn6WL2y\">FirstService</strong>\") announced today that its Board of Directors has approved a 10% increase in the quarterly cash dividend on the outstanding Common Shares of the Company and declared a quarterly dividend of US$0.275 per Common Share, up from the previous US$0.25 per Common Share. The dividend is payable on April 7, 2025 to holders of Common Shares of record at the close of business on March 31, 2025.</p><p class=\"\">The Company’s dividend will be US$1.10 on an annualized basis, up from US$1.00 during the past year. This distribution represents our tenth consecutive year of at least 10% annual dividend growth, reflecting the long-term track record of strong earnings and free cash flow growth at FirstService. Our business model, conservative balance sheet and financial flexibility allow us to prioritize our growth initiatives while also supporting the approval of the increased dividend to deliver incremental returns to our shareholders.</p><p class=\"\">The dividend on Common Shares is an \"eligible dividend\" for Canadian income tax purposes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About FirstService Corporation</strong></p><p class=\"\">FirstService Corporation is a North American leader in the property services sector, serving its customers through two industry-leading service platforms: FirstService Residential – North America's largest manager of residential communities; and FirstService Brands – one of North America's largest providers of essential property services delivered through individually branded company-owned operations and franchise systems.</p><p class=\"\">FirstService generates more than US$4.9 billion in annual revenues and has approximately 30,000 employees across North America. With significant insider ownership and an experienced management team, FirstService has a long-term track record of creating value and superior returns for shareholders. The Common Shares of FirstService trade on the NASDAQ and the Toronto Stock Exchange under the symbol \"FSV\", and are included in the S&amp;P/TSX 60 Index. More information is available at www.firstservice.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-looking Statements</strong></p><p class=\"\">This press release includes or may include forward-looking statements. Much of this information can be identified by words such as “expect to,” “expected,” “will,” “estimated” or similar expressions suggesting future outcomes or events. FirstService believes the expectations reflected in such forward-looking statements are reasonable but no assurance can be given that these expectations will prove to be correct and such forward-looking statements should not be unduly relied upon. These statements involve known and unknown risks, uncertainties and other factors which may cause the actual results to be materially different from any future results, performance or achievements contemplated in the forward-looking statements. Such factors include: (i) general economic and business conditions, which will, among other things, impact demand for FirstService’s services and the cost of providing services; (ii) the ability of FirstService to implement its business strategy, including FirstService’s ability to acquire suitable acquisition candidates on acceptable terms and successfully integrate newly acquired businesses with its existing businesses; (iii) changes in or the failure to comply with government regulations; and (iv) other factors which are described in FirstService’s annual information form for the year ended December 31, 2023 under the heading “Risk factors” (a copy of which may be obtained at www.sedarplus.ca) and Annual Report on Form 40-F filed with the United States Securities and Exchange Commission (a copy of which may be obtained at www.sec.gov), and subsequent filings (which factors are adopted herein). Forward-looking statements contained in this press release are made as of the date hereof and are subject to change. All forward-looking statements in this press release are qualified by these cautionary statements. Unless otherwise required by applicable securities laws, we do not intend, nor do we undertake any obligation, to update or revise any forward-looking statements contained in this press release to reflect subsequent information, events, results or circumstances or otherwise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">COMPANY CONTACTS:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">D. Scott Patterson</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chief Executive Officer</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(416) 960-9566</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jeremy Rakusin</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chief Financial Officer</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(416) 960-9566</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9CwWSV:0-firstservice-declares-10-increase-to-quarterly-cash-dividend/",
            "pub_date": "2025-02-05 00:30:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008391:0",
            "title": "Viper Energy Price Target Cut to $58.00/Share From $64.00 by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008391:0/",
            "pub_date": "2025-02-05 00:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309048:0",
            "title": "BP to Invest Up to $25 Billion in Kirkuk Oil, Gas Fields, Reuters Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309048:0/",
            "pub_date": "2025-02-05 00:22:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309046:0",
            "title": "Market Chatter: Novartis on Lookout for Next-Generation Obesity Drug Candidates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novartis  is on the hunt for next-generation obesity drug candidates, despite its main focus remaining on therapeutic areas where it has an established presence, The Wall Street Journal reported Tuesday, citing an interview with Chief Executive Vasant Narasimhan. </p><p class=\"\">\"The bar is very high, we need to find something that's truly differentiated, that brings something new,\" Narasimhan told the Journal. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309046:0/",
            "pub_date": "2025-02-05 00:22:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008392:0",
            "title": "Cummins Stock Rises. There Is More To The Engine Maker Than Trucks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Al Root</p><p class=\"\">Cummins stock jumped Tuesday after the diesel engine maker posted solid fourth-quarter results and an equally solid outlook for 2025 — all amid a declining market for heavy-duty trucks.</p><p class=\"\">It turns out, there is more to Cummins than trucks.</p><p class=\"\">Tuesday morning, Cummins reported per-share earnings, adjusted for several charges, of more than $12 for the fourth quarter. Wall Street was looking for closer to $5, but comparability is tough. Operating profit was about $920 million, a little better than analysts projected.</p><p class=\"\">Some of the charges were to reorganize Cummins' Accelera business unit, which focuses on zero-emissions technologies, including batteries and fuel cells.</p><p class=\"\">\"Cummins delivered strong operational results in the fourth quarter and achieved record full-year revenues, net income...and EPS [earnings per share], despite a decline in heavy-duty truck demand in North America,\" said CEO Jennifer Rumsey in a news release.</p><p class=\"\">Shares spiked 5.6% to $367.73 in early trading, while the S&amp;P 500 was up 0.1% and the Dow Jones Industrial Average was down 0.2%.</p><p class=\"\">The outlook is helping too. For 2025, Cummins expects sales to grow 2% to 3% and earnings before interest, taxes, depreciation, and amortization, or Ebitda, to be about $5.8 billion. That's about $100 million to $200 million more than current Street projections.</p><p class=\"\">Sales are predicted to rise, despite expected declines in truck-related sales. The company expects the North American heavy-duty truck market to decline about 5% in 2024. Medium-duty truck demand should fall closer to 10%.</p><p class=\"\">Cummins makes a lot of engines for trucks. But it also makes power generation units. Demand from data centers is helping boost sales growth.</p><p class=\"\">\"Strength in data center offsetting softness in core [truck] markets,\" wrote Jefferies analyst Stephen Volkmann in a Tuesday report.</p><p class=\"\">Power systems sales should be up 2% to 7% in 2025, according to the company, after growing 13% in 2024. Sales in Cummins' distribution business are expected to grow as well, helping offset truck weakness.</p><p class=\"\">Volkmann rates shares Buy and has a $435 price target. Citi analyst Kyle Menges rates shares Buy and has a $430 price target for the stock. shares.</p><p class=\"\">Mengese called the profit margin guidance \"encouraging\" in a Tuesday report.</p><p class=\"\">Those are two bulls. Overall, just 30% of analysts covering Cummins shares rate them Buy. The average Buy-rating ratio for stocks in the S&amp;P 500 is about 55%. The average analyst price target for Cummins shares is about $390.</p><p class=\"\">Most of Wall Street looks to be focused on the core truck market, but there is more to Cummins than trucks.</p><p class=\"\">Write to Al Root at allen.root@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008392:0/",
            "pub_date": "2025-02-05 00:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}