{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308982:0",
            "title": "UBS Adjusts Price Target on SBA Communications to $280 From $290, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SBA Communications  has an average rating of overweight and mean price target of $250.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308982:0/",
            "pub_date": "2025-02-04 23:28:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308984:0",
            "title": "UBS Adjusts Price Target on Booking Holdings to $5,560 From $5,550, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Booking Holdings  has an average rating of overweight and mean price target of $5,378.74, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308984:0/",
            "pub_date": "2025-02-04 23:28:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308985:0",
            "title": "UBS Adjusts Price Target on Baker Hughes to $47 From $44, Keeps Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Baker Hughes Company  has an average rating of overweight and mean price target of $51.65, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308985:0/",
            "pub_date": "2025-02-04 23:28:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308981:0",
            "title": "Update - National Bank Commentary On B2Gold As Antelope Deposit PEA De-risks, Extends Otjikoto Mine Life",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Adds National Bank commentary in the eight paragraph)</p><p class=\"\">B2Gold  was edging lower Tuesday after it released a \"positive\" preliminary economic assessment of the Antelope deposit at the Otjikoto gold mine in Namibia. </p><p class=\"\">The underground gold mine has an initial life of mine of about 5 years, with average grade processed of 5.75 grams per tonne (g/t) gold over the life of mine. </p><p class=\"\">Life of mine gold production is about 327,000 ounces with an average gold recovery of 95%. Average annual gold production is estimated at about 65,000 ounces per year over the life of mine. </p><p class=\"\">Projected all-in sustaining costs are about US$1,095 per gold ounce over the life of mine. </p><p class=\"\">After-tax net present value at a discount rate of 5% is US$131 million, generating an after-tax internal rate of return of 35%. </p><p class=\"\">The company has budgeted $7 million for exploration at Otjikoto in 2025 to focus on expanding and refining the Antelope deposit, with 44,000 meters of drilling planned. </p><p class=\"\">Based on the PEA results, the company believes the Antelope deposit has the potential to become a small-scale, low-cost, underground gold mine that can supplement the low-grade stockpile production from 2028 to 2032. </p><p class=\"\">B2Gold kept its Outperform rating and C$6.25 price target at National Bank of Canada following the update. </p><p class=\"\">The price target was based on 4.5x EV/EBITDA NTM. </p><p class=\"\">National Bank expects sentiment for B2Gold to be constructive as it approaches finishing the Goose project early this year. </p><p class=\"\">\"Our thesis considers BTO's next leg of growth on the order of 600,000 oz/year via regional Goose ramp-up, regional production of Fekola, potential development of Gramalote, NAV-accretive exploration opportunities, strong balance sheet and peer-leading dividend yield, tempered by de-risking Goose in the development home stretch,\" the bank said. </p><p class=\"\">\"We expect sentiment to be constructive as it approaches finishing Goose early this year.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308981:0/",
            "pub_date": "2025-02-04 23:29:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309003:0",
            "title": "Asian Equities Traded in the US as American Depositary Receipts Rise Sharply in Tuesday Trading",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asian equities traded in the US as American depositary receipts were sharply higher Tuesday morning, rising 1.69% to 2,157.80 on the S&amp;P Asia 50 ADR Index. </p><p class=\"\">From North Asia, the gainers were led by semiconductor company Himax Technologies  and consumer lending company Eason Technology , which climbed 14% and 11% respectively. They were followed by mobile big data platform Aurora Mobile  and video-sharing platform Bilibili , which advanced 8.3% and 6.4% respectively. </p><p class=\"\">The decliners from North Asia were led by education company 17 Education &amp; Technology Group  and automotive ecommerce platform TuanChe , which fell 7.3% and 3% respectively. They were followed by computer hardware maker Canaan  and education company Four Seasons Education , which dropped 2.5% and 2.4% respectively. </p><p class=\"\">From South Asia, the gainers were led by IT company Sify Technologies  and financial services company HDFC Bank , which rose 3.5% and 2.3% respectively. They were followed by telecommunications operator Telekomunikasi Indonesia  and pharmaceutical company Dr. Reddy's Laboratories , which were up 2% and 1.7% respectively. </p><p class=\"\">The lone decliner from South Asia was telecommunications operator PLDT , which was off 0.1%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309003:0-asian-equities-traded-in-the-us-as-american-depositary-receipts-rise-sharply-in-tuesday-trading/",
            "pub_date": "2025-02-04 23:29:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446585:0",
            "title": "US Economic Optimism Index Below Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The RealClearMarkets/TIPP Economic Optimism Index in the US increased slightly to 52 in February 2025, below market expectations of 53.</p><p class=\"\">Confidence in Federal Economic Policies, a proprietary RCM/TIPP measure of views on the effectiveness of government economic policies, improved from 43.4 in January to 48.8 this month, reflecting a 12.4% gain.</p><p class=\"\">This component has been below 50.0 in the pessimistic territory for 42 consecutive months since September 2021.</p><p class=\"\">The Six-Month Economic Outlook, which measures how consumers perceive the economy's prospects in the next six months, declined by 1.9%, from 52.1 in January to 51.1 in February.</p><p class=\"\">The Personal Financial Outlook, a measure of how Americans feel about their own finances in the next six months, dropped by 6.8% from its previous reading of 60.1 in January to 56.0 this month.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446585:0-us-economic-optimism-index-below-expectations/",
            "pub_date": "2025-02-04 23:29:46",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007874_20250204007955:0",
            "title": "The Toro Co: HammerHead Trenchless Acquires ProKASRO Services USA >TCC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007874_20250204007955:0/",
            "pub_date": "2025-02-04 23:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX2QgBBn:0",
            "title": "TRC Companies Surpasses $2 Billion in Funding for Client Projects Supporting Clean Commercial Transportation and Clean Energy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Windsor, Conn., Feb.  04, 2025  (GLOBE NEWSWIRE) — TRC Companies (TRC), a global professional services firm providing integrated strategy, consulting, engineering and applied technologies in support of the energy transition, announced today that it has surpassed $2 billion in funding secured for clients deploying clean commercial transportation and renewable energy projects across North America. On behalf of its clients, TRC has developed and submitted more than 650 successful grant applications and funding requests, creating new pathways for clients to achieve economic and environmental goals.</p><p class=\"\">Building on TRC’s long track record of submitting and managing grants for clients, the company continues to achieve a 90% success rate in its grant applications, a testament to the exceptional industry knowledge and grant writing expertise on TRC’s team. TRC specializes in helping clients secure local, state and federal funding for projects across the United States and Canada involving low- and zero-emission transportation technologies, renewable energy, energy storage and diverse clean energy solutions, including those serving utility client projects.</p><p class=\"\">Noteworthy projects that received funding through TRC’s support include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Over $40 million for the JETSI Project, which deployed 100 zero-emission Class 8 trucks across Southern California to operationalize zero-emission freight movement at scale.</li><li class=\"listItem-bmN0_SHH\">$44 million for Volvo LIGHTS, an initiative that implemented a blueprint for the complete ecosystem needed to successfully deploy commercial battery-electric trucks.</li><li class=\"listItem-bmN0_SHH\">$95 million for the Nevada Gold Mines 200 MW Solar Project, accelerating the decarbonization of mining operations in Northern Nevada.</li><li class=\"listItem-bmN0_SHH\">$15.4 million for the Frito-Lay Zero and Near Zero Emission Freight Facility (ZANZEFF) Project in Modesto, CA, to deploy an array of commercially available and pre-commercial ZE and NZE technologies as well as renewable power generation and energy storage.</li><li class=\"listItem-bmN0_SHH\">$5 million for Mariposa County Resource Conservation District to develop, demonstrate and deploy environmentally and economically sustainable biomass-to-energy systems for the forest and food waste sectors.</li><li class=\"listItem-bmN0_SHH\">$6.5 million for Foster Farms for projects to modify parking yards with EV charging parking stalls and implement emissions-reducing mechanical upgrades at five Foster Farms plants.</li><li class=\"listItem-bmN0_SHH\">$4.4 million for Otter Tail Power Company to enhance grid resiliency with next-generation technology.</li><li class=\"listItem-bmN0_SHH\">And leadership among several marquis funding programs, including EPA’s Targeted AirShed Grant Program, DOE’s SuperTruck Program, DOE’s Hydrogen Hubs Program, the DOT’s Charging and Fueling Infrastructure (CFI) Grant Program, and FHWA’s National Electric Vehicle Initiative (NEVI) Formula Program.</li></ul><p class=\"\">“We feel privileged to assist forward-thinking companies to achieve their goals to develop and demonstrate the commercial use of some of the most cutting-edge and advanced technologies in the marketplace today,” said Erik Neandross, President, Clean Transportation Solutions at TRC. “Managing multi-million-dollar grant applications can be daunting, but our team’s tenacity and knowledge ensures that our clients will successfully achieve their objectives while they remain focused on their core business activities.”</p><p class=\"\">TRC holds a distinct advantage in securing funding for clients, thanks to a team that combines master grant writers with seasoned project developers who bring deep expertise and forward thinking across a wide range of clean energy initiatives. From concept to completion, TRC’s team crafts highly competitive grant applications that emphasize community impact. Additionally, TRC’s extensive experience monitoring over 800 grant programs gives TRC awareness of the criteria agencies use to evaluate those applications, so that TRC can work with clients to enhance project elements for greater likelihood of winning grant funding.</p><p class=\"\">By working with TRC, clients are able to tap funding from sources such as Volkswagen Settlement Funds, Federal Highway Administration, DOE, South Coast Air Quality Management District (AQMD), California Air Resources Board (CARB), California Energy Commission (CEC), Low Carbon Fuel Standard (LCFS) programs, and many others.</p><p class=\"\">For more information about TRC’s industry leading incentives services and the Funding 360 program, please visit https://www.trccompanies.com/services/clean-transportation-consulting/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About TRC Companies </strong></p><p class=\"\">TRC stands for adaptability. With direction setting perspectives and partnerships, our 8,000+ tested practitioners in advisory, consulting, construction, engineering and management services deliver unique resolutions that answer any built or natural imperative. By creating new pathways for the world to thrive, we help our clients adapt to change and achieve long-lasting results while solving the challenges of making the Earth a better place to live — community by community and project by project. TRC is ranked #16 on ENR’s list of the Top 500 Design Firms, #5 for Power and #3 for Transmission &amp; Distribution.​</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">TRC Companies Grant Funding Photo      </li></ul><p class=\"\">Anne Bonelli</p><p class=\"\">TRC Companies</p><p class=\"\">303-881-8496</p><p class=\"\">abonelli@trccompanies.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX2QgBBn:0-trc-companies-surpasses-2-billion-in-funding-for-client-projects-supporting-clean-commercial-transportation-and-clean-energy/",
            "pub_date": "2025-02-04 23:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204003540:0",
            "title": "People have cut back on salty snacks, and PepsiCo misses on revenue again",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tomi Kilgore</p><p class=\"\">Profit extends long-streak of beats and dividend raised 5%, while Frito-Lay and Quaker Foods see some revenue weakness</p><p class=\"\">Shares of PepsiCo Inc. were taking a hit in early trading Tuesday, after the beverage and snack giant reported a slight decline in quarterly revenue amid weakness in its North America Frito-Lay and Quaker Foods businesses.</p><p class=\"\">Meanwhile, profit rose and extended its long streak of beats and the company boosted its dividend by 5%, lifting the stock's yield to triple that of the S&amp;P 500.</p><p class=\"\">\"Our businesses remained resilient in 2024, despite subdued category performance trends in North America, the continued impacts related to a recall in our Quaker Foods North America division and business disruptions due to geopolitical tensions in certain international markets,\" said Chief Executive Ramon Laguarta.</p><p class=\"\">The stock (PEP) fell 2.7% in premarket trading.</p><p class=\"\">For the fourth quarter to Dec. 28, net revenue declined 0.2% from a year ago, to $27.78 billion from $27.85 billion, while the FactSet consensus was for slight growth to $27.89 billion. That marked the third straight quarter in which revenue missed forecasts.</p><p class=\"\">Revenue for Frito-Lay North America fell 2.1% to $7.32 billion and Quaker Foods North America revenue was also down 2.1% to $874 million, while PepsiCo Beverage North America revenue was little changed at $7.91 billion.</p><p class=\"\">Quaker Foods was still feeling the impact of the recall of its granola bars and granola cereals in December 2023 due to concerns over salmonella contamination.</p><p class=\"\">Net earnings rose to $1.52 billion, or $1.11 a share, from $1.30 billion, or 94 cents a share, in the same period a year ago.</p><p class=\"\">Excluding nonrecurring items, core earnings per share rose $1.96, beating the FactSet consensus of $1.94. That marked at least the 22nd-straight quarter of bottom-line beats, based on available FactSet data.</p><p class=\"\">For 2025, the company expects core EPS growth in the low-single-digit percentage range. The current FactSet consensus for 2025 EPS of $8.52 implies 4.4% growth.</p><p class=\"\">The raised its annual dividend to $5.69 a share from $5.42 a share, effective with the dividend expected to be paid in June.</p><p class=\"\">At Monday's stock closing price of $150.27, the new annual dividend rate implies a dividend yield of 3.79%, which compares with the yield for the Consumer Staples Select Sector SPDR ETF XLP of 2.74% and the implied yield for the S&amp;P 500 index SPX of 1.26%.</p><p class=\"\">PepsiCo's stock has dropped 9.7% over the past three months through Monday, while the S&amp;P 500 has gained 4.9%.</p><p class=\"\">-Tomi Kilgore</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204003540:0/",
            "pub_date": "2025-02-04 23:30:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007874:0",
            "title": "HammerHead Trenchless Acquires ProKASRO Services USA",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HammerHead Trenchless Acquires ProKASRO Services USA</p><p class=\"\">Acquisition expands product offering for the rehabilitation and replacement of lateral and mainline underground infrastructure</p><p class=\"\">LAKE MILLS, Wis.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">HammerHead Trenchless, a division of The Toro Company , today announced that it has acquired the assets of ProKASRO Services USA, the distributor of ProKASRO Mechatronik GmbH and market leader of robotic solutions and rehabilitation equipment for repairing underground water and wastewater infrastructure. The terms of the transaction were not disclosed.</p><p class=\"\">ProKASRO Services USA is known for its industry-leading robotics, UV pipe lining solutions and lateral rehabilitation technologies. Based in Centennial, Colorado, its expanded line of trenchless solutions enable utility contractors the ability to rehabilitate underground wastewater and water pipelines without the need for digging or disruption to outdoor environments.</p><p class=\"\">\"We are excited to announce the acquisition of ProKASRO Services USA,\" said Jeff Gabrielse, General Manager of HammerHead Trenchless. \"This acquisition aligns with our strategic growth initiatives and helps expand our business into new markets with the leading technologies and brand reputation of ProKASRO. With the addition to the HammerHead Trenchless portfolio, we believe we are best positioned to offer a full suite of trenchless pipe rehabilitation and replacement products for contractors from laterals to mainlines in both the CIPP and pipe bursting markets.\"</p><p class=\"\">Through this acquisition, HammerHead Trenchless will market these products under the ProKASRO USA brand name and serve the U.S. market with continued operations in Colorado. \"With service facilities now in both Wisconsin and Colorado, HammerHead is positioned geographically to maintain customer expectations for quality and further expand the HammerHead legacy of customer service, support and innovation,\" said Gabrielse.</p><p class=\"\">For more information on the full suite of HammerHead Trenchless products, visit www.hammerheadtrenchless.com</p><p class=\"\">About HammerHead Trenchless</p><p class=\"\">HammerHead Trenchless, a division of The Toro Company, manufactures and delivers a unique combination of rehabilitation, replacement and installation equipment and consumables for the underground construction market. Besides being a full solutions provider in rehabilitation and replacement, HammerHead also offers unmatched field support and project consultation to its customers worldwide. HammerHead products are proudly made in the U.S.A. and sold and serviced in more than 60 countries. For more information visit www.hammerheadtrenchless.com; 920-648-4848</p><p class=\"\">About The Toro Company</p><p class=\"\">The Toro Company  is a leading global provider of solutions for the outdoor environment including turf and landscape maintenance, snow and ice management, underground utility construction, rental and specialty construction, and irrigation and outdoor lighting solutions. With net sales of $4.6 billion in fiscal 2024, The Toro Company's global presence extends to more than 125 countries through a family of brands that includes Toro, Ditch Witch, Exmark, Spartan, BOSS, Ventrac, American Augers, Trencor, Subsite, HammerHead, Radius, Perrot, Hayter, Unique Lighting Systems, Irritrol, and Lawn-Boy. Through constant innovation and caring relationships built on trust and integrity, The Toro Company and its family of brands have built a legacy of excellence by helping customers work on golf courses, sports fields, construction sites, public green spaces, commercial and residential properties and agricultural operations. For more information, visit www.thetorocompany.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204488026/en/</p><p class=\"\">CONTACT:    Beth Steele</p><p class=\"\">Marketing Coordinator</p><p class=\"\">esteele@hhtrenchless.com</p><p class=\"\">920-650-9767</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007874:0/",
            "pub_date": "2025-02-04 23:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX83TzZ6:0",
            "title": "CORRECTION - ACNB Corporation Announces Completion of Traditions Bancorp, Inc. Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GETTYSBURG, Pa., Feb.  04, 2025  (GLOBE NEWSWIRE) — In a release issued under the same headline on February 3, 2025 by ACNB Corporation please note that in the third paragraph of the release, the deposit amount has been corrected to $2.54 billion instead of $2.04 billion. The corrected release follows:</p><p class=\"\">ACNB Corporation , the parent financial holding company of ACNB Bank, a Pennsylvania state-chartered, FDIC-insured community bank, headquartered in Gettysburg, PA, announced the completion of the acquisition of Traditions Bancorp, Inc. (“Traditions”) and its wholly-owned subsidiary, Traditions Bank, headquartered in York, PA, effective February 1, 2025. Traditions was merged with and into a wholly-owned subsidiary of ACNB Corporation immediately followed by the merger of Traditions Bank with and into ACNB Bank. ACNB Bank will operate the former Traditions Bank branches as “Traditions Bank, A Division of ACNB Bank”. In connection with the close of the acquisition, Traditions stockholders received 0.7300 shares of ACNB Corporation common stock for each share of Traditions common stock that they owned as of the closing date, with cash paid in lieu of fractional shares.</p><p class=\"\">In addition, at the close of the acquisition, three former Traditions directors, Eugene J. Draganosky, Elizabeth F. Carson, and John M. Polli, joined the Boards of Directors of ACNB Corporation and ACNB Bank. Mr. Draganosky has nearly 40 years of banking experience, and is the former CEO and Chair of the Board of Traditions and Traditions Bank, having held those roles since 2017 and 2023, respectively. Ms. Carson, Lead Independent Director of Traditions, joined the Traditions Bank Board in 2015, after over 30 years of banking experience in a variety of leadership roles with community and regional banks. Mr. Polli was a member of the Traditions Bank board of directors since its founding in 2002, and has nearly 40 years of diverse business expertise, from serving as a public accountant to owning, managing, and advising businesses in the transportation, real estate, and insurance industries.</p><p class=\"\">With the combination of the two organizations, and based on financial information for each organization as of December 31, 2024, ACNB Corporation will have approximately $3.26 billion in assets, $2.54 billion in deposits, and $2.36 billion in loans, and will serve its customers throughout 35 community banking offices in south central Pennsylvania and northern Maryland.</p><p class=\"\">“We are pleased to announce the completion of our strategic acquisition of Traditions Bancorp, and excited to unite our teams of dedicated local bankers who are committed to their customers and communities,” stated ACNB Corporation President &amp; Chief Executive Officer James P. Helt. “This combination brings together organizations that are unified by a shared vision, values, and a customer-centric approach to banking, to create an even stronger community bank. Importantly, our customers will benefit from expanded products and services delivered by the familiar faces they have come to know and trust. This merger positions us well to continue to grow in the attractive York and Lancaster County markets, and enhances ACNB Bank’s mortgage operations, which will now serve customers throughout our footprint as ‘Traditions Mortgage, A Division of ACNB Bank.’ Together, we look forward to continuing to deliver on our vision of being the financial services provider of choice in the communities we serve.”</p><p class=\"\">Alan J. Stock, Chair of the Board of ACNB, stated “We welcome Mr. Draganosky, Ms. Carson, and Mr. Polli to the ACNB Boards of Directors, and are confident that their expertise, skills, and strong connections to the York and Lancaster market areas will enhance and complement ACNB’s current Boards of Directors. We are committed to enhancing value for our shareholders and are poised to deliver on that commitment with an experienced and knowledgeable board, a seasoned management group, and a team of bankers and professionals dedicated to a successful integration and customer experience.”</p><p class=\"\">Bybel Rutledge LLP served as legal counsel and Piper Sandler served as financial advisor to ACNB Corporation for the transaction. Pillar + Aught served as legal counsel and Stephens Inc. served as financial advisor to Traditions Bancorp, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ACNB Corporation</strong></p><p class=\"\">ACNB Corporation, headquartered in Gettysburg, PA, is the $3.26 billion financial holding company for the wholly-owned subsidiaries of ACNB Bank, Gettysburg, PA, and ACNB Insurance Services, Inc., Westminster, MD. Originally founded in 1857, ACNB Bank serves its marketplace with banking and wealth management services, including trust and retail brokerage, via a network of 35 community banking offices and two loan offices located in the Pennsylvania counties of Adams, Cumberland, Franklin, Lancaster and York and the Maryland counties of Baltimore, Carroll and Frederick. ACNB Insurance Services, Inc. is a full-service insurance agency with licenses in 46 states. The agency offers a broad range of property, casualty, health, life and disability insurance serving personal and commercial clients through office locations in Westminster and Jarrettsville, MD, and Gettysburg, PA. For more information regarding ACNB Corporation and its subsidiaries, please visit investor.acnb.com.</p><p class=\"\">FORWARD-LOOKING STATEMENTS - In addition to historical information, this press release may contain forward-looking statements. Examples of forward-looking statements include, but are not limited to, (a) projections or statements regarding future earnings, expenses, net interest income, other income, earnings or loss per share, asset mix and quality, growth prospects, capital structure, and other financial terms, (b) statements of plans and objectives of Management or the Board of Directors, and (c) statements of assumptions, such as economic conditions in the Corporation’s market areas. Such forward-looking statements can be identified by the use of forward-looking terminology such as “believes”, “expects”, “may”, “intends”, “will”, “should”, “anticipates”, or the negative of any of the foregoing or other variations thereon or comparable terminology, or by discussion of strategy. Forward-looking statements are subject to certain risks and uncertainties such as national, regional and local economic conditions, competitive factors, and regulatory limitations. Actual results may differ materially from those projected in the forward-looking statements. Such risks, uncertainties, and other factors that could cause actual results and experience to differ from those projected include, but are not limited to, the following: short-term and long-term effects of inflation and rising costs on the Corporation, customers and economy; banking instability caused by bank failures and financial uncertainty of various banks which may adversely impact the Corporation and its securities and loan values, deposit stability, capital adequacy, financial condition, operations, liquidity, and results of operations; effects of governmental and fiscal policies, as well as legislative and regulatory changes; effects of new laws and regulations (including laws and regulations concerning taxes, banking, securities and insurance) and their application with which the Corporation and its subsidiaries must comply; impacts of the capital and liquidity requirements of the Basel III standards; effects of changes in accounting policies and practices, as may be adopted by the regulatory agencies, as well as the Financial Accounting Standards Board and other accounting standard setters; ineffectiveness of the business strategy due to changes in current or future market conditions; future actions or inactions of the United States government, including the effects of short-term and long-term federal budget and tax negotiations and a failure to increase the government debt limit or a prolonged shutdown of the federal government; effects of economic conditions particularly with regard to the negative impact of any pandemic, epidemic or health-related crisis and the responses thereto on the operations of the Corporation and current customers, specifically the effect of the economy on loan customers’ ability to repay loans; effects of competition, and of changes in laws and regulations on competition, including industry consolidation and development of competing financial products and services; inflation, securities market and monetary fluctuations; risks of changes in interest rates on the level and composition of deposits, loan demand, and the values of loan collateral, securities, and interest rate protection agreements, as well as interest rate risks; difficulties in acquisitions and integrating and operating acquired business operations, including information technology difficulties; challenges in establishing and maintaining operations in new markets; effects of technology changes; effects of general economic conditions and more specifically in the Corporation’s market areas; failure of assumptions underlying the establishment of reserves for credit losses and estimations of values of collateral and various financial assets and liabilities; acts of war or terrorism or geopolitical instability; disruption of credit and equity markets; ability to manage current levels of impaired assets; loss of certain key officers; ability to maintain the value and image of the Corporation’s brand and protect the Corporation’s intellectual property rights; continued relationships with major customers; and, potential impacts to the Corporation from continually evolving cybersecurity and other technological risks and attacks, including additional costs, reputational damage, regulatory penalties, and financial losses; and, the other factors detailed in ACNB’s publicly-filed documents, including its Annual Report on Form 10-K for the year ended December 31, 2023, Quarterly Reports on Form 10-Q for the quarters ended March 31, 2024, June 30, 2024 and September 30, 2024, and its other filings with the SEC. We caution readers not to place undue reliance on these forward-looking statements. The forward-looking statements only speak as of the date hereof, and ACNB does assume any obligation to revise, update or clarify forward-looking statements to reflect events or conditions after the date of this press release.</p><p class=\"\">ACNB #2025-5</p><p class=\"\">February 3, 2025</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Contact:</li><li class=\"listItem-bmN0_SHH\">Kevin HayesSVP/ General Counsel,Secretary, and Chief Governance Officer717.339.5161khayes@acnb.com</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX83TzZ6:0-correction-acnb-corporation-announces-completion-of-traditions-bancorp-inc-acquisition/",
            "pub_date": "2025-02-04 23:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Indwj6yG:0",
            "title": "Aiforia CEO increased shareholding in the company in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aiforia CEO increased shareholding in the company in January</p><p class=\"\">Aiforia Technologies Plc Press Release February 4, 2025 at 5.30 p.m. EET</p><p class=\"\">Aiforia’s CEO Jukka Tapaninen increased his shareholding in the company in January 2025. On January 7, 2025, the company published a management transaction notification regarding Tapaninen's acquisition of 3,298 shares. On February 4, 2025, Tapaninen's total shareholding in Aiforia is 621,798 shares, representing a 2.15% of total amount of shares in the company.</p><p class=\"\">On February 4, 2025, an error was discovered in the share register, according to which Tapaninen's ownership had decreased by 400,000 shares during January. The company is investigating the matter with the share register of Euroclear Finland Ltd and the book-entry account operator, and aims to correct the error and update the share information as soon as possible.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further inquiries </strong></p><p class=\"\">Jukka Tapaninen, CEO, Aiforia Technologies Plctel. +33 61 041 6686</p><p class=\"\">https://investors.aiforia.com/</p><p class=\"\">UB Corporate Finance Ltd <strong class=\"root-Tkn6WL2y\">Certified Adviser </strong></p><p class=\"\">ubcf@unitedbankers.fi</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aiforia</strong></p><p class=\"\">Aiforia is a trusted provider of deep learning artificial intelligence (AI) solutions for pathology. Aiforia delivers software solutions that elevate diagnostic capabilities in image analysis, enabling remarkable medical discoveries now and in the future. With thousands of AI models already developed on the Aiforia platform for research use and several diagnostic solutions deployed, Aiforia is already significantly impacting pathology and healthcare.</p><p class=\"\">Founded in 2013, Aiforia is a publicly traded company operating internationally with thousands of platform users across the globe. The company is headquartered in Helsinki, Finland, with offices in Cambridge, Massachusetts, and Rochester, Minnesota, and local representatives across Europe and North America. The diverse team at Aiforia includes experienced pathologists, medical scientists, AI and software developers, and a dedicated commercial team. Together, they are working to transform pathology with AI, enabling better care for each patient.</p><p class=\"\">Find out more at</p><p class=\"\">www.aiforia.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Indwj6yG:0-aiforia-ceo-increased-shareholding-in-the-company-in-january/",
            "pub_date": "2025-02-04 23:30:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308995:0",
            "title": "Vertical Aerospace Completes Phase 2 Piloted Thrustborne Testing of VX4 Prototype",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vertical Aerospace  said Tuesday it completed phase 2 of piloted thrustborne testing of its VX4 prototype of a four-passenger electric vertical take-off and landing aircraft, paving the way for piloted wingborne testing. </p><p class=\"\">The company said the prototype flights didn't suffer any system failures and surpassed expectations for stability and performance. </p><p class=\"\">After wingborne testing, the VX4 will enter a final phase of transition testing to show its ability to switch between vertical and forward flight modes, Vertical Aerospace said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308995:0/",
            "pub_date": "2025-02-04 23:30:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463515:0",
            "title": "Meridia RE IV Socimi Sells Spanish Hotel Owner",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meridia RE IV Socimi  sold its subsidiary that owns a hotel property in Barcelona, Spain, through the divestment of equity instruments worth 25.3 million euros. </p><p class=\"\">The price of the sale of the Spanish real estate investment company's Meridia RE IV Proyecto Ocho was based on a gross asset value of 27.7 million euros, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463515:0/",
            "pub_date": "2025-02-04 23:23:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446584:0",
            "title": "US 10-Year Yield Holds Rebound",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The yield on the 10-year US Treasury note trimmed earlier gains but held above the 4.55% mark on Tuesday, holding the recovery from the over-one-month low touched last session as the postponement of tariffs from US President Trump drove markets to unwind safety pivots.</p><p class=\"\">The move by the US President relaxed the view on the administration’s protectionist priorities, raising hopes that talks over the month could remove the pledge of tariffs altogether.</p><p class=\"\">In the meantime, strong economic data continued to support the Fed’s stance of no rush in reducing interest rates.</p><p class=\"\">This was lastly underscored by the unexpected expansion in manufacturing activity underscored by the ISM PMI survey, which also indicated a rebound in prices and employment.</p><p class=\"\">However, the JOLTS showed fewer job openings were recorded than expected, while factory orders plunged in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446584:0-us-10-year-yield-holds-rebound/",
            "pub_date": "2025-02-04 23:23:30",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463517:0",
            "title": "Danish Regulator Clears Nykredit's Bid for Spar Nord Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Danish Financial Supervisory Authority approved Nykredit  subsidiary Nykredit Realkredit's planned acquisition of up to 100% of Spar Nord Bank's  share capital. </p><p class=\"\">Nykredit owns 31.1% of the Danish lender's shares as of Tuesday but, based on recent information, has exceeded the 67% acceptance limit under its takeover offer, according to a same-day release. </p><p class=\"\">The bidder intends to launch a compulsory acquisition of the remaining shares after closing the offer within the first half. It also plans to delist Spar Nord Bank's shares from Nasdaq Copenhagen. </p><p class=\"\">In late 2024, Nykredit offered to purchase Spar Nord Bank's shares for 210 Danish kroner apiece, which valued the target asset at 24.7 billion kroner.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463517:0/",
            "pub_date": "2025-02-04 23:23:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0QV:0",
            "title": "COMMENT-BoE next for sterling after weathering tariff storm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GBP/USD has navigated U.S. tariff uncertainty well, quickly recovering from Monday's flash low at 1.2249, though it is likely to remain rangebound as traders await guidance from the BoE on Thursday about how much further UK rates may slide as the Fed remains steady.</p><p class=\"\">Futures markets project the UK bank rate ending 2025 at 3.89%, as per LSEG's IRPR, down from 4.15% in late January. </p><p class=\"\">A softer BoE rate outlook combined with a Fed on hold could widen U.S.-UK rate differentials, weighing on GBP/USD.</p><p class=\"\">IMM spec positioning indicates the recently established sterling net short grew in the latest reporting week, powered by both a reduction in longs and rise in shorts — a fundamentally weak signal.</p><p class=\"\">Though U.S. President Donald Trump has said that trade with Britain was \"out of line\" he has indicated that the issues can be worked out.  </p><p class=\"\">Given current conditions, GBP/USD is unlikely to surpass its recent trend high at 1.2523 as UK rate and global trade concerns persist. And should U.S. yields continue higher, pulling gilts up with them, UK fiscal concern may also rise, putting the 2025 low at 1.21 back in focus.    </p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1078.810408921933px;aspect-ratio:1.7980173482032218\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0QV-1c09d0a2e82b8111e4eaf1ac4d106e84-resized.webp\" type=\"images/webp\"/><img alt=\"fx\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0QV-1c09d0a2e82b8111e4eaf1ac4d106e84-resized.jpeg\" style=\"background-color:#d1d3d7\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Chart:</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0QV:0-comment-boe-next-for-sterling-after-weathering-tariff-storm/",
            "pub_date": "2025-02-04 23:23:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007831:0",
            "title": "U.S. Job Openings Fell in December; Other Hiring Metrics Steady",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Matt Grossman</p><p class=\"\">The number of open jobs in the U.S. fell by more than half a million in the last month of 2024, but other indicators of labor-market health stayed steady in December.</p><p class=\"\">Job openings ended December at 7.6 million, down by 556,000 from a month earlier and a decline of 1.3 million from a year earlier, according to the Job Openings and Labor Turnover Survey, published Tuesday by the Department of Labor.</p><p class=\"\">The hiring rate, at 3.4%, and the quits rate, at 2%, were both constant from November.</p><p class=\"\">Layoffs and discharges were also steady at a rate of 1.1%, the rate that has held since September. A total of about 1.8 million workers were laid off or discharged in December, little changed from a month earlier.</p><p class=\"\">Despite steadiness in December, labor-market metrics softened over the course of 2024 as hiring cooled and workers saw less opportunity to leave their jobs for new roles.</p><p class=\"\">The ratio of open jobs to unemployed workers peaked at around 2 in early 2022, but has fallen to closer to 1 in recent months.</p><p class=\"\">More up-to-date labor-market figures are on the way Friday, in the monthly jobs report for January.</p><p class=\"\">Write to Matt Grossman at matt.grossman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007831:0/",
            "pub_date": "2025-02-04 23:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007836:0",
            "title": "Saia Is Maintained at Overweight by JP Morgan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:24 GMT) </strong>Saia Price Target Cut to $558.00/Share From $566.00 by JP Morgan</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007836:0/",
            "pub_date": "2025-02-04 23:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV22E:0",
            "title": "First Financial Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Financial Corp  reported quarterly adjusted earnings of $1.37​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.06.  The mean expectation of three analysts for the quarter was for earnings of $1.28 per share. Wall Street expected results to range from $1.26  to $1.30 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 21.6% to $61.82 million from a year ago; analysts expected $60.35 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Financial Corp's reported EPS for the quarter was $1.37​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $16.24 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">First Financial Corp shares had risen by 4.0% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts was unchanged in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the banks peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for First Financial Corp is $52.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 03:23 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.28</p></td><td><p class=\"\">1.37</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.91</p></td><td><p class=\"\">0.74</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.96</p></td><td><p class=\"\">0.96</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">0.93</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV22E:0-first-financial-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-04 23:24:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007832:0",
            "title": "ADM Says Trade Uncertainty Set to Weigh on Profits — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Patrick Thomas</p><p class=\"\">U.S. grain merchant Archer Daniels Midland warned that trade policy uncertainty would likely hit the company's bottom line this year.</p><p class=\"\">Chicago-based ADM plays a central role in global commodity trading. It buys and sells crops to companies and governments while running processing plants that turn oilseeds and grain into vegetable oil, fuel, livestock feed and various food ingredients.</p><p class=\"\">ADM's profits have declined in recent years because of falling crop prices and reduced trade flows from the U.S. to China. New tariffs now threaten to raise prices for the country's exports, potentially further reducing demand-an outcome that could push prices lower still.</p><p class=\"\">In response, ADM has cut costs. On Tuesday, the company said it would cut up to 750 jobs globally this year. ADM also reported weaker-than-expected fourth quarter revenue and flat profits.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007832:0/",
            "pub_date": "2025-02-04 23:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC7VVQDQ:0",
            "title": "Bowler Metcalf Posts Rev For Six Months Ended Dec 2024 Up 6% To R459.4 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bowler Metcalf Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">JSE: BCF - SF: UNAUDITED INTERIM CONDENSED CONSOLIDATED RESULTS FOR THE 6 MONTHS ENDED 31 DECEMBER 2024 &amp; DIVIDEND DECLARATION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOWLER METCALF LTD - REVENUE FOR SIX MONTHS ENDED DEC 2024 UP 6% TO R459.4 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOWLER METCALF LTD - HEADLINE EARNINGS PER SHARE FOR SIX MONTHS ENDED DEC 2024 UP 17% TO 86.25 CENTS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOWLER METCALF LTD - INTERIM GROSS CASH DIVIDEND OF 25.00 CENTS PER SHARE DECLARED</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC7VVQDQ:0-bowler-metcalf-posts-rev-for-six-months-ended-dec-2024-up-6-to-r459-4-mln/",
            "pub_date": "2025-02-04 23:24:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308992:0",
            "title": "Grab Holdings Mulls Takeover of GoTo at $7 Billion Valuation, Bloomberg Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308992:0/",
            "pub_date": "2025-02-04 23:24:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007847:0",
            "title": "Supernus Gets FDA Approval of Onapgo Device for Parkinson's Disease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Colin Kellaher</p><p class=\"\">Supernus Pharmaceuticals has won Food and Drug Administration approval for its Onapgo device to treat patients with Parkinson's disease.</p><p class=\"\">Supernus on Tuesday said the FDA green light makes Onapgo the first and only subcutaneous apomorphine infusion device for the treatment of motor fluctuations in adults with advanced forms of the neurodegenerative disorder.</p><p class=\"\">The Rockville, Md., biopharmaceutical company said it plans to make Onapgo available in the second quarter.</p><p class=\"\">Supernus said Onapgo is a wearable infusion device that provides continuous treatment during the waking day for more consistent control of off periods, which can occur in people with Parkinson's disease when there is a return of symptoms in between medication doses.</p><p class=\"\">Shares of Supernus were recently up 5.5% to $39.42.</p><p class=\"\">Write to Colin Kellaher at colin.kellaher@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007847:0-supernus-gets-fda-approval-of-onapgo-device-for-parkinson-s-disease/",
            "pub_date": "2025-02-04 23:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007843:0",
            "title": "Omnicell Is Maintained at Buy by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(15:25 GMT) </strong>Omnicell Price Target Maintained With a $62.00/Share by Benchmark</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007843:0/",
            "pub_date": "2025-02-04 23:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV15O:0",
            "title": "Frasers Property (Thailand) Posts Qtrly Profit Attributable Of 326.5 Mln Baht",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Frasers Property (Thailand) PCL :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">QTRLY PROFIT ATTRIBUTABLE  326.5 MILLION BAHT</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">QTRLY TOTAL INCOME 3.27 BILLION BAHT</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV15O:0-frasers-property-thailand-posts-qtrly-profit-attributable-of-326-5-mln-baht/",
            "pub_date": "2025-02-04 23:25:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSt7kXka:0",
            "title": "Fantribe.com Announces Launch of Digital Fan Cards for Subscribers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-Fantribe.com to launch series of card brands blending physical card collectible to world of real money digital collectibles featuring Athletes, Celebrities and Creators</p><p class=\"\">MIAMI, FLORIDA / ACCESS Newswire / February 4, 2025 / Fantribe Inc. (www.Fantribe.com), a creator economy social platform recently acquired by public company Tritent International Corp. (Stock Symbol:TICJ), today announced the launch of Fantribe Digital Fan Cards-a groundbreaking way for fans to connect with their favorite athletes and celebrities like never before. More than just a collectible, Fantribe Fan cards will allow subscribers to unlock exclusive digital content, VIP experiences, watch parties, and special discounts. The first Fantribe Digital Fan cards are expected to be released March 31, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Are Fantribe Fancards?</strong></p><p class=\"\">Fantribe Digital cards are physical, premium-designed cards featuring your favorite athletes and celebrities. Each card is embedded with a unique QR code that, when scanned, grants access to exclusive digital content, behind-the-scenes footage, and even personal messages from the athletes, celebrities and creators themselves. But that's just the beginning.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Unlock VIP Experiences</strong></p><p class=\"\">Fantribe Fancards go beyond digital content-owning one can grant you access to VIP events, meet-and-greets, and even once-in-a-lifetime experiences with your favorite celebrities. Whether it's an invite to an intimate gathering, a backstage pass, or a private watch party, Fantribe Digital Fan cards provide real-world perks that take fandom to the next level.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Parties with the Stars</strong></p><p class=\"\">Imagine watching your favorite shows, concerts, or events alongside the celebrities themselves. Fantribe Digital Fan cards offer exclusive access to virtual and in-person watch parties through the Fantribe mobile app, allowing you to experience moments like never before, with behind-the-scenes commentary and interactive fan engagement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exclusive Discounts &amp; Perks</strong></p><p class=\"\">As a Fantribe card holder, you're not just collecting a card-you're unlocking a world of rewards. Enjoy discounts on exclusive merchandise, early access to special events, and other perks that bring you closer to the stars you admire.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Limited-Edition &amp; Collectible</strong></p><p class=\"\">Each Fantribe digital card is a limited-edition release, making it a highly sought-after collectible. Whether you're a longtime fan or just starting your collection, these cards hold unique value, both as memorabilia and as a gateway to unforgettable experiences.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Future of Fan Engagement</strong></p><p class=\"\">Fantribe digital cards will redefine what it means to be a fan, bridging the gap between athletes, celebrities, creators and their supporters in an interactive and meaningful way.</p><p class=\"\">\"Physical trading cards have always been a beloved medium for sports fans to connect with their favorite players and teams,\" said Michael Friedman, CEO of Fantribe. Every athlete partnering with Fantribe as a creator will have his or her own card series, and offer their fans a digital trading card that can receive multiple, new digital experiences from the creator on demand. Fans that love cardboard collectibles can now also have a personal digital experiences every month with the athlete or celebrity they follow and admire.\"</p><p class=\"\">Over the coming months, Fantribe will introduce a series of licensed digital trading collections that blend popular sports stars, celebrities and creators including behind-the-scenes clips, VIP experiences and brand offers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fantribe Inc.</strong></p><p class=\"\">Fantribe is an end-to-end community engagement digital platform that bridges the gap between athletes, creators, and their fans through premium, engaging, and monetisable experiences. The platform when completed with expected launch in March 2025, will allow athletes, celebs and creators of all types to integrate and import their existing social platforms from Instagram, Tik Tok, Facebook and others for access for Fans. Fans will receive points for accessing the creator platform under the freemium model used for purchase of goods, memorabilia and brands offered by Fantribe creators. Fantribe functions will include one-to-one chat, video streaming, e-commerce, and push campaigns for brand endorsements to its users. As a wholly owned subsidiary of Tritent International Corp. , Fantribe is committed to empowering creators and redefining the $250 billion creator economy. For more information about Fantribe and how it offers a stable and reliable alternative in the evolving digital landscape, visit www.fantribe.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Tritent International Corp.</strong></p><p class=\"\">Tritent International Corp. is a publicly traded company and diversified corporation focusing on strategic alliances within the Real Estate, Energy and Logistic sector. Our strategy is aimed towards the acquisition of controlling equity interests in disruptive companies by taking an active role to improve their growth, provide capital and management expertise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Fantribe Inc.</p><p class=\"\">Michael Friedman, President</p><p class=\"\">Email: hello@fantribe.commichael@firstlevelcapital.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Fan Tribe Inc.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSt7kXka:0/",
            "pub_date": "2025-02-04 23:17:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308966:0",
            "title": "Fox Plans to Launch Direct-to-Consumer Streaming Service by Year-end, CEO Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox  is targeting to launch a direct-to-consumer streaming service by the end of 2025, Chief Executive Lachlan Murdoch said Tuesday on the company's fiscal Q2 earnings call, according to a FactSet transcript. </p><p class=\"\">Murdoch did not provide many details regarding the upcoming streaming service but said the company has no plans of turning a traditional distribution customer into a direct-to-consumer one. \"And so our subscriber expectations will be modest and we're going to price the service accordingly,\" the executive said. </p><p class=\"\">Shares were over 4% higher in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308966:0/",
            "pub_date": "2025-02-04 23:17:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308975:0",
            "title": "Hain Celestial to Launch Distribution Center in Georgia; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hain Celestial Group  said Tuesday it will launch a distribution center in Savannah, Georgia, this month. </p><p class=\"\">This will mark the company's fourth distribution center in the US, it said. </p><p class=\"\">Hain Celestial shares were up more than 1% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308975:0/",
            "pub_date": "2025-02-04 23:17:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007785:0",
            "title": "LiveRamp Holdings Price Target Maintained With a $42.00/Share by Benchmark",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007785:0/",
            "pub_date": "2025-02-04 23:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}