{
    "data": [
        {
            "id": "cointelegraph:982038495094b:0",
            "title": "Bybit registers with Indian regulator, settles monetary fine",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bybit crypto exchange has successfully registered with India’s financial regulator following its previous compliance issues in the country.</p><p class=\"\">Bybit has successfully registered with India’s Financial Intelligence Unit (FIU), according to a Feb. 5 announcement shared with Cointelegraph.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1080.4878048780488px;aspect-ratio:1.8008130081300815\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:982038495094b-c9ca8706dbb6e7601af4a8c30b7bbdb1-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:982038495094b-c9ca8706dbb6e7601af4a8c30b7bbdb1-resized.jpeg\" style=\"background-color:#231d11\"/></picture></div></figure></span></p><p class=\"\">As part of its ongoing compliance efforts, Bybit has settled the monetary fine related to its prior regulatory issues, according to the announcement, which added:</p><div class=\"blockquote-xrkxvh37\">“We have been working diligently with the FIU-IND to address their concerns and ensure full adherence to the Prevention of Money Laundering Act (‘PMLA’) and associated regulations.”</div><p class=\"\">The exchange is pursuing a Virtual Digital Asset Service Provider (VDASP) license in India, having submitted its registration application on June 26, 2024.</p><p class=\"\">The successful registration comes nearly a month after Bybit suspended its services in India, citing “recent developments with Indian regulators,” and compliance concerns. </p><p class=\"\">Following the suspension of services, Bybit’s country manager for India, Vikas Gupta, told Cointelegraph that they expect the full operations license “in the coming weeks.”</p><p class=\"\">This is a developing story, and further information will be added as it becomes available.</p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:982038495094b:0-bybit-registers-with-indian-regulator-settles-monetary-fine/",
            "pub_date": "2025-02-05 17:45:17",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:f8c8fa304094b:0",
            "title": "MC Exclusive: Markets according to Mishra -- Neelkanth Mishra. On capex, consumption, deficit, dollar, earnings, valuations and returns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Union Budget gave markets some good news and some bad news. The tax breaks came as a huge positive surprise while the muted capex spending target for FY26 came as a bit of a dampener. While the proposals have brought hopes of a bounce back in earnings for FY26, stocks are still not dancing to an upbeat mood as uncertainty around Trump policy and quarterly results seem to be weighing them down. Neelkanth Mishra, Chief Economist, Axis Bank and an authoritative voice in India’s economic policy-making spoke to Moneycontrol exclusively on a wide range of questions on the economy and markets. Edited excerpts:</p><p class=\"\">What changes after the budget from a market perspective?</p><p class=\"\">Not much. The only surprise was that the government found the space for one lakh rupees in tax cuts. The COVID bump in deficits has largely been moved out. By FY 2031, the target for debt-to-GDP is expected to range between 48% to 52% from the current 56%. In the worst case, the government may not consolidate much further, but in the best case, we could see a reduction of 15-20 basis points per year. But overall, the aggressive pace of fiscal consolidation is over. For markets, nothing changes. The improvement in fiscal certainty may justify a slightly higher P/E multiple.</p><p class=\"\">Were you surprised at the muted FY26 capex target?</p><p class=\"\">Comparing FY 2019 to FY 2026, two key changes are that personal income tax-to-GDP and capital expenditure-to-GDP have both increased. The problem the government is facing is the lack of absorptive capacity for central government capex. The government can only spend on national highways, railways, defense, telecom, major ports, and airports, but most of these sectors don’t require much capex anymore. That’s the reason they decided to return some of the extra funds to taxpayers instead of distorting the economy further.</p><p class=\"\">This is assumed to boost overall consumption – will it?</p><p class=\"\">I don’t think so. The fiscal deficit as a percentage of GDP falls from 4.8% to 4.4%. The government is actually being a drag on growth by reducing aggregate demand. Capital expenditure as a percentage of GDP is going to remain flat. Forget about the earlier projections; the government’s actual expenditure is already behind the curve. In the first nine months of the year, even with the revised down estimates, government expenditure was low. However, in the last three months, government capex grew by 21% year-on-year, and in December, capex was up 95% year-on-year. So, aggregate expenditure will decrease as a percentage of GDP, so consumption is not likely to get a boost. I’m quite surprised by how the market seems to be interpreting this.But taxpayers are getting this extra money from tax savings, which will trigger consumption…</p><p class=\"\">Personal income tax-to-GDP is still expected to increase by FY 2026, despite the tax cuts. From a market perspective, how the 70-75 lakh people who fall in the Rs 12 lakh to Rs 50 lakh tax bracket and are the biggest beneficiaries of these tax cuts, will use that discretionary income.</p><p class=\"\">Which areas will see an uptick in consumption?</p><p class=\"\">These people are in the 90th percentile of Indian households. For them, their consumption is focused less on staples and more on high-value discretionary items. While it’s not considered part of household consumption expenditure, the real estate market will likely benefit. While some of this boost will go into savings, a significant portion will also likely be spent on purchases like cars, jewelry, etc. The effect on staples or other consumption categories might not be significant.Strangely, banks have not responded positively.</p><p class=\"\">One reason for that could be the uncertainty around the global economy. For banks, the bigger issue right now is the uncertainty surrounding monetary policy. There’s a lot of market expectation for rate cuts in the upcoming MPC meeting, but I personally think it would be premature to cut rates now, as it might undermine the credibility of inflation-fighting efforts.</p><p class=\"\">Do you think \"animal spirits\" in private investments can really come back this year?</p><p class=\"\">It’s essential to understand why investment fell in the first place. Gross fixed capital formation, which measures investment activity, fell from 34% in 2012 to 27% in 2021. A significant portion of this decline, around 5%, was due to reduced household investment in real estate. A large part of the rest was power sector investments and manufacturing that feeds into real estate. If we break it down, the downturn in the real estate and power generation sectors was a primary factor in this (falling investments). These cycles are now starting to turn around, which could drive growth.</p><p class=\"\">The government’s fiscal slowdown during the election year also played a role, but spending is starting to pick up now. On the other hand, the central bank’s tightening on credit-deposit ratios inadvertently slowed overall credit growth. While it was necessary to control certain segments of the credit market, the broader slowdown from 17% to 11% growth in credit was problematic. If we can reverse that trend, the growth outlook could improve significantly. The key to reviving private-sector capex is ensuring enough liquidity in the system, as the underlying demand trends are supportive. However, global turbulence still poses a significant risk.</p><p class=\"\">Going back to capex, have themes like roads and railways run their course from a stock perspective?</p><p class=\"\">The railway sector can indeed see significant growth in spending. If you recall, in 2014, the plan was to increase spending from around half a trillion to 2.5-3 trillion rupees by 2019. But the issue with railways is its bureaucracy. It’s historically struggled to execute large contracts and tenders. That said, there’s been a push for process improvements within the railway ministry. They’re starting to tackle these challenges, and the capacity to absorb more spending is improving. Moving from spending Rs 1-1.5 lakh crores per year to 2.5 lakh crores is a big leap. There’s potential for unlocking an additional Rs 10-11 trillion in projects. The primary challenge here is not fiscal capacity or funds, but the railways’ ability to execute these projects efficiently.</p><p class=\"\">How about power?</p><p class=\"\">The announcements for power capacity have already been made, but investments have just begun. For the next 3-5 years, the focus should be on urban infrastructure, which is gaining traction. The budget allocates a significant amount, with the potential to trigger up to Rs 4 lakh crores in capex through competition among states. This is a clear area for growth. Within industrials, the focus will shift to construction – like machinery, materials, cement, etc. – rather than manufacturing. With excess capacity in China, the likelihood of very large, capital-intensive projects coming up in India is slim… other than maybe in strategic areas like semiconductors. But, mostly, if we do get manufacturing, it will be labour-intensive manufacturing.</p><p class=\"\">How do you interpret the impact of Trump tariffs on Indian markets?There are so many moving parts and so many layers… but overall, it’s not good for anyone. If anyone is under any illusion that these tariffs somehow help India, I think they are mistaken. Normal wars, while they are very bad for lives and livelihoods in some specific areas, can actually be a boost to the economy. The First World War, for three or four years, was a big boost to the US economy. The Second World War also, because most of the damage happened in Europe, they actually benefited from trade. But, these are wars where the objective is economic damage. You see even the US government statements; they say that they are willing to accept some damage. In fact, there are theoreticians who are saying that this is like mutually assured destruction.</p><p class=\"\">So the first thing is, this hurts everyone. It’s bad for growth. Secondly, there is involuntary contraction because, as prices go up, demand falls. The third is just the uncertainty -- if you're setting up a factory anywhere in the world, you would say, 'You know what, let me hold back.'</p><p class=\"\">As for foreign selling in Indian markets, will it continue in this environment?</p><p class=\"\">Yes, so the dollar strengthening is not so much because of any expectations on the balance of payment changes. Frankly, that's too hard to forecast at this stage. Yeah, but it's just de-risking. People want to get into safe assets, or what was considered to be safe assets 20 years ago. So these are muscle memories of the markets that whenever there is uncertainty, you dump all the speculative back of the dollar, and then money goes back to the dollar and to gold. I mean, gold is behaving much better, which again, shows that people are really becoming risk-averse. So that is the strength of the dollar, which I think will be temporary. Once some certainty emerges, and people see how this dust may settle, which could take three to six months, then, this reversal starts as well. Because, as you were rightly saying, this is contra to what the US government really wants.</p><p class=\"\">What's your take on Indian markets for 2025?</p><p class=\"\">The first thing is the headline, I don't think we will go anywhere, although I do expect that the underlying earnings will keep improving. We will see a time correction that we've been anticipating now. I was maybe 10 months too early in calling for a peak; the market ran for a lot longer. But now the potential growth acceleration in India is now behind us, a P/E expansion is unlikely. What has also happened is that given the high prices, the supply of equity is very high. So even this year, there is going to be seven and a half lakh crores of supply in terms of promoter selling, IPOs, block trades, etc., whereas the demand is only about six lakh crores. So, on both these fronts, the PE multiple doesn't go anywhere. The enhanced global uncertainty means that the PE multiples come off even more.The underlying demand or the earnings should grow because demand drivers are largely domestic. This is the headline approach. But if something really bad happens in the trade war, maybe there is a deeper swoon in the market correction, that should be bought into. But within sectors, I would say that the channel through which growth can really be boosted is credit. Because, there is not much scope for fiscal action. Given elevated inflation, there is not much scope for interest rates to come down. But there is a lot more scope to get credit growth back closer to where it was before the slowdown started. And so, the channel for that would be the financials.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:f8c8fa304094b:0-mc-exclusive-markets-according-to-mishra-neelkanth-mishra-on-capex-consumption-deficit-dollar-earnings-valuations-and-returns/",
            "pub_date": "2025-02-05 17:45:49",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEEfhXSpa:0",
            "title": "Romania's MedLife finalises 60% takeover of Routine Med",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BUCHAREST (Romania), February 5 (SeeNews) - Romanian private healthcare services provider MedLife Group [BSE:M] said it has completed the acquisition of a 60% stake in local peer Routine Med, based in the southeastern city of Tulcea.</p><p class=\"\">The acquisition allows MedLife to strengthen its market position in Romania's southeast region, it said in a press release on Tuesday.</p><p class=\"\">Routine Med operates a hospital facility equipped with an operating room, a hospitalisation unit, and an outpatient area. The hospital offers services in over 20 medical and surgical specialties as well as laboratory and medical imaging services.</p><p class=\"\">In 2023, Routine Med booked revenue of over 15 million lei ($3.1 million/3 million euro), as per the statement.</p><p class=\"\">\"We know the history of MedLife, we know that it has the largest portfolio of acquisitions on the medical market in Romania, and we see the partnership with this group as a new and promising stage in the development of our business,\" said Routine Med founder Mihai Pavel who retained a 40% stake in the company.</p><p class=\"\">Last year, MedLife agreed to acquire majority stakes in local peer Euromedica Baia Mare Group and in human medical genetics centre Personal Genetics. MedLife also agreed to buy local peer Antares Clinic.</p><p class=\"\">Established in 1996, MedLife is among Romania’s largest providers of healthcare services, with over 130 hyperclinics and clinics, 15 hospitals, four maternity centres – located in Bucharest, Sibiu, Brasov, and Arad, 42 laboratories, 21 pharmacies and 18 dental clinics. The group also has 202 private clinic partners across Romania.</p><p class=\"\">MedLife booked a consolidated net profit of 20.8 million lei ($4.3 million/4.2 million euro) in the first nine months of 2024, up from a net profit of 3.8 million lei in the prior-year period.</p><p class=\"\">Blue-chip MedLife’s shares traded 0.87% higher at 5.81 lei as at 1004 CET on February 5 on the Bucharest Stock Exchange.</p><p class=\"\">(1 euro = 4.9769 lei)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEEfhXSpa:0-romania-s-medlife-finalises-60-takeover-of-routine-med/",
            "pub_date": "2025-02-05 17:46:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205000204:0",
            "title": "Why central banks' hunger for gold shows 'no sign of being quelled' this year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Myra P. Saefong</p><p class=\"\">Central banks stretched their gold-buying streak to a 15th consecutive year in 2024, contributing to a rise in total demand for the precious metal to its highest annual level on record - with no sign of an end this year to their \"hunger\" for gold, according to the World Gold Council.</p><p class=\"\">Gold purchases by central banks and other institutions reached 1,044.6 metric tons in 2024, the World Gold Council said in its latest Gold Demand Trends report released Wednesday.</p><p class=\"\">That's down a bit from 1,050.8 metric tons in 2023, but buying topped 1,000 metric tons for a third year in a row - well above the 473-metric-ton annual average seen between 2010 and 2021.</p><p class=\"\">Total gold demand in 2024, meanwhile, rose to 4,974.5 metric tons, up 1% from the year before, as annual investment in the metal climbed 25% year on year to reach a four-year high of 1,179.5 metric tons, according to the World Gold Council.</p><p class=\"\">Read: Why there's 'incredible demand for physical gold' in New York markets</p><p class=\"\">\"As we continue through the first half of 2025, the gold market will be influenced by macroeconomic dynamics, particularly in the U.S.,\" Joe Cavatoni, senior market strategist, Americas, at the World Gold Council told MarketWatch. \"The new Trump administration adds uncertainty around monetary, fiscal and trade policies, each with significant implication for gold as a strategic asset.\"</p><p class=\"\">Trade tariffs targeting China, Mexico and Canada would be expected to \"increase inflation, which could weaken purchasing power and drive investors toward gold as a store of value,\" he said. The U.S. implemented on Tuesday an additional 10% tariff on goods imported from China, and Beijing announced retaliatory tariffs on the U.S. that go into effect Feb. 10. But the Trump administration delayed planned tariffs on Canada and Mexico by a month.</p><p class=\"\">Central banks, as well as exchange-traded-fund investors, are likely to drive gold demand this year, with economic uncertainty supporting gold's role as a risk hedge, the World Gold Council said. Central banks have been net buyers of gold for the past 15 years, \"yet their hunger for gold shows no sign of being quelled.\"</p><p class=\"\">Forecasting the level of demand for any specific central bank is \"particularly difficult, given that it is often dictated by policy,\" the World Gold Council said.</p><p class=\"\">'Geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset.'World Gold Council's Gold Demand Trends report</p><p class=\"\">But \"geopolitical and economic uncertainty remains high in 2025 and it seems as likely as ever that central banks will once again turn to gold as a stable strategic asset,\" it said.</p><p class=\"\">On Tuesday, gold for April delivery (GC00) (GCJ25) climbed $18.70, or nearly 0.7%, to settle at $2,875.80 an ounce on Comex, marking the highest most-active contract finish on record.</p><p class=\"\">Read: Gold at $3,000 is 'within reach' as new era of U.S. trade policy rattles markets</p><p class=\"\">-Myra P. Saefong</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205000204:0/",
            "pub_date": "2025-02-05 17:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446720:0",
            "title": "UK Services Activity Expands Slightly in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global UK Services PMI was revised slightly downward to 50.8 in January 2025 from the preliminary estimate of 51.2, falling below December’s reading of 51.1.</p><p class=\"\">This marked the joint-lowest level in 15 months, matching November's figure, and signaled only a modest expansion in business activity.</p><p class=\"\">Total new work declined, ending a 14-month streak of continuous growth, as firms cited global economic uncertainty, elevated interest rates, and weaker business confidence following the Autumn Budget.</p><p class=\"\">Employment levels fell for the fourth consecutive month, with job cuts accelerating at the fastest pace since January 2021, while backlogs of work declined sharply.</p><p class=\"\">On the pricing front, cost inflation hit its highest level since April 2024, and selling prices rose at the steepest rate in 13 months.</p><p class=\"\">Finally, business optimism for the year ahead weakened to its lowest point since December 2022.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446720:0-uk-services-activity-expands-slightly-in-january/",
            "pub_date": "2025-02-05 17:47:19",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW14M:0",
            "title": "Prudential Financial Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc  reported quarterly adjusted earnings of $2.96​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $2.58.  The mean expectation of sixteen analysts for the quarter was for earnings of $3.25 per share. Wall Street expected results to range from $3.13  to $3.44 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 0.1% to $13.01 billion from a year ago; analysts expected $14.71 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc's reported EPS for the quarter was a loss of 17 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported a quarterly loss of $62 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Prudential Financial Inc shares had fallen by 0.5% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 3.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, eleven analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 13 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the life &amp; health insurance peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Prudential Financial Inc is $129.50 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 09:47 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.25</p></td><td><p class=\"\">2.96</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">3.48</p></td><td><p class=\"\">3.48</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">3.45</p></td><td><p class=\"\">3.39</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">3.13</p></td><td><p class=\"\">3.12</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW14M:0-prudential-financial-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 17:48:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002926:0",
            "title": "China's Counter Tariffs Could Affect U.S. LNG Export Projects — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's counter tariffs against the U.S. could affect long-term liquefied natural gas contract negotiations, Goldman Sachs says. Beijing's decision to impose sanctions on American LNG and crude oil is expected to have limited implications for energy prices. This is because affected U.S. volumes are likely to find alternative buyers and China can secure supplies from other sources. But \"we see a potential pause in new long-term LNG contract negotiations between China buyers and U.S. LNG export facilities,\" analysts at the bank say. \"Given that most proposed U.S. LNG facilities require that a significant portion of their capacity is contracted under long-term deals in order to obtain financing, such a pause might delay new U.S. LNG export facilities reaching a final investment decision.\" (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002926:0/",
            "pub_date": "2025-02-05 17:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr42X7hG:0",
            "title": "Publication of request to delist Penneo A/S' shares from Nasdaq Copenhagen",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Penneo<p class=\"\">Company Release no. 19/2025 </p><p class=\"\">Copenhagen, Denmark, 5 February 2025</p><p class=\"\">With reference to Penneo A/S' (\"<strong class=\"root-Tkn6WL2y\">Penneo</strong>\") announcement published today (no. 18/2025) regarding Visma Danmark Holding A/S' (\"<strong class=\"root-Tkn6WL2y\">Visma</strong>\") decision to initiate a compulsory acquisition of the shares held by the remaining shareholders in Penneo pursuant to sections 70-72 of the Danish Companies Act, Penneo's board of directors has today, upon request from Visma, decided to request Nasdaq Copenhagen A/S (\"<strong class=\"root-Tkn6WL2y\">Nasdaq Copenhagen</strong>\") to have Penneo's shares (ISIN DK0061283009) removed from trading and official listing at Nasdaq Copenhagen. </p><p class=\"\">Provided that Nasdaq Copenhagen accepts the request, the delisting will be completed as soon as possible. The last day of trading is expected to be 5 March 2025, being the last business day within the four-week compulsory acquisition period. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information - Penneo:</strong></p><p class=\"\">Jostein Vik</p><p class=\"\">Chairman of the Board of Directors at Penneo</p><p class=\"\">Mobile +47 92 22 23 92 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Enquiries – Visma:</strong></p><p class=\"\">Lage Bøhren</p><p class=\"\">Director of Communication at Visma</p><p class=\"\">Telephone: +47 92 15 78 01</p><p class=\"\">Sindre Talleraas Holden</p><p class=\"\">Head of M&amp;A at Visma</p><p class=\"\">Telephone: +47 93 05 94 69 </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Penneo</strong></p><p class=\"\">Penneo combines digital signing and Know Your Customer (KYC) workflows into a single platform that streamlines critical business processes for anti-money-laundering regulated B2B companies.</p><p class=\"\">Founded in Copenhagen and operating throughout Europe, Penneo is fast becoming the go-to platform for companies looking to save time on administrative tasks while ensuring complete regulatory compliance and peace of mind for themselves and their clients. Penneo is already trusted by +3,000 companies - including the world’s leading auditors.</p><p class=\"\">For information about Penneo, please visit https://penneo.com/investors.</p><p class=\"\">https://news.cision.com/penneo/r/publication-of-request-to-delist-penneo-a-s--shares-from-nasdaq-copenhagen%2Cc4100906</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr42X7hG:0-publication-of-request-to-delist-penneo-a-s-shares-from-nasdaq-copenhagen/",
            "pub_date": "2025-02-05 17:49:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0D1:0",
            "title": "Russia plans to boost yuan sales by 17% to support the rouble",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Russia said on Wednesday it would boost its sales of Chinese yuan by 17% from Feb. 7 in a move seen as aimed at supporting the rouble in the face of increased volatility due to Western sanctions and turbulence in the global forex market. </p><p class=\"\">Under a complex scheme of foreign currency operations, the central bank buys and sells forex both to ensure supply on the domestic market and to act on behalf of the finance ministry, which runs the \"rainy day\" National Wealth Fund (NWF). </p><p class=\"\">The finance ministry said it would cut its purchases of foreign currency and gold in the month ahead, a move that will increase the state's overall forex sales, providing support for the rouble.</p><p class=\"\">The finance ministry said its purchases of foreign currencies and gold for the period from Feb. 7 to March 6 would amount to the equivalent of 66.5 billion roubles, or 3.3 billion roubles a day. </p><p class=\"\">In the previous period the purchases amounted to the equivalent of 70.2 billion roubles, or 4.1 billion roubles a day.</p><p class=\"\">The move implied that the overall net forex sales by the government and the central bank will rise to 5.56 billion roubles per day from Feb. 7 from 4.76 billion roubles previously. </p><p class=\"\">The central bank cannot buy and sell dollars and euros because of Western sanctions imposed over Russia's actions in Ukraine. China's yuan, which is now the most traded foreign currency in Russia, has become the regulator's only instrument for forex interventions.</p><p class=\"\">At 0930 GMT, the rouble  was up 2.2% at 98.50 against the dollar, according to data from the over-the-counter market. It strengthened 0.13% to 13.27 against China's yuan in trading on the Moscow Stock Exchange (MOEX).</p><p class=\"\">The rouble has already surged 13% against the dollar this year due to lower demand from Russian importers during the New Year holiday season and despite new Western sanctions, which targeted sales of oil, Russia's main export commodity. </p><p class=\"\">The central bank said on Feb. 4 that the rouble exchange rate remains volatile due to continued problems with cross-border payments with Russia's trading partners and the shrinking current account surplus. </p><p class=\"\">In a separate move, the central bank reduced the volume of its yuan swap operations by 50% to 5 billion yuan, as China's Lunar New Year holiday ended and Russian banks can now replenish their yuan stocks.     </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0D1:0-russia-plans-to-boost-yuan-sales-by-17-to-support-the-rouble/",
            "pub_date": "2025-02-05 17:50:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0ZK:0",
            "title": "India's Thangamayil Jewellery surges on upbeat Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Thangamayil Jewellery  climbs more than ~12% to 2,097 rupees; set for biggest intraday pct gain since June 21, 2024</p><p class=\"\">** Co's Q3 profit jumps 72% y/y; net sales up 26%</p><p class=\"\">** Around 333,000 shares traded vs 30-day avg of 26,000</p><p class=\"\">** THNG rises 6% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0ZK:0-india-s-thangamayil-jewellery-surges-on-upbeat-q3-results/",
            "pub_date": "2025-02-05 17:50:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463921:0",
            "title": "TSH Resources Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TSH Resources  bought back 1,150,000 shares for 1.4 million ringgit on Wednesday, according to a same-day disclosure on the Singapore bourse. </p><p class=\"\">The shares were repurchased at between 1.19 ringgit and 1.22 ringgit apiece, the dual-listed oil palm cultivation and wood products company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463921:0/",
            "pub_date": "2025-02-05 17:41:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0KE:0",
            "title": "AMD shares dive as AI chip revenue disappoints investors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Advanced Micro Devices  shares fell 9% in premarket trading on Wednesday, after the company's AI chip revenue failed to meet lofty expectations of investors betting billions on growth prospects of generative artificial intelligence.</p><p class=\"\">AMD, one of the biggest providers of chips for personal computer and servers, reported quarterly results and revenue outlook above analyst estimates, but that was overshadowed by its miss in AI chip-related revenue as investors scrutinized its results against Nvidia , which controls nearly 80% share of the market.</p><p class=\"\">The Santa Clara, California-based company reported fourth-quarter data center revenue - a proxy for its AI revenue - of $3.9 billion, compared to the consensus estimate of $4.15 billion.</p><p class=\"\">\"AMD may still be taking market share from Intel in the central processing unit (CPU) side of things, but it remains a long way behind Nvidia and is struggling to catch up when it comes to graphics processing units (GPU),\" said Ben Barringer, technology analyst at Quilter Cheviot.</p><p class=\"\">\"Investors want the company to take the fight to Nvidia, but for now it is very much struggling to break the moat and disrupt its market position,\" he added.</p><p class=\"\">If losses hold, AMD is set to lose around $17.5 billion in market capitalization at $108.78 premarket, according to data compiled by LSEG.</p><p class=\"\">The results comes as tech giants including Microsoft  and Meta  increasingly dedicate resources to develop their own silicon for processing large data volumes required by GenAI, amid rising competition from Chinese AI company DeepSeek.</p><p class=\"\">\"Investors were always going to be more sensitive, given the arrival of...DeepSeek,\" said Susannah Streeter, head of money and markets at Hargreaves Lansdown, adding that AMD's results and outlook have \"knocked confidence further.\"</p><p class=\"\">At least 5 analysts have cut their price targets on the stock, with median PT now at $155, compared to $166.5 before the results.</p><p class=\"\">AMD's stock fell 18% in 2024, while Nvidia gained 171% in the same period.</p><p class=\"\">AMD's 12-month forward price-to-earnings ratio stands at 23.39, compared with Nvidia's 26.27.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0KE:0-amd-shares-dive-as-ai-chip-revenue-disappoints-investors/",
            "pub_date": "2025-02-05 17:41:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463924:0",
            "title": "San Miguel Food and Beverage Declares Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">San Miguel Food and Beverage  declared a regular cash dividend of 0.50 Philippine pesos per share, according to a Wednesday Philippine Stock Exchange filing. </p><p class=\"\">The dividend is payable on March 6 to shareholders on record as of Feb. 19, the Philippine food and beverage giant said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463924:0/",
            "pub_date": "2025-02-05 17:41:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0TZ:0",
            "title": "US-China trade war sparks record-breaking rally in gold",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Bullion hits all-time high at $2,869.68</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Global gold demand up 1% in 2024 - WGC says</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump in no hurry to talk to Xi amid new tariff war</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Silver, platinum up over 1%</li></ul></span></div><span><p class=\"\">    Gold prices jumped 1% on Wednesday, continuing their record rally, driven by safe-haven demand amid the escalating U.S.-China trade war, while the spotlight was also on payrolls data from the world's largest economy.</p><p class=\"\">Spot gold  rose 0.9% to $2,867.59 per ounce by 0906 GMT, after rising 1% and hitting a record high of $2,869.68 earlier in the session. U.S. gold futures  gained 0.7% to $2,895.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:852.0000000000001px;aspect-ratio:1.4200000000000002\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.webp\" type=\"images/webp\"/><img alt='A line chart titled \"Spot gold price in USD per oz\" that tracks the metric over time.' class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OW0TZ-214176f3d37e695a5365fb38d728513c-resized.jpeg\" style=\"background-color:#fbfbfc\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Spot gold price in USD per oz</span></figcaption></figure></span></p><p class=\"\">China imposed tariffs on U.S. imports in a prompt retaliation to newly introduced U.S. duties on Chinese goods, reigniting the trade war between the world's two largest economies, while U.S. President Donald Trump stated he is in no rush to speak with President Xi Jinping to de-escalate tensions.</p><p class=\"\">\"The potential economic consequences of a trade war between the U.S. and China are causing investors to fear a global recession and rising inflation,\" said Dominik Sperzel, head of trading at Heraeus Metals Germany.</p><p class=\"\">Meanwhile, three Federal Reserve officials warned that Trump's trade tariffs could drive inflation, with one suggesting that uncertainty over price outlooks warrants slower interest rate cuts. Investors this week are watching out for the ADP employment report and the payrolls report, which could shed further clues on the U.S. rate path.</p><p class=\"\">Bullion is considered an inflation hedge, but higher interest rates could dampen its appeal as the metal yields no interest.</p><p class=\"\">\"Gold is overbought and needs to correct,\" said StoneX analyst Rhona O'Connell, adding \"there is still scope for further upside, but barring any black swans we still expect to see the price topping out this year.\"</p><p class=\"\">Gold's relative strength index is at 76, indicating that the price has surpassed the \"overbought\" territory that starts at 70. </p><p class=\"\">Meanwhile, global gold demand rose 1% to a record 4,974.5 metric tons in 2024, driven by higher investment and increased central bank purchases in the fourth quarter, according to the World Gold Council.</p><p class=\"\">Spot silver  rose 1.1% to $32.44 per ounce, platinum  gained 1.3% to $976.05 and palladium  added 0.8% to $998.00.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0TZ:0-us-china-trade-war-sparks-record-breaking-rally-in-gold/",
            "pub_date": "2025-02-05 17:41:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463926:0",
            "title": "Thor Energy Names New Managing Director",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Uranium and energy metals explorer Thor Energy  appointed Andrew Hume as its new managing director, according to a Wednesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463926:0/",
            "pub_date": "2025-02-05 17:42:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ObiQnzRXa:0",
            "title": "Crayon: Invitation to Q4 2024 presentation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crayon Group Holding ASA will publish its Q4 2024 financial results onFebruary12th, 2025, at 7:00 am CET.</p><p class=\"\">CEO Melissa Mulholland and CFO Brede Huser will present the results in a livewebcast at 8:30 am CET.</p><p class=\"\">The materials and webcast can be accessed atwww.crayon.com/investor-relations/.</p><p class=\"\">There will be a Q&amp;A session after the presentation. To join the conferencecallby telephone and ask questions, please use the information below.</p><p class=\"\">Dial in numbers:</p><p class=\"\">DK: +45 7876 8490</p><p class=\"\">SE: +46 8 1241 0952</p><p class=\"\">NO: +47 2195 6342</p><p class=\"\">UK: +44 203 769 6819</p><p class=\"\">US: +1 646-787-0157</p><p class=\"\">DE: +49 30 21789327</p><p class=\"\">Conference Code: 115901</p><p class=\"\">A recording of the presentation and Q&amp;A session will be available on-demandafter the live event has concluded.</p><p class=\"\">Investor contact:</p><p class=\"\">Kjell Arne Hansen Head of Investor Relation &amp; Corporate Finance</p><p class=\"\">ir@crayon.com</p><p class=\"\">+47 950 40 372</p><p class=\"\">About Crayon</p><p class=\"\">Crayon is a customer-centric innovation and IT services company with over4000team members across 46 countries. We optimize businesses' IT estate to helptheminnovate with expertise they can trust. Our services create value forcompaniesto thrive today, and scale for tomorrow. For more information, visitwww.crayon.com.</p><p class=\"\">https://newsweb.oslobors.no/message/637755</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ObiQnzRXa:0-crayon-invitation-to-q4-2024-presentation/",
            "pub_date": "2025-02-05 17:42:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002901:0",
            "title": "U.K. July 2053 Green Gilt Likely to Outperform in Relative Value Basis — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. Debt Management Office auction of the July 2053 green gilt at 1000 GMT is expected to perform well in relative value terms, RBC Capital Markets analysts say in a note. Wednesday's tap is likely to be the final one for the green gilt, which should support demand for the bond, the analysts say. \"We have also observed that outgoing 30-year conventional gilts have consistently outperformed into the end of their tapping cycles,\" RBC says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002901:0/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204012106:0",
            "title": "Novo Nordisk Stock Rises After Earnings Beat. There Are Some Growth Concerns. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis and Elsa Ohlen</p><p class=\"\">Novo Nordisk stock rose Wednesday after the Danish drugmaker reported quarterly earnings above analysts' expectations, but forecast slower growth ahead.</p><p class=\"\">Novo posted fourth-quarter earnings of 6.34 ($0.88) Danish kroner a share on sales of 85.7 billion DKK, beating expectations for earnings of 5.98 DKK a share on sales of 80.1 billion DKK, according to FactSet.</p><p class=\"\">The maker of weight-loss and diabetes drugs Ozempic and Wegovy forecast sales growth of between 16% and 24% in 2025, less than the 26% growth observed in 2024.</p><p class=\"\">Novo's Danish listed shares rose 5.1% in early trading Wednesday.</p><p class=\"\">This is breaking news. Read a preview of Novo Nordisk below and check back for more analysis soon.</p><p class=\"\">When Danish drugmaker Novo Nordisk reports its quarterly financial results on Wednesday, investors will be looking for reassurance the GLP-1 market is still on track for the enormous growth Wall Street expects.</p><p class=\"\">Novo shares have taken a beating in recent months, with the stock's American depositary receipts falling nearly 40% in the last six months of 2024. Shares first slid on growing worries that sales of its weight-loss drug Wegovy and its Type 2 diabetes drug Ozempic wouldn't live up to the hype, and then on very disappointing trial data.</p><p class=\"\">A positive pipeline update in January wasn't enough to reverse the momentum, and the ADRs were down roughly 30% over the past 12 months as of Tuesday.</p><p class=\"\">Novo's Wegovy and Ozempic are among the most consequential, closely watched new medications in recent history, but they face serious competition from Eli Lilly's Zepbound and Mounjaro, and from legal copycats manufactured by compounding pharmacies and sold by telehealth firms.</p><p class=\"\">While the compounders will soon be barred from selling knockoffs of the Lilly drugs, Novo's drugs remain in shortage, and can legally be copied.</p><p class=\"\">Analysts expect Novo to report fourth-quarter sales of 80.1 billion Danish Krone, or $11.1 billion, on Wednesday, and earnings of 5.98 DKK per share, or $0.83, according to FactSet.</p><p class=\"\">Investors will be paying particularly close attention to Wegovy and Ozempic sales for the quarter. Current FactSet consensus estimates put Wegovy sales at 20 billion DKK, or $2.8 billion, for the quarter, and Ozempic sales at 33 billion DKK, or $4.6 billion.</p><p class=\"\">Investors will also be looking for updates on supply of the two medicines. Novo in December closed an $11 billion deal to ramp up its supply of GLP-1 medicines, though it could take time for the results of that deal to be felt in the market.</p><p class=\"\">\"If we redirect everything that we have of GLP-1 to the U.S. we will be immediately out of the drug shortage situation,\" Henrik Wulff, executive vice president for product supply, quality, and information technology at Novo, told Barron's in December. But Novo serves markets worldwide.</p><p class=\"\">\"We try to balance these launches up against the in-market demands, and try to guesstimate how we can get out of the drug shortages,\" he said.</p><p class=\"\">Shares of Novo have yet to recover from a startling update in late December on CagriSema, a next-generation weight-loss drug. Novo had said it expected patients to lose at least 25% of their body weight on CagriSema, but in a Phase 3 trial patients only lost 22.7%.</p><p class=\"\">In January, Novo unveiled early results on another weight loss drug, amycretin, which appeared very promising, though the drug has years of studies ahead of it before it can make it to market.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204012106:0/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002896:0",
            "title": "China's Lunar New Year Travel, Spending Boom Offers Positive Signs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China reported record-high tourism revenue and travel numbers during the Lunar New Year holiday, offering a glimmer of hope for policymakers as they continue their efforts to boost sluggish domestic demand.</p><p class=\"\">Data showing consumers spending more on both goods and services could signal that Beijing's flurry of measures to bolster demand are taking effect. Sustainably reviving consumption in the world's second-largest economy has taken on particular urgency as China's exports face growing headwinds from U.S. tariffs.</p><p class=\"\">Tourism revenues in China during the eight-day holiday that ended Tuesday rose 7.0% in year-over-year terms to 677 billion yuan, or about $94.23 billion, while the number of domestic trips rose 5.9% to 501 million, the state-run Xinhua News Agency reported Wednesday, citing data from China's Ministry of Culture and Tourism.</p><p class=\"\">Several indicators for the cultural and tourism market, including the number of trips and tourism spending, hit record highs during the eight-day holiday following the Lunar New Year, said Xinhua.</p><p class=\"\">Box office data was also upbeat, with revenue and moviegoer numbers both hitting new highs. Box office revenue reached 9.51 billion yuan as more than 187 million people went to cinemas, according to the China Film Administration.</p><p class=\"\">\"China had a solid start to the Year of the Snake,\" Citi Research analysts led by Xiangrong Yu said in a note.</p><p class=\"\">The holiday saw a return of the travel rush, with cross-border travel gaining momentum, especially for inbound tourism, they said, while the government's expanded trade-in programs boosted consumer demand.</p><p class=\"\">A total of 14.37 million cross-border trips in and out of China were made during this year's holiday, marking a 6.3% increase from the same period last year, data from the National Immigration Administration showed. Of that total, foreign nationals accounted for 958,000 trips, up 22.9% in year-over-year terms after Beijing eased restrictions on foreign travel.</p><p class=\"\">During the Lunar New Year, China's goods consumption grew 9.9%, while services consumption rose 12.3% from the same period a year ago, according to the State Taxation Administration, based on value-added tax data. Sales of home appliances and furniture saw strong growth, driven by trade-in policies, alongside robust demand for tourism, cultural, and sports services, it said.</p><p class=\"\">The relatively positive data comes after a private gauge of services sector activity pointed to softer growth, and as markets continue to digest the opening salvos in the U.S.-China trade spat.</p><p class=\"\">On Tuesday, Beijing announced a series of retaliatory measures in response to President Trump's tariff hike on Chinese goods. China's measures targeted both U.S. goods and companies, including an additional 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on crude oil, agricultural machinery, and certain vehicles.</p><p class=\"\">Domestic policy is now the main thing to watch as the tariff action between the U.S. and China continues to unfold, the Citi analysts said.</p><p class=\"\">At the next big policy event in March, the National People's Congress, they expect Beijing to stick to a framework targeting economic growth of \"around 5.0%\" this year. Government financing could be expanded, and monetary policy might require some tweaking given the central bank's determination to keep the yuan stable, they said. More rate cuts and lower reserve requirements for lenders are likely on the cards.</p><p class=\"\">Write to Singapore editors at singaporeeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002896:0-china-s-lunar-new-year-travel-spending-boom-offers-positive-signs/",
            "pub_date": "2025-02-05 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW08H:0",
            "title": "Stocks knocked by Alphabet earnings; gold hits record",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar loses out to yen, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold at record; Europe stocks helped by Novo Nordisk beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Global stocks fell on Wednesday, after disappointing earnings from Alphabet knocked Wall Street futures, while the dollar took a dive against the yen, which rallied sharply after Japanese wage data upped the chances of another rate hike.</p><p class=\"\">Investors shrugged off comments from President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.</p><p class=\"\">The suggestion came out of the blue and underlined the risk of more policy uncertainty and market volatility ahead. Gold hit another record high, driven mostly by a weaker dollar.</p><p class=\"\">In Europe, activity was dominated by a heavy day for earnings, where shares in Novo Nordisk , the most valuable company in the region, rose 4% after beating fourth-quarter expectations, which helped keep the STOXX 600  relatively steady on the day.</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area,\" Paul Donovan, chief economist at UBS Global Wealth Management, said.</p><p class=\"\">Volatility across markets has run high in the last few trading days after Trump announced he would slap tariffs on Canada and Mexico, only to back-pedal within hours and agree to a one-month delay.</p><p class=\"\">Some sense of calm returned by Wednesday, leaving investors to focus on more micro-led events, such as company earnings, where Google parent Alphabet missed forecasts as it ramped up spending on capex. Its shares fell 8% in premarket trading, suggesting a heavy fall after the opening bell later.</p><p class=\"\">S&amp;P 500 futures  fell 0.4% and Nasdaq futures  lost 0.5% in response. Results out on Wednesday include Uber, Ford, Qualcomm and Walt Disney.</p><p class=\"\">The delays to tariffs have eased concern about how much scope the Federal Reserve might have to cut interest rates this year, pushing Treasury yields lower, although with China and Europe still in Trump's sights, the mood was cautious.</p><p class=\"\">\"The period of doubt - during which worries about 'tariff risk' prevails in the market - is not over yet,\" Thierry Wizman, global FX and rates strategist at Macquarie said in a note. \"Traders may revisit those doubts in 30 days, as Trump tries to extract more concessions from Mexico and Canada, and then the EU.\" </p><p class=\"\">DOLLAR SOFTENS</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) were back at 4.224% and off a peak of 4.282% hit on Monday, which in turn took some sheen off the dollar. The U.S. currency is relatively flat so far this year against a basket of major currencies, having risen 7% in 2024.</p><p class=\"\">Chinese markets returned from a week-long break for the Lunar New Year holidays. China has, so far, made a relatively restrained response to Trump's additional 10% in tariffs, announcing levies that cover just $14 billion of U.S. exports.</p><p class=\"\">Beijing set a firm fix for its yuan, countering concerns it might allow the currency to slide to offset the impact of tariffs on its exports.</p><p class=\"\">Elsewhere in Asia, the Japanese yen  strengthened sharply against a range of currencies, after upbeat data on wages supported expectations of further tightening by the Bank of Japan this year.</p><p class=\"\">The dollar fell almost 1% against the yen to 152.875, while the euro  was down 0.6% at 159.18.</p><p class=\"\">Against the dollar, the euro rose 0.3% to $1.041 , having pulled off a two-year trough of $1.0125 at the start of the week. The dollar also fell 0.3% against the Canadian dollar to C$1.4282 , below this week's 22-year high at C$1.4792.</p><p class=\"\">In commodities, gold hit a fresh all-time high at $2,869.68 an ounce  aided in part by the pullback in the dollar and Treasury yields.</p><p class=\"\">Oil prices were weighed down by China's tariffs on imports of U.S. oil, which offset a potential boost from reports Trump had restored his \"maximum pressure\" campaign on Iran in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent  was down 0.7% to $75.67 a barrel, while U.S. crude  fell 0.65% to $72.23.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW08H:0-stocks-knocked-by-alphabet-earnings-gold-hits-record/",
            "pub_date": "2025-02-05 17:43:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW139:0",
            "title": "Trump vows to take over Gaza",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    President Donald Trump said the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere, shattering decades of U.S. policy on the Israeli-Palestinian conflict.</p><p class=\"\">The shock move drew swift condemnation from regional heavyweight Saudi Arabia which Trump hopes will establish ties with Israel.</p><p class=\"\">Israel's shekel currency was largely flat against the dollar on Wednesday, trading at 3.56 versus the dollar . Israeli and Lebanese sovereign bonds were flat to higher, while those of Jordan and Egypt were flat to lower.</p><p class=\"\">COMMENTS:</p><p class=\"\">MARTEN BRESSEL, PORTFOLIO MANAGER AND TRADER, FIM PARTNERS, LONDON:</p><p class=\"\">    \"There is a big question mark around how credible these statements (by Trump) are.\"     </p><p class=\"\">    \"There has been some moderate reaction though, \"specifically Jordan and Egypt (bonds) are down compared to the rest of high yield and Egypt's FX forwards are a bit weaker too.\"   </p><p class=\"\">    \"When you see days like this, with these kinds of headlines you have reactionary moves, but generally the momentum (in investor sentiment towards the Middle East following the political reshaping in recent months) has been positive.\"  </p><p class=\"\">MODI SHAFRIR, CHIEF STRATEGIST FOR FINANCIAL MARKETS, BANK HAPOALIM, TEL AVIV:</p><p class=\"\">\"The risks to Israel will decline in the short term and that’s good for the shekel and local markets and also since it appears the coalition will not fall apart.\"</p><p class=\"\">ALEX ZABEZHINSKY, CHIEF ECONOMIST, MEITAV DASH BROKERAGE, TEL AVIV:</p><p class=\"\">\"The markets are reacting in a subdued manner. The gap between the announced plans and their implementation is too great to react to the news in a meaningful way.\"</p><p class=\"\">PAUL DONOVAN, CHIEF ECONOMIST, UBS GLOBAL WEALTH MANAGEMENT, LONDON:</p><p class=\"\">\"Trump’s comments on Gaza and potential U.S. military occupation are not being taken seriously by investors. There may be ramifications in bringing about a broader peace settlement, and comments like these also possibly lessen the importance ascribed to other pronouncements - comments like tariffs being an obvious area.\"</p><p class=\"\">YONIE FANNING, CHIEF STRATEGIST, MIZRAHI TEFAHOT BANK, TEL AVIV:</p><p class=\"\">\"We're seeing a positive market response to the initiative, this morning in the shekel, and also and at the opening of the TASE (Tel Aviv stock exchange). The equity response being primarily centred around banks gives a good example on how such a geopolitical improvement could tame local risks and support the local economy.\"</p><p class=\"\">DAVID MAKOVSKY, DIRECTOR OF THE PROGRAM ON ARAN-ISRAEL RELATIONS, WASHINGTON INSTITUTE OF NEAR EAST POLICY (ON X):</p><p class=\"\">\"Until the WH (White House) press conference, (Trump's)</p><p class=\"\">call for moving Gazans was seen largely as a negotiating ploy: maximalist opening position before reaching a deal--standard operating approach. </p><p class=\"\">\"Is this still the case? If no longer true, there will be a clamour for the WH to provide more of a blueprint of his proposal on a variety of levels so it is not dismissed. Yet, in immediate sense, Trumps remarks seems to shift media focus away from question of Phase Two of Ceasefire that is supposed to begin later this month. Overlooked, with focus on Trump, is that PM @netanyahu made clear at the press conference Israel would resume the fight against Hamas.\"</p><p class=\"\">FRANCESCO PESOLE, FX STRATEGIST, ING, LONDON:</p><p class=\"\">\"Markets are treating Trump’s announced intention to take over the Gaza Strip and evacuate Palestinians to neighbouring countries with scepticism. Should we see hints that the U.S. is planning to deploy troops in the Middle East, the market implications can be risk-off, oil-positive and dollar-positive, as Arab nations should firmly oppose the move.\"</p><p class=\"\">ALVIN TAN, HEAD OF ASIA FX STRATEGY, RBC CAPITAL MARKETS, SINGAPORE:</p><p class=\"\">\"There’s no discernible reaction. I think in general people are quite skeptical. Number one, those comments came out of nowhere. It upends long standing US policy. In general people are thinking he was just making comments off the cuff and this is not likely to be followed up as genuine U.S. foreign policy.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW139:0-trump-vows-to-take-over-gaza/",
            "pub_date": "2025-02-05 17:43:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205005554:0",
            "title": "Amazon and Temu's owner sees stock-market pressure as U.S. Postal Service to stop accepting Chinese parcels",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Goldstein</p><p class=\"\">Shares of Amazon.com and PDD Holdings, the owner of popular Chinese shopping app Temu, fell on Wednesday after the U.S. Postal Service said it would stop accepting parcels from China and Hong Kong.</p><p class=\"\">The move comes after the U.S. imposed an additional 10% tariff on Chinese goods, and importantly, ended a customs exception for small-value parcels under $800 to enter the U.S. without paying tax.</p><p class=\"\">The Postal Service did not give an explanation for the move and did not quantify how long the \"temporary\" suspension would last.</p><p class=\"\">Amazon.com shares (AMZN) fell 2%. In last year's annual statement, Amazon said China-based sellers account for a significant portion of third-party seller services and advertising revenue. An e-commerce intelligence firm, Marketplace Pulse, said Chinese-based sellers account for nearly 50% of the top 10,000 sellers on Amazon in the U.S.</p><p class=\"\">PDD shares (PDD) fell 5% in premarket trade. Shein, another popular Chinese retailer, is not yet publicly traded as it contemplates an initial public offering.</p><p class=\"\">FedEx (FDX) and United Parcel Services (UPS), which could benefit from the Postal Service suspension, were little moved in premarket trade.</p><p class=\"\">-Steve Goldstein</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205005554:0/",
            "pub_date": "2025-02-05 17:45:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463925:0",
            "title": "Asia Optical, MetaOptics Technologies Partner for Innovative Meta Lens Products",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asia Optical  signed a memorandum of understanding with Singapore-based MetaOptics Technologies to collaborate on various initiatives involving innovative Meta Lens products. </p><p class=\"\">The partnership combines high-tech innovation with mass production capacity, according to a Wednesday Taiwan Exchange filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463925:0/",
            "pub_date": "2025-02-05 17:45:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002855:0",
            "title": "Credit Agricole Lifts Dividend After Hitting Growth Target a Year Early — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Pierre Bertrand</p><p class=\"\">Credit Agricole raised its dividend after exceeding its medium-term growth target a year ahead of schedule.</p><p class=\"\">The French lender said underlying profit last year surged to 7.17 billion euros ($7.44 billion) as it beat the financial targets it had set out for 2025 at its investor day in 2022. Credit Agricole targeted reaching more than 6 billion euros in underlying profit this year.</p><p class=\"\">The full-year result was helped by a fourth-quarter performance that beat analysts' expectations. Net profit rose to 1.69 billion euros  from 1.33 billion euros a year prior on revenue that surged 17% to 7.09 billion euros. Analysts had expected net profit of 1.36 billion euros on 6.58 billion euros of revenue, according to Visible Alpha consensus.</p><p class=\"\">The bank said it would propose a dividend of 1.10 euros a share for the year, a 5% increase from 2023.</p><p class=\"\">Credit Agricole said its results reflected the performance of its retail-banking and consumer-finance activities. Home-loan activity in France rose 18%, while its insurance business posted record premium income for the fourth quarter, it said.</p><p class=\"\">Revenue at its corporate and investment banking business rose 7.7% to its highest ever fourth-quarter level.</p><p class=\"\">Assets under management at the bank's asset gathering division rose 2.1% in the quarter, driven by strong net inflows. Managed assets by Credit Agricole's Amundi reached a new record of 2.24 billion euros at the end of December, after more than 20.5 billion euros in net inflows in the quarter, the highest since 2021.</p><p class=\"\">Credit Agricole said its underlying cost-income ratio for 2024 improved by 1 percentage point to 54.4%.</p><p class=\"\">Its common Tier 1 equity ratio--a measure of balance-sheet strength--stood at 11.7% at the end of 2024.</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002855:0-credit-agricole-lifts-dividend-after-hitting-growth-target-a-year-early-update/",
            "pub_date": "2025-02-05 17:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:ded7be68c094b:0",
            "title": "Accumulate Nestle India; target of Rs 2448: KR Choksey",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KR Choksey's research report on Nestle India</p><p class=\"\">For Q3FY25, NEST’s revenue increased 3.9% YoY (-6.4% QoQ) to INR 47,797 Mn, largely in line with our estimates by (-1.2%). EBITDA decreased 2.2% YoY (-7.1% QoQ) to INR 10,846 Mn, missed our estimates mainly due to higher-than-expected operating expenses. EBITDA margin contracted 143 bps YoY (-19 bps QoQ) to 22.7%. Adj. net profit decreased 11.5% YoY (-4.0% QoQ) to INR 6,877 Mn, missing our estimates mainly due to the cascading effect of lower EBITDA and higher than expected depreciation expenses. We lower our FY26E/FY27E EPS by 2.0%/2.0%, respectively, on the back of weaker-than-expected Q3FY25 performance and urban slowdown risks. However, long-term growth remains strong, supported by innovation, premiumization, capacity expansion, and ecommerce momentum. We expect Revenue/EBITDA/Adj. PAT to grow at a CAGR of 8.5%/8.7%/7.3%, respectively, over CY23-FY27E. The stock is currently trading at 60.6x/59.2x to our Adj.</p><p class=\"\">Outlook</p><p class=\"\">EPS estimate for FY26E/FY27E, respectively. We roll over our valuation to FY27E, assigning a P/E multiple of 63x on FY27E EPS of INR 38.9 (previously: 39.6), resulting in a target price of INR 2,448 (previously: 2,524). Subsequently, we maintain our ‘ACCUMULATE’ rating on the shares of Nestle India Ltd.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Nestle India - 05022025 - kr</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:ded7be68c094b:0-accumulate-nestle-india-target-of-rs-2448-kr-choksey/",
            "pub_date": "2025-02-05 17:36:32",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205002860:0",
            "title": "Santander Chair: Bank Is Very Committed to the U.K.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205002860:0/",
            "pub_date": "2025-02-05 17:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:9e62c05da094b:0",
            "title": "Bitdeer snaps up 101-megawatt Canada site as stock tanks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bitdeer has acquired a 101-megawatt site and gas-fired power project in Alberta, Canada, aiming to become a fully vertically integrated Bitcoin miner.</p><p class=\"\">A fully vertically integrated miner would mean Bitdeer maintains control of the important components of its Bitcoin (BTC) mining operations rather than relying on third parties for infrastructure services.</p><p class=\"\">The crypto mining firm said the deal gives it control over land, power generation, electrical and data center infrastructure, as well as its Sealminer A3 mining rigs. </p><p class=\"\">“It marks a significant step in our strategy to become the first fully vertically integrated Bitcoin miner, giving us unmatched control over costs, energy efficiency, and scalability,” Haris Basit, chief strategy officer at Bitdeer, said in a news release.</p><p class=\"\">Bitdeer is a crypto cloud mining firm out of Singapore with bases across multiple jurisdictions, including the US. It entered the Nasdaq exchange through a backdoor listing in April 2023 after completing a $1.18 billion merger with blank check firm Blue Safari Acquisition.</p><p class=\"\">Despite its expanding global footprint and Canada site acquisition, its stock has continued to struggle. Its shares have plunged 27.5% over the past month, including a 4.95% drop on Feb. 4, bucking the broader US market rally on the day. The three major indexes closed in the green, and rival crypto mining-related stocks, including CleanSpark, Riot Platforms and Terawulf, all posted gains.</p><p class=\"\">Meanwhile, investor sentiment is turning increasingly bearish. Short interest in Bitdeer surged from under 10 million shares in late November to 13.7 million by Jan. 15, while average daily trading volume has continued to decline.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:531.0285220397581px;max-width:1200px;aspect-ratio:2.259765625\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:9e62c05da094b-cb530855dd9de11407da8c020e347e44-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:9e62c05da094b-cb530855dd9de11407da8c020e347e44-resized.jpeg\" style=\"background-color:#f2f2f4\"/></picture></div></figure></span></p><p class=\"\">Bitcoin mining competition is expected to cool due to slower mining hardware rollouts. Bitcoin mining difficulty fell to 108.1 trillion on Jan. 27, marking the first reduction of 2025. </p><p class=\"\">In 2024, Bitcoin miners faced a 50% pay cut due to the quadrennial halving, which reduced Bitcoin rewards for verifying transactions from 6.25 BTC to 3.125 BTC per block. Some mining firms, including Bitdeer, have diversified into other industries, such as AI. Bitdeer reported $2.8 million in gross profit in the third quarter of 2024, down from $21.1 million from the year before.</p><p class=\"\">More recently, mining stocks declined alongside the AI industry after DeepSeek, a Chinese artificial intelligence model that performs on par with OpenAI, exploded to the top of Apple’s App Store. It claimed it could operate at significantly lower costs than its rivals. The development challenged assumptions about AI development costs and hardware reliance, impacting investor sentiment in both sectors.</p><p class=\"\">Magazine: Pectra hard fork explained — Will it get Ethereum back on track? </p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:9e62c05da094b:0-bitdeer-snaps-up-101-megawatt-canada-site-as-stock-tanks/",
            "pub_date": "2025-02-05 17:37:05",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309546:0",
            "title": "Toyota Motor's Fiscal Q3 Operating Profit Fall, Revenue Rises; Raises Fiscal 2025 Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor  reported fiscal Q3 operating profit Wednesday of 1.215 trillion Japanese yen ($79.49 billion), down from 1.681 trillion yen a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 1.43 trillion yen. </p><p class=\"\">Revenue for the quarter ended Dec. 10 was 12.391 trillion yen compared with $12.041 trillion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected 11.95 trillion yen. </p><p class=\"\">The company raised its operating profit guidance for fiscal 2025 to 4.7 trillion yen compared with 4.3 trillion yen previously. Analysts surveyed by FactSet expect 4.84 trillion yen. </p><p class=\"\">The company also increased revenue guidance for the year to 47 trillion yen from 46 trillion yen. Analysts polled by FactSet expect 47.15 trillion yen.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309546:0/",
            "pub_date": "2025-02-05 17:37:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309547:0",
            "title": "Novo Nordisk Q4 Earnings, Sales Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Novo Nordisk  reported Wednesday Q4 earnings of 6.34 Danish kroner ($0.88) per diluted share, up from 4.91 kroner a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 5.96 kroner. </p><p class=\"\">Sales for the quarter ended Dec. 31 were 85.68 billion kroner, up from 65.86 billion kroner a year earlier. </p><p class=\"\">Analysts polled by FactSet expected 80.7 billion kroner. </p><p class=\"\">For 2025, the company expects sales growth at constant exchange rates of 16% to 24%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309547:0/",
            "pub_date": "2025-02-05 17:38:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446719:0",
            "title": "German 10-Year Bund Yield Falls to 1-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Germany’s 10-year Bund yield fell to 2.36%, its lowest in about a month, as concerns grew that US tariffs could lead to deflationary pressures, prompting the European Central Bank (ECB) to potentially ease monetary policy further.</p><p class=\"\">As a result, money markets revised their expectations for the ECB’s deposit rate, lowering it to 1.87% by December.</p><p class=\"\">In economic news, Eurozone inflation rose to 2.5% in January, surpassing expectations, while core inflation remained steady at 2.7%.</p><p class=\"\">This signals persistent price pressures, although economic weakness in Germany and France raises speculation that the ECB may cut rates further.</p><p class=\"\">Meanwhile, China retaliated against US tariffs by imposing additional tariffs on US imports, escalating tensions after President Trump’s 10% tariff on Chinese goods.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446719:0-german-10-year-bund-yield-falls-to-1-month-low/",
            "pub_date": "2025-02-05 17:38:56",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        }
    ]
}