{
    "data": [
        {
            "id": "forexlive:1b0e37623094b:0",
            "title": "Financial Times: China’s exporters to step up offshoring to beat Trump’s tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">An additional 10 per cent tariff on Chinese exporters is due at 1201 US Eastern time on Tuesday, February 4, 2025:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Extra Trump tariffs on China are due to hit in a little over 5 hours</li><li class=\"listItem-bmN0_SHH\">USD strength has crept back in as China tariff implementation time nears</li><li class=\"listItem-bmN0_SHH\">Trump China tariffs - Trump says will talk with Xi “probably over the next 24 hours”</li></ul><p class=\"\">The Financial Times is gated, but here is the link if you can access it:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">China's exporters to step up offshoring</li></ul><p class=\"\">In brief:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Chinese manufacturers say they will speed up efforts to move production to other countries to circumvent US tariffs</li><li class=\"listItem-bmN0_SHH\">locations including the Middle East</li></ul><p class=\"\">Other strategies include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">passing the cost to US customers</li><li class=\"listItem-bmN0_SHH\">seeking alternative markets</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:1b0e37623094b:0-financial-times-china-s-exporters-to-step-up-offshoring-to-beat-trump-s-tariffs/",
            "pub_date": "2025-02-04 11:20:12",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "marketindex:815ebb1b6094b:0",
            "title": "ASX Dividend Stocks: A 20-30% yielder (that's not a dividend trap)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cue Energy shares soared 49% last February after announcing a strong 1H24 result, which included a special dividend of 2 cents per share (yielding approximately 17%)</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">The company remains debt-free, generating strong cash flows, with a $17.1 million cash balance and fully funded development activities across Australia, Indonesia, and New Zealand</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cue's dividend strategy remains uncertain, but further clarity is expected at its half-year result in February</li></ul></span></div><span><p class=\"\">I'm on a mission to uncover some of the ASX's most compelling dividend-paying stocks. The aim is to provide readers with the key data and forecasts to make more informed decisions. Today, we're reviewing Cue Energy – a microcap oil and gas producer and exploration company.</p><p class=\"\">Cue Energy  has production assets across Australia, Indonesia and New Zealand. In most cases, the company holds a minority interest in these projects, with producing sharing contracts in place.</p><p class=\"\">Key Stats</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Market cap: $73 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cash: $17.1 million (as at 31 December 2024)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enterprise value: $55.9 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">12-month performance: 66.6%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">12-month price range: 6.3 cents - 12 cents</p></li></ul><p class=\"\">Major Projects</p><p class=\"\">Australia:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Mereenie (7.5% interest): Gas field in the Northern Territory</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Palm Valley (15% interest): Gas field in the Northern Territory</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Dingo (15% interest): Gas field in the Northern Territory</p></li></ul><p class=\"\">Indonesia:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Mahato PSC: The PB field in this Production Sharing Contract is a significant contributor to Cue's results, generating $19.7 million in revenue in 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Sampang PSC (15% interest): Includes two producing fields, Oyong and Wortel gas fields, and a gas discovery at Paus Biru</p></li></ul><p class=\"\">New Zealand:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PMP 38160 (Maari/Manaia): Oil production from these fields averaged approximately 4,900 barrels of oil per day over the 2024 financial year</p></li></ul><p class=\"\">What Makes Cue Interesting</p><p class=\"\">Cue has been profitable for the past four years, though its share price remained largely flat between December 2020 and January 2024. It wasn’t until its half-year FY24 result (29 February 2024) that the stock experienced a significant re-rate. That report highlighted:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue up 22% to $29.3 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net profit after tax up 34% to $9.1 million</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Rapidly repaid $4 million in debt, now debt-free</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Issued special dividend of 2 cents per share (a yield of approximately 17%)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Activities planned for all assets over the next 12 months to increase production from existing oil and gas fields</p></li></ul><p class=\"\">Cue returned $14 million to shareholders through a special dividend, representing a payout ratio of 100% of first-half net profits, plus an additional $4.9 million from cash reserves. The strong financial performance and dividend announcement sent the stock soaring by 49% on the day.</p><p class=\"\">Six months later, Cue’s FY24 result included a final dividend of 1 cent per share (yield of approximately 10%). </p><p class=\"\">Despite recent volatility in oil and gas prices, Cue continues to report solid cash flows. The latest December quarter report revealed:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Net cash flow of $4.3 million </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Cash balance of $17.1 million </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">No debt</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Total production of 146.4kboe (1Q25: 147.3kboe)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Development activity fully funded</p></li></ul><p class=\"\">What's Next</p><p class=\"\">Cue has not outlined a formal capital management strategy, and its latest quarterly report provided only a broad outlook.</p><p class=\"\">“These milestones reflect our strategic focus on maintaining strong cash flow, advancing development projects, and positioning Cue for continued growth and shareholder returns,” said CEO Matthew Boyall.</p><p class=\"\">Despite this, 2024 marked a clear shift in the company’s strategic priorities, with the introduction of a significant dividend payout for shareholders. Cue is expected to clarify its dividend intentions at its upcoming half-year result in February.</p><p class=\"\">Cue is generating strong cash flow, growing production, and fully funding its development activities. The December quarter alone delivered a free cash flow yield of approximately 5.8%.</p><p class=\"\">A key risk to future capital returns is if Cue prioritises growth over shareholder returns. This could come in the form of M&amp;A, increased investment in existing projects, or higher capital expenditures.</p></span></div>",
            "link": "https://www.tradingview.com/news/marketindex:815ebb1b6094b:0-asx-dividend-stocks-a-20-30-yielder-that-s-not-a-dividend-trap/",
            "pub_date": "2025-02-04 11:20:45",
            "source": "Market Index",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446466:0",
            "title": "New Zealand Dollar Pares Losses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The New Zealand dollar traded around $0.561 on Tuesday, paring sharp losses from the previous session after US President Donald Trump paused tariffs on Mexico and Canada late Monday.</p><p class=\"\">Trump postponed the 25% tariffs on both countries by a month, raising hopes they could be avoided entirely.</p><p class=\"\">However, uncertainty remained as markets awaited details, with the Trump administration yet to engage with China on a possible reprieve from the additional 10% tariffs set to take effect later today.</p><p class=\"\">Meanwhile, the prospect of further rate cuts by the Reserve Bank of New Zealand pressured the currency, with markets anticipating a 50bps reduction to 3.75% this month and a policy rate bottom of 3% over the next 12 months.</p><p class=\"\">On the economic front, investors now await New Zealand’s Q4 jobless rate data, set for release on Wednesday, after Q3 figures reached their highest level since Q4 2020.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446466:0-new-zealand-dollar-pares-losses/",
            "pub_date": "2025-02-04 11:25:50",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:5a3bce6c5094b:0",
            "title": "Titagarh Rail enters shipbuilding and maritime business in a major diversification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Titagarh Rail Systems has announced plans to enters the strategic space of shipbuilding and maritime systems, in an effort to enhance its strong presence in railway related manufacturing, a company statement said on February 3.</p><p class=\"\">The company announced the addition of a new business vertical for Shipbuilding and Maritime Systems, wherein it will undertake \"marine business including shipbuilding, ship repair and other maritime business activities.\"</p><p class=\"\">The railway wagon maker has also set up a new business vertical for 'signaling and safety systems' for railways. \"This segment focuses on railway operations, particularly in ensuring safety and efficiency and will involve development and installation of products that enables smooth and secure train operations,\" said Titagarh Rail.</p><p class=\"\">Titagarh Rail has a market capitalization of Rs 12,200 crore, and the shares of the company are down 10% in last one year, and over 17% since the start of 2025. There was a sharp selloff in the shares of the company on Budget Day on February 1, possibly due to a muted capex announcement.This is being updated.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:5a3bce6c5094b:0-titagarh-rail-enters-shipbuilding-and-maritime-business-in-a-major-diversification/",
            "pub_date": "2025-02-04 11:26:17",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012064:0",
            "title": "Centurion Corp. Appears Well-Placed for Higher Rental Rates in Singapore — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Centurion Corp. looks well-placed to generate higher rental rates in Singapore given the dormitory supply shortage situation, RHB Research's Alfie Yeo says in a research report. Its purpose-built workers' accommodation bed rates in Singapore continue to be robust, and thanks to the demand-supply situation, RHB sees ongoing upward rental adjustments boosting its average bed rates. RHB lifts its 2025-2026 earnings estimates for the Singapore-listed manager of workers and student accommodations by 9% each year. RHB maintains the stock's buy rating and raises the stock's target price to S$1.16 from S$1.06. Shares are 0.5% higher at S$0.995. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012064:0/",
            "pub_date": "2025-02-04 11:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446467:0",
            "title": "Offshore Yuan Steady Amid Trade Deal Hopes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The offshore yuan held steady around 7.30 per dollar, after recovering  from a record low overnight, driven by optimism about a possible trade deal to avoid 10% tariffs on Chinese goods.</p><p class=\"\">However, uncertainty remains as Trump warned of substantial levies if no deal is reached.</p><p class=\"\">This aligns with a broader stabilization in major currencies following the temporary suspension of tariffs on Canada and Mexico.</p><p class=\"\">Meanwhile, the yuan faced  pressure as traders await China’s next daily reference rate, expecting authorities to loosen control and allow the currency to weaken if Trump’s tariffs take effect, especially as a strong dollar complicates efforts to stabilize it.</p><p class=\"\">Additionally, recent data showed China’s manufacturing activity slowed in January, missing expectations and marking the slowest growth in four months, adding pressure on Beijing to boost economic stimulus amid US tariffs.</p><p class=\"\">Investors are now eyeing upcoming additional PMI data and inflation figures next week.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446467:0-offshore-yuan-steady-amid-trade-deal-hopes/",
            "pub_date": "2025-02-04 11:27:17",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L3N3OO01L:0",
            "title": "KKR-Bain standoff tests Japan’s buyout patience",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Missteps were inevitable in Japan’s fledgling M&amp;A trade as foreign investors and listed companies work out best practices. But the slow grind between U.S. private equity rivals KKR  and Bain Capital for Fuji Soft , a $4 billion IT firm with chunky real estate assets, is anathema to Tokyo’s desire for efficient value-creating deals. The longer it drags on, the more it risks damaging foreign investors' reputations. </p><p class=\"\">The last six months have seen a preponderance of left feet and crushed toes. The first surprise came from Bain in September, when it floated a non-binding offer, about 5% above a binding one from KKR of 8,880 yen per share. Bain cast itself as a white knight and conditioned its promises to firm up a bid on a recommendation from Fuji Soft’s board.</p><p class=\"\">Fuji Soft's special committee demurred and stuck by KKR, who took the unusual move of splitting its tender offer into two successive parts. That allowed it to snap up a 34% stake from activist investors including 3D Investment Partners, who first solicited buyout offers in 2023. </p><p class=\"\">The plan was perhaps too clever by half, however. KKR bagged enough shares to block any rival takeover but is left holding a minority stake in a publicly listed company, a position through which it can't add much value. KKR subsequently raised both parts of its offer to 9,451 yen. Nonetheless, unconvinced investors have forced the buyout firm to extend the second tender offer three times, with the latest ending on Feb. 7. KKR even asked Fuji Soft to file an injunction against Bain, which expects to launch its bid at 9,600 yen this month even without management's support. </p><p class=\"\">For now, the share price continues to hover above the offer prices but there is also a time value to money. Japanese regulators ought to consider how they can hasten M&amp;A proceedings and whether introducing something akin to the UK's \"put up or shut up rule\" might help to give targets more certainty. It was only a decade ago that foreign private equity groups were seen as vultures, and one protracted messy deal could be a setback for everybody. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:766.1870503597123px;aspect-ratio:1.276978417266187\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OO01L-fd17aa77b65b88d6761dc6044e3d9147-resized.webp\" type=\"images/webp\"/><img alt=\"Line chart showing Fuji Soft share price and prices of binding offers from KKR and Bain\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L3N3OO01L-fd17aa77b65b88d6761dc6044e3d9147-resized.jpeg\" style=\"background-color:#fbfaf9\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Fuji Soft buyout drama grows long in the tooth</span></figcaption></figure></span></p><p class=\"\">Follow @KangHexin on X</p><p class=\"\">CONTEXT NEWS</p><p class=\"\">U.S. private equity group KKR on Jan. 24 extended the deadline for the second stage of a tender offer to take control of Fuji Soft, a Japanese software services company. </p><p class=\"\">The extension until Feb. 7 was the third in just over a month and left KKR’s offer price unchanged at 9,451 yen per share, below the stock’s latest close of 9,800 yen. The offer values the company's equity at $4.1 billion. KKR picked up its existing 34% stake in Fuji Soft in the first tender offer, which closed in November. </p><p class=\"\">Rival Bain Capital announced on Dec. 18 that it would pursue a take-private of Fuji Soft at 9,600 yen per share even without management's support. The two buyout firms have been sparring over the company since KKR first announced its binding offer at 8,800 per share in August.</p><p class=\"\">Activist 3D Investment Partners kicked off a sale process for Fuji Soft roughly a year earlier by soliciting take-private proposals and submitting them to the company's board. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L3N3OO01L:0-kkr-bain-standoff-tests-japan-s-buyout-patience/",
            "pub_date": "2025-02-04 11:27:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463131:0",
            "title": "Market Chatter: China's Shanxi Province Logs 19% Jump in 2024 Coal-Bed Methane Output",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The coal-bed methane output in China's Shanxi Province in 2024 jumped 18.9% year on year to a record high of 13.4 billion cubic meters, Yicai Global reported Monday, citing the provincial statistics bureau. </p><p class=\"\">The coal-bed methane or CBM, a coal byproduct, can be used as a clean energy source, reducing its risk as a cause for gas explosions in coal mines, the report said. </p><p class=\"\">Shanxi's CBM resources for 2024 accounted for 80.6% of China's total output, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463131:0/",
            "pub_date": "2025-02-04 11:30:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_P8N3L7080:0",
            "title": "Indonesia parliament passes law allowing for creation of Temasek-like investment arm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's parliament on Tuesday approved a bill that allows the government to set up an investment agency that can manage stakes in some of the biggest state companies and is intended to operate like Singapore's investment arm Temasek.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3L7080:0-indonesia-parliament-passes-law-allowing-for-creation-of-temasek-like-investment-arm/",
            "pub_date": "2025-02-04 11:18:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV044:0",
            "title": "Indonesian fund, Mitsui vie for $300 mln stake in toll operator RKE, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indonesia's sovereign wealth fund, Indonesia Investment Authority (INA), and Japan's Mitsui &amp; Co  are among prospective buyers of CVC Capital Partners' 25% stake in Indonesian toll road operator RKE International, valued at up to $300 million, two sources with knowledge of the matter said.</p><p class=\"\">CVC, a Luxembourg-based investment firm, initiated the sale process for its 25% stake in RKE International, also known as Road King Expressway International Holdings, late last year. The sale attracted interest from various financial investors and strategic companies, one of the sources added. </p><p class=\"\">The potential transaction could value CVC's stake at around $250 million to $300 million, or the whole company at up to $1 billion, both sources said. </p><p class=\"\">The remaining stake in RKE International is held by Hong Kong-listed property development and infrastructure group Road King Infrastructure .</p><p class=\"\">The sources declined to be named as the matter was private.</p><p class=\"\">CVC declined to comment. RKE International and Road King did not respond to emailed requests seeking comment. INA said it was unable to comment on the matter. Mitsui refrained from commenting on individual matters.</p><p class=\"\">The sale comes amid growing global investors' interest in infrastructure assets across Southeast Asia lured by the region's growth prospects and the sector's stable and long-term returns against the backdrop of global uncertainties.</p><p class=\"\">RKE International's current toll road portfolio consists of four Indonesian expressways spanning around 335 kilometers (208.2 miles) in total located in the provinces of Central Java, East Java and North Sumatra, according to Road King's website. </p><p class=\"\">In 2018, CVC invested 2 billion Hong Kong dollar ($256.7 million) into RKE International, which at that time had a portfolio of expressways in China, according to an announcement at that time. </p><p class=\"\">In November 2023, RKE International sold its Chinese expressway assets to Hong Kong-based Cornerstone Holdings Ltd. for 4.4 billion yuan ($606.8 million), according to stock exchange filings.</p><p class=\"\">($1 = 7.7918 Hong Kong dollars)</p><p class=\"\">($1 = 7.2507 Chinese yuan)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV044:0-indonesian-fund-mitsui-vie-for-300-mln-stake-in-toll-operator-rke-sources-say/",
            "pub_date": "2025-02-04 11:20:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463129:0",
            "title": "Jubilee Industries Extends Conditional Period for Disposal of Plastic Business",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jubilee Industries  wholly owned subsidiary, WE Total Engineering and Mclean agreed to extend the conditional period for the sale and purchase agreement for the sale of WE's plastic business for a period of one month to March 7. </p><p class=\"\">Under the agreement, conditions precedent were slated to be fulfilled by Feb. 7, according to a filing with the Singapore Exchange on Friday. </p><p class=\"\">In an earlier filing, WE Total Engineering agreed to sell its plastic business to MClean Technologies.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463129:0/",
            "pub_date": "2025-02-04 11:22:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463128:0",
            "title": "Nanoveu Appoints Siyuan Chen as Chief Financial Officer; Shares Up 9%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nanoveu  appointed Siyuan (Raymond) Chen as chief financial officer, effective immediately, the company said in a Tuesday Australian bourse filing. </p><p class=\"\">Chen, who succeeds Naomi Haydari, previously held senior positions at various Australian Securities Exchange-listed companies, including Iluka Resources , the filing said. </p><p class=\"\">Nanoveu's shares surged past 9% in recent Tuesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463128:0/",
            "pub_date": "2025-02-04 11:23:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:c3fdef4ae094b:0",
            "title": "DIIs all set to overtake FIIs in ownership race as gap narrows to record low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The ownership gap between foreign institutional investors (FIIs) and domestic institutional investors (DIIs) in Indian equities has shrunk to its lowest level ever in the December quarter, as FIIs continued to reduce their exposure while their domestic counterparts have been flush with liquidity.</p><p class=\"\">Foreign investor holdings in National Stock Exchange (NSE)-listed companies fell to a 12-year low of 17.23 percent. Meanwhile, growing domestic investor participation has pushed overall domestic holdings to 16.9 percent, with domestic mutual funds reaching an all-time high of 9.93 percent.</p><p class=\"\">At the end of the December quarter, the gap between FII and DII ownership of Indian equities stood at just 0.3 percentage points, a sharp decline from the 10.3 percentage points gap recorded in March 2015 -- when foreign holdings were more than double that of domestic investors, as per data from PrimeInfobase.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:600px;aspect-ratio:1\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/moneycontrol:c3fdef4ae094b-2163ba251e05c70e42d2e766e32b80f0-resized.webp\" type=\"images/webp\"/><img alt=\"foreign-and-dii-gap R\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/moneycontrol:c3fdef4ae094b-2163ba251e05c70e42d2e766e32b80f0-resized.jpeg\" style=\"background-color:#071d2f\"/></picture></div></figure></span></p><p class=\"\">With this, DIIs now hold nearly as much of Indian equities as FIIs. The assets under custody (AUC) for FIIs stood at Rs 74.91 lakh crore, declining from Rs 81.88 lakh crore in the September quarter. Meanwhile, DIIs’ AUC stood at Rs 73.47 lakh crore, down from Rs 76.78 lakh crore in the previous quarter.</p><p class=\"\">During the quarter, FIIs sold Indian shares worth Rs 1.56 lakh crore in secondary markets while purchasing Rs 55,582 crore in primary markets. In contrast, domestic institutions, including mutual funds and other financial entities, bought shares worth Rs 1.86 lakh crore, according to Bloomberg data.</p><p class=\"\">Both benchmark indices, Sensex and Nifty, declined by 8.7 percent and 9.7 percent, respectively, during the December quarter.</p><p class=\"\">On a different note, private promoter holdings declined to 41.08 percent, driven by stake sales amid bullish market conditions. Retail investor participation surged to a record high of 7.69 percent, while high-net-worth investor (HNI) participation reached a three-year high of 2.09 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:c3fdef4ae094b:0-diis-all-set-to-overtake-fiis-in-ownership-race-as-gap-narrows-to-record-low/",
            "pub_date": "2025-02-04 11:11:35",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463126:0",
            "title": "CapitaLand Investment Acquires Site for First Data Center in Japan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CapitaLand Investment  acquired a freehold land parcel in Osaka, Japan, to develop its first data center in the country, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">The development entails a total investment of more than $700 million with a power capacity of 50 megawatts. </p><p class=\"\">The company currently has 27 data centers across Asia and Europe, with assets under management of around SG$6 billion. </p><p class=\"\">Shares of the company were up over 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463126:0/",
            "pub_date": "2025-02-04 11:15:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV029:0",
            "title": "Gold prices hold near record highs as US tariff concerns linger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Trump pauses tariffs on Mexico and Canada, but not China</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hit record high at $2,830.49 on Monday</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Near-term gold price projection target at $2,874- analyst</li></ul></span></div><span><p class=\"\">    Gold prices firmed on Tuesday, holding near a record peak hit in the previous session, as lingering U.S. tariff and inflation concerns boosted safe-haven demand, while focus was also on key jobs data due this week. </p><p class=\"\">Spot gold  was up 0.3% to $2,820.69 per ounce by 0252 GMT, after hitting a record high of $2,830.49 in the last session. </p><p class=\"\">U.S. gold futures  fell 0.2% to $2,852.70.</p><p class=\"\">U.S. President Donald Trump suspended tariffs on Mexico and Canada on Monday, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two countries, while levies on Chinese goods are due to start later in the day. The market perceives Trump's tariff policies as inflationary.</p><p class=\"\">\"In the current highly dynamic environment, where market volatility and policy flip-flops are likely to dominate, gold prices may continue to stay supported,\" IG market strategist Yeap Jun Rong said. </p><p class=\"\">\"With near-term price projection target at the $2,874 level, followed by the psychological $3,000 level.\" </p><p class=\"\">     Bullion is traditionally considered a hedge against both inflation and geopolitical uncertainty.</p><p class=\"\">Meanwhile, global bullion banks are flying gold into the United States from trading hubs catering to Asian consumers, including Dubai and Hong Kong, to capitalize on the unusually high premium that U.S. gold futures are enjoying over spot prices.</p><p class=\"\">Also, on investor radar this week include a series of U.S. jobs data, which include U.S. job openings data due later in the day, ADP employment report on Wednesday and payrolls report on Friday. </p><p class=\"\">Among other metals, spot silver  edged higher 0.2% to $31.61 per ounce, platinum  added 0.7% to $970.80, and palladium  gained 1% to $1,019.31. </p><p class=\"\">In the top gold consumer China markets were closed for the Lunar New Year holiday and will resume trade on Wednesday. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV029:0-gold-prices-hold-near-record-highs-as-us-tariff-concerns-linger/",
            "pub_date": "2025-02-04 11:16:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:fca6dddf8094b:0",
            "title": "Ethereum Price Recovery Stalls at Resistance: Can Bulls Break Through?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>Ethereum price started a recovery wave above the $2,500 zone. ETH is up nearly 10% and now faces a major resistance near $2,920.</em></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Ethereum started a decent upward move above the $2,500 support zone.</li><li class=\"listItem-bmN0_SHH\">The price is trading below $2,900 and the 100-hourly Simple Moving Average.</li><li class=\"listItem-bmN0_SHH\">There is a key bearish trend line forming with resistance at $2,920 on the hourly chart of ETH/USD (data feed via Kraken).</li><li class=\"listItem-bmN0_SHH\">The pair could start a fresh decline if it stays below the $2,920 level.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Ethereum Price Attempts Recovery</strong></p><p class=\"\">Ethereum price started a major decline below the $2,800 level, underperforming Bitcoin. ETH declined below the $2,650 and $2,500 levels to enter a bearish zone.</p><p class=\"\">There was a clear move below the $2,200 level. The price declined over 25% and tested the $2,120 zone. A low was formed at $2,127 and the price recently started a fresh upward move. There was an increase above the $2,500 level.</p><p class=\"\">The price surpassed the 50% Fib retracement level of the downward move from the $3,403 wing high to the $2,127 swing low. However, the bears are now active near the $2,900 zone. There is also a key bearish trend line forming with resistance at $2,920 on the hourly chart of ETH/USD.</p><p class=\"\">Ethereum price is now trading below $2,900 and the 100-hourly Simple Moving Average. On the upside, the price seems to be facing hurdles near the $2,900 level. The first major resistance is near the $2,920 level and the trend line or the 61.8% Fib retracement level of the downward move from the $3,403 wing high to the $2,127 swing low.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:560.4359673024524px;max-width:1200px;aspect-ratio:2.1411901983663943\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:fca6dddf8094b-2831060808769c51c5865a014c8c5d6d-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:fca6dddf8094b-2831060808769c51c5865a014c8c5d6d-resized.jpeg\" style=\"background-color:#f7f5f6\"/></picture></div></figure></span><p class=\"\">The main resistance is now forming near $3,000. A clear move above the $3,000 resistance might send the price toward the $3,120 resistance. An upside break above the $3,120 resistance might call for more gains in the coming sessions. In the stated case, Ether could rise toward the $3,250 resistance zone or even $3,320 in the near term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Another Drop In ETH?</strong></p><p class=\"\">If Ethereum fails to clear the $2,900 resistance, it could start another decline. Initial support on the downside is near the $2,765 level. The first major support sits near the $2,650.</p><p class=\"\">A clear move below the $2,650 support might push the price toward the $2,500 support. Any more losses might send the price toward the $2,420 support level in the near term. The next key support sits at $2,350.</p><p class=\"\">Technical Indicators</p><p class=\"\">Hourly MACD<strong class=\"root-Tkn6WL2y\"> – </strong>The MACD for ETH/USD is gaining momentum in the bullish zone.</p><p class=\"\">Hourly RSI<strong class=\"root-Tkn6WL2y\"> – </strong>The RSI for ETH/USD is now above the 50 zone.</p><p class=\"\">Major Support Level – $2,765</p><p class=\"\">Major Resistance Level – $2,920</p></span></div>",
            "link": "https://www.tradingview.com/news/newsbtc:fca6dddf8094b:0-ethereum-price-recovery-stalls-at-resistance-can-bulls-break-through/",
            "pub_date": "2025-02-04 11:18:22",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446465:0",
            "title": "Japanese Yen Remains Under Pressure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Japanese yen fell past 155 per dollar on Tuesday, struggling to regain momentum as the suspension of U.S. tariffs on Mexico and Canada reduced demand for the safe-haven currency.</p><p class=\"\">On Monday, U.S. President Donald Trump agreed to “immediately pause” planned tariffs on Mexico and Canada for a month after successful negotiations with their respective leaders.</p><p class=\"\">Markets are also becoming more optimistic that the U.S. and China could strike a deal to prevent the 10% tariffs on Chinese imports set to take effect later today.</p><p class=\"\">In Japan, investors are focusing on Wednesday's release of wage figures, which could impact the outlook for the Bank of Japan's monetary policy.</p><p class=\"\">The BOJ raised interest rates in January and has signaled its readiness to hike rates further if economic and price trends align with forecasts.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446465:0-japanese-yen-remains-under-pressure/",
            "pub_date": "2025-02-04 11:19:01",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463127:0",
            "title": "Kia's January Sales Decline on Lackluster Domestic Demand; Shares Rise 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kia's  global sales decreased 2.4% to 239,571 units in January from 245,586 vehicles sold in the same month the year before, the automaker said Monday. </p><p class=\"\">Sales in the country declined 13.9% to 38,403 units in the month from 44,608 units in January 2024, while sales abroad rose marginally by 0.1% to 200,993 from 200,794 during the period. Sales of special purpose vehicles fell 4.9% to 175 from 184 units. </p><p class=\"\">Shares of Kia rose nearly 3% in recent trade on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463127:0/",
            "pub_date": "2025-02-04 11:19:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV01M:0",
            "title": "Japan's Nikkei bounces as US tariff pause eases market concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Japan's Nikkei share average rebounded on Tuesday as concerns around U.S. tariffs eased after President Donald Trump suspended his threat of steep tariffs on Mexico and Canada, helping battered automakers recover.</p><p class=\"\">The Nikkei  gained 1.6% to 39,140.41 as of the midday break as investors bought back shares after the benchmark index logged its worst session in four months on Monday. The broader Topix  added 1.4% to sit at 2,757.47.</p><p class=\"\">    Trump agreed to a 30-day pause before engaging in further negotiations with neighbouring Canada and Mexico, alleviating immediate fears that rattled global markets on Monday.</p><p class=\"\">Among stocks rallying on Tuesday were Japanese automakers, which took a hit in the last session as investors weighed how tariffs on Mexico might impact auto production. Several automakers have factories in Mexico.</p><p class=\"\">The auto sub-index  rebounded, climbing 2.3% to be one of the top performers among the Tokyo Stock Exchange's 33 industry groups.</p><p class=\"\">However, uncertainties over the implications of the tariffs going forward remained.</p><p class=\"\">Kazuo Kamitani, an equities strategist at Nomura Securities, noted that while Toyota  recovered some degree of Monday's losses in early trade, major Japanese automakers didn't rise as much as expected.</p><p class=\"\">\"Considering that we're still looking at a trade war in one month, it might be difficult for Toyota to see a more significant bounce back,\" he said.</p><p class=\"\">Toyota Motor was last up 2.9%.</p><p class=\"\">Along with lingering questions about U.S. tariffs on Canada and Mexico, trade barriers on China are still due to take effect within hours.</p><p class=\"\">Among individual stocks, domestic company revenue reports created some of the biggest percentage winners and losers on the Nikkei.</p><p class=\"\">Ceramics maker Kyocera  soared 9% and Murata Manufacturing  jumped 5.8%. Mitsubishi Motors  slid 13.1% to the bottom of the pack.</p><p class=\"\">Of the Nikkei's 225 constituents, 189 rose and 35 declined. One share was untraded.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV01M:0-japan-s-nikkei-bounces-as-us-tariff-pause-eases-market-concerns/",
            "pub_date": "2025-02-04 11:11:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4DKddk:0",
            "title": "MAG Silver Appoints John Armstrong to the Board of Directors as Part of Planned Board Refreshment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, British Columbia, Feb.  03, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">MAG Silver Corp. (TSX / NYSE American: MAG) </strong>(“MAG” or “MAG Silver”) announces the appointment of John Armstrong to the Board of Directors, effective January 31, 2025, as part of MAG’s planned Board refreshment.</p><p class=\"\">“We are very pleased to welcome John to our Board,” said Peter Barnes, Chair of the Board. <!-- -->“With extensive leadership experience and a strong track record in capital markets, strategic planning and capital allocation, John brings significant value as we continue to advance MAG’s strategic priorities. We believe that his broad network within the mining sector coupled with his familiarity with MAG and Juanicipio, will provide valuable insights as we continue to drive the Company forward.”</p><p class=\"\">Mr. Barnes added: <!-- -->“John’s appointment comes following a comprehensive, externally facilitated search process focussed on a diverse pool of candidates. Our Board is committed to fostering greater diversity, and while we focused on identifying candidates from varied backgrounds, we ultimately selected John because his expertise, leadership and vision aligned perfectly with the strategic direction of the Company.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About John Armstrong</strong></p><p class=\"\">Mr. Armstrong is currently CEO of Versamet Royalties, a private metals royalty and streaming company. Prior to Versamet, he spent many years with BMO Financial Group. Most recently, he held the position of Deputy Head of Investment Banking, BMO Capital Markets where he was responsible for shaping and executing the firm’s investment banking strategy across its various industry verticals, and delivering corporate finance (equity underwriting, debt underwriting and corporate lending) and advisory solutions to clients.</p><p class=\"\">John holds a Bachelor of Commerce from the Sauder School of Business at the University of British Columbia and an MBA with Honours from the Rotman School of Management at the University of Toronto.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About MAG Silver Corp. (</strong><strong class=\"root-Tkn6WL2y\">www.magsilver.com</strong><strong class=\"root-Tkn6WL2y\">) </strong></p><p class=\"\">MAG Silver Corp. is a growth-oriented Canadian mining and exploration company focused on advancing high-grade, district scale precious metals projects in the Americas. MAG is a top-tier primary silver mining company through its (44%) joint venture interest in the 4,000 tonnes per day Juanicipio Mine, operated by Fresnillo plc (56%). The mine is located in the Fresnillo Silver Trend in Mexico, the world's premier silver mining camp, where in addition to mining and processing operations, an expanded exploration program is in place targeting multiple highly prospective targets. MAG is also executing multi-phase exploration programs at the 100% earn-in Deer Trail Project in Utah and the 100% owned Larder Project, located in the historically prolific Abitibi region of Canada.</p><p class=\"\">Neither the Toronto Stock Exchange nor the NYSE American has reviewed or accepted responsibility for the accuracy or adequacy of this press release, which has been prepared by management.</p><p class=\"\">This release includes certain statements that may be deemed to be “forward-looking statements” within the meaning of the US Private Securities Litigation Reform Act of 1995 or “forward-looking information” within the meaning of applicable Canadian securities legislation (collectively, “forward-looking statements”), <!-- -->including statements that address our expectations with respect to the timing of, and changes to, the Company’s Board of Directors. All statements in this release, other than statements of historical facts are forward-looking statements. Forward-looking statements are often, but not always, identified by the use of words such as \"seek\", \"anticipate\", \"plan\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"project\", \"predict\", \"potential\", \"targeting\", \"intend\", \"could\", \"might\", \"should\", \"believe\" and similar expressions. These statements involve known and unknown risks, uncertainties and other factors that may cause actual results or events to differ materially from those anticipated in such forward-looking statements. Factors that could cause actual results to differ materially from those in the forward-looking statements identified herein include, but are not limited to, changes in applicable laws, continued availability of capital and financing, and general economic, market or business conditions, political risk, currency risk and capital cost inflation. In addition, forward-looking statements are subject to various risks, including those risks disclosed in MAG Silver’s filings with the Securities Exchange Commission (the “SEC”) and Canadian securities regulators. All forward-looking statements contained herein are made as at the date hereof and MAG Silver undertakes no obligation to update the forward-looking statements contained herein. There is no certainty that any forward-looking statement will come to pass, and investors should not place undue reliance upon forward-looking statements.</p><p class=\"\">Please Note: Investors are urged to consider closely the disclosures in MAG's annual and quarterly reports and other public filings, accessible through the internet at <em>www.sedar.com</em><em> and </em><em>www.sec.gov</em><em>. </em></p><p class=\"\">For further information on behalf of MAG Silver Corp.</p><p class=\"\">Contact Fausto Di Trapani, Chief Financial Officer</p><p class=\"\">Phone: (604) 630-1399</p><p class=\"\">Toll Free: (866) 630-1399</p><p class=\"\">Website: www.magsilver.com</p><p class=\"\">Email: info@magsilver.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4DKddk:0-mag-silver-appoints-john-armstrong-to-the-board-of-directors-as-part-of-planned-board-refreshment/",
            "pub_date": "2025-02-04 11:11:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012051:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0312 GMT - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">0250 GMT - Thailand's consumer-price index in January likely rose 1.3% on year, according to the median estimate of seven economists surveyed by The Wall Street Journal. That would compare with December's 1.23% increase. Inflation may have been driven by several factors, including a low base effect and rising energy prices, says DBS's economics team. Consumer inflation is expected to align with the Bank of Thailand's projections for headline inflation to stabilize around the lower bound of its 1%-3% target range, DBS adds. The data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0241 GMT - The likelihood of U.S. tariffs on Mexico and Canada is higher despite the delay in the implementation, Nomura analysts say in a research note. Canada and Mexico could \"reach a deal with the U.S. to either avert tariffs or soften the blow by securing conditional exemptions,\" they say. However, the analysts note that Trump previously said there was nothing that targeted countries could do to avoid higher tariffs. \"If these tariffs fully take effect, their size will dwarf the entirety of the tariffs Trump imposed during his first term in office,\" they write, adding, \"higher tariffs are likely to push up core inflation meaningfully, which reinforces our Fed call of no rate cuts this year.\" (sherry.qin@wsj.com)</p><p class=\"\">0234 GMT - Indonesia's inflation may rise post-February as electricity discounts phase out and consumption recovers, CGS International economists Wisnu Trihatmojo and Nazmi Idrus say in a note. However, they anticipate that volatile inflation could stay under control due to a stronger harvest this year, supported by improved weather conditions and increased fertilizer availability. Given the revised VAT hike to only include luxury goods and a softer consumption environment, they lower the year-end inflation forecast to 2.7% from 3.2%. The overall inflation outlook may remain conducive to Bank Indonesia's monetary easing, with expectations for a 5% BI rate by end-2025, down from the current 5.75%, they add. (yingxian.wong@wsj.com)</p><p class=\"\">0227 GMT - Consumer prices in the Philippines likely rose 2.7% on year in January, according to the median forecast of seven economists polled by The Wall Street Journal. That would compare with a 2.9% increase in December. Headline inflation likely cooled due to falling retail prices for rice and easing electricity prices, HSBC's global economics team says in a report. Looking ahead, HSBC expects government efforts to manage rice supply to bring overall inflation down in the next few months. In December, the BSP cut its rates for the third time in 2024 amid low inflation and slowing economic growth. The CPI data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0215 GMT - The U.S. dollar is likely to maintain its safe-haven status in 1H 2025, DBS Group Research's Philip Wee says in a commentary. Trade uncertainties loom despite the U.S. delaying tariffs on Canada and Mexico, the senior FX strategist says, adding there's potential volatility in markets from President Trump's unpredictability. Meanwhile, Trump has given notice that the European Union was next in line for U.S. tariffs, Wee notes. Also, there was no 30-day reprieve for additional 10% tariff on Chinese imports, with markets awaiting responses from Chinese President Xi, Wee says. The USD Index is 0.3% lower at 108.64. (ronnie.harui@wsj.com)</p><p class=\"\">0155 GMT - The drop in Indonesia's inflation below the central bank's target to the lowest since 2000 is likely to be short-lived, Maybank analysts say. A temporary discount in electricity tariffs was the main factor behind the outsized fall and volatile food inflation may strengthen in the coming months amid rising demand during the Ramadan season, Brian Lee Shun Rong and Chua Hak Bin say. They stick to their call for 2025 headline inflation at 2.6% and 50 bps of rate cuts but note significant uncertainty over whether Bank Indonesia will be able to cut in February, given the need to support the rupiah. The rupiah has weakened 0.8% since BI's January meeting, and U.S. tariff news is buoying the dollar and affecting emerging market currencies, they add. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0153 GMT - The yen weakens against most other G-10 and Asian currencies during the morning session as sentiment toward risky assets rebounds after the U.S. paused tariffs on Canada and Mexico for a month. \"Risk sentiment has improved markedly,\" say two members of TD Securities' Global Rates, FX &amp; Commodities Strategy in a note. However, \"we'd caution that trade concerns could start to weigh on markets again if there are no tangible signs of progress on a lasting deal by the end of the month,\" the members add. USD/JPY rises 0.3% to 155.20; SGD/JPY gains 0.3% to 114.07. (ronnie.harui@wsj.com)</p><p class=\"\">0144 GMT - JGBs fall in price terms during the morning Tokyo session after the U.S. paused tariffs on Canada and Mexico for a month, possibly spurring investors to shift capital out of safe-haven sovereign debt into riskier assets such as equities. With Japan's Finance Ministry auctioning 2.6 trillion yen of 10-year JGBs today, there could be some investor demand, Citi Research's Tomohisa Fujiki says in a research report. However, it appears difficult to build long positions on expectations of price upsides in these circumstances, the rates strategist adds, noting the future of tariffs on Japan is uncertain. The 10-year JGB yield is up 1.5bps at 1.260%.(ronnie.harui@wsj.com)</p><p class=\"\">0122 GMT - The postponement of U.S. tariffs on Mexico and Canada on last-minute deals turns focus to the fate of impending tariffs on China, says Vishnu Varathan at Mizuho Securities. Eyes are on potential talks between Trump and Xi that could result in a similar delay, he says. CNH has assumed this deal, pulling back to 7.31 from Monday's highs, but a U.S.-China trade resolution will be far more fraught than with Mexico and Canada, he says. Downside risks in CNH could prove harder to shake. Relief is not resolution, and Trump has warned tariff plans are intact, he adds. Markets are in for a bumpy ride, with currencies the most sensitive to tariff threats. \"EUR, CNH, AUD, KRW, THB and MYR remain on the line,\" he says. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">0121 GMT - Bank Indonesia is likely to be cautious in its policymaking, prioritizing end-2025 inflation risks over near-term trends, BofA Securities economists Kai Wei Ang and Rahul Bajoria say in a note. Indonesia's January inflation was sharply below expectations at 0.76% due to an underestimated electricity discount, they say, adding that excluding this factor, inflation would have been 2.2% as underlying pressures rise from food price hikes and rupiah volatility. Given recent currency movements and inflationary pressures, a February rate cut appears unlikely, they reckon. BI may ease policy further in 2Q if the rupiah stabilizes and inflation risks subside, they add. BofA cuts its Indonesia 2025 average inflation forecast to 2.1% from 2.3% but raises its year-end estimate to 2.7% from 2.5%. (yingxian.wong@wsj.com)</p><p class=\"\">0036 GMT - The significant uncertainty around U.S. tariff plans may cause headwinds to Hong Kong's GDP growth, Goldman Sachs economists say. Preliminary figures for the city's 4Q GDP growth came in slightly above consensus expectations, with the GS economists attributing the increase in on-year growth to a smaller drag from private consumption and improved trade balance. \"A stronger starting point would imply a higher 2025 full-year GDP growth,\" they say, but trade uncertainty looms. Taken together, GS raises its 2025 real GDP growth forecast for Hong Kong slightly to 2.2% from 2.0%. Full GDP data is due on Feb. 26 when the next budget is announced. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012051:0/",
            "pub_date": "2025-02-04 11:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012047:0",
            "title": "China AI Threat Drives Flight to Quality — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012047:0/",
            "pub_date": "2025-02-04 11:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463120:0",
            "title": "Keppel Pacific Oak US REIT's Income Available for Distribution Down 9% in H2 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel Pacific Oak US REIT's  income available for distribution for the second half of 2024 was down nearly 9% to $23.8 million from $26.1 million a year earlier, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">Net property income declined 14% to $36.3 million from $42.2 million in the comparable period. </p><p class=\"\">Gross revenue was down 3.7% year over year to $72.1 million from $74.8 million. </p><p class=\"\">Portfolio committed occupancy increased to 90% as of Dec. 31, 2024. </p><p class=\"\">Shares of the trust were up over 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463120:0/",
            "pub_date": "2025-02-04 11:12:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463124:0",
            "title": "Battery Age Minerals Raises Nearly AU$2 Million via Share Placement; Shares Hit All-Time Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Battery Age Minerals  received firm commitments to raise AU$1.5 million through the placement of 18.3 million shares at AU$0.082 apiece, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The company's directors and management subscribed for a total of AU$210,000 under the placement, subject to shareholder approval at a general meeting in late March, the filing said. </p><p class=\"\">Proceeds will be used to advance the company's El Aguila Project in Argentina, according to the filing. </p><p class=\"\">Shares plunged 18% in afternoon trade Tuesday after earlier hit an all-time low.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463124:0/",
            "pub_date": "2025-02-04 11:12:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012054:0",
            "title": "Palm Oil Falls; Slower Output May Provide Support — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012054:0/",
            "pub_date": "2025-02-04 11:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463125:0",
            "title": "Southern Score Builders to Pay Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Southern Score Builders  will pay a single-tier interim dividend of 0.01 ringgit per share for the financial year ending June 30. </p><p class=\"\">The dividend is payable on Feb. 28 to shareholders on record of Feb. 19, according to a Monday Malaysian bourse filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463125:0/",
            "pub_date": "2025-02-04 11:13:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "smallcaps:91140123d094b:0",
            "title": "Wellnex Life expands global reach with UK market entry and new product approval",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wellnex Life  has achieved another breakthrough in its expansion plans with a new market authorisation (MA) for its liquid paracetamol plus caffeine soft gel. The MA comes after Wellnex made a successful submission to Australia’s Therapeutic Goods Administration for the latest addition to its product range. The company had previously been granted MAs for liquid paracetamol, liquid paracetamol plus ibuprofen and liquid mini-ibuprofen. International interest Managing director Zack Bozinovski said the approval would further drive revenue opportunities for Wellnex Life, with its existing MAs being utilised by domestic and international companies such as Chemist Warehouse and Haleon. The company views the four MAs as a validation of its philosophy of being either ‘first’ or ‘fast’ to market with innovative consumer health products. “The approval of liquid paracetamol plus caffeine soft gel market authorisation is a great testament to the company and its internal capabilities,” Mr Bozinovski said. “This unique product will provide opportunities not only for use in the company’s own brands but also to licence it to third parties.” UK market order Wellnex Life recently continued its global expansion with the delivery of its TGA-registered paracetamol soft gel liquid analgesic to Haleon and the UK market, building on the product’s successful Australian market launch in FY23. The company signed a supply agreement in March 2022 for the soft gel paracetamol to be retailed under Haleon’s pain relief brand in Australia and New Zealand. Wellnex Life also continues to progress its proposed dual listing on the London Stock Exchange, with clear advancement of work streams required to commence the marketing campaign in the UK. Leading UK-based broker SP Angel has been appointed as joint broker to the UK raise, along with Orana, which is being supported by Australian-based Barclay Pearce Capital. Pain Away acquisition On the local front, Wellnex Life has recently acquired leading Australian topical pain relief brand Pain Away. The company believes the acquisition will both complement and accelerate the potential growth of the company’s business operations. “This transformational acquisition gives added impetus to Wellnex Life’s financial growth and scale and reinforces its place as a major and respected participant in the growing healthcare market, both in Australia and overseas,” Mr Bozinovski said.</p></span></div>",
            "link": "https://www.tradingview.com/news/smallcaps:91140123d094b:0-wellnex-life-expands-global-reach-with-uk-market-entry-and-new-product-approval/",
            "pub_date": "2025-02-04 11:06:36",
            "source": "Small Caps",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463116:0",
            "title": "Keppel Infrastructure Trust Reports 29% Drop in H2 2024 Attributable Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Keppel Infrastructure Trust's  profit attributable to unitholders declined 29% to SG$52.2 million in the second half of 2024 from SG$73.5 million a year earlier, a filing with the Singapore Exchange said on Tuesday. </p><p class=\"\">Earnings per unit declined to SG$0.0088 from SG$0.0131 a year ago. </p><p class=\"\">Revenue was up 25% year over year to SG$1.21 billion from SG$972.3 billion in the year-ago period. </p><p class=\"\">Assets under management grew by 22% to SG$9.0 billion as at Dec. 31, 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463116:0/",
            "pub_date": "2025-02-04 11:07:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463123:0",
            "title": "Widgie Nickel Expands Western Australia Gold Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Widgie Nickel  found 3.1 grams per tonne grade of gold from a recent drilling at the Butchers Creek project in Western Australia, according to a Tuesday filing with the Australian bourse. </p><p class=\"\">The findings suggest further upside for the project, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463123:0/",
            "pub_date": "2025-02-04 11:08:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV06L:0",
            "title": "Australia's Perenti gains on underground mining contract in US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Perenti  rises 2.5% to A$1.4100, highest since Jan. 15</p><p class=\"\">** Diversified mining services co says its underground mining business signed A$120 mln ($74.5 mln) contract with U.S.-based Nevada Gold Mines, a joint venture between Barrick Gold  and Newmont Corporation  </p><p class=\"\">** PRN's mining business will undertake development of Nevada Gold Mines at its Goldrush Project</p><p class=\"\">** Stock gains 0.9% YTD</p><p class=\"\">($1 = A$1.6106)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV06L:0-australia-s-perenti-gains-on-underground-mining-contract-in-us/",
            "pub_date": "2025-02-04 11:08:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}