{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463620:0",
            "title": "BlinkLab Brings First Clinical Site on Board for Autism Diagnostic Registrational Trial, Shares Rise 10%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlinkLab  said PriMED Clinical Research in Ohio became the first site to join the initial phase of the firm's US-based autism diagnostic registrational trial, according to a Wednesday Australian bourse filing. </p><p class=\"\">The site is expected to commence patient recruitment and testing for the 100-patient study in February. </p><p class=\"\">PriMED will use the overarching institutional review board approval BlinkLab secured for the clinical trial. </p><p class=\"\">The firm is seeking to start initiating partnerships with sixteen sites across the US. </p><p class=\"\">The firm's shares rose 10% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463620:0/",
            "pub_date": "2025-02-05 09:51:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX8PRZ5X:0",
            "title": "GH Research Announces Pricing of $150 Million Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DUBLIN, Feb.  05, 2025  (GLOBE NEWSWIRE) — GH Research PLC , a clinical-stage biopharmaceutical company dedicated to transforming the lives of patients by developing a practice-changing treatment in depression, today announced the pricing of its previously announced underwritten public offering in the United States of 10,000,000 ordinary shares at a public offering price of $15.00 per share for total gross proceeds of approximately $150 million. All of the ordinary shares are being offered by GH Research PLC. The offering is expected to close on February 6, 2025, subject to customary closing conditions. In addition, GH Research PLC has granted the underwriters a 30-day option to purchase up to an additional 1,500,000 ordinary shares at the public offering price, less underwriting discounts and commissions.</p><p class=\"\">Cantor, Stifel and RBC Capital Markets are acting as joint book-running managers for the offering. Canaccord Genuity and Citizens JMP are acting as co-lead managers for the offering.</p><p class=\"\">A registration statement relating to these securities was filed with the U.S. Securities and Exchange Commission (the \"SEC\") and declared effective on March 17, 2023. Copies of the registration statement can be accessed through the SEC's website free of charge at www.sec.gov. A preliminary prospectus supplement and an accompanying prospectus relating to and describing the terms of the offering were filed with the SEC and are available free of charge by visiting EDGAR on the SEC's website free of charge at www.sec.gov. When available, copies of the final prospectus supplement and the accompanying prospectus related to the offering can be accessed through the SEC's website free of charge at www.sec.gov or obtained free of charge from any of the joint book-running managers for the offering: Cantor Fitzgerald &amp; Co., Attention: Capital Markets, 110 East 59th Street, 6th Floor, New York, New York 10022, or by email at prospectus@cantor.com; Stifel, Nicolaus &amp; Company, Incorporated, Attention: Syndicate, One Montgomery Street, Suite 3700, San Francisco, California 94104, by telephone at (415) 364-2720, or by email at syndprospectus@stifel.com; or RBC Capital Markets, LLC, Attention: Equity Capital Markets, 200 Vesey Street, New York, New York 10281, by telephone at 877-822-4089 or by email at equityprospectus@rbccm.com. For the avoidance of doubt, any such prospectus supplement or the accompanying prospectus will not constitute a “prospectus” for the purposes of the Irish Companies Act 2014 (as amended), the EU Prospectus Regulation (EU) 2017/1129 (as amended) (the “Prospectus Regulation”), the European Union (Prospectus) Regulations 2019 of Ireland (as amended) or the Central Bank (Investment Market Conduct) Rules 2019 of Ireland and will not have been reviewed by Central Bank of Ireland, as competent authority, or any competent authority in any European Economic Area (the \"EEA\") member state or the United Kingdom.</p><p class=\"\">This press release does not constitute an offer to sell or the solicitation of an offer to buy securities, and shall not constitute an offer, solicitation or sale in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of that jurisdiction.</p><p class=\"\">In any member state of the EEA this announcement and any offering are only addressed to and directed at persons who are \"qualified investors\" (\"Qualified Investors\") within the meaning of the Prospectus Regulation. In the United Kingdom, this announcement and any offering are only addressed to and directed at Qualified Investors (i) who have professional experience in matters relating to investments falling within Article 19(5) of the Financial Services and Markets Act 2000 (Financial Promotion) Order 2005, as amended (the \"Order\"), or (ii) who fall within Article 49(2)(a) to (d) of the Order, and (iii) to whom it may otherwise lawfully be communicated (all such persons being referred to as \"relevant persons\").</p><p class=\"\">This announcement must not be acted on or relied on (i) in the United Kingdom, by persons who are not relevant persons, and (ii) in any member state of the EEA, by persons who are not Qualified Investors. Any investment or investment activity to which this announcement relates is available only to and will only be engaged with (i) in the United Kingdom, relevant persons, and (ii) in any member state of the EEA, Qualified Investors.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GH Research PLC</strong></p><p class=\"\">GH Research PLC is a clinical-stage biopharmaceutical company dedicated to transforming the lives of patients by developing a practice-changing treatment in depression. GH Research PLC's initial focus is on developing its novel and proprietary mebufotenin therapies for the treatment of patients with treatment-resistant depression (TRD).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains certain forward-looking statements, including statements with regard to GH Research PLC’s expectations regarding the completion of the proposed securities offering. Words such as “anticipates,” “believes,” “expects,” “intends,” “projects,” “anticipates,” and “future” or similar expressions are intended to identify forward-looking statements. These forward-looking statements are subject to the inherent uncertainties in predicting future results and conditions and no assurance can be given that the proposed securities offering discussed above will be consummated on the terms described or at all. Completion of the proposed offering and the terms thereof are subject to numerous factors, many of which are beyond the control of GH Research PLC, including, without limitation, market conditions, failure of customary closing conditions and the risk factors and other matters set forth in GH Research PLC’s filings with the SEC. GH Research PLC undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations</strong></p><p class=\"\">Julie Ryan</p><p class=\"\">GH Research PLC</p><p class=\"\">investors@ghres.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX8PRZ5X:0-gh-research-announces-pricing-of-150-million-public-offering/",
            "pub_date": "2025-02-05 09:52:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014199:0",
            "title": "Chinese Share Mixed; Tariff Developments in Focus — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chinese shares are mixed in early trade, with the Shanghai Composite Index dropping 0.3% to 3240.74. The Shenzhen Composite Index is 0.35% higher and the ChiNext Price Index gains 0.4%. Investors are closely watching the latest tariff developments after China's retaliatory measures following President Trump's tariff hike. Technology companies are leading the gains with sentiment still positive about China's DeepSeek low-cost AI model. Beijing Kingsoft Office Software surges 16% and iFlytek is 8.3% higher. Decliners include Midea, which is down 2.5% and Yonghui Superstores, which is 4.2% lower. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014199:0/",
            "pub_date": "2025-02-05 09:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463621:0",
            "title": "Apollo Minerals Kickstarts Phase-Two Drilling at Salanie Gold Project in Gabon; Shares Climb 13%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Apollo Minerals  started the second phase of its drilling program at the Salanie gold project in Gabon, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The current phase will focus on extensions to the identified A1 prospect mineralization and untested targets at other key prospects, per the filing. It follows \"exception results\" from the 2024 program, which intersected up to 11.7 meters at 4.3 grams per tonne grade of gold from 9.6 meters. </p><p class=\"\">Apollo Minerals' shares climbed nearly 13% in recent Wednesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463621:0/",
            "pub_date": "2025-02-05 09:52:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014196_20250204014200:0",
            "title": "GH Research Announces Pricing of $150M Public Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014196_20250204014200:0/",
            "pub_date": "2025-02-05 09:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05R:0",
            "title": "Hanover Insurance Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc  reported quarterly adjusted earnings of $5.32​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $3.13.  The mean expectation of eight analysts for the quarter was for earnings of $3.37 per share. Wall Street expected results to range from $3.20  to $3.62 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 7.4% to $1.45 billion from a year ago; analysts expected $1.42 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc's reported EPS for the quarter was $4.59​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $167.9 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hanover Insurance Group Inc shares had fallen by 0.8% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 4 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the property &amp; casualty insurance peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Hanover Insurance Group Inc is $175.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:52 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.37</p></td><td><p class=\"\">5.32</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.53</p></td><td><p class=\"\">3.05</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.85</p></td><td><p class=\"\">1.88</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.71</p></td><td><p class=\"\">3.08</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05R:0-hanover-insurance-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:53:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446647:0",
            "title": "Japanese Yen Hits 7-Week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Japanese yen strengthened past 154 per dollar on Wednesday, reaching a seven-week high, as strong wage and services data bolstered expectations of a more hawkish stance from the Bank of Japan.</p><p class=\"\">Data revealed that real wages in Japan rose for the second consecutive month in December, with nominal wage growth hitting a near three-decade high, driven by a surge in winter bonuses.</p><p class=\"\">Additionally, Japan's services PMI for January was revised upward to 53, from a flash reading of 52.7.</p><p class=\"\">The Bank of Japan raised interest rates in January and signaled its readiness to hike rates further if economic and price trends align with its forecasts.</p><p class=\"\">On the external front, the yen also gained from a broad pullback in the dollar, as the US delayed tariffs on Mexico and Canada, while trade tensions with China proved less severe than anticipated.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446647:0-japanese-yen-hits-7-week-high/",
            "pub_date": "2025-02-05 09:53:34",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446648:0",
            "title": "China Services Growth Hits 4-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Caixin China General Services PMI unexpectedly declined to 51.0 in January 2025 from December’s seven-month high of 52.2, below market forecasts of 52.3.</p><p class=\"\">The latest reading marked the softest expansion in the services sector since September as new business growth eased to a four-month low, employment fell the most since April 2024, and selling price inflation slowed.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446648:0-china-services-growth-hits-4-month-low/",
            "pub_date": "2025-02-05 09:53:59",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014205:0",
            "title": "Hong Kong Shares Fall, Weighed by Consumer, Auto Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's Hang Seng Index falls 1.1% to 20553.22, weighed by consumer and auto stocks. Markets are keeping an eye on the influence of AI developments as well as developments relating to U.S. tariffs, given that Trump's policies have triggered market uncertainty, analysts at Nanhua Futures write in a note. Nongfu Spring falls 4.8%, Haidilao International loses 4.0% and Geely Automobile is 3.5% lower. Among advancers, Lenovo Group gains 3.4%, Orient Overseas (International) gains 2.0% and WH Group is 0.8% higher. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014205:0/",
            "pub_date": "2025-02-05 09:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463618:0",
            "title": "Delton Cables Leases Industrial Property in Palwal, India for Manufacturing Capacity Expansion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Delton Cables  has leased a 59,825-square-foot industrial property in the Palwal district of Haryana, India, for an undisclosed amount, according to a Tuesday disclosure to the BSE. </p><p class=\"\">The property will be used for the expansion of its manufacturing capacity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463618:0/",
            "pub_date": "2025-02-05 09:54:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:e05b6d32e094b:0",
            "title": "China January Caixin Services PMI 51.0 (vs. 52.2 in December)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China January Caixin Services PMI </p><p class=\"\">vs. 52.2 in December</p><p class=\"\">Composite:</p><p class=\"\">more to come </p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:e05b6d32e094b:0-china-january-caixin-services-pmi-51-0-vs-52-2-in-december/",
            "pub_date": "2025-02-05 09:45:06",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014184:0",
            "title": "JGBs Fall, Weighed by Prospects of More BOJ Rate Increases — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014184:0/",
            "pub_date": "2025-02-05 09:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05L:0",
            "title": "Jack Henry & Associates Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc  reported quarterly adjusted earnings of $1.34​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.26.  The mean expectation of seventeen analysts for the quarter was for earnings of $1.32 per share. Wall Street expected results to range from $1.28  to $1.37 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 5.2% to $573.85 million from a year ago; analysts expected $576.23 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc's reported EPS for the quarter was $1.34​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $97.85 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Jack Henry &amp; Associates Inc shares had fallen by 0.3% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.9% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, five analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 12 \"hold\" and 2 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the it services &amp; consulting peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Jack Henry &amp; Associates Inc is $190.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:45 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.32</p></td><td><p class=\"\">1.34</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.61</p></td><td><p class=\"\">1.63</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.32</p></td><td><p class=\"\">1.38</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.17</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05L:0-jack-henry-associates-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:46:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014187:0",
            "title": "RBNZ's OCR Cuts Still Blunted by Earlier Policy Tightening — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014187:0/",
            "pub_date": "2025-02-05 09:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014189:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">2044 ET - There are no signs yet that aggressive interest rate cuts by the Reserve Bank of New Zealand since mid-2024 are gaining traction and lifting the economy, says Ben Jarman, chief economist at JP Morgan. To be sure, recent GDP revisions show a more worrying economic trajectory, he adds. The data have yet to turn up meaningfully because policy traction is still being blunted by earlier OCR hikes, he adds. This has slowed the lowering of new mortgage rates, and any improvement in disposable incomes, Jarman says. A number of households will still be rolling their mortgages into higher rates than previous, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2046 ET - JGBs fall in price terms during the morning Tokyo session. Data released earlier show Japan's real wages rose 0.6% in December from a year earlier, marking a second straight month of increases and adding to the case for another BOJ rate hike. The sharp rise in the BOJ's core CPI inflation forecasts in the January outlook report, together with Gov. Ueda's recent comment that there's \"still a significant distance to the neutral rate of interest,\" has sparked worries over an acceleration of rate hikes and an increase in the terminal rate for this cycle, Mitsubishi UFJ Morgan Stanley Securities' fixed income strategists say in a recent report. The JGB 10-year yield is 1.5 bps higher at 1.290%. (ronnie.harui@wsj.com)</p><p class=\"\">2041 ET - New Zealand's unemployment in 4Q 2024 rose to a four-year high of 5.1%. While this was in line with the Reserve Bank of New Zealand's forecasts, money markets should expect a cut in the official cash rate later this month of \"at least\" 50 basis points, says Kieran Davies, chief macro strategist at Coolabah Capital. The unemployment rate almost matches the peak of 5.2% reached during the short Covid recession in 2020, Davies notes. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">2032 ET - From a policy perspective, data showing New Zealand's unemployment rates at a 4-year high of 5.1% reaffirm the view that the Reserve Bank of New Zealand will continue to lower rates sequentially over 1H, including another 50-basis-point cut at a policy meeting later this month, says Andrew Boak, chief economist at Goldman Sachs. Boak continues to expect the RBNZ to slow the pace of cuts to 25 basis points per meeting, starting in April, ultimately reaching a terminal official cash rate of 3.0% in July. Still, the risks are skewed to faster and deeper cuts if the recent improvement in high-frequency surveys does not translate into some improvement in the economy, he adds. (james.glynn@wsj.com; @JamesGlynnWSJ)</p><p class=\"\">1958 ET - Trump's 10% tariff hike on China will likely cause faster industry consolidation among its industrial companies, Citi Research analysts led by Eric Lau say. While major exporters like Techtronic and Shenzhou have diversified production into Asean to avoid tariffs, smaller Chinese companies are unable to do so given difficulty in obtaining bank loans and lack of management resources, they say in a note. The tariff hike could cause them significant distress and spike the unemployment rate in China as these firms constitute about 79% of the total workforce, they add. That could lead China to roll out more stimulus to counter the economic impact. (fabiana.negrinochoa@wsj.com)</p><p class=\"\">1957 ET - U.S.-China trade tensions have some investors concerned about potentially higher tariffs on Asean. While that can't be ruled out, Citi Research analysts led by Eric Lau think tariffs are unlikely to be on par with those levied at Mexico or China as Asean is an attractive region to help dilute CPI inflation for U.S. imported goods. Many major China exporters have diversified production into Asean to avoid tariffs but focus on labor-intensive, non-tech industries such as apparel and footwear that aren't targeted for reshoring into the U.S., they say. Mexico meanwhile has attracted automotive supply-chain industries as the U.S. government seems inclined to emphasize auto manufacturing reshoring, they add. \"The tariff hike scenario in Mexico may not necessarily apply to Asean, in our view.\"(fabiana.negrinochoa@wsj.com)</p><p class=\"\">1937 ET - South Korea's benchmark Kospi rises 0.9% to 2503.94 in early trade, as battery, semiconductor and auto stocks advance. Foreign and retail investors are net buyers amid easing fears over U.S. tariffs. Battery makers LG Energy Solution and Samsung SDI rise 2.0% and 2.9%, respectively, recovering from recent losses. Memory-chip maker SK Hynix gains 2.6%. Carmaker Kia is up 1.1%. Meanwhile, LG CNS, an IT service affiliate of LG Group, is down 2.9% on its stock exchange debut. USD/KRW is 0.5% lower at 1,454.90, compared with the prior session's Seoul onshore trading close. South Korea's 10-year government bond yield is up 0.9 bp at 2.844%. (kwanwoo.jun@wsj.com)</p><p class=\"\">1930 ET - The economy remains on solid footing but its health is uneven across sectors, Fed Vice Chair Philip Jefferson said Tuesday. In a lecture at Pennsylvania's Lafayette College, Jefferson notes strength in household spending, retail sales and activity in the services sector. \"The consumer spending data we have received recently have surprised me to the upside,\" Jefferson said, per his published remarks. On the other hand, some sectors have been notably weak. Residential investment has been flattish over the past three quarters, he notes, and production from the domestic manufacturing sector was about flat last year too. \"Much of the equipment investment that did take place came from imports,\" Jefferson says. (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">1913 ET - Japanese stocks are higher in early trade as fears about U.S. tariffs subside for now. Electronics stocks are leading the gains. Renesas Electronics is up 3.4% and Hitachi Ltd. is 2.9% higher. USD/JPY is at 154.31, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are closely watching U.S. trade talks as well as domestic earnings. Toyota Motor is scheduled to report its quarterly results later in the day. The Nikkei Stock Average is up 0.7% at 39070.87. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1850 ET - Japanese stocks may rise as fears about U.S. tariffs subside for now. Nikkei futures are up 0.4% at 38975 on the SGX. USD/JPY is at 154.17, compared with 155.37 as of Tuesday's Tokyo stock market close. Investors are focusing on U.S. trade talks as well as domestic earnings. Toyota Motor is set to announce its quarterly results later in the day. The Nikkei Stock Average rose 0.7% to 38798.37 on Tuesday. (kosaku.narioka@wsj.com; @kosakunarioka)</p><p class=\"\">1825 ET - BlackRock, the world's largest asset manager, last year announced a series of acquisitions of private market-focused firms that \"lay a foundation for an increased integration of public and private\" assets, Apollo's CEO Marc Rowan says during an earnings call. \"I continue to believe this convergence of public and private will be a very important source of demand for private assets,\" Rowan says. BlackRock last year acquired infrastructure-focused Global Infrastructure Partners and agreed to buy credit specialist HPS Investment Partners as well as Preqin, a provider of private-market research. \"We envision that traditional asset managers will evolve their businesses to include products that are public and private,\" Rowan adds. \"Our industry and our firm will be a supplier of products to [them].\" (luis.garcia@wsj.com; @lhvgarcia)</p><p class=\"\">1551 ET - Treasury yields lose steam as the trade war cools down a little and both factory orders and job openings in the U.S. fall. Economists surveyed by The Wall Street Journal expect the ADP private-sector jobs report tomorrow to show an increase to 150,000 from December's 122,000, while December trade deficit is forecast to widen to $96.8 billion from $78.19 billion. Jobless claims on Thursday are expected to accelerate and Friday's payrolls increases are expected to slow. Analysts show increasing concerns over stickier inflation and weaker growth potentially resulting from trade wars. The 10-year yield loses 0.031 percentage point to 4.511% and the two-year falls 0.051 p.p. to 4.213%. (paulo.trevisani@wsj.com; @ptrevisani)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014189:0/",
            "pub_date": "2025-02-05 09:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446646:0",
            "title": "China Composite PMI Hits 4-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Caixin China General Composite PMI edged down to 51.1 in January 2025 from 51.4 in December, marking the lowest print since September.</p><p class=\"\">Despite this, it pointed to the 15th month of growth in private sector activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446646:0-china-composite-pmi-hits-4-month-low/",
            "pub_date": "2025-02-05 09:47:48",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSO:0",
            "title": "China's services activity grows at slower pace, Caixin PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Employment levels decline at fastest pace since April 2024</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">New business growth eases to four-month low</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Business optimism improves, Trump tariffs major concern</li></ul></span></div><span><p class=\"\">    China's services activity expanded at a slower pace in January, with the Lunar New Year holidays worsening employment, but business sentiment improved, a private sector survey showed on Wednesday.</p><p class=\"\">The Caixin/S&amp;P Global services purchasing managers' index (PMI), slipped to 51.0 from 52.2 in December, but remained above the 50-mark that separates expansion from contraction on a monthly basis.</p><p class=\"\">That echoes the official PMI, which showed services activity weakened to 50.3 from 52.0.</p><p class=\"\">The Caixin survey showed that new business growth eased to a four-month low, while employment fell to the weakest since April 2024. </p><p class=\"\">The fall in January's employment sub-index was partly due to the earlier-than-usual Lunar New Year holiday this year, as some restaurants shut down temporarily and sent workers back home for the more than one week-long celebrations.</p><p class=\"\">The level of unfinished work fell for the first time in six months due to slower new business growth and better working efficiency. </p><p class=\"\">Business sentiment rose from December, but some firms expressed concerns over rising competition and uncertainties pertaining to the outlook for international trade.</p><p class=\"\">U.S. President Donald Trump on Saturday ordered 10% tariffs on goods from China. That prompted Beijing to swiftly respond on Tuesday with its own levies on some U.S. imports.</p><p class=\"\">\"The new duties will nearly double the effective tariff rate on Chinese imports (to the U.S.), but Chinese policymakers have ample scope to mitigate the damage to economic growth,\" said Gavekal Dragonomics's Thomas Gatley in a note on Monday. </p><p class=\"\">Julian Evans-Pritchard, head of China economics at Capital Economics, said that there could be a silver lining for China, with Trump's willingness to undermine U.S. alliances likely to leave China in a stronger geopolitical position.</p><p class=\"\">The Caixin/S&amp;P Global Composite PMI, which combines the manufacturing and services PMIs, fell to 51.1 in January from 51.4 the month prior.</p><p class=\"\">The pace of growth softened to the lowest in four months, as quicker manufacturing output growth failed to counter a softening pace of growth in services activity.</p><p class=\"\">China is struggling with a prolonged property crisis that has curbed investment and dented confidence though policymakers have pledged to prioritise domestic consumption in this year's policies. </p><p class=\"\">The country's movie box office took in record revenue during the Lunar New Year holiday, as sequels to popular Chinese hits drew theatregoers. Some local governments issued cinema vouchers as part of a campaign to revive consumption. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSO:0-china-s-services-activity-grows-at-slower-pace-caixin-pmi-shows/",
            "pub_date": "2025-02-05 09:48:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW05Q:0",
            "title": "Trivago NV reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trivago NV  reported quarterly adjusted earnings of 1 cent​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 5 cents.  The mean expectation of seven analysts for the quarter was for breakeven results per share. Wall Street expected results to range from -5 cents to 1 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 3.4% to €94.78 million from a year ago; analysts expected €92.55 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trivago NV's reported EPS for the quarter was 1 cent​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of €5.06 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trivago NV shares had risen by 38.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 115.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy,\" 6 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the online services peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Trivago NV is $2.30 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 01:48 a.m. UTC. ​All figures in euros unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.00</p></td><td><p class=\"\">0.01</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.01</p></td><td><p class=\"\">-0.20</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">-0.05</p></td><td><p class=\"\">-0.05</p></td><td><p class=\"\">Met</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">-0.05</p></td><td><p class=\"\">-0.10</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW05Q:0-trivago-nv-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 09:48:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "smallcaps:f383c3127094b:0",
            "title": "Solstice Minerals enters rising copper market with strategic Nanadie project acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Solstice Minerals  has made a strategic move into the high-flying copper market with the acquisition of the advanced Nanadie project in Western Australia. The company has entered into a binding agreement with Cyprium Metals  for 100% of the project, which comprises multiple granted licences covering 130 square kilometres south-east of Meekatharra in the Murchison District. Morgan Stanley recently highlighted copper as its most preferred base metal next year, predicting prices will climb to around $10,600 (US$9,500) a tonne by the end of 2025, while both Rio Tinto and BHP have recently highlighted copper as a key resource in their growth plans. Copper asset search Solstice chief executive officer and managing director Nick Castleden said the company had been on the hunt for strategic growth opportunities in copper for some time. “Particularly focusing on those rare assets that are located in stable and proven mining-friendly jurisdictions with limited competing land use, offer significant exploration upside and can be secured at a reasonable price,” he added. “Nanadie ticks all of those boxes and we are delighted to have secured such a complementary addition to our portfolio.” Favourable outlook “Copper is widely seen as a commodity with one of the most favourable long-term supply-demand outlooks of all the major metals and yet finding quality assets is extremely difficult,” Mr Castleden said. “We are excited by the scale, geometry and mineral resource estimate (MRE) growth potential at Nanadie and recognise that mafic magmatic systems like these can also deliver zones of increased grade.” Solstice also sees the potential for new mineralised positions with targeted exploration. Significant upside Nanadie is located within a granted mining lease, with strike extensions that offer greenfield targets for shallow drilling. While it is yet to carry out metallurgical test work, Solstice considers the style of sulphide mineralisation to be suitable for conventional grind and flotation processing with the potential to deliver a clean copper-gold concentrate. “Our medium-term work plan will be exploration-focused, aiming to scope the mostly unconstrained Nanadie disseminated system beyond MRE boundaries and explore for new copper-gold mineralisation along strike and at depth,” Mr Castleden said. Initial targets identified Solstice plans to follow up two significant and partially defined magmatic intrusive-style mineral systems at Nanadie and the Stark copper-gold, nickel and platinum group elements prospect. Mr Castleden said Nanadie offers excellent exploration potential to build on a JORC-compliant inferred MRE of 40.4 million tonnes at 0.4% copper and 0.1 grams per tonne gold for 162,000t of contained copper and 130,000 ounces of gold. The company believes there is the possibility that mineralisation extends beyond the limits of previous drilling in most directions.</p></span></div>",
            "link": "https://www.tradingview.com/news/smallcaps:f383c3127094b:0-solstice-minerals-enters-rising-copper-market-with-strategic-nanadie-project-acquisition/",
            "pub_date": "2025-02-05 09:48:29",
            "source": "Small Caps",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV189:0",
            "title": "Air New Zealand's Seoul flights to stop from March due to engine shortage",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Air New Zealand  will stop its direct flights to Seoul at the end of March due to ongoing problems with availability of engines for its fleet, the airline said on Wednesday. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV189:0-air-new-zealand-s-seoul-flights-to-stop-from-march-due-to-engine-shortage/",
            "pub_date": "2025-02-05 09:49:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW02C:0",
            "title": "South Korean shares rise more than 1% as e-commerce firms rally on AI hope",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">KOSPI rises, foreigners net buyers</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Korean won little changed against US dollar</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">South Korea benchmark bond yield steady</li></ul></span></div><span><p class=\"\">    Round-up of South Korean financial markets:</p><p class=\"\">** South Korean shares gained more than 1% on Wednesday on relief after a pause in U.S. tariffs, while e-commerce firms rallied on artificial intelligence (AI) hopes.</p><p class=\"\">** The benchmark KOSPI  was up 31.82 points, or 1.28%, at 2,513.51 as of 0121 GMT.</p><p class=\"\">** U.S. President Donald Trump suspended planned tariffs on imports from Mexico and Canada, but went ahead with tariffs on China, which were promptly met by Beijing's countermeasures.</p><p class=\"\">** Kakao  jumped 5.75% after the chat app operator said it would develop AI products with OpenAI. Search engine Naver  climbed 6.18%.</p><p class=\"\">** Software firms are likely to benefit from cheaper AI after China's Deepseek launch, analysts said.</p><p class=\"\">** Most other index heavyweights also advanced, including chip, auto and battery makers.</p><p class=\"\">** LG CNS  slid more than 6% from the initial public offering (IPO) price in debut trade.</p><p class=\"\">** On the macroeconomic front, South Korea's consumer inflation quickened to a six-month high in January, coming in higher than market expectations on pressure from a weak local currency.</p><p class=\"\">** Of the total 937 traded issues, 596 advanced and 271 declined.</p><p class=\"\">** Foreigners net bought shares worth 140 billion won ($96.6 million).</p><p class=\"\">** The won was quoted at 1,450.9 per U.S. dollar on the onshore settlement platform , 0.04% higher than Tuesday's close at 1,451.5.</p><p class=\"\">** In money and debt markets, March futures on three-year treasury bonds (KTBc1) rose 0.03 point to 106.89.</p><p class=\"\">** The most liquid three-year Korean treasury bond yield (KR3YT=RR) fell by 1.1 basis points to 2.575%, while the benchmark 10-year yield  fell by 1.0 basis points to 2.822%.</p><p class=\"\">($1 = 1,448.8200 won)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW02C:0-south-korean-shares-rise-more-than-1-as-e-commerce-firms-rally-on-ai-hope/",
            "pub_date": "2025-02-05 09:49:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014174:0",
            "title": "Singapore's Straits Times Index Likely to Trend Sideways in Near Term — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's FTSE Straits Times Index could trend sideways in the near term, say DBS Group Research analysts in a note. The market's focus is on the domestic corporate results season and U.S. President Trump's next policy actions, they write. The upcoming Singapore budget later this month is unlikely to \"move the needle significantly\" for stocks on the benchmark index, the analysts say. Singapore's equity market performance also isn't expected to be influenced by the city-state's general election due later this year, they add. DBS maintains its STI year-end target of 3950. The STI is flat at 3824.04. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014174:0/",
            "pub_date": "2025-02-05 09:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014175:0",
            "title": "New Zealand Central Bank May Deliver Rate Cut of 'at Least' 50 Bps — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand's unemployment in 4Q 2024 rose to a four-year high of 5.1%. While this was in line with the Reserve Bank of New Zealand's forecasts, money markets should expect a cut in the official cash rate later this month of \"at least\" 50 basis points, says Kieran Davies, chief macro strategist at Coolabah Capital. The unemployment rate almost matches the peak of 5.2% reached during the short Covid recession in 2020, Davies notes. (james.glynn@wsj.com; @JamesGlynnWSJ)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014175:0/",
            "pub_date": "2025-02-05 09:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463615:0",
            "title": "Astellas Pharma Swings Into Red in Fiscal Nine Months on Intangible Assets, Forex Losses; Shares Shed 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Astellas Pharma  posted a 24.15 billion yen loss attributable to owners of the parent in the fiscal nine months ended Dec. 31, 2024, reversing the 50.32 billion yen profit a year earlier, due to impairment losses on intangible assets and foreign exchange losses. </p><p class=\"\">The company said loss per share was 13.49 yen compared with earnings per share of 27.96 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Revenue rose 22.2% to 1.453 trillion yen from 1.189 trillion yen a year earlier, driven by strong performance from its oncology drugs XTANDI, PADCEV, and XOSPATA, as well as newly launched products VEOZAH and IZERVAY. </p><p class=\"\">Astellas forecasted attributable profit to drop 72% to 14 billion yen, or 7.82 yen per share, despite a projected 5.6% revenue growth to 1.9 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to maintain a total dividend of 129 yen per share for the fiscal year. </p><p class=\"\">In a separate filing, Astellas said it recorded extraordinary losses of 60.6 billion yen in its non-consolidated financial results for the third quarter of fiscal year 2024, due to a significant decline in the value of shares of Ganymed Pharmaceuticals. </p><p class=\"\">However, this loss did not affect the consolidated financial results, as it was eliminated in the consolidated financial statements. </p><p class=\"\">Astellas Pharma's shares shed over 4% in morning trading Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463615:0/",
            "pub_date": "2025-02-05 09:42:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1JT:0",
            "title": "Asia shares edge higher, dollar backtracks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China sets firm fix for yuan, soothing devaluation worry</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wall St futures dip after Alphabet earnings disappoint</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar backs off highs, Treasury yields ease</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Gold hits new peak amid trade tensions</li></ul></span></div><span><p class=\"\">    Asian stock markets tried to steady on Wednesday amid hopes U.S. tariffs would not be as painful for the global economy as feared just a day ago, though Wall Street futures took a knock from a sharp drop in Alphabet  shares as earnings disappointed.</p><p class=\"\">Investors were also not entirely sure what to make of  comments by President Donald Trump that the U.S. would like to take over the war-ravaged Gaza Strip and develop it economically.</p><p class=\"\">The dollar surrendered some of its recent gains as investors saw a little more scope for the Federal Reserve to ease policy this year, sparking a rally in Treasuries.</p><p class=\"\">The mood was helped by Beijing's relatively restrained response to President Donald Trump's added 10% in tariffs, which covered just $14 billion of U.S. imports.</p><p class=\"\">\"The measures are fairly modest, at least relative to U.S. moves, and have clearly been calibrated to try to send a message to the U.S. without inflicting too much damage,\" said Julian Evans-Pritchard, head of China economics at Capital Economics.</p><p class=\"\">\"The risk is that China's retaliation proves too modest to exert any real pressure on the U.S. to reverse tariffs, but sufficiently defiant to trigger a further escalation.\"</p><p class=\"\">Beijing supported sentiment on Wednesday by setting a firm fix for its yuan, countering concerns it might allow the currency to slide to offset the impact of tariffs on its exports. That saw Chinese blue chips  return from holiday with a rise of 0.7%. </p><p class=\"\">While many uncertainties remained, including Trump's threats of levies on Europe, markets seemed relieved things were not even worse.</p><p class=\"\">MSCI's broadest index of Asia-Pacific shares outside Japan (.MIAPJ0000PUS) added 0.8%, while Japan's Nikkei  edged up 0.3%. South Korea's main index (KS11) bounced 1.2%.</p><p class=\"\">EUROSTOXX 50 futures , FTSE futures  and DAX futures  were all down around 0.1% amid the lingering risk of U.S. taxes on trade.</p><p class=\"\">Having bounced on Tuesday, Wall Street futures ran into selling when Alphabet earnings missed forecasts and its shares dived 7.7%, wiping $195 billion off its market capitalisation. </p><p class=\"\">S&amp;P 500 futures  dipped 0.2% and Nasdaq futures  lost 0.3% in response. Results out Wednesday include Uber, Ford, Qualcomm and Walt Disney.</p><p class=\"\">The delays to tariffs on Canada and Mexico eased worries the Fed might be severely restricted in how far it could cut interest rates and prompted a bounce in fund futures (0#FF:).</p><p class=\"\">Yields on two-year Treasuries (US2YT=RR) were back at 4.226% and off a peak of 4.282% hit on Monday. </p><p class=\"\">The pullback in yields coincided with a retreat in the dollar from its peaks, with the dollar index  down at 108.060 from Monday's spike top of 109.880. </p><p class=\"\">The euro firmed to $1.0384 , a remarkable round trip from the two-year trough of $1.0125 struck at the start of the week. Likewise, the dollar had recoiled to 1.4327 Canadian dollars  from a 22-year high of 1.4792.</p><p class=\"\">The dollar also slipped 0.5% on the Japanese yen to touch a seven-week low at 153.49 , breaking support at 153.72.</p><p class=\"\">In commodity markets, gold hit a fresh all-time high at $2,848 an ounce  aided in part by the pullback in the dollar and yields. </p><p class=\"\">Oil prices were initially hit by news of China's tariffs on its imports of U.S. oil, only to come off lows on reports Trump had restored his \"maximum pressure\" campaign on Iran, in a bid to drive Iranian oil exports to zero. </p><p class=\"\">Brent  rose 5 cents to $725 a barrel, while U.S. crude  added 17 cents to $72.87 per barrel.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1JT:0-asia-shares-edge-higher-dollar-backtracks/",
            "pub_date": "2025-02-05 09:43:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW044:0",
            "title": "Soybeans dip from near 7-month top, easing trade tensions curb downside",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Chicago soybeans slid on Wednesday after scaling a near seven-month high in the previous session, although the decline was limited by easing worries over U.S. tariff war with its key trading partners. </p><p class=\"\">Corn rose for a third consecutive session, while wheat hit a three-month high.</p><p class=\"\">FUNDAMENTALS</p><p class=\"\">* The most-active soybean contract on the Chicago Board of Trade (CBOT)  gave up 0.3% to $10.72-1/4 a bushel, as of 0120 GMT, after climbing to its highest since late July on Tuesday. Corn  rose 0.1% to $4.95 a bushel, wheat  added 0.4% to $5.97 a bushel, the contract's highest since November. </p><p class=\"\">* Agricultural markets have recently been focused on the risk that anticipated tariffs against Canada, Mexico and China could hurt demand for U.S. farm goods as all three nations are major importers.</p><p class=\"\">* But U.S. President Donald Trump on Monday postponed tariffs against Mexico and Canada for a month, while China imposed limited retaliatory tariffs on U.S. goods on Tuesday that did not include soybeans.</p><p class=\"\">* Some traders predict that China, the world's biggest soybean importer, may boost purchases of the oilseed as part of trade negotiations.</p><p class=\"\">* Weather risks for South American crops, with drought in Argentina and excess rain in Brazil, continued to underpin corn and soy prices, traders said.</p><p class=\"\">* The U.S. Department of Agriculture confirmed private sales of 132,000 metric tons of U.S. corn to South Korea.</p><p class=\"\">* European Union soft wheat exports since the start of the 2024/25 season in July had reached 12.51 million tons by Feb. 2, compared with 12.18 million tons the previous week and down 37% from a year earlier, European Commission data showed on Tuesday.</p><p class=\"\">* Commodity funds were net buyers of CBOT soybean, corn, soymeal, soyoil and wheat futures contracts on Tuesday, traders said. (COMFUND/CBT)</p><p class=\"\">MARKET NEWS</p><p class=\"\">* U.S. stocks rallied on Tuesday, while gold reached new highs as global trade jitters kept investors guessing. </p><p class=\"\">DATA/EVENTS (GMT)</p><p class=\"\">0145   China    Caixin Services PMI                         Jan</p><p class=\"\">0850   France   HCOB - Services PMI, HCOB Composite PMI     Jan</p><p class=\"\">0855   Germany  HCOB Serv, Comp Final PMIs Jan</p><p class=\"\">0900   EU       HCOB Serv, Comp Final PMIs Jan</p><p class=\"\">0930   UK       S&amp;P GLOBAL PMI: COMPOSITE - OUTPUT   Jan</p><p class=\"\">1330   US       International Trade  Dec</p><p class=\"\">1445   US       S&amp;P Global Comp, Svcs Final PMIs Jan</p><p class=\"\">1500   US       ISM N-Mfg PMI   Jan</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW044:0-soybeans-dip-from-near-7-month-top-easing-trade-tensions-curb-downside/",
            "pub_date": "2025-02-05 09:44:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014119_20250204014161:0",
            "title": "Canaccord Genuity 3Q Rev C$451.0M >CF.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014119_20250204014161:0/",
            "pub_date": "2025-02-05 09:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014119_20250204014162:0",
            "title": "Canaccord Genuity 3Q Loss/Shr C$0.26 >CF.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014119_20250204014162:0/",
            "pub_date": "2025-02-05 09:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463616:0",
            "title": "SportsHero Signs Two-Year Partnership With Indonesian Telecommunications Firm; Shares Reach Near Two-Year High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SportsHero  signed a two-year agreement with Indonesian telecommunications company XL Axiata to promote the iGV Family Game Room Pass, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The partnership outlines a revenue-sharing agreement, with no consideration payable between the parties, and no minimum subscription required, the filing said. </p><p class=\"\">The company is anticipated to achieve a margin on gross subscription value of at least 38%, according to the filing. </p><p class=\"\">SportsHero's shares rose 10% in midday trade Wednesday and earlier reached their highest since June 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463616:0/",
            "pub_date": "2025-02-05 09:36:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463617:0",
            "title": "Tlou Energy Signs Agreement to Power Computational Facilities in Botswana, Shares Rise 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tlou Energy  signed a nonbinding heads of agreement with a data center development firm to set up high-density computational facilities at its Lesedi site in Botswana, according to a Wednesday Australian bourse filing. </p><p class=\"\">The facility will run power-intensive computer processing equipment using electricity generated from gas produced by the firm, the filing said. </p><p class=\"\">A proof-of-concept trial was completed with gas provided by Tlou from its Lesedi 4 gas production pod to generate electricity, per the filing. </p><p class=\"\">It is in talks with the data center firm regarding an expanded program, including funding provided by the latter. The funding will be used for additional gas wells at Lesedi, which could scale up gas production for the facility and Tlou's 10-megawatt gas-to-power project. </p><p class=\"\">The firm's shares rose past 8% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463617:0/",
            "pub_date": "2025-02-05 09:38:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}