{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV37X:0",
            "title": "American Financial Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc  reported quarterly adjusted earnings of $3.12​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $2.84.  The mean expectation of seven analysts for the quarter was for earnings of $3.10 per share. Wall Street expected results to range from $2.71  to $3.61 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 6.8% to $1.85 billion from a year ago; analysts expected $1.72 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc's reported EPS for the quarter was $3.03​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $255 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc shares had fallen by 0.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the property &amp; casualty insurance peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for American Financial Group Inc is $150.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:00 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.10</p></td><td><p class=\"\">3.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.47</p></td><td><p class=\"\">2.31</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.45</p></td><td><p class=\"\">2.56</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.70</p></td><td><p class=\"\">2.76</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV37X:0-american-financial-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:00:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013523:0",
            "title": "Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025</p><p class=\"\">TORONTO--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Organigram Holdings Inc.  , the parent company of Organigram Inc. (together, the \"Company\" or \"Organigram\"), a leading licensed producer of cannabis, announced today it will report earnings results for its first quarter fiscal 2025 ended December 31, 2024, on Tuesday, February 11, 2025, prior to market open.</p><p class=\"\">The Company will host a conference call to discuss its results with details as follows:</p><p class=\"\">Date: Tuesday, February 11, 2025</p><p class=\"\">Time: 8:00 am Eastern Time</p><p class=\"\">To register for the conference call, please use this link:</p><p class=\"\">https://registrations.events/direct/Q4I967665</p><p class=\"\">To ensure you are connected for the full call, we suggest registering a day in advance or at minimum 10 minutes before the start of the call. After registering, a confirmation will be sent through email, including dial in details and unique conference call codes for entry. Registration is open through the live call.</p><p class=\"\">To access the webcast:</p><p class=\"\">https://events.q4inc.com/attendee/638837238</p><p class=\"\">Participants will receive their details via email.</p><p class=\"\">A replay of the webcast will be available within 24 hours after the conclusion of the call at https://www.organigram.ca/investors and will be archived for a period of 90 days following the call.</p><p class=\"\">About Organigram Holdings Inc.</p><p class=\"\">Organigram Holdings Inc. is a NASDAQ Global Select Market and TSX listed company whose wholly-owned subsidiaries include Organigram Inc., a licensed cultivator of cannabis and manufacturer of cannabis-derived goods in Canada, and recently acquired Motif Labs Ltd., a licensed cannabis processor.</p><p class=\"\">Organigram is focused on producing high-quality, indoor-grown cannabis for patients and adult recreational consumers in Canada, as well as developing international business partnerships to extend the Company's global footprint. Organigram has also developed a portfolio of legal adult-use recreational cannabis brands, including Edison, Big Bag O' Buds, SHRED, Monjour and Trailblazer. Organigram operates facilities in Moncton, New Brunswick and Lac-Supérieur, Québec, with a dedicated manufacturing facility in Winnipeg, Manitoba. As a result of the acquisition of Motif Labs Ltd. on December 6, 2024, the Company now operates two additional cannabis processing facilities in Southwestern Ontario; one in Aylmer and the other in London. The facility in Aylmer houses best-in-class CO2 and Hydrocarbon extraction capabilities, and is optimized for formulation refinement, post-processing of minor cannabinoids, and pre-roll production. The facility in London will be optimized for labelling, packaging, and national fulfillment. The Company is regulated by the Cannabis Act and the Cannabis Regulations (Canada).</p><p class=\"\">This news release contains forward-looking information. Often, but not always, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"estimates\", \"intends\", \"anticipates\", \"believes\" or variations of such words and phrases or state that certain actions, events, or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results, events, performance or achievements of Organigram to differ materially from current expectations or future results, performance or achievements expressed or implied by the forward-looking information contained in this news release. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information include factors and risks as disclosed in the Company's most recent annual information form, management's discussion and analysis and other Company documents filed from time to time on SEDAR+ (see www.sedarplus.ca) and filed or furnished to the Securities and Exchange Commission on EDGAR (see www.sec.gov). Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. The forward-looking information included in this news release are made as of the date of this news release and the Company disclaims any intention or obligation, except to the extent required by law, to update or revise any forward-looking information, whether as a result of new information, future events or otherwise.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204831799/en/</p><p class=\"\">CONTACT:    For Media enquiries:</p><p class=\"\">Megan McCrae, Senior Vice President — Global Brands and Corporate Affairs</p><p class=\"\">megan.mccrae@organigram.ca</p><p class=\"\">For Investor Relations enquiries:</p><p class=\"\">Max Schwartz, Director of Investor Relations</p><p class=\"\">investors@organigram.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013523:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013527:0",
            "title": "Aware Taps Amlani to Be New CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Aware named Ajay Amlani its new chief executive officer.</p><p class=\"\">The provider of biometrics software products, services, and solutions on Tuesday said that Amlani replaces Robert Eckel, who in October agreed to leave the company by the end of 2024.</p><p class=\"\">Amlani brings nearly two decades of experience at the intersection of government, private sector innovation, and identity technology, the company said. Most recently, Amlani served as the head of the Americas region at iProov, a smaller competitor in the digital identity company space based in London.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013527:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS839zCa:0",
            "title": "Early Warning Report - Shares of Jade Leader Corp",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">CALGARY, AB / ACCESS Newswire / February 4, 2025 /</strong> This press release is being disseminated as required by National Instrument 62-103 - The Early Warning System and Take over Bid and Insider Reporting Issues regarding the disposition and acquisition of securities of Jade Leader Corp. (\"Jade Leader\").</p><p class=\"\">On February 4, 2025, Normand Goupil (\"Mr. Goupil\"), purchased pursuant to a private placement, a total of 2,500,000 Common Shares or 3.3% of the issued and outstanding shares on an undiluted basis of Jade Leader for cash consideration of $100,000 or $0.04 per Common Share. Following the share purchase Mr. Goupil will beneficially own, control or have direction over, directly or indirectly, an aggregate of 10,044,000 Common Shares representing 13.4% of the issued and outstanding Common Shares as well as hold 1,500,000 Warrants (representing 15.1% on a partly diluted basis, assuming the exercise of all Warrants held by Mr. Goupil). Mr. Goupil's acquisition represents an approximately 2.3% increase in his ownership and or control over Common Shares of Jade Leader on a partially diluted basis, assuming no further common shares of Jade have been issued. The Common Shares are being acquired for investment purposes and in the future, he may further decrease or increase his beneficial ownership of the securities of Jade Leader.</p><p class=\"\">A copy of the early warning report will be available on Jade Leader's Sedar profile at <strong class=\"root-Tkn6WL2y\">www.sedar.com</strong><strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For Further Information Contact:</strong></p><p class=\"\">info@jadeleader.ca</p><p class=\"\">Or Jean Pierre Jutras, President</p><p class=\"\">at 1.403.233.0464</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Jade Leader Corp.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS839zCa:0/",
            "pub_date": "2025-02-05 07:01:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463553:0",
            "title": "SKY Perfect JSAT Reports 2.6 Million SKY PerfecTV! Subscribers as of End-January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Perfect JSAT Holdings  reported 2.6 million subscribers to its SKY PerfecTV! pay-TV service at the end of January, a decline of 16,131 from the prior month, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The main SKY PerfecTV! service saw a net drop of 10,242 users to 1.9 million, while the premium service fell by 5,889 to 649,703. The optical fiber-based re-transmission service added 7,681 subscribers, reaching 2.8 million households.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463553:0/",
            "pub_date": "2025-02-05 07:01:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309491:0",
            "title": "Neurocrine Biosciences Insider Sold Shares Worth $413,967, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kevin Charles Gorman, Director, on January 31, 2025, sold 2,707 shares in Neurocrine Biosciences  for $413,967. Following the Form 4 filing with the SEC, Gorman has control over a total of 517,030 common shares of the company, with 517,030 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309491:0/",
            "pub_date": "2025-02-05 07:01:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013529:0",
            "title": "Viking Holdings Initiated at Buy by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(23:02 GMT) </strong>Viking Holdings Price Target Announced at $55.00/Share by Loop Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013529:0/",
            "pub_date": "2025-02-05 07:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463568:0",
            "title": "Business Activity in Australia's Services Sector Rises in January; Confidence Hits 32-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Business activity in Australia's services sector grew further in January, while confidence surged to a 32-month high, according to a survey by S&amp;P Global published Wednesday. </p><p class=\"\">The Services PMI Business Activity Index rose to 51.2 last month from 50.8 in December 2024. </p><p class=\"\">Improving customer demand helped drive new business, which grew at its fastest rate in three months. New export orders also improved for a second straight month, with notable growth from mainland China. </p><p class=\"\">Employment returned to growth as firms hired more staff to meet increased demand. </p><p class=\"\">Meanwhile, business confidence reached its highest level since May 2022. </p><p class=\"\">Elsewhere, the rates of inflation of input costs and selling prices accelerated in January.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463568:0/",
            "pub_date": "2025-02-05 07:02:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309486:0",
            "title": "Flex Partners With Husqvarna to Streamline Supply Chain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Flex  and Husqvarna said late Tuesday they have partnered to enhance Husqvarna's flexibility, efficiency, and time to market through Flex's advanced supply chain management solutions. </p><p class=\"\">Under the agreement, Flex will provide supply chain and manufacturing services for Husqvarna in the North American market. </p><p class=\"\">This collaboration will also expand Flex's portfolio into the outdoor and power equipment sector, according to the companies.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309486:0/",
            "pub_date": "2025-02-05 07:02:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013541:0",
            "title": "Nektar Names Kotzin Interim Chief Medical Officer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Nektar Therapeutics named Brian Kotzin its interim chief medical officer, succeeding Mary Tagliaferri, who stepped down from the role citing personal reasons.</p><p class=\"\">Kotzin will assist in the search for a permanent replacement, the San Francisco company said in a Tuesday filing with the Securities and Exchange Commission.</p><p class=\"\">Kotzin has served as a strategic advisor to Nektar since 2023. He has more than 40 years of experience in immunology, as well as development and management experience, the company said.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013541:0/",
            "pub_date": "2025-02-05 07:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA3YKMX6:0",
            "title": "Willdan Expands Florida Presence With Acquisition Of Alpha Inspections",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Willdan Group Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">WILLDAN EXPANDS FLORIDA PRESENCE WITH ACQUISITION OF ALPHA INSPECTIONS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">WILLDAN GROUP INC: TERMS OF TRANSACTION WERE NOT DISCLOSED</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA3YKMX6:0-willdan-expands-florida-presence-with-acquisition-of-alpha-inspections/",
            "pub_date": "2025-02-05 07:03:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463554:0",
            "title": "SKY Perfect JSAT Partners JAXA Startup Penetrator for AI-Powered Real Estate Insights",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Perfect JSAT Holdings  said its unit, SKY Perfect JSAT Corporation, has entered into a business partnership with Penetrator, a JAXA-backed startup, to enhance real estate transactions using satellite data and artificial intelligence, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The collaboration seeks to digitize Japan's real estate brokerage industry, in which about 70% of land deals still rely on personal networks, according to Penetrator. </p><p class=\"\">The startup has developed an AI-powered search engine integrating satellite, government, and web data to identify off-market properties. </p><p class=\"\">SKY Perfect JSAT will provide cost-effective satellite data with high-frequency updates to enhance Penetrator's platform, aiming to expand the use of satellite imagery in the private real estate sector.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463554:0/",
            "pub_date": "2025-02-05 07:04:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013445:0",
            "title": "Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(22:52 GMT) </strong>*Insignia Financial Receives Takeover Proposal From Brookfield<br/><strong class=\"root-Tkn6WL2y\">(22:53 GMT) </strong>*Insignia: Brookfield Offering A$4.60/Share in Cash or Scrip<br/><strong class=\"root-Tkn6WL2y\">(22:53 GMT) </strong>*Insignia: Indicative Proposal at Same Price Proposed by Existing Suitors<br/><strong class=\"root-Tkn6WL2y\">(22:54 GMT) </strong>*Insignia Has Granted Brookfield Limited Non-Exclusive Due Diligence<br/><strong class=\"root-Tkn6WL2y\">(23:05 GMT) </strong>Brookfield Enters Race for Australia's $1.9 Billion Insignia Financial</p><p class=\"\">By Stuart Condie</p><p class=\"\">SYDNEY--Brookfield Asset Management made a US$1.93 billion proposal for Insignia Financial, becoming the Australian wealth manager's third suitor.</p><p class=\"\">Insignia on Wednesday said that Brookfield made a non-binding proposal of 4.60 Australian dollars, or US$2.88, a share. That is the same value as the proposal made last month by CC Capital Partners, and later matched by Bain Capital.</p><p class=\"\">Brookfield's proposal is for cash or shares in an unlisted post-takeover entity, Insignia said.</p><p class=\"\">ASX-listed Insignia, which already opened its books to CC Capital and Bain, granted Brookfield limited due diligence on a non-exclusive basis in hope of attracting a binding offer.</p><p class=\"\">Write to Stuart Condie at stuart.condie@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013445:0/",
            "pub_date": "2025-02-05 07:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013514_20250204013514:0",
            "title": "Stingray 3Q EPS C$0.23 >RAY.A.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013514_20250204013514:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013514_20250204013520:0",
            "title": "Stingray 3Q Adj EPS C$0.34 >RAY.A.T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013514_20250204013520:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013513:0",
            "title": "Standard & Poor's Closing Stock Indexes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                  High        Low      Close     Change <br/>                                  ----        ---      -----     ------ <br/>  S&amp;P SmallCap 600 Index      1,445.21   1,426.05   1,444.29      17.23 <br/>  S&amp;P MidCap 400 Index        3,221.24   3,195.14   3,218.76      19.22 <br/>  S&amp;P 100 Index               2,952.21   2,920.55   2,950.25      26.30 <br/>  S&amp;P 500 Index               6,042.48   5,990.87   6,037.88      43.31 <br/> <br/> <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013513:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5XKSL1:0",
            "title": "North American Construction Group Ltd. Fourth Quarter Results Conference Call and Webcast Notification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ACHESON, Alberta, Feb.  04, 2025  (GLOBE NEWSWIRE) — North American Construction Group Ltd. (“NACG” or “the Company”) (TSX:NOA.TO/NYSE:NOA) announced today that it will release its financial results for the fourth quarter ended December 31, 2024 on Wednesday, March 5, 2025 after markets close. Following the release of its financial results, NACG will hold a conference call and webcast on Thursday, March 6, 2025, at 7:00 a.m. Mountain Time (9:00 a.m. Eastern Time).</p><p class=\"\">The call can be accessed by dialing:</p><p class=\"\">Toll free: 1-800-717-1738</p><p class=\"\">Conference ID: 71653</p><p class=\"\">A replay will be available through April 6, 2025, by dialing:</p><p class=\"\">Toll Free: 1-888-660-6264</p><p class=\"\">Conference ID: 71653</p><p class=\"\">Playback Passcode: 71653</p><p class=\"\">A slide deck for the webcast will be available for download the evening prior to the call and will be found on the company’s website at www.nacg.ca/presentations/</p><p class=\"\">The live presentation and webcast can be accessed at: North American Construction Group Ltd. Fourth Quarter Results Conference Call and Webcast Registration</p><p class=\"\">A replay will be available until April 6, 2025, using the link provided.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the Company</strong></p><p class=\"\">North American Construction Group Ltd. is a premier provider of heavy civil construction and mining services in Canada, the U.S. and Australia. For over 70 years, NACG has provided services to the mining, resource and infrastructure construction markets.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Jason Veenstra, CPA, CA</p><p class=\"\">Chief Financial Officer</p><p class=\"\">North American Construction Group Ltd.</p><p class=\"\">Phone: (780) 960-7171</p><p class=\"\">Email: ir@nacg.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5XKSL1:0-north-american-construction-group-ltd-fourth-quarter-results-conference-call-and-webcast-notification/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0O9:0",
            "title": "China markets return from holiday facing trade war and AI rally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Mainland markets return to tariffs after week-long break</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">HK-listed Chinese shares have surged this week</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Weak yuan fixing could signal Beijing's approach to trade</li></ul></span></div><span><p class=\"\">    China's markets return from a week's break on Wednesday to a fresh trade dispute with the United States and ructions in the global artificial intelligence sector. Investors said they are watching for what Beijing would do to bolster confidence.</p><p class=\"\">The early signs point to a measured open for stock markets on the Mainland. Tariffs so far have been less than what the Trump administration had initially indicated and relief was evident in Hong Kong, where Chinese stocks rallied this week. Enthusiasm around China’s artificial intelligence company DeepSeek is also likely to bolster AI stocks.</p><p class=\"\">Still, investors will look for signals from Beijing on how it sets the tone for things to come.</p><p class=\"\">One of the first such signals would come on Wednesday from where the central bank fixes the yuan , the midpoint in the trading band within which it allows the currency to trade on any given day, analysts said. </p><p class=\"\">Yuan’s weakness helped blunt the impact of tariffs in U.S. President Donald Trump's first term as president, and the fix could hold clues to China's negotiating stance on tariffs.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:799.2895204262877px;aspect-ratio:1.3321492007104796\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-2186c634d6d65c12b7251a4d0f4ccfbc-resized.webp\" type=\"images/webp\"/><img alt=\"China markets in 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-2186c634d6d65c12b7251a4d0f4ccfbc-resized.jpeg\" style=\"background-color:#ececeb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China markets in 2025</span></figcaption></figure></span></p><p class=\"\">Mainland stock markets ,  are also likely to take their cue from Hong Kong, which opened two days earlier after the Chinese New Year holiday. Chinese stocks there rose strongly on Tuesday, despite a move by the Trump administration to impose 10% tariffs on Chinese imports.</p><p class=\"\">Much has happened during China's week-long Lunar New Year holiday. Over the weekend, Trump imposed levies on goods from China, a move that prompted Beijing to announce targeted tariffs on U.S. imports and put several companies, including Google, on notice for possible sanctions. </p><p class=\"\">Trump’s actions, which also included duties on Mexico and Canada, jolted global markets. The tariffs came as the world of artificial intelligence — another major driver for global stocks over the past year — was roiled when China’s DeepSeek unveiled a cheaper AI model just a day before China went on break. That triggered a selloff across technology stocks as investors reassessed the sector's value.</p><p class=\"\">Even so, there was some relief for markets, too. Although he described the initial tranche of tariffs on China as an \"opening salvo,\" they were lower than what Trump has threatened in the past. And the president also gave reprieve to two other trading partners – Canada and Mexico – leading investors to believe that China could strike a deal as well.  </p><p class=\"\">Trump and Chinese leader Xi Jinping are expected to speak soon, although the timing of the conversation is not clear.   \"Any sign that Xi and Trump have a 'good talk' or both countries expressed commitment to work on a deal should qualify as a temporary truce and be supportive of sentiments,\" said Christopher Wong, a currency strategist at OCBC Bank. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:542.4657534246576px;aspect-ratio:0.904109589041096\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-f54affadaa82f22afcf04110560c7e6d-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to Sept. 15, 2024) and the exchange rate of USD/CNY during the trade war between Sept. 15, 2024 and Feb. 4, 2025.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-f54affadaa82f22afcf04110560c7e6d-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets as trade frictions rise in 2025</span></figcaption></figure></span></p><p class=\"\">  Expectations Beijing will do more to support its economy in the face of U.S. tariffs, relief that the tariffs were lower than what Trump had initially threatened and bullishness on the AI and electric vehicle sectors drove gains in Hong Kong. </p><p class=\"\">Chinese companies listed in Hong Kong  rallied more than 4% this week to a three-month high, and tech heavyweights  rallied nearly 7%.</p><p class=\"\">The offshore yuan  has shed 0.6% against the dollar since Jan 27, when mainland markets closed for the holiday, and hit a lifetime low this week. Onshore, the yuan  closed at 7.2469 last week. </p><p class=\"\">Investors will see any attempts by China to weaken the currency as a hint Beijing expects a protracted war and is using the yuan to counter the effect of tariffs, as it did during Trump's first term in 2018.</p><p class=\"\">\"On the whole, having a trade war is not what the market wants... but investors are less likely to panic this time,\" said Elizabeth Kwik, investment director of Asian equities at abrdn, referring to how markets had been positioning for trade tensions for months.</p><p class=\"\">\"The underlying market for Hong Kong is very similar to China, so they should move in the same direction. Market reaction should not be too negative.\"      </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:550px;aspect-ratio:0.9166666666666667\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-a07d774660d5652f1ffb5e51b7709949-resized.webp\" type=\"images/webp\"/><img alt=\"This chart shows the performance of the S&amp;P 500 Composite and Shanghai Stock Exchange A Share (Data rebased to March 1, 2018) and the exchange rate of USD/CNY during the trade war between March 2018 and June 2019.\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L4N3OV0O9-a07d774660d5652f1ffb5e51b7709949-resized.jpeg\" style=\"background-color:#f4f6f8\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China's markets during 2018 trade war</span></figcaption></figure></span></p><p class=\"\">AI BETS</p><p class=\"\">Artificial intelligence-related stocks are likely to rise as they play catch-up to stocks in Hong Kong, riding on bullishness on local technology firms spurred by DeepSeek.</p><p class=\"\">China's top chipmaker SMIC  surged 8.5% to a record high in Hong Kong on Tuesday, and peer Hua Hong Semiconductor  advanced 12.7%.</p><p class=\"\">DeepSeek's development \"provides reason to be more optimistic on China's domestic AI players\" despite U.S. tech curbs, said Jason Chan, a senior investment strategist at Bank of East Asia. Their cheaper valuations compared with global peers could also be a tailwind, he said.</p><p class=\"\">China's benchmark blue chip index  fell 3% in January as investors fretted over the increasingly volatile macro outlook and Beijing's tepid policy response.</p><p class=\"\">Weak economic growth in the world's second-largest economy and trade risks could put pressure on policymakers to roll out more forceful support measures, investors said.</p><p class=\"\">\"China will need to deal with domestic issues including property and consumption, and improve the economic fundamentals regardless of how the tariff war pans out,\" said abrdn's Kwik. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0O9:0-china-markets-return-from-holiday-facing-trade-war-and-ai-rally/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013511:0",
            "title": "Chile's Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Banco de Chile                122.15      +1.04      +0.86 <br/>  Banco Itau Chile           11,250.00    +150.00      +1.35 <br/>  Banco Santander-Chile          51.10      +0.06      +0.12 <br/>  CAP                         5,300.00     -65.20      -1.22 <br/>  Cencosud                    2,526.00      -2.00      -0.08 <br/>  Colbun                        133.00       unch       unch <br/>  Cia Cervecerias Unidas      5,931.00     +31.00      +0.53 <br/>  Cia Sud Amer de Vapores        54.50      +0.10      +0.18 <br/>  Embotelladra Andina Pfd B   3,285.00     +18.10      +0.55 <br/>  Empresa Ncnl de Telecom     3,100.00     +50.00      +1.64 <br/>  Empresas CMPC               1,655.00      +4.00      +0.24 <br/>  Empresas Copec              6,650.00    +159.00      +2.45 <br/>  Enel Americas                  88.00      -0.30      -0.34 <br/>  Enel Generacion Chile         386.11      -2.58      -0.66 <br/>  Falabella                   3,755.00     +99.00      +2.71 <br/>  LATAM Airlines Group           15.02      -0.08      -0.53 <br/>  Parque Arauco               1,764.10     +64.10      +3.77 <br/>  Soc Quimica y Min Chile B  38,985.00    +485.00      +1.26 <br/>  Vina Concha y Toro          1,115.00      +5.00      +0.45 <br/>Prices in Chilean Pesos <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013511:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013500_20250204013509:0",
            "title": "CapitaLand Integrated Commercial Trust: Higher Contribution From Singapore Property Portfolio Supported Results >C38U.SG",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013500_20250204013509:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013512:0",
            "title": "Brazil's Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  B3 Brasil Bolsa Balcao         11.07      -0.09      -0.81 <br/>  Banco Bradesco Pref            12.03      -0.02      -0.20 <br/>  Banco do Brasil Ord            27.77      +0.16      +0.58 <br/>  Banco Santander Brasil         25.50      -0.33      -1.28 <br/>  Braskem Pref A                 13.62      +0.51      +3.89 <br/>  CEMIG Pref                     11.10      -0.09      -0.80 <br/>  Siderurgica Nacional            9.02      -0.01      -0.11 <br/>  Cyrela Brazil Realty Ord       20.67      -0.02      -0.10 <br/>  Embraer                        57.46      -1.96      -3.30 <br/>  Gafisa S/A Ord                  1.37      +0.02      +1.48 <br/>  Gerdau S/A Ord                 15.88      -0.27      -1.67 <br/>  GOL Linhas Aereas Pf            1.55      -0.09      -5.49 <br/>  Itau Unibanco Holding Pfd      33.60      +0.12      +0.36 <br/>  Light S/A Ord                   4.12      -0.09      -2.14 <br/>  Lojas Renner Ord               13.18      -0.38      -2.80 <br/>  Natura &amp; Co. Holding           13.08      +0.36      +2.83 <br/>  Oi S.A. Pref                    8.56      -0.13      -1.50 <br/>  Petroleo Brasileiro Pref       37.13      -0.37      -0.99 <br/>Prices in Brazilian Reals <br/>Prices per 1,000-shares except where noted (a) <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013512:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013517:0",
            "title": "Brazil Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  Hapvida Part e Invest         120,439,600         2.39        -0.05        -2.05 <br/>  Cogna Educacao Ord             45,029,300         1.38        -0.02        -1.43 <br/>  B3 Brasil Bolsa Balcao         40,751,400        11.07        -0.09        -0.81 <br/>  Vale S.A. Ord                  32,648,700        54.02        -0.19        -0.35 <br/>  Magazine Luiza                 28,804,500         7.24        +0.02        +0.28 <br/>  Raizen Pref                    24,726,200         1.83        -0.07        -3.68 <br/>  Ambev S.A. Ord                 23,133,400        10.90        -0.13        -1.18 <br/>  Totvs S/A Ord                  21,121,700        33.47        -0.78        -2.28 <br/>  Rumo Ord                       20,176,700        18.73        +0.08        +0.43 <br/>  CVC Brasil Operadora Ord       18,981,800         1.92        -0.06        -3.03 <br/>  Atacadao                       17,184,200         6.20        -0.16        -2.52 <br/>  Banco do Brasil Ord            16,154,100        27.77        +0.16        +0.58 <br/>  Sendas Distribuidora ADR       14,743,200         6.76        -0.10        -1.46 <br/>  Vibra Energia                  14,311,600        16.52        -0.13        -0.78 <br/>  Lojas Renner Ord               14,219,800        13.18        -0.38        -2.80 <br/>  Cosan Ord                      10,882,300         7.68        -0.12        -1.54 <br/>  Pet Ctr Comercio Ord           10,872,400         4.47        -0.13        -2.83 <br/>  BRF S.A. Ord                   10,860,200        20.79        -0.76        -3.53 <br/>  Natura &amp; Co. Holding            9,063,500        13.08        +0.36        +2.83 <br/>  Marfrig Global Foods S/A        8,816,900        14.73        -0.37        -2.45 <br/>  Prio Ord                        8,540,100        41.23         unch         unch <br/>  MRV Engenharia Ord              8,484,400         5.52        -0.07        -1.25 <br/>  Petroleo Brasileiro Ord         8,210,900        40.62        -0.52        -1.26 <br/>  Eletrobras Ord                  7,971,600        36.11        -0.44        -1.20 <br/>  JBS Ord                         7,938,800        34.29        -1.35        -3.79 <br/>  Localiza Rent A Car Ord         7,933,600        31.66        +0.18        +0.57 <br/>  Equatorial Energia Ord          7,896,200        30.35        +0.21        +0.70 <br/>  Siderurgica Nacional            7,845,100         9.02        -0.01        -0.11 <br/>  NVIDIA BDR                      7,716,761        14.40        +0.24        +1.69 <br/>  CCR                             7,654,400        11.21        -0.01        -0.09 <br/>  Oncoclinicas do Brasil          7,589,600         2.18        +0.07        +3.32 <br/>  Eneva S/A Ord                   7,245,400        11.81        -0.14        -1.17 <br/>  LWSA Ord                        7,008,400         3.21        -0.10        -3.02 <br/>  Suzano Ord                      6,826,300        59.92        -2.53        -4.05 <br/>  Embraer                         6,654,600        57.46        -1.96        -3.30 <br/>  Anima Holding Ord               6,630,900         1.96        +0.01        +0.51 <br/>  Banco Bradesco Ord              6,547,000        10.95        -0.05        -0.41 <br/>  Cyrela Brazil Realty Ord        6,493,400        20.67        -0.02        -0.10 <br/>  Raia Drogasil Ord               6,141,000        20.07        -0.46        -2.24 <br/>  Auren Energia Ord               6,030,400         8.12        +0.01        +0.12 <br/>  Ultrapar Part Ord               5,812,200        16.63        -0.12        -0.72 <br/>  Movida Participacoes            5,785,700         3.72        -0.03        -0.80 <br/>  Weg S/A Ord                     5,745,400        54.06        +0.16        +0.30 <br/>  Cia Brasileira de Dist Or       5,731,900         2.62        -0.03        -1.13 <br/>  Klabin S/A 11                   5,416,300        21.71        -0.83        -3.68 <br/>  Paranaense Ener-COPEL           5,326,200         8.86        +0.14        +1.61 <br/>  Rede d'Or Sao Luiz Ord          5,273,200        28.13        +0.18        +0.64 <br/>  Santos Brasil Part Ord          5,257,600        13.15        -0.01        -0.08 <br/>  Minerva S/A Ord                 4,933,600         4.68        -0.14        -2.90 <br/>  Multiplan Empreend Ord          4,880,200        22.62        +0.01        +0.04 <br/>Prices in Brazilian Reals <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013517:0/",
            "pub_date": "2025-02-05 07:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbxjXjp:0",
            "title": "National Academy of Social Insurance Announces Distinguished Array of National Social Insurance Leaders as New Board Members, Senior Fellows, and Members of the Academy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Washington DC, Feb.  04, 2025  (GLOBE NEWSWIRE) — The National Academy of Social Insurance is pleased to announce several exciting updates for 2025, including: the election and re-election of several of the nation’s top social insurance experts to steer its Board of Directors, the addition of two new Senior Fellows to the Academy’s growing policy team, as well as the election of 64 new Academy Members. </p><p class=\"\">Newly joining the Academy’s Board of Directors are <strong class=\"root-Tkn6WL2y\">Connie Garner</strong> and <strong class=\"root-Tkn6WL2y\">Bradley Hardy</strong>. “Bradley and Connie’s unique skills and vision will enrich the Academy’s board,” said Board Chair Paul Van de Water, “and I thank them for serving.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Connie Garner </strong>brings decades of legislative and public policy expertise across a range of social insurance issues to the Academy’s Board. She is well known for her leadership and advocacy within the disability community, including 17 years as Policy Director for Disability and Special Populations on the U.S. Senate Committee on Health, Education, Labor, and Pensions (HELP), working under Senators Kennedy, Dodd, and Harkin. She has significantly contributed to a wide array of important legislation, including the CLASS Act; the Mental Health Parity Act of 2008; the 2006 and 2009 reauthorization of the $2 billion Ryan White CARE Act; the Family Opportunity Act of 2006; the 2005 reauthorization of Individuals with Disabilities Education Act (IDEA); and the 1999 Ticket to Work and Work Incentives Improvement Act. In addition, at the U.S. Department of Education, Garner served as Director of the Federal Interagency Coordinating Council for Children with Disabilities and as the Secretary of Education's principal liaison on interagency health care matters. She is now President and CEO of Garner Public Policy Strategies and serves as the Executive Director at Allies for Independence. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bradley Hardy</strong> joins the board as a leading expert on economic policy, income volatility, and U.S. poverty. He currently serves as a Distinguished Professor in the McCourt School of Public Policy at Georgetown University; a nonresident senior fellow in Economic Studies at the Brookings Institution; and is a research affiliate of the University of Wisconsin Institute for Research on Poverty, the Columbia University Center on Poverty and Social Policy, the University of Kentucky Center for Poverty Research, and the Social Policy Institute at Washington University in St. Louis. Hardy’s research looks at intra- and inter-generational economic outcomes across three overlapping themes: income and consumption volatility among low-income families, analysis of U.S. income transfer policies and programs for low-income families, and the role of race and place as determinants of economic and policy outcomes. Hardy is also a member of the American Economic Association Committee on Economic Statistics and coeditor of <em>Contemporary Economic Policy. </em></p><p class=\"\">Board members who were re-elected to serve second terms include <!-- -->Aparna Mathur, Alaine Perry, Robert Espinoza, and Merrill Friedman, who will continue serving as the Academy’s Treasurer and a member of its Executive Committee<strong class=\"root-Tkn6WL2y\">. </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">***</strong></p><p class=\"\">With the start of the new year, the Academy is also excited to announce the addition of two of the nation’s leading social insurance experts<strong class=\"root-Tkn6WL2y\">–</strong>M<strong class=\"root-Tkn6WL2y\">ichele Evermore</strong> and <strong class=\"root-Tkn6WL2y\">Jason Fichtner–</strong>as Senior Fellows to bolster the organization’s growing policy team.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Michele Evermore</strong> will focus on improving and modernizing the nation’s unemployment insurance system, improving access to benefits, and centering people in the design of benefits tech. One of the nation’s leading experts on unemployment insurance, Evermore most recently served as a senior fellow at The Century Foundation, a visiting non-resident fellow at the Heldrich Center at Rutgers University, and a visiting faculty member at the University of Massachusetts Labor Center. She also served in the Biden Administration, where she pioneered and led the Department of Labor’s Office on UI Modernization. A longtime Academy Member, Evermore recently served as Principal Investigator of the Academy’s bipartisan Task Force on Modernizing Unemployment Insurance. </p><p class=\"\">“Michele’s fierce leadership on unemployment insurance and benefits tech makes her an invaluable asset to the Academy’s work,” said the Academy’s <strong class=\"root-Tkn6WL2y\">Chief Executive Officer Rebecca Vallas.</strong> “We have learned time and again that the policy sector cannot afford to focus on unemployment insurance only during recessions—and the Academy is incredibly lucky to have Michele joining us to build on her critical work with the Academy’s Task Force on Modernizing UI.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Jason Fichtner</strong> has also joined the Academy as a Senior Fellow. With decades of experience in the retirement policy space, and many years on the Academy’s Board of Directors, Fichtner also serves as the Executive Director of the Retirement Income Institute at the Alliance for Lifetime Income and a Senior Fellow at the Bipartisan Policy Center, and is on the Board of Directors for the FINRA Investor Education Foundation. His areas of expertise include Social Security, federal tax policy, federal budget policy, retirement security, and policy proposals to increase saving and investment.</p><p class=\"\">“Jason’s tremendous ability to work across the ideological spectrum is just one of the many reasons I deeply enjoy working with him,” said the Academy’s<strong class=\"root-Tkn6WL2y\"> Chief Executive Officer Rebecca Vallas. </strong>“I look forward to continuing to work with him in this new role to foster bipartisan momentum on commonsense policy reforms such as modernizing SSI’s antiquated asset limits and other opportunities for cross-sector agreement.”</p><p class=\"\">***</p><p class=\"\">Finally, the Academy is thrilled to welcome a diverse and distinguished class of 64 social insurance leaders as new Members, who were inducted at the Academy’s Annual Membership Meeting last week. Academy Members are nominated by current Members in recognition of significant professional contributions, such as improving the quality of research, administration, or policymaking in one or more areas of social insurance. Members make important contributions to the Academy’s policy, research, education, and leadership development initiatives by serving on expert study panels, task forces, working groups, and committees; speaking at conferences and other Academy events; and serving as collaborators for Academy initiatives.</p><p class=\"\">\"We’re thrilled to welcome our newly elected Members, whose diverse expertise—from research and policymaking to advocacy and service—will help shape the Academy’s work at this pivotal moment,” said<!-- --> Robert Espinoza, a Member of the Academy’s Board of Directors and Chair of the Membership Committee. </p><p class=\"\">Newly elected Academy Members and their affiliations at the time of nomination:</p><p class=\"\">Joan Antolin, <em>Asset Funders Network </em></p><p class=\"\">Alan Barber, <em>The Roosevelt Institute </em></p><p class=\"\">Alison Barkoff, <em>George Washington University </em></p><p class=\"\">Rachel Black, <em>Aspen Institute </em></p><p class=\"\">Robert Blancato, <em>Matz, Blancato &amp; Associates</em></p><p class=\"\">Karen Bledsoe, <em>ABT Associates</em></p><p class=\"\">Tiffany Boiman, <em>Dept of Labor, Women's Bureau</em></p><p class=\"\">Matthew Bryant, <em>WorkComp Strategies</em></p><p class=\"\">David Camp, <!-- -->National Organization of Social Security Claimants’ Representatives</p><p class=\"\">Galen Carey, <em>National Association of Evangelicals</em></p><p class=\"\">Claire Casey,<em> AARP Foundation</em></p><p class=\"\">Makini Chisolm-Straker, <em>Mount Sinai Health System</em></p><p class=\"\">Amber Christ, <em>Justice in Aging</em></p><p class=\"\">Leanne Clark-Shirley, <em>American Society on Aging</em></p><p class=\"\">Kristen Dama,<em> Community Legal Services of Philadelphia</em></p><p class=\"\">Renee Ferguson, <em>Social Security Administration</em></p><p class=\"\">Ernie Fletcher, <em>Fletcher Group</em></p><p class=\"\">LesLeigh Ford, <em>Urban Institute</em></p><p class=\"\">Mary Gable, <em>AFSCME</em></p><p class=\"\">Nan Gibson, <em>JP Morgan Chase Policy Center</em></p><p class=\"\">Sharita Gruberg,<em> National Partnership for Women &amp; Families</em></p><p class=\"\">Dave Guarino, <em>Propel, Inc.</em></p><p class=\"\">Katie Hadji, <em>Office of Senator Bill Cassidy</em></p><p class=\"\">Laura Haltzel, <em>Social Security Administration</em></p><p class=\"\">Natalie Hengstebeck, <em>Office of Management and Budget</em></p><p class=\"\">Jennifer Hoef, <em>Office of Management and Budget</em></p><p class=\"\">Jeff Holland,<em> Peterson Foundation</em></p><p class=\"\">Nev Jones, <em>University of Pittsburgh, School of Social Work</em></p><p class=\"\">Patrick Kennedy, <em>Healthsperien</em></p><p class=\"\">Michael Linden, <em>Washington Center for Equitable Growth</em></p><p class=\"\">Heather Lore,<!-- --> International Association of Industrial Accident Boards and Commissions</p><p class=\"\">Joshua McCabe,<em> Niskanen Center</em></p><p class=\"\">Tara McGuiness, <em>New America, New Practice Lab</em></p><p class=\"\">Ari Ne'eman, <em>Harvard T.H. Chan School of Public Health</em></p><p class=\"\">Katy Neas, <em>The Arc of the United States</em></p><p class=\"\">Lettie Nocera, <em>Bipartisan Policy Center</em></p><p class=\"\">Stephen Nunez, <em>The Roosevelt Institute</em></p><p class=\"\">Aisha Nyandoro, <em>Springboard to Opportunities</em></p><p class=\"\">Helaine Olen, <em>American Economic Liberties Project</em></p><p class=\"\">Sharon Parrott, <em>Center on Budget and Policy Priorities</em></p><p class=\"\">Natasha Pilkauskus, <!-- -->University of Michigan Gerald R. Ford School of Public Policy</p><p class=\"\">Sue Popkin, <em>Urban Institute</em></p><p class=\"\">Kristine Quinio,<em> Social Security Administration</em></p><p class=\"\">Jason Resendez, <em>National Alliance for Caregiving </em></p><p class=\"\">Katie Savin,<em> California State University, Sacramento</em> </p><p class=\"\">Jessica Schubel, <em>White House Domestic Policy Council </em></p><p class=\"\">Chantel Sheaks, <em>US Chamber of Commerce</em></p><p class=\"\">Sherronda Sheppard,<em> Social Security Administration</em> </p><p class=\"\">Heidi Shierholz, <em>Economic Policy Institute</em></p><p class=\"\">Jude Soundar, <em>Microsoft US Government Affairs</em> </p><p class=\"\">Emerson Sprick, <em>Bipartisan Policy Center</em></p><p class=\"\">Pete Subkoviak, <em>Resilient Families Hub</em></p><p class=\"\">Catherine Surbeck, <em>Pennsylvania Workers' Compensation Appeal Board </em></p><p class=\"\">Margaret Swarbrick, <em>Center of Alcohol and Substance Use Studies,</em> <em>Rutgers University</em> <!-- -->Graduate School of Applied and Professional Psychology </p><p class=\"\">Bonnielin Swenor,<em> Johns Hopkins University </em></p><p class=\"\">Jamila Taylor, <em>Institute for Women’s Policy Research</em> </p><p class=\"\">Maria Town, <em>American Association of People with Disabilities</em> </p><p class=\"\">Amy Traub, <em>National Employment Law Project </em></p><p class=\"\">Daniel Van Sant, <em>The Harkin Institute </em></p><p class=\"\">Polina Vlasenko,<em> Social Security Administration </em></p><p class=\"\">Deborah Wagner, <em>Cornell University </em></p><p class=\"\">Sarah Wartell, <em>Urban Institute</em> </p><p class=\"\">Elizabeth Wikler, <em>Robert Wood Johnson Foundation</em></p><p class=\"\">Daniel Wilson, <em>National Council on Aging</em></p><p class=\"\">Tom Novotny</p><p class=\"\">National Academy of Social Insurance</p><p class=\"\">(202) 452-8097</p><p class=\"\">tnovotny@nasi.org</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbxjXjp:0-national-academy-of-social-insurance-announces-distinguished-array-of-national-social-insurance-leaders-as-new-board-members-senior-fellows-and-members-of-the-academy/",
            "pub_date": "2025-02-05 07:00:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV2F3:0",
            "title": "Australia's Insignia Financial gets $1.92 bln offer from Brookfield Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australia's Insignia Financial  said on Wednesday it has received a takeover offer from Brookfield Capital of A$3.07 billion ($1.92 billion), matching the latest offers from Bain Capital and CC Capital Partners for the wealth manager.</p><p class=\"\"> ($1 = 1.5995 Australian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV2F3:0-australia-s-insignia-financial-gets-1-92-bln-offer-from-brookfield-capital/",
            "pub_date": "2025-02-05 07:00:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV1FE:0",
            "title": "Delaware Supreme Court eases path for some companies to leave state",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Wrong standard used to review TripAdvisor move to Nevada</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Shareholders claimed move would be at their expense</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Elon Musk left Delaware, William Ackman plans departure</li></ul></span></div><span><p class=\"\">    The Delaware Supreme Court on Tuesday issued a decision involving TripAdvisor  that could make it easier for some companies to move out of the state, which is the corporate home for about two-thirds of the Fortune 500.</p><p class=\"\">In a 5-0 decision, the court said a trial judge erred by making it too easy for TripAdvisor shareholders to hold controlling shareholder Greg Maffei liable for damages, should the online travel advice company's proposed move to Nevada benefit him at their expense.</p><p class=\"\">Delaware's business-friendly laws have long made the state a favored home for companies, but some prominent business people have been packing up.</p><p class=\"\"> <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/elon-musk/\" rel=\"nofollow\" target=\"_blank\">Elon Musk</a> reincorporated Tesla  in Texas after a Delaware judge struck down as \"unfathomable\" his $56 billion pay package, while billionaire William Ackman plans to move his management company's corporate base to Nevada.</p><p class=\"\">Mark Zuckerberg meanwhile is mulling whether to move his company, Facebook parent Meta Platforms , to Texas from Delaware, the Wall Street Journal reported last week.</p><p class=\"\">In the TripAdvisor case, shareholders Dennis Palkon and Herbert Williamson complained that a move to Nevada would reduce the company's value because the market values Nevada companies lower than Delaware companies.</p><p class=\"\">They also said a move would reduce the litigation exposure of Maffei, who chairs TripAdvisor's parent Liberty TripAdvisor, and other directors - providing them a so-called non-ratable benefit - because Nevada offers greater protections to corporate officers and boards than Delaware offers.</p><p class=\"\">Last February, Vice Chancellor Travis Laster of the Delaware Chancery Court said TripAdvisor could reincorporate in Nevada but the move would be reviewed under Delaware's onerous \"entire fairness\" standard, potentially leading to a damages award.</p><p class=\"\">But in Tuesday's decision, Supreme Court Justice Karen Valihura said the more lenient \"business judgment\" standard of review should apply because the objecting shareholders offered mere speculation about future liabilities.</p><p class=\"\">\"Delaware policy has long recognized the values of flexibility and private ordering,\" she wrote. \"Declining to second-guess directors' decisions to redomesticate where there are no well-pled allegations of a material, non-ratable benefit flowing to the directors or controllers furthers this important policy.\"</p><p class=\"\">Lawyers for Palkon and Williamson did not immediately respond to requests  for comment. Matthew Close, a lawyer for Maffei, said he was pleased with the decision.</p><p class=\"\">Musk, the world's richest person, is asking the Delaware Supreme Court to restore his Tesla pay package.</p><p class=\"\">The case is Maffei et al v Palkon et al, Delaware Supreme Court, No. 125, 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV1FE:0-delaware-supreme-court-eases-path-for-some-companies-to-leave-state/",
            "pub_date": "2025-02-05 07:00:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PLX16AC61:0",
            "title": "BRIEF-Stingray Group Q3 Adjusted EBITDA CAD 42.1 Million Vs. IBES Estimate CAD 40.9 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 04 (Reuters) - Stingray Group Q3 operating cash flow CAD 35.4 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q3 net income CAD 15.7 million</li><li class=\"listItem-bmN0_SHH\">Q3 adjusted net income CAD 23.4 million</li><li class=\"listItem-bmN0_SHH\">Q3 revenue CAD 108.2 million vs. IBES estimate CAD 107.1 million</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PLX16AC61:0-brief-stingray-group-q3-adjusted-ebitda-cad-42-1-million-vs-ibes-estimate-cad-40-9-million/",
            "pub_date": "2025-02-05 07:00:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013445_20250204013464:0",
            "title": "Insignia Has Granted Brookfield Limited Non-Exclusive Due Diligence",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013445_20250204013464:0/",
            "pub_date": "2025-02-05 06:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013472:0",
            "title": "Fair Isaac Shares Down After 1Q Results Miss Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Shares of Fair Isaac declined after the analytics company reported lower-than-expected adjusted earnings and revenue for the first quarter.</p><p class=\"\">The stock was down 6.1% to $1,700 in post-market trading Tuesday. Through the market's close shares have surged 44% in the past 12 months.</p><p class=\"\">The company posted a net profit of $152.5 million, or $6.14 a share, compared with $121.1 million, or $4.80 a share, for the same period a year earlier.</p><p class=\"\">Stripping out one-time items, the company's earnings per share came in at $5.79. Analysts polled by FactSet had forecast adjusted earnings of $6.09.</p><p class=\"\">Revenue rose 15% to $440 million, missing the $452.2 million expected by Wall Street, according to FactSet.</p><p class=\"\">The company maintained its outlook this year for double-digit percentage growth in revenue and earnings unchanged.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013472:0/",
            "pub_date": "2025-02-05 06:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013444_20250204013458:0",
            "title": "Centuria Office REIT Reaffirms FY 2025 Distribution Guidance of 10.1 Australian Cents/Unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013444_20250204013458:0/",
            "pub_date": "2025-02-05 06:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013444_20250204013469:0",
            "title": "Centuria Office REIT Portfolio Occupancy 92.2% at End-December",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013444_20250204013469:0/",
            "pub_date": "2025-02-05 06:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}