{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0YN:0",
            "title": "Manali Petrochemicals Dec-Quarter Consol Profit 52.7 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Manali Petrochemicals Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL PROFIT 52.7 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 1.96 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0YN:0-manali-petrochemicals-dec-quarter-consol-profit-52-7-mln-rupees/",
            "pub_date": "2025-02-05 21:43:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309948:0",
            "title": "December Trade Deficit Widens Significantly on Higher Imports, Lower Exports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The US international trade deficit widened to $98.43 billion in December from a $78.94 billion gap in November, a wider deficit than the $96.8 billion gap expected in a survey compiled by Bloomberg as of 7:35 am ET. </p><p class=\"\">Exports fell in the month, while imports increased. </p><p class=\"\">Imports of industrial supplies, consumer goods and capital goods all increased in December, while imports of auto supplies and food and beverages decreased. </p><p class=\"\">Exports of consumer goods, industrial supplies, capital goods, auto supplies and food and beverages all decreased.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309948:0/",
            "pub_date": "2025-02-05 21:43:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006278:0",
            "title": "Volkswagen to Launch Low-Cost EV as It Charts a Course For Growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Dominic Chopping</p><p class=\"\">Volkswagen outlined a five-year plan for its namesake brand Wednesday that includes launching a new low-cost electric car as it plots a path to growth following a major cost cutting agreement.</p><p class=\"\">Faced with a tough economic environment, high domestic costs, stuttering demand for electric vehicles and increasing competition from lower-cost Chinese EV makers, the German auto giant spent months negotiating ways to boost its competitiveness with worker representatives last year.</p><p class=\"\">After a series of strikes, Volkswagen agreed a deal with its union to reduce its workforce by more than 35,000 and cut billions of dollars a year in costs, while averting immediate factory closures in Germany.</p><p class=\"\">As part of plans to get the Volkswagen brand back on track, it said Wednesday that the company's main Wolfsburg plant will become a key hub for production of a new all-electric compact car platform, with low-cost entry-level electric cars forming a cornerstone of the brand's future path.</p><p class=\"\">VW said it will produce a new entry-level electric model at Wolfsburg that will come with a price tag of about 20,000 euros ($20,761) when it goes into production in 2027.</p><p class=\"\">Ahead of that, the company's first all-electric small car based on an updated platform will reach dealerships next year and cost less than 25,000 euros, it said.</p><p class=\"\">\"With the conclusion of negotiations in December, we set the largest future plan in Volkswagen's history in motion,\" VW Passengers Cars Chief Executive Thomas Schafer said in a statement. \"A key step in this is making e-mobility attractive for everyone.\"</p><p class=\"\">The company said it is creating space at Wolfsburg for modern technologies and introducing new production processes to make the plant its center for all-electric compact cars as well as developing a next generation platform that will also be used for other brands within the group.</p><p class=\"\">It aims to build the next-generation electric Golf on the new platform there, along with the electric T-Roc.</p><p class=\"\">\"It will now be crucial to work consistently on the preparations required for success in the years to come,\" said Daniela Cavallo, Chairwoman of the Volkswagen Works Council. \"Volkswagen must set the course in terms of complexity, work procedures and synergy effects.\"</p><p class=\"\">The company said it has set a target for its VW brand to become the technologically leading volume manufacturer globally by 2030, and at the same time will strengthen competitiveness through cost synergies and extending its existing model portfolio.</p><p class=\"\">It aims to launch nine new models by 2027.</p><p class=\"\">Write to Dominic Chopping at dominic.chopping@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006278:0-volkswagen-to-launch-low-cost-ev-as-it-charts-a-course-for-growth/",
            "pub_date": "2025-02-05 21:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006041:0",
            "title": "U.S. Trade Deficit Widens Again Amid Burgeoning Tariff Spats With Trade Partners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*US Dec Trade Deficit $98.43B; Consensus Deficit $96.8B<br/><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*Nov Trade Bal Revised To Deficit $78.94B From Deficit $78.19B<br/><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*Dec Exports $266.51B, -2.6%; Imports $364.94B, +3.5%<br/><strong class=\"root-Tkn6WL2y\">(13:44 GMT) </strong>U.S. Trade Deficit Widens Again Amid Burgeoning Tariff Spats With Trade Partners</p><p class=\"\">By Joshua Kirby</p><p class=\"\">The U.S. trade deficit grew again at the end of last year as exports slipped, widening a gap the new administration has vowed to address.</p><p class=\"\">Imports increased by 3.5% on month in December while exports fell by 2.6%, taking the deficit to $98.4 billion, rising 25% from $78.2 billion in November, Commerce Department data showed Wednesday. Economists polled by The Wall Street Journal had been expecting the trade deficit to be $96.8 billion in December. For the year as a whole, the U.S. deficit in trade with the rest of the world increased to $918.4 billion from $784.9 billion a year earlier.</p><p class=\"\">In goods alone, the U.S. deficit is running at all-time high, and President Trump has made closing that gap central to policy in his second term in the White House. The president over the weekend set out steep duties on goods imported from neighboring Canada and Mexico before agreeing to delay their implementation. Tariffs have meanwhile been slapped on Chinese goods, drawing retaliatory measures from Beijing, and Trump has also threatened to impose heavy tariffs on goods from the EU, with which the U.S. runs a similarly acute trade deficit.</p><p class=\"\">Write to Joshua Kirby at joshua.kirby@wsj.com; @joshualeokirby</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006041:0/",
            "pub_date": "2025-02-05 21:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006291:0",
            "title": "Treasury Yields, Dollar Weaken Amid Trade-War Pause — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Treasury yields and the dollar weaken as Trump's Gaza takeover proposal squeezes the trade war out of today's headlines. ADP reports 183,000 jobs created by private employers in January, up from an upwardly revised 176,000 in December and higher than consensus of 150,000 in a Wall Street Journal survey. Meanwhile, U.S. trade deficit widens to $98.4 billion in December from November's revised $78.9 billion and versus a forecast of $96.8 billion in a WSJ survey. Yields and the WSJ Dollar Index moved up after the ADP data, before weakening again. The 10-year is at 4.458% and the two-year at 4.187%. The WSJ Dollar Index falls 0.3%.(paulo.trevisani@wsj.com; @ptrevisani)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006291:0/",
            "pub_date": "2025-02-05 21:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205007820:0",
            "title": "DeepSeek and tariffs have roiled the market. History shows deeper pullbacks are coming, this strategist says.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">But American corporations will keep the bull market going, says Truist's Keith Lerner</p><p class=\"\">Despite the bumps for Wall Street to kick off the new year, the S&amp;P 500 SPX has held up fairly well, still positive and just over 1% away from making a new high.</p><p class=\"\">Truist Advisory Services' chief market strategist Keith Lerner says the \"carousel of tariffs\" and DeepSeek-related headlines have upended markets, but things could get much rockier as he urges clients to not react to each one.</p><p class=\"\">While his \"market uptrend remains intact...the latest tariff developments underscore the potential for disruptions and broken pieces that we expected to be part of the investment narrative in 2025.\"</p><p class=\"\">In our call of the day, Lerner also cautions against rushing into buy on market dips caused by those newsy headlines. \"With stocks not far from all-time highs and after a strong January, it's premature to say this current setback presents a great buying opportunity,\" he told clients in a new note.</p><p class=\"\">Over the past 40 years, the market has averaged a maximum intra-year pullback of around 14%, said the strategist. Stocks have also been up in 33 of 40 of those years - 83% of the time.</p><p class=\"\">Positives for stocks? Lerner said they expect the U.S. economy to stay resilient in 2025, given how it weathered the pandemic, high inflation and the fastest Fed rate-hiking cycle in decades. He also notes a more balanced performance across the stock market so far with 10 of 11 large-cap sectors up this year.</p><p class=\"\">He expects earnings will deliver - this current earnings solid has been \"solid,\" with 79% of S&amp;P 500 companies reporting beating consensus earnings estimates-and exceeding those estimates by an average of 6%, he says.</p><p class=\"\">As for where investors should be keeping their money, Lerner says he's holding on to a \"longstanding U.S. equity bias relative to international markets,\" owing to stronger economic and earnings trends.</p><p class=\"\">Lerner prefers large-cap stocks over small-caps, due to strong balance sheets and \"more levers to pull to manage through challenging periods.\" And he also likes midcaps over small-caps, owing to stronger financial footing and better earnings trends.</p><p class=\"\">And he's focused on higher quality when it comes to fixed income, with \"tension between the potential of higher inflation offset by a flight to quality in the 10-year U.S. Treasury yield.\" A modest position in gold is also something he favor right now, and for some investors, allocating to alternative strategies such as hedge funds can help smooth out the bumps  he expects.</p><p class=\"\">The markets</p><p class=\"\">Nasdaq-100 futures (NQ00) are leading declines for U.S. stock futures (ES00) (YM00), with Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y down and the dollar DXY off another 0.5%.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              6037.88    -0.49%  2.18%   2.66%  21.87% <br/>   Nasdaq Composite                                                     19,654.02  -0.40%  0.84%   1.78%  25.91% <br/>   10-year Treasury                                                     4.49       -2.90   -19.80  -8.60  33.32 <br/>   Gold                                                                 2892.8     4.34%   7.94%   9.60%  41.05% <br/>   Oil                                                                  72.36      -0.89%  -1.31%  0.68%  -2.32% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">Alphabet's stock (GOOGL) is tumbling after a revenue miss and big plans for AI spending.</p><p class=\"\">AMD shares (AMD) are sliding after a disappointing outlook for its data-center business, as it won't give AI revenue forecasts anymore.</p><p class=\"\">Mattel (MAT) is jumping on upbeat profit and Barbie forecasts. A disappointing sales forecast is hitting Chipotle shares (CMG).</p><p class=\"\">Disney stock (DIS) is headed for a two-year high after an earnings beat and affirming its outlook.</p><p class=\"\">Uber (UBER) stock is dropping after part of its outlook disappointed investors. Disney shares (DIS) are headed for a two-year high after affirming its outlook and beating earnings.</p><p class=\"\">Ford (F) results and Costco (COST) sales coming after the close.</p><p class=\"\">The U.S. Post Office will stop accepting parcels from China, news that weighed on shares of Amazon.com (AMZN) and Temu owner PDD (PDD).</p><p class=\"\">Private-sector payroll data is coming at 8:15 a.m., the U.S. trade deficit at 8:30 a.m. and the Institute for Supply Management's services survey at 10 a.m. Among Fed speakers, we'll hear from Richmond Fed President Tom Barkin and Chicago Fed President Goolsbee.</p><p class=\"\">Best of the web</p><p class=\"\">Why central banks' hunger for gold shows 'no sign of being quelled' this year.</p><p class=\"\">Trump campaigned on ending foreign entanglements. Now he wants to own Gaza.</p><p class=\"\">The young techies assigned to help Musk slash size of U.S. government.</p><p class=\"\">The chart</p><p class=\"\">The above chart shows how gold miners continue to lag the precious metal (GC00), up 9.6% so far in 2025. TopDown Chart's head of research and founder Callum Thomas, who provided the chart, says gold miners have been in a 5-year trading range, and never caught up from a divergence with gold prices back in 2021. \"But with growth stocks looking increasingly overvalued and at risk in an environment of rising (geo)political risk, and gold prices going from strength to strength I think it's fair to expect some catch-up for miners,\" he writes.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6.a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   TSLA    Tesla <br/>   AMD     Advanced Micro Devices <br/>   PLTR    Palantir Technologies <br/>   GOOGL   Alphabet <br/>   AAPL    Apple <br/>   GME     GameStop <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMZN    Amazon.com <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Egg-ceptional times: police are hunting thieves who stole $40,000 worth of eggs.</p><p class=\"\">A pig bites man story.</p><p class=\"\">No, Scotland will not ban cats, despite a recommendation to do so.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205007820:0/",
            "pub_date": "2025-02-05 21:44:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309944:0",
            "title": "Teladoc Health to Acquire Catapult Health for $65 Million Plus Up to $5 Million In Additional Earnout",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Teladoc Health  said Wednesday it agreed to acquire Catapult Health for $65 million in cash and up to $5 million in additional contingent earnouts. </p><p class=\"\">The deal is expected to close in Q1, at which point Catapult will become part of Teladoc's integrated care division, the company said. </p><p class=\"\">Teladoc said the acquisition supports its efforts to grow membership, broaden services, expand internationally, and advance its scaled mental health offerings. </p><p class=\"\">TDOC shares were 0.4% higher in recent premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309944:0/",
            "pub_date": "2025-02-05 21:44:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1FY:0",
            "title": "GlobalFoundries appoints Tim Breen as CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Contract chipmaker GlobalFoundries  has appointed Tim Breen as its chief executive officer, the company said on Wednesday. </p><p class=\"\">Breen will succeed Thomas Caulfield who will transition to become the company's executive chairman, while Niels Anderskouv will be appointed President and Chief Operating Officer.</p><p class=\"\">The changes will go into effect in April this year. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1FY:0-globalfoundries-appoints-tim-breen-as-ceo/",
            "pub_date": "2025-02-05 21:44:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0MZ:0",
            "title": "Fed leaning toward more rate cuts amid uncertainty, Barkin says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The U.S. <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/markets/us/federal-reserve/\" rel=\"nofollow\" target=\"_blank\">Federal Reserve</a> is still leaning toward further rate cuts this year, although uncertainty about the impact of new Trump administration initiatives on things like tariffs, <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/legal/immigration/\" rel=\"nofollow\" target=\"_blank\">immigration</a> and regulations will need to be better understood, Richmond Fed President Tom Barkin said on Wednesday.</p><p class=\"\">Along with tariffs, there is \"deregulation - where is it going to hit - immigration, energy policy, geopolitics. There is just a lot of uncertainty in the air,\" Barkin said on Bloomberg Television. </p><p class=\"\">But with inflation expected to drop further this year and the economy continuing to grow, \"I start with a baseline that is pretty favorable\" to further cuts, Barkin said. \"That is certainly the lean.\"</p><p class=\"\">Barkin's comments reflect what's become a consensus view at a central bank that has decided to hold its <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/data/federal-reserve-monitor-2024-12-16/\" rel=\"nofollow\" target=\"_blank\">interest rate policy</a> steady while it awaits further data on jobs and inflation, and on the outcome of Trump administration policy initiatives that may be hard to anticipate. </p><p class=\"\">    In just a weekend, for example, President     <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a>     veered from 25%     tariffs     on major trading partners     <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/mexico/\" rel=\"nofollow\" target=\"_blank\">Mexico</a>     and     <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/canada/\" rel=\"nofollow\" target=\"_blank\">Canada</a>     to a month-long delay some economists argue is likely to be extended after negotiations among the neighboring countries.  </p><p class=\"\">    The current policy interest rate of 4.25% to 4.50% remains restrictive and thus should continue to lower inflation to the Fed's 2% target from current levels about half a point above that, Barkin said.   </p><p class=\"\">    But \"you want to wait and see,\" Barkin said, a sentiment shared this week by other Fed officials,     including vice chair Philip Jefferson     in remarks on Tuesday.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0MZ:0-fed-leaning-toward-more-rate-cuts-amid-uncertainty-barkin-says/",
            "pub_date": "2025-02-05 21:44:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX7THSRz:0",
            "title": "President and CEO Dana Erickson Announces New Structure to Senior Leadership Team at Blue Cross and Blue Shield of Minnesota",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EAGAN, Minn., Feb.  05, 2025  (GLOBE NEWSWIRE) — Dana Erickson, president and CEO of Blue Cross and Blue Shield of Minnesota (Blue Cross), has announced a revised structure and a new addition to her senior leadership team. The changes have two established Blue Cross senior team members, Chris Fanning and Carey Smith, taking on expanded responsibilities in their respective fields of market portfolio growth and technology. Additionally, accomplished healthcare leader David Im is joining the organization as Chief Operating Officer.</p><p class=\"\">“These changes to our senior leadership team build upon Blue Cross’ market-leading strengths while creating new opportunities to grow in ways that will further sharpen our customer focus,” said Erickson. “As an organization, Blue Cross has been a champion of providing affordable and accessible healthcare for more than 90 years. The depth of talent, experience and vision across our leaders have us in a great position to continue our journey to a century of serving Minnesota.”</p><p class=\"\">Details behind changes to the Blue Cross senior leadership team include the following:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Chris Fanning, Chief Growth Officer</strong></p><p class=\"\">Fanning joined Blue Cross in 2020 to lead the company’s portfolio of health plans across commercial market clients based in Minnesota, with members located in all 50 states. Now as Chief Growth Officer, Fanning will lead plans and identify opportunities for additional membership across all lines of business, including innovative health plan company Coupe Health.</p><p class=\"\">In his expanded role as Chief Growth Officer, Fanning has accountability for client and membership retention, acquisition and financial performance for both commercial and government markets within the state (including Medicare and Medicaid), as well as Minnesota-based membership within the Blue Cross and Blue Shield Federal Employee Plan. His extensive experience in healthcare includes sales and marketing leadership positions at major health insurers based in Pennsylvania, Virginia and Michigan.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Carey Smith, President of Xcelerate Health </strong></p><p class=\"\">Smith, who has been a member of the Blue Cross senior leadership team since 2022, will focus on developing and implementing technology products and services as president of a newly established business unit called Xcelerate Health. Currently in the early stages of development, Xcelerate Health will be structured and staffed to drive innovation and enhanced capabilities across the healthcare market. At the same time, Smith will continue to have strategic oversight of Blue Cross’ technology architecture and integration under the title of Chief Technology and Innovation Officer.</p><p class=\"\">For more than three decades, Smith has built and delivered modernized and proficient IT solutions that drove transformational change at numerous companies across the insurance, financial services, and manufacturing industries. He first worked for Blue Cross from 2012 to 2017 as an information technology (IT) leader.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">David Im, Chief Operating Officer</strong></p><p class=\"\">David Im is joining Blue Cross as the newest member of Dana Erickson’s senior leadership team. Starting on February 10, Im will be responsible for operational direction and systems oversight of claims, customer service, clinical operations, vendor management, payment integrity, and provider operations.</p><p class=\"\">Im has more than two decades of strategic and operational leadership experience in healthcare. Prior to joining Blue Cross, he was with Centene Corporation in the role of Corporate Vice President of Business Operations, overseeing enrollment, eligibility, member billing, and fulfillment services for 26 million members. His career path also includes tenures at Integra ServiceConnect, Magellan Health, OptumHealth, and Boston Scientific.</p><p class=\"\">Im is a graduate of West Point and served 11 years in the U.S. Army and Minnesota National Guard in various leadership positions, attaining the rank of Major. He spent a total of 40 months on operational and training deployments overseas.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Blue Cross and Blue Shield of Minnesota</strong></p><p class=\"\">For more than 90 years, Blue Cross and Blue Shield of Minnesota (<em>bluecrossmn.com</em>) has supported the health, wellbeing and peace of mind of our members by striving to ensure equitable access to high quality care at an affordable price. Our more than 2.5 million members can be found in every Minnesota county, all 50 states and on four continents. Blue Cross and Blue Shield of Minnesota is an independent licensee of the Blue Cross and Blue Shield Association.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FOR MORE INFORMATION:</strong>                                                </p><p class=\"\">Jim McManus | 651.662.2882</p><p class=\"\">Blue Cross and Blue Shield of Minnesota</p><p class=\"\">Jim.McManus@bluecrossmn.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX7THSRz:0-president-and-ceo-dana-erickson-announces-new-structure-to-senior-leadership-team-at-blue-cross-and-blue-shield-of-minnesota/",
            "pub_date": "2025-02-05 21:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0327f54e4af69:0",
            "title": "Old Dominion Freight Line Reports Fourth Quarter 2024 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Old Dominion Freight Line, Inc., a leading North American less-than-truckload (LTL) motor carrier, has released its financial results for the fourth quarter and full year ending December 31, 2024. The company has reported a decline in revenue and earnings per share (EPS) compared to the previous year, reflecting ongoing economic challenges.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\">For the fourth quarter of 2024, Old Dominion reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Total revenue of $1.39 billion, a decrease of 7.3% from $1.50 billion in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\">Net income of $263.1 million, down 18.5% from $322.8 million in the fourth quarter of 2023.</li><li class=\"listItem-bmN0_SHH\">Diluted earnings per share (EPS) of $1.23, a 16.3% decrease from $1.47 in the prior year.</li><li class=\"listItem-bmN0_SHH\">Operating ratio increased to 75.9% from 71.8% in the fourth quarter of 2023.</li></ul><p class=\"\">For the full year 2024, the company reported:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Total revenue of $5.81 billion, a slight decrease of 0.9% from $5.87 billion in 2023.</li><li class=\"listItem-bmN0_SHH\">Net income of $1.19 billion, down 4.3% from $1.24 billion in 2023.</li><li class=\"listItem-bmN0_SHH\">Diluted EPS of $5.48, a 2.7% decrease from $5.63 in the previous year.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business and Operational Highlights</strong></p> <p class=\"\">Old Dominion's President and CEO, Marty Freeman, noted that the company's financial results were impacted by the softness in the domestic economy. Despite the revenue decline, the company maintained its market share and achieved an on-time service performance of 99% and a cargo claims ratio below 0.1%.</p><p class=\"\">The decrease in revenue was primarily due to an 8.2% decline in LTL tons per day, driven by a 7.6% decrease in LTL shipments per day and a 0.7% decrease in LTL weight per shipment. Excluding fuel surcharges, LTL revenue per hundredweight increased by 3.8%, reflecting the success of the company's long-term yield management strategy.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Initiatives and Corporate Developments</strong></p> <p class=\"\">Old Dominion continued to return capital to shareholders through its share repurchase and dividend programs. In 2024, the company utilized $967.3 million for share repurchases and paid $223.6 million in cash dividends. The Board of Directors declared a first-quarter dividend of $0.28 per share, representing a 7.7% increase compared to the first quarter of 2024.</p><p class=\"\">Capital expenditures for 2024 totaled $771.3 million, with planned expenditures for 2025 expected to be approximately $575 million, including investments in real estate, service center expansion, tractors and trailers, and information technology.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Management's Perspective</strong></p> <p class=\"\">Marty Freeman commented, \"The challenging macroeconomic environment over the past couple of years has created persistent demand headwinds for our business. Nevertheless, our outstanding team has remained focused on executing our proven strategic plan by maximizing our operating efficiencies, maintaining our yield discipline, and investing in our capacity and technology to further improve our service and support future growth.\"</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong></p> <p class=\"\">Old Dominion remains confident in its ability to produce profitable growth and increase shareholder value through continued execution of its long-term strategic plan. The company is well-positioned to win market share once a positive inflection in industry demand occurs.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/878927/000095017025014174/odfl-20250205.htm\" rel=\"nofollow\" target=\"_blank\">OLD DOMINION FREIGHT LINE, INC. [ ODFL ] - 8-K - Feb. 05, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:0327f54e4af69:0-old-dominion-freight-line-reports-fourth-quarter-2024-financial-results/",
            "pub_date": "2025-02-05 21:45:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN1r1w62:0",
            "title": "JBT Marel Corporation: Share capital increase of 493,150 new shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reference is made to a stock exchange announcement, dated 2 January 2025, in respect of the commencement of a compulsory acquisition, made by John Bean Technologies Europe B.V. (the “Offeror”), a wholly owned subsidiary of JBT Marel Corporation (“JBT Marel” or the “Company”), of all remaining and outstanding shares (other than treasury shares) (“Marel Shares”) in Marel hf. (“Marel”) not tendered in the Offeror’s voluntary takeover offer for all issued and outstanding shares of Marel (the “Compulsory Acquisition”).</p><p class=\"\">The Offeror hereby announces that the Compulsory Acquisition has been completed. The Marel shareholders who validly tendered their Marel Shares in the Compulsory Acquisition were able to elect to receive, in exchange for each Marel Share, (a) EUR 3.60 in cash, (b) 0.0265 shares of JBT Marel and EUR 1.26 in cash or (c) 0.0407 shares of JBT Marel, subject to a proration feature. As a result of the application of the proration feature, Marel shareholders who elected to receive (i) EUR 3.60 in cash received, in exchange for each Marel Share, EUR 3.60 in cash, (ii) EUR 1.26 in cash and 0.0265 shares of JBT Marel received, in exchange for each Marel Share, EUR 1.26 in cash and 0.0265 shares of JBT Marel and (iii) 0.0407 shares of JBT Marel received, in exchange for each Marel Share, EUR 1.2073635 in cash and 0.0270961 shares of JBT Marel. Any Marel shareholders that did not make an election received, in exchange for each Marel Share, EUR 1.26 in cash and 0.0265 shares in JBT Marel. As a consequence, the Offeror has assumed ownership of all the shares in Marel.</p><p class=\"\">In the aggregate, at settlement of the Compulsory Acquisition, the remaining shareholders in Marel received approximately EUR 23.6 million in cash and 493,150 shares of JBT Marel.</p><p class=\"\">In connection with the settlement of the Compulsory Acquisition, JBT Marel has issued 493,150 new shares in the Company, par value $0.01 per share (the “<strong class=\"root-Tkn6WL2y\">New Shares</strong>”), delivered to the remaining shareholders of Marel.</p><p class=\"\">Following the issuance of the New Shares, the share capital of JBT Marel amounts to 51,884,100, par value $0.01 per share.</p><p class=\"\">The New Shares have been admitted to trading on the New York Stock Exchange and are expected to be admitted to trading on Nasdaq Iceland imminently.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors &amp; Media</strong></p><p class=\"\">JBTMarel.IR@jbtc.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN1r1w62:0-jbt-marel-corporation-share-capital-increase-of-493-150-new-shares/",
            "pub_date": "2025-02-05 21:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1DP:0",
            "title": "Kroger Health signs contract with Cigna's pharmacy benefit manager",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Kroger Health, a unit of grocer Kroger , said on Wednesday it has entered into a new agreement with Cigna's  Express Scripts, increasing access to prescription drugs at its pharmacies.</p><p class=\"\">In 2022, the grocery retailer had sent Express Scripts a written notice of its plan to terminate their pharmacy provider agreement for commercial customers due to an \"unsustainable\" pricing model.</p><p class=\"\">Under the new agreement, Kroger pharmacies will resume serving customers who are part of Express Scripts' Medicare plans for prescription drugs and health plans for military members.</p><p class=\"\">Additionally, members in Express Scripts' commercial and government-backed Medicaid plans for low income individuals can add Kroger's pharmacies to their respective networks.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1DP:0-kroger-health-signs-contract-with-cigna-s-pharmacy-benefit-manager/",
            "pub_date": "2025-02-05 21:45:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006146:0",
            "title": "Fox Corp. Is Maintained at Equal-Weight by Barclays",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:38 GMT) </strong>Fox Corp. Price Target Raised to $50.00/Share From $39.00 by Barclays</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006146:0/",
            "pub_date": "2025-02-05 21:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006142:0",
            "title": "Clean Harbors to Announce Fourth-Quarter and Full-Year 2024 Financial Results on February 19",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clean Harbors to Announce Fourth-Quarter and Full-Year 2024 Financial Results on February 19</p><p class=\"\">NORWELL, Mass.--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Clean Harbors, Inc. , the leading provider of environmental and industrial services throughout North America, will host its fourth-quarter and full-year 2024 financial results conference call on Wednesday, February 19, 2025, at 9:00 a.m. ET.</p><p class=\"\">On the call, Co-Chief Executive Officers Michael L. Battles and Eric W. Gerstenberg, Chief Financial Officer Eric J. Dugas, and Senior Vice President of Investor Relations Jim Buckley will discuss Clean Harbors' financial results, business outlook and growth strategy.</p><p class=\"\">Those who wish to listen to the conference call webcast should visit the Investor Relations section of the Company's website at www.cleanharbors.com. The live call also can be accessed by dialing 877.709.8155 or 201.689.8881. Listeners are advised to dial in at least 10 minutes prior to the start of the call. If you are unable to listen to the live call, the webcast will be archived on the Company's website.</p><p class=\"\">About Clean Harbors</p><p class=\"\">Clean Harbors  is North America's leading provider of environmental and industrial services. The Company serves a diverse customer base, including a majority of Fortune 500 companies. Its customer base spans a number of industries, including chemical, energy and manufacturing, as well as numerous government agencies. These customers rely on Clean Harbors to deliver a broad range of services such as end-to-end hazardous waste management, emergency spill response, industrial cleaning and maintenance, and recycling services. Through its Safety-Kleen subsidiary, Clean Harbors also is North America's largest re-refiner and recycler of used oil and a leading provider of parts washers and environmental services to commercial, industrial and automotive customers. Founded in 1980 and based in Massachusetts, Clean Harbors operates in the United States, Canada, Mexico, Puerto Rico and India. For more information, visit www.cleanharbors.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250205859159/en/</p><p class=\"\">CONTACT:    Eric J. Dugas</p><p class=\"\">EVP and Chief Financial Officer</p><p class=\"\">Clean Harbors, Inc.</p><p class=\"\">781.792.5100</p><p class=\"\">InvestorRelations@cleanharbors.com</p><p class=\"\">Jim Buckley</p><p class=\"\">SVP Investor Relations</p><p class=\"\">Clean Harbors, Inc.</p><p class=\"\">781.792.5100</p><p class=\"\">Buckley.James@cleanharbors.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006142:0/",
            "pub_date": "2025-02-05 21:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0LX:0",
            "title": "Moldova central bank raises key rate to 6.5% from 5.6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Moldova's central bank raised its key interest rate on Wednesday to 6.5% from 5.6% previously amid an acceleration in consumer price inflation as the country battles an energy crisis.</p><p class=\"\">The bank said in a statement that its decision reflected changes in tariffs for gas and power and to contain inflation. </p><p class=\"\">    The regulator is expected to review the decision on March 20, it added.   </p><p class=\"\">    Annual inflation in Moldova for 2024 stood at 6.9%, the national statistics bureau has said.   </p><p class=\"\">    The bank's governor Anca Dragu said she expected     double-digit inflation     in 2025 due to the energy crisis. Dragu also said a central bank forecast of 3% economic growth this year might be \"too optimistic\".    </p><p class=\"\">Moldova is having to cover its energy needs with more expensive imported electricity after the supply of Russian gas via Ukraine to central and eastern Europe was halted on Jan. 1. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0LX:0-moldova-central-bank-raises-key-rate-to-6-5-from-5-6/",
            "pub_date": "2025-02-05 21:38:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA8FSTM6:0",
            "title": "BlackRock Expands Access to Cash Management Strategies with Launch of Active Money Market ETFs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlackRock Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BLACKROCK EXPANDS ACCESS TO CASH MANAGEMENT STRATEGIES WITH LAUNCH OF ACTIVE MONEY MARKET ETFS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA8FSTM6:0-blackrock-expands-access-to-cash-management-strategies-with-launch-of-active-money-market-etfs/",
            "pub_date": "2025-02-05 21:38:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006153:0",
            "title": "Concentra(R) to Announce Fourth Quarter and Full Year 2024 Results on Monday, March 3, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Concentra(R) to Announce Fourth Quarter and Full Year 2024 Results on Monday, March 3, 2025</p><p class=\"\">ADDISON, Texas--(BUSINESS WIRE)--February 05, 2025--</p><p class=\"\">Concentra(R) Group Holdings Parent, Inc. (\"Concentra\")  will release the financial results for its fourth quarter and full year ended December 31, 2024, on Monday, March 3, 2025, after the market closes.</p><p class=\"\">Concentra will host a conference call regarding its financial results on Tuesday, March 4, 2025, at 9 a.m. Eastern Time. The conference call will be a live webcast and can be accessed via this Earnings Call Webcast Link or via Concentra's website at https://ir.concentra.com. A replay of the webcast will be available shortly after the call at the same locations.</p><p class=\"\">Participants may join the audio-only version of the webcast or participate in the question-and-answer session by calling:</p><p class=\"\">Toll Free: 888-506-0062</p><p class=\"\">International: 973-528-0011</p><p class=\"\">Participant Access: All dial-in participants should ask to join the Concentra call.</p><p class=\"\">About Concentra</p><p class=\"\">Concentra is the largest provider of occupational health services in the United States by number of locations, with the mission of improving the health of America's workforce, one patient at a time. Our approximately 11,000 colleagues and affiliated physicians and clinicians support the delivery of an extensive suite of services, including occupational and consumer health services and other direct-to-employer care. We support the care of approximately 50,000 patients each day on average across 45 states at our 552 occupational health centers, 157 onsite health clinics at employer worksites, and Concentra Telemed as of December 31, 2024.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204383649/en/</p><p class=\"\">CONTACT:    Investor inquiries:</p><p class=\"\">Bill Chapman</p><p class=\"\">Vice President, Strategy and Investor Relations</p><p class=\"\">972-725-6488</p><p class=\"\">ir@concentra.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006153:0/",
            "pub_date": "2025-02-05 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464052:0",
            "title": "Saudi Regulator Authorizes Al-Waa to Test Robo-advisory Platform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saudi Arabia's Capital Market Authority granted Al-Waa for Financial Technologies a permit to test its Robo-Advisory technology. </p><p class=\"\">The financial technology experiment permit was issued after the company completed the business requirements, according to a Wednesday notice.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464052:0/",
            "pub_date": "2025-02-05 21:39:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446766:0",
            "title": "US Exports Drop 2.6% in December",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Exports from the United States fell by $7.1 billion from the previous month to $266.5 billion in December 2024, primarily due to a $7.5 billion decline in goods shipments.</p><p class=\"\">Consumer goods exports dropped by $1.8 billion, led by lower sales of pharmaceutical preparations, while industrial supplies and materials fell by $1.8 billion, driven by declines in crude oil, petroleum products, precious metals, fertilizers, pesticides, and insecticides.</p><p class=\"\">Additionally, capital goods exports decreased by $1.4 billion, notably in computers, while automotive vehicle, parts, and engine exports fell by $0.9 billion, particularly in trucks, buses, special-purpose vehicles, and other automotive parts and accessories.</p><p class=\"\">In contrast, exports of services rose by $0.4 billion, driven by increases in travel and financial services.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446766:0-us-exports-drop-2-6-in-december/",
            "pub_date": "2025-02-05 21:39:12",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309943:0",
            "title": "UBS Adjusts Price Target on Spotify Technology to $720 From $540, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spotify Technology  has an average rating of overweight and mean price target of $622.39, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309943:0/",
            "pub_date": "2025-02-05 21:39:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX1gl60F:0",
            "title": "AITX’s RAD Continues SLED Market Growth with Multiple ROSA Orders",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RAD To Deploy ROSA Units in High-Traffic Urban Waterfront District</p><p class=\"\">Detroit, Michigan, Feb.  05, 2025  (GLOBE NEWSWIRE) — – Robotic Assistance Devices, Inc. (RAD), a subsidiary of Artificial Intelligence Technology Solutions, Inc. (the “Company”) (OTCPK:AITX), continues to expand its presence within the State, Local, and Education (SLED) market sector, securing new deployments of its autonomous security solutions. Organizations across these sectors are turning to RAD’s innovative technology to enhance public safety, reduce security costs, and provide proactive deterrence against crime. The Company has successfully placed RIO™ and ROSA™ devices in a range of environments, including municipal spaces, educational institutions, and high-traffic public districts, with additional deployments expected in the near future.</p><p class=\"\">As part of its expanding footprint, RAD recently received an order for four ROSA units set to be deployed in a busy urban waterfront district in a major Midwestern city. These security devices will provide AI driven autonomous proactive deterrence in addition to incident detection, and continuous surveillance, deterrence in a high-traffic area frequented by residents, businesses, and visitors. The deployment reflects the growing demand among public sector organizations and improvement districts for AI-powered security solutions that enhance safety while optimizing operational efficiency.</p><p class=\"\">Recent data indicates that local governments are prioritizing public safety and security in their budgets. In 2023, cities increased their spending by an average of 6.7% compared to 2022, with a significant portion allocated to public safety initiatives1. Looking ahead, experts anticipate that local governments will continue to elevate their investment in public safety technologies2. This trend includes the adoption of artificial intelligence and other emerging technologies aimed at enhancing security and efficiency.</p><p class=\"\">“This latest order is another indicator that cities and counties are embracing autonomous security as a vital component of their safety strategies,” said Troy McCanna, Chief Security Officer of RAD. “The positive reception we’ve seen in cities across the country reinforces the effectiveness of our solutions and the growing demand for cost-effective, responsive security technology.”</p><p class=\"\">Utilized by the popular solar-powered RIO trailers, these ROSA units will be mounted on existing light poles, utilizing a continuous 24/7 power source. This installation method ensures uninterrupted operation, making ROSA an ideal solution for urban districts requiring persistent security coverage without reliance on solar charging or a large footprint.</p><p class=\"\">“As communities continue evaluating innovative security solutions, many are also exploring RAD’s SARA™ (Speaking Autonomous Responsive Agent) technology,” concluded McCanna. “By incorporating SARA, the clients have the potential to further reduce costs while enhancing community engagement and overall security effectiveness.” With additional orders expected soon, RAD is positioning itself as the go-to provider for cities, counties and states looking to enhance safety while maintaining operational efficiency.</p><p class=\"\">ROSA is a multiple award-winning, compact, self-contained security and communication device that can be installed and activated in about 15 minutes. Its AI-driven capabilities include human, firearm, and vehicle detection, license plate recognition, responsive digital signage, audio messaging, and seamless integration with RAD’s software suite for real-time notifications and autonomous intelligent responses. Two-way communication is optimized for cellular, including live video from ROSA’s high-resolution, full-color, always-on cameras. RAD has published six Case Studies detailing how ROSA has helped eliminate instances of theft, trespassing and loitering at retail centers, hospital campuses, multi-family communities, car rental locations and construction sites across the country.</p><p class=\"\">AITX, through its primary subsidiary, Robotic Assistance Devices, Inc. (RAD), is redefining the nearly $50 billion (US) security and guarding services industry3 through its broad lineup of innovative, AI-driven Solutions-as-a-Service business model. RAD solutions are specifically designed to provide cost savings to businesses of between 35%-80% when compared to the industry’s existing and costly manned security guarding and monitoring model. RAD delivers these tremendous cost savings via a suite of stationary and mobile robotic solutions that complement, and at times, directly replace the need for human personnel in environments better suited for machines. All RAD technologies, AI-based analytics and software platforms are developed in-house. </p><p class=\"\">RAD has a prospective sales pipeline of over 35 Fortune 500 companies and numerous other client opportunities. RAD expects to continue to attract new business as it converts its existing sales opportunities into deployed clients generating a recurring revenue stream. Each Fortune 500 client has the potential of making numerous reorders over time.</p><p class=\"\">AITX is an innovator in the delivery of artificial intelligence-based solutions that empower organizations to gain new insight, solve complex challenges and fuel new business ideas. Through its next-generation robotic product offerings, AITX’s RAD, RAD-R, RAD-M and RAD-G companies help organizations streamline operations, increase ROI, and strengthen business. AITX technology improves the simplicity and economics of patrolling and guard services and allows experienced personnel to focus on more strategic tasks. Customers augment the capabilities of existing staff and gain higher levels of situational awareness, all at drastically reduced cost. AITX solutions are well suited for use in multiple industries such as enterprises, government, transportation, critical infrastructure, education, and healthcare. To learn more, visit www.aitx.ai, www.radsecurity.com, www.radcam.ai, www.stevereinharz.com, www.radgroup.ai, www.raddog.ai, and www.radlightmyway.com, or follow Steve Reinharz on Twitter @SteveReinharz.</p><p class=\"\">CAUTIONARY DISCLOSURE ABOUT FORWARD-LOOKING STATEMENTS</p><p class=\"\">The information contained in this publication does not constitute an offer to sell or solicit an offer to buy securities of Artificial Intelligence Technology Solutions, Inc. (the “Company”). This publication contains forward-looking statements, which are not guarantees of future performance and may involve subjective judgment and analysis. The information provided herein is believed to be accurate and reliable, however the Company makes no representations or warranties, expressed or implied, as to its accuracy or completeness. The Company has no obligation to provide the recipient with additional updated information. No information in this publication should be interpreted as any indication whatsoever of the Company’s future revenues, results of operations, or stock price.</p><p class=\"\">###</p><p class=\"\">Steve Reinharz</p><p class=\"\">949-636-7060</p><p class=\"\">@SteveReinharz</p><p class=\"\">1 https://www.nlc.org/resource/city-fiscal-conditions-2024/</p><p class=\"\">2 https://www.americancityandcounty.com/government-technology/in-2025-public-safety-technology-will-be-a-spending-priority-for-cities-and-counties/</p><p class=\"\">3 https://www.ibisworld.com/united-states/market-research-reports/security-services-industry/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX1gl60F:0-aitx-s-rad-continues-sled-market-growth-with-multiple-rosa-orders/",
            "pub_date": "2025-02-05 21:40:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1DA:0",
            "title": "Street View: All eyes on Pfizer's pipeline, obesity drug update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Pfizer  on Tuesday beat Wall Street estimates for fourth-quarter profit driven by cost cuts and steadier COVID vaccine sales</p><p class=\"\">** PFE has been looking to show investors steadier execution and growth after large swings related to its COVID-19 vaccine</p><p class=\"\">OBESITY DATA IS 'LITMUS TEST' FOR PIPELINE </p><p class=\"\">** BMO Capital Markets (\"Outperform\", PT: $38) says Pfizer continues to execute the plan outlined for investors in what is shaping up to be a manageable macro and political environment </p><p class=\"\">** J.P Morgan (\"Neutral\", PT: $30) says that while it sees several assets in PFE's pipeline (particularly in oncology) that could make the story more interesting, further progress is necessary to change the narrative on shares</p><p class=\"\">** Guggenheim Partners (\"Buy\", PT: $33) says data from Pfizer's experimental obesity drug, danuglipron, will be a \"litmus test for the company's pipeline productivity\" </p><p class=\"\">** Leerink (\"Market Perform,\" PT: $28) says \"management is executing well and delivering results above expectations, but we await future pipeline developments\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1DA:0-street-view-all-eyes-on-pfizer-s-pipeline-obesity-drug-update/",
            "pub_date": "2025-02-05 21:40:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309835:0",
            "title": "Full Circle Lithium Provides Updates on U.S. Tariffs and Patent Application",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Full Circle Lithium  on Wednesday said it understands that its proprietary FCL-X lithium-ion battery fire extinguishing agent business is not subject to the recently announced - and then postponed - tariffs by the U.S. federal government applicable to Canadian goods. </p><p class=\"\">The company has an operating unit and plant in Georgia and can manufacture its products also in Canada as opportunities develop. </p><p class=\"\">Full Circle Lithium has also completed several live demonstrations with US Fire Pump and AEST Fire &amp; Safety, its two distributor partners, in front of US fire safety industry experts, to demonstrate the effectiveness of FCL-X in extinguishing toxic and hard-to-control lithium-ion battery fires. </p><p class=\"\">FCL has received an initial, non-binding report from an international patent searching authority that has indicated that the claimed subject matter of FCL's patent application for FCL-X is both new and inventive. The company believes this is a positive preliminary indication that FCL may eventually receive some measure of patent protection for its FCL-X. </p><p class=\"\">Shares of the company closed up $0.020, or 5.1%, to $0.410 on Tuesday on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309835:0/",
            "pub_date": "2025-02-05 21:40:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_SEEt1RNHa:0",
            "title": "Albania sells 46.4 mln euro of 2032 T-bonds, above target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TIRANA (Albania), February 5 (SeeNews) - Albania's finance ministry sold nearly 4.6 billion leks ($48.4 million/46.4 million euro) worth of seven-year bonds at an auction held on Wednesday, surpassing its 4 million euro initial offer, central bank data showed.</p><p class=\"\">The government securities carry a 4.05% coupon and will mature on February 7, 2032, the central bank said in a data release.</p><p class=\"\">Details follow (in billions of leks unless stated otherwise):</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tr><td>Auction date</td><td>Feb 5, 2025</td><td>Nov 20, 2024</td></tr><tr><td>Amount offered</td><td>4</td><td>3</td></tr><tr><td>Amount sold</td><td>4.599</td><td>3.45</td></tr><tr><td>Total bids placed</td><td>9.712</td><td>8.12</td></tr><tr><td>Bid-to-cover ratio</td><td>2.11</td><td>2.35</td></tr><tr><td>Maximum accepted yield</td><td>4.05%</td><td>4.85%</td></tr><tr><td>Coupon rate</td><td>4.05%</td><td>5.36%</td></tr></table></div><p class=\"\">(1 euro = 99.04 Albanian leks)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_SEEt1RNHa:0-albania-sells-46-4-mln-euro-of-2032-t-bonds-above-target/",
            "pub_date": "2025-02-05 21:40:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309941:0",
            "title": "Sector Update: Tech",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Technology stocks were falling premarket Wednesday as the Technology Select Sector SPDR Fund (XLK) was down 0.2% and the SPDR S&amp;P Semiconductor ETF (XSD) was 1.1% lower recently. </p><p class=\"\">Alphabet  reported Q4 earnings late Tuesday that topped analysts' estimates and revenue that lagged market expectations. The company's shares were down 7.7% pre-bell Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309941:0-sector-update-tech/",
            "pub_date": "2025-02-05 21:40:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309932:0",
            "title": "January ADP US Private Payrolls Rise More Than Expected Ahead of Friday's BLS Data",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ADP's monthly measure of private payrolls showed a 183,000 increase in January, above expectations compiled by Bloomberg as of 7:35 am ET for an increase of 150,000. </p><p class=\"\">The January gain followed an upwardly revised 176,000 increase in December. </p><p class=\"\">By sector, goods-producing jobs fell by 6,000, led by a 13,000 decrease in manufacturing jobs, while service-providing jobs were up 190,000, with trade, transportation and utilities jobs up 56,000 and leisure and hospitality jobs up 54,000. </p><p class=\"\">\"We had a strong start to 2025 but it masked a dichotomy in the labor market,\" said Nela Richardson, chief economist at ADP. \"Consumer-facing industries drove hiring, while job growth was weaker in business services and production.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309932:0/",
            "pub_date": "2025-02-05 21:34:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309912:0",
            "title": "Ford Motor Appoints Sherry House as CFO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ford Motor  said Wednesday that Sherry House has been named to succeed John Lawler as chief financial officer, effective Feb. 6. </p><p class=\"\">House has served as vice president of finance since June 2024, the company said</p><p class=\"\">Lawler will continue to serve as Ford's vice chair, focusing on strategy, partnerships, alliances, and corporate development, the company said. </p><p class=\"\">Additionally, Ford named Marin Gjaja as chief strategy officer.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309912:0/",
            "pub_date": "2025-02-05 21:34:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:0e8f1f182094b:0",
            "title": "MORE U.S. DEC TRADE: 2024 CHINA DEFICIT $295.4 BLN VS $279.1 BLN IN 2023",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:0e8f1f182094b:0-more-u-s-dec-trade-2024-china-deficit-295-4-bln-vs-279-1-bln-in-2023/",
            "pub_date": "2025-02-05 21:35:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205006121:0",
            "title": "Acrivon Therapeutics Gets FDA Breakthrough Device Designation for Cancer Identification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Acrivon Therapeutics said the Food and Drug Administration has granted Breakthrough Device designation for its ACR-368 OncoSignature assay, an immunofluorescence assay for the identification of endometrial cancer patients who may benefit from ACR-368 treatment.</p><p class=\"\">The precision medicine company said the new designation reflects the FDA's determination that the device is reasonably expected to provide for more effective treatment or diagnosis of life-threatening or irreversibly debilitating human disease or conditions.</p><p class=\"\">The company said it sponsored a blind, third-party market research study, which showed strong interest in the emerging clinical profile of ACR-368.</p><p class=\"\">The Breakthrough Devices Program is intended to provide patients and health-care providers with timely access to medical devices by speeding up development, assessment and review for premarket approval, 510(k) clearance, and marketing authorization.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205006121:0-acrivon-therapeutics-gets-fda-breakthrough-device-designation-for-cancer-identification/",
            "pub_date": "2025-02-05 21:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}