{
    "data": [
        {
            "id": "newsbtc:953679da0094b:0",
            "title": "Vitalik Buterin Lays Out A Plan To Make Ethereum 1,000 Times More Capable",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The number sounds almost too big to take seriously. Ethereum co-founder Vitalik Buterin posted a detailed technical roadmap on February 27 outlining how the network could handle up to 1,000 times its current transaction capacity — without pricing out the smaller node operators who keep the system decentralized.</span></p><p class=\"\"><span>The document, which Buterin informally calls the “Strawmap,” breaks the work into three problem areas: execution, data, and state.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Near-Term Upgrades Come First</span></strong></p><p class=\"\"><span>The closest item on the list is an upcoming protocol upgrade called “Glamsterdam.” According to reports, one of its key changes introduces block-level access lists — a technical adjustment that allows different parts of a block to be processed simultaneously rather than one after another.</span></p><p class=\"\"><span>Reports also say the upgrade improves how efficiently each 12-second block slot is used, making it safer to pack more transactions into every block without destabilizing the network.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">vitalik.eth</div><div class=\"username-n2KCMK3i\">@VitalikButerin</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>Now, scaling.</span></p><p class=\"\"><span>There are two buckets here: short-term and long-term.</span></p><p class=\"\"><span>Short term scaling I’ve written about elsewhere. Basically:</span></p><p class=\"\"><span>* Block level access lists (coming in Glamsterdam) allow blocks to be verified in parallel. * ePBS (coming in Glamsterdam) has many features, of…</span></p></div><span class=\"date-n2KCMK3i\">Feb 27, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/VitalikButerin/status/2027403360484430122\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>Buterin acknowledged that these changes, combined with better client software, might be enough to reach a stable state on their own. If real usage stays low, he suggested the full 1,000x push could be shelved in favor of other priorities entirely.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Zero-Knowledge Proofs Take Center Stage In Longer Plans</span></strong></p><p class=\"\"><span>The more ambitious part of the roadmap involves zero-knowledge Ethereum Virtual Machines, or ZK-EVMs. Rather than requiring every validator to re-run every transaction to confirm it is legitimate, ZK-EVMs allow validators to check cryptographic proofs instead — a far lighter task.</span></p><p class=\"\"><span>According to reports, Buterin’s timeline calls for a small group of validators to begin using this method as early as 2026, with broader adoption potentially following in 2027. If that plays out, the network’s capacity ceiling could be raised significantly without forcing node operators to invest in more powerful hardware.State Growth Gets Its Own Fix </span></p><p class=\"\"><span>Reports say Buterin flagged state growth as a separate and underappreciated problem. Deploying a large smart contract adds data that every Ethereum node must store permanently — and that accumulated storage gradually raises the cost of running a node at all.</span></p><p class=\"\"><span>His proposed fix tracks state creation gas independently, so it does not count against the regular transaction gas cap. Large contracts could still be deployed, but their pricing would reflect the real long-term storage cost.</span></p><p class=\"\"><span>The 1,000x figure is a long-term ceiling, not a promise for next year. Each phase of the plan depends on the one before it working as intended.</span></p><p class=\"\"><em><span>Featured image from Unsplash, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:953679da0094b:0-vitalik-buterin-lays-out-a-plan-to-make-ethereum-1-000-times-more-capable/",
            "pub_date": "2026-03-01 02:00:57",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:8ecc9f939094b:0",
            "title": "Judge blocks Binance from pushing class action suits over token sales into arbitration",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>A federal judge in Manhattan has denied Binance's attempt to force arbitration in a class action alleging the exchange sold unregistered digital tokens to U.S. investors, according to a Thursday opinion from the U.S. District Court for the Southern District of New York.</span></p><p class=\"\"><span>Judge Andrew L. Carter Jr. found that Binance failed to properly notify users when it amended its Terms of Use in February 2019 to add an arbitration clause and class action waiver. The plaintiffs, residents of California, Nevada and Texas, all created their Binance accounts between September 2017 and April 2018, when no such provisions existed.</span></p><p class=\"\"><span>The case traces back to a wave of class action lawsuits filed in April 2020 against major crypto exchanges and token issuers. It was initially dismissed in 2022 but revived by the Second Circuit in 2024, which held that U.S. securities laws applied to Binance even without a physical domestic headquarters. The Supreme Court declined to review that ruling in January 2025.</span></p><p class=\"\"><span>Binance argued its 2019 terms should govern, but the court noted that simply posting updated terms on a website, without individualized notice, was insufficient. The original 2017 terms included a change-of-terms provision, but the court cited Ninth Circuit precedent holding that users have no obligation to periodically check whether the other side has unilaterally changed a contract.</span></p><p class=\"\"><span>Even assuming the plaintiffs gained actual notice of the arbitration clause through the litigation itself, the court held the provision could not reach backward. Under California law, a unilateral modification silent on whether it applies to accrued claims is \"restricted based on the implied covenant of good faith and fair dealing.\"</span></p><p class=\"\"><span>The class action waiver also failed. While a heading in Binance's terms references a \"CLASS ACTION WAIVER,\" the body of the section never details the terms of such a waiver. The court called the language ambiguous and interpreted the adhesion contract against Binance as drafter.</span></p><p class=\"\"><span>The plaintiffs had previously voluntarily dismissed claims arising after the February 2019 effective date, narrowing the case to pre-2019 conduct. Binance founder Changpeng Zhao, who pleaded guilty to federal crimes in 2023, was pardoned by President Trump in October 2025.</span></p><p class=\"\"><span>The ruling comes as Binance's U.S. regulatory picture has shifted. The SEC moved to dismiss its own enforcement action against the exchange last May. But this private class action remains active, and Thursday's opinion clears a significant procedural hurdle for the plaintiffs.</span></p><p class=\"\"><span>Binance did not immediately respond to a request for comment.</span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:8ecc9f939094b:0-judge-blocks-binance-from-pushing-class-action-suits-over-token-sales-into-arbitration/",
            "pub_date": "2026-03-01 01:52:30",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM0U7:0",
            "title": "UK minister quits despite review clearing him over alleged journalist investigation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A British government minister resigned on Saturday even though a review found he had not breached the ministerial code after reports accused him of ordering the investigation of journalists while he was running a think-tank.</span></p><p class=\"\"><span>A review by Prime Minister Keir Starmer's ethics adviser found that Josh Simons, a junior minister involved in government plans for a new digital ID scheme, had not breached the code.</span></p><p class=\"\"><span>\"It is clear that my remaining in office has now become a distraction from this government's important work,\" Simons wrote in a letter to Starmer, seen by Reuters. </span></p><p class=\"\"><span>\"For that reason, and with sadness and regret, I offer my resignation.\"</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM0U7:0-uk-minister-quits-despite-review-clearing-him-over-alleged-journalist-investigation/",
            "pub_date": "2026-03-01 01:54:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011514:0",
            "title": "Trump Bars Anthropic From Federal Agencies and Hegseth Labels It a Supply Chain Risk. Here's Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Evie Liu and Al Root</span></p><p class=\"\"><span>President Donald Trump said on Friday that he is directing all federal agencies to phase out the use of technology developed by the artificial-intelligence company Anthropic, including its Claude models.</span></p><p class=\"\"><span>The announcement came amid an escalating dispute between the company and the Department of Defense. Trump's directive was issued shortly before the Pentagon's deadline for Anthropic to agree to broader military access to its systems.</span></p><p class=\"\"><span>After that deadline passed, Defense Secretary Pete Hegseth said he was designating Anthropic a supply chain risk.</span></p><p class=\"\"><span>Anthropic CEO Dario Amodei has refused to accede to Pentagon demands that would allow its AI tools to be used without the company's restrictions, particularly in scenarios involving lethal force, surveillance, or other high-stakes applications.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Trump said in a social media post that most federal agencies must immediately cease using Anthropic's technology, and they would have a six-month window to remove the systems where they are already embedded.</span></p><p class=\"\"><span>Anthropic has reportedly won a contract last summer that's worth up to $200 million from the Defense Department, The Wall Street Journal reported last month.</span></p><p class=\"\"><span>Anthropic is a private company, so there is no publicly confirmed revenue figure for the firm. But Bloomberg has estimated that Anthropic's revenue run rate exceeded $9 billion at the end of 2025, which makes the loss of a $200 million contract trivial.</span></p><p class=\"\"><span>But the impact of Friday's moves by the U.S. leaders goes well beyond government contracts.</span></p><p class=\"\"><span>A \"supply-chain risk to national security,\" which Hegseth designated Anthropic, is typically applied to foreign companies. Rarely does the U.S. government label a major domestic company this way.</span></p><p class=\"\"><span>In the past, the Federal Communications Commission has named China's Huawei Technologies and ZTE Corporation as a national security risk to U.S. communications networks and supply chains.</span></p><p class=\"\"><span>Being designated a supply chain risk not only means no government contracts for Anthropic, defense contractors such as Lockheed Martin and Northrop Grumman also can't use Anthropic technology.</span></p><p class=\"\"><span>Neither company immediately responded to a request for comment about their relationship with Anthropic.</span></p><p class=\"\"><span>\"Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,\" wrote Hegseth in the X post.</span></p><p class=\"\"><span>Traditional defense stocks might not react to the conflict. Investors should keep an eye on Palantir. It is responsible for implementing a lot of AI technology at the Pentagon and has collaborated with Anthropic recently.</span></p><p class=\"\"><span>Palantir didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Palantir stock was unfazed on Friday, rising 0.9% to $137.20, while the S&amp;P 500 and Dow Jones Industrial Average fell 0.4% and 1.1%, respectively. Palantir shares were down 0.2% in after-hours trading.</span></p><p class=\"\"><span>The Anthropic conflict could open the door for other AI labs — notably OpenAI, Google's Gemini, and Elon Musk's xAI — to gain additional business with the defense industry.</span></p><p class=\"\"><span>Last year, OpenAI was awarded a contract worth up to $200 million to \"develop prototype frontier AI\" tools for military and national security applications. xAI was recently acquired by SpaceX, which already does a lot of business with the U.S. military and NASA.</span></p><p class=\"\"><span>But they will face the same discussions over terms for classified use of their models. While other AI labs' relationship with the government have not yet escalated to a public dispute, employees at OpenAI and Google have already protested or signed petitions opposing unrestricted military use of their companies' AI tools.</span></p><p class=\"\"><span>Write to Evie Liu at evie.liu@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011514:0/",
            "pub_date": "2026-03-01 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM5VMkN3a:0",
            "title": "YBS SA - Raport kwartalny za II kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_183716_0000001412_0000065187.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM5nY4P8a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_183716_0000001412_0000065188.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM6Clf2ra\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM5VMkN3a:0-ybs-sa-raport-kwartalny-za-ii-kwarta/",
            "pub_date": "2026-03-01 01:37:30",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:ebab718fc263c:0",
            "title": "Magle Chemoswed Holding AB enters into exclusive license agreement for amniotic stem cell technology",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Magle Chemoswed Holding AB (“Magle Chemoswed”) today announces that Magle Chemoswed Holding AB and its subsidiary Magle Biopharma AB (together, the “Licensors”) have entered into an exclusive license agreement (the “Agreement”) with</span></strong><strong class=\"root-Tkn6WL2y\"><span>Aktiebolaget Grundstenen 178422</span></strong><strong class=\"root-Tkn6WL2y\"><span>which has applied for a name change to Alvion Bio AB (“Alvion Bio”), granting Alvion Bio exclusive worldwide rights to develop and commercialise the Group’s amniotic stem cell technology.</span></strong></p><p class=\"\"><span>Alvion Bio has been established for the sole purpose of developing and commercialising the licensed technology and is owned by Justin Pierce, former Chief Executive Officer of Magle Group.</span></p><p class=\"\"><span>Under the Agreement, Alvion Bio will assume full responsibility for the continued development, regulatory advancement, and commercialisation of the licensed technology within the defined field.</span></p><p class=\"\"><span>The Agreement is not expected to have a material impact on Magle Chemoswed’ s financial results in 2026 but is expected to reduce operating costs by approximately SEK10 million and may generate future royalty revenue.</span></p><p class=\"\"><span>The licensed technology comprises intellectual property, know-how, cell lines, manufacturing processes, data, and related materials associated with amniotic stem cell–derived products. Alvion Bio has been established specifically to continue development activities and pursue regulatory approval and commercialisation of therapeutic products based on the licensed technology.</span></p><p class=\"\"><span>As part of the transaction:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Alvion Bio receives an exclusive, worldwide licence to the technology and related intellectual property;</span></li><li class=\"listItem-bmN0_SHH\"><span>As consideration for the licence, Magle Chemoswed AB and Magle Biopharma AB shall receive a royalty equal to four percent (4%) of all revenues generated from the commercialisation of the Licensed Technology and/or Licensed IPR by Alvion Bio, its Affiliates, and its Sublicensees. The obligation to pay royalties shall commence upon the first receipt of any Commercial Use Revenue by Alvion Bio, its Affiliates, or Sublicensees derived from the Licensed Technology and/or Licensed IPR. Royalties shall be payable on an ongoing basis for as long as Alvion Bio, its Affiliates, Sublicensees, or any successors or assigns continue to generate or receive Commercial Use Revenue from the Licensed Technology and/or Licensed IPR, and shall continue irrespective of whether any Licensed Patent has expired, lapsed, been abandoned, invalidated, or otherwise ceased to be in force.</span></li><li class=\"listItem-bmN0_SHH\"><span>Alvion Bio assumes full operational, regulatory, development, and commercial responsibility and associated risks from the effective date; and</span></li><li class=\"listItem-bmN0_SHH\"><span>Magle Group will provide limited transitional support during 2026 related to patent maintenance and transfer of documentation and materials.</span></li></ul><p class=\"\"><span>“This agreement represents an important strategic milestone for Magle Group. It enables a structured exit from the amniotic stem cell field while preserving long-term value potential through royalties and participation in future commercial success. At the same time, it allows us to sharpen our focus on our core business and strategic priorities,” said Aaron Wong, interim CEO of Magle Chemoswed Holding AB.</span></p><p class=\"\"><span>The Agreement was entered into on 28 February 2026, and becomes effective immediately.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contacts Aaron</span></strong></p><p class=\"\"><span>Aaron Wong, Interim CEO, CFO, phone +46 (0)76 664 35 79, aaron.wong@maglegroup.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Us</span></strong></p><p class=\"\"><span>The Magle Group aims to establish itself as a leader in high-quality life-changing healthcare innovations to meet medical needs through scientific excellence. The Magle Group is founded on strategic acquisitions aimed at driving growth and diversifying risk. Today, the Group includes three operational areas. Magle Chemoswed – a contract development and manufacturing organization (CDMO) with a strong reputation for its high-quality development and manufacturing expertise and Magle PharmaCept – an established sales and marketing company for development and direct sales of the Groups medical technology products. Magle Biopolymers A/S- a specialized manufacturing organization of Dextran technology. Learn more on</span><strong class=\"root-Tkn6WL2y\"><span>www.maglechemoswed.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglegroup.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglepharmacept.com</span></strong><span>and</span><strong class=\"root-Tkn6WL2y\"><span>www.maglebiopolymers.com</span></strong></p><p class=\"\"><span>Redeye Sweden AB is the company's Certified Adviser.</span></p><p class=\"\"><em><span>This information is information that Magle Chemoswed is obliged to make public pursuant to the EU Market Abuse Regulation. The information was submitted for publication, through the agency of the contact persons set out above, at 2026-02-28 18:40 CET.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/03632e61-ac63-4567-afad-4ddda3c61655/magle-chemoswed-holding-ab-enters-into-exclusive-license-agreement-for-amniotic-stem-cell-technology.pdf\" rel=\"nofollow\" target=\"_blank\">Magle Chemoswed Holding AB enters into exclusive license agreement for amniotic stem cell technology</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:ebab718fc263c:0-magle-chemoswed-holding-ab-enters-into-exclusive-license-agreement-for-amniotic-stem-cell-technology/",
            "pub_date": "2026-03-01 01:40:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000828:0",
            "title": "Anthropic Responds to President Trump in the Battle Over AI Weapons. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Al Root</span></p><p class=\"\"><span>Artificial-intelligence start-up Anthropic doesn't appear to be going away quietly in its battle with the Trump administration over the future of autonomous AI-trained weapons.</span></p><p class=\"\"><span>It provided a forceful response to the War Department's labeling of the company a \"supply chain risk.\" That threatens how Anthropic and other defense contractors conduct business.</span></p><p class=\"\"><span>On Friday, President Trump directed all federal agencies to phase out the use of technology developed by Anthropic, including its popular Claude models.</span></p><p class=\"\"><span>\"THE UNITED STATES OF AMERICA WILL NEVER ALLOW A RADICAL LEFT, WOKE COMPANY TO DICTATE HOW OUR GREAT MILITARY FIGHTS AND WINS WARS,\" said the president in a Friday post on Truth Social.</span></p><p class=\"\"><span>Anthropic and the Trump administration had been going back and forth on limits to the use of AI technology. Anthropic didn't want its systems used in mass surveillance or in autonomous weapons that would make kill or do-not-kill decisions without any human intervention.</span></p><p class=\"\"><span>\"In conjunction with the President's directive for the Federal Government to cease all use of Anthropic's technology, I am directing the Department of War to designate Anthropic a Supply-Chain Risk to National Security,\" added War Secretary Pete Hegseth in a Friday tweet.</span></p><p class=\"\"><span>That designation essentially bars Anthropic from doing business with the government, as well as stopping other defense contractors from using Anthropic technology.</span></p><p class=\"\"><span>\"We have tried in good faith to reach an agreement with the Department of War, making clear that we support all lawful uses of AI for national security aside from the two narrow exceptions,\" reads part of a lengthy Friday statement from Anthropic.</span></p><p class=\"\"><span>\"We believe this [supply chain] designation would both be legally unsound and set a dangerous precedent for any American company that negotiates with the government,\" added the company. \"No amount of intimidation or punishment from the Department of War will change our position on mass domestic surveillance or fully autonomous weapons. We will challenge any supply chain risk designation in court.\"</span></p><p class=\"\"><span>The White House and Defense Department didn't immediatly respond to a request for comment about Anthropic's response.</span></p><p class=\"\"><span>Anthropic added that the supply chain risk designation would only prevent contractors from using its products in government business.</span></p><p class=\"\"><span>That distinction might not matter. \" Nvidia, Amazon, [and Google parent Alphabet], will have to divest from Anthropic if Hegseth gets his way. This is simply attempted corporate murder,\" wrote former Trump advisor Dean Ball on X. \"I could not possibly recommend investing in American AI to any investor; I could not possibly recommend starting an AI company in the United States.\"</span></p><p class=\"\"><span>Ball fears that the Trump administration has essentially made itself the strictest, de facto regulator of AI technology on the planet, adding in another tweet that he hopes for \"de-escalation.\"</span></p><p class=\"\"><span>What happens next is anyone's guess. Investors in defense contractors, drone makers, and Palantir Technologies will be paying attention to how things play out.</span></p><p class=\"\"><span>Write to Al Root at allen.root@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000828:0/",
            "pub_date": "2026-03-01 01:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000822:0",
            "title": "Marriott International Wins Court Battle Over Maasai Mara Safari Camp in Kenya — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Caroline Kimeu</span></p><p class=\"\"><span>NAIROBI — A Kenyan court dismissed a lawsuit by a Maasai leader who sought to demolish a Ritz-Carlton luxury safari camp, alleging it blocked a key route of the famous Serengeti migration.</span></p><p class=\"\"><span>The court this week sided with Marriott International, owner of the Ritz-Carlton brand, the Kenyan camp's owner-operator Lazizi Mara and the Kenyan government over Meitamei Olol Dapash, who brought the lawsuit.</span></p><p class=\"\"><span>Dapash, an elder of the Maasai ethnic group and head of the Maasai Environmental Resource Coalition, had argued the new camp stands at a critical point on the Sand River where wildebeest and zebra cross as they move from Tanzania's Serengeti National Park to Kenya's Maasai Mara National Reserve and adjacent conservancies in search of grass.</span></p><p class=\"\"><span>The owner of the Ritz-Carlton camp, which charges upward of $3,500 per guest per night during peak season, denied the allegations, saying it had secured necessary approvals from Kenyan authorities.</span></p><p class=\"\"><span>\"We remain committed to full environmental compliance, responsible stewardship, and constructive engagement with regulatory authorities and local stakeholders,\" Lazizi Mara said after the court announced its decision.</span></p><p class=\"\"><span>In her ruling, the judge said Dapash should have taken the dispute to an environmental tribunal before going to court. She also ruled he hadn't provided enough initial evidence to justify an order halting the camp's operations, while Lazizi Mara had presented the required environmental licenses and proof that it had consulted with the Maasai community about the development.</span></p><p class=\"\"><span>Dapash didn't respond to requests for comment on the ruling.</span></p><p class=\"\"><span>In response to questions, Marriott issued a statement Saturday saying it \"is committed to integrity, transparency, and respect for the environments and communities in which hotels under our brand operate.</span></p><p class=\"\"><span>Dapash himself had attempted to withdraw the lawsuit in December, citing ongoing talks with the developers. However, the court said the case touched on matters of public interest and should continue to play out.</span></p><p class=\"\"><span>Lazizi Mara also asked for the case to proceed, saying it would give the camp a chance to reverse the reputational damage it had suffered amid online furor over the suit.</span></p><p class=\"\"><span>Tensions between development and conservation have been growing in the Maasai Mara, where the number of camps and lodges, many built along scenic rivers, has nearly doubled over the past decade.</span></p><p class=\"\"><span>Kenyan authorities introduced a 2023 moratorium on new construction in response to concerns over poorly regulated development in the 580-square-mile reserve. However, the government granted the Ritz-Carlton camp an exemption from the directive, calling the move necessary to attract investors.</span></p><p class=\"\"><span>Supporters of the development say it generates jobs and tax revenue, while conservationists fear the developments may stifle the very spectacle hundreds of thousands of tourists visit to see each year.</span></p><p class=\"\"><span>Write to Caroline Kimeu at caroline.kimeu@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000822:0/",
            "pub_date": "2026-03-01 01:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:152eea1d5094b:0",
            "title": "RECAP, U.S. and Israel officials waiting confirmation ongoing attempt to decapitate Iran's leadership has been successful; Trump urges govt takeover",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>WASHINGTON (MaceNews) - The broad U.S. and Israel attack Saturday on Iran, which is said to include hundreds of targets over several days, has triggered retaliatory missile attacks on U.S. bases in the region.</span></p><p class=\"\"><span>Iran claims a girls school with several dozen casualties was among the targets.</span></p><p class=\"\"><span>President Trump urged Iran's people to now take over the government. In a video he said, \"Our objective is to defend the American people by eliminating imminent threats from the Iranian regime, a vicious group of very hard, terrible people.\"</span></p><p class=\"\"><span>He continued, recounting Iranian attacks over the years. \"It's been mass terror and we're not going to put up with it any more.\" He said Iran was rebuilding its capability to produce nuclear weapons.</span></p><p class=\"\"><span>\"We are going to destroy their missile industry to the ground,\" he said. \"We're going to annihilate their navy. We're going to ensure that the .. terrorist proxies can no longer destabilize the region.\"</span></p><p class=\"\"><span>To the Islamic Revolutionary Guard and police forces, Trump said, \"Lay down your weapons and have complete immunity or in the alternative face certain death.\"</span></p><p class=\"\"><span>To the 90 million Iranian people, he said, \"Take over your government. It will be yours to take. This will probably be your only chance for generations.\" He said, \"Now is the time to seize control of your destiny and to unleash the prosperous and glorious future that is close within your reach.\" Israel Prime Minister Netanyahu echoed Trump's exhortation.</span></p><p class=\"\"><span>Prominent Democratic lawmakers immediately responded with criticism. Rep. Seth Moulton issued a statement and told CNN that the Trump administration had destroyed the pact and inspections that had stalled Iran's nuclear ambitions during Trump's first term and falsely claimed to have obliterated its nuclear capabilities during his second term. Now the new attack, he said, seemingly did not include plans for what happens afterward, a key blunder in the U.S. attack on Iraq. \"Bluster and bomb is not a strategy,\" he said. \"Trump's utter stupidity will get Americans killed.\"</span></p><p class=\"\"><span>Several Republican lawmakers praised the operation. Chairman of the Senate Armed Services Committee Roger Wicker said it was \"a pivotal and necessary operation,\" though one done without prior authorization from Congress.</span></p><p class=\"\"><span>Some members of Congress were notified in advance of the joint U.S. and Israel attack but, some said, not about its immense scope and aim to kill Iran's leadership. Officials said the attack will be spread over several days in what has been named \"Operation Epic Fury.\" Meanwhile Iranian missiles targeted U.S. installations in Bahrain, the U.A.E., Kuwait and Qatar with many of the incoming projectiles intercepted, Saudi Arabia was also a target and missiles were intercepted over Ryadh.</span></p><p class=\"\"><span>Oil tankers began avoiding the Iran-controlled Strait of Hormuz and oil prices were expected to skyrocket when trading in oil futures resumed.</span></p><p class=\"\"><span>Israel officials said three separate gathering places for Iranian officials were hit simultaneously without immediate confirmation Iran's Supreme Leader was among those killed. The U.S and Israel attacks, which are continuing against what was described as hundreds of targets, were launched during daylight hours in Iran. Initial reactions from some other countries, like China, were of dismay at the unfolding situation with several international experts warning of destabilizing forces being unleashed across the Mideast.</span></p><p class=\"\"><span>The United Nations security Council is convening a meeting Saturday in reaction to the military operation with condemnations from U.N. Secretary General Antionio Guterres. \"The use of force by the United States and Israel against Iran and the subsequent retaliation by Iran across the region undermine international peace and security,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/macenews:152eea1d5094b:0-recap-u-s-and-israel-officials-waiting-confirmation-ongoing-attempt-to-decapitate-iran-s-leadership-has-been-successful-trump-urges-govt-takeover/",
            "pub_date": "2026-03-01 00:54:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000814:0",
            "title": "What Images of Kim Jong Un's Daughter at Military Parade Tell Us About Her Rise — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Dasl Yoon and Andrew Barnett</span></p><p class=\"\"><span>At military parades of authoritarian regimes, it's not often a girl takes center stage.</span></p><p class=\"\"><span>But Kim Ju Ae, believed to be roughly 13 years old, is far from typical. She's the daughter of Kim Jong Un, the third-generation leader of North Korea — and the only one of the dictator's children to have ever been shown in public. Her growing profile has South Korea's spy agency believing she is increasingly positioned to succeed her father, although North Korea has stayed mum on the succession topic.</span></p><p class=\"\"><span>In photographs and videos released by state media, the Wednesday night appearance at a military parade signaled much about her growing prominence and the power dynamics among the regime's elite — in a country where images of the ruling Kims are carefully orchestrated pieces of propaganda.</span></p><p class=\"\"><span>The look</span></p><p class=\"\"><span>The positioning</span></p><p class=\"\"><span>Proximity is power in North Korea. Kim Ju Ae, in various parade photos, stood closest to her father. Top military and diplomatic officials often faded to the background.</span></p><p class=\"\"><span>The women</span></p><p class=\"\"><span>Of the females close to Kim Jong Un, his daughter took center stage. Her mother was photographed to the side, behind or even out of focus. Parade photos of Kim Yo Jong, the dictator's powerful younger sister, weren't prominent.</span></p><p class=\"\"><span>The intrigue swirling around Kim Ju Ae will persist. North Korea hasn't even officially confirmed her age or full name.</span></p><p class=\"\"><span>Her frequent appearances are a stark departure from the traditional secrecy surrounding children of the ruling Kim family. Whether she is the successor or not, the Kim regime is curating a public rollout to normalize a fourth generation of leadership.</span></p><p class=\"\"><span>Write to Dasl Yoon at dasl.yoon@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000814:0/",
            "pub_date": "2026-03-01 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACS3BwjZa:0",
            "title": "OCR Group Berhad Delivers Strong Q4 FY2025 Profit Surge with PBT Rising 69.1% YoY to RM6.2 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>PETALING JAYA, MY / ACCESS Newswire / February 28, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>OCR Group Berhad</span></strong><span> (\"</span><strong class=\"root-Tkn6WL2y\"><span>OCR</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Group</span></strong><span>\"), an integrated real estate company specialising in property development and project management, announced its unaudited financial results for the fourth quarter ended 31 December 2025 (\"Q4 FY2025\"), </span><span>recording revenue of RM71.7 million and profit before tax (\"PBT\") of RM6.2 million, reflecting a strong rebound in operational performance driven by accelerated construction progress and improved project billings.</span></p><p class=\"\"><span>For the current quarter, revenue surged significantly to RM71.7 million compared to RM4.0 million in Q4 FY2024, supported primarily by progress recognition from Residensi Akasia (Kyra Collection) in Shah Alam under the Rumah Selangorku scheme, alongside completed units from Isola KLCC and The Mate @ Damansara Jaya. </span><span>PBT rose 69.1% year-on-year to RM6.2 million from RM3.7 million previously, demonstrating stronger earnings conversion despite a higher financing cost environment.</span></p><p class=\"\"><span>On a quarter-on-quarter basis, revenue expanded 91.5% from RM37.5 million in Q3 FY2025, while PBT more than tripled from RM1.8 million in the immediate preceding quarter. The sequential improvement reflects accelerated site progress at Residensi Akasia (Kyra Collection) and Stellar Damansara, coupled with sales of completed units at Isola KLCC and The Mate @ Damansara Jaya, as well as improved cost absorption arising from higher development activity.</span></p><p class=\"\"><span>For the full financial year ended 31 December 2025 (\"FY2025\"), </span><span>OCR recorded cumulative revenue of RM184.9 million, nearly doubling from RM94.6 million in FY2024. Full-year PBT improved to RM7.6 million from RM7.0 million previously, supported by stronger property development contributions and disciplined cost management across ongoing projects.</span></p><em><span>Billy Ong Kah Hoe, Group MD of OCR Group Berhad</span></em><p class=\"\"><span>Group Managing Director of OCR Group Berhad, Billy Ong Kah Hoe commented, \"Q4 marks a strong operational turnaround for the Group, with meaningful acceleration in revenue recognition and improved profitability. The progress achieved at Residensi Akasia (Kyra Collection) and our ongoing developments reflects the strength of our project pipeline and execution capabilities. We remain focused on maintaining cost discipline while driving sales momentum across our key developments.\"</span></p><p class=\"\"><span>The Group's Property Development segment continued to anchor performance, contributing the majority of quarterly revenue as construction milestones advanced. Residensi Akasia remains a key earnings driver, while Stellar Damansara and The Mate @ Damansara Jaya continue to provide revenue visibility.</span></p><p class=\"\"><span>In Q4 FY2025, OCR also launched D'Templer Hilltop Residences in Rawang, a RM344 million gross development value (\"GDV\") landed residential project comprising bungalow lots as well as 2-storey and 3-storey semi-detached homes. Strategically located along Jalan Rawang with proximity to Bukit Lagong Forest Reserve and Commonwealth Park, the development reinforces OCR's focus on lifestyle-oriented housing in growth corridors.</span></p><p class=\"\"><span>OCR is optimistic for 2026, setting the stage for its pipeline of launches, including a mixed commercial and residential development project at Jalan Alor and </span><em><span>Residensi Begonia</span></em><span> (Phase II of Kyra Collection). Looking ahead, the RM81.0 billion in development expenditure allocations under Budget 2026, alongside Malaysia's projected GDP growth of 4.0% to 4.5%, continues to provide a supportive backdrop for the domestic property market. The RM20 billion Housing Credit Guarantee Scheme is expected to further stimulate first-time homebuyer demand, particularly within the affordable segment where OCR has established a strong presence.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>###</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT OCR GROUP BERHAD</span></strong></p><p class=\"\"><span>OCR Group Berhad (\"OCR\") is a full-fledged property player that prioritises customers' wellbeing at our core. OCR's integrated businesses of property development, construction and project management consultation embody the holistic approach of delivering value to stakeholders.</span></p><p class=\"\"><span>Led by a visionary, nimble and young management team, and backed by over 20 years' experience in completing more than RM2.2 billion Gross Development Value of projects, OCR's dynamism is best encapsulated in its unique project designs and innovative concepts to gain a strong following.</span></p><p class=\"\"><span>OCR focuses on providing innovative and unique homes in Klang Valley and up-and-coming hotspots in Malaysia. The Group's property development portfolio consists of three key segments, namely Essential Living, Urban Living and Luxury Living. Essential Living brand consist of affordably priced homes targeted towards the mass population, while Urban Living is marketed towards those who desire chic and modern lifestyles. Its Luxury Living label is largely targeted at the high-end crowd that prioritises premium living at prime locations.</span></p><p class=\"\"><span>Additionally, OCR has established a presence in the industrial properties segment with the successful launch of OCR Selayang Industrial Park in 2021.</span></p><p class=\"\"><span>For more information, visit https://ocrbhd.com/.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issued By:</span></strong><span> Swan Consultancy Sdn. Bhd. on behalf of OCR Group Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chris Ser</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> c.ser@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> OCR Group Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACS3BwjZa:0/",
            "pub_date": "2026-03-01 00:50:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSBbl8Na:0",
            "title": "Advancecon Returns to Full-Year Profitability with RM423.1 Million Revenue in FY2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KUALA LUMPUR, MY / ACCESS Newswire / February 28, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>Advancecon Holdings Berhad</span></strong><span> (前进控股有限公司) (\"Advancecon\" or \"the Group\") (Bursa:5281), an established provider of earthworks and civil engineering services in Malaysia, today announced its financial results for the fourth quarter ended 31 December 2025 (\"Q4 FY2025\"), marking the Group's return to full-year profitability following steady operational improvements and consistent project execution.</span></p><p class=\"\"><span>For the quarter under review, the Group recorded revenue of RM105.6 million, representing an increase of 5.0% compared to RM100.5 million in the corresponding quarter last year (\"Q4 FY2024\"). Profit attributable to owners of the Company stood at RM3.1 million, compared to a loss of RM3.6 million previously. The improved performance was primarily attributable to continued strong project execution and improved operational efficiency from the Group's core Construction and Support Services segment.</span></p><p class=\"\"><span>On a full-year basis, Advancecon recorded revenue of RM423.1 million, representing an increase of 10.4% from RM383.2 million in FY2024. The Group reported a profit attributable to owners of RM6.7 million, compared to a loss of RM22.7 million in the previous year. This reflects a successful turnaround driven by improved operational performance, cost optimisation efforts, and more disciplined project management across its business segments.</span></p><p class=\"\"><span>Notably, FY2025 also marked an important milestone for the Group, with Advancecon delivering four consecutive quarters of profit attributable to owners of the Company during the financial year. This reflects greater operational stability and consistency following measures undertaken to strengthen execution and improve overall efficiency. The Group's consistent quarterly profit performance reflects a structurally stronger and more sustainable earnings base.</span></p><p class=\"\"><span>As at </span><strong class=\"root-Tkn6WL2y\"><span>31 December 2025</span></strong><span> , Advancecon's outstanding order book stood at approximately </span><strong class=\"root-Tkn6WL2y\"><span>RM756 million</span></strong><span> , compared to </span><strong class=\"root-Tkn6WL2y\"><span>RM673 million as at 31 December 2024</span></strong><span> . This improvement has been supported by a series of strong contract wins secured over the past six months, with the Group securing new contracts totalling approximately RM229.5 million, reflecting continued participation in infrastructure and development projects. The order book provides ongoing work visibility for the Group's core construction activities. With a strengthened order book of approximately RM756 million and continued contract momentum, the Group is well-positioned to deliver sustained earnings growth over the next 24 months. The current order book provides strong earnings visibility through FY2027, underpinned by active participation in infrastructure and development projects.</span></p><p class=\"\"><span>Mdm. Phum Boon Eng, Managing Director of Advancecon Holdings Berhad , said: \"We are encouraged by the Group's return to full-year profitability and the consistency achieved over the past four quarters. This milestone marks not just a turnaround, but the beginning of Advancecon's next growth phase, as well as, the collective efforts of our team in strengthening execution, improving efficiency, and maintaining discipline in project delivery. With a strengthened order book we are confident in delivering sustainable earnings growth and long-term value for our stakeholders. We remain focused on operational stability and prudent project selection as we continue to carry out our existing works.\"</span></p><p class=\"\"><span>Advancecon's Construction and Support Services segment remained the primary contributor to revenue and profitability, supported by ongoing infrastructure and township development projects. The Group's quarry operations under Spring Energy Resources Berhad and its renewable energy segment also continued to contribute to the Group's overall operations.</span></p><p class=\"\"><span>Advancecon's renewable energy subsidiary continues to operate its solar assets, including a 37.7MWp large-scale solar farm in Kuala Langat, Selangor, which commenced operations in November 2024, as well as rooftop solar installations.</span></p><p class=\"\"><span>Separately, the Group's joint development with Perak Corporation Berhad for the Silver Valley Technology Park in Perak remains part of its longer-term business activities, and represents a key long-term value creation platform for the Group, with significant earnings potential as development progresses over its multi-phase rollout.</span></p><p class=\"\"><span>Malaysia's construction sector continues to be supported by infrastructure and development activities across both public and private sectors. The Group remains focused on its core competencies in earthworks and civil engineering while continuing to execute its existing projects. The Group is also well-positioned to benefit from increasing infrastructure investments, industrial expansion, and renewable energy development in Malaysia, which collectively support sustained construction activity across key growth corridors.</span></p><p class=\"\"><span>Despite ongoing cost pressures arising from regulatory changes and industry competition, the Group's improving financial position, strengthening order book, and consistent operational execution provide a solid foundation for continued growth. Management remains confident that Advancecon is well-positioned to build on its turnaround momentum and deliver sustainable earnings improvement in the coming financial year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>###</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT ADVANCECON HOLDINGS BERHAD</span></strong></p><p class=\"\"><span>Founded in 1990, Advancecon is primarily involved in the provision of earthworks and civil engineering services in Malaysia, as well as related support services such as the sale of construction materials, hiring of machinery, and ad-hoc general construction services. The Group was listed on the Main Market of Bursa Malaysia on 10 July 2017.</span></p><p class=\"\"><span>Advancecon's wide range of earthworks services encompass excavation and fill, rock-blasting, ground treatment works, erosion and sediment control plan, as well as compaction and surface finishing processes. On the civil engineering services front, Advancecon specializes in road works, drainage works, bridge construction, water supply works, and sewerage works.</span></p><p class=\"\"><span>To date, Advancecon has undertaken earthworks and civil engineering works for notable projects nationwide, including various township developments such as Bandar Setia Alam, Setia EcoHill, Setia Eco Gardens, Eco Majestic and Tropicana Aman, as well as infrastructure projects in relation to the construction of highways and railway such as West Coast Expressway (WCE), South Klang Valley Expressway (SKVE), Trumpet Interchange and Ecohill Link connected to Lebuhraya Kajang Seremban (LEKAS) Highway and East Coast Rail Link (ECRL).</span></p><p class=\"\"><span>In 2019, Advancecon also established a renewable energy subsidiary, Advancecon Solar Sdn Bhd, which will undertake the development and/or operations of power generation from solar and other renewable energy projects. It currently owns revenue-generating rooftop solar assets of more than 1.2MWp and also a 37.7MWp large-scale solar farm in Kuala Langat, Selangor which commenced operation on 8 November 2024.</span></p><p class=\"\"><span>In 2021, Advancecon further completed the acquisition of a 51% stake in Spring Energy Resources Berhad (\"Spring Energy\"), which is an integrated quarry operation management and service provider involved in contract quarry operations, provision, marketing and management of quarry products, related advisory services, as well as the undertaking of quarry-related earthworks and civil engineering works.</span></p><p class=\"\"><span>In 2024, Advancecon entered into a Joint Development Agreement with Perak Corporation Berhad to develop Silver Valley Technology Park (SVTP) on an 816-acre land in Kanthan, Perak, with an estimated Gross Development Value of RM1.0 billion, which is envisioned to be a state-of-the-art industrial park.</span></p><p class=\"\"><span>For more information, please visit https://www.advancecon.com.my/.</span></p><p class=\"\"><span>Issued By: Swan Consultancy Sdn. Bhd. on behalf of Advancecon Holdings Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chris Ser</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> c.ser@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Advancecon Holdings Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSBbl8Na:0/",
            "pub_date": "2026-03-01 00:55:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM9n44KTa:0",
            "title": "YBS SA - Raport kwartalny za IV kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_173346_0000001410_0000065177.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM8cydsta\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_173346_0000001410_0000065178.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM5h9yZMa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM9n44KTa:0-ybs-sa-raport-kwartalny-za-iv-kwarta/",
            "pub_date": "2026-03-01 00:34:01",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO0A1:0",
            "title": "India braces for hotter-than-normal summer, more heatwave days expected",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>India is set to experience a hotter-than-normal summer this year, with heatwave days during March and May expected to exceed the seasonal average, the weather office said on Saturday.</span></p><p class=\"\"><span>In March, the first month of the summer season, minimum temperatures are likely to remain above average across most areas, said Mrutyunjay Mohapatra, director-general of the India Meteorological Department (IMD).</span></p><p class=\"\"><span>In February, both maximum and minimum temperatures were above average, making it the fifth-warmest February since records began in 1901, according to IMD data.</span></p><p class=\"\"><span>Winter crops such as wheat, rapeseed, and chickpeas are planted from October to December and require cold weather conditions throughout their growth cycle for optimal yields.</span></p><p class=\"\"><span>Above-average temperatures in March could affect the grain size of maturing winter-sown crops, potentially reducing yields, said a Mumbai-based dealer with a global trade house.</span></p><p class=\"\"><span>India, the world's second-largest wheat producer and biggest importer of edible oils, is counting on bumper 2026 crops to export surplus wheat and cut costly imports of palm, soy and sunflower oils.</span></p><p class=\"\"><span>\"Above-normal heatwave days are expected over most parts of the country during March to May 2026,\" said Mohapatra.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO0A1:0-india-braces-for-hotter-than-normal-summer-more-heatwave-days-expected/",
            "pub_date": "2026-03-01 00:21:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2955229:0",
            "title": "PNPN: Ultra-pure graphene, scalable tech, and regulatory wins set stage for rapid commercial growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Graphene production technology enables ultra-pure, high-speed material at low cost, with regulatory approvals and strategic partnerships positioning for rapid commercial expansion. Large-scale orders and Nasdaq listing are anticipated, with strong margins and a robust patent portfolio.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2955229:0-pnpn-ultra-pure-graphene-scalable-tech-and-regulatory-wins-set-stage-for-rapid-commercial-growth/",
            "pub_date": "2026-03-01 00:24:37",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSqKR0Ca:0",
            "title": "New to The Street to Broadcast Executive Leadership Interviews Featuring Medicus Pharma Ltd. (NASDAQ:MDCX), CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. (NASDAQ:VVOS), and Virtuix Holdings ($VTIX) on Bloomberg Television Tonight at 6:30 PM EST",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Show Will Also Air Across Latin America and MENA 1230 pm local time.</span></p><p class=\"\"><span>NEW YORK CITY, NEW YORK / ACCESS Newswire / February 28, 2026 / New to The Street will broadcast nationally tonight at 6:30 PM EST on Bloomberg Television, featuring executive leadership interviews with Medicus Pharma Ltd. </span><span>, CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. </span><span>, and Virtuix Holdings (NASDAQ:VTIX).</span></p><p class=\"\"><span>The program will air across Bloomberg's U.S. platform and will also broadcast throughout Latin America and the Middle East &amp; North Africa (MENA), expanding global visibility for each company's strategic initiatives and growth outlook.</span></p><p class=\"\"><span>Each executive interview delivers in-depth discussion around corporate strategy, market positioning, upcoming catalysts, and long-term value creation. The show continues to connect innovative public companies with a global investor audience through structured, recurring national exposure.</span></p><p class=\"\"><span>In addition to national television distribution, the segments will be amplified across New to The Street's digital ecosystem, including its 4.4M+ subscriber YouTube channel - the largest YouTube subscriber base in the public-company media space - along with integrated distribution across X, LinkedIn, Instagram, and Facebook.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About New to The Street</span></strong></p><p class=\"\"><span>New to The Street is a 17-year-old financial television brand broadcasting weekly as sponsored programming across multiple linear television networks, including Bloomberg Television and Fox Business. The platform delivers long-form executive interviews filmed from premier financial venues including the NYSE and Nasdaq MarketSite.</span></p><p class=\"\"><span>With over 4.4 million YouTube subscribers - the largest dedicated subscriber base in the public company media category - New to The Street combines national television reach, global broadcast distribution across the U.S., Latin America, and MENA, and a powerful digital amplification engine.</span></p><p class=\"\"><span>New to The Street TV can be viewed on YouTube at:</span></p><p class=\"\"><span>https://youtube.com/@newtothestreettv?si=JdWxFdCXg6smGoiz</span></p><p class=\"\"><span>The platform provides predictable, recurring visibility designed to support corporate growth narratives and investor engagement.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broadcast Details:</span></strong></p><p class=\"\"><span>6:30 PM EST - Bloomberg Television</span></p><p class=\"\"><span>Also airing across Latin America and MENA</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For media inquiries:</span></strong></p><p class=\"\"><span>Monica Brennan</span></p><p class=\"\"><span>Monica@NewtoTheStreet.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> New to The Street</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSqKR0Ca:0/",
            "pub_date": "2026-03-01 00:30:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "eqs:4ad92aa33094b:0",
            "title": "CGTN: How China's path of democracy safeguards people's rights and interests",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span> </span></p><p class=\"\"><span>CGTN/ Key word(s): Miscellaneous </span></p><p class=\"\"><span> CGTN: How China's path of democracy safeguards people's rights and interests </span></p><p class=\"\"><span> 28.02.2026 / 16:55 CET/CEST</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><em><span>Ahead of China's annual key political meetings – the Two Sessions, CGTN published an article elaborating how China's whole-process people's democracy works at the grassroots level and how it safeguards the rights and interests of the people. Through a comprehensive introduction of China's democratic practice, the article stresses that this approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</span></em></p><p class=\"\"><span>BEIJING, Feb. 28, 2026 /PRNewswire/ -- A legislative outreach office in Shanghai's Changning District, established in 2015 in the Hongqiao Subdistrict by the Legislative Affairs Commission of the Standing Committee of the National People's Congress (NPC), has become a landmark in China's democratic progress.</span></p><p class=\"\"><span>Residents can offer suggestions and feedback on legislative work close to home. Through this office, the opinions of local residents gathered by legislators were relayed to higher levels and taken into consideration during the legislation process.</span></p><p class=\"\"><span>The Shanghai neighborhood has come to epitomize the country's whole-process people's democracy following a visit by Chinese President Xi Jinping in November 2019, when he coined the term for the first time.</span></p><p class=\"\"><span>As of 2025, the Legislative Affairs Commission of the NPC Standing Committee had established 54 such outreach offices across the country, and there were more than 7,800 such offices established by provincial or municipal legislatures. These platforms have served as vital bridges between residents and lawmakers, ensuring that democratic participation is embedded in the legislative process.</span></p><p class=\"\"><span>While Western democracies often equate democracy with elections, China's whole-process people's democracy ensures public participation throughout the entire process of governance, covering all aspects of the democratic process and all sectors of society. This approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Extensive participation</span></strong></p><p class=\"\"><span>China's whole-process people's democracy integrates democratic practices across all government levels and at every stage of policymaking – from election and consultation to decision-making, implementation and oversight.</span></p><p class=\"\"><span>It is embodied in the Two Sessions – the annual meetings of China's top legislature, the NPC and the top political advisory body, the National Committee of the Chinese People's Political Consultative Conference (CPPCC). Thousands of NPC deputies and CPPCC National Committee members convene in Beijing to deliberate on and discuss major policies and governance matters, representing a broad cross-section of society.</span></p><p class=\"\"><span>Over the years, innovation and creativity in grassroots democracy across urban and rural areas nationwide have become more dynamic than ever, unleashing great vitality at the grassroots level. From \"courtyard meeting halls\" and \"bench meetings\" to offline \"roundtable meetings\" and online \"deliberation groups,\" these pragmatic democratic practices based on local characteristics have provided sustained momentum for the development of China's democracy.</span></p><p class=\"\"><span>In 2025, various departments of the State Council handled a total of 8,754 suggestions from NPC deputies and 4,868 proposals from CPPCC National Committee members, accounting for 95.6 percent and 97.3 percent of the total number of suggestions and proposals, respectively, according to a press conference held by the State Council Information Office on Friday. In particular, these departments adopted more than 4,900 suggestions and proposals from deputies and members, and issued more than 2,200 related policies and measures.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Pooling wisdom for 15th Five-Year Plan</span></strong></p><p class=\"\"><span>The drafting of China's 15th Five-Year Plan (2026–2030) for economic and social development provides another vivid example. Deliberations on the draft outline are among the most closely watched items on the agenda of this year's Two Sessions.</span></p><p class=\"\"><span>On Friday, a key leadership meeting was held to discuss a draft outline of the 15th Five-Year Plan and a draft government work report to be submitted by the State Council to the upcoming annual session of the national legislature for review.</span></p><p class=\"\"><span>Formulating the 15th Five-Year Plan has been a process of practicing whole-process people's democracy. From May 20 to June 20 last year, China launched an online public consultation to gather opinions for its next five-year plan. The initiative drew over 3.11 million valid submissions, yielding more than 1,500 constructive suggestions across 27 topics.</span></p><p class=\"\"><span>A summary of these findings was reviewed by Xi and submitted to the Party leadership, ensuring that citizens' voices were heard at the highest level. By September, a total of 2,112 suggestions had been collected from various regions, departments and sectors, resulting in 218 revisions to the document.</span></p><p class=\"\"><span>This broad-based participation demonstrates that national development strategies are rooted in public will, gathering strong momentum for Chinese modernization.</span></p><p class=\"\"><span>\"This whole-process people's democracy China is carrying out aligns with the goal of putting the people at the center. It enables them to decide and feel that they are the protagonists of the historical process that is taking place in China and the beneficiaries of the transformations that are happening,\" said Argentine sociologist Marcelo Rodriguez, director of the Hector P. Agosti Center for Marxist Studies and Training.</span></p><p class=\"\"><em><span>For more information, please click:</span></em><em><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=88ee8d8aa88c6831835d3eff048aa265&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://news.cgtn.com/news/2026-02-27/How-China-s-path-of-democracy-safeguards-people-s-rights-and-interests-1L6w4JWN8yI/p.html</a></em></p><p class=\"\"><span> View original content:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=75f6d603c3e165880007ea4782f3ac5f&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.co.uk/news-releases/cgtn-how-chinas-path-of-democracy-safeguards-peoples-rights-and-interests-302700197.html</a></p><p class=\"\"><span> 28.02.2026 CET/CEST Dissemination of a Corporate News, transmitted by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=2be925ac0334ae7b4f51fbaee4a6daf0&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS News</a><span> - a service of </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=f5d50dc7e8798b6eb177f7955e598e60&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS Group</a><span>.</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>The EQS Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.</span></p><span> </span><p class=\"\"><span>2283322 28.02.2026 CET/CEST </span><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>Saving the news in databases or any forwarding of the news to third parties in a commercial context or for commercial purposes is only permitted with the prior written consent of EQS Group AG.</span></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/eqs:4ad92aa33094b:0-cgtn-how-china-s-path-of-democracy-safeguards-people-s-rights-and-interests/",
            "pub_date": "2026-02-28 23:55:22",
            "source": "EQS",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3SG039:0",
            "title": "ADNOC says operations continuing without interruption",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Abu Dhabi National Oil Company (ADNOC) said on Saturday that its operations were continuing without interruption. </span></p><p class=\"\"><span>In response to questions after the U.S. and Israeli strikes on Iran, a spokesperson for ADNOC said the company was closely monitoring the situation and coordinating with relevant authorities.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3SG039:0-adnoc-says-operations-continuing-without-interruption/",
            "pub_date": "2026-03-01 00:04:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2955094:0",
            "title": "PNPN: Ultra-pure graphene, rapid scale-up, and Nasdaq listing drive strong growth prospects",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Graphene production technology enables ultra-fast electron flow and industry-leading purity, validated by independent testing. Recent regulatory approvals and strategic partnerships position the company for rapid commercialization, high profitability, and a Nasdaq listing by end of Q2.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2955094:0-pnpn-ultra-pure-graphene-rapid-scale-up-and-nasdaq-listing-drive-strong-growth-prospects/",
            "pub_date": "2026-03-01 00:07:25",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3V404Y:0",
            "title": "OPEC+ may consider 411,000 bpd oil output boost, sources say after Iran strike",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    OPEC+ is likely to consider a larger oil output increase of 411,000 barrels per day at its imminent meeting, two sources familiar with OPEC+ thinking said on Saturday, after the U.S. and Israel launched </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/iran-crisis-live-explosions-tehran-israel-announces-strike-2026-02-28/\" rel=\"nofollow\" target=\"_blank\">military strikes</a><span> on Iran.</span></p><p class=\"\"><span>Eight members of the grouping of the Organization of the Petroleum Exporting Countries and allies including Russia were already scheduled to meet on Sunday.</span></p><p class=\"\"><span>Delegates had earlier said the eight would probably agree to a modest increase of 137,000 bpd for April, as the group prepares for summer demand and as crude prices had risen on expectations of a U.S. attack on Iran, which happened on Saturday. </span></p><p class=\"\"><span>Both sources, who declined to be identified by name, said an increase of 411,000 bpd was now being considered.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3V404Y:0-opec-may-consider-411-000-bpd-oil-output-boost-sources-say-after-iran-strike/",
            "pub_date": "2026-02-28 23:45:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSKpgFpa:0",
            "title": "Understanding Common Dental Issues That Develop Over Time in Richardson, TX",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NEW YORK CITY, NEW YORK / ACCESS Newswire / February 28, 2026 / Some dental issues don't appear overnight; they develop gradually and show symptoms over time. Yes, many are preventable or manageable, but you have to catch them early before they deteriorate, which highlights the importance of regular dental visits. Dental issues can be a result of poor oral hygiene, and this is what your dentist in Richardson, TX, can monitor and address before it leads to more serious problems. In this article, we'll discuss the most common dental issues, their causes, symptoms, and prevention tips.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tooth decay in different life stages</span></strong></p><p class=\"\"><span>Also known as dental caries, tooth decay is a dental disease that can affect people of all ages. It occurs when bacteria and acids break down tooth enamel, creating cavities. This process is most often caused by the long-term consumption of sugary and acidic foods, such as sweets and soda. Other habits, including brushing too hard, not brushing enough, and bruxism, can also cause tooth decay.</span></p><p class=\"\"><span>Plaque can also develop around pre-existing dental work, such as crowns and fillings. Over time, the tooth or restorations start to wear down and form gaps through which bacteria can enter.</span></p><p class=\"\"><span>Catching tooth decay early makes treatment simpler and prevents future complications. Early signs of tooth decay include tooth sensitivity, mild pain, and black, brown, or white spots on the enamel. Tooth decay can be prevented by routine dentist visits and regular brushing and flossing with fluoride toothpaste and mouthwash to help prevent cavities and strengthen enamel.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gum disease progression</span></strong></p><p class=\"\"><span>Gum disease is a condition in which gum tissue recedes, exposing the root of the tooth. In the early stage, called gingivitis, the gum appears red or swollen and can bleed when you brush or floss. At this stage, the condition is reversible with thorough oral cleaning by a dentist. If left untreated, it can progress to periodontitis, where the gums pull away from the teeth, leading to bone loss and eventually permanent tooth loss. If such progression occurs, it causes irreversible jawbone loss, which affects multiple teeth and broader overall health issues. Treating gum disease typically involves periodontal therapy, improved at-home oral care, and regular monitoring by a Richardson dentist.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dry mouth and its effects</span></strong></p><p class=\"\"><span>Saliva plays a major role in maintaining oral health. It protects your teeth from decay by constantly washing away food particles, neutralizing all harmful acids, and controlling bacteria in the mouth. Dry mouth is a condition more prevalent among the elderly. Saliva production naturally decreases as a person ages, but taking certain medications, such as some used to treat high blood pressure, cancer, high cholesterol, and others, can also reduce the amount of saliva you produce.</span></p><p class=\"\"><span>Dry mouth leads to gum irritation, tooth decay, and difficulties in tasting, eating, and speaking. Luckily it can be managed by always staying hydrated or chewing sugar-free gum or lozenges to stimulate saliva. You can also discuss possible medication alternatives with your dentist.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jawbone loss</span></strong></p><p class=\"\"><span>Jawbone loss occurs gradually and is primarily caused by missing teeth. When the jawbone isn't stimulated by chewing pressure from teeth, it gradually shrinks. It is also caused by advanced gum disease and natural aging.</span></p><p class=\"\"><span>When the jawbone shrinks, it changes the shape of the face while making future dental work more difficult, and can also weaken the support of the remaining teeth. Traditional dentures may also become loose and ill-fitting as the jawbone recedes. The best way to prevent this is to ensure you replace any missing tooth, get early treatment of gum disease, and consider dental implants to help stimulate the bone.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How regular dental care helps</span></strong></p><p class=\"\"><span>Visiting your Richardson dentist regularly ensures you detect problems early, leading to simpler treatment and positive outcomes before the condition becomes serious. It also gives you access to professional cleanings that remove buildup like plaque, while fluoride treatments strengthen teeth. Your dentist can also give you advice that can help prevent future problems.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The bottom line</span></strong></p><p class=\"\"><span>Most dental issues develop gradually; that is why early detection and treatment prevent serious problems. To protect your long-term oral health, find a \"dentist near me\" and schedule a checkup today.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Name</span></strong><span>: Sonakshi Murze</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email</span></strong><span>: Sonakshi.murze@iquanti.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Job Title</span></strong><span>: Manager</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE</span></strong><span>: iQuanti</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSKpgFpa:0/",
            "pub_date": "2026-03-01 00:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:ca45c7dd2094b:0",
            "title": "Bitcoin Historical Cycle Pattern Points To $31,500 Bottom Target – Details",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin price struggles persist as the premier cryptocurrency is yet to break above the key $70,000 resistance zone, suggesting the market remains at risk of a deeper correction. Notably, popular market analyst Yonsei_dent has shared an observation that backs these bearish investors’ expectations. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Supply In Profit Metric Shows Potential 75% Drawdown </span></strong></strong></p><p class=\"\"><span>In a Quicktake post on CryptoQuant, Yonsei_dent has identified a potential price bottom of the present market cycle, considering the meltdown in recent months. Since October, the leading cryptocurrency has lost over 45% of its market value, with prices dropping as low as $60,000 from an all-time high of $126,000.</span></p><p class=\"\"><span>Using the Supply In Profit on-chain indicator, Yonsei_dent maps out the possible extent of Bitcoin’s price decline when in the bottom zone, based on historical cycle drawdown periods. For context, the Supply in Profit measures the portion of the total circulating Bitcoin whose current market price is higher than the price at which those coins last moved.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-94873c6a76ddf11158092a131c682ca6-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-94873c6a76ddf11158092a131c682ca6-resized.webp\" style=\"background-color:#f8f7f5\"/></picture></div></button></figure><p class=\"\"><span>It’s an important cycle indicator, as the Supply in Profit approaches extreme highs when near cycle tops, and compresses sharply when near cycle lows. Yonsei_dent explains that the duration of Bitcoin Supply in Profit in the bottom zone in 2022 was six months. During this market cycle, Bitcoin had initially hit an all-time high of $69,000 before crashing by 77% to around $15,500.</span></p><p class=\"\"><span>According to the market analyst, if the same length of the bottom phase was placed on the current price chart, it represents a 70%-75% drawdown price projection for the present market cycle. In this case, Bitcoin is expected to find a price low within a range of $31,500 – $38,000, suggesting a further potential 41%-51% decline from the current market prices.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:717.4468085106383px;aspect-ratio:1.195744680851064\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-a898de23dcbe8b341814ebc4c32d2739-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-a898de23dcbe8b341814ebc4c32d2739-resized.webp\" style=\"background-color:#f0efef\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Price Overview </span></strong></strong></p><p class=\"\"><span>At the time of writing, Bitcoin trades at $63,553 following a 5.84% loss in the last 24 hours. Meanwhile, its daily trading volume is up by a minor 0.54% and valued at $40.04 billion. The premier cryptocurrency also reports a negative performance on its weekly and monthly charts, with respective losses of 6.21% and 27.11%. Unless the market bulls convincingly reclaim the long standing $70k resistance, market sentiment is likely to remain fragile and prices vulnerable to additional downside or prolonged consolidation in the near term.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:ca45c7dd2094b:0-bitcoin-historical-cycle-pattern-points-to-31-500-bottom-target-details/",
            "pub_date": "2026-03-01 00:00:07",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_PexbphjKa:0",
            "title": "Half-year financial statements as of December 31, 2025: Economic development continues",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA</span></strong></p><p class=\"\"><span>by Björn Bäring</span></p><p class=\"\"><em><span>Business news for the stock market</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA: Half-year financial statements as of December 31, 2025: Economic development continues</span></strong></p><span>[ PDF ]</span><p class=\"\"><span>Berlin (pta000/28.02.2026/17:00 UTC+1)</span></p><p class=\"\"><span>Hertha BSC has published its half-year financial statements as of December 31, 2025, reporting a positive result.</span></p><p class=\"\"><span>The half-yearly financial statements as of December 31, 2025, are available on the Hertha BSC website.</span></p><p class=\"\"><span>(end)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><th><span>Emitter:</span></th><td><span>Hertha BSC GmbH &amp; Co. KGaAHanns-Braun-Straße 214053 BerlinGermany</span></td><td rowspan=\"7\"></td></tr><tr><th><span>Contact Person:</span></th><td><span>Björn Bäring</span></td></tr><tr><th><span>Phone:</span></th><td><span>+49 30 300 928 0</span></td></tr><tr><th><span>E-Mail:</span></th><td><span>bjoern.baering@herthabsc.de</span></td></tr><tr><th><span>Website:</span></th><td><span>www.herthabsc.com</span></td></tr><tr><th><span>ISIN(s):</span></th><td><span>SE0011337054 (Bond)</span></td></tr><tr><th><span>Stock Exchange(s):</span></th><td><span>Free Market in Frankfurt, Hamburg, Hannover, Munich, Stuttgart, Tradegate BSX</span></td></tr><tr><th><span>Other Stock Exchanges:</span></th><td><span>Stockholm (SWE)</span></td><td></td></tr></tbody></table></div><p class=\"\"><span>[ source: https://www.pressetext.com/news/1772294400516 ]</span></p><p class=\"\"><span>(c) pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext. Archive: https://www.pressetext.com/channel/Adhoc The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_PexbphjKa:0-half-year-financial-statements-as-of-december-31-2025-economic-development-continues/",
            "pub_date": "2026-03-01 00:00:47",
            "source": "pressetext",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Pexc6vbQa:0",
            "title": "PTA-News: Hertha BSC GmbH & Co. KGaA: Half-year financial statements as of December 31, 2025: Economic development continues",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA</span></strong></p><p class=\"\"><span>by Björn Bäring</span></p><span>Business news for the stock market Berlin (pta/28.02.2026/17:00) - Hertha BSC has published its half-year financial statements as of December 31, 2025, reporting a positive result. The half-yearly financial statements as of December 31, 2025, are available on the Hertha BSC website ( https://www.herthabsc.com/en/club/nordic-bonds-investor-relations). (end) emitter: Hertha BSC GmbH &amp; Co. KGaA address: Hanns-Braun-Straße 2, 14053 Berlin country: Germany contact person: Björn Bäring phone: +49 30 300 928 0 e-mail: bjoern.baering@herthabsc.de website: www.herthabsc.com ISIN(s): SE0011337054 (bond) stock exchanges: open market (free market) in Frankfurt, free market in Hamburg, free market in Hannover, free market in Munich, free market in Stuttgart; open market in Tradegate BSX other stock exchanges: Stockholm (SWE) pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext.adhoc. Archive: http://adhoc.pressetext.com The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</span></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Pexc6vbQa:0-pta-news-hertha-bsc-gmbh-co-kgaa-half-year-financial-statements-as-of-december-31-2025-economic-development-continues/",
            "pub_date": "2026-03-01 00:00:49",
            "source": "pressetext",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0D3:0",
            "title": "Iran war throws oil market into biggest crisis in decades: Bousso ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Ron Bousso</span></p><p class=\"\"><span>    Global energy markets face one of their gravest shocks in decades as joint U.S. and Israeli strikes on Iran and Tehran’s retaliatory missile attacks across the Gulf disrupt oil exports from the world’s most important producing region.</span></p><p class=\"\"><span>The scale of the disruption will likely be determined by the duration of the conflict, but for now the threat and the uncertainty are already enough to severely impact flows from the region that accounts for 20% of global oil supplies.</span></p><p class=\"\"><span>Barring a swift resolution, oil prices will likely see steep increases when trading opens on Monday morning. Benchmark Brent crude oil prices rose in recent weeks to around $70 a barrel, their highest since August 2025 as investors braced for military confrontation in the Middle East.</span></p><p class=\"\"><span>The United States and Israel carried out military strikes on Iran on Saturday, targeting senior leaders and plunging the Middle East into a widening conflict. U.S. President Donald Trump said the attacks would eliminate a security threat to the United States and give Iranians an opportunity to topple their rulers.</span></p><p class=\"\"><span>For now, there is no confirmed damage to oil and gas infrastructure from retaliatory Iranian strikes. </span></p><p class=\"\"><span>Explosions were reported in the United Arab Emirates and Kuwait, two major oil exporters. Meanwhile, Qatar, the world’s second-largest exporter of liquefied natural gas, said it intercepted missiles aimed at the country.</span></p><p class=\"\"><span>Blasts were also heard in Bahrain and near Iran’s Kharg Island, the terminal through which about 90% of its crude exports normally flow, although shipping data suggests Tehran had transferred most of the oil stored there onto tankers in recent days.</span></p><p class=\"\"><span>Crucially, there have so far been no reports of disruptions to shipping through the Strait of Hormuz, the narrow waterway between Iran and Oman that handles nearly 20 million barrels per day of crude oil and refined products.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:872.9508196721312px;aspect-ratio:1.4549180327868854\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZO0D3-c103a5cb0afbde8ee0388db1fb908b84-resized.webp\" type=\"image/webp\"/><img alt=\"Middle East oil exports\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZO0D3-c103a5cb0afbde8ee0388db1fb908b84-resized.webp\" style=\"background-color:#d39992\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Middle East oil exports</span></figcaption></figure><p class=\"\"><span>CAUTION MEANS DISRUPTION</span></p><p class=\"\"><span>But the absence of physical damage may not matter much.</span></p><p class=\"\"><span>The risk that tankers could be stranded inside the Gulf, north of Hormuz, or that vessels could be targeted, is already enough to force producers, traders and shippers to rethink movements of oil and LNG. Reuters has reported that some oil majors and trading houses have suspended shipments through the strait for several days.</span></p><p class=\"\"><span>That caution is unlikely to ease until there is far greater confidence in the safety of the region’s sea lanes.</span></p><p class=\"\"><span>Tanker freight rates, which had already been climbing as tensions escalated, are set to rise further. Benchmark rates for very large crude carriers from the Middle East to China have more than tripled since the start of the year, reflecting both heightened risk and the shrinking pool of willing vessels.</span></p><p class=\"\"><span>The key questions now are whether energy infrastructure will be directly targeted and how quickly the U.S. military can secure shipping routes across the Gulf and the Strait of Hormuz.</span></p><p class=\"\"><span>It is worth noting that the Strait of Hormuz has never been fully blocked.</span></p><p class=\"\"><span>While Iran is unlikely to sustain a prolonged blockade, it has the capability to disrupt traffic temporarily. The U.S. Navy would almost certainly respond swiftly, but even short-lived attacks or mine-laying operations could have outsized effects on prices and supply.</span></p><p class=\"\"><span>Such tactics would not be unprecedented. During the 1980s Iran-Iraq war, Iran attacked commercial shipping and U.S. naval vessels, prompting President Ronald Reagan to deploy U.S. forces to escort tankers in Operation Earnest Will. More recently, in late 2007 and early 2008, there were repeated confrontations between Iranian and U.S. naval forces. And in April 2023, Iran's navy seized the Advantage Sweet crude tanker, chartered by Chevron, in the Gulf of Oman. The vessel was released more than a year later.</span></p><p class=\"\"><span>GLOBAL SUPPLY CUSHION</span></p><p class=\"\"><span>The global oil market is relatively well supplied today, after production from the United States, Brazil, Canada and other countries rose in recent years.</span></p><p class=\"\"><span>Saudi Arabia, the world’s top oil exporter, has also not sat idle in the face of the risk to supply. In recent days the kingdom increased crude shipments, which are set to exceed 7 million barrels per day in February, the highest since April 2023, according to shipping analytics firm Kpler.</span></p><p class=\"\"><span>OPEC+, which comprises the Organization of the Petroleum Exporting Countries and allies like Russia, is expected to agree on an output increase during a meeting on Sunday.</span></p><p class=\"\"><span>Of course, disruptions to export routes from the Middle East could negate much of the production increases from regional producers, though Saudi and the UAE have some alternative export routes.</span></p><p class=\"\"><span>The scale of the U.S. and Israeli strikes, and Trump’s language, suggest Washington is bracing for a sustained military campaign aimed at severely weakening Iran’s leadership.</span></p><p class=\"\"><span>How threatened Iran's leadership feels may determine whether it escalates further by attacking a broader range of targets across the region, including oilfields, export terminals and processing facilities.</span></p><p class=\"\"><span>But even without that worst-case scenario, the conflict is already set to disrupt vital energy supplies from the Middle East in ways not seen for decades.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0D3:0-iran-war-throws-oil-market-into-biggest-crisis-in-decades-bousso/",
            "pub_date": "2026-03-01 00:03:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:04ee43423094b:0",
            "title": "Fresh accounts netted $1 million on Polymarket hours before US airstrikes on Iran: Bubblemaps",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Onchain analytics firm Bubblemaps flagged six Polymarket wallets on Saturday that profited a combined $1 million by betting on a U.S. military strike against Iran, with most accounts created and funded within 24 hours of the attack.</span></p><p class=\"\"><span>The wallets all purchased \"yes\" shares on the Polymarket contract \"US strikes Iran by February 28, 2026?\" hours before the U.S. and Israel launched coordinated airstrikes early Saturday morning. President Donald Trump confirmed \"massive and ongoing\" military operations against Iran, which the Department of War has dubbed \"Operation Epic Fury.\"</span></p><p class=\"\"><span>Bubblemaps described the group as \"suspected insiders\" who made $1.2 million. The Block reviewed all six flagged Polymarket profiles, including their closed positions and per-trade profit-and-loss breakdowns. The wallets' combined net profit totals $989,191, according to the Profit/Loss figures displayed on each profile.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Winning wallets — and one big loser</span></strong></p><p class=\"\"><span>The largest wallet in the cluster recorded a net profit of $494,375 across four predictions. The account bought 560,680 \"yes\" shares on the Feb. 28 contract at 10.8 cents each, spending roughly $60,816 and earning a $499,864 profit when the contract resolved to \"yes.\" It also won $11,286 on a March 1 contract. However, the wallet lost $13,515 on a bet that the strike would come by February 27, which did not resolve in its favor.</span></p><p class=\"\"><span>A second wallet, \"Planktonbets,\" posted a net profit of $173,907 across seven predictions. Its main position was 200,747 \"yes\" shares on the Feb. 28 contract at 13.2 cents, which returned $174,234 in profit. The account also placed small losing bets on daily \"next strike\" contracts for Feb. 19 and 20, suggesting repeated attempts to time the exact date.</span></p><p class=\"\"><span>\"Dicedicedice\" placed a single bet and earned $119,964 in net profit. The account bought 149,955 \"yes\" shares on the Feb. 28 contract at 20 cents, a 400% return.</span></p><p class=\"\"><span>\"Neodbs\" also placed one bet and achieved the highest percentage return of any wallet in the group: 900%. The account bought 98,838 shares on the Feb. 28 contract at 10 cents, spending $9,884 and netting $88,954.</span></p><p class=\"\"><span>A wallet using the username \"nothingeverhappens911\" posted $66,436 in net profit across two bets, both winners. It held 40,000 \"yes\" shares on the Feb. 28 contract at 19 cents and 45,320 shares on the March 1 contract at 24.9 cents.</span></p><p class=\"\"><span>A sixth wallet, listed only as \"Anon\" on Polymarket, made a single bet: 55,556 \"yes\" shares on the Feb. 28 contract at 18 cents. It earned $45,556 in net profit, a 456% return. All six wallets now show $0 in positions value, indicating they have fully exited.</span></p><p class=\"\"><span>Some traders lost big on the announcement of the U.S. strikes against Iran. Trader \"anoin123\" profited $2 million in prior months from betting against strikes, Lookonchain said, but the account lost $6.5 million in one day following the strikes, \"going from $2M+ in profit to $4.5M+ in losses.\"</span></p><p class=\"\"><span>\"It’s almost impossible to be 100% certain [of insider knowledge] in these cases, but given the size of the bets, the freshly funded wallets, and the timing around the bets, it felt convincing enough for us to share,\" Bubblemaps CEO Nicolas Vaiman told The Block. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A growing pattern of suspected insiders</span></strong></p><p class=\"\"><span>Suspected insider trading on Polymarket's geopolitical markets is not new. In January, a freshly created account wagered roughly $32,000 on the ouster of Venezuelan President Nicolás Maduro, purchasing shares at around 7 cents before the U.S. military operation was publicly announced. That trade yielded more than $400,000 in profit within 24 hours, prompting Rep. Ritchie Torres to introduce the Public Integrity in Financial Prediction Markets Act of 2026, which would bar federal officials from trading prediction market contracts tied to government policy.</span></p><p class=\"\"><span>Earlier this month, Israeli prosecutors filed indictments against an Israel Defense Forces reservist and a civilian for allegedly using classified military intelligence to bet on Polymarket. The pair reportedly wagered on the timing of Israel's strike on Iran during the June 2025 Twelve-Day War, earning over $150,000 in combined profits. They face charges of severe security offenses, bribery, and obstruction of justice.</span></p><p class=\"\"><span>Just days ago, suspected insiders made over $1 million betting on a Polymarket contract tied to blockchain investigator ZachXBT's probe into crypto trading platform Axiom, according to Lookonchain. The most profitable wallet in that case turned a five-figure bet into nearly half a million dollars.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broader implications</span></strong></p><p class=\"\"><span>The Bubblemaps findings come as Polymarket faces mounting regulatory and political pressure over the integrity of its geopolitical markets. The \"US strikes Iran by...?\" family of contracts has generated over $529 million in total trading volume since December 2025, making it one of the most heavily traded markets on the platform.</span></p><p class=\"\"><span>Polymarket CEO Shayne Coplan has previously defended the presence of informed traders on the platform, telling CBS News that insiders \"having an edge on the market is a good thing\" because it accelerates price discovery. The company secured CFTC approval to operate as a regulated exchange in the U.S. in late 2025.</span></p><p class=\"\"><span>Rival platform Kalshi has publicly endorsed the Torres bill and sought to distance itself from Polymarket's approach, with CEO Tarek Mansour noting Kalshi applies NYSE- and Nasdaq-style insider trading rules. Mansour said on X Friday that \"regulated prediction markets are not allowed to do war markets\" in response to Democratic Senator Chris Murphy's X post announcing he is \"working on legislation to ban corrupt and destabilizing prediction markets.\" </span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:04ee43423094b:0-fresh-accounts-netted-1-million-on-polymarket-hours-before-us-airstrikes-on-iran-bubblemaps/",
            "pub_date": "2026-02-28 23:47:13",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO09D:0",
            "title": "Berkshire CEO Abel assures investors after taking baton from Buffett, with 'fortress-like' balance sheet ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel pledges to maintain fortress balance sheet</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel emphasizes trust, Berkshire values</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Berkshire reports declining profit for Q4, full year</span></li></ul></span></div><span><p class=\"\"><span>By Jonathan Stempel</span></p><p class=\"\"><span>    Berkshire Hathaway's </span><span> new chief executive Greg Abel moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its \"fortress-like\" balance sheet while upholding the values of his predecessor and mentor, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/news/picture/idUSRTS32X5D/\" rel=\"nofollow\" target=\"_blank\">Warren Buffett</a><span>.</span></p><p class=\"\"><span>Abel, 63, said he would not rush to deploy Berkshire's near-record $373.3 billion cash stake, though it gave the company plenty of \"dry powder,\" and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has also repurchased none of its own stock since the spring of 2024.</span></p><p class=\"\"><span>\"I recognize how you want us to succeed together, and to do so in the right way,\" Abel wrote. \"My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.\"</span></p><p class=\"\"><span>Abel also paid homage to Buffett, 95, who stepped down at year-end after 60 years as chief executive. Buffett remains chairman and goes to Berkshire's offices five days a week.</span></p><p class=\"\"><span>\"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen,\" Abel wrote. \"To invest in Berkshire has long been a vote of trust in our founder – a trust that now rests with Berkshire.\"</span></p><p class=\"\"><span>ABEL TRIES TO SHOW CONTINUITY</span></p><p class=\"\"><span>Abel said Berkshire's culture and values will continue \"into perpetuity,\" and signaled no changes in its decentralized structure where its dozens of businesses operate largely without interference from him.</span></p><p class=\"\"><span>He also said Berkshire, which owns the BNSF railroad, had \"no interest\" in buying another major railroad, and acknowledged pressures facing the PacifiCorp utility from litigation over wildfires in Oregon.</span></p><p class=\"\"><span>\"PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,\" Abel wrote.</span></p><p class=\"\"><span>Cathy Seifert, an analyst at CFRA Research, said Abel's letter might be reassuring to investors.</span></p><p class=\"\"><span>\"He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,\" she said. \"In my opinion, he hit the mark.\"</span></p><p class=\"\"><span>PROFIT DECLINES</span></p><p class=\"\"><span>Berkshire also reported declining profit for both the fourth quarter and the full year, after taking write-downs for longstanding investments in packaged food company Kraft Heinz </span><span> and Occidental Petroleum </span><span>.</span></p><p class=\"\"><span>Quarterly operating profit fell 30% to $10.2 billion. Including changes in the value of equity holdings led by Apple </span><span> and American Express </span><span>, net income fell 3% to $19.2 billion.</span></p><p class=\"\"><span>For all of 2025, operating profit fell 6% to $44.49 billion, while net income fell 25% to $67 billion.</span></p><p class=\"\"><span>Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire is not selling.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO09D:0-berkshire-ceo-abel-assures-investors-after-taking-baton-from-buffett-with-fortress-like-balance-sheet/",
            "pub_date": "2026-02-28 23:37:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002356:0",
            "title": "Stanley Druckenmiller says this is how he'd build a portfolio from scratch right now",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Barbara Kollmeyer</span></p><p class=\"\"><span>AI is no longer playing a starring role, says the widely followed investor</span></p><p class=\"\"><span>Stanley Druckenmiller, shown in July 2017 at a conference in Sun Valley, Idaho, revealed in an interview on Friday with Morgan Stanley where he's seeing opportunities right now.</span></p><p class=\"\"><span>Stanley Druckenmiller says artificial intelligence is no longer playing a starring role in his investments, as he focuses more on hard assets like copper and a more diversified portfolio of stocks.</span></p><p class=\"\"><span>The closely followed investor, who runs the Duquesne Family Office, made the comments in an interview for \"Hard Lessons,\" a Morgan Stanley podcast that was published on Friday. He was asked by liana Bouzali, Morgan Stanley's global head of derivatives, distribution and structuring, how he would construct a hedge-fund portfolio from scratch today.</span></p><p class=\"\"><span>Druckenmiller said such portfolio building would take into account a strengthening U.S. economy and potential for Fed rate cuts, though, given highly valued equities, he prefers longer positions in a more \"eclectic basket of stocks.\" The AI trade to him is not longer so big, he added.</span></p><p class=\"\"><span>\"[O]ur portfolio,\" he indicated, over the past three years, had been \"very much AI-driven. We still have dribs and drabs of AI around, but it's not driving the engine anymore, to some extent,\" said Druckenmiller. He's still excited, he said, about the opportunity for \"massive disruption and massive change\" in the next three or four years, which would be a plus for any hedge fund starting now.</span></p><p class=\"\"><span>Don't miss: The week, FOBO - 'fear of becoming obsolete' because of AI - became real for workers and markets</span></p><p class=\"\"><span>\"Macro has been dead for 10 or 15 years,\" he observed. \"I don't think that's the case anymore.\"</span></p><p class=\"\"><span>Druckenmiller said he's still got \"big positions in Japan and Korea,\" with some of that in AI. The iShares MSCI Japan ETF EWJ is up 40% over a one-year span, and the iShares MSCI Korea ETF EWY up 55%, versus a gain of 15% for the S&amp;P 500 SPX. A 13F filing released earlier this month showed Druckenmiller's family office also made a well-time bet on the iShares MSCI Brazil ETF EWZ in the final quarter of 2025.</span></p><p class=\"\"><span>Earlier this week: The milestones keep coming for the world's hottest stock market</span></p><p class=\"\"><span>Also read: U.S. stocks are falling behind. It could be the beginning of an epic shift toward global markets.</span></p><p class=\"\"><span>\"We're bearish on the U.S. dollar, mainly because [it has been] sort of [at] the top of the historic range in terms of purchasing power, and foreigners are way, way overloaded in dollars,\" he added. Whether that's a sell-America trade or just buying fewer U.S. assets, he expects the currency DXY will weaken.</span></p><p class=\"\"><span>As for copper (HG00), up 32% over the past 52 weeks and up 6% in 2026, Druckenmiller said it's \"not a genius trade\" but makes sense given supply will be pretty tight over the next eight years, with extra demand from AI and data centers. He said his family office is not investing big in copper miners but keeps rolling over exposure to front-month copper, and it has gold (GC00) exposure, though, in that case, for geopolitical rather than industrial reasons.</span></p><p class=\"\"><span>See: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.</span></p><p class=\"\"><span>Gold is up 84% over the last year, having seen a historic rally.</span></p><p class=\"\"><span>Druckenmiller said that, given his family office's long exposure to lots of risk assets, it's keeping a short position in bonds, which wouldn't be a big moneymaker unless he's right and the economy sees disinflationary growth.</span></p><p class=\"\"><span>\"If I'm wrong and the strong growth creates inflation - it wouldn't be that unusual if the Fed were to cut into a booming economy for inflation to take off, particularly with what's going on with commodities. So I'm open-minded to that. But we create a matrix, and the bonds are helpful in both ways,\" he said.</span></p><p class=\"\"><span>The interview with Druckenmiller was conducted on Jan. 30, just ahead of the February ascent of an AI fear trade that pummeled software and other sectors exposed to artificial-intelligence technology. Investors have also been piling into bond markets on fears that AI advances will decimate the job market, while hotter-than-expected producer prices have clouded hopes for Federal Reserve interest-rate cuts.</span></p><p class=\"\"><span>U.S. stocks plunged on Friday after the PPI data pointed to worryingly persistent inflation.</span></p><p class=\"\"><span>Don't miss: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices</span></p><p class=\"\"><span>Druckenmiller said contrarianism is \"overrated,\" and he isn't bothered by exposure to a crowded trade. But he also flagged past mistakes, such as buying Nvidia (NVDA) in the first half of 2022 but then cutting his stake in mid-2024.</span></p><p class=\"\"><span>He also discussed a big bet on biotech, highlighting how the market has been undervaluing one pick, Teva Pharmaceuticals (TEVA), of which he became more enthusiastic following a meeting with its management. The \"best use case out there of AI is biotech, through drug discovery, diagnostics, monitoring - everything,\" Druckenmiller said, noting that that sector has \"been on its butt for like four years.\"</span></p><p class=\"\"><span>Read on: Private-credit 'cockroaches' and the AI 'scare trade' hammered stocks in February. Here's what else has investors shaken up</span></p><p class=\"\"><span>-Barbara Kollmeyer</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002356:0/",
            "pub_date": "2026-02-28 23:38:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002323:0",
            "title": "This could be Nvidia's next big move, with the stock in search of a positive catalyst",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Emily Bary</span></p><p class=\"\"><span>A report says Nvidia is planning a new chip platform that seeks to address evolving customer needs as the AI era transitions more toward inference workloads</span></p><p class=\"\"><span>Nvidia, led by Jensen Huang, struck a major licensing deal with startup Groq late last year, and soon investors may see the early fruits of that arrangement.</span></p><p class=\"\"><span>A historic earnings beat wasn't enough to lift Nvidia's stock. What about a brand new chip platform?</span></p><p class=\"\"><span>The Wall Street Journal reported late on Friday that the company is soon planning to debut an inference-oriented chip platform that brings in technology designs from Groq, the startup that Nvidia (NVDA) struck a $20 billion licensing deal with at the end of last year. Through that deal, Nvidia also brought Groq employees, like founder Jonathan Ross, on board.</span></p><p class=\"\"><span>Nvidia didn't immediately respond to a MarketWatch request for comment.</span></p><p class=\"\"><span>The rumored new platform, which the WSJ said is due to be announced during Nvidia's annual GTC developer event in March, could mark an acknowledgment of the changing world of artificial-intelligence chips, the report suggested. Nvidia is by far the dominant maker of graphics processing units, which have largely powered the AI revolution so far. But Alphabet (GOOGL) and other Broadcom (AVGO) partners have been working on their own custom chips that are cheaper and potentially more targeted to AI's new era.</span></p><p class=\"\"><span>See also: Why Nvidia's stock fell despite a historic earnings beat</span></p><p class=\"\"><span>Specifically, customers are turning to AI chips more for inference, which is the process by which models reach conclusions based on information that's new to them. The WSJ report noted that customers increasingly want less expensive and more efficient processors for these sorts of workloads.</span></p><p class=\"\"><span>Groq has been known for making language-processing units, or LPUs. \"Unlike the GPU, the LPU is a deterministic, low-power processor,\" wrote Cantor Fitzgerald analyst C.J. Muse after the companies struck their licensing and \"acqui-hire\" deal in December.</span></p><p class=\"\"><span>\"LPU strengths? Extremely low-latency, energy-efficient single user token per second, one of the fastest in the market,\" Muse wrote. But the chips make use of a kind of superfast memory that has limited capacity, meaning that lots of racks would be needed.</span></p><p class=\"\"><span>Don't miss: Nvidia's earnings report is just a prelude to what should really matter for investors</span></p><p class=\"\"><span>At the time, Muse thought that Groq's newfound presence within Nvidia would \"enable even greater share of the inference market, particularly for the next leg of the AI infrastructure buildout - real-time workloads like robotics and autonomy.\"</span></p><p class=\"\"><span>Nvidia's stock, meanwhile, has been in search of a positive catalyst. Shares are down 5% so far this year, with an upbeat earnings announcement from earlier in the week unable to sway investors. The PHLX Semiconductor index is up 14% over the course of 2026 to date. Chip-sector investors this year have been particularly enamored by makers of memory products and equipment for semiconductor manufacturing.</span></p><p class=\"\"><span>Analysts have said that GTC could end up helping Nvidia's stock, as the company has perhaps what could be its most market-moving updates for the big event.</span></p><p class=\"\"><span>See also: Trump blacklists Anthropic - and OpenAI swoops in</span></p><p class=\"\"><span>-Emily Bary</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002323:0/",
            "pub_date": "2026-02-28 23:24:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000008:0",
            "title": "Berkshire Hathaway Operating Earnings Fell 30% in Fourth Quarter. There Were No Stock Buybacks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>Berkshire Hathaway's operating profits after taxes fell 30% in the fourth quarter to $10.2 billion, depressed by a drop of more than 50% in insurance underwriting profits and lower insurance investment income.</span></p><p class=\"\"><span>The company bought back none of its own stock in the period, continuing a trend that began in May 2024.</span></p><p class=\"\"><span>Berkshire's cash and equivalents stood at $373 billion at the end of 2025, down from a peak of $381 billion at the end of September.</span></p><p class=\"\"><span>Adjusting for the timing of some Treasury bill purchases at the end of the third quarter, Berkshire's cash levels were higher at year-end than on Sept. 30.</span></p><p class=\"\"><span>Berkshire took a non-cash writedown of its equity stake in Kraft Heinz of $4.5 billion in the fourth quarter, capping a total of $8.3 billion of writedowns on that equity stake during 2025. Berkshire was carrying the 27% stake in Kraft Heinz at $8.6 billion at year-end 2025. That's close to the current market value of around $8 billion. The writedowns reflected the weakness in Kraft stock during 2025, when it fell about 20%.</span></p><p class=\"\"><span>Berkshire filed earlier this year to potentially sell some or all of that Kraft interest, but has not made any sales yet.</span></p><p class=\"\"><span>Berkshire's operating earnings after taxes per share fell 30% to about $7,093 per class A share in the fourth quarter relative to the year-earlier period. That fell well short of the FactSet consensus of $8,400 per A share.</span></p><p class=\"\"><span>The lack of stock buybacks in the fourth quarter is a mild disappointment to Berkshire investors, but not a surprise. Analysts hadn't expected the company to repurchase shares during Warren Buffett's final three months as CEO. He was succeeded at the start of 2026 by Greg Abel, while Buffett remains chairman.</span></p><p class=\"\"><span>Berkshire also wasn't a buyer of its stock during January, Barron's calculates, based on the share count on Jan. 31 disclosed in Berkshire's 10-K report released Saturday. There were about 1.438 million shares of class A equivalent shares outstanding at year-end with class B shares converted to an equivalent amount of class A stock. Only about 35% of Berkshire's stock is now in the original class A shares.</span></p><p class=\"\"><span>The lack of stock buybacks indicates that the company doesn't view the stock as cheaply valued; Berkshire will repurchase its shares when it views them trading as a discount to the stock's intrinsic value \"conservatively determined,\" Abel said in his shareholder letter released Saturday morning.</span></p><p class=\"\"><span>Berkshire's book value rose about 3% during the fourth quarter to about $499,000 per class A share, Barron's calculates. Berkshire stock now trades for about 1.5 times year-end 2025 book value, in line with its average price/book ratio in the past few years.</span></p><p class=\"\"><span>Berkshire's total after-tax earnings in the fourth quarter were down about 2% to $19.2 billion. That figure reflects both operating income of Berkshire's businesses, and investment gains, mostly unrealized.</span></p><p class=\"\"><span>Berkshire chairman Buffett tells investors to focus on the operating profits, due to variability of investment gains from quarter to quarter.</span></p><p class=\"\"><span>The drop in Berkshire's fourth-quarter operating profits is somewhat overstated, because the company includes in operating earnings non-cash currency swings mostly related to the company's yen-denominated debt that funds its equity ownership of five Japanese trading companies. Adjust for the currency swings, and the drop in earnings was about 28%. There were about $600 million of currency gains in the fourth quarter against $1.2 billion in the year-earlier period. Berkshire generates those non-cash gains when the dollar rises relative to the Japanese yen.</span></p><p class=\"\"><span>What Berkshire calls other income, which includes the currency swings, was down to $159 million in the fourth quarter from $1.8 billion in the prior period. Strip out the other incom, and operating profits after taxes would have been down about 20% year over year, Barron's calculates.</span></p><p class=\"\"><span>Insurance underwriting results fell 54% to $1.6 billion in the fourth quarter.</span></p><p class=\"\"><span>Insurance investment income was down 25% to $3.1 billion in the period. The decline in insurance investment income overstates the drop in Berkshire's total investment income, because the company has shifted a significant chunk of investments to the parent company from the insurance units.</span></p><p class=\"\"><span>The parent company had about $127 billion of cash and equivalents at year-end 2025, up from around $96 billion a year earlier. Having cash at the parent company gives Berkshire more financial flexibility, since insurance regulators can limit cash that can be upstreamed from insurance units.</span></p><p class=\"\"><span>Berkshire's parent-company investment income roughly doubled in the fourth quarter to $927 million.</span></p><p class=\"\"><span>Berkshire held a total of $321 billion of Treasury bills at year-end 2025, making it one of the largest holders in the world.</span></p><p class=\"\"><span>Earnings at the Burlington Northern Santa Fe railroad rose 7% to more than $1.3 billion in the period, while profits after taxes at Berkshire Hathaway Energy, the company's big utility unit, were down 5% in the fourth quarter to $691 million. Profits rose 3% to $3.4 billion at the company's diversified manufacturing service and retailing segment.</span></p><p class=\"\"><span>Insurance float stood at $176 billion at year-end, up $5 billion during 2025.</span></p><p class=\"\"><span>Berkshire was a net seller of stocks for the third straight year in 2025, as Buffett and his investment managers Ted Weschler and Todd Combs (Combs left Berkshire in December) found few major opportunities. The company was a net seller in the fourth quarter of about $3.5 billion of equities, selling $7 billion and buying $3.5 billion.</span></p><p class=\"\"><span>For the year, Berkshire was a net seller of about $14 billion of stocks in 2025, $134 billion in 2024 (when it unloaded much of its Apple equity stake) and $24 billion in 2023, Barron's calculates based on data in the 10-K released Saturday.</span></p><p class=\"\"><span>Berkshire's equity portfolio stood at about $298 billion at year-end, and more than $315 billion when including the company's equity interests in Kraft Heinz and Occidental Petroleum.</span></p><p class=\"\"><span>Berkshire's class A shares finished Friday at $757,000 and the class B stock at $504.95. The A shares are up 0.3% so far in 2026, slightly behind the S&amp;P 500 index's total return of about 0.6%.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000008:0/",
            "pub_date": "2026-02-28 22:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}