{
    "data": [
        {
            "id": "tradingview:94bdad6cc0350:0",
            "title": "UroGen Pharma Executives Sell Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th>Reporter Name</th><th>Relationship</th><th>Type</th><th>Amount</th><th>SEC Filing</th></tr></thead><tbody><tr><td>Smith Jason Drew</td><td>General Counsel</td><td>Sell</td><td>$82,202</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1821479/000143774925002685/xslF345X05/rdgdoc.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td>Schoenberg Mark</td><td>Chief Medical Officer</td><td>Sell</td><td>$50,698</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1763581/000143774925002688/xslF345X05/rdgdoc.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Jason Drew Smith, General Counsel of UroGen Pharma Ltd., sold 7,379 ordinary shares on January 31, 2025, at a price of $11.14 per share, totaling $82,202. Following these transactions, Smith directly owns 26,468 ordinary shares of the company.</p><p class=\"\">Mark Schoenberg, Chief Medical Officer of UroGen Pharma Ltd., sold 4,551 ordinary shares on January 31, 2025, at a price of $11.14 per share, totaling $50,698. Following these transactions, Schoenberg directly owns 145,666 ordinary shares of the company.</p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:94bdad6cc0350:0-urogen-pharma-executives-sell-shares/",
            "pub_date": "2025-02-05 01:00:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008765:0",
            "title": "UBS Recommends Corporate Bonds Amid Tariff Uncertainty — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Owen Tucker-Smith</p><p class=\"\">Uncertainty surrounding global trade has some on Wall Street recommending that investors prepare for market volatility by buying more bonds. UBS told investors Tuesday morning that despite delays on Mexican and Canadian tariffs, uncertainty remains rampant. The analysts recommended high-quality government and investment grade corporate debt, noting bonds offer some shelter from the swings and yields remain attractive.</p><p class=\"\">\"More volatile markets require an increased focus on portfolio diversification and hedging approaches,\" the analysts write. The analysts said they still expect the S&amp;P 500 to rise to 6,600 by year-end - up 9% from its current level - with AI-boosted earnings as a continuing tailwind.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008765:0/",
            "pub_date": "2025-02-05 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8cHSt4:0",
            "title": "SignalHub Quantitative Think Tank Center Expands Trading Solutions Under Burley Garcia’s Leadership",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Austin, TX, Feb.  04, 2025  (GLOBE NEWSWIRE) — SignalHub Quantitative Think Tank Center has announced significant upgrades to its trading systems, further enhancing its offerings to global investors. Under the leadership of Burley Garcia, the center has focused on improving market strategies, leveraging data-driven tools to help investors make smarter, more informed decisions.</p><p class=\"\">Burley Garcia, a well-regarded expert in financial technology, has been instrumental in leading SignalHub’s efforts to refine its trading solutions. His experience in developing advanced systems has shaped the direction of the center, ensuring its solutions remain at the forefront of the industry. Garcia’s leadership brings both technical expertise and a deep understanding of market dynamics, making him a key figure in SignalHub’s continuous innovation.</p><p class=\"\">The center’s new initiatives focus on enhancing the effectiveness of trading strategies, making it easier for investors to navigate complex markets. By refining data analytics and statistical modeling techniques, SignalHub has upgraded its platform to provide more precise insights and robust tools for managing portfolios. These improvements are designed to offer greater flexibility, allowing investors to implement strategies that align with their specific goals, whether for short-term gains or long-term wealth growth.</p><p class=\"\">SignalHub's enhanced platform is now more versatile, accommodating a wide range of asset classes, from equities to commodities. The updates provide investors with an increased ability to manage risk and optimize returns, regardless of market conditions. These upgrades reflect the center's commitment to equipping traders with powerful tools that improve decision-making and enhance overall performance.</p><p class=\"\">In addition to its focus on technological advancements, SignalHub continues to prioritize investor education. The center offers comprehensive training programs that help investors understand the principles of quantitative trading and how to best apply them to real-world scenarios. These educational resources cater to both novice and experienced investors, equipping them with the knowledge they need to effectively use the center’s tools and strategies.</p><p class=\"\">SignalHub’s approach extends beyond just providing tools; it is also dedicated to building a community of investors who can exchange knowledge and insights. The center’s mission is to foster a global network of well-informed traders, giving them access to advanced technologies and strategies that help improve their financial outcomes. As part of its continued growth, SignalHub is investing in further innovations to ensure that its solutions remain relevant and effective in an ever-changing market landscape.</p><p class=\"\">Garcia’s leadership has been critical in shaping the company’s forward-thinking approach. With a focus on continuous improvement, SignalHub has strengthened its position as a leader in the trading solutions sector. Under his guidance, the center has expanded its offerings to meet the needs of a wider range of investors, from those looking for high-frequency trading strategies to those seeking stable, long-term portfolio growth.</p><p class=\"\">As SignalHub prepares to roll out its newly upgraded platform, investors can expect even more advancements that will improve trading efficiency and accessibility. The center remains committed to helping its clients succeed by providing the tools and knowledge necessary for making smart investment decisions. With the upcoming release of its enhanced trading systems, SignalHub Quantitative Think Tank Center is poised to continue its trajectory of growth and success in the global financial market.</p><p class=\"\">Lily Morgan</p><p class=\"\">SignalHub</p><p class=\"\">Marketing (at) signalhub-ai.com</p><p class=\"\">https://www.signalhub-ai.com/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8cHSt4:0-signalhub-quantitative-think-tank-center-expands-trading-solutions-under-burley-garcia-s-leadership/",
            "pub_date": "2025-02-05 01:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_WkrZ98lT:0",
            "title": "Buy-back of shares in MTG during week 5, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>MTG<p class=\"\">During the period between 27 January 2025 and 31 January 2025 Modern Times Group MTG AB (publ) (LEI code 549300E8NDODRSX29339) (\"MTG\") repurchased, in total, 75,000 own class B shares (ISIN code SE0018012494) under the share repurchase program initiated by the Board of Directors.</p><p class=\"\">The share buy-backs form a part of the share repurchase program of a maximum of 5,789,385 shares for a maximum amount of SEK 400 million, which MTG announced on 16 May 2024. The share repurchase program, which runs from 17 May 2024 up until and including 30 April 2025, is being carried out in accordance with the Market Abuse Regulation (EU) No 596/2014 (\"MAR\") and the Commission Delegated Regulation (EU) No 2016/1052 (the \"Safe Harbour Regulation\"). The objectives of the share buy-backs are to deliver shareholder value and to optimize the capital structure of the company. The intention is to reduce MTG's share capital through subsequent share cancellations.</p><p class=\"\">Class B shares in MTG have been repurchased (in SEK) as follows:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td rowspan=\"2\">Date</td><td rowspan=\"2\">Aggregated daily volume (number of shares)</td><td rowspan=\"2\">Weighted average share price per day (SEK)</td><td rowspan=\"2\">Total daily transaction value (SEK)</td><td></td></tr><tr><td></td><td></td></tr><tr><td>27/01/2025</td><td>15,000</td><td>100.2585</td><td>1,503,877.50</td><td></td><td></td></tr><tr><td>28/01/2025</td><td>15,000</td><td>100.5777</td><td>1,508,665.50</td><td></td><td></td></tr><tr><td>29/01/2025</td><td>15,000</td><td>101.7441</td><td>1,526,161.50</td><td></td><td></td></tr><tr><td>30/01/2025</td><td>15,000</td><td>101.8369</td><td>1,527,553.50</td><td></td><td></td></tr><tr><td>31/01/2025</td><td>15,000</td><td>102.7433</td><td>1,541,149.50</td><td></td><td></td></tr></tbody></table></div><p class=\"\">All acquisitions have been carried out on Nasdaq Stockholm by Kepler Cheuvreux on behalf of MTG. Following the above acquisitions, MTG's holding of own shares as of 31 January 2025 amounts to 4,083,066 class B shares and 6,280,623 class C shares. The total number of shares in MTG amounts to 128,310,627. The number of own Class B shares held by MTG and the total number of shares in MTG reflect the cancellation of 3,358,100 Class B shares on 5 August 2024 and the reclassification of 43,720 C shares into B shares on 29 January 2025.</p><p class=\"\">A full breakdown of the transactions pursuant to article 5.3 of MAR and article 2.3 of the Safe Harbour Regulation is attached to this announcement.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information:</strong></p><p class=\"\">Anton Gourman, VP Communications and IR</p><p class=\"\">Direct: +46 73 661 8488, anton.gourman@mtg.com</p><p class=\"\">Follow us: mtg.com / LinkedIn</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About MTG</strong></p><p class=\"\">MTG (Modern Times Group MTG AB (publ)) (www.mtg.com) is an international mobile gaming group that owns and operates gaming studios with popular global IPs across a wide range of casual and mid-core genres. The group is focused on accelerating portfolio company growth and supporting founders and entrepreneurs. MTG is an active driver of gaming industry consolidation and a strategic acquirer of gaming companies around the world. We are born in Sweden but have an international culture and global footprint. Our shares are listed on Nasdaq Stockholm under the tickers MTGA and MTGB.</p><p class=\"\">https://news.cision.com/mtg/r/buy-back-of-shares-in-mtg-during-week-5--2025%2Cc4099731</p><p class=\"\">Buyback Appendix ENG Week 5-25</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_WkrZ98lT:0-buy-back-of-shares-in-mtg-during-week-5-2025/",
            "pub_date": "2025-02-05 01:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008771:0",
            "title": "Berry Global Shares Rise Following 1Q Earnings Beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Shares of Berry Global Group climbed after the company beat Wall Street's expectations in its fiscal first quarter, boosted by higher volumes and prices, as well as recent streamlining efforts.</p><p class=\"\">The stock was trading 4.5% higher, at $69.81, midday Tuesday. Shares, which are on pace for their largest percent increase in almost a year, have gained 18% in the past 52 weeks.</p><p class=\"\">The maker of packaging for food and industrial applications posted net income of $14 million, or 12 cents a share, for its quarter ended Dec. 28, compared with $59 million, or 50 cents a share, in last year's comparable quarter.</p><p class=\"\">Excluding discontinued operations from the spin off of Berry's health, hygiene and specialties global nonwovens and films business and its merger with Glatfelter, the company reported net income of $81 million, or 69 cents a share.</p><p class=\"\">Adjusted per-share earnings came in at $1.09 a share, beating the 98 cents that analysts surveyed by FactSet were expecting.</p><p class=\"\">Net sales increased 2.2% to $2.39 billion, driven by 2% organic volume growth and higher prices, the company said. Analysts were looking for revenue of $2.35 billion.</p><p class=\"\">Sales across the company's international consumer packaging segment fell 3% to $885 million, dragged down by its recent divestiture. The decrease was offset by its North American consumer packaging segment, where sales climbed 10% to $769 million, boosted by higher volumes and prices.</p><p class=\"\">Revenue from the company's flexibles unit increased 2% to $731 million.</p><p class=\"\">Chief Executive Kevin Kwilinski said the company is transitioning into a more streamlined provider of consumer packaging solutions thanks to its recent strategic actions, as well as its commitment to innovation and sustainability.</p><p class=\"\">The Evansville, Ind., company backed its 2025 outlook for adjusted per-share earnings between $6.10 and $6.60. Analysts surveyed by FactSet modeled adjusted earnings of $6.26 a share.</p><p class=\"\">Berry said its combination with Amcor, announced as an $8.4 billion stock swap in November, is expected to be completed sometime in the middle of 2025.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008771:0/",
            "pub_date": "2025-02-05 01:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9YKMDZ:0",
            "title": "Endeavour Announces Holding(s) in Company",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Endeavour Mining plc (“the Company”) announces that it received the following notification, today 4 February 2025, from Blackrock, Inc. of its interests in the Company as at 3 February 2025</p><p class=\"\">TR-1: Standard form for notification of major holdings</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">1. Issuer Details </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ISIN </strong></p><p class=\"\">GB00BL6K5J42</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Issuer Name </strong></p><p class=\"\">ENDEAVOUR MINING PLC</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UK or Non-UK Issuer </strong></p><p class=\"\">UK</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">2. Reason for Notification </strong></p><p class=\"\">An acquisition or disposal of voting rights</p><p class=\"\">3. Details of person subject to the notification obligation </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Name </strong></p><p class=\"\">BlackRock, Inc.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">City of registered office (if applicable) </strong></p><p class=\"\">Wilmington</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Country of registered office (if applicable) </strong></p><p class=\"\">USA</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">4. Details of the shareholder </strong></p><p class=\"\">Full name of shareholder(s) if different from the person(s) subject to the notification obligation, above </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">City of registered office (if applicable) </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Country of registered office (if applicable) </strong></p><p class=\"\">5. Date on which the threshold was crossed or reached </p><p class=\"\">03-Feb-2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">6. Date on which Issuer notified </strong></p><p class=\"\">04-Feb-2025</p><p class=\"\">7. Total positions of person(s) subject to the notification obligation </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>. </td><td>% of voting rights attached to shares (total of 8.A) </td><td>% of voting rights through financial instruments (total of 8.B 1 + 8.B 2) </td><td>Total of both in % (8.A + 8.B) </td><td>Total number of voting rights held in issuer </td></tr><tr><td>Resulting situation on the date on which threshold was crossed or reached </td><td>13.030000 </td><td>0.440000 </td><td>13.470000 </td><td>32840971 </td></tr><tr><td>Position of previous notification (if applicable) </td><td>12.450000 </td><td>0.550000 </td><td>13.000000 </td><td> </td></tr></tbody></table></div><p class=\"\">8. Notified details of the resulting situation on the date on which the threshold was crossed or reached </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">8A. Voting rights attached to shares </strong></p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Class/Type of shares ISIN code(if possible) </td><td>Number of direct voting rights (DTR5.1) </td><td>Number of indirect voting rights (DTR5.2.1) </td><td>% of direct voting rights (DTR5.1) </td><td>% of indirect voting rights (DTR5.2.1) </td></tr><tr><td>GB00BL6K5J42 </td><td> </td><td>31750892 </td><td> </td><td>13.030000 </td></tr><tr><td>Sub Total 8.A </td><td colspan=\"2\">31750892 </td><td colspan=\"2\">13.030000% </td></tr></tbody></table></div><p class=\"\">8B1. Financial Instruments according to (DTR5.3.1R.(1) (a)) </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Type of financial instrument </td><td>Expiration date </td><td>Exercise/conversion period </td><td>Number of voting rights that may be acquired if the instrument is exercised/converted </td><td>% of voting rights </td></tr><tr><td>Securities Lending </td><td> </td><td> </td><td>1001701 </td><td>0.410000 </td></tr><tr><td>Sub Total 8.B1 </td><td colspan=\"2\"> </td><td>1001701 </td><td>0.410000% </td></tr></tbody></table></div><p class=\"\">8B2. Financial Instruments with similar economic effect according to (DTR5.3.1R.(1) (b)) </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Type of financial instrument </td><td>Expiration date </td><td>Exercise/conversion period </td><td>Physical or cash settlement </td><td>Number of voting rights </td><td>% of voting rights </td></tr><tr><td>CFD </td><td> </td><td> </td><td>Cash </td><td>88378 </td><td>0.030000 </td></tr><tr><td>Sub Total 8.B2 </td><td colspan=\"3\"> </td><td>88378 </td><td>0.030000% </td></tr></tbody></table></div><p class=\"\">9. Information in relation to the person subject to the notification obligation </p><p class=\"\">2. Full chain of controlled undertakings through which the voting rights and/or the financial instruments are effectively held starting with the ultimate controlling natural person or legal entities (please add additional rows as necessary)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Ultimate controlling person </td><td>Name of controlled undertaking </td><td>% of voting rights if it equals or is higher than the notifiable threshold </td><td>% of voting rights through financial instruments if it equals or is higher than the notifiable threshold </td><td>Total of both if it equals or is higher than the notifiable threshold </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock HK Holdco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Lux Finco S.a.r.l. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Japan Holdings GK </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 1) </td><td>BlackRock Japan Co., Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>Trident Merger, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 2) </td><td>BlackRock Investment Management, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Finance Europe Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 3) </td><td>BlackRock Investment Management (UK) Limited </td><td>8.300000 </td><td>0.190000 </td><td>8.500000% </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Australia Holdco Pty. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 4) </td><td>BlackRock Investment Management (Australia) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 5) </td><td>BlackRock International Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 4, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Holdco 6, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Delaware Holdings Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 6) </td><td>BlackRock Institutional Trust Company, National Association </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 4, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Holdco 6, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Delaware Holdings Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 7) </td><td>BlackRock Fund Advisors </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 8) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock HK Holdco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 9) </td><td>BlackRock Asset Management North Asia Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Canada Holdings ULC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 10) </td><td>BlackRock Asset Management Canada Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Capital Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 11) </td><td>BlackRock Advisors, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Holdco 3, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman 1 LP </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman West Bay Finco Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Cayman West Bay IV Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Group Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Finance Europe Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 12) </td><td>BlackRock Advisors (UK) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Holdco 2, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock Financial Management, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock International Holdings, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BR Jersey International Holdings L.P. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock (Singapore) Holdco Pte. Ltd. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 13) </td><td>BlackRock (Singapore) Limited </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>BlackRock Finance, Inc. </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Trident Merger, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>BlackRock Investment Management, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Amethyst Intermediate, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Aperio Holdings, LLC </td><td> </td><td> </td><td> </td></tr><tr><td>BlackRock, Inc. (Chain 14) </td><td>Aperio Group, LLC </td><td> </td><td> </td><td> </td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">10. In case of proxy voting </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Name of the proxy holder </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The number and % of voting rights held </strong></p><p class=\"\">The date until which the voting rights will be held </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">11. Additional Information </strong></p><p class=\"\">BlackRock Regulatory Threshold Reporting Team </p><p class=\"\">Jana Blumenstein </p><p class=\"\">020 7743 3650</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">12. Date of Completion </strong></p><p class=\"\">04th February 2025</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">13. Place Of Completion </strong></p><p class=\"\">12 Throgmorton Avenue, London, EC2N 2DL, U.K.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Endeavour Mining PLC_2025-02-03_GH_(Issuer) New      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9YKMDZ:0-endeavour-announces-holding-s-in-company/",
            "pub_date": "2025-02-05 01:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463505:0",
            "title": "Germany's DAX Index Edges Up; Infineon Soars on Fiscal Q1 Beat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German equities edged up on Tuesday as global markets remain cautious of more tariff threats from US President Donald Trump despite last-minute deals with Canada and Mexico. </p><p class=\"\">Amid a relatively quiet day for local economic news, the blue-chip DAX index closed 0.36% in the green. </p><p class=\"\">\"The final point to make is that markets are not fully pricing out the tariff threat just yet. That's because tariffs have been only delayed by a month, and secondly because the rollercoaster of trade news in the past few days does leave markets with a higher degree of uncertainty and unpredictability that harms high-beta currencies both due to direct protectionism exposures and due to risk sentiment implications,\" ING wrote. </p><p class=\"\">With the European Union next on the tariff roulette, Trade Chief Maros Sefcovic said the bloc aims to prevent such measures through an \"early engagement\" with the US. Communications between EU officials and their US counterparts are limited as the latters' appointments remain subject to confirmation. </p><p class=\"\">In corporate news, Infineon Technologies  gained 10.37% after upgrading its 2025 outlook following a better-than-expected fiscal first quarter. The German semiconductor group now expects full-year revenue to be flat to slightly up, against the previous forecast of a marginal decline. </p><p class=\"\">\"Despite Infineon's solid Q1 beat and slight order backlog growth, industry prospects remain tough and uncertain in the short-term due to ongoing inventory correction and soft demand across key end-markets,\" mwb Research said. \"On top of that, Trump tariffs add an additional layer of uncertainty, particularly for the automotive segment, where slowing EV adoption in key regions, cost pressures, and geopolitical risks could disrupt supply chains and dampen expected recovery.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463505:0-germany-s-dax-index-edges-up-infineon-soars-on-fiscal-q1-beat/",
            "pub_date": "2025-02-05 01:00:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSgqgHVa:0",
            "title": "Hologic Announces End of Life for Fluoroscan InSight FD Mini C-Arm - Minicarm.com Ensures Continued Support for Owners",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Minicarm.com: Your Go-To Source for Hologic Fluoroscan Mini C-Arm Sales, Parts &amp; Service</p><p class=\"\">HAUPPAUGE, NEW YORK / ACCESS Newswire / February 4, 2025 / Hologic has officially announced the End-of-Sale and End-of-Life for the Hologic Fluoroscan InSight FD Mini C-Arm, with sales discontinuing on September 30, 2025. While Hologic has stated they will provide limited service and parts support for up to seven years after installation, units installed in 2018 or earlier will no longer be guaranteed service as of January 1, 2026.</p><p class=\"\">For medical professionals and imaging centers relying on the Hologic Fluoroscan InSight FD Mini C-Arm, Minicarm.com is stepping in to provide long-term solutions, ensuring facilities can continue to buy, sell, service, and source parts for these essential machines for years to come.</p><p class=\"\">MiniCarm.com: Your Trusted Source for Hologic Fluoroscan InSight FD Machines &amp; Parts</p><p class=\"\">With Hologic's limited service timeline and uncertain parts availability, many medical facilities may find themselves unprepared for the long-term viability of their Fluoroscan InSight FD Mini C-Arms. Minicarm.com is committed to keeping these Mini C-Arms in operation by offering:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Fluoroscan InSight FD Machines for Sale - Purchase refurbished Mini C-Arms that are like new.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Full-Service Repairs &amp; Maintenance - Expert technicians available for diagnostics and repairs.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Replacement Parts - Access to parts to keep machines running smoothly.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trade-In - Upgrade Options Available - Looking for an alternative? Minicarm.com also offers the Hologic Fluoroscan InSight 2 for those seeking a high-performance Mini C-Arm solution.</p></li></ul><p class=\"\">Hologic Fluoroscan InSight FD End-of-Life: What You Need to Know</p><p class=\"\">According to Hologic's official notification:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Fluoroscan InSight FD units installed in 2018 or earlier will no longer be guaranteed service after January 1, 2026.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Hologic will continue to service newer units based on parts availability, but supplies may become increasingly limited.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Minicarm.com will continue offering Fluoroscan InSight FD Mini C-Arm parts, repairs, and replacements long after Hologic support ends.</p></li></ul><p class=\"\">\"With Hologic officially discontinuing the Fluoroscan InSight FD, facilities need to be proactive in securing long-term maintenance and a replacement strategy,\" said Christopher Bacon, President at Minicarm.com. \"We are here to ensure medical professionals have uninterrupted access to the equipment, service, and parts they need.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Secure Your Fluoroscan InSight FD Support Today</strong></p><p class=\"\">With the official end-of-life timeline now set, facilities should act now to ensure they have a reliable source for repairs, parts, and replacements before service disruptions occur.</p><p class=\"\">Contact Minicarm.com today at (800) 643-2998 or visit Minicarm.com to explore your options.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Minicarm.com</strong></p><p class=\"\">Minicarm.com is the industry leader in refurbished Mini C-Arm fluoroscopy sales, service, and rentals. We specialize in restoring Mini C-Arms from top manufacturers like Hologic, OEC, and Orthoscan, ensuring they look and operate like new before being sold or rented to clinics, hospitals, surgery centers, and doctors' offices across the U.S. and worldwide.</p><p class=\"\">Our expertise is backed by Christopher Bacon, President of Minicarm.com, who is also the technical founder of Orthoscan, one of the leading Mini C-Arm manufacturers. With unparalleled industry knowledge and a commitment to quality, Minicarm.com provides cost-effective, high-performance imaging solutions for medical professionals everywhere.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Joshua Bacon</p><p class=\"\">info@minicarm.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Minicarm.com</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSgqgHVa:0/",
            "pub_date": "2025-02-05 01:00:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSSMVmxa:0",
            "title": "CMG Home Loans Welcomes Shawn Williams, Area Sales Manager",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ANNAPOLIS, MARYLAND / ACCESS Newswire / February 4, 2025 / CMG Home Loans, the retail division of well-capitalized privately held mortgage lender, CMG Financial, announced today the hire of Area Sales Manager, Shawn Williams (NMLS# 216745). A skilled mortgage professional with 20 years of experience, Williams will be bringing his commitment to excellence and personalized client solutions to the Maryland area.</p><p class=\"\">Williams joins CMG Home Loans as an accomplished originator, having spent years serving thousands of homeowners and leading a career total of more than $2.5 billion in loans overseen and managed, including personal production. He began his financial career at Countrywide Home Loans - which later became part of Bank of America - before rising through the ranks at George Mason Mortgage and Academy Mortgage Corporation, consistently recognized for his top-tier service and performance. Most recently, Williams worked as a residential mortgage broker before transitioning to CMG Home Loans. Throughout his career, Williams has exemplified excellence in client service and leadership, setting a high standard for loan professionals across the industry. His decision to join CMG Home Loans reflects his commitment to building on that legacy.</p><p class=\"\">\"I'm excited to join CMG Home Loans because of their strong focus on innovation and providing real solutions for clients,\" said Williams. \"I trust Bill Landon's leadership and was impressed by the glowing remarks about the executive team during my due diligence. CMG has built a strong reputation and is well-positioned to thrive in any market. This opportunity allows me to grow a talented team, help families achieve homeownership, and leverage a national platform to make a greater impact in the markets we serve. It also lets me continue doing what I love - mentoring, building relationships, and delivering exceptional service.\"</p><p class=\"\">\"We are very excited about Shawn joining CMG,\" added Bill Landon, Divisional, Mid-Atlantic Region. \"I have known Shawn for many years, and he brings enthusiasm, professionalism, and high integrity to work every day! Welcome Shawn!\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CMG</strong></p><p class=\"\">CMG Mortgage, Inc. (NMLS #1820) is a well-capitalized mortgage lender founded in 1993. Founder and CEO, Christopher M. George, was Chairman of the Mortgage Bankers Association in 2019. CMG makes its products and services available to the market through three distinct origination channels including retail lending, wholesale lending, and correspondent lending. CMG currently operates in all states, including District of Columbia, and holds approvals with FNMA, FHLMC, and GNMA. CMG is widely known through the mortgage lender and housing markets for responsible lending practices, industry and consumer advocacy, product innovation, and operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Annaugh Madsen</p><p class=\"\"><em>Senior Copywriter</em></p><p class=\"\">amadsen@cmgfi.com</p><p class=\"\">(667) 260-6360</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> CMG Financial</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSSMVmxa:0/",
            "pub_date": "2025-02-05 01:00:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309081:0",
            "title": "Cantor Fitzgerald Adjusts Price Target on Regeneron Pharmaceuticals to $800 From $1,015, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regeneron Pharmaceuticals  has an average rating of overweight and mean price target of $974.65, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309081:0/",
            "pub_date": "2025-02-05 01:00:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309074:0",
            "title": "Greenbriar Up 43% as It Seals a Deal to Acquire Cordero Ranch Project Located in Utah",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Greenbriar Sustainable Living , up 43% on last look, on Tuesday said</p><p class=\"\">sealed a deal to acquire the 1,361-acre Cordero Ranch project in Cedar City, Utah. </p><p class=\"\">Tommy Sullivan, who chairs Greenbriar's real estate advisory board and is an investor in Greenbriar, purchased the Cordero Ranch property in 2002. The property was annexed into the city in 2008 in exchange for Sullivan gifting adjudicated water rights to the city. A year later, the city executed a Master Plan Development Agreement for Cordero Ranch, approving and authorizing the construction of 6,726 homes and with the city providing full water, sewer and ancillary services. </p><p class=\"\">The company has engaged Watson Engineering, who will prepare a revised Master Plan that will augment the original plan with a new south campus space for Southern Utah University, and include retail, offices, married student housing, and small sustainable entry-level homes. </p><p class=\"\">Greenbriar expects the approval process to last six months. </p><p class=\"\">The company's shares were last seen up $0.22 to $0.73 on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309074:0/",
            "pub_date": "2025-02-05 01:00:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008558:0",
            "title": "Roche's Susvimo Approved by U.S. FDA for Treatment of Diabetic Macular Edema",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Cristina Gallardo</p><p class=\"\">The U.S.'s drug regulator has approved Roche's Susvimo drug for the treatment of diabetic macular edema, the leading cause of diabetes-related blindness, the pharmaceutical company said.</p><p class=\"\">Roche said that the  Food and Drug Administration's decision was based on positive one-year results from the phase III of the Pagoda randomized study, which showed that Susvimo led to sustained improvements in the vision of people with diabetic macular edema.</p><p class=\"\">Susvimo is a refillable eye implant surgically inserted into the eye of a patient. The implant delivers a customized formulation of ranibizumab over time.</p><p class=\"\">Diabetic macular edema affects more than 29 million adults worldwide.</p><p class=\"\">Write to Cristina Gallardo at cristina.gallardo@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008558:0/",
            "pub_date": "2025-02-05 01:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008793:0",
            "title": "FTC Release: FTC Sends Refunds to Consumers Affected by Fashion Nova's Deceptive Review Practices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Image View Press Release: https://www.ftc.gov/news-events/news/press-releases/2025/01/ftc-sends-refunds-consumers-affected-fashion-novas-deceptive-review-practices</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008793:0/",
            "pub_date": "2025-02-05 01:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0RW:0",
            "title": "US long-dated yields rise on market relief amid tariff delay",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US JOLTS report shows lower job openings</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US factory orders drop</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US yield curve steepens as bond market stabilizes</li></ul></span></div><span><p class=\"\">    Long-dated U.S. Treasury yields rose on Tuesday after the Trump administration granted 30-day tariff reprieves to Canada and Mexico, unwinding some of the previous session's safe-haven bid that had pushed rates lower, </p><p class=\"\">However, data showing U.S. job openings dropped sharply in December saw longer-dated yields pare some of their earlier gains, led by the 10-year note. The benchmark 10-year yield was last up 1.2 basis points (bps) at 4.555% , after dropping on Monday to its lowest since mid-December.</p><p class=\"\">Data showed that job openings, a measure of labor demand, slid to 7.6 million on the last day of December, based on the Bureau of Labor Statistics' Job Openings and Labor Turnover Survey, or JOLTS report.</p><p class=\"\">   The market's focus, however, has been less on the data and more on tariffs.</p><p class=\"\">U.S. President Donald Trump on Monday suspended his threat of 25% tariffs on Mexico and Canada at the last minute, agreeing to a 30-day pause in return for concessions on border and crime enforcement.</p><p class=\"\">China, on the other hand, imposed targeted tariffs on American imports on Tuesday and put several companies, including Google, on notice for possible sanctions, in what market participants described as a measured response to an additional 10% U.S. tariff on Chinese exports.</p><p class=\"\">\"What we're seeing today is a bit of a relief not only due to delays on tariffs on Mexico and Canada, but a more measured  opening salvo between the U.S. and China,\" said Chip Hughey, managing director of fixed income, at Truist Advisory Services in Richmond, Virginia.</p><p class=\"\">China's new tariffs will not take effect until Feb. 10, giving Washington and Beijing time to try to seek a deal that Chinese policymakers have indicated they hope to reach with Trump.</p><p class=\"\">In late morning trading, U.S. two-year yields, which are tied to the Federal Reserve's policy moves, fell 3.5 bps to 4.230% (US2YT=RR).</p><p class=\"\">Also helping push the two-year yield down was a report showing that new orders for U.S.-manufactured goods dropped 0.9% in December after a revised 0.8% decline in November. Economists polled by Reuters had forecast factory orders would fall 0.7% after a previously reported 0.4% drop in November</p><p class=\"\">The rise in the 10-year yield and the fall in the two-year slightly steepened the yield curve to 31.9 bps (US2US10=TWEB), from 30.2 bps late on Monday. The curve hit its narrowest since late December on Monday after the initial tariff announcements.</p><p class=\"\">Investors have been selling the long end of the curve, demanding higher compensation, the so-called \"term premium\", in exchange for dealing with policy uncertainty over a longer time horizon. </p><p class=\"\">The current term premium for U.S. 10-year notes stood at 72 bps, according to estimates from the St. Louis Fed, compared with about 45 bps in early December.</p><p class=\"\">\"You expect yields to fall further, but that lack of clarity on policy is really giving intermediate and long-term investors more pause,\" said Truist's Hughey.</p><p class=\"\">U.S. 30-year yields also edged higher to 4.790%, up 1.9 bps (US30YT=RR).</p><p class=\"\">U.S. rate futures, meanwhile, have priced in about 44 bps of easing this year, up from 41 bps late on Monday, according to LSEG calculations, with the first rate cut likely happening at the Fed's June policy meeting.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0RW:0-us-long-dated-yields-rise-on-market-relief-amid-tariff-delay/",
            "pub_date": "2025-02-05 00:51:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV19M:0",
            "title": "Saint-Gobain To Launch Low-Carbon Stone Wool Production Line In Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Compagnie de Saint Gobain SA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TO LAUNCH ITS FIRST LOW-CARBON STONE WOOL PRODUCTION LINE IN SPAIN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">€40 MILLION INVESTMENT TO EXPAND AND DECARBONIZE ITS INSULATION PLANT</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">NEW INSTALLATIONS ARE EXPECTED TO BE OPERATIONAL IN THE FIRST HALF OF 2026</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MODERNIZATION WILL INCREASE STONE WOOL PRODUCTION CAPACITY BY APPROXIMATELY 40%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV19M:0-saint-gobain-to-launch-low-carbon-stone-wool-production-line-in-spain/",
            "pub_date": "2025-02-05 00:51:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309069:0",
            "title": "NeuroOne Medical Technologies Regains Nasdaq Compliance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NeuroOne Medical Technologies  said Tuesday it has regained compliance with Nasdaq's minimum share price requirement for continued listing. </p><p class=\"\">The company said it was notified by Nasdaq Monday that its bid price deficiency had been cured and NeuroOne was in compliance will all applicable listing standards. </p><p class=\"\">Shares of the company were down 2.2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309069:0/",
            "pub_date": "2025-02-05 00:51:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008596:0",
            "title": "New Tariffs Could Push iPhone Prices Higher. But a Trade War Could Play Out in Others Ways Too. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angela Palumbo</p><p class=\"\">Smartphones, laptops, and other electronics devices could get pricier thanks to tariffs.</p><p class=\"\">President Donald Trump announced over the weekend that he would be implementing 10% tariffs on China and 25% tariffs on Canada and Mexico. Mexican and Canadian tariffs were paused on Monday following talks with those countries' leaders, but the levies on China went into effect overnight into Tuesday.</p><p class=\"\">China has responded by announcing import taxes of 15% on U.S. crude oil, machinery, and some cars, and a 10% increase of tariffs on coal and liquefied natural gas.</p><p class=\"\">Tariffs are taxes that are charged onto goods being imported from other countries. Companies that bring in goods from these impacted countries pay those taxes to the government. It's common for those companies to pass the increased costs from tariffs onto the consumer through higher prices. This time around, a 10% tariff on China — a country where many components and products come from — is likely to lead to higher priced phones, laptops, and more.</p><p class=\"\">According to a report from the Consumer Technology Association in January, tariffs on technology products could lead to a $90 billion to $143 billion decline in U.S. consumer purchasing power.</p><p class=\"\">\"If these tariffs are sticky and they continue to hold on, then I think the time frame for the permanent price escalation is after six to 12 months, when we're going to see that, hey, everything's more expensive,\" Jim Cagnina, senior market analyst at NinjaTrader, told Barron's.</p><p class=\"\">Just a few of the companies that could feel impacts from tariffs include chip company Intel and PC maker Dell Technologies along with smartphone giant Apple. Some of these consumer electronic makers have already spoken about what tariffs could mean for them.</p><p class=\"\">Intel, Dell and Apple didn't respond to requests for comment about the tariffs.</p><p class=\"\">Intel reported fourth-quarter revenue of $14.3 billion on Jan. 30, which was higher than Wall Street estimates. On the company's fourth-quarter earnings call, interim co-chief executive officer David Zinsner said that \"we expect a portion of Q4 revenue upside was due to customers hedging against potential tariffs.\"</p><p class=\"\">But Intel also provided disappointing revenue guidance for the current quarter. Zinsner said this was due to \"added pressure coming from macro uncertainty especially around tariffs, balancing of PC inventory and increasing competition.\"</p><p class=\"\">As the China tariffs kicked in on Tuesday, shares of Apple were up 1.8%, while Intel and Dell were up 0.2% and 1.8%, respectively.</p><p class=\"\">The trade dynamic could be a problem for an already weakened PC market, which saw demand decline after the Covid-19 pandemic fueled purchases of at-home devices. Companies have been pushing out new AI powered PCs to try to spur consumer excitement, but increased prices along with higher for longer interest rates doesn't bode well for the sector.</p><p class=\"\">\"The overall macroeconomic concerns seem to be overshadowing some of the progress and excitement around AI PCs. However, we maintain the view that the impact that on-device AI will have on the industry will be positive, even if the inflection point is delayed,\" Ryan Reith, group vice president with IDC, wrote in a research report last month.</p><p class=\"\">Meanwhile, iPhone maker Apple is an interesting piece to the tariff puzzle. Most of Apple's manufacturing is done in China. Importantly, though, the Cupertino based tech giant was exempt from tariffs the last time Trump was in office.</p><p class=\"\">When asked about the potential impacts on tariffs during Apple's first-quarter earnings call on Jan. 30, CEO Tim Cook said the company is monitoring the situation, but had nothing more to add. That's led investors and consumers alike to wonder whether the price of iPhones, MacBooks and more would increase.</p><p class=\"\">If Trump's new trade policies stick, one possible outcome would be for companies like Apple to move some of their manufacturing to countries that aren't impacted by the tariffs. Barron's has previously reported that about 80% of smartphones are imported from China, and if the manufacturing moved to other places, the average cost of smartphones could rise by more than $200.</p><p class=\"\">\"As the new tariff is imposed on imports from China, Apple could have its manufacturing partners ramp up production in India and ship to the U.S. This could also be done for other Apple products that are manufactured in countries including Vietnam, Malaysia, etc.,\" BofA Securities analyst Wamsi Mohan wrote on Monday. \"We have assumed 80% of Apple products sold in the U.S. can be sourced from other countries, apart from China.\"</p><p class=\"\">It's also possible that Apple chooses not to increase prices for consumers to keep a competitive edge.</p><p class=\"\">\"It might be that they take the decision that 'we're actually going to swallow some of this for our consumers,' especially if competitors don't increase the price, at least in the short term,\" Martin Balaam, chief executive of product information management platform Pimberly, told Barron's.</p><p class=\"\">In the long-term, though, a potential trade war means consumers may be dishing out more dollars for new gadgets than they once anticipated.</p><p class=\"\">Write to Angela Palumbo at angela.palumbo@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008596:0/",
            "pub_date": "2025-02-05 00:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309060:0",
            "title": "RBC Bearings Offers 'Attractive' Growth, Margin Expansion Potential, Morgan Stanley Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">RBC Bearings  offers an \"attractive\" growth and margin expansion potential, given its management's strong execution and expectations of continued healthy demand for its aerospace and defense products, Morgan Stanley said in a Tuesday note. </p><p class=\"\">The company reported fiscal Q3 adjusted earnings Friday of $2.34 per diluted share, up from $1.85 a year earlier, as net sales rose to $394.4 million from $373.9 million. Morgan Stanley noted that RBC's industrial business returned to growth during the quarter, while aerospace and defense sales rose year over year. </p><p class=\"\">According to the investment firm, synergies between RBC and Dodge also contributed to the quarter's adjusted EBITDA margin of about 31%. Morgan Stanley said RBC's acquisition of Dodge in 2021 still provides strong cash flow generation, a recurring industrial business, and improved manufacturing technology. </p><p class=\"\">\"Given RBC's improved leverage, we continue to see the potential for accretive M&amp;A following its successful acquisition and integration of Dodge,\" Morgan Stanley added. </p><p class=\"\">Morgan Stanley raised its target price on RBC Bearings stock to $390 from $360, while maintaining its overweight rating.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309060:0/",
            "pub_date": "2025-02-05 00:52:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008604:0",
            "title": "Regeneron Pharmaceuticals on Pace for Largest Percent Increase Since August 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regeneron Pharmaceuticals, Inc. (REGN) is currently at $700.00, up $33.15 or 4.97%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Jan. 15, 2025, when it closed at $703.43</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since Aug. 3, 2023, when it rose 5.37%</li><li class=\"listItem-bmN0_SHH\">Snaps a three day losing streak</li><li class=\"listItem-bmN0_SHH\">Down 1.73% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its all-time closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Down 25.36% from 52 weeks ago (Feb. 6, 2024), when it closed at $937.81</li><li class=\"listItem-bmN0_SHH\">Down 41.75% from its 52-week closing high of $1201.76 on Aug. 27, 2024</li><li class=\"listItem-bmN0_SHH\">Up 4.97% from its 52-week closing low of $666.85 on Feb. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Traded as high as $709.98; highest intraday level since Jan. 15, 2025, when it hit $712.60</li><li class=\"listItem-bmN0_SHH\">Up 6.47% at today's intraday high; largest intraday percent increase since Aug. 3, 2023, when it rose as much as 7.61%</li><li class=\"listItem-bmN0_SHH\">Third best performer in the Nasdaq 100 today</li></ul><p class=\"\">All data as of 11:51:35 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008604:0/",
            "pub_date": "2025-02-05 00:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309073:0",
            "title": "European Equities Close Mixed in Tuesday Trading; BP Shelves Australia Renewable Project Amid Cutbacks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The European stock markets closed mixed in Tuesday trading as The Stoxx Europe 600 rose 0.27%, Germany's DAX gained 0.39%, the FTSE 100 in London was off 0.12%, France's CAC 40 was up 0.74%, and the Swiss Market Index declined 0.57%. </p><p class=\"\">In Italy, the Italian National Institute of Statistics said preliminary estimates for the consumer price index was up 0.6% compared with the previous month, and up 1.5% on an annual basis. Istat attributed the annual increase to the prices of energy products. </p><p class=\"\">In Germany, the service sector, excluding financial and insurance services, registered 0.5% less price-adjusted and 0.3% less nominal sales in November compared with October according to preliminary results from the Federal Statistical Office. </p><p class=\"\">And in corporate news, BP is shelving plans to convert its former Kwinana oil refinery in Australia to produce renewable fuels, Bloomberg reported Tuesday, citing an email from the company. The report also cited an internal memo that said BP has stopped or paused 30 projects since June as the oil and gas giant enacts cutbacks. BP did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">Alcoholic beverage company Diageo said Tuesday that it is removing its medium-term guidance due to \"macroeconomic and geopolitical uncertainty in many of our key markets impacting the pace of recovery.\"</p><p class=\"\">UBS Group reported Q4 earnings Tuesday of $0.23 per diluted share, swinging from a loss of $0.09 a year earlier. Analysts polled by FactSet expected earnings of $0.30. Underlying revenue for the quarter ended Dec. 31 was $11.06 billion, compared with $10.42 billion a year earlier. Analysts surveyed by FactSet expected $11.17 billion. The company also said it plans to repurchase $1 billion of shares in H1 and up to an additional $2 billion in H2.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309073:0-european-equities-close-mixed-in-tuesday-trading-bp-shelves-australia-renewable-project-amid-cutbacks/",
            "pub_date": "2025-02-05 00:53:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008611:0",
            "title": "Canada, Mexico Should Have Called Trump's Tariff Bluff, Rosenberg Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Economist and market strategist David Rosenberg says he believes Canada and Mexico should have called President Trump's bluff on a 25% tariff. \"That may end up having been a mistake,\" says the head of Rosenberg Research. In a note to clients after the tariff reprieve, Rosenberg says he believes trade uncertainty overhanging Canada and Mexico will dissipate. \"The 30-day reprieve is a joke. Trump is not raising tariffs and probably was never going to,\" Rosenberg says. Canada now avoids a deep recession, Rosenberg says. The Canadian dollar has strengthened, with USDCAD at C$1.4318, or down 3.2% from a Sunday night peak. Still, Rosenberg sticks to his call for USDCAD at C$1.62, with Canada's economy set to underperform the U.S. and require more rate relief. (Paul.Vieira@wsj.com, @paulvieira)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008611:0/",
            "pub_date": "2025-02-05 00:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "macenews:04bfb83bd094b:0",
            "title": "ATL FED'S BOSTIC APPEARANCE AT NATIONAL HOUSING TASK FOR EVENT ENDED",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/macenews:04bfb83bd094b:0-atl-fed-s-bostic-appearance-at-national-housing-task-for-event-ended/",
            "pub_date": "2025-02-05 00:54:00",
            "source": "Mace News",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SSNdRnh:0",
            "title": "Adjustment due to share distribution in Embracer: Asmodee Group (29/25)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NASDAQ NordicProduct information</p><p class=\"\">Adjustment due to share distribution in Embracer: Asmodee Group (29/25)</p><p class=\"\">The Extraordinary General Meeting (EGM) of Embracer Group has resolved on ashare distribution of Asmodee Group AB (Asmodee Group) to Embracer Groupshareholders, whereby one (1) Embracer Group share of class A and class B willentitle their holder to receive one (1) share of corresponding share class(i.e., class A or class B) in Asmodee Group. The Ex-date is February 4, 2025.The class B shares of Asmodee Group are expected to be listed on NasdaqStockholm on February 7, 2025. NASDAQ Derivatives Markets has carried out are-calculation of options and regular forwards/futures in Embracer Group(EMBRAC).</p><p class=\"\">For further information, please see the attached file.https://view.news.eu.nasdaq.com/view?id=bb5ee53d22aed2a1bbb0144692d8e86a0&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SSNdRnh:0-adjustment-due-to-share-distribution-in-embracer-asmodee-group-29-25/",
            "pub_date": "2025-02-05 00:54:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008628:0",
            "title": "ON Semiconductor Is Maintained at Underweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:55 GMT) </strong>ON Semiconductor Price Target Cut to $52.00/Share From $64.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008628:0/",
            "pub_date": "2025-02-05 00:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309077:0",
            "title": "Bernstein Upgrades Air Products and Chemicals to Outperform From Market Perform, Adjusts PT to $375 From $290",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Air Products and Chemicals  has an average rating of overweight and mean price target of $356.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309077:0/",
            "pub_date": "2025-02-05 00:55:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463527:0",
            "title": "UK Regulator Approves Valneva's Vaccine for Chikungunya Disease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UK's Medicines and Healthcare products Regulatory Agency approved Valneva's  IXCHIQ vaccine against Chikungunya disease, which is caused by the chikungunya virus that is transmitted by infected mosquitoes. </p><p class=\"\">The approval authorizes the use of the Swedish biologics manufacturer's chikungunya vaccine (live) brand as a single-dose prophylaxis for adults aged 18 years and older. The decision was based on two main studies, where the required level of antibodies was met after one month by 99% of participants, while a follow-up showed that the target level was maintained by 97% of the participants even after two years. </p><p class=\"\">The British drug regulator said it will monitor the vaccine's safety and effectiveness under close review.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463527:0/",
            "pub_date": "2025-02-05 00:55:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008550:0",
            "title": "Advanced Micro Devices Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:47 GMT) </strong>Advanced Micro Devices Price Target Cut to $147.00/Share From $158.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008550:0/",
            "pub_date": "2025-02-05 00:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309051:0",
            "title": "Palantir Technologies' Big Q4 Beat Boosted by AI Demand, US Commercial Segment, UBS Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Palantir Technologies'  Q4 results beat market expectations on a jump in US commercial sales and demand for artificial intelligence, underpinning strong margins and cash flow growth, UBS Securities said Tuesday in a report. </p><p class=\"\">On Monday, Palantir's results \"stood in sharp contrast to the mixed results from Microsoft  and ServiceNow  last week,\" the report said. </p><p class=\"\">\"The guidance for strong 54% US commercial revs growth in 2025 is a</p><p class=\"\">positive signal,\" UBS said. </p><p class=\"\">\"In light of DeepSeek, Palantir reaffirmed its views that model costs are falling fast, and performance gaps are narrowing,\" UBS said. Palantir's pricing structure \"may help to insulate it from any resulting AI price deflation,\" the report said. </p><p class=\"\">UBS raised its price target on Palantir stock to $105 from $80 and affirmed its neutral rating. Several other analysts boosted their price targets. </p><p class=\"\">Palantir shares jumped 25% in recent Tuesday trading. Microsoft gained 0.5%, and ServiceNow fell 1.3%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309051:0/",
            "pub_date": "2025-02-05 00:47:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:eba42dcb2094b:0",
            "title": "TradingView's General Manager Pierce Crosby Departs to Launch Consulting Firm for Startups",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">After nearly six years at the charting and analysis firm TradingView, Pierce Crosby is moving on to his next venture. The former General Manager of TradingView announced his departure to launch Merchant Seven (M7), a consulting firm focused on accelerating growth for early-stage technology companies. </p><p class=\"\">\"M7 provides a fractional, high-impact team and operational systems to help businesses move faster without the burden of full-time exec hires, Crosby posted on LinkedIn today (Tuesday). \"Why now? TradingView is in good hands, and the early-stage ecosystem is evolving rapidly. The right expertise at the right time is the perfect catalyst.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fintech and Tech Expert</strong></p><p class=\"\">With a decade of experience in fintech and trading technology, Crosby is now shifting his expertise toward helping startups scale. According to his post, Merchant Seven (M7) is designed to offer strategic guidance and operational support to growing tech firms.Pierce Crosby, Source: LinkedIn</p><p class=\"\">M7 reportedly provides a \"fractional, high-impact team\" to help businesses move forward without requiring full-time executive hires. The firm is already working with five clients and plans to expand its team this spring. </p><p class=\"\">\"We're launching with five clients already on board and expanding our team this spring to take on more. If you're building something ambitious and looking for support, drop us a note.\"</p><p class=\"\">Crosby highlighted the evolving early-stage startup ecosystem as a key reason for launching M7. By offering specialized consulting, M7 now aims to streamline growth processes and enhance operational efficiency for emerging companies. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Teaming Up with Former Colleagues</strong></p><p class=\"\">Crosby isn't embarking on this new venture alone. Joining him at M7 are two former TradingView colleagues, Milana Ruchkina. Ruchkina, previously the US Growth Director at TradingView, will serve as Chief of Staff at M7.Milana Ruchkina, Source: LinkedIn</p><p class=\"\">\"I've joined the Merchant Seven team to continue pursuing that vision and passion. My focus will be working with early-stage companies to help their dreams come true too!,\" Ruchkina wrote. </p><p class=\"\">Crosby's tenure at TradingView began in 2019, where he played a crucial role in expanding the platform's influence, particularly among retail FX and CFD brokers.</p><p class=\"\">Before that, he spent five years at StockTwits in various leadership roles, including VP of Revenue Strategy and Head of Business Development.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:eba42dcb2094b:0-tradingview-s-general-manager-pierce-crosby-departs-to-launch-consulting-firm-for-startups/",
            "pub_date": "2025-02-05 00:47:10",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308952:0",
            "title": "Top Midday Stories: China Retaliates With Tariffs, Antitrust Probe of Google; Merck Shares Tumble on Downbeat Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">All three major US stock indexes were up in late morning trading on Tuesday as investors digest the latest US tariff news. </p><p class=\"\">China imposed retaliatory measures on Tuesday after President Donald Trump announced a 10% tariff on Chinese goods over the weekend. China announced tariffs of 15% on coal and LNG coming from the US and 10% for crude oil, farm machinery and certain vehicles, set to take effect Feb. 10. In addition, China's State Administration for Market Regulation opened an antitrust investigation in Alphabet's  Google over suspected violations of the country's anti-monopoly law, according to media reports. Lastly, China's Commerce Ministry has reportedly placed PVH , owner of brands like Calvin Klein and Tommy Hilfiger, and Illumina  on its \"unreliable entity\" list, the reports said. Alphabet shares were up 1.9%, while those of PVH and Illumina were down 1.3% and 5.8%, respectively. </p><p class=\"\">Merck  reported Q4 non-GAAP earnings Tuesday of $1.72 per share, up from $0.03 a year earlier and above the consensus estimate of analysts surveyed by FactSet of $1.61. Fourth-quarter sales were $15.62 billion, up from $14.63 billion a year earlier and above the FactSet consensus estimate of $15.48 billion. For full-year 2025, Merck expects non-GAAP EPS of $8.88 to $9.03 on sales of $64.1 billion to $65.6 billion. Analysts polled by FactSet expect non-GAAP EPS of $9.13 on sales of $67.07 billion. Merck shares were down about 11%. </p><p class=\"\">PepsiCo  reported fiscal Q4 core earnings Tuesday of $1.96 per diluted share, up from $1.78 a year earlier and above the FactSet consensus estimate of $1.94. Fiscal Q4 revenue was $27.78 billion, down from $27.85 billion in the year-ago period and below the FactSet consensus of $27.89 billion. The company expects fiscal 2025 core earnings to increase by low-single digits and expects low-single-digit organic revenue growth. Pepsi shares were down 4.2%. </p><p class=\"\">Palantir Technologies  reported Q4 adjusted earnings late Monday of $0.14 per share, up from $0.08 a year earlier and above the FactSet consensus of $0.11. Fourth-quarter revenue was $827.5 million, up from $608.4 million in the year-ago period and above the FactSet consensus of $775.8 million. The company expects Q1 revenue of $858 million to $862 million, compared to the FactSet consensus estimate of $799.6 million. For full-year 2025 revenue, Palantir expects $3.74 billion to $3.76 billion, compared to the FactSet consensus of $3.50 billion. Palantir shares were up nearly 25%. </p><p class=\"\">Pfizer  reported Q4 adjusted earnings Tuesday of $0.63 per diluted share, up from $0.10 a year earlier and above the FactSet consensus estimate of $0.47. Fourth-quarter revenue was $17.76 billion, up from $14.57 billion a year earlier and above the FactSet consensus of $17.35 billion. The company reaffirmed both its full-year 2025 adjusted EPS guidance of $2.80 to $3 and its full-year 2025 revenue guidance of $61 billion to $64 billion. Pfizer shares were down 1.2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308952:0/",
            "pub_date": "2025-02-05 00:47:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}