{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309023:0",
            "title": "BlackBerry Completes Sale of Cylance Assets to Arctic Wolf",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlackBerry  and Arctic Wolf said that Arctic Wolf has completed the acquisition of BlackBerry's Cylance endpoint security assets. </p><p class=\"\">Under the terms of the transaction, announced in December, BlackBerry will receive $160 million in cash and about 5.5 million Arctic Wolf shares. </p><p class=\"\">Shares of BlackBerry were up 4.5% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309023:0/",
            "pub_date": "2025-02-05 00:05:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:cb63fb7c6094b:0",
            "title": "Spotify Beats Q4 Estimates, Raises Forecasts as User Growth Accelerates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spotify  shares soared 9.82% to $603 as of 10:55 a.m. ET Tuesday after the company reported better-than-expected Q4 earnings and raised guidance for the current quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Q4 Earnings &amp; Growth Highlights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net income: 367 million (1.76 per share) vs. 70 million loss (0.36 per share) YoY</li><li class=\"listItem-bmN0_SHH\">Total revenue: 4.24 billion (+16% YoY), beating consensus of 4.16 billion</li><li class=\"listItem-bmN0_SHH\">Total MAUs: 675 million (+12% YoY), exceeding Bloomberg estimate of 664.94 million</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 263 million (+11% YoY), above estimates of 259.99 million</li><li class=\"listItem-bmN0_SHH\">Average revenue per premium user: 4.85, up 5% YoY</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Upbeat Q1 2025 Guidance</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Total MAUs: 678 million, surpassing Bloomberg's estimate of 677.71 million</li><li class=\"listItem-bmN0_SHH\">Revenue forecast: 4.2 billion, ahead of the 4.18 billion consensus</li><li class=\"listItem-bmN0_SHH\">Gross margin: 31.5% vs. 31.2% expected</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 265 million, exceeding expectations of 259.27 million</li><li class=\"listItem-bmN0_SHH\">Operating income: 548 million, beating analysts' projection of 460.1 million</li></ul><p class=\"\">Spotify's strong user and revenue growth boosted investor confidence, driving shares higher as the company continues expanding its premium subscriber base and improving profitability.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:cb63fb7c6094b:0-spotify-beats-q4-estimates-raises-forecasts-as-user-growth-accelerates/",
            "pub_date": "2025-02-05 00:05:58",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:12019ead6094b:0",
            "title": "Lean Hog Futures Prices Were Hit Hard by the U.S.-Mexico Trade Row. Will Hog Bulls Again Show Resilience?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">April lean hog <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/quotes/HEJ25\" rel=\"nofollow\" target=\"_blank\">(HEJ25)</a> futures prices dropped the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30746212/hogs-go-limit-down-as-tariff-fever-takes-hold\" rel=\"nofollow\" target=\"_blank\">daily permissible trading limit of $4.00</a> a hundredweight on Monday following weekend news that President Donald Trump’s administration was set to <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30737606/trump-agrees-to-pause-tariffs-on-canada-and-mexico-after-they-pledge-to-boost-border-enforcement\" rel=\"nofollow\" target=\"_blank\">implement new tariffs</a> on its major trading partners, including Mexico. The specter of reduced U.S. pork shipments to Mexico, which accounts for over 25% of total U.S. pork exports, would likely lead to more abundant domestic pork supplies and drive hog prices lower in the coming months.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:877.9026217228464px;aspect-ratio:1.463171036204744\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\">Just last week, April lean hog futures hit a seven-week high of $92.75, which is just shy of the contract high of $93.60 scored in December of last year. However, last Friday, hog futures traders began to sense new trade tariffs on Mexico, Canada and China were not going to be avoided and prices dropped sharply. Then came Monday’s limit-down trading action. On Tuesday, lean hog futures have an expanded daily trading limit of $6.00</p><p class=\"\">On Monday morning, Trump and Mexican President Claudia Sheinbaum agreed to delay any new tariffs until March 1. However, the U.S. maintained its tariffs against China that took effect Tuesday. China, also a U.S. pork importer, immediately launched targeted tariffs in what is being called a controlled retaliation. China’s limited response to the U.S. duty of an additional 10% tariff on all Chinese imports underscores the attempt by Chinese officials to engage in talks that could avert an all-out U.S.-China trade war. China’s new tariffs against the U.S. will not take effect until Feb. 10, giving both parties time to try and reach a deal. Trump said he will speak with Chinese leader Xi Jinping in the next few days. </p><p class=\"\">Hog traders will continue to closely monitor the Trump trade tariff situation, which remains very fluid.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Hog Market Bulls Have Been Tough When the Going Gets Rough</strong></p><p class=\"\">The lean hog futures market bulls in recent months have shown keen price-rebounding resilience during significant price setbacks. Such could be the case again following what may turn out to be just a knee-jerk overreaction to the Trump tariff threats.</p><p class=\"\">On the positive fundamental side of the lean hog futures and cash hog (HEY00) markets, futures prices have been supported by continued strength in the CME Lean Hog Index. The latest CME index is up $0.29 to $83.77 as of Feb. 3. The cash index has gained $3.34 from the seasonal low scored on Jan. 9. Pork cutout (KMG25) value has also been climbing, despite cutout falling $0.94 to $93.81 on Monday amid the limit-down trade in hog futures.</p><p class=\"\">Last week’s U.S. hog slaughter was estimated at 2.574 million head, which is a 4.5% decline from last year at the same time. Combined with the week prior’s large year-over-year reduction in slaughter, it suggests that hog supplies are tighter than the USDA projected in its December quarterly hogs and pigs report. The agency at that time reported there were 75.8 million hogs and pigs on U.S. farms, up 1% from December 2023, but down slightly from Sept. 1, 2024.</p><p class=\"\">Seasonally, the hog market has had a pattern of price gains into mid- to late-February from annual lows in late December or early January. Also, the late Easter holiday this year may keep retailers and packing plants buying hams for Easter dinner through early March. </p><p class=\"\">The cash hog and futures markets are likely to be significantly influenced by price action in the cash cattle (GFY00) (LEY00) and futures markets in the coming weeks. Last week, live (LEJ25) and feeder cattle (GFH25) futures markets hit record highs, as did the weekly average cash cattle price. If the cattle markets have or are close to posting major peaks, retailers may decide to pass on to consumers their increased costs for wholesale beef. That could create better consumer-substitution demand for pork at the meat counter. This could buy the hog market bulls some more time until the grilling season begins in late spring and consumer demand for pork rises.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:887.1859296482412px;aspect-ratio:1.4786432160804022\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trading Late This Week Likely Will be Extra Important</strong></p><p class=\"\">As of this writing Tuesday morning, April lean hog futures prices were posting a decent rebound from Monday’s limit-down trade. How the lean hog futures market closes on Friday (prices near the weekly high or near the weekly low) may be a good indicator for price-trending direction during the rest of February.</p><p class=\"\"><em>On the date of publication, Jim Wyckoff did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cattle and Hogs in Q4 and 2024 - Where are they Heading in 2025?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Protein Prices Heading as the Offseason for Demand Approaches?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Proteins Prices Heading in Q3 and Beyond?</li><li class=\"listItem-bmN0_SHH\">Can the Meats Rally During the Peak Season in 2024?</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:12019ead6094b:0-lean-hog-futures-prices-were-hit-hard-by-the-u-s-mexico-trade-row-will-hog-bulls-again-show-resilience/",
            "pub_date": "2025-02-05 00:06:06",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008298:0",
            "title": "United Airlines Is Maintained at Positive by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:07 GMT) </strong>United Airlines Price Target Raised to $130.00/Share From $120.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008298:0/",
            "pub_date": "2025-02-05 00:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7094gC:0",
            "title": "Canadian Large Cap Leaders Split Corp. Completes Preferred Share Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>[Not</em> <em>for</em> <em>distribution</em> <em>to</em> <em>U.S.</em> <em>newswire</em> <em>services</em> <em>or</em> <em>for</em> <em>dissemination</em> <em>in</em> <em>the</em> <em>United</em><em> States</em><em>.]</em></p><p class=\"\">TORONTO, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">(TSX: NPS, NPS.PR.A)</strong> – Canadian Large Cap Leaders Split Corp. (the “Company”) is pleased to announce that it has completed the previously announced private placement of its preferred shares for aggregate gross proceeds of approximately $2.5 million (the “Private Placement”). Pursuant to the Private Placement, 235,000 preferred shares were offered to investors at a price of $10.65 per preferred share.</p><p class=\"\">The Company’s previously announced split of its Class A shares (the “Share Split”) will be effected at the close of business today. Following the Share Split, there will be approximately 1,795,547 Class A shares and 1,796,353 preferred shares outstanding. DBRS has confirmed that the rating of the preferred shares will continue to be Pfd-3 (high) following the completion of the Share Split.</p><p class=\"\">The Company invests, on an approximately equally-weighted basis, in a portfolio comprised primarily of equity securities of Canadian Dividend Growth Companies (as defined below), selected by the portfolio manager, that at the time of investment and immediately following each periodic reconstitution and rebalancing: (i) are listed on a Canadian exchange; (ii) pay a dividend; (iii) generally have a market capitalization of at least $10 billion; (iv) have options in respect of its equity securities that, in the opinion of the portfolio manager, are sufficiently liquid to permit the portfolio manager to write options in respect of such securities; and (v) have a history of dividend growth or, in the portfolio manager’s view have high potential for future dividend growth (“Canadian Dividend Growth Companies”).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About</strong> <strong class=\"root-Tkn6WL2y\">Ninepoint Partners LP</strong></p><p class=\"\">Ninepoint Partners LP is the Manager, Portfolio Manager and Promoter of the Company and provides all administrative services required by the Company. Based in Toronto, Ninepoint Partners LP is one of Canada’s leading alternative investment management firms overseeing approximately $7 billion in assets under management and institutional contracts. Committed to helping investors explore innovative investment solutions that have the potential to enhance returns and manage portfolio risk, Ninepoint offers a diverse set of alternative strategies spanning Equities, Fixed Income, Alternative Income, Real Assets, F/X and Digital Assets.</p><p class=\"\">For more information on Ninepoint Partners LP, please visit www.ninepoint.com or please contact us at 416.362.7172 or 1.888.362.7172 or invest@ninepoint.com.</p><p class=\"\">You will usually pay brokerage fees to your dealer if you purchase or sell shares of investment funds on the TSX or another alternative Canadian trading <em>system</em> <em>(an “exchange”). If shares</em> <em>are</em> <em>purchased</em> <em>or</em> <em>sold</em> <em>on an exchange,</em> <em>investors</em> <em>may pay more</em> <em>than the current net asset</em> <em>value when</em> <em>buying shares</em> <em>of the</em> <!-- -->investment fund and may receive less than the current net asset value when selling them.</p><p class=\"\">There are ongoing fees and expenses associated with owning shares of an investment fund. <!-- -->An investment fund must prepare disclosure documents that <em>contain key information about the fund.</em> <!-- -->You can find more detailed information about the Company in the public filings available at <em>www.sedarplus.ca.</em> <em>Investment</em> <!-- -->funds are not guaranteed, their values change frequently and past performance may not be repeated.</p><p class=\"\">Certain statements contained in this document constitute forward-looking information within the meaning of Canadian securities laws. Forward-looking <em>information may relate to matters</em> <!-- -->disclosed in this document and to other matters identified in public filings relating to the Company, to the future outlook of the <!-- -->Company and anticipated events or results and may include statements regarding the future financial performance of the Company. In some cases, forward-looking <!-- -->information can be identified by terms such as “may”, “will”, “should”, “expect”, “plan”, “anticipate”, “believe”, “intend”, “estimate”, “predict”, <!-- -->“potential”, “continue” or other similar expressions concerning matters that are not historical facts. Actual results may vary from such forward-looking <em>information.</em> <!-- -->Investors should not place undue reliance on forward-looking statements. <!-- -->These forward-looking statements are made as of the date hereof <!-- -->and we assume no obligation to update or revise them to reflect new events or circumstances.</p><p class=\"\"><em>The securities have not</em> <em>been registered under</em> <em>the U.S. Securities</em> <em>Act of 1933, as</em> <em>amended, and may not</em> <em>be offered or</em> <em>sold in</em> <em>the United</em> <em>States</em> <em>absent</em> <!-- -->registration or any applicable exemption from the registration requirements. This news release does not constitute an offer to sell or the solicitation of an <!-- -->offer to buy securities nor will there be any sale of such securities in any state in which such offer, solicitation or sale would be unlawful.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7094gC:0-canadian-large-cap-leaders-split-corp-completes-preferred-share-private-placement/",
            "pub_date": "2025-02-05 00:07:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309029:0",
            "title": "Update: Aya Gold & Silver Expands Boumadine Project in Morocco",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Adds analyst comment and updates shares.)</p><p class=\"\">Aya Gold &amp; Silver  on Tuesday said it expanded its Boumadine project in Morocco by 28% after securing the right to four additional mining licenses. </p><p class=\"\">The four licenses totaled 59.9 square kilometers, increasing the property's size to more than 272 square kilometers. </p><p class=\"\">The company also secured the rights to a 600 square-kilometer exploration authorization, allowing it to carry out exploration activities over any unclaimed land within the authorized area. </p><p class=\"\">\"Over the past 15 months we have increased our footprint at Boumadine by 848%, aligning with our vision to consolidate ground around this world-class asset,\" said Benoit La Salle, Aya's chief executive. </p><p class=\"\">Aya completed 17,034 meters of drilling at Boumadine in January, with over 30,000 assays pending. </p><p class=\"\">\"By systematically applying advanced technology and modern exploration techniques, we will continue to generate drill targets potentially leading to a significant resource increase at Boumadine and driving further growth in the near future,\" La Salle added. </p><p class=\"\">National Bank of Canada kept its outperform rating and $21.25 price target im place following the update. </p><p class=\"\">The bank cited Aya's promising pipeline prospect in Boumadine with ongoing exploration, and noted that the company is only the only pure-play silver producer in its coverage. </p><p class=\"\">Aya's shares were last seen up $0.25 to $11.99 on the Toronto Stock Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309029:0/",
            "pub_date": "2025-02-05 00:07:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008163:0",
            "title": "RFK Jr.'s Health Secretary Nomination Moves Forward to a Senate Vote — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Nathan-Kazis</p><p class=\"\">The Senate's finance committee voted Tuesday to favorably refer Robert F. Kennedy Jr.'s nomination to serve as Secretary of Health and Human Services to a vote of the full Senate, moving him a big step closer to confirmation.</p><p class=\"\">Health care stocks fell slightly following the vote. The Health Care Select Sector SPDR fund was down 0.9% Wednesday.</p><p class=\"\">This is breaking news. Check back for more analysis soon.</p><p class=\"\">Write to Josh Nathan-Kazis at josh.nathan-kazis@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008163:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008304:0",
            "title": "PayPal's Branded Checkout Button Getting More Usage — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008304:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008311:0",
            "title": "Outbrain Up Over 9%, on Pace for Largest Percent Increase Since March 2023 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Outbrain, Inc. (OB) is currently at $6.39, up $0.56 or 9.61%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be highest close since Jan. 23, 2025, when it closed at $6.43</li><li class=\"listItem-bmN0_SHH\">On pace for largest percent increase since March 2, 2023, when it rose 16.28%</li><li class=\"listItem-bmN0_SHH\">Snaps a four day losing streak</li><li class=\"listItem-bmN0_SHH\">Down 11% year-to-date</li><li class=\"listItem-bmN0_SHH\">Down 68.13% from its all-time closing high of $20.05 on Aug. 9, 2021</li><li class=\"listItem-bmN0_SHH\">Up 54.72% from 52 weeks ago (Feb. 6, 2024), when it closed at $4.13</li><li class=\"listItem-bmN0_SHH\">Down 15.92% from its 52-week closing high of $7.60 on Dec. 24, 2024</li><li class=\"listItem-bmN0_SHH\">Up 84.15% from its 52-week closing low of $3.47 on March 1, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $6.51; highest intraday level since Jan. 22, 2025, when it hit $6.64</li><li class=\"listItem-bmN0_SHH\">Up 11.66% at today's intraday high; largest intraday percent increase since March 2, 2023, when it rose as much as 16.74%</li></ul><p class=\"\">All data as of 11:01:28 AM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008311:0/",
            "pub_date": "2025-02-05 00:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309036:0",
            "title": "Latin Metals Reports La Flora Assay Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Latin Metals  on Tuesday reported recent exploration results at La Flora project, within the Cerro Bayo property in Argentina. </p><p class=\"\">At La Flora, samples were collected from two outcropping structures where visible gold was observed. Assay results from these samples returned values of up to 82 g/t gold and 1,239 g/t silver. </p><p class=\"\">Initial exploration in the Cerro Bayo project was completed by Barrick Gold , the company said. Last year, Latin Metals completed additional mapping at Cerro Bayo and expanded exploration to La Flora for the first time, using Barrick's historical data as a foundation. </p><p class=\"\">The company has completed all work and met all requirements for granting of an exploration and drilling permit, and hopes the permit will be approved in the first quarter. </p><p class=\"\">Latin Metals was last seen up $0.005 to $0.08 on the TSX Venture Exchange.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309036:0/",
            "pub_date": "2025-02-05 00:08:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008320:0",
            "title": "Community Health Systems to Webcast Fourth Quarter and Year-End 2024 Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Community Health Systems to Webcast Fourth Quarter and Year-End 2024 Conference Call</p><p class=\"\">FRANKLIN, Tenn.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Community Health Systems, Inc.  today announced that it will webcast its fourth quarter and year-end 2024 conference call.</p><p class=\"\">The Company will issue a press release announcing its results on Tuesday, February 18, 2025, after the regular close of trading. The conference call is scheduled to begin at 10:00 a.m. Central Time, 11:00 a.m. Eastern Time, on Wednesday, February 19, 2025. During this call, Community Health Systems will review the Company's financial and operating results for the fourth quarter and full year ended December 31, 2024.</p><p class=\"\">A live webcast of the conference call will be available online at https://www.chs.net/investor-relations/investor-tools/webcasts/. An online replay will follow shortly after the call and continue for approximately 30 days.</p><p class=\"\">You can join the live call by dialing 1-833-630-1961 (domestic) or 1-412-317-1842 (international). Once connected, request to be joined into the Community Health Systems, Inc. call. A telephonic replay of the conference call will be available through February 26, 2025, by dialing 1-877-344-7529 and entering the confirmation number, 3917263.</p><p class=\"\">About Community Health Systems, Inc.</p><p class=\"\">Community Health Systems, Inc. is one of the nation's largest healthcare companies. The Company's affiliates are leading providers of healthcare services, developing and operating healthcare delivery systems in 38 distinct markets across 15 states. The Company's subsidiaries own or lease 67 affiliated hospitals with more than 11,000 beds and operate more than 1,000 sites of care, including physician practices, urgent care centers, freestanding emergency departments, occupational medicine clinics, imaging centers, cancer centers and ambulatory surgery centers. Shares in Community Health Systems, Inc. are traded on the New York Stock Exchange under the symbol \"CYH.\" The Company's headquarters are located in Franklin, Tennessee, a suburb south of Nashville. More information about the Company can be found on its website at www.chs.net.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204507392/en/</p><p class=\"\">CONTACT:    Investor Contacts:</p><p class=\"\">Kevin Hammons</p><p class=\"\">President and</p><p class=\"\">Chief Financial Officer</p><p class=\"\">(615) 465-7000</p><p class=\"\">Anton Hie</p><p class=\"\">Vice President — Investor Relations</p><p class=\"\">(615) 465-7012</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008320:0/",
            "pub_date": "2025-02-05 00:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008331:0",
            "title": "LAURENTIAN BANK OF CANADA DECLARES DIVIDEND ON ITS PREFERRED SHARES",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAURENTIAN BANK OF CANADA DECLARES DIVIDEND ON ITS PREFERRED SHARES</p><p class=\"\">Canada NewsWire</p><p class=\"\">MONTREAL, Feb. 4, 2025</p><p class=\"\">MONTREAL, Feb. 4, 2025 /CNW/ - The Board of Directors of the Laurentian Bank of Canada  (the \"Bank\") declared yesterday a dividend of $0.38725 on the preferred shares Series 13, payable on March 15, 2025 (the \"Payment Date\"), that will be paid out on March 17, 2025, the first business day after the Payment Date, to shareholders of record at the close of business on March 7, 2025.</p><p class=\"\">The above-mentioned dividends are designated as eligible dividends for the purposes of the Income Tax Act (Canada) and any similar provincial and territorial legislation.</p><p class=\"\">The preferred shares are eligible shares under the Bank's Shareholder Dividend Reinvestment and Share Purchase Plan (the \"Plan\"). Consequently, the holders of such shares may elect to reinvest their dividends in newly issued common shares of the Bank. Such purchases will be made at the applicable investment price as defined in the Plan, less a discount of 2%, and no brokerage commissions or service charges of any kind will apply.</p><p class=\"\">In addition, holders of such shares are entitled to make monthly optional cash payments to purchase additional common shares in accordance with the terms of the Plan.</p><p class=\"\">For more information, please contact Computershare Trust Company of Canada by phone at 1-800-564-6253 or by e-mail at service@computershare.com, or by mail 650 De Maisonneuve West 7th floor, Montreal, QC H3A 3T2. Beneficial or non-registered owners of common and preferred shares must contact their financial institution or broker for instructions on how to participate in the Plan.</p><p class=\"\">Registered holders who participate in the Plan who wish to terminate that participation so that cash dividends to which they are entitled to be paid on and after March 15, 2025, are not reinvested in common shares under the Plan, must deliver written notice to Computershare Trust of Canada at the above address by no later than March 7, 2025. Beneficial or non-registered holder who participate in the Plan and who wish to terminate their participation so that cash dividends to which they are entitled to be paid on and after March 15, 2025, are not reinvested in common shares under the Plan must contact their financial institution or broker for instructions on how to terminate participation in the Plan in advance of March 7, 2025.</p><p class=\"\">About Laurentian Bank</p><p class=\"\">Founded in Montréal in 1846, Laurentian Bank wants to foster prosperity for all customers through specialized commercial banking and low-cost banking services to grow savings for middle-class Canadians.</p><p class=\"\">With a workforce of approximately 2,800 employees, the Bank offers a wide range of financial services and advice-based solutions to customers across Canada and the United States. Laurentian Bank manages $47.4 billion in balance sheet assets and $24.7 billion in assets under administration.</p><p class=\"\">SOURCE Laurentian Bank of Canada</p><p class=\"\">View original content to download multimedia: http://www.newswire.ca/en/releases/archive/February2025/04/c2244.html</p><p class=\"\">/CONTACT:</p><p class=\"\">Frédérique Lavoie-Gamache, Lead Advisor, Media and Investor Relations, 438-364-1596, media@blcgf.ca</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008331:0/",
            "pub_date": "2025-02-05 00:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1I0:0",
            "title": "Toronto stocks rise as US-Canada tariff pause lifts sentiment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Canada's main stock index rebounded on Tuesday led by energy stocks, as U.S. President Donald Trump's decision to temporarily pause tariffs on Ottawa kept the overall sentiment upbeat.</p><p class=\"\">The Toronto Stock Exchange's S&amp;P/TSX composite index  was up 0.66% at 25409.78.</p><p class=\"\">    Trump on Monday     paused     steep tariffs on Mexico and Canada, agreeing to a 30-day halt for concessions on border and crime enforcement. The suspension relieved domestic investors who saw hopes of renewed negotiations to avert trade conflict among key allies.  </p><p class=\"\">    The benchmark index had pared some of its losses on Monday after Trump's decision.  </p><p class=\"\">    \"Today is just a positive sentiment carried from yesterday given the one-month delay in imposing tariffs on Canada, while Canada and the U.S. continue to negotiate over trade tariffs and border control,\" said Ian Chong, Portfolio Manager at First Avenue Investment Counsel.  </p><p class=\"\">    But Trump's 10% tariff on top metal consumer China remain in effect. Following the implementation of the tariffs at 12:01 a.m. ET (0501 GMT) on Tuesday, China     retaliated with tariffs     on targeted U.S. imports.                                     </p><p class=\"\">    At least ten sectors on TSX gained. Heavyweight energy  climbed 1.5% as crude prices rose after trading lower earlier in the session.   </p><p class=\"\">    Healthcare  added 1%, with cannabis firm Tilray Brand  boosting the sub-sector with an almost 5% rise.  </p><p class=\"\">    Canadian 10-year benchmark yield (CA10YT=RR) jumped to 3.043%, in tandem with its U.S. counterpart.   </p><p class=\"\">    Among individual stocks, TMX GROUP  rose 6.3% as the financial services company     reported     fourth-quarter profit and revenue above estimates.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1I0:0-toronto-stocks-rise-as-us-canada-tariff-pause-lifts-sentiment/",
            "pub_date": "2025-02-05 00:10:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008252:0",
            "title": "InMode Is Maintained at Hold by Needham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008252:0/",
            "pub_date": "2025-02-05 00:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463521:0",
            "title": "Three People Banned for Misleading Investors in UK Student Accommodation Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Three individuals linked to Prosperity Cathedral View Development were banned from serving as company directors for misleading 42 investors in a student accommodation project in Derby, UK. </p><p class=\"\">Investor Relations Director Fraser MacDonald, Chief Executive Gavin Barry and Chief Operating Officer Edward Fowkes were disqualified as directors for seven years after they were found to have diverted more than 2 million pounds sterling of the invested funds to another company, the UK's Insolvency Service said Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463521:0/",
            "pub_date": "2025-02-05 00:02:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008262:0",
            "title": "Red Rock Resorts Is Maintained at Positive by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:03 GMT) </strong>Red Rock Resorts Price Target Cut to $60.00/Share From $66.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008262:0/",
            "pub_date": "2025-02-05 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008257:0",
            "title": "CurrentBody Owner Mulls GBP350 Mln London IPO, Sky News Says, Citing Sources",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The Beauty Tech Group, which owns the LED light therapy mask CurrentBody, is looking to float on the London Stock Exchange in an initial pubic offering that could value it at around 350 million pounds ($435.7 million), Sky News reports, citing unnamed sources.</li><li class=\"listItem-bmN0_SHH\">The company--whose beauty technology is used by celebrities such as Kim Kardashian and Serena Williams and featured in Netflix's series Emily in Paris--has hired bankers to work on a possible IPO that could see it float on London's main market later this year, according to Sky News.</li><li class=\"listItem-bmN0_SHH\">\"The group is considering its strategic options, which includes a London IPO later this year,\" Co-founder and Chief Executive Laurence Newman told Sky News.</li></ul><p class=\"\">Full story: https://tinyurl.com/3myaejk3</p><p class=\"\">Write to Ian Walker at ian.walker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008257:0/",
            "pub_date": "2025-02-05 00:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXcdBf2j:0",
            "title": "The Joint Commission Opens 2025 Award Applications to Recognize Outstanding Achievements in Healthcare",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OAKBROOK TERRACE, Illinois, Feb.  04, 2025  (GLOBE NEWSWIRE) — The Joint Commission today opened the application period for the 2025 John M. Eisenberg Patient Safety and Quality Awards, presented in partnership with the National Quality Forum (NQF), and the 2025 Bernard J. Tyson National Award for Excellence in Pursuit of Healthcare Equity, presented in partnership with Kaiser Permanente.</p><p class=\"\">The application period for both awards closes March 31, 2025, at 11:59 p.m. CT. There is no cost to apply for either award.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Eisenberg Awards</strong></p><p class=\"\">Each year, The Joint Commission and NQF present the John M. Eisenberg Patient Safety and Quality Awards to recognize outstanding achievements by individuals and organizations across all healthcare settings that contribute to better care, healthy people and communities, and smarter spending. Awards are presented in three categories:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">National Level Innovation in Patient Safety and Quality</li><li class=\"listItem-bmN0_SHH\">Local Level Innovation in Patient Safety and Quality</li><li class=\"listItem-bmN0_SHH\">Individual Achievement</li></ul><p class=\"\">Initiatives eligible for the national and local level awards must demonstrate, at minimum, 12 months of data supporting the improvement made by the featured initiative.</p><p class=\"\">Launched in 2002, the awards honor the late John M. Eisenberg, MD, MBA, former administrator of the Agency for Healthcare Research and Quality. An impassioned advocate for healthcare quality improvement, Dr. Eisenberg was a founding member of NQF’s board of directors.</p><p class=\"\">The 2024 Eisenberg Awards winners will be announced this spring.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tyson Award</strong></p><p class=\"\">The Joint Commission and Kaiser Permanente present the annual Bernard J. Tyson National Award for Excellence in Pursuit of Healthcare Equity to recognize healthcare organizations and their partners that led initiatives to achieve a measurable, sustained reduction in one or more health disparities.</p><p class=\"\">All types of healthcare organizations that directly deliver care and have addressed disparities for any vulnerable population, including but not limited to race/ethnicity, gender, sexual orientation, age, disability, or socioeconomic status, may apply. In their application, organizations must provide data demonstrating how they improved a healthcare disparity.</p><p class=\"\">Launched in 2021, the award honors Bernard J. Tyson, the late chairman and chief executive officer of Kaiser Permanente, who worked tirelessly to address the disparities that plague the U.S. healthcare system.</p><p class=\"\">The 2024 Tyson Award winner was Zuckerberg San Francisco General Hospital and Trauma Center for its initiative that improved disparities for Black patients with heart failure.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Applying for the Awards</strong></p><p class=\"\">Links to the applications for both awards are on The Joint Commission’s website. Application resources, including application criteria and tips, for each award are available on the Eisenberg Awards and Tyson Award webpages.</p><p class=\"\">Applicants looking to apply for more than one award must complete separate applications to be considered.</p><p class=\"\">###</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About The Joint Commission</strong></p><p class=\"\">Founded in 1951, The Joint Commission seeks to continuously improve healthcare for the public, in collaboration with other stakeholders, by evaluating healthcare organizations and inspiring them to excel in providing safe and effective care of the highest quality and value. The Joint Commission accredits and certifies more than 22,000 healthcare organizations and programs in the United States. An independent, nonprofit organization, The Joint Commission is the nation’s oldest and largest standards-setting and accrediting body in healthcare. Learn more about The Joint Commission at www.jointcommission.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About National Quality Forum</strong></p><p class=\"\">The National Quality Forum (NQF) is a not-for-profit, nonpartisan, membership-based organization that works to improve healthcare outcomes, safety, equity, and affordability. Our unique role is to bring all voices to our table to forge multistakeholder consensus on quality measurement and improvement standards and practices that achieve measurable health improvements for all. NQF is a proud affiliate of The Joint Commission. Learn more at www.qualityforum.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Kaiser Permanente</strong></p><p class=\"\">Kaiser Permanente is committed to helping shape the future of health care. We are recognized as one of America's leading health care providers and not-for-profit health plans. Founded in 1945, Kaiser Permanente has a mission to provide high-quality, affordable health care services and to improve the health of our members and the communities we serve. We currently serve nearly 12.5 million members in 8 states and the District of Columbia. Care for members and patients is focused on their total health and guided by their personal Permanente Medical Group physicians, specialists, and team of caregivers. Our expert and caring medical teams are empowered and supported by industry-leading technology advances and tools for health promotion, disease prevention, state-of-the-art care delivery, and world-class chronic disease management. Kaiser Permanente is dedicated to care innovations, clinical research, health education, and the support of community health. For more information, go to about.kp.org.</p><p class=\"\">Maureen Lyons</p><p class=\"\">The Joint Commission</p><p class=\"\">(630) 792-5171</p><p class=\"\">press@jointcommission.org</p><p class=\"\">Allie Furey</p><p class=\"\">Kaiser Permanente</p><p class=\"\">(510) 292-8580</p><p class=\"\">Allie.x.furey@kp.org</p><p class=\"\">Zachary Brousseau</p><p class=\"\">National Quality Forum</p><p class=\"\">(202) 478-9326</p><p class=\"\">press@qualityforum.org</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXcdBf2j:0-the-joint-commission-opens-2025-award-applications-to-recognize-outstanding-achievements-in-healthcare/",
            "pub_date": "2025-02-05 00:03:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX9xWWyL:0",
            "title": "Former NFL Stars Team Up for NFL Alumni “On 3: Weight. Health. Hike!” Campaign To Promote Healthy Weight",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NEW ORLEANS, LA, Feb.  04, 2025  (GLOBE NEWSWIRE) — The National Football League Alumni Association (NFL Alumni) today launched its 2025 campaign—<em>On 3: Weight. Health. Hike!</em> (NFL Alumni Campaign)—to raise awareness of the impact weight can have on overall health and well-being and to share lifestyle changes and other actions that can contribute to healthy weight.</p><p class=\"\">During the days leading up to Super Bowl LIX in New Orleans, the NFL Alumni Campaign will feature several NFL legends, including former six-time Pro Bowl and five-time All-Pro running back and member of the Pro Football Hall of Fame <strong class=\"root-Tkn6WL2y\">Eric Dickerson</strong>; two-time Pro Bowl running back <strong class=\"root-Tkn6WL2y\">Deuce McAllister</strong>; six-time Pro Bowl and four-time All-Pro center and Super Bowl Champion <strong class=\"root-Tkn6WL2y\">Jeff Saturday</strong>; and Pro Bowl offensive guard and two-time Super Bowl Champion <strong class=\"root-Tkn6WL2y\">Damien Woody</strong>.  </p><p class=\"\">Through the NFL Alumni Campaign, retired NFL greats will share their own stories about losing weight following their careers in the League. They will discuss the benefits of achieving and maintaining a healthy weight, with the goal of educating individuals across the country about the connection between weight and health, along with the tools and resources available for those who want to achieve a healthy weight.</p><p class=\"\">More than 2 in 5 adults (41.9 percent) in the U.S. suffer from obesity, which can lead to serious health problems, including heart disease and diabetes. Weight gain is also a growing problem among youth, with 1 in 5 children and adolescents suffering from obesity.</p><p class=\"\">Building on previous NFL Alumni programs focused on obesity and weight loss, the NFL Alumni Campaign will raise awareness of the benefits of losing weight and encourage people living with obesity to take actions to improve their health—including seeking advice from their doctors—through a combination of earned media, social media, and community events featuring retired NFL players.  </p><p class=\"\">\"During our time in the NFL, we followed strict regimens to keep us healthy in the game, and many of us have applied those same principles to both achieve and maintain a healthy lifestyle after leaving the League,” said former All-Pro safety, Super Bowl Champion, and NFL Alumni CEO <strong class=\"root-Tkn6WL2y\">Brad Edwards.</strong><strong class=\"root-Tkn6WL2y\"> </strong>“The <em>On 3: Weight. Health. Hike!</em> Campaign enables each of us to raise awareness of the linkage between obesity and health and share our own strategies for promoting healthy habits among all Americans.\"</p><p class=\"\">“Having dropped 50 plus pounds since my playing days, I’m proof of what’s possible when you put your mind to it, have a strong team around you, and a good plan in place, ” said <strong class=\"root-Tkn6WL2y\">Jeff Saturday</strong>. As a former center, I can tell you that there are two things that my teammates and I always paid attention to—the play call and the snap count. <em>On 3: Weight. Health. Hike!</em> reminds us to get moving and take actions to improve our health.” </p><p class=\"\">“I’ve come a long way in my weight journey since I played professional football, and having a health scare made losing weight a priority,” said <strong class=\"root-Tkn6WL2y\">Damien Woody</strong>. “Changing little things, like my eating habits and moving more in my post-NFL career, made a big difference. Once I lost weight, I had more energy and greater mental focus, and most important of all, I’m around to support my family.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About NFL Alumni </strong></p><p class=\"\">Founded in 1967 by a small group of successful retired NFL players, NFL Alumni is one of the oldest and most well-respected retired player organizations in professional sports with 40 local NFL Alumni chapters nationwide. NFL Alumni’s triple mission focuses on “caring for our own,” “caring for kids,” and “caring for the community.”  Over the last three years, NFL Alumni has engaged more than 250 retired players in similar initiatives to promote health and well-being, reaching millions of Americans through more than 130M social media impressions, 4.4B earned media impressions, and more than 250 events in 35 communities across the U.S. For more information on the <em>On 3: Weight. Health. Hike!</em> Campaign, visit www.NFLAon3.org. “</p><p class=\"\">For more Information, contact info@nflaon3.org</p><p class=\"\">Emily Caniglia</p><p class=\"\">NFL Alumni</p><p class=\"\">9735878424</p><p class=\"\">emily.caniglia@nflalumni.org</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX9xWWyL:0-former-nfl-stars-team-up-for-nfl-alumni-on-3-weight-health-hike-campaign-to-promote-healthy-weight/",
            "pub_date": "2025-02-05 00:04:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008284:0",
            "title": "Saia Is Maintained at Neutral by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:05 GMT) </strong>Saia Price Target Raised to $540.00/Share From $530.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008284:0/",
            "pub_date": "2025-02-05 00:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX7YJMXW:0",
            "title": "OptimumBank Holdings, Inc. (OPHC-NASDAQ) Announces Resignation of Board Member",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fort Lauderdale, FL, Feb.  04, 2025  (GLOBE NEWSWIRE) — Board member Martin Schmidt has informed the boards of OptimumBank (the “Bank”), and OptimumBank Holding, Inc. (the “Company”), that he will resign from both boards, effective January 28, 2025. Mr. Schmidt will remain fully supportive of the continued success of the Bank and Company.</p><p class=\"\">Mr. Schmidt resides in South Florida and has served as a Director since August 2015. Mr. Schmidt’s significant experience in the financial services industry helped the board to recover through regulatory issues as quickly as possible leaving the Bank with a strong capital structure, explosive growth and a bright future. Chairman Moishe Gubin commented: “It was a pleasure having Martin Schmidt on the Boards for nearly a decade. His insight and wisdom assisted the Bank and Company in innumerable ways and on a more personal note, I looked forward to his cheerful disposition during our monthly meetings. On behalf of myself and the Board of Directors I would like to thank Martin for his loyalty and contributions and wish him well in his future endeavors.”</p><p class=\"\">‍<strong class=\"root-Tkn6WL2y\">About OptimumBank Holdings, Inc.</strong></p><p class=\"\">OptimumBank Holdings, Inc. operates as the bank holding company for OptimumBank that provides a range of consumer and commercial banking services to individuals and businesses.</p><p class=\"\">The company accepts demand interest-bearing and noninterest-bearing savings, money market, NOW and time deposit accounts, as well as certificates of deposit; and offers residential and commercial real estate, commercial, and consumer loans, as well as lending lines for working capital needs. It also provides debit and ATM cards; investment, cash management, and notary and night depository services; and direct deposits, money orders, cashier’s checks, domestic collections, drive-in tellers, and banking by mail, as well as Internet banking services. In addition, the company engages in holding, managing, and disposal of foreclosed real estate. It operates through banking offices located in Broward County, Florida. OptimumBank Holdings, Inc. was founded in 2000 and is based in Fort Lauderdale, Florida.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement:</strong></p><p class=\"\">This press release contains forward-looking statements that can be identified by terminology such as “believes,” “expects,” “potential,” “plans,” “suggests,” “may,” “should,” “could,” “intends,” or similar expressions. Many forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from any future results or implied by such statements. These factors include, but are not limited to, our limited operating history, managing our expected growth, risks associated with integration of acquired websites, possible inadvertent infringement of third-party intellectual property rights, our ability to effectively compete, our acquisition strategy, and a limited public market for our common stock, among other risks. OptimumBank Holdings, Inc.’s future results may also be impacted by other risk factors listed from time-to-time in its SEC filings. Many factors are difficult to predict accurately and are generally beyond the company’s control. Forward looking statements speak only as to the date they are made and OptimumBank Holdings, Inc. does not undertake to update forward-looking statements to reflect circumstances or events that occur after the date the forward-looking statements are made.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations &amp; Corporate Relations</strong></p><p class=\"\">Contact: Seth Denison</p><p class=\"\">Telephone: (305) 401-4140</p><p class=\"\">Email: SDenison@OptimumBank.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX7YJMXW:0-optimumbank-holdings-inc-ophc-nasdaq-announces-resignation-of-board-member/",
            "pub_date": "2025-02-05 00:05:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008283:0",
            "title": "Johannesburg Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                 Close     Change   % Change <br/>  Absa Group                 18,665.00    +240.00      +1.30 <br/>  Anglo American             54,561.00    +581.00      +1.08 <br/>  Anglo American Platinum    66,636.00    +863.00      +1.31 <br/>  AngloGold Ashanti          57,773.00   -1452.00      -2.45 <br/>  ArcelorMittal So Africa       113.00      -4.00      -3.42 <br/>  Barloworld                 10,803.00    +116.00      +1.09 <br/>  Bidvest Group              26,501.00   +1118.00      +4.40 <br/>  Datatec                     5,232.00    +192.00      +3.81 <br/>  Financiere Richemont      362,500.00   +3674.00      +1.02 <br/>  FirstRand                   7,520.00     -20.00      -0.27 <br/>  Gold Fields                32,801.00    -114.00      -0.35 <br/>  Harmony Gold Mining        22,177.00    +110.00      +0.50 <br/>  Impala Platinum Holdings   10,100.00    +100.00      +1.00 <br/>  Nedbank Group              27,522.00    +460.00      +1.70 <br/>  Old Mutual                  1,225.00      +7.00      +0.57 <br/>  PBT Group                     624.00     +34.00      +5.76 <br/>  Sanlam                      8,149.00     +86.00      +1.07 <br/>  Sappi                       4,785.00     +60.00      +1.27 <br/>  Sasol                       8,710.00      +1.00      +0.01 <br/>  Standard Bank Group        21,797.00    +487.00      +2.29 <br/>Prices in Rand <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008283:0/",
            "pub_date": "2025-02-05 00:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008275:0",
            "title": "First Community (SC) Raised to Buy From Neutral by Janney Montgomery Scott",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:05 GMT) </strong>First Community (SC) Price Target Announced at $30.00/Share by Janney Montgomery Scott</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008275:0/",
            "pub_date": "2025-02-05 00:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEEBHbQLa:0",
            "title": "Slovenia’s growth to pick up to 2.5% in 2025-2026 - Allianz Trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LJUBLJANA (Slovenia), February 4 (SeeNews) - Slovenia’s economic growth is forecast to pick up to an annual average of around 2.5% in 2025 and 2026 on the back of a continued recovery of domestic consumption and investment activity, supported by EU funds, specialist credit insurance firm Allianz Trade said.</p><p class=\"\">\"The economic outlook for Slovenia has deteriorated because of the war in Ukraine but the economy has proven more resilient than most peers among the EU member states in Central and Eastern Europe (CEE),\" Allianz Trade said on Monday in its annual research Country Risk Atlas 2025.</p><p class=\"\">Allianz Trade said that Slovenia’s growth remained weak in 2024, with domestic consumption and restocking becoming the main drivers, while the corresponding rebound in imports turned the contribution of net trade to overall growth slightly negative. Slovenia’s full-year growth came in at 2.7% in 2022 and 2.1% in 2023, supported by a strong increase in fixed investment and net exports.</p><p class=\"\">Inflationary pressures in Slovenia have been milder than in peer central and eastern Europe countries, Allianz Trade said. Consumer price inflation rose to a peak of 11% in July 2022 and hovered around 10.5% until March 2023 before falling to 4.2% on the year in December and further to just 0.0% on the year in October 2024, thanks to markedly reduced energy prices. \"As the effect of declining energy prices will fade and owing to strengthening price pressures for recreation, headline inflation is likely to pick up in the next quarters,\" according to the research. Allianz Trade expects annual average inflation to come in at slightly above 2% in 2025 and drop to target again by 2026.</p><p class=\"\">Allianz Trade rates Slovenia's business environment as strong. Its Environmental Sustainability Index ranks Slovenia 17th out of 210 economies, citing strengths in energy use, CO2 emissions per GDP, water stress, and climate resilience. Weaknesses include renewable electricity output, while the recycling rate is moderate.</p><p class=\"\">\"Overall systemic political risk is low. Slovenia is a well established democracy and has good international relations, reflected in its EU, OECD and NATO membership. Broad policy continuity can be expected after national elections. Slovenia’s sovereign creditworthiness is not at risk as all major political parties support fiscal discipline. Lastly, eurozone membership provides for moderate transfer and convertibility risk in Slovenia,\" Allianz Trade concluded.</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEEBHbQLa:0-slovenia-s-growth-to-pick-up-to-2-5-in-2025-2026-allianz-trade/",
            "pub_date": "2025-02-05 00:05:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463524:0",
            "title": "Update: BP to 'Rephase' Renewable Fuels Project in Australia",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates to include BP's statement)</p><p class=\"\">BP (BP.L) decided to \"rephase\" its Kwinana renewable fuels project in Australia, a spokesperson confirmed with MT Newswires on Tuesday. </p><p class=\"\">The oil giant said in response to a request for comment that bioenergy is still core to its strategy and the decision to adjust the delivery pace for the project is expected \"to improve capital efficiency and better align the project with government policies.\"</p><p class=\"\">Bloomberg News first reported on the decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463524:0/",
            "pub_date": "2025-02-05 00:05:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8hD9Qq:0",
            "title": "Growing Home with BASF returns with increased prize fund of $160,000",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CALGARY, ALBERTA, Feb.  04, 2025  (GLOBE NEWSWIRE) — BASF Canada Agricultural Solutions’ (BASF) community investment program, Growing Home with BASF, has even more to give in its third year. From Feb 4 to March 3, individuals in Alberta, Saskatchewan, Manitoba and Ontario can nominate the local organizations that help their communities grow to win a portion of the initiative's new $160,000 prize fund. </p><p class=\"\">Farmers and their rural communities are the heartbeat of Canada. Growing Home with BASF offers a chance to highlight and support the organizations that are making a positive impact on their communities. Twelve organizations will win big this year, with second- and third-place prizes added in each participating province: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">First place: </strong>$25,000 </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Second place:</strong> $10,000</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Third place:</strong> $5,000 </li></ul><p class=\"\">“Growing Home with BASF is an incredible opportunity to support organizations that are the backbone of their rural communities,” said Leta LaRush, Vice President, Business Management at BASF Canada Agricultural Solutions. “We are excited to continue expanding this program and helping strengthen Canadian farming communities.”  </p><p class=\"\">Nominations submitted by March 3 will be judged based on criteria, including alignment to supporting Canadian agriculture and rural communities. Following the nomination period, 12 finalists — three from each province — will be selected and announced for public voting from April 1-15 to determine the first-, second- and third-place organizations in each province.  </p><p class=\"\">Voting is open to individuals who reside in Canada and have reached the legal age of majority in their province or territory of residence. The winners, based on the number of votes, will be announced April 29. </p><p class=\"\">The 2024 Growing Home with BASF winners were Erskine Curling Club in Alberta, Abbey Curling Club in Saskatchewan, St. Jean Baptiste Volunteer Fire Department in Manitoba and Three Oaks Respite Cabin in Ontario. Each received $25,000 to further organizational goals and operations. </p><p class=\"\">To learn more about Growing Home with BASF, nominate a deserving organization and for full terms and conditions, please visit agsolutions.ca/growinghome. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Growing Home with BASF 2024 Winner Testimonials: </strong></p><p class=\"\">“When we need our community, they are always there! To everyone who supported the Erskine Curling Rink, we truly thank you. And to BASF — your contributions to our small rural hamlet will forever be remembered!” <strong class=\"root-Tkn6WL2y\">– Erskine Curling Club </strong></p><p class=\"\">“Abbey is a small town with big heart and the support we received in this contest reiterates that. Our rink is the hub of the community in the winter and winning this contest means that we can make the necessary repairs to our plant to keep the doors open for years to come. We are so grateful to have been part of this campaign.” <strong class=\"root-Tkn6WL2y\">– Abbey Curling Club </strong></p><p class=\"\">“We are honoured to be one of the winners of the Growing Home with BASF contest. This award will greatly add to our SCBA replacement project and help us to continue to provide emergency readiness for our community and surrounding area. We are extremely grateful for the support our community and surrounding area gave us during the voting process as we would not have been able to do this without them. We would like to say thank you to BASF and everyone who voted for us.” <strong class=\"root-Tkn6WL2y\">– St. Jean Baptiste Volunteer Fire Department </strong></p><p class=\"\">“We are honoured to be the Ontario recipients of the 2024 Growing Home with BASF prize and are so grateful to our community for showing their support. This prize will directly support mental health programming for farmer and first responder guests at Three Oaks.” <strong class=\"root-Tkn6WL2y\">– Three Oaks Respite Cabin </strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BASF’s Agricultural Solutions division </strong></p><p class=\"\">BASF Canada Agricultural Solutions, headquartered in Calgary, Alberta, has over 625 employees who work at one of three production facilities across Canada including: Lethbridge, Saskatoon, and Regina, or one of several research farms across the Canadian prairies. Agricultural Solutions is the largest division of BASF Canada Inc., working closely with the regional Agricultural Solutions team, collaborating on research and product development that benefits North American growers. To find out more about BASF Canada Agricultural Solutions, visit www.agsolutions.ca or follow us on X and Instagram.  </p><p class=\"\">Farming is fundamental to provide enough healthy and affordable food for a rapidly growing population while reducing environmental impacts. Working with partners and agricultural experts and by integrating sustainability criteria into all business decisions, we help farmers to create a positive impact on sustainable agriculture. That’s why we invest in a strong R&amp;D pipeline, connecting innovative thinking with practical action in the field. Our portfolio comprises seeds and specifically selected plant traits, chemical and biological crop protection, solutions for soil management, plant health, pest control and digital farming. With expert teams in the lab, field, office and in production, we strive to find the right balance for success – for farmers, agriculture and future generations. In 2022, our division generated sales of €10.3 billion. For more information, please visit www.agriculture.basf.com or any of our social media channels. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About BASF  </strong></p><p class=\"\">BASF Canada, headquartered in Mississauga, Ontario, is a subsidiary of BASF SE and an affiliate of BASF Corporation. BASF has more than 1,100 employees in Canada. For more information about BASF Canada’s operations, visit www.basf.com/ca.</p><p class=\"\">At BASF, we create chemistry for a sustainable future. We combine economic success with environmental protection and social responsibility. More than 111,000 employees in the BASF Group contribute to the success of our customers in nearly all sectors and almost every country in the world. Our portfolio comprises six segments: Chemicals, Materials, Industrial Solutions, Surface Technologies, Nutrition &amp; Care and Agricultural Solutions. BASF generated sales of €87.3 billion in 2022. BASF shares are traded on the stock exchange in Frankfurt (BAS) and as American Depositary Receipts (BASFY) in the United States. Further information at www.basf.com.</p><p class=\"\">Kasia Kistelski</p><p class=\"\">BASF Agricultural Solutions Canada</p><p class=\"\">403-589-8178</p><p class=\"\">kasia.kistelski@basf.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8hD9Qq:0-growing-home-with-basf-returns-with-increased-prize-fund-of-160-000/",
            "pub_date": "2025-02-05 00:05:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008223:0",
            "title": "Euro Credit Spreads Likely to Tighten Further in February — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Risk premia, or spreads, on euro-denominated credit are expected to tighten further in February, Societe Generale's Juan Valencia says in a note. In recent years, euro credit spreads have tightened modestly in February, excluding in 2020 due to the impact of Covid-19 and in 2022 following Russia's invasion of Ukraine. The pattern is likely to continue with slight spread tightening this February, he says. \"At the moment we don't see much evidence of a correction with spreads widening any time soon,\" Valencia says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008223:0/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1N1:0",
            "title": "De La Rue gets approaches from other entities as Edi Truell's consortium revises proposal structure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">De La Rue  said on Tuesday it had received preliminary approaches from parties other than a consortium of British financier Edi Truell's companies for the sale of the UK banknote printer. </p><p class=\"\">De La Rue added that the Truell-led consortium, which had proposed to buy it for $301 million in January, would do so through the issuance of a debt instrument and a share buyback.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1N1:0-de-la-rue-gets-approaches-from-other-entities-as-edi-truell-s-consortium-revises-proposal-structure/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX4LrQ1m:0",
            "title": "Canadian Nuclear Laboratories Expands Clean Energy Siting Invitation to Include Fusion, Hydrogen and Battery Storage",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CHALK RIVER, Ontario, Feb.  04, 2025  (GLOBE NEWSWIRE) — Canadian Nuclear Laboratories (CNL), Canada’s premier nuclear science and technology organization, is pleased to announce it has expanded the scope of its SMR siting invitation program to help organizations pursue commercial opportunities and seize a leadership position in the development and deployment of other new and innovative clean energy technologies.</p><p class=\"\">Given the continued development of other novel technologies, and CNL’s growing capabilities and expertise across other clean energy categories, the program is being expanded beyond fission based SMRs and other advanced reactor designs. Now known as CNL’s Clean Energy Siting Program, the new program will also invite vendors and technology developers interested in building prototype solutions that include fusion-based technologies, hydrogen production, battery storage and clean fuel production facilities, among others. Overall, the intent is to support the Government of Canada achieve its net-zero objectives, help Canadians businesses develop new and innovative technologies, and make CNL’s resources available to the private sector.</p><p class=\"\">“Through CNL’s ongoing engagements with clean energy leaders in Canada and around the world, it was clear there was an opportunity for us to expand and grow our SMR siting program, in order to support prototype construction and testing for other clean energy technologies,” commented Jack Craig, CNL’s President and CEO. “More importantly, Canada has set ambitious domestic targets in clean energy, and if we are to meet them, we must recognize that there is no one solution that will address a challenge of this scale and significance. To fight climate change and realize energy security, it will take all these promising technologies working in tandem with one another. That is at the heart of our renewed program, and it is our belief that we can help to accelerate the deployment of these promising technologies and maximize their full potential.”</p><p class=\"\">As a federal Crown corporation, AECL owns and oversee the sites under management by CNL. “AECL is pleased to see the expansion of the siting program to include even more approaches to clean energy production, use, and storage,” said Fred Dermarkar, AECL’s President and CEO. “This is another example of the value of Canada’s investment in its national nuclear laboratories. Our model allows us to connect commercial and academic partners with Canada’s unique nuclear science assets. This new, expanded program could not be possible without the innovative collaboration between the federal government and the private sector. AECL is proud to facilitate this new invitation process,” added Dermarkar.</p><p class=\"\">“CNL will continue to work closely with SMR vendors who are already navigating our siting program, and it is our hope that we will see an SMR sited at one of the sites we manage on behalf of AECL in the very near future,” added Dr. Stephen Bushby, CNL’s Vice-President of Science and Technology. “But given all the advances that have been realized in recent years across a number of different clean energy categories, it only makes sense that we expand our siting program to support the development of these technologies and do everything we can to bring them to the market.”</p><p class=\"\">Under the renewed program, applicants pursuing a clean energy demonstration project must still proceed through four individual stages, though these phases have been updated to align with the more collaborative approach of the renewed program. Depending on the interest and suitability of the applications, these projects could be located at the Chalk River Laboratories or the Whiteshell Laboratories site. Both sites are located on the traditional lands, waterways and ceded and unceded territories of Indigenous peoples; meaningful engagement with Indigenous peoples will be a key component of any successful project.</p><p class=\"\">While the invitation process does not include access to CNL’s research facilities or other ancillary programs, CNL is very much open to discussion with proponents regarding collaborative approaches to help advance their individual projects.</p><p class=\"\">To learn more about CNL, including its new Clean Energy Siting Program please visit www.cnl.ca.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About CNL </strong></p><p class=\"\">As Canada’s premier nuclear science and technology laboratory and working under the direction of Atomic Energy of Canada Limited (AECL), CNL is a world leader in the development of innovative nuclear science and technology products and services. Guided by an ambitious corporate strategy known as Vision 2030, CNL fulfills three strategic priorities of national importance – restoring and protecting the environment, advancing clean energy technologies, and contributing to the health of Canadians.</p><p class=\"\">By leveraging the assets owned by AECL, CNL also serves as the nexus between government, the nuclear industry, the broader private sector, and the academic community. CNL works in collaboration with these sectors to advance innovative Canadian products and services towards real-world use, including carbon-free energy, cancer treatments and other therapies, non-proliferation technologies and waste management solutions.</p><p class=\"\">To learn more about CNL, please visit www.cnl.ca.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CNL Contact:</strong></p><p class=\"\">Philip Kompass</p><p class=\"\">Director, Corporate Communications</p><p class=\"\">1-866-886-2325</p><p class=\"\">media@cnl.ca</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/fb2b90fc-6df7-448e-af36-1cb5cfd85ce6</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">CANADIAN NUCLEAR LABORATORIES EXPANDS CLEAN ENERGY SITING INVITATION TO INCLUDE FUSION, HYDROGEN AND BATTERY STORAGE</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">CNL’s Clean Energy Siting Program introduces collaborative approach to siting emerging energy technologies and solutions at Canada’s national nuclear laboratories.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX4LrQ1m:0-canadian-nuclear-laboratories-expands-clean-energy-siting-invitation-to-include-fusion-hydrogen-and-battery-storage/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0IL:0",
            "title": "Auto File-Trump’s tariff whiplash ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Greetings from London! </p><p class=\"\">The start to Trump 2.0 has been as busy for the auto industry as expected, perhaps even busier. But before we delve into the high stakes drama of the last few days, it is worth focusing briefly on events at Stellantis.  </p><p class=\"\">After Carlos Tavares was ousted as CEO in dramatic fashion in December, some analysts and investors feared that having the world’s No. 4 automaker run by committee would lead to paralysis and indecision at a time when it faces a plethora of challenges. </p><p class=\"\">But chairman John Elkann has been busy focusing on changes throughout the organization while the search for a replacement for Tavares goes on.   </p><p class=\"\">On Monday, the company announced a series of executive moves, including naming North American boss Antonio Filosa as global head of quality and integrated software and engineering activities under Chief Engineering and Technology Officer Ned Curic. </p><p class=\"\">Stellantis also said it was giving greater product planning and development powers to regional bosses, a departure from the top-down approach criticized by insiders. </p><p class=\"\">Which brings us to today’s Auto File… </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Trump’s tariff carousel  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">What next for EU on EVs?  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BYD’s Brazilian mess continues </p></li></ul><p class=\"\">    Trump’s renewed tariff chaos </p><p class=\"\">U.S. President Donald Trump has wasted little time reverting to form in his second term, sowing chaos by announcing 25% tariffs on Mexican and Canadian imports on Saturday that battered carmaker shares, then jerking the rug out from everyone on Monday by postponing them a month. </p><p class=\"\">Setting aside political questions, not least of all why employ such a major blunt instrument ostensibly to stop the trade in illicit drugs, it leaves the auto industry trying to guess what next.  </p><p class=\"\">Legacy automakers have already been struggling with weak demand, a tough transition to electric vehicles and rising competition from the Chinese – who still face 10% tariffs, but a lot less than the 60% Trump promised after winning the U.S. election in November.   </p><p class=\"\">Now add Trump whiplash to automakers’ growing list of problems. </p><p class=\"\">Faced with a consistent threat of tariffs, automakers might evaluate the feasibility of moving cheap production lines to the U.S. from Mexico. </p><p class=\"\">But as former Aston Martin CEO Andy Palmer told Reuters, that is impossible when the policy can be changed tomorrow - or in this case before the tariffs even took effect. </p><p class=\"\">Trump’s on-off tariff approach also comes after he has gone after the EV-friendly policies of the Biden administration. </p><p class=\"\">So that leaves automakers faced with the question of what type of vehicle to build in the United States – combustion engine, hybrid or full EV? – where again policy could change as soon as someone else takes office. </p><p class=\"\">This leaves them making decisions “based on hunches,” Palmer says, “which is always very dangerous.” </p><p class=\"\">Recommended reading: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Scania tries to save Northvolt </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">U.S. tariffs on China hit crude  </p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Volvo teams with Waabi for driverless trucks  </p></li></ul><p class=\"\">    Under pressure, the EU talks EVs  </p><p class=\"\">The European Commission met with European automakers, unions and interest groups to figure out how to breathe fresh life into efforts to make the shift to electric and help the continent’s auto industry fend off competition from U.S. and Chinese rivals.   </p><p class=\"\">The talks came at a tough time for Europe’s car industry struggling with those challenges, which have spurred factory closures and job cuts, including 54,000 job losses among auto suppliers in 2024. </p><p class=\"\">Europe’s car industry is laser focused on one issue: pushing ways for the EU to ditch or waive fines for failing to comply with tough new CO2 targets in 2025, that more than one in five cars they sell this year needs to be fully electric.  </p><p class=\"\">That is well above EVs’ 13.6% EU share of the new car market last year, which has led the industry to issue dire warnings that Europe’s automakers could face fines of up to 15 billion euros this year.    </p><p class=\"\">The European association representing EV makers, battery makers, charging companies and others that have been investing in readiness for an electric world issued research on Monday that says new lower-cost EVs will help the auto industry comply with the CO2 targets and that instead of waiving fines the EU beef up incentives to encourage consumers to buy EVs. </p><p class=\"\">    BYD’s tough contracts for workers in Brazil </p><p class=\"\">BYD used contracts for workers from China to build a new car factory in Brazil including clauses that violate labor laws in both countries, according to an exclusive report from my Reuters colleagues Fabio Teixeira, Luciana Novaes Magalhaes and Lisandra Paraguassu. You can read it here.  </p><p class=\"\">The workers who traveled from China to northeast Brazil to build the factory earned roughly $70 per 10-hour shift, more than twice the Chinese hourly minimum wage in many regions.  </p><p class=\"\">But the workers hired by BYD contractor Jinjiang in Brazil had to hand over their passports to their new employer, let most of their wages be sent directly to China, and hand over an almost $900 deposit that they could only get back after six months' work. </p><p class=\"\">The contract also gave the firm the power to unilaterally extend the labor contract for six months and issue 200-yuan fines for conduct such as swearing, quarreling or walking around shirtless at the site or in their living quarters. </p><p class=\"\">BYD says it had no knowledge of any violations until initial reports emerged in Brazilian media outlets in late November. </p><p class=\"\">    Nissan’s U.S. buyouts  </p><p class=\"\">Nissan is offering buyouts to workers and cutting back shifts at its three U.S. factories as the Japanese automaker pushes to slash $2.6 billion in costs globally. </p><p class=\"\">Nissan will offer buyout packages to workers at its vehicle assembly plants in Smyrna, Tennessee, and Canton, Mississippi, and an engine plant in Decherd, Tennessee. </p><p class=\"\">The automaker will cut one of two shifts making its Rogue sports utility vehicle in Smyrna starting in April, and for the Altima sedan in Canton from September. </p><p class=\"\">This all comes after Nissan announced a plan in November to cut 9,000 jobs worldwide and reduce the maximum capacity of its 25 vehicle production lines as it wrestles with a sales slump in China and North America. </p><p class=\"\">    Fast Laps </p><p class=\"\">    Tesla’s fourth quarter results fell short of Wall Street expectations, but insisted it was on track to roll out new, cheaper EVs in the first half of 2025 and would start testing a paid autonomous car service in June. </p><p class=\"\">    General Motors is switching from its loss-making Cruise robotaxi unit to a future focused on its Super Cruise driver assistance technology similar to Tesla's Autopilot in the search for a profitable business model. </p><p class=\"\">    Toyota sold 10.8 million vehicles in 2024 and remained the world's top-selling automaker for the fifth consecutive year, despite a 3.7% drop in sales.  </p><p class=\"\">    Porsche's supervisory board has started talks to end chief financial officer Lutz Meschke's and sales executive Detlev von Platen's contracts early as the German luxury carmaker struggles to boost flagging earnings and weak sales in China. </p><p class=\"\">    UVeye, a startup that uses AI-driven technology to inspect vehicles to avoid defects and target repairs, said it had raised $191 million in debt and equity to scale up production in North America and Europe. </p><p class=\"\">Think your friend or colleague should know about us? Forward this newsletter to them. They can also subscribe <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/newsletters/\" rel=\"nofollow\" target=\"_blank\">here</a>. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0IL:0-auto-file-trump-s-tariff-whiplash/",
            "pub_date": "2025-02-05 00:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}