{
    "data": [
        {
            "id": "DJN_DN20250204002481_20250204002485:0",
            "title": "Kion Group Sees 2025 Cash Flow Below Market Expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002481_20250204002485:0/",
            "pub_date": "2025-02-04 17:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002488_20250204002488:0",
            "title": "FTSE Straits Times Index Closes 0.1% Lower at 3823.01",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002488_20250204002488:0/",
            "pub_date": "2025-02-04 17:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463367:0",
            "title": "Dhanuka Agritech's Consolidated Net Profit Rises in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dhanuka Agritech  said its consolidated net profit rose to 550.4 million Indian rupees in the fiscal third quarter from 453.7 million rupees a year ago, according to a Monday filing with the Indian exchanges by the insecticides company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 12.25 rupees from 9.95 rupees a year earlier. </p><p class=\"\">Revenue from operations increased year on year to 4.45 billion rupees from 4.03 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463367:0/",
            "pub_date": "2025-02-04 17:22:14",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446521:0",
            "title": "Qatar Non-Oil Private Sector Growth Moderates at Start of 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Qatar's S&amp;P Global PMI fell to 50.2 in January 2025 from 52.9 in December, indicating a slowdown in non-energy private sector growth.</p><p class=\"\">While business conditions remained in expansion territory, the pace of improvement eased due to weaker construction demand.</p><p class=\"\">Meanwhile, the labor market remained strong, with job creation at historic levels, though employment growth softened slightly.</p><p class=\"\">Wage inflation also reached a new peak amid strong demand for skilled labor.</p><p class=\"\">However, new business dropped for the first time in over a year, mainly due to lower construction demand, though manufacturing and wholesale sectors saw strong orders.</p><p class=\"\">Regarding prices, firms managed costs well, with selling prices falling for the sixth month and supply chain conditions improving with faster delivery times.</p><p class=\"\">Looking ahead, sentiment remained positive, driven by expectations of strong demand in tourism, industrial development, and real estate.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446521:0-qatar-non-oil-private-sector-growth-moderates-at-start-of-2025/",
            "pub_date": "2025-02-04 17:22:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002481_20250204002489:0",
            "title": "Kion Group 2024 Sales EUR11.50B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002481_20250204002489:0/",
            "pub_date": "2025-02-04 17:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0OH:0",
            "title": "Reinsurer Scor rises on January renewals growth",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Scor  rise 3.7%, among top performers on Europe's STOXX 600 index , after the French reinsurer published positive renewals result for January 2025</p><p class=\"\">** Its estimated gross premium income (EGPI) grew 9.6% on January's P&amp;C renewals</p><p class=\"\">** J.P.Morgan notes continued growth in 2025, sees the renewals \"as being mildly supportive\" for Scor</p><p class=\"\">** Profit delivery rather than top-line growth remains the \"key sticking point\" for the market, JPM adds</p><p class=\"\">** Scor says the expected net technical profitability remains unchanged for the renewed portfolio</p><p class=\"\">** The shares are on track for their best day in two months if the gains hold</p><p class=\"\">($1 = 0.9675 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0OH:0-reinsurer-scor-rises-on-january-renewals-growth/",
            "pub_date": "2025-02-04 17:24:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002498:0",
            "title": "Malaysian Shares Rise 0.7%; Volatility Poised to Rise — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Malaysia's benchmark Kuala Lumpur Composite Index ended 0.7% higher at 1564.56, mirroring gains in regional indexes, as markets reacted with tepid optimism. Trump's plan to talk with Beijing raised hopes for a U.S.-China tariff reprieve, FSMOne analyst Alwyn Chew Chuan Shyn says. For now, the market doesn't seem too concerned that China announced retaliatory tariffs on some U.S. goods, he adds. Still, Chew expects volatility in the local market to rise as investors closely monitor the U.S. and Malaysian earnings seasons and Trump's foreign policies. He sees support for the KLCI at 1535 and resistance at 1590. Among gainers, CIMB Group rose 2.4% and Sunway Bhd. climbed 2.3%. Meanwhile, Nestle (Malaysia) lost 1.8% and Petronas Chemicals was 1.4% lower. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002498:0/",
            "pub_date": "2025-02-04 17:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002481_20250204002497:0",
            "title": "Kion Group 2024 Adj EBIT EUR 917M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002481_20250204002497:0/",
            "pub_date": "2025-02-04 17:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446522:0",
            "title": "German 10-Year Bund Yield Rebounds from 1-Month Low",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Germany’s 10-year Bund yield climbed above 2.4%, rebounding from a one-month low after Mexico and Canada announced a one-month delay in planned US tariffs.</p><p class=\"\">Earlier, concerns over new tariffs on Canada, Mexico, and potential EU levies had driven European bond yields lower, with the German 10-year bond yield hitting below 2.36%.</p><p class=\"\">Meanwhile, trade tensions remain high as China imposed tariffs on US goods and launched a probe into Google, responding to Trump’s 10% tariff on Chinese imports.</p><p class=\"\">In the Eurozone, inflation rose to 2.5% in January, the highest since July 2024, exceeding expectations of 2.4%.</p><p class=\"\">Core inflation held steady at 2.7%, defying forecasts of a slight dip.</p><p class=\"\">Economic weakness persists in Germany and France, adding to speculation that the ECB may cut rates further.</p><p class=\"\">Markets already expect three ECB rate cuts this year, but uncertainty over US trade policy could push the central bank toward even more aggressive easing.</p><p class=\"\">Last week, the ECB cut rates by 25bps as anticipated.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446522:0-german-10-year-bund-yield-rebounds-from-1-month-low/",
            "pub_date": "2025-02-04 17:24:19",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463366:0",
            "title": "Osaka Gas' Nine Month Profit Falls 28% on Lower Gas Sales Volume",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Osaka Gas'  profit attributable to owners of the parent fell 28.1% to 90.9 billion yen in the fiscal nine months ended Dec. 31, from 126.4 billion yen a year ago due to lower gas sales volume and reduced unit selling prices under the fuel cost adjustment system. </p><p class=\"\">The natural gas distributor said basic earnings per share fell to 224.45 yen from 304.50 yen a year ago, according to a Tokyo Stock Exchange's Monday filing. </p><p class=\"\">Net sales declined 4.4% to 1.444 trillion yen from 1.51 trillion yen a year earlier. </p><p class=\"\">It forecasted attributable profit to fall 15.6% to 112 billion yen or 276.64 yen per share and net sales to slip 4.7% to 1.986 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a year-end dividend of 47.50 yen per share each, bringing the total payout to 95.00 per share for the current fiscal year. </p><p class=\"\">Osaka Gas shares gained 2% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463366:0/",
            "pub_date": "2025-02-04 17:24:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0PI:0",
            "title": "StanChart names Maria Ramos as chair to replace Jose Vinals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Standard Chartered  appointed Maria Ramos as chair to succeed Jose Vinals, who is approaching the end of his nine-year term, the lender said on Tuesday.</p><p class=\"\">Ramos, 65, joined Standard Chartered's board as an independent non-executive director in January 2021 and was the head of South African bank ABSA Group Ltd from 2009 to 2019, overseeing its exit from the ownership of Britain's Barclays.</p><p class=\"\">She will take on her new role at StanChart as it prepares to deal with rising trade tensions worldwide, particularly between the United States under President Donald Trump and Asian markets such as China where the bank's strategy is focused.</p><p class=\"\">    Ramos will relocate to Britain to take up her new role, the bank said, and receive a salary of 1.3 million pounds ($1.62 million) per year.</p><p class=\"\">Vinals will step down at StanChart's annual shareholder meeting on May 8, the bank said.</p><p class=\"\">($1 = 0.8043 pounds)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0PI:0-stanchart-names-maria-ramos-as-chair-to-replace-jose-vinals/",
            "pub_date": "2025-02-04 17:24:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002481_20250204002500:0",
            "title": "Kion Group 2024 Adj EBIT Margin 8%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002481_20250204002500:0/",
            "pub_date": "2025-02-04 17:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0P5:0",
            "title": "UK's Diageo at near 5-year low on withdrawing medium-term sales growth outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Diageo  falls as much as 4% to 2,267.5p, lowest since March 2020</p><p class=\"\">** Spirits maker withdraws its medium-term organic sales growth target, takes actions to mitigate impact of U.S. tariffs</p><p class=\"\">** Says may undertake pricing, inventory management, re-allocation of investments and supply chain optimisation to counter tariff impacts</p><p class=\"\">** Co had forecast medium-term organic net sales growth of 5%-7%</p><p class=\"\">** In H1 FY25, organic net sales grew 1% vs company compiled analysts' expectations of 0.4% rise</p><p class=\"\">** RBC Capital says, \"We welcome the removal of medium-term guidance of 5%-7% sales and EBIT growth. In our view, this resulted in unrealistic expectations on the part of investors and sub-optimal management decisions designed to support an unfeasible growth aspiration\"</p><p class=\"\">** Stock fell more than 11% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0P5:0-uk-s-diageo-at-near-5-year-low-on-withdrawing-medium-term-sales-growth-outlook/",
            "pub_date": "2025-02-04 17:25:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463352:0",
            "title": "Nippon Steel, US Steel Legally Challenge Blocked Merger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nippon Steel  and United States Steel (US Steel) have filed an opening brief against former President Biden and the Committee on Foreign Investment in the United States (CFIUS) to challenge the block of their $14.9 billion merger, according to a joint statement on Monday. </p><p class=\"\">The companies argue in the US Court of Appeals that the decision was politically motivated, not based on national security, and deemed CFIUS' review \"a sham.\"</p><p class=\"\">The case will proceed on an expedited timeline, with briefings due by March 17 and subsequent oral arguments. </p><p class=\"\">The companies assert that the merger would strengthen US national security, protect steel jobs, and enhance competitiveness against China. </p><p class=\"\">They emphasize that the merger would deliver $55 per share to US Steel stockholders, ensure vital investments, and create a robust American steel champion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463352:0/",
            "pub_date": "2025-02-04 17:18:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463374:0",
            "title": "Update: Market Chatter: Airbus Explores Possible European Space Venture with Thales, Leonardo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates to add Goldman Sachs' statement)</p><p class=\"\">French aerospace company Airbus  reportedly mandated Goldman Sachs Group to advise on the formation of a space and satellite business with Thales  and Leonardo (LDO.MI) that can compete with Elon Musk's SpaceX. </p><p class=\"\">France-based defense and technology group Thales is in talks with advisers, while Italian aerospace company Leonardo is working with Bank of America for the plan termed Project Bromo, Bloomberg News reported Tuesday, citing people familiar with the matter. </p><p class=\"\">Talks related to the creation of the European space venture are at an exploratory stage and no service offerings are determined yet. The three-way venture will also be subject to antitrust considerations, the report noted. </p><p class=\"\">Goldman Sachs declined to comment when reached by MT Newswires. Airbus, Leonardo and Thales did not immediately respond to requests for comments. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463374:0/",
            "pub_date": "2025-02-04 17:18:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002466:0",
            "title": "U.K. March 2030 Gilt Trades Cheap, But Supply Schedule Dims Its Appeal — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The U.K. March 2030 gilt, which is due to be auctioned on Tuesday, trades at a historically cheap level and this should attract some demand at Tuesday's auction from investors seeking relative value, RBC Capital Markets analysts say in a note. However, this bond is less appealing as the Debt Management Office is set to sell this bond once more this quarter on March 5. \"We're struggling to get particularly excited about the bond on relative value here given its heavy tapping schedule ahead,\" the analysts say. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002466:0/",
            "pub_date": "2025-02-04 17:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFNc4JHZ5:0",
            "title": "Carnegie Access: EQL Pharma: Tough comparisons, but fuel for sustained high growth ahead",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Carnegie has published a new commissioned research report on EQL Pharma.</p><p class=\"\">To access the full report and subscribe to future updates, visit https://www.carnegie.se/en/commissioned-research/eql-pharma/</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFNc4JHZ5:0-carnegie-access-eql-pharma-tough-comparisons-but-fuel-for-sustained-high-growth-ahead/",
            "pub_date": "2025-02-04 17:19:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV01J:0",
            "title": "Thermax Q3 Consol Net Profit 1.16 Bln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thermax Limited :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q3 CONSOL NET PROFIT 1.16 BILLION RUPEES; IBES PROFIT EST. 1.83 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q3 CONSOL REVENUE FROM OPERATIONS 25.08 BILLION RUPEES; IBES EST. 26.95 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV01J:0-thermax-q3-consol-net-profit-1-16-bln-rupees/",
            "pub_date": "2025-02-04 17:19:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308399:0",
            "title": "UBS Group's Q4 Swings to Earnings as Revenue Rises; Plans Up to $3 Billion Share Repurchases",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  reported Q4 earnings Tuesday of $0.23 per diluted share, swinging from a loss of $0.09 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected earnings of $0.30</p><p class=\"\">Underlying revenue for the quarter ended Dec. 31 was $11.06 billion, compared with $10.42 billion a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $11.17 billion. </p><p class=\"\">The company said it plans to repurchase $1 billion of shares in the first half of 2025 and up to an additional $2 billion in the second half.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308399:0/",
            "pub_date": "2025-02-04 17:19:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002478:0",
            "title": "Tech, Media & Telecom Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Technology, Media and Telecom. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0859 GMT - Dassault Systemes' new guidance for the current quarter and 2025 as a whole is slightly below market expectations, Bryan Garnier's Aurelien Deside writes in a note to investors. The French software maker is forecasting non-IFRS total revenue between nearly 1.54 billion euros and 1.60 billion euros for the first quarter and between 6.55 billion euros and 6.65 billion euros for the full year. Deside notes that projections for both periods are about 2% below consensus. Dassault Systemes shares trade 0.2% lower at 37.29 euros. (mauro.orru@wsj.com)</p><p class=\"\">0759 GMT - Infineon Technologies' sales guidance is slightly ahead of market expectations, Citi analysts write in a note to clients. The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros it reported for fiscal 2024, better than a previous forecast of a slight decline. The new projection equates to roughly 15 billion euros against Vara Research consensus of 14.59 billion euros, Citi analysts note. Infineon's guidance lift is mostly driven by expectations of a stronger dollar based on an assumed exchange rate of $1.05 to the euro compared with $1.10 previously. (mauro.orru@wsj.com)</p><p class=\"\">0415 GMT - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">0312 GMT - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">2249 GMT - Shares of Super Micro Computer, which had delayed its earnings while it was looking into accounting issues, are up 9% to $29.27 after-hours as the company schedules a business update for Feb. 11 at 5:00 p.m. ET. A press release refers to a \"second quarter fiscal 2025 business update,\" while the company's website calls it \"Fiscal 2Q 2025 results.\" The Wall Street Journal reported in September that the Justice Department was investigating the server company. Shares surged in early December when Super Micro said a final review showed no evidence of fraud or misconduct by its management or board relating to accounting issues. On Dec. 6, it said it expected to file its delayed financial statements by Feb. 25. (josh.beckerman@wsj.com)</p><p class=\"\">2132 GMT - For the past two years, Palantir Technologies has argued that open- and closed-source artificial-intelligence models are becoming more similar, and that performance would eventually converge, Chief Technology Officer Shyam Sankar says on a call with analysts. \"That's because the market's been focused on AI supply,\" he says. \"With the release of Deep Seek R1, that has gone from a contrarian position to consensus.\" Shares jump 22% after the company says demand for its AI products continues to expand. (connor.hart@wsj.com)</p><p class=\"\">2127 GMT - Palantir Technologies closed what it called a record number of deals during 4Q, including 32 deals worth $10 million or more. Chief Revenue and Legal Officer Ryan Taylor says on a call with analysts that the company's U.S. business is at the forefront of the artificial-intelligence revolution, with nearly five-times the number of commercial customers from three years earlier and continuing to add more. \"Organizations who have crossed the chasm with Palantir are driving real impact quickly,\" he says. \"In this AI revolution the biggest risk is not moving fast enough, and organizations are looking to us.\" Shares jump 22% in after-hours trading. (connor.hart@wsj.com)</p><p class=\"\">2106 GMT - Palantir Technologies blew past analysts' expectations for 4Q and guided for another beat in the current quarter. CEO Alex Karp said in a letter to shareholders that the company's recent results are indicative of a new phase of its business. \"The business we have built has now developed its own internal momentum and strength, its own interior life and forms of untamed organic growth, with the output that we are seeing far surpassing what we are investing.\" He dubs the company a software juggernaut as its stock price jumps 21%, to $101.86, in after-hours trading. (connor.hart@wsj.com)</p><p class=\"\">1712 GMT - Apple should be able to manage a 10% tariff hike on China imports, BofA Securities analysts say in a research note. The company has the option to raise prices, but it may choose not to do so at this time, given the small impact of the tariffs, the analysts say. However, if Apple raises prices by a slight amount such as 3% in the U.S. in response to the tariffs, the earnings impact could be offset, even though it may sell fewer units in the U.S. Overall, BofA Securities expects a 5% decline in units sold. Apple shares fall 4%. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">1535 GMT - Telus is the best pick among Canadian telecoms for foreign investors thanks largely to currency dynamics, TD Cowen's Vince Valentini says. In a report, he says that given the current USD-CAD rate of 1.47, investors can buy a Telus share with an equivalent USD annual dividend of about US$1.10. If dividend growth slows, to 4% from 7%, a dividend of C$1.61 becomes C$1.74 in two years and \"if the CAD recovers to 1.35 over time, still well above the 20-year average of about 1.2, then annual income rises to US$1.29, for a prospective yield of 9.2%.\" Valentini thinks that Telus shares will also rise in value over time, and eventually also increase its dividend as well. He figures USD buyers would see appreciation of 26% over two years.(adriano.marchese@wsj.com)</p><p class=\"\">0937 GMT - Futures linked to the tech-heavy Nasdaq-100 are down on Monday after President Donald Trump levied 25% tariffs on goods from Mexico and Canada, plus an extra 10% tariff on imports from China. The E-mini Nasdaq 100 futures contract is down 1.8% as investors digest what implications the tariffs might have on the tech sector. Nvidia shares are down 3.2% premarket, touching a low of $115. Apple shares are down 2%, while Microsoft is shedding 1.7% premarket. (mauro.orru@wsj.com)</p><p class=\"\">0924 GMT - Shares in semiconductor stocks in Asia and Europe are down after President Trump levied tariffs on goods from Mexico and Canada, plus an extra 10% tariff on imports from China. In Asia, shares in Taiwan Semiconductor Manufacturing Co. closed 5.7% lower, while chip-making equipment supplier Tokyo Electron closed down 1.7%. South Korean memory-chip maker SK Hynix--which supplies Nvidia--shed 4.2%. In Europe, shares in Dutch supplier of semiconductor-making equipment ASML Holding are down 2.9%, with smaller rival ASM International losing 2.5%. German chip maker Infineon Technologies is down 3.4%, while rival STMicroelectronics trades 4.3% lower in Paris. (mauro.orru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002478:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002473:0",
            "title": "Health Care Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Health Care sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0811 GMT - Novartis is set to overcome a wave of patent expirations during 2025, Deutsche Bank analyst Emmanuel Papadakis says in a note. The Swiss pharma giant surprised with its margin performance in the last quarter and its 2025 outlook that came ahead of analysts expectations, he says. While some of the 4Q revenue beat was attributed to rebates, Novartis appears well-positioned to continue exceeding market expectations, the analyst says. Deutsche Bank lifts back the stock rating to buy from hold, which had been previously nudge down due to patent expiry worries. (helena.smolak@wsj.com)</p><p class=\"\">2337 GMT - Breathing device maker Fisher &amp; Paykel Healthcare's shares rise 2.5% to claw back some of Monday's steep fall, helped by President Trump agreeing to a monthlong delay to a levy on imports from Mexico. In a note, analyst Matt Montgomerie thinks the tariff threat shouldn't have a material impact on F&amp;P Healthcare's valuation at this stage because the tariffs may ultimately be reversed or revised. Also, F&amp;P Healthcare can shift production back to New Zealand and use Mexico as a hub for other markets. \"The latter would take time to implement, but over the long term there shouldn't be a material change in F&amp;P Healthcare's gross margin outlook,\" Forsyth Barr says. \"This is confirmed by F&amp;P Healthcare still expecting to reach its 65% target, albeit two to three years later than its original FY 2027/FY 2028 expectations.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2155 GMT - Fisher &amp; Paykel Healthcare could manufacture more in New Zealand over time as it adjusts to U.S. tariffs on Mexico where it has factories, but such an approach is constrained by staff availability, Jefferies says. F&amp;P Healthcare makes around 45% of its products in Mexico, which President Trump hit with a 25% tariff. \"During the pandemic, F&amp;P Healthcare ran its New Zealand facilities 24/7 but shift patterns are currently 16/5 implying considerable ability to increase capacity,\" analyst Vanessa Thomson says. On staff, F&amp;P Healthcare could benefit from higher unemployment in New Zealand. But this would be partly offset by lower net migration, Jefferies says. \"F&amp;P Healthcare would also need new regulatory approval to sell products manufactured in different facilities which may take some months, especially if there is an increase in applications for approval,\" Jefferies adds. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1319 GMT - Baxter International has a little more than two weeks to figure out what to relay to investors about the extent to which tariffs will affect its business. The medical-products maker will have a conference call Feb. 20 to discuss its 4Q results. Its guidance for 2025 will garner more attention in the wake of broad tariffs that President Trump has levied against Mexico, Canada and China set to go into effect Tuesday. Baxter on Monday noted its 2025 adjusted operating margin view of 16.5% doesn't include any impact from such tariffs. The company added it's working to quantify the expected impact of such tariffs, as well as identify potential mitigation opportunities, and will provide an update on its 4Q call. Shares edge down 2.3% to $31.81 in premarket trading. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1124 GMT - WELL Health Technologies says it can avoid the brunt of U.S. tariffs on Canada thanks to how it's positioned its tech platform. The Canadian digital healthcare company, which has a sizeable U.S. presence that generates 60% of its revenue in U.S. dollars, says there are \"no material tariff threats to its business today as it does not engage in cross-border sales between Canada and the U.S.\" The company adds that it has \"no exposure to U.S. tariffs against Canadian goods and any potential future tariffs imposed on services.\" (adriano.marchese@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002473:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002479:0",
            "title": "Financial Services Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Financial Services. Exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0914 GMT - BNP Paribas reported strong underlying trends for the fourth quarter and consensus expectations could rise, RBC Capital Markets analyst Anke Reingen says in a research note. The French bank's quarterly result as well as it CET1 ratio exceeded expectations, the analyst says. The bank's new 2024-2026 net income growth rate target suggests at least a 4% consensus upgrade, Reingen says. The slight fall in the bank's 2025 return on tangible equity to 11.5% from a range of 11.5% to 12% previously, given consensus expectations at 10.4%, should offer relief to investors fearing a steeper downgrade. BNP Paribas' targeted revenue growth of at least 5% per year for 2025-2026 is also higher than investors had expected. BNP shares trade 2.5% higher to 65.94 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0910 GMT - BNP Paribas's fourth-quarter profit exceeded market views thanks in part to its corporate and institutional banking business, Barclays analyst Flora Bocahut says in a research note. The company's commercial, personal banking and services division also drove the 4% consensus beat, the analyst says. BNP Paribas's investment and protection services unit disappointed but the business should benefit later this year from external growth, the analyst says. Meanwhile, the bank's targets for 2026 are slightly ahead of consensus, the analyst says. BNP Paribas shares trade 2.7% higher at 66.09 euros. (pierre.bertrand@wsj.com)</p><p class=\"\">0824 GMT - Singapore banks' 4Q 2024 earnings are likely to be resilient, says Yeap Jun Rong, IG's market strategist in a note. The bulk of the banks' earnings, which remain supported by net interest income, is expected to stay resilient amid the high-for-longer interest rate environment, he writes. The banks' 4Q loan momentum may also see some pick-up, with data suggesting that overall loans have risen in December from November, he says. Higher confidence around the economy with Singapore's low unemployment rate could have partly contributed to an improvement in lending conditions, Yeap adds. (amanda.lee@wsj.com)</p><p class=\"\">0746 GMT - UBS Group's fourth-quarter results beat expectations and are likely to trigger a small positive share-price reaction, Morgan Stanley's Giulia Aurora Miotto says in a research note. The better-than-expected results will come as a relief after some investors saw negative implications from smaller peer Julius Baer's update Monday, the analyst says. UBS beat expectations mainly thanks to costs, but its top line was also a touch better than anticipated, Morgan Stanley says. By division, the Swiss group's investment bank delivered the largest outperformance relative to expectations, the analyst says. Its global wealth management unit experienced mixed trends, its asset management exceeded expectations thanks to costs, and its personal and corporate banking was weaker than anticipated, Morgan Stanley says. (adria.calatayud@wsj.com)</p><p class=\"\">0727 GMT - UBS Group's fourth-quarter results were better than expected and benefited from good cost management, Vontobel's Andreas Venditti says in a research note. The Swiss banking group posted an underlying pretax profit of $1.77 billion for the fourth quarter, or 24% ahead of consensus forecasts thanks to lower expenses than expected, the analysts say. Its dividend was also higher than anticipated and came alongside plans to buy back up to $3 billion in shares this year, in line with expectations, Vontobel says. UBS remains on track to substantially complete the integration of Credit Suisse by the end of next year, even if expenses are now expected to be slightly higher than previously targeted, the analyst says. (adria.calatayud@wsj.com)</p><p class=\"\">0723 GMT - UBS Group's plans to step up share buybacks and a better-than-expected net profit mean its 4Q results look positive on several fronts, RBC Capital Markets' Anke Reingen and Matthew Russell say in a research note. The higher-than-expected net profit was mainly thanks to the Swiss group's investment bank, where revenue was well ahead of consensus expectations, RBC says. Costs came in higher than expected in some divisions, but this could be due to seasonal factors, the analysts say. UBS provided more detailed targets for the turnaround of its U.S. global-wealth-management unit, which is positive, RBC says. On the integration of Credit Suisse, it reiterated its end-2026 savings target but raised its expectations for expenses, RBC says. (adria.calatayud@wsj.com)</p><p class=\"\">0507 GMT - Kasikornbank stands to gain from likely higher fee income and lower cost-to-income ratio, CGS International's Weerapat Wonk-Urai says in a research report, as the brokerage maintains the stock's add rating. The bank recently unveiled 2025 targets such as achieving net fee income growth of mid-to-high single digit versus 6.7% growth in 2024 and attaining cost-to-income ratio at low-to-mid 40s versus 44.1% ratio in 2024. Also, the Thailand bank will focus on growing retail loans that are primarily housing and credit-card loans in the high-income segment, the analyst notes. However, the brokerage trims the stock's target price to THB187.00 from THB188.00 to reflect a lower 2025 book-value forecast. (ronnie.harui@wsj.com)</p><p class=\"\">0448 GMT - LIC Housing Finance is likely to continue delivering healthy asset quality, Nomura analysts say in a research report. Its gross and net non-performing assets dropped by 152 bps and 32 bps, respectively, in 3Q FY 2025, and it posted a credit cost of negative 0.1% driven by provision write-backs, the analysts note. Thanks to further resolutions of such assets, the Indian housing finance company's credit costs are expected to remain contained at around 35 bps over FY 2026-2027, the analysts estimate. Nomura raises the stock's target price to INR 735.00 from INR 700.00, maintaining an unchanged buy rating. Shares are 2.3% higher at INR 570.70. (ronnie.harui@wsj.com)</p><p class=\"\">0114 GMT - AMMB Holdings' canceling the sale of its life insurance unit to Great Eastern comes as no surprise, given the prolonged delay, Maybank IB analyst Desmond Ch'ng says in a note. He notes that there has been no progress on the deal since it was first proposed in October 2023. The impact on AMMB's capital is minimal, with its Common Equity Tier 1 ratio at a solid 15.3%, he reckons. While a sale may still be considered, there is no urgency, he adds. Ch'ng expects AMMB to see 11.7% earnings growth in FY 2025, supported by better net interest margins and lower credit costs. Maybank maintains a buy rating on AMMB and keeps the target price at MYR6.30. Shares are 0.2% higher at MYR5.65. (yingxian.wong@wsj.com)</p><p class=\"\">1841 GMT - Front-month gold finished up 0.8% to $2,833.90 a troy ounce, setting a new record-high as tariffs dominate the conversation in U.S. markets. The uncertainty that surrounds tariff plans appears to be driving investors toward gold as a safe-haven asset, with traders speculating that physical metal prices have room to travel higher. \"With supply chain constraints mounting, both gold and silver prices are on the rise, and physical metal premiums could soon follow,\" says Alex Ebkarian of Allegiance Gold. Ebkarian adds that investments and countries are both showing signs of accumulating gold reserves. SPDR Gold is up 0.6%. (kirk.maltais@wsj.com)</p><p class=\"\">1712 GMT - Apple should be able to manage a 10% tariff hike on China imports, BofA Securities analysts say in a research note. The company has the option to raise prices, but it may choose not to do so at this time, given the small impact of the tariffs, the analysts say. However, if Apple raises prices by a slight amount such as 3% in the U.S. in response to the tariffs, the earnings impact could be offset, even though it may sell fewer units in the U.S. Overall, BofA Securities expects a 5% decline in units sold. Apple shares fall 4%. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">1632 GMT - U.S. fixed income exchange traded funds (ETFs) added $6.9 billion in the week that ended on January 31, a 21% increase from the previous week, CreditSights analysts say in a note. Muni ETFs recorded $348 million of inflows last week. This brought the total inflows for January to $2.1 billion, \"more than double December's total of $932 million,\" the analysts say. High-yield credit ETFs added $496 million, significantly higher than the previous week when they added $26 million, they say. U.S. Treasury ETFs, however, recorded a small net outflow in the past week, the first time in six weeks, CreditSights says. (miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002479:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002474:0",
            "title": "Energy & Utilities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy and Utilities. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0821 GMT - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">2352 GMT - The more than 8% drop in Origin Energy's share price that followed a downgrade to annual production guidance for the Australia Pacific LNG project was overdone, contends UBS. The stock reaction ignores several tailwinds that could trigger upgrades to consensus earnings expectations for FY 2026, analyst Tom Allen says. They include a 15%-20% decline in current coal prices, UBS says, noting 45% of Origin's coal costs are unhedged. Origin also wants to expand a battery at the Eraring power station in Australia to become one of the largest battery storage systems in the world. \"We do not believe these incremental earnings (A$100 million per annum from 2H FY 2026) are factored into consensus estimates,\" UBS says. It keeps a buy call on Origin's stock. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1453 GMT - Natural gas futures rally amid colder weather forecasts and as energy markets are roiled by Trump tariffs. Prices are supported by long-term forecasts turning colder than expected, which could add to the record withdrawal from U.S. storage seen the last three weeks, BOK's Dennis Kissler writes. \"Also fears that Canadian Nat Gas supplied to the US may lessen in some areas.\" Kissler adds that over 9% of natural gas used in the U.S. comes from Canada. The March contract is up 9.5%, at $3.334. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1354 GMT - Tariffs on Canadian oil could make the price of refined products, including gasoline, more expensive in some parts of the U.S., Bannockburn's Marc Chandler says. EIA data shows Canada as the main source of imported crude to the U.S., with nearly 4 million barrels a day as of November. Mexico was a far second with 453,000 barrels/day. Chandler says U.S. refineries, particularly in the South, use Canada's heavy crude, instead of the lighter U.S. product, to make things like gasoline, diesel and jet fuel. Although the 10% tariff on crude looks small next to the 25% levy slapped on other imports, \"this is a big deal,\" Chandler says. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1323 GMT - Canadian utility stocks offer a defensive option for investors seeking ballast for investment portfolios given the uncertain economic times ahead for the country, RBC Capital Markets suggests. It notes the sector's balance sheet health has improved in recent years and valuations are largely in line with the historical average so have room to improve amid concerns over a possible economic downturn. They also point to a relatively sound regulatory frameworks that allows for the passthrough of \"prudently-incurred\" costs, and a yield on most utility stocks of around 4%-5% with targets to grow dividends annually. (robb.stewart@wsj.com; @Robb.Stewart)</p><p class=\"\">1314 GMT - The lower tariffs the White House is imposing on imports of Canadian energy will still raise costs for gasoline, aviation fuel and other energy sources used by Americans and significantly hurt Canada's economy, says Kendall Dilling, president of Pathways Alliance, a group of Canada's largest oil sands producers. Dilling says the levy reinforces the importance of diversifying Canada's energy markets with additional pipeline capacity. \"Our country's inability to build pipelines to new markets has left us vulnerable to these threats,\" Dilling says, adding that the federal government has deterred investment. (robb.stewart@wsj.com; @Robb.Stewart)</p><p class=\"\">1308 GMT - An initial increase in WTI oil prices following Trump tariffs could stop at $76 dollar a barrel, Ritterbusch estimates. Sustainable gains \"are apt to be limited by expected weakening in global economies, including the US,\" the advisory firm says. It adds that \"an associated strengthening in the US dollar and the likelihood that tariffs could prove brief should the US stock market head further south from here,\" could also curb oil price increases. Ritterbusch expects volatility. \"About 2-3 weeks might be a reasonable time frame to assess the effects on key consumer items such as retail petroleum product pricing.\" In early trade, WTI rises nearly 3% to $74.44 a barrel. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1300 GMT - Canada's upstream oil and gas industry was spared the worst of President Trump's tariffs but still will see a 10% levy applied to exports to the U.S. Lisa Baiton, president of the Canadian Association of Petroleum Producers, says that given the complexity of North American and global oil and natural gas markets, it is difficult to predict how the application of a 10% percent tariff on Canadian oil and gas will impact supply, demand and trade patterns. Still, she says nobody will win and costs and inflation will rise for American consumers while damage is done to both countries. Canadian producers will find ways to mitigate the impact of tariffs and realign themselves, she adds. (robb.stewart@wsj.com; @Robb.Stewart)</p><p class=\"\">1208 GMT - Canada and Mexico may need to redirect crude oil to domestic refining, distant markets or cut output to deal with President Trump's tariffs, Rystad Energy posits. Rystad's Mukesh Sahdev notes Canada's Trans Mountain pipeline offers 190,000 bpd of spot-market capacity that likely will be used to reduce deliveries to the U.S. But beyond that Western Canada is landlocked. In a worst-case scenario he says the Canadian crude oil price differential to the WTI benchmark could fall as much as $15 a barrel if producers can't transfer any of the tariff impact to customers. He adds neither Canada or Mexico have much spare refinery capacity to absorb the restricted crude flows, so if the tariffs are prolonged it could mean production losses in both countries. (robb.stewart@wsj.com; @Robb.Stewart)</p><p class=\"\">1034 GMT - Galp Energia's fourth-quarter update was mostly in line with expectations, RBC Capital Markets analysts write in a research note. The Portuguese oil-and-gas producer's production volumes and refining margins came in broadly in line with market views, they add. Like its peers, Galp warned of year-end write-offs across its business worth around 140 million euros that could weigh on its results, they add. However, investors are expected to overlook the write-offs given they are noncash and nonrecurring, they say. Shares trade down 0.7% to 16.10 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0925 GMT - Canadian oil producers are expected to face the largest hit from U.S. President Trump's 10% tariff on energy products, according to Goldman Sachs. Canada exports 4 million barrels a day of crude oil to the U.S.--about a quarter of U.S. refinery inputs--with most of it going to the Midwest. But limited spare pipeline capacity from Alberta, Canada's main oil-producing region, to the West Coast means the country has very few alternatives for export beyond the U.S. \"We expect Canadian oil producers to eventually bear most of the burden of the tariff with a $3-$4/bbl wider-than-normal discount on Canadian crude given limited alternative export markets, with U.S. consumers of refined products bearing the remaining $2-$3/bbl burden,\" analysts at the U.S. bank say. (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002474:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002477:0",
            "title": "Basic Materials Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Basic Materials. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0859 GMT - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0344 GMT - LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p><p class=\"\">0313 GMT - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p><p class=\"\">0023 GMT - Drivers of Westgold's downgrade to FY 2025 production guidance are likely to spill into the following year as well, reckons Macquarie. Westgold expects to produce 330,000-350,000 oz of gold in FY 2025, down from a prior projection of 400,000-420,000 oz. It expects to dig up gold at a higher cost, forecasting all-in sustaining costs, or AISC, of A$2,400-A$2,600/oz. \"We also assume the slower ramp-up of Bluebird and Beta Hunt, and softer grades at Big Bell, carry over into FY 2026 and cut production 10% while AISC lifts 4%,\" says Macquarie, referring to Westgold's mines. Still, Macquarie's revised outlook equates to a 32% year-over-year increase in production in FY 2026. It retains an outperform call on Westgold's stock. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">2258 GMT - The proposed 25% tariff on Canadian shipments to the U.S. could cost Rayonier Advanced Materials up to $3.5 million per month while in place, the company said. \"Even with these potential tariffs at currently announced levels, the company expects to cover all fixed charges, including maintenance capital and interest expenses,\" it said. Last year, about 11% of the company's total revenues were generated from Canadian Paperboard exports to the U.S., it added. The company also said it sees 2025 Cellulose Specialties average sales prices increasing mid-single-digit percentage from 2024 levels. (stephen.nakrosis@wsj.com)</p><p class=\"\">2201 GMT - Aeris Resources held less cash at the end of 2Q than expected by Ord Minnett, which retains a hold call on the stock as it balances long-term value with a stretched balance sheet. Aeris reported A$26 million in cash at end-December, some A$4 million less than projected by Ord Minnett and despite a lower capital spend. Aeris experienced operational challenges at its Tritton copper mine, with output some 27% below Ord Minnett's forecast and costs around 27% higher. \"The Tritton issues appear to have been somewhat rectified as FY 2025 guidance is unchanged with improved grades/tons set to come from Bugderygar, Avoca Tank and Murrawombie,\" says Ord Minnett, referring to other Aeris-owned pits. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">11:35--U.S. tariffs increase the need to find new ways to diversify a portfolio, as they make bonds more volatile, Harbor Capital's Jake Schurmeier says. \"If you're worried about higher and more volatile inflation, you are not going to get that traditional ballast from a fixed income portfolio against your basket of riskier securities,\" Schurmeier says. He looks at gold as a diversifier. \"You get that stored value and you get kind of a different set of return streams that can do well, even if both equities and treasuries are underperforming.\" He says Trump tariffs add to inflation uncertainty markets have been dealing with since the pandemic. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">1512 GMT - Canada's steel producers warn of significant disruption and economic hardship in Canada and the U.S. after the President Trump launched a 25 tariff on imports of steel and other goods from Canada. Catherine Cobden, president of the Canadian Steel Producers Association, says the steel industry is highly integrated across the U.S.-Canada border. With C$20 billion in annual steel trade between the countries, tariffs will hurt businesses and workers, she says. The United Steelworkers Union also says the tariffs will be devastating for workers. \"This is not about fair trade; it's about political posturing at the expense of good-paying jobs,\" USW Canadian Director Marty Warren says. (robb.stewart@wsj.com; @Robb.Stewart)</p><p class=\"\">1254 GMT - Cleveland-Cliffs Chairman and CEO Lourenco Goncalves applauds the White House's tariff strike against Canada, Mexico and China. Goncalves says President Trump's agenda, including tariffs announced over the weekend, will have an outsized benefit on the steel producer. He also anticipates benefits for Stelco, the Canadian steel company Cliffs bought last year. \"Country-specific tariffs on adversaries as well as allies are a great first step, and we look forward to continuing to work with the Trump administration on further tariff action to come on steel specifically, against our adversaries and allies who have taken advantage of our market,\" he says. (robb.stewart@wsj.com)</p><p class=\"\">1025 GMT - London-listed miners trade down as investors assess the risk of a global trade war following new tariffs imposed by U.S. President Trump. China-exposed mining stocks are among the FTSE 100 index's biggest fallers, Interactive Investor's Richard Hunter writes. Copper miner Antofogasta is the largest faller, trading down 3.8% at 1659.00 pence followed by diversified miner Glencore, which falls nearly 3% to 340.20 pence. Anglo American falls 2.8% to 2314.50 pence while Rio Tinto's London shares are down 1.9% to 4,798.50 pence. Fresnillo trades down 0.9% at 690.00 pence.(adam.whittaker@wsj.com)</p><p class=\"\">1014 GMT - Palm oil ended higher, supported by a weaker Malaysian ringgit and soybean oil's gains on the Chicago board of Trade on Friday, Kenanga Futures says in a research note. A cheaper Malaysian ringgit makes the vegetable oil more appealing to foreign buyers. However, the upside may be limited due to global policy uncertainties after President Trump's fresh tariffs on Canada, Mexico and China, it adds. Meanwhile, the reduced purchasing activity from India, Pakistan and the Middle East, who have already made recent substantial purchases, may limit gains in palm oil, it adds. The Bursa Malaysia Derivatives contract for April delivery ended 84 ringgit higher at 4,373 ringgit a ton. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002477:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002476:0",
            "title": "Auto & Transport Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering the Auto and Transport sector. Published exclusively on Dow Jones Newswires at 4:20 ET, 12:20 ET and 16:50 ET.</p><p class=\"\">0233 GMT - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p><p class=\"\">1806 GMT - BRP, the maker of Ski-Doos and Sea-Doos, says it's working on measures to mitigate the effects of tariffs on its business. The company, which has three manufacturing plants in Mexico as well as its operations in Canada, says in a statement that 25% tariffs will apply to BRP's vehicles, parts, accessories and apparel produced in Canada, and shipped to the U.S. as of Feb. 4. The company says that it has been working on different scenarios and has already implemented \"some mitigation measures such as optimizing our shipping plans for exports to our U.S. dealers and building up inventory in our U.S. yards and distribution centers.\" BRP sinks 9% to C$63.25. (adriano.marchese@wsj.com)</p><p class=\"\">1729 GMT - Auto-technology supplier investors are taking a 'sell now, ask questions later' approach to new tariffs against Mexico, Canada and China, Baird analysts Luke Junk and Benjamin Schmid say in a research note covering companies including Amphenol and Mobileye Global. The market is wondering whether the tariffs are merely a negotiating tactic or could prove to be more durable in the near-term, the analysts say. The tariffs will need to be passed on to consumers to avoid broad supply chain disruptions, they say, drawing a parallel to similar dustups around the chip shortages and inflation of 2021 and 2022. (dean.seal@wsj.com)</p><p class=\"\">1625 GMT - European automakers are expected to see a significant impact from a full year of tariffs on 2025 earnings estimates, Bernstein analysts say in a research note. The worst-case scenario remains largely unchanged, aside from the withdrawal of terms that allowed manufacturers to offset exports from the U.S. against imports into the U.S., the analysts say. Stellantis is the worst affected with a 2.8% margin impact under the announced policies. However, Mercedes has a parts manufacturing plant in Mexico, while BMW imports all of its engines from outside of North America, Bernstein says. The analysts remain skeptical that the new tariffs will be long-lasting given their wide-ranging inflationary impacts and the retaliatory actions promised by Canada and Mexico, they say. (nina.kienle@wsj.com)</p><p class=\"\">1452 GMT - Rheinmetall's deep roots in Germany, which represents 25% of its sales, give the German defense company an edge at a time when Berlin is raising military spending, but it also leaves the group dangerously exposed to political turbulence, says Alpha Value's analyst Saima Hussain. Germany is going to the polls on Feb. 23, with military budgets expected to swell if the conservative party the Christian Democratic Union wins, she says. But should the German market unfold in a less favorable way, Rheinmetall can fall back on its internationalization strategy, she adds. This accelerated with acquisitions in Spain and the U.S., and a new joint venture with Leonardo to position Italy as its next major hub for growth. Hussein expects Rheinmetall's momentum to continue, and a ceasefire in Ukraine to offer a good entry point for future investors. Shares are up 0.7% at 761 euros. (cristina.gallardo@wsj.com)</p><p class=\"\">1337 GMT - Canada's industrial sector will likely take the brunt of the U.S. trade tariffs, TD Cowen's Brian Morrison says. In a report, the analyst notes that in particular, Canada' auto suppliers such as Magna International, Linamar and Martinrea will be dragged through the coals, \"due to a large proportion of its manufacturing in Canada/Mexico with the U.S. being the end-market for consumption.\" BRP is also a name he thinks will suffer due to its powersports segment. While the financial impact will be difficult to assess, Morrison says \"tariff exposure for each company is material... and will likely magnify production curtailment near-term that is taking hold to balance inventory at auto/powersports dealers.\" (adriano.marchese@wsj.com)</p><p class=\"\">1253 GMT - Mercedes-Benz objects the imposition of tariffs. The German luxury automaker joins European peers in voicing its opposition to tariffs imposed by the Trump administration. The announcement has triggered a global stock market selloff that has auto stocks among the biggest fallers. \"If a general trend toward protectionism gains a foothold, this has negative economic consequences for all stakeholders involved; this cannot be in the interests of politics, business and society,\" the company says in a statement. \"Mercedes-Benz therefore supports a liberal trade order based on World Trade Organization rules, which include the principle that all participants find the same conditions,\" the company says. Shares fall 4.4% to 56.32 euros. (maitane.sardon@wsj.com)</p><p class=\"\">1221 GMT - Europe's biggest carmaker is confident that talks will avoid a trade war. \"We are counting on constructive talks between the trading partners to ensure planning security and economic stability and to avoid a trade conflict,\" the German company says in a statement. This follows the Trump administration's move to levy U.S. tariffs on goods from Mexico, Canada and China. The announcement triggered a global stock market sell-off, with auto stocks among the biggest fallers. Volkswagen says open markets and stable trade relations are essential for the automotive industry. \"We are assessing any potential effects on the automotive industry and our company as a result of the announced tariffs,\" the company adds. Shares fall 6.3% to 92.44 euros. (maitane.sardon@wsj.com)</p><p class=\"\">1133 GMT - Volvo relies on its strong U.S. value chain to withstand the impact from tariffs, as opposed to other sector peers, the company says. This follows President Trump's decision to place tariffs on hundreds of billions of dollars in imports from Canada, Mexico and China. \"As the only truck manufacturer that produces 100% of our trucks for the U.S. in the U.S., we are perhaps more resilient in the relative game for our industry when it comes to tariffs,\" a company spokesperson says. \"We have built up and invested in a strong U.S. value chain, and continue to do so,\" the spokesperson adds. Volvo is following the developments closely as how the announcement plays out in terms of impact and duration remains to be seen, the company says. Shares are down 1.3% at 302.60 Swedish kronor. (maitane.sardon@wsj.com)</p><p class=\"\">1057 GMT - BMW opposes the imposition of tariffs as these go against the company's guiding principles, the car maker says. This follows Trump's decision to place tariffs on hundreds of billions of dollars in imports from Canada, Mexico and China. \"Free trade, which has always been a guiding principle for the BMW Group, is of immense importance worldwide: it is one of the most crucial drivers of growth and progress,\" a company spokesperson says. \"Tariffs, on the other hand, hinder free trade, slow down innovation, and set a negative spiral in motion; in the end, they are detrimental to customers, making products more expensive and less innovative,\" the spokesperson adds. Shares fall 4.1% to 75.36 euros. (maitane.sardon@wsj.com)</p><p class=\"\">1042 GMT - Porsche AG's possible management changes aren't entirely surprising, but they could add uncertainty in the short term, Stifel's Daniel Schwarz says in a research note. \"Since the IPO in October 2022, Porsche's share price has declined by 25%, the EV strategy needs adjustments, China has become a major problem and the company has issued profit warnings. Management changes therefore do not come as a surprise,\" the analyst says. The German sports-car maker said it is in talks with CFO Lutz Meschke and sales head Detlev von Platen about an early termination of their contracts. The company is due to provide an update on its cost-cutting and product strategy in March, the analyst says. Shares fall 5% amid sharp declines in auto stocks on news of U.S. tariffs on Mexico, Canada and China. (adria.calatayud@wsj.com)</p><p class=\"\">1039 GMT - Kuehne + Nagel and SGS might be potential beneficiaries of new U.S tariffs triggering supply-chain shifts in the mid term, Vontobel analyst Jean-Philippe Bertschy says in a research note. These supply-chain shifts could be triggered by the increased tariffs through pricing effects, where Holcim--among others--could also expect benefits, Bertschy says. The final outcome of this trade war is highly unpredictable with many uncertainties, such as whether the tariffs will be applied to value-added or to the total value of the product, the analyst says. Swiss companies will have to pass on the additional costs to their customers, he says. Pricing power and a strong value proposition will be crucial, Bertschy adds. SGS shares trade 2.1% lower at 86.64 Swiss francs. Kuehne + Nagel shares trade 4% lower at 199.40 Swiss francs. (nina.kienle@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002476:0/",
            "pub_date": "2025-02-04 17:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463351:0",
            "title": "ACEN to Buy Preferred Shares of Belenos Energy Worth PHP392 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ACEN  signed a subscription contract with Belenos Energy to buy 392 million redeemable preferred shares for 392 million Philippine pesos. </p><p class=\"\">The shares will be purchased at a par value of 1 peso each, according to a Tuesday Philippine bourse filing. </p><p class=\"\">The shares will be issued from Belenos' planned capital stock increase, it added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463351:0/",
            "pub_date": "2025-02-04 17:20:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463364:0",
            "title": "Venture Life Chair to Step Down, Successor Named",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Venture Life Group  Nonexecutive Chair Paul McGreevy will step down from the board in late April, according to a Tuesday filing. </p><p class=\"\">McGreevy decided to leave his position due to a potential conflict of interest between the self-care products company's recent expansion and his role as the current chief executive officer of Revive Active Ltd. </p><p class=\"\">Venture Life named Nonexecutive Director Mark Adams as its new board chair, effective at the time of McGreevy's resignation.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463364:0/",
            "pub_date": "2025-02-04 17:13:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002423_20250204002423:0",
            "title": "Shell Restarts Production at the Penguins Field in the UK North Sea",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002423_20250204002423:0/",
            "pub_date": "2025-02-04 17:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002426:0",
            "title": "BNP Paribas Growth Targets Could Lead to Consensus Upgrades — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BNP Paribas reported strong underlying trends for the fourth quarter and consensus expectations could rise, RBC Capital Markets analyst Anke Reingen says in a research note. The French bank's quarterly result as well as it CET1 ratio exceeded expectations, the analyst says. The bank's new 2024-2026 net income growth rate target suggests at least a 4% consensus upgrade, Reingen says. The slight fall in the bank's 2025 return on tangible equity to 11.5% from a range of 11.5% to 12% previously, given consensus expectations at 10.4%, should offer relief to investors fearing a steeper downgrade. BNP Paribas' targeted revenue growth of at least 5% per year for 2025-2026 is also higher than investors had expected. BNP shares trade 2.5% higher to 65.94 euros. (pierre.bertrand@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002426:0/",
            "pub_date": "2025-02-04 17:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0PB:0",
            "title": "Indonesia says France's Eramet exploring new mining areas in South Sulawesi, Papua",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's investment minister said on Tuesday French miner Eramet  is exploring new mining areas in the South Sulawesi and Papua regions.</p><p class=\"\">Rosan Roeslani on his Instagram account said he met with Eramet's Group CEO, Christel Bories, on Monday and he was updated on Eramet's investment plans.</p><p class=\"\">\"Eramet outlined its investment plans, including exploration of new areas in South Sulawesi and Papua as well as the development of the Responsible Green Electric Vehicle project involving various strategic partners,\" Rosan said.</p><p class=\"\">Eramet could not immediately be reached for comment.</p><p class=\"\">Eramet's main operation in Indonesia is its Weda Bay Nickel mine, located in Halmahera, North Maluku. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0PB:0-indonesia-says-france-s-eramet-exploring-new-mining-areas-in-south-sulawesi-papua/",
            "pub_date": "2025-02-04 17:14:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}