{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308899:0",
            "title": "Air Products Names Eduardo Menezes as CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Air Products  said Tuesday its board named Eduardo Menezes as chief executive, effective Friday. </p><p class=\"\">Menezes succeeds Seifollah Ghasemi, who is leaving the company, Air Products said, adding Menezes will also join the company's board. </p><p class=\"\">Menezes was previously the executive vice president of Linde for Europe, Middle East and Africa, Air Products said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308899:0/",
            "pub_date": "2025-02-04 22:22:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007229:0",
            "title": "RBB Bancorp Price Target Maintained With a $25.00/Share by Stephens & Co.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007229:0/",
            "pub_date": "2025-02-04 22:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006743:0",
            "title": "Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Denny Jacob</p><p class=\"\">Okta will cut its workforce by about 3%, or 180 employees, as part of a restructuring plan moving resources towards priorities that will drive growth.</p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026, according to a securities filing. The company said it also expects to record an insignificant adjustment to its stock-based compensation expense in the first quarter related to equity compensation for employees who were terminated.</p><p class=\"\">The San Francisco company had 5,908 employees, two-thirds of which were in the U.S., as of Jan. 31.</p><p class=\"\">Okta reaffirmed its guidance for the fourth quarter ended Jan. 31. The company in December forecast adjusted per-share earnings of 73 cents to 74 cents with revenue of $667 million to $669 million.</p><p class=\"\">Write to Denny Jacob at denny.jacob@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006743:0/",
            "pub_date": "2025-02-04 22:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV19I:0",
            "title": "Shares of Calvin Klein-parent PVH and Illumina fall after China targets companies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Shares of Calvin Klein-owner PVH Corp  and genetic testing company Illumina  fell in U.S. premarket trading on Tuesday after China placed the two companies on its \"unreliable entity\" list, making them eligible for sanctions.</p><p class=\"\">Companies added to the blacklist can be subject to fines and a broad range of other sanctions, including a freeze on trade and revocation of work permits for foreign staff.</p><p class=\"\">PVH had already been under scrutiny from Chinese regulators over \"improper\" conduct related to the Xinjiang region. </p><p class=\"\">For Illumina, China accounts for about 7% of sales. Two of its Chinese rivals, MGI and BGI, were listed in a U.S. bill that aims to restrict business with several biotech companies on grounds of national security.</p><p class=\"\">Shares of Intel  also fell 1% to $19.20 in premarket trading after the Financial Times reported that Chinese regulators were also looking to launch a formal probe into the chipmaker. </p><p class=\"\">An influential Chinese industry group called for a security review late last year against Intel's  products sold in China. </p><p class=\"\">The announcement was part of a string of measures by China in response to new U.S. tariffs on Chinese goods. China also said it was investigating Alphabet . </p><p class=\"\">However, Alphabet's shares edged up nearly 1%, as some of its key products, including its Google search engine, are already blocked in China and its revenue from the country represents only about 1% of its global sales. </p><p class=\"\">Illumina's shares were down 4.1% at $125.71, while PVH's stock fell 2.4% to $80.49 before the opening bell.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV19I:0-shares-of-calvin-klein-parent-pvh-and-illumina-fall-after-china-targets-companies/",
            "pub_date": "2025-02-04 22:23:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUABZQKW9:0",
            "title": "Agnico Eagle and O3 Mining Announce Subsequent Acquisition Transaction and Completion of Offer",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Agnico Eagle Mines Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">AGNICO EAGLE AND O3 MINING ANNOUNCE SUBSEQUENT ACQUISITION TRANSACTION AND COMPLETION OF OFFER</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUABZQKW9:0-agnico-eagle-and-o3-mining-announce-subsequent-acquisition-transaction-and-completion-of-offer/",
            "pub_date": "2025-02-04 22:23:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308904:0",
            "title": "Sector Update: Energy Stocks Fall Pre-Bell Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy stocks were falling pre-bell Tuesday, with The Energy Select Sector SPDR Fund  down 0.4%. </p><p class=\"\">The United States Oil Fund  was down 2.8% and the United States Natural Gas Fund  was 4.9% lower. </p><p class=\"\">Front-month US West Texas Intermediate crude oil was down 2.6% at $71.24 per barrel at the New York Mercantile Exchange. Global benchmark North Sea Brent crude oil lost 1.7% to reach $74.67 per barrel, and natural gas futures were 5.3% lower at $3.18 per 1 million British Thermal Units. </p><p class=\"\">Marathon Petroleum  shares were up over 1% after the company reported lower Q4 adjusted net income and revenue that still surpassed analyst expectations. </p><p class=\"\">Enterprise Products Partners  stock was down 0.7% after the company posted lower Q4 revenue. </p><p class=\"\">WEC Energy Group  shares were gaining marginally after the company reported higher Q4 earnings and revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308904:0-sector-update-energy-stocks-fall-pre-bell-tuesday/",
            "pub_date": "2025-02-04 22:24:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007263:0",
            "title": "Oil Plunges on Trade War Fears — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crude prices extend losses in midday trade amid heightened fears of a trade war between the U.S. and China that could hurt global growth and increase inflationary pressures. Brent crude is down 2.3% to $74.22 a barrel, while WTI falls 3.3% to $70.75 a barrel. Both benchmarks erased all the previous session's gains, also due to easing concerns over immediate disruption of Canadian and Mexican oil flows after U.S. President Trump agreed to hold off imposing tariffs on the two neighboring countries. \"The next key support levels to watch are $69.50 and $66,\" says Razan Hilal, market analyst at Forex. \"A deeper decline could signal the start of a more extended bearish trend.\" (giulia.petroni@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007263:0/",
            "pub_date": "2025-02-04 22:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNXbHVmJ4:0",
            "title": "Jupiter Neurosciences Addresses Market Volatility as it Remains Focused on Advancing Clinical and Commercial Milestones",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jupiter, Florida, Feb.  04, 2025  (GLOBE NEWSWIRE) — Jupiter Neurosciences, Inc.  (“Jupiter” or the “Company”), a clinical-stage pharmaceutical company developing JOTROL™, a patented resveratrol-based platform, today issued a statement regarding recent market volatility and highlighted its planned Direct-to-Consumer product launch later this year, which is expected to generate near-term revenues while the Company advances its clinical trials.</p><p class=\"\">“The recent volatility in our stock appears to be driven by misconceptions and a lack of understanding about our business and long-term strategy, but I want to reassure our investors that there have been no undisclosed material developments,” said Christer Rosén, Chairman and CEO of Jupiter Neurosciences. “Our recent announcements, including partnerships with Zina Biopharmaceuticals and Catalent Pharma Solutions, are important milestones in advancing JOTROL™ for our planned Phase 2a study in Parkinson’s disease. With these partnerships in place, we are making tangible progress in our clinical development and remain confident in the path ahead.”</p><p class=\"\">Jupiter is advancing a robust clinical pipeline addressing combined market opportunities exceeding $50 billion. The Company is focused on significant unmet needs in CNS disorders, including Alzheimer’s, Parkinson’s, and rare diseases such as MPS-I, Friedreich’s Ataxia, and MELAS. With multiple Phase 2 trials scheduled to launch within the next 12 months—leveraging successful Phase 1 data demonstrating safety—Jupiter is well-positioned for meaningful clinical advancements.</p><p class=\"\">In addition to its clinical pipeline development, Jupiter is poised to generate near-term revenue with the upcoming launch of its direct-to-consumer product line in 2025. This initiative represents a key step in diversifying the Company’s business model, providing immediate cash flow while continuing to advance its pharmaceutical pipeline. Focused on the longevity and aging market, the Company expects to share more details soon about two initial products leveraging the unique bioavailability and therapeutic advantages of JOTROL™, which has demonstrated significantly enhanced bioavailability compared to traditional resveratrol formulations.</p><p class=\"\">Rosén also commented on the Company’s financial strategy: “While we remain open to strategic funding opportunities, we are committed to avoiding toxic debt and ensuring that we maintain a sustainable approach to financing our operations. With $1.76 million in NIH funding secured and an additional $16 million in grants under review, alongside the $11 million raised in our December 2024 IPO, we are well-positioned to advance our clinical and commercial initiatives. Furthermore, our strategic collaborations with Harvard University, Georgetown University, MIT’s Picower Institute for Learning &amp; Memory, and the University of Miami Miller School of Medicine enhance our research and clinical capabilities, while our efforts to build licensing and commercialization partnerships in Asia position us for future global expansion.”</p><p class=\"\">“Despite market fluctuations, our commitment to executing on our strategy remains unchanged,” said Rosén. “We believe in the potential of JOTROL™ and our broader pipeline to address neuroinflammatory diseases and aging-related health solutions. Our team remains focused on driving progress, creating value for our investors, and ultimately delivering transformative treatments for patients.”</p><p class=\"\">As always, Jupiter encourages investors to review its filings with the SEC and corporate announcements for the latest company updates.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Jupiter Neurosciences, Inc.</strong></p><p class=\"\">Jupiter Neurosciences is a clinical-stage pharmaceutical company focused on treating neuroinflammation, with a current focus on CNS disorders and rare diseases. The Company’s platform product, JOTROL™, is an enhanced orally administered resveratrol formulation designed and intended to deliver therapeutically relevant, safe levels of resveratrol. The Company’s pipeline is focused broadly on CNS disorder and includes indications such as Alzheimer’s Disease, Parkinson’s Disease, Mucopolysaccharidoses Type I, Friedreich’s Ataxia, and MELAS. More information may be found on the Company’s website www.jupiterneurosciences.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About JOTROL </strong></p><p class=\"\">Resveratrol is one of the world’s most extensively researched molecules. Thorough evaluation has shown that for the compound to be effective, it requires a high C-Max (~300 ng/ml of resveratrol in plasma), achievable only with doses exceeding 3 grams using earlier resveratrol products. Poor bioavailability has been a well-documented issue with resveratrol. Doses over 2 grams have been associated with severe gastrointestinal (GI) side effects, which have prevented the compound from receiving regulatory approval for any indication.</p><p class=\"\">Jupiter Neurosciences (JUNS) conducted a Phase I study demonstrating that JOTROL achieves over nine times higher bioavailability compared to resveratrol used in earlier clinical trials (e.g., Turner et al., MCI/Early Alzheimer’s Disease trial, and Yui et al., Friedreich’s Ataxia trial). The results of this Phase I study, which will be cross-referenced in all upcoming JOTROL trials, were published in the <em>Journal of Alzheimer’s Disease</em> and <em>AAPS Open</em> in February 2022.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Zina Biopharmaceuticals, LLC</strong></p><p class=\"\">Zina Biopharmaceuticals, co-founded by Professor Charbel Moussa, is a specialized consulting company providing end-to-end trial design and execution solutions as well as regulatory, scientific and medical advice for biotech and pharmaceutical companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">FORWARD-LOOKING STATEMENTS</strong></p><p class=\"\">Certain statements in this announcement are forward-looking statements. These forward-looking statements involve known and unknown risks and uncertainties and are based on the Company’s current expectations, including the use of proceeds from the Offering. Investors can find many (but not all) of these statements by the use of words such as “approximates,” “believes,” “hopes,” “expects,” “anticipates,” “estimates,” “projects,” “intends,” “plans,” “will,” “would,” “should,” “could,” “may” or other similar expressions. Although the Company believes that the expectations expressed in these forward-looking statements are reasonable, it cannot assure you that such expectations will turn out to be correct. The Company cautions investors that actual results may differ materially from the anticipated results and encourages investors to read the risk factors contained in the Company’s final prospectus and other reports it files with the SEC before making any investment decisions regarding the Company’s securities. The Company undertakes no obligation to update or revise publicly any forward-looking statements to reflect subsequent occurring events or circumstances, or changes in its expectations, except as may be required by law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact: </strong>        </p><p class=\"\">Dave Gentry</p><p class=\"\">RedChip Companies, Inc.</p><p class=\"\">1-407-644-4256</p><p class=\"\">1-800-RED-CHIP (733-2447)</p><p class=\"\">JUNS@redchip.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNXbHVmJ4:0-jupiter-neurosciences-addresses-market-volatility-as-it-remains-focused-on-advancing-clinical-and-commercial-milestones/",
            "pub_date": "2025-02-04 22:25:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX3N07jx:0",
            "title": "JAKKS Pacific, Inc. Announces Fourth Quarter and Full Year 2024 Earnings Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SANTA MONICA, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — JAKKS Pacific, Inc.  will announce its fourth quarter and full year 2024 financial results on Thursday, February 20, 2025 after the close of the stock market. The Company will hold a teleconference and webcast to discuss the results, and may also discuss future plans and prospects.</p><p class=\"\">JAKKS Pacific, Inc. invites analysts, investors and media to listen to the teleconference scheduled for 5:00 p.m. ET / 2:00 p.m. PT on February 20, 2025. A live webcast of the call will be available on the “Investor Relations” page of the Company’s website at www.jakks.com/investors. To access the call by phone, please go to this link (4Q24 Registration link), and you will be provided with dial-in details. To avoid delays, we encourage participants to dial into the conference call ten minutes ahead of the scheduled start time. A replay of the webcast will also be available for a limited time at (www.jakks.com/investors).</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About JAKKS Pacific, Inc.:</strong></p><p class=\"\">JAKKS Pacific, Inc. is a leading designer, manufacturer and marketer of toys and consumer products sold throughout the world, with its headquarters in Santa Monica, California. JAKKS Pacific’s popular proprietary brands include: AirTitans®, Disguise®, Fly Wheels®, JAKKS Wild Games®, Moose Mountain®, Maui®, Perfectly Cute®, ReDo® Skateboard Co., Sky Ball®, SportsZone™, Xtreme Power Dozer®, WeeeDo®, and Wild Manes™ as well as a wide range of entertainment-inspired products featuring premier licensed properties. Through our products and our charitable donations, JAKKS is helping to make a positive impact on the lives of children. Visit us at www.jakks.com and follow us on Instagram (@jakkspacific.toys), Twitter (@jakkstoys) and Facebook (@jakkspacific.toys).</p><p class=\"\">©2025 JAKKS Pacific, Inc. All rights reserved</p><p class=\"\">JAKKS Pacific</p><p class=\"\">Investor Relations</p><p class=\"\">Lucas Natalini</p><p class=\"\">(424) 268-9567</p><p class=\"\">investors@jakks.net</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX3N07jx:0-jakks-pacific-inc-announces-fourth-quarter-and-full-year-2024-earnings-call/",
            "pub_date": "2025-02-04 22:25:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308886:0",
            "title": "Exodus Movement Bids for Banxa in Cash-and-Stock Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Exodus Movement  has offered to acquire all outstanding shares of Banxa Holdings for a mix of cash and stock, the companies said Tuesday. </p><p class=\"\">The companies said the offer includes 1.10 Canadian dollars ($0.76) in cash and 0.0079 of an Exodus share per Banxa share, valuing the total consideration at about CA$ 1.79 per share. </p><p class=\"\">Banxa said the offer was \"superior\" to the CA$ 1.00 offer from 1493819 B.C. </p><p class=\"\">Banxa has notified 1493819 of its determination, and under the terms of their agreement, 1493819 has until Feb. 10 to propose changes to its offer, the companies said. </p><p class=\"\">Banxa's board has not changed its recommendation in favor of the existing deal, and a shareholder vote is scheduled for Feb. 25. There is no assurance the Exodus offer will lead to a finalized agreement, the companies added. </p><p class=\"\">Shares of Exodus were up 4.5% in recent Tuesday premarket activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308886:0/",
            "pub_date": "2025-02-04 22:25:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1DS:0",
            "title": "Intel falls after report says China mulls formal probe into chipmaker",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Chipmaker Intel's  shares fall 0.9% to $19.21 premarket</p><p class=\"\">** Chinese regulators are now looking at launching a formal probe into Intel, the Financial Times reported, citing two people familiar with the situation</p><p class=\"\">** The nature of the probe into the U.S. chipmaker remained unclear - report</p><p class=\"\">** China is INTC's largest market with $15.53 bln net revenue in 2024, while the U.S. is its second largest market with $12.99 bln net revenue, according to Intel's annual report</p><p class=\"\">** Up to last close, shares of INTC have fallen ~55% in the past 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1DS:0-intel-falls-after-report-says-china-mulls-formal-probe-into-chipmaker/",
            "pub_date": "2025-02-04 22:25:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308870:0",
            "title": "Schlumberger's OneSubsea JV, Var Energi Sign Subsea Systems Pre-Commitment Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Schlumberger  said Tuesday its OneSubsea joint venture has signed a pre-commitment agreement with Var Energi to provide subsea production systems, with work on two equipment packages expected to begin immediately. </p><p class=\"\">Financial terms were not disclosed. </p><p class=\"\">Separately, Var Energi said it expects delivery of components needed for drilling in 2026 and a complete subsea production system before summer 2027. </p><p class=\"\">The company said the deal is anticipated to further cut project development time and cost.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308870:0/",
            "pub_date": "2025-02-04 22:25:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV10P:0",
            "title": "Fox Reports Second Quarter Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fox Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FOX CORP Q2 ADJUSTED EPS $0.96 VERSUS IBES ESTIMATE $0.67</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV10P:0-fox-reports-second-quarter-fiscal-2025-results/",
            "pub_date": "2025-02-04 22:25:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007190:0",
            "title": "Markets See Room to Negotiate on Tariffs Now — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0918 ET - Much of the past few days has been about gauging how inflexible the Trump administration will be on tariffs; in other words, whether they're better understood as firm policy or a negotiating tool. Quick postponements of the Canada and Mexico tariffs point to the latter category, strategist Will Compernolle of FHN Financial writes. He notes China's retaliatory tariffs against the only barriers Trump has actually implemented so far don't start until Feb. 10. That \"implies room for negotiation, something traders may take as a sign these tariffs will not be long term,\" Compernolle writes. \"The trade relationship may nevertheless be scarred, but there's a sense, rightly or wrongly, the more maximalist policies will not be the equilibrium.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0835 ET - Treasury yields rise as the U.S. trade war against Mexico and Canada takes a pause while China announces retaliatory tariffs on U.S. exports. Inflation concerns are rising while it remains to be seen how the Fed will react to trade tensions. December JOLTS report is due at 10 a.m. ET. ADP employment data will come tomorrow, followed by jobless claims on Thursday and nonfarm payrolls Friday. Economists surveyed by The Wall Street Journal forecast a slowdown in job creation last month, with unemployment stable at 4.1%. The 10-year is at 4.577% and the two-year at 4.257%. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0722 ET - The U.K. might have to pick a side between the U.S. and Europe in a trade conflict even if it avoids direct U.S. tariffs, Pantheon Macroeconomics economists say in a note. \"The EU has reportedly prepared retaliation should President Trump apply tariffs to the eurozone, and we doubt the U.K. could stand neutral in the middle,\" they say. Britain is highly exposed to global trade disruption because total exports and imports are worth 64% of GDP, the economists say. The U.K. might need to take Trump's other threats, including tax cuts and deportations that threaten to raise global inflation, more seriously given that other countries could respond with fiscal stimulus. Trump's actions would be hawkish for U.K. policy, they say. (edward.frankl@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">0627 ET - The cost of insuring euro credit against default using credit default swaps stays steady after the U.S. delayed tariffs on Canada and Mexico by a month. \"Tariff-related volatility has subsided to an extent following news that both Mexico and Canada had managed to delay the imposition of new import costs,\" IG analysts say in a note. The iTraxx Europe Crossover index which tracks euro junk bond CDS is unchanged at 294 basis points, S&amp;P Global Market Intelligence data show. The iTraxx Europe Senior Financials index which tracks euro investment-grade financial bonds CDS is steady at 61bps. (miriam.mukuru@wsj.com)</p><p class=\"\">0621 ET - Bitcoin falls, albeit remaining above lows hit Monday when risky assets were stung by U.S. President Trump announcing 25% tariffs on Canada and Mexico. He later agreed to delay these tariffs, providing some brief relief but risks remains and a new 10% tariff on China took effect Tuesday. \"China's tariffs keep risk high and cause cryptos to retreat,\" Saxo analysts say in a note. Uncertainty remains and the China tariffs mean further retaliation is possible, they say. Bitcoin falls 3.1% to $98,742 after hitting a three-and-a-half-week low of $91,439 Monday, according to LSEG. (renae.dyer@wsj.com)</p><p class=\"\">0614 ET - The Bank of England could cut interest rates only twice more, including once at this week's meeting, pausing rate reductions by the second half of the year, Berenberg's Andrew Wishart says in a note. Concerns about weak growth and rising unemployment rate are likely to result in faster initial rate reductions, but fears about a rebound in U.K. inflation could then cause the BOE to pause, he says. \"Rising government spending and rate cuts will encourage demand and allow firms to cover higher costs by raising prices.\" Berenberg expects U.K. inflation could reaccelerate to 3.0% in 2025. U.K. money markets price in three rate cuts this year, though a second reduction isn't fully priced in until June. (miriam.mukuru@wsj.com)</p><p class=\"\">0544 ET - The Canadian dollar remain vulnerable even after President Trump agreed to pause 25% tariffs on Canada, Monex Europe analysts say in a note. Any celebrations look somewhat premature, they say. \"The Canadian government will likely have to make much more onerous concessions to ensure that the tariff threat is lifted permanently, and this appears far from a done deal to us.\" This recent drama could resume in a few weeks with risks that next time won't result in another deal for U.S. tariffs to be suspended, they say. USD/CAD trades flat at 1.4434 after hitting a 22-year high of 1.4793 Monday, according to FactSet. (renae.dyer@wsj.com)</p><p class=\"\">0529 ET - The Bank of England is widely expected to cut interest rates when it announces a decision Thursday, and it could hint at another interest-rate cut in March, Berenberg's senior economist Andrew Wishart says in a note. \"Until now, the BOE has cut at alternate meetings, but a stagnating economy and declining employment argue for more urgent action,\" he says. Markets price in a total of 30 basis points of interest-rate cuts in February and March, LSEG Refinitiv data show. \"It is sensible for the BOE to lower interest rates to prevent a larger drop in [U.K.] employment,\" Wishart says. (miriam.mukuru@wsj.com)</p><p class=\"\">0527 ET - China's tariff retaliation is smaller than expected and largely symbolic, Morningstar analyst Kai Wang says in a note. Trump's latest 10% blanket tariff on Chinese goods has an immediate impact only on some industries, such as home appliances, lithium batteries and EVs, the analyst says. Wang notes that the products included in China's countermeasures, such as coal and liquefied natural gas, accounted for just 12% of the country's imports from the U.S., implying less risk than previously expected. However, the analyst still warns of the possibility of an escalating trade war given Trump's unpredictability.(sherry.qin@wsj.com)</p><p class=\"\">0508 ET - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">0505 ET - The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007190:0/",
            "pub_date": "2025-02-04 22:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007188:0",
            "title": "Antitrust Shouldn't Become Trade War Weapon, EU Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Edith Hancock</p><p class=\"\">Antitrust enforcement shouldn't become a weapon in trade disputes, a European Commission spokesperson said as the U.S. and China imposed tariffs on each other this week.</p><p class=\"\">\"[European Union competition enforcement] is agnostic to the country of establishment of the company involved,\" commission spokesperson Lea Zuber said on Tuesday.</p><p class=\"\">Zuber's comments come after U.S. President Trump slapped 10% tariffs on some Chinese goods, triggering a tit-for-tat reaction from China and escalating tensions between the two largest global economies.</p><p class=\"\">China's State Administration of Market Regulation also said that it has opened an investigation into Alphabet's Google over suspected antitrust violations. Google's use is already heavily restricted in China and its search engine was pulled from the mainland in 2010.</p><p class=\"\">Zuber said the commission wouldn't speculate on the reasons behind the Google probe. She said the sole focus of the EU's antitrust investigations is to identify violations related to the behavior investigated and not harms related to any possible tariffs or other measures.</p><p class=\"\">\"We don't think that competition enforcement should become a tool in trade disputes,\" she said.</p><p class=\"\">Trump has spent his first days back in office criticizing the EU's trade relations with the U.S. On Sunday he said that the region is \"really taking advantage\" of the U.S., complaining that the bloc exports far more than it takes from the country and that the U.S. could impose fresh tariffs on the region \"very soon.\"</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007188:0-antitrust-shouldn-t-become-trade-war-weapon-eu-says/",
            "pub_date": "2025-02-04 22:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:f162f242f094b:0",
            "title": "Finalto Names Paul Jackson as Joint Head of Sales, Partnering with Chauncey Boreham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Finalto has appointed Paul Jackson as Joint Head of Sales for the EU, UK, and LATAM regions. Jackson brings sales leadership experience in financial markets to the role. He joins Finalto from iSAM Securities, where he served as Sales Director, focusing on global business growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Finalto Appoints Jackson as Sales Head</strong></p><p class=\"\">Chauncey Boreham, Source: Finalto</p><p class=\"\">Jackson commented: \"I’m delighted to be part of such a dynamic sales team. This is a great opportunity to build on Finalto’s ongoing success and help deliver on the company’s strategic vision for 2025 and beyond.\"</p><p class=\"\">Jackson has prior experience with Finalto, having worked for five years as Sales Director at CFH Clearing before it became part of Finalto in 2021.Paul Groves, Finalto UK CEO, Source: Finalto</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Joint Leadership to Oversee Sales</strong></p><p class=\"\">Jackson will lead the Sales department alongside Chauncey Boreham, who has been promoted from Senior Sales Director to Joint Head of Sales. The two will collaborate on Finalto's Sales strategy.</p><p class=\"\">Boreham added: \"I’m thrilled to welcome Paul to Finalto. His expertise and experience will be an immediate asset to the Sales team.\"</p><p class=\"\">Finalto UK CEO Paul Groves stated that the new appointments would strengthen the Sales Department’s operations.</p><p class=\"\">\"Chauncey and Paul are consummate sales professionals with extensive market experience. Their guidance will help the Sales team drive ongoing growth, across the markets in which we operate,\" Groves commented.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:f162f242f094b:0-finalto-names-paul-jackson-as-joint-head-of-sales-partnering-with-chauncey-boreham/",
            "pub_date": "2025-02-04 22:18:05",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308892:0",
            "title": "Sector Update: Financial Stocks Lean Lower Premarket Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Financial stocks leaned lower premarket Tuesday with the Financial Select Sector SPDR Fund  recently declining marginally. </p><p class=\"\">The Direxion Daily Financial Bull 3X Shares  was down 0.4% and its bearish counterpart Direxion Daily Financial Bear 3X Shares  was 0.6% higher. </p><p class=\"\">PayPal Holdings  shares fell past 8% even after the company reported higher Q4 non-GAAP earnings and net revenue. </p><p class=\"\">KKR  shares declined by nearly 3% after the company reported a decline in Q4 revenue. </p><p class=\"\">Apollo Global Management  shares were down nearly 3% after the company reported a lower Q4 revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308892:0-sector-update-financial-stocks-lean-lower-premarket-tuesday/",
            "pub_date": "2025-02-04 22:18:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308898:0",
            "title": "GUIDANCE: (BERY) Berry Global Expects Fiscal 2025 Adjusted EPS Range $6.10 - $6.60, vs. FactSet Est of $6.26",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308898:0/",
            "pub_date": "2025-02-04 22:18:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308900:0",
            "title": "Evercore ISI Adjusts Lowe's Companies Price Target to $290 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lowe's Companies  has an average rating of overweight and mean price target of $284.45, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308900:0/",
            "pub_date": "2025-02-04 22:19:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308901:0",
            "title": "Morgan Stanley Adjusts Price Target on Elevance Health to $405 From $388, Keeps Equalweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Elevance Health  has an average rating of overweight and mean price target of $481.56, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308901:0/",
            "pub_date": "2025-02-04 22:19:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0MK:0",
            "title": "Morocco, Mauritania to connect electricity grids",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Morocco's state-owned electricity utility ONEE said it signed a power interconnection deal with Mauritania counterpart SOMELEC on Tuesday without disclosing cost details or project deadlines.</p><p class=\"\">The Moroccan electricity grid is already connected to Spain via two undersea cables.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0MK:0-morocco-mauritania-to-connect-electricity-grids/",
            "pub_date": "2025-02-04 22:19:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX23TT1G:0",
            "title": "Stryve Foods, Inc. Transforms Balance Sheet Issuing $9.4 Million of Preferred Stock to Retire Debt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>Eliminates $8.7 Million of Maturing Liabilities</em><em>Deleverages Assets &amp; Strengthens Balance Sheet</em>Creates Flexibility to Pursue More Attractive Financing Options</p><p class=\"\">PLANO, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — Stryve Foods, Inc.  (“Stryve” or the “Company”), a leader in high-protein, better-for-you snacking, today announced the successful completion of a balance sheet transforming transaction, marking the second step in a multi-pronged approach to fortify its financial foundation and support its path to profitability.</p><p class=\"\">As part of this initiative, Stryve has issued 877,878 shares of newly created Series A-1 Convertible Preferred Stock, valued at approximately $10.71 per share, for a total of $9.4 million in preferred stock. The transaction closed on Thursday, January 30th, 2025, and was priced at a premium to market. As part of this transaction, approximately $8.7 million of maturing liabilities have been retired in exchange for the Series A-1 Convertible Preferred Stock. This strategic transaction eliminates a substantial portion of the Company's outstanding debt obligations, significantly improving its financial flexibility and capital structure.</p><p class=\"\">Strong Insider Participation Reflects Confidence in Stryve’s Future:</p><p class=\"\">Demonstrating a high level of confidence in Stryve’s future, insiders represent approximately $3.0 million of the preferred stock, with Chris Boever, Stryve’s Chief Executive Officer, personally representing $2.7 million. This strong insider participation underscores management’s continued belief in the Company’s transformation strategy and long-term growth potential.</p><p class=\"\">“This transaction represents a major milestone in our efforts to transform the Company and position Stryve for long-term success,” said Mr. Boever. “By eliminating the near-term maturities, we seek to make it easier for investors to value the Company on the basis of the business instead of its capital structure – hopefully allowing the market to acknowledge the overall transformation in operating results we’ve completed over the last two years. This transaction represents an important step forward in our multi-phased approach to transform the business, enhance our financial stability, and drive sustainable growth.”</p><p class=\"\">Key Terms of the Series A-1 Convertible Preferred Stock:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Conversion</strong>: Beginning six months after issuance, the preferred equity is convertible into Class A common stock at a conversion price of $0.7599 per share. On an as-converted basis and before contemplating any preferred dividends, this represents approximately 12.4 million shares of common stock in total.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Dividends</strong>: Preferred shares accrue dividends at 12% per annum, payable in cash or additional preferred stock, at the Company’s discretion.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Voting Rights</strong>: Each share of preferred stock will vote on a one-to-one basis with the Class A common stock, subject to a 19.99% voting cap.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Company’s Call Option</strong>: Beginning two years after issuance, the Company has the right to redeem the preferred stock at 102% of the stated value, plus any unpaid accrued dividends.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Forced Conversion</strong>: If, within nine months of issuance of the preferred stock, the Company raises at least $6.0 million in gross proceeds from the sale of Class A common stock at a price equal to or greater than the preferred stock’s conversion price ($0.7599 per share), Stryve may, at its option, force the conversion of the preferred stock into common shares at the conversion price.</li></ul><p class=\"\">“We believe that this transaction is a win-win for Stryve and our stakeholders,” added R. Alex Hawkins, Chief Financial Officer of Stryve Foods. “We have effectively addressed upcoming debt maturities while preserving our ability to raise additional capital in a way that supports our long-term growth objectives. The strong insider participation further underscores our leadership team’s confidence in Stryve’s vision and the steps we are taking to execute on our profitability goals.”</p><p class=\"\">This transaction builds on Stryve’s ongoing financial transformation efforts, following previous initiatives aimed at streamlining operations and improving cost efficiencies. With a strengthened balance sheet and a focus on operational execution, the Company remains committed to driving value for shareholders and accelerating its journey to profitability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Stryve Foods, Inc.</strong>Stryve is a premium air-dried meat snack company that is conquering the intersection of high protein, great taste, and health under the brands of Braaitime®, Kalahari®, Stryve®, and Vacadillos®. Stryve sells highly differentiated healthy snacking and food products in order to disrupt traditional snacking and CPG categories. Stryve’s mission is “to help Americans eat better and live happier, better lives.” Stryve offers convenient products that are lower in sugar and carbohydrates and higher in protein than other snacks and foods. Stryve’s current product portfolio consists primarily of air-dried meat snack products marketed under the Stryve®, Kalahari®, Braaitime®, and Vacadillos® brand names. Unlike beef jerky, Stryve’s all-natural air-dried meat snack products are made of beef and spices, are never cooked, contain zero grams of sugar*, and are free of monosodium glutamate (MSG), gluten, nitrates, nitrites, and preservatives. As a result, Stryve’s products are Keto and Paleo diet friendly. Further, based on protein density and sugar content, Stryve believes that its air-dried meat snack products are some of the healthiest shelf-stable snacks available today. Stryve also markets and sells human-grade pet treats under the brands Two Tails and Primal Paws, made with simple, all-natural ingredients and 100% real beef with no fillers, preservatives, or by-products.</p><p class=\"\">Stryve distributes its products in major retail channels, primarily in North America, including grocery, convenience store, mass merchants, and other retail outlets, as well as directly to consumers through its ecommerce websites and through the Amazon and Wal*mart platforms. For more information about Stryve, visit www.stryve.com or follow us on social media at @stryvebiltong.</p><p class=\"\">* All Stryve Biltong and Vacadillos products contain zero grams of added sugar, with the exception of the Chipotle Honey flavor of Vacadillos, which contains one gram of sugar per serving.</p><p class=\"\">Cautionary Note Regarding Forward-Looking Statements</p><p class=\"\">Certain statements made herein are “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “anticipate”, “may”, “will”, “would”, “could”, “intend”, “aim”, “believe”, “anticipate”, “continue”, “target”, “milestone”, “expect”, “estimate”, “plan”, “outlook”, “objective”, “guidance” and “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, including, but not limited to, statements regarding Stryve’s plans, strategies, objectives, targets and expected financial performance. These forward-looking statements reflect Stryve’s current views and analysis of information currently available. This information is, where applicable, based on estimates, assumptions and analysis that Stryve believes, as of the date hereof, provide a reasonable basis for the information and statements contained herein. These forward-looking statements involve various known and unknown risks, uncertainties and other factors, many of which are outside the control of Stryve and its officers, employees, agents and associates. These risks, uncertainties, assumptions and other important factors, which could cause actual results to differ materially from those described in these forward-looking statements, include: (i) the inability to achieve profitability due to commodity prices, inflation, supply chain interruption, transportation costs and/or labor shortages; (ii) the ability to meet financial and strategic goals, which may be affected by, among other things, competition, supply chain interruptions, the ability to pursue a growth strategy and manage growth profitability, maintain relationships with customers, suppliers and retailers and retain its management and key employees; (iii) the risk that retailers will choose to limit or decrease the number of retail locations in which Stryve’s products are carried or will choose not to carry or not to continue to carry Stryve’s products; (iv) the possibility that Stryve may be adversely affected by other economic, business, and/or competitive factors; (v) the ability to remain listed on NASDAQ; (vi) the possibility that Stryve may not achieve its financial outlook; (vii) risks around the Company’s ability to continue as a going concern and (viii) other risks and uncertainties described in the Company’s public filings with the SEC. Actual results, performance or achievements may differ materially, and potentially adversely, from any projections and forward-looking statements and the assumptions on which those projections and forward-looking statements are based.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Investor Relations</p><p class=\"\">ir@stryve.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX23TT1G:0-stryve-foods-inc-transforms-balance-sheet-issuing-9-4-million-of-preferred-stock-to-retire-debt/",
            "pub_date": "2025-02-04 22:20:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308876:0",
            "title": "Sector Update: Consumer Stocks Mixed Pre-Bell Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Consumer stocks were mixed pre-bell Tuesday, with the Consumer Staples Select Sector SPDR Fund  0.2% lower and the Consumer Discretionary Select Sector SPDR Fund  was flat. </p><p class=\"\">Estee Lauder  shares were down more than 5% after the company reported lower fiscal Q2 adjusted net earnings and net sales. The company also issued fiscal Q3 outlook for adjusted earnings per share below market expectations. In addition, Estee Lauder said it expects to eliminate 5,800 to 7,000 job roles as part of a restructuring plan. </p><p class=\"\">PepsiCo  shares declined by more than 2% after the company reported a decline in fiscal Q4 revenue. </p><p class=\"\">Archer-Daniels-Midland  shares fell by over 2% after the company reported lower Q4 adjusted earnings and revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308876:0-sector-update-consumer-stocks-mixed-pre-bell-tuesday/",
            "pub_date": "2025-02-04 22:20:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS4Jdr9a:0",
            "title": "Cisco: Innovation - and Independence - for People With Diverse Abilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Cisco-sponsored project explores how technology can better support seniors, people with developmental disabilities, and other challenged communities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">By Kevin Delaney</strong></p><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / Keeping our rooms clean and safe. Maintaining personal hygiene. Staying connected with family.</p><p class=\"\">For many of us, these are simple, everyday tasks. But for those with diverse abilities - including seniors and people with cognitive disabilities - handling such tasks can be a daily triumph. And they can mean the difference between independence and constant supervision.</p><p class=\"\">A pilot project funded by Cisco's Country Digital Acceleration (CDA) program, Ignite Technology, and other partners has been exploring how digital solutions can help. Under the brand name Hayla, a suite of high-tech innovations has evolved into a streamlined, secure, app-based platform that is ready for market.</p><p class=\"\">\"A lot of these individuals are looking to live more independently, autonomously, maybe move to a situation where they're on their own,\" explained Ignite CEO Steven Taylor. \"And the Autonomous Living Project, now branded Hayla, uses technology to help people work towards the goal of self-sufficiency, independence, and greater dignity.\"</p><p class=\"\">The origins of Hayla began in 2021 at the Lou Fruitman Residence in Toronto, which is run by Reena, another partner in the project. The Residence houses 138 adults and seniors with diverse needs. And as part of this project, it adopted a number of technologies - including Internet of Things (IoT) sensors, automated alerts, smart-device integration, collaboration hubs, and a proprietary app - all supported by customized Cisco and Cisco Meraki products.</p><p class=\"\">The concept is built around self-sufficiency, not surveillance. Through remote monitoring, smart notifications, alert services, and smart-device integration, users receive in-home support that enables them to live independently and safely. However, if the need arises - whether for an emergency, basic reminders, or emotional/mental counseling - caregivers can step in quickly.</p><p class=\"\">It's technology that's geared to individual outcomes.</p><p class=\"\">\"If we're talking to an individual and a caregiver,\" Taylor said, \"we don't simply talk about the sensors they can have. We talk about the challenges they're experiencing today, and we look at implementing a solution that leverages technology to actually help address those challenges.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Security and simplicity for positive good</strong></p><p class=\"\">With their shared commitment to simple-to-use, secure technologies, Cisco and Ignite were ideal partners.</p><p class=\"\">\"Like Cisco, Ignite is committed and visionary,\" said Wayne Cuervo, director of Cisco Canada's Digital Impact Office. \"They have an ideal view of how technology can not only help, but how technology can get out of the way - to simplify the experience.\"</p><p class=\"\">Hayla represents a big commitment in time, technology, and expertise from Cisco, particularly its CDA program.</p><p class=\"\">\"We consider Hayla to be one of our most important projects,\" said Cuervo. \"It's a profound story that helps transform the lives of people. And we feel it's very scalable to other use cases around the world.\"</p><p class=\"\">As for the outcomes so far, Jessica Noftle, day program supervisor for another partner, the Toronto-based family-support organization Creating Alternatives, weighed in from a caretaker's perspective.</p><p class=\"\">\"With Hayla's expertise, innovation and devices,\" she said, \"we have successfully been able to help more than 10 supported individuals transition out of fully supported days, to semi-independent living. Hayla's dedication, along with their mentorship, has been a huge success for us at Creating Alternatives. We hope to continue to work alongside them for years to come.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A scalable solution for aging populations</strong></p><p class=\"\">Hayla makes it all happen with a foundation of Cisco technology.</p><p class=\"\">\"At the core of the hardware is a Cisco firewall router and an access point,\" Taylor stressed. \"That access point communicates with the Meraki IoT sensors in the unit, which monitor things like the refrigerator, doors, and showers. Essentially, you have your network equipment - that is, access points, firewalls, and switches for larger implementations, - and IoT sensors that are set in the environment for safety and peace of mind. Maybe it's actually detecting water leakage, smoke in units, or simply helping to track daily living tasks.\"</p><p class=\"\">Communication, of course, is equally critical. And Cisco Webex - either through handheld devices or hardware like the Cisco DeskPro, combined with Webex Calling - keeps users, their families, and caregiving teams connected on both emotional and practical levels.</p><p class=\"\">\"Webex Calling is part of our custom software that we've integrated,\" Taylor continued. \"This allows individuals to call a parent, caregiver, or therapist simply by clicking their picture. Everything is handled on the back end, so it's just one button to call.\"</p><p class=\"\">Security is a key concern, especially when sensitive medical or personal data is shared among vulnerable populations. So, Cisco and Meraki's built-in end-to-end security ensures further confidence in the system. Despite a constant flow of data coming from sensors, monitoring is automated and intuitive.</p><p class=\"\">\"All of this is managed on the back end through the Meraki Dashboard and Cisco Control Hub,\" Taylor added. \"We have automated alerts through Meraki dashboard.\"</p><p class=\"\">For Cuervo - and Cisco's Country Digital Acceleration program - supporting Ignite's effort to bring Hayla to market is a great opportunity. CDA's mission is to use technology for positive transformation around the world (in more than 50 countries so far), and Hayla is a perfect fit.</p><p class=\"\">\"We're all about using technology to address challenges and doing it in a way that benefits society,\" Cuervo said. \"Hayla is significant at an individual level, but also at a national and global scale. In Canada and other countries, populations are aging, increasing the demand for social services, while the number of caregivers is shrinking. This solution enables caregivers to be more effective while improving the quality of life for those in need. For us, it's a perfect combination of technology excellence and real-world, positive impact.\"</p><p class=\"\">View original content here.</p><p class=\"\">View additional multimedia and more ESG storytelling from Cisco Systems on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Cisco Systems</p><p class=\"\">Website: https://www.3blmedia.com/profiles/cisco-systems</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Cisco Systems</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS4Jdr9a:0/",
            "pub_date": "2025-02-04 22:20:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308905:0",
            "title": "Evercore ISI Adjusts Genuine Parts Price Target to $130 From $155",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Genuine Parts  has an average rating of overweight and mean price target of $131.89, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308905:0/",
            "pub_date": "2025-02-04 22:20:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA54XW8S:0",
            "title": "Blüm Holdings Moves Forward with Binding LOI for Key Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blum Holdings Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BLÜM HOLDINGS MOVES FORWARD WITH BINDING LOI FOR KEY ACQUISITION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA54XW8S:0-bl-m-holdings-moves-forward-with-binding-loi-for-key-acquisition/",
            "pub_date": "2025-02-04 22:20:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007145:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p><p class=\"\">0829 ET - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">0509 ET - Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p><p class=\"\">0444 ET - Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0426 ET - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0321 ET - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0310 ET - Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research's Joseph Chai says in a research report. Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800/oz level, leaving its bullish bias intact, Chai says. The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900/oz level, Chai says. The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, the analyst adds. Spot gold is 0.1% lower at $2,812.28/oz. (ronnie.harui@wsj.com)</p><p class=\"\">2213 ET - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007145:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX42ZFZ4:0",
            "title": "Fatboy Bean Bag Chairs: The Ultimate Blend of Comfort, Style, and Durability",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MONTREAL, Feb.  04, 2025  (GLOBE NEWSWIRE) — Fatboy, the global icon in casual furniture, offers a premium collection of bean bag chairs designed for both indoor and outdoor relaxation. With an unwavering commitment to quality and innovation, Fatboy's bean bags and ottomans are filled and manufactured in Canada, ensuring a product that meets the highest standards of comfort and durability for Canadian homes and lifestyles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Collection for Every Space</strong></p><p class=\"\">Whether you're looking to create a cozy indoor lounge or a stylish outdoor retreat, Fatboy has a bean bag chair for every setting. From the classic Original bean bag to the compact Junior, the versatile Slim, and the durable outdoor-friendly Buggle-Up, Fatboy’s collection offers a variety of shapes, sizes, and textures to suit any space.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Premium Fabrics for Maximum Comfort</strong></p><p class=\"\">Fatboy’s bean bag chairs are available in an exclusive selection of high-quality fabrics, each crafted for specific needs:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nylon</strong> – A durable and stainproof option, perfect for vibrant and easy-to-maintain indoor seating.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Stonewashed Cotton</strong> – A soft, natural fabric with a vintage-inspired look, offering timeless comfort and a relaxed aesthetic.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Olefin</strong> – A UV-resistant, water-repellent material ideal for outdoor use, built to withstand the elements.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Velvet</strong> – Luxuriously soft and made from recycled polyester, adding a touch of elegance to any interior.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Teddy &amp; Sherpa</strong> – Ultra-plush fabrics designed for cozy indoor lounging with a warm, inviting feel.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corduroy</strong> – A stylish, textured option that adds depth and sophistication to any space.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Mingle</strong> – A durable woven bouclé fabric with a 100,000 Martindale rating, providing both beauty and longevity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Polyester</strong> – A versatile, strong fabric that is easy to clean and perfect for both indoor and outdoor relaxation.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Proudly Made for Canada</strong></p><p class=\"\">Fatboy is a Dutch design brand known for its bold and innovative approach to casual furniture. While its roots are in the Netherlands, Fatboy's bean bag chairs and ottomans are filled and manufactured in Canada for the Canadian market, ensuring quality craftsmanship, shorter lead times, and a commitment to local production. With a focus on sustainable materials and innovative designs, Fatboy continues to redefine casual seating with products that are as stylish as they are functional.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Experience the Fatboy Difference</strong></p><p class=\"\">From living rooms to patios, Fatboy’s products elevate comfort and design in any space. Discover the full collection and find your perfect bean bag chair match today.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fatboy</strong></p><p class=\"\">Fatboy is a global leader in modern casual furniture, known for its bold designs, high-quality materials, and innovative approach to comfort. Since launching the Original bean bag, Fatboy has expanded its product range to include furniture, lighting, and accessories that redefine contemporary living.</p><p class=\"\">For more information, interviews, or high-resolution images, please contact:</p><p class=\"\">Fatboy Canada</p><p class=\"\">Email: hello@fatboycanada.com</p><p class=\"\">Website: fatboycanada.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX42ZFZ4:0-fatboy-bean-bag-chairs-the-ultimate-blend-of-comfort-style-and-durability/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007143:0",
            "title": "Bristol-Myers Squibb Is Maintained at Neutral by Cantor Fitzgerald",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>Bristol-Myers Squibb Price Target Raised to $55.00/Share From $50.00 by Cantor Fitzgerald</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007143:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007152:0",
            "title": "Berry Global Group Sees FY25 Cash Flow From Ops of $1.125 B-$1.225 B >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007152:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}