{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309127:0",
            "title": "Exchange-Traded Funds, US Equities Higher After Midday Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Broad Market Indicators</p><p class=\"\">Broad-market exchange-traded funds IWM and IVV were higher. Actively traded Invesco QQQ Trust (QQQ) rose 1%. </p><p class=\"\">US equity indexes were also up after midday trading Tuesday following China's announcement of retaliatory tariffs on some US products. </p><p class=\"\">Energy</p><p class=\"\">iShares US Energy ETF (IYE) gained 1.8% and Energy Select Sector SPDR (XLE) climbed 2%. </p><p class=\"\">Technology</p><p class=\"\">Technology Select Sector SPDR ETF (XLK) was up 1%; iShares US Technology ETF (IYW) and iShares Expanded Tech Sector ETF (IGM) were also advancing. </p><p class=\"\">SPDR S&amp;P Semiconductor (XSD) was 0.9% higher, and iShares Semiconductor (SOXX) added 0.6%. </p><p class=\"\">Financial</p><p class=\"\">Financial Select Sector SPDR (XLF) eased 0.2%. Direxion Daily Financial Bull 3X Shares (FAS) dropped 0.5%, and its bearish counterpart Direxion Daily Financial Bear 3X Shares (FAZ) rose 0.7%. </p><p class=\"\">Commodities</p><p class=\"\">Crude oil was down 0.7%, and the United States Oil Fund (USO) lost 0.3%. Natural gas fell 1.6%, and the United States Natural Gas Fund (UNG) shed 1.8%. </p><p class=\"\">Gold was up 0.7% on Comex, and SPDR Gold Shares (GLD) rose 1%. Silver advanced 1.4%, and iShares Silver Trust (SLV) jumped 2.6%. </p><p class=\"\">Consumer</p><p class=\"\">Consumer Staples Select Sector SPDR (XLP) was 0.7% lower; Vanguard Consumer Staples ETF (VDC) and iShares Dow Jones US Consumer Goods (IYK) were also in the red. </p><p class=\"\">Consumer Discretionary Select Sector SPDR (XLY) added 0.7%; retail fund VanEck Vectors Retail ETF (RTH) advanced 1.1%, and SPDR S&amp;P Retail (XRT) gained 1.3%. </p><p class=\"\">Health Care</p><p class=\"\">Health Care Select Sector SPDR (XLV) dipped 0.5%, and iShares US Healthcare (IYH) and Vanguard Health Care ETF (VHT) were also retreating. IShares Biotechnology ETF (IBB) rose 0.5%. </p><p class=\"\">Industrial</p><p class=\"\">Select Sector SPDR-Industrial (XLI) was 0.1% higher, while Vanguard Industrials (VIS) and iShares US Industrials (IYJ) were mixed with the latter down 0.2%.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309127:0-exchange-traded-funds-us-equities-higher-after-midday-tuesday/",
            "pub_date": "2025-02-05 02:12:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009286:0",
            "title": "Woodward Inc Is Maintained at Buy by UBS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009286:0/",
            "pub_date": "2025-02-05 02:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009288:0",
            "title": "GDP Estimator Off to a Hot Start in 1Q — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A few days after its quarterly launch, the Atlanta Fed's real-time estimate of 1Q GDP shows the U.S. economy growing at a 3.9% annualized pace over the three months through March. That would be a sharp step up from the 2.3% annualized rate recorded in 4Q 2024 and is well above most Wall Street analysts' forecasts. The model hasn't ingested much 1Q data yet, but recent construction-spending data and ISM manufacturing indexes have pushed the forecast in a positive direction. The first official estimates of 1Q GDP from the Commerce Department are expected to land in late April. (matt.grossman@wsj.com, @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009288:0/",
            "pub_date": "2025-02-05 02:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8efcc7e4691d7:0",
            "title": "ENERGIZER HOLDINGS, INC. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energizer Holdings, Inc., a leading manufacturer and distributor of batteries, lights, and auto care products, has released its Form 10-Q report for the third quarter. The report highlights the company's financial and operational performance, showcasing growth in net sales and significant improvements in profitability, despite facing challenges in certain markets.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Sales</strong>: $731.7 million, an increase of $15.1 million or 2.1% compared to the prior year quarter, driven by organic growth and distribution gains.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Margin</strong>: 36.8%, a decrease from 37.3% in the prior year, impacted by restructuring and network transition costs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Adjusted Gross Margin</strong>: 40.0%, an improvement of 50 basis points from the prior year, driven by Project Momentum savings and slight improvement in product cost inputs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Earnings</strong>: $22.3 million, compared to $1.9 million in the prior year quarter, reflecting improved operational performance.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Diluted Net Earnings Per Common Share</strong>: $0.30, compared to $0.03 in the prior year quarter, indicating a significant increase in profitability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Adjusted Diluted Net Earnings Per Common Share</strong>: $0.67, an increase of approximately 14% from $0.59 in the prior year quarter, reflecting adjustments for restructuring and other costs.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The Batteries &amp; Lights segment reported a 2.4% increase in net sales, driven by a 4.0% organic growth due to distribution gains and increased hurricane-related volumes. The Auto Care segment saw a 0.5% increase in net sales, with a 2.1% organic growth attributed to distribution gains, international market expansion, and digital economy growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong>: The company experienced challenges in hyperinflationary markets, particularly in Argentina, where economic reforms and currency devaluation impacted operations. The devaluation of the Argentine Peso led to significant exchange losses, affecting the company's financial performance in the region.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong>: The Batteries &amp; Lights segment benefited from increased volumes due to new and expanded distribution channels, contributing to a 3.8% volume increase. Additionally, hurricane activity generated approximately $10 million in incremental volume, representing a 1.4% organic growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Production Launches</strong>: The acquisition of battery manufacturing assets in Belgium from Advanced Power Solutions Belgium NV is expected to enhance the company's manufacturing capabilities in Europe, supporting future growth and operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company anticipates continued macroeconomic pressures and geopolitical instability in fiscal year 2025, with potential impacts from transportation, logistical, and supply constraints. The Project Momentum restructuring program is expected to generate significant cost savings and operational efficiencies, with total pre-tax savings projected to reach approximately $200 million by the end of fiscal year 2025.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1632790/000163279025000024/enr-20241231.htm\" rel=\"nofollow\" target=\"_blank\">ENERGIZER HOLDINGS, INC. [ ENR ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:8efcc7e4691d7:0-energizer-holdings-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 02:13:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1BP:0",
            "title": "Gartner beats quarterly profit estimates as contract value grows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gartner  on Tuesday beat estimates for fourth-quarter profit and reported revenue in line with expectations, as the research and advisory firm benefited from an increase in contract values.</p><p class=\"\">While Gartner issued a weaker forecast for 2025, analysts noted investors were pinning their hopes on the acceleration in contract value.</p><p class=\"\">\"Investors are encouraged by the acceleration in CV (contract value) growth which could support recurring revenue growth in the quarters ahead ... Gartner typically guides each year conservatively and this is incorporated into investor expectations,\" said UBS analyst Joshua Chan.</p><p class=\"\">Shares of the company climbed as much as 5% in early trading. They were last up about 1% in mid-day trading.</p><p class=\"\">Gartner is benefiting as more clients sign up for its services, mainly in finance, sales and legal sectors. The revenue also saw a rising contribution from its conferences segment, as it held 13 destination conferences in the quarter.</p><p class=\"\">The company said global contract value grew about 8% to $5.3 billion in the quarter, accelerating from a 7.3% increase in the prior three-month period.</p><p class=\"\">It reported an adjusted profit of $5.45 per share, handily beating analysts' estimates of $3.25 per share, according to LSEG data.</p><p class=\"\">The company projected full-year 2025 revenue of $6.56 billion, below analysts' estimates of $6.70 billion, per data compiled by LSEG.</p><p class=\"\">\"The biggest driver of forward year subscription revenue growth is going to be the end of year — prior year CV growth,\" said CFO Craig Safian.</p><p class=\"\">Gartner said it expects an annual adjusted profit per share of $11.45, compared with estimates of $13.10 per share.</p><p class=\"\">Gartner is a research and advisory firm that provides business data and analytics services to its customers. It has more than 15,000 enterprise clients and operates in three segments — research, consulting and conferences.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1BP:0-gartner-beats-quarterly-profit-estimates-as-contract-value-grows/",
            "pub_date": "2025-02-05 02:13:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009295:0",
            "title": "Royal Caribbean Group Is Maintained at Buy by UBS",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:14 GMT) </strong>Royal Caribbean Group Price Target Raised to $301.00/Share From $271.00 by UBS</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009295:0/",
            "pub_date": "2025-02-05 02:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009297:0",
            "title": "Palantir Technologies Is Maintained at Underperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:14 GMT) </strong>Palantir Technologies Price Target Raised to $40.00/Share From $11.00 by RBC Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009297:0/",
            "pub_date": "2025-02-05 02:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009293:0",
            "title": "Diageo Projects $200 Million Profit Hit From Mexico, Canada Tariffs — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Laura Cooper</p><p class=\"\">Spirits giant Diageo said U.S. tariffs on goods from Mexico and Canada could amount to a $200 million hit on its annual operating profit. Imports from Canada and Mexico represent about 45% of Diageo's U.S. sales: tequila and mescal from Mexico, and Canadian whisky from Canada. The products must be made in those countries to be considered authentic.</p><p class=\"\">If the U.S. enacted 25% tariffs on Canada and Mexico, Diageo said it could partially offset the impact by increasing prices, managing inventory, reallocating investments and optimizing its supply chain.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009293:0/",
            "pub_date": "2025-02-05 02:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009306:0",
            "title": "PPG Industries Is Maintained at Sector Perform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(18:15 GMT) </strong>PPG Industries Price Target Cut to $120.00/Share From $128.00 by RBC Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009306:0/",
            "pub_date": "2025-02-05 02:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002980:0",
            "title": "Nvidia Stock Rises. What Tariff Threats Mean for the AI Chip Maker. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Clark</p><p class=\"\">Nvidia was gaining early on Tuesday. The chip maker looks set to gain from the wider market relief around last-minute deals that averted the U.S. putting tariffs on goods imported from Mexico and Canada.</p><p class=\"\">Nvidia shares were up 1.5% at $118.42 in early trading. The stock fell 2.8% on Monday.</p><p class=\"\">The U.S. gets less than 10% of its imported chips from Canada, Mexico or China, according to analysts at Bernstein Research. However, Taiwan's Foxconn — also known as Hon Hai Precision Industry — has previously said it is building the world's largest manufacturing site for servers to house Nvidia's GB200 Superchips in Mexico. The GB200 is one of Nvidia's Blackwell generation of processors.</p><p class=\"\">President Donald Trump has also threatened to place tariffs on semiconductors coming from Taiwan. Speaking at a Republican congressional retreat in Miami last week, Trump warned the U.S. will soon place tariffs on foreign-made semiconductor chips, pharmaceuticals, and metals such as steel. He claimed that Taiwan had taken \"about 98 percent of the chip business.\"</p><p class=\"\">The agreements reached with Mexico and Canada could lessen fears over the imposition of similar levies on Taiwan.</p><p class=\"\">\"[The] one-month reprieve given to Canada and Mexico... by the Trump administration suggests willingness to negotiate rather than outright ban trade. Overall, we expect rising demand from the west (US cloud, enterprise, OpenAI Stargate etc.) to offset China headwinds for Nvidia,\" wrote BofA Securities analys Vivek Arya in a research note.</p><p class=\"\">Arya reiterated a Buy rating and $190 target price on Nvidia stock.</p><p class=\"\">Meanwhile, Wall Street will be looking for commitments to investment in AI infrastructure from Alphabet when it reports quarterly results after the market closes. Its executives are likely to face questions over the ramifications of Chinese firm DeepSeek's low-cost AI models.</p><p class=\"\">Among other chip makers, Advanced Micro Devices was up 0.7%. Broadcom gained 0.1% in morning trading.</p><p class=\"\">Write to Adam Clark at adam.clark@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002980:0/",
            "pub_date": "2025-02-05 02:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009300:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 1 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Americans Kiss Job Hopping Goodbye</strong></p><p class=\"\">The number of workers who left their jobs last year hit the lowest level since 2020, according to the Labor Department.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery despite China's retaliation against the new U.S. tariffs. The moves show some signs of investor anxiety remained.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The U.K. Has Dodged Trump's Tariffs So Far. Here Are Some (Very British) Reasons Why.</strong></p><p class=\"\">In his global tariff offensive, President Trump has said trade with the U.K., while out of line, can be worked out.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary</strong></p><p class=\"\">Next, the full Senate will vote whether to confirm Robert F. Kennedy Jr.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009300:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-1-pm-et/",
            "pub_date": "2025-02-05 02:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009301:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 1 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Stock Rises on Fourth-Quarter Earnings Beat and Reaffirmed Guidance</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland laying off up to 700 in face of uncertain profit</strong></p><p class=\"\">The company says 2025 guidance reflects \"weaker\" market view on biofuel and trade-policy turmoil.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Spotify Reports First Full-Year Profit</strong></p><p class=\"\">Price increases and cost discipline helped the audiostreaming giant pivot from heavy spending on growth to sustained profits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009301:0-news-highlights-top-company-news-of-the-day-tuesday-at-1-pm-et/",
            "pub_date": "2025-02-05 02:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSPjkRWa:0",
            "title": "Inogen Alliance Ranked #32 in Environment Analyst’s Global Environmental & Sustainability Consulting Market Assessment for FY 2023",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The report identifies the key global players in the environmental &amp; sustainability (E&amp;S) consulting by E&amp;S consulting revenue for FY 2023.</p><p class=\"\">ST. PAUL, MN / ACCESS Newswire / February 4, 2025 / Inogen Alliance today announced it is <strong class=\"root-Tkn6WL2y\">ranked #32</strong> in Environment Analyst's latest Global Environmental &amp; Sustainability Consulting Market Assessment.</p><p class=\"\">This moves our ranking up by 9 from the previous report published in 2023, and yet another improvement in ranking by 9 from 2022. Our collective ranking when combined with Antea Group, which is listed separately at #19, would put the Inogen Alliance at #14 globally.</p><p class=\"\">The report researched and curated by Environment Analyst, a leading membership community and provider of business intelligence to the global environmental services sector, identifies the leading global consultancies in environmental and sustainability (E&amp;S) consulting sector based on their E&amp;S consulting revenue from financial year 2023. The state-of-the-industry study provides a window into market dynamics, competitor rankings, revenue breakdowns, M&amp;A insights and growth opportunities.</p><p class=\"\">\"This ranking is very meaningful to the Inogen Alliance. We are an Alliance of over 70 independent companies globally, and our growing global footprint and technical capabilities demonstrates our collective ability to accelerate a resilient plant for all, which is core to our collective purpose. Our operating model is unique compared to the other companies on this list, but we are proud to be included among the top 35 global leaders in this space,\" Angelique Dickson, President, Inogen Alliance.</p><p class=\"\">Some of the key services provided by Inogen Alliance Associates globally under Environment and Sustainability services include Groundwater and Soil Remediation, EHS Due Diligence, Biodiversity, Waste Management, Climate Mitigation, Decarbonization, Sustainability Strategy and Reporting, Energy Transition, Water Stewardship and more. For a full listing check here.</p><p class=\"\">The report is based on data compiled for 35 of the leading international E&amp;S consulting firms, who totaled a combined revenue of <strong class=\"root-Tkn6WL2y\">$35.3bn</strong> in 2023, and together account for <strong class=\"root-Tkn6WL2y\">65%</strong> of the global E&amp;S consulting market.</p><p class=\"\">The latest data from the Global 35, or ‘G35', leading companies featured in the report is based on their figures for the latest fiscal year end, submitted via an annual survey and verification process (and/or estimated based on publicly available annual reports and public information sources where there are data gaps). For all the G35 firms analysed, the data is based on their financial year ending in 2023 (2024 for the companies with FY ending in March).</p><p class=\"\">Environment Analyst's definition of environmental sustainability consulting (E&amp;S) is: <!-- -->\"The provision of specialist technical, management, risk, analytics and strategic advisory services to help organisations understand, manage, and minimise their impacts to protect and enhance the environment and communities, and proactively respond to climate change, the nature crisis and associated impacts\".</p><p class=\"\">We are proud to be included in this leading global 35 ranking by EA, and more importantly, proud of the work this represents globally for our clients in accelerating a more sustainable future for all.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Download the Report</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Inogen Alliance</strong></p><p class=\"\">Inogen Alliance is a global network of environment, health, safety and sustainability consulting companies working together to help multinational organizations meet their global commitments locally. With offices located on every continent, more than 6,000 associates worldwide, and projects completed in more than 150 countries, Inogen Alliance provides unparalleled local consulting expertise, global consistency and 20 years of experience building a cleaner, safer and more sustainable future. Global Thinking. Local Delivery. Learn more at www.inogenalliance.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Environment Analyst</strong></p><p class=\"\">Environment Analyst is a leading membership community and provider of business intelligence to the global environmental services sector. Environment Analyst has a global membership community of over 22,000 sustainability professionals. Membership includes access to their entire market intelligence library, which features bespoke market intelligence reports, data-sets, interactive dashboards and competitor analysis profiles, plus business news and insights.</p><p class=\"\">Environment Analyst also hosts networking opportunities for sustainability business leaders to come together in closed-group forums, and larger-scale in-person Sustainability Summits.</p><p class=\"\">For more information about the report please contact Research &amp; Data Manager Indrė Jakaitytė at indre.jakaityte@environment-analyst.com.</p><p class=\"\">For more information about Environment Analyst and their membership services contact Membership Development Manager Lisa Turner at lisa.turner@environment-analyst.com.</p><p class=\"\">View additional multimedia and more ESG storytelling from Inogen Alliance on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Inogen Alliance</p><p class=\"\">Website: https://www.3blmedia.com/profiles/inogen-alliance</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Inogen Alliance</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSPjkRWa:0/",
            "pub_date": "2025-02-05 02:15:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0Y3:0",
            "title": "Sterling swerves tariff wars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US indexes green, Nasdaq up ~0.9%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Energy leads S&amp;P sector gainers; Utilities weakest group</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Dollar, crude fall; bitcoin down &gt;2.5%; gold up ~1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">US 10-Year Treasury yield edges down to ~4.52%</li></ul></span></div><span><p class=\"\">STERLING SWERVES TARIFF WARS</p><p class=\"\">Sterling was an unexpected winner of safe haven flows on Monday as the British currency side stepped the trade war headlines that sent other assets including stocks and the currencies of Mexico, Canada, and the eurozone tumbling.</p><p class=\"\">“The pound emerged as a safe haven among pro-cyclical currencies yesterday, and seems to be retaining some solid footing after an American trade war was averted,” ING FX analyst Francesco Pesole said in a report on Tuesday.</p><p class=\"\">Sterling’s benefit is simple, Pesole said. “The UK does not have much to lose from US tariffs. UK exports to the US are less than 2% of GDP and those to China less than 1%.” In addition, “Trump seems in no rush to hit the UK with tariffs, also considering its goods trade balance with the US is arguably negligible.\"</p><p class=\"\">The British currency is also benefiting from efforts by Prime Minister Keir Starmer to strengthen EU-UK defense.</p><p class=\"\">That was the official reasoning for a trip to Brussels, but Pesole notes that “markets may be double reading an intent by Starmer to gradually reconnect with the EU politically. That is inarguably positive for sterling, which remains highly sensitive to any development that can improve a worsening growth outlook.”</p><p class=\"\">Indeed, it's not all good news for the pound. Higher borrowing costs are eating into the fiscal headroom for the UK Chancellor. On Thursday, the Bank of England is also expected to deliver “a dovish rate cut.”</p><p class=\"\">And that means that sterling may not advance back to the $0.8450 level reached against the euro in January anytime soon, Pesole said. </p><p class=\"\">(Karen Brettell) </p><p class=\"\">     *****       </p><p class=\"\">FOR TUESDAY'S EARLIER LIVE MARKETS POSTS:</p><p class=\"\">CAREFUL, IS THAT THE FEDERAL BUREAUCRACY, OR PANDORA'S BOX? - CLICK HERE</p><p class=\"\">TWO-FER TUESDAY: JOLTS, FACTORY ORDERS - CLICK HERE</p><p class=\"\">META SHARES POISED FOR RECORD WINNING STREAK ON FACEBOOK'S 21ST BIRTHDAY - CLICK HERE</p><p class=\"\">WALL STREET GAINS EARLY; PALANTIR TECHNOLOGIES RALLIES - CLICK HERE</p><p class=\"\">NASDAQ COMPOSITE: LOTS OF CHOP AS TRIES TO AVOID A BIGGER DROP - CLICK HERE</p><p class=\"\">WATCH OUT INVESTORS, IT'S THE YEAR OF THE SNAKE - CLICK HERE</p><p class=\"\">EQUITIES AND THE EURO: IT'S COMPLICATED - CLICK HERE</p><p class=\"\">A \"FASCINATING\" EARNINGS SEASON AHEAD FOR UK BANKS - CLICK HERE</p><p class=\"\">BACK TO EARNINGS - CLICK HERE</p><p class=\"\">EUROPE BEFORE THE BELL: HERE WE GO AGAIN - CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0Y3:0-sterling-swerves-tariff-wars/",
            "pub_date": "2025-02-05 02:06:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OU0T9:0",
            "title": "Investors on guard as US tariff threats evolve",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Investors grapple with evolving tariff situation</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Risks seen to US corporate profits from Canada, Mexico, China levies</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Some investors dubious of lasting trade dispute severely hitting markets</li></ul></span></div><span><p class=\"\">    Investors are seeking to protect portfolios from the potential economic fallout from President Donald Trump's tariff plans even as many on Wall Street doubt the situation will erupt into a sustained trade war that cripples assets.</p><p class=\"\">Announcements on tariffs have whipsawed markets this week as  investors try to wrap their heads around the evolving dispute. Sweeping tariffs Trump ordered on Saturday on Mexico and Canada were paused a month while tariffs were being imposed on China, which retaliated with levies of its own.</p><p class=\"\">Some investors have been preparing for the potential for tariffs that Trump vowed to put in place during his campaign, including moving to assets seen as less vulnerable to a trade dispute or geopolitical uncertainty more broadly. </p><p class=\"\">With stocks trading at lofty price-to-earnings ratios, investors also said the tariff news could warrant more caution for equities and create volatility in the near term.</p><p class=\"\">    At Nomura Capital Management, where stretched valuations for equities and other risk assets had already spurred the firm to become more defensive in recent months, the tariffs were further reason to be cautious, said Matt Rowe, head of portfolio management and cross-asset strategies.  </p><p class=\"\">With the tariff situation, \"it's really hard to see exactly where it's going to go, how long it will last,\" Rowe said. \"But it's easy to say that this is not good for growth, it's not good for consumer spending, and it's likely to have a negative impact on earnings.\"</p><p class=\"\">     The tariff developments caused big swings in equities and currencies on Monday, which retraced initial moves after news of the pauses on the Mexico and Canada tariffs.</p><p class=\"\">\"The threat of tariffs is live and that's unlikely to go away,\" said Michael Medeiros, macro strategist at Wellington Management, adding that the uncertainty could force the firm to explore more tactical, short-term trades.</p><p class=\"\">PROFIT SQUEEZE</p><p class=\"\">Analysts estimate that tariffs could drive up inflation while weighing on economic growth and corporate profits. Goldman Sachs strategists said Trump's tariffs announced on Saturday - 25% on Canada and Mexico and 10% on China - would reduce their S&amp;P 500 earnings forecasts by roughly 2-3%, while strategists at BofA Global Research said the earnings hit could be as much as 8%.</p><p class=\"\">\"If company managements decide to absorb the higher input costs, then profit margins would be squeezed,\" the Goldman equity strategists said in a note on Sunday. \"If companies pass along the higher costs to...end customers, then sales volumes may suffer.\"</p><p class=\"\">The onset of tariffs raised the risk of an S&amp;P 500 pullback of at least 5% early in the year, Lori Calvasina, head of U.S. equity strategy at RBC Capital Markets, said in a note on Sunday.</p><p class=\"\">Strategists at UBS Global Wealth Management on Monday maintained their view the S&amp;P 500 would end the year roughly 10% above current levels, but said \"tariffs are likely to represent an overhang on markets and contribute to volatility, at least until investors gain greater clarity on the path and destination of U.S. trade policy.\"</p><p class=\"\">The UBS strategists recommended gold as \"an effective hedge\" against geopolitical and inflation risks. </p><p class=\"\">Robeco added to its positions in safe havens gold and U.S. Treasuries late last week because of concerns about market complacency with respect to tariffs, said Colin Graham, the firm's head of multi-asset strategies.</p><p class=\"\">\"We’re in a worse position than we were on Friday,\" Graham said as he watched the initial market reaction unfold on Monday.</p><p class=\"\">FLUID SITUATION</p><p class=\"\">While the tariff threats lent support to some strategists' current allocations and encouraged others to make changes, many warned against knee-jerk reactions to Trump's announcements.</p><p class=\"\">Morgan Stanley equity strategists said the tariffs reinforced their preference for services industries, including financials, software, and media and entertainment, saying in a note on Monday that \"we would expect the market to rotate further toward services given recent trade policy implementation.\"</p><p class=\"\">Concerns about risks from tariffs and geopolitical uncertainty more broadly have led Manulife Investment Management in recent weeks to move into more defensive equity areas and reduce exposure to riskier high-yield credit, said Nathan Thooft, chief investment officer and senior portfolio manager at Manulife.</p><p class=\"\">\"But we’re advocating for people to remain fairly calm,\" Thooft said. \"This is still very fluid and the reality is we don’t know what the policies will be.\"</p><p class=\"\">Baker Avenue Wealth Management had been underweight healthcare stocks coming into 2025 but added exposure to the group in recent weeks because it seems to be relatively immune to tariff risk, said King Lip, the firm's chief strategist. Still, Lip said he thinks Trump recognizes the concerns a trade war brings for the economy and markets, so the situation will be \"ratcheted down in a reasonable amount of time.\"</p><p class=\"\">        Indeed, many investors remained doubtful that Trump would allow the tariff dispute to spiral into a full-blown trade war that severely damages asset prices. </p><p class=\"\">Spencer Hakimian, CEO of Tolou Capital Management, a New York-based macro hedge fund, said he was not making any changes to his investment portfolio based on the tariff announcements.</p><p class=\"\">“Trump is bluffing,\" Hakimian said. \"Fade all the noise.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OU0T9:0-investors-on-guard-as-us-tariff-threats-evolve/",
            "pub_date": "2025-02-05 02:07:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009253:0",
            "title": "DeepSeek Is Great News for TSMC Stock, J.P. Morgan Says — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Tae Kim</p><p class=\"\">The DeepSeek moment will benefit Taiwan Semiconductor Manufacturing's business prospects, according to J.P. Morgan.</p><p class=\"\">On Tuesday, analyst Gokul Hariharan reiterated his Overweight rating on TSMC stock, citing the growing excitement about Chinese start-up DeepSeek's recent artificial intelligence model releases.</p><p class=\"\">\"Faster model evolution should be positive for overall AI compute demand, \" the analyst wrote. \"In our view, [DeepSeek model] R1 unlocks another vector of scaling (reasoning or Chain-of-Thought), which could drive very rapid advances\" over the next 12 to 18 months.</p><p class=\"\">Reasoning is a newer technique where an AI model reflects on potential answers more thoroughly by going through many thought computations before reaching a higher quality answer.</p><p class=\"\">In early Tuesday trading, TSMC American depositary receipts rose by 2% to $203.88.</p><p class=\"\">In the wake of DeepSeek's new models released in late December and January, there have been questions about the computing capacity needed for AI inference — the process of generating results from AI models.</p><p class=\"\">The analyst downplayed worries that DeepSeek's model efficiency will crimp demand for AI. In fact, he believes the opposite is true, and that the advances will drive more data-center AI computing capacity going forward.</p><p class=\"\">\"We do not believe that frontier model creators are likely to slow down their AI capex spend,\" he wrote.</p><p class=\"\">Last month, TSMC reported a 57% rise in net profit for its December quarter, driven by strong demand for AI chips. TSMC is the main manufacturer of AI chips for Nvidia. It also makes the main processors inside Apple iPhones, Qualcomm mobile chipsets, and processors made by Advanced Micro Devices.</p><p class=\"\">TSMC saw \"robust AI-related demand from our customers,\" Chairman and Chief Executive C.C. Wei said on a call after the company's earnings report. Wei said revenue from AI-related chips will double in 2025, citing \"strong surging\" demand.</p><p class=\"\">Write to Tae Kim at tae.kim@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009253:0/",
            "pub_date": "2025-02-05 02:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coindar:8d44bb479094b:0",
            "title": "Oasis Network to Hold Live Stream on YouTube on February 7th",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1142.857142857143px;aspect-ratio:1.9047619047619047\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coindar:8d44bb479094b-dcb19e901d61e4fff619a70ba6d6f064-resized.webp\" type=\"images/webp\"/><img alt=\"Live\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coindar:8d44bb479094b-dcb19e901d61e4fff619a70ba6d6f064-resized.jpeg\" style=\"background-color:#453532\"/></picture></div></figure></span></p><p class=\"\">Oasis Network will host a live stream on YouTube on February 7th at 15:00 UTC.</p><p class=\"\">The discussion will be hosted by the Oasis, Mihnea Stefanescu community lead, focusing on team developments and insights.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ROSE Info</strong></p><p class=\"\">Oasis Network is a first-layer, scalable blockchain network with a focus on privacy and proof of stake. Through confidential computing, users can control and protect their data even when it's being utilized in various applications and services.</p><p class=\"\">The Oasis Network has the capacity to process a large number of transactions simultaneously due to its structure of subordinate parallel blockchains, also known as \"shards.\" Instead of processing all transactions on a single main blockchain (which is a common practice for many blockchain networks and causes speed and scalability issues), Oasis Network distributes transactions across different subordinate blockchains that can process transactions in parallel.</p><p class=\"\">The ROSE token serves as the governance token in the Oasis Network. The token is used for participating in voting on decisions related to network development and can also be staked to get rewards.</p></span></div>",
            "link": "https://www.tradingview.com/news/coindar:8d44bb479094b:0-oasis-network-to-hold-live-stream-on-youtube-on-february-7th/",
            "pub_date": "2025-02-05 02:08:07",
            "source": "Coindar",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "coindar:3f4860d0a094b:0",
            "title": "PancakeSwap to Hold Live Stream on YouTube on February 6th",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1142.857142857143px;aspect-ratio:1.9047619047619047\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/coindar:3f4860d0a094b-dedeac85e40e5783a991f60cab7f4eb0-resized.webp\" type=\"images/webp\"/><img alt=\"Live\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/coindar:3f4860d0a094b-dedeac85e40e5783a991f60cab7f4eb0-resized.jpeg\" style=\"background-color:#323a44\"/></picture></div></figure></span></p><p class=\"\">PancakeSwap will host a live stream on YouTube, featuring Lava Network on February 6th at 17:00 UTC.</p><p class=\"\"> Refer to the <strong class=\"root-Tkn6WL2y\">official tweet by CAKE:</strong> </p><div class=\"container-n2KCMK3i\" data-name=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">PancakeSwap</div><div class=\"username-n2KCMK3i\">@PancakeSwap</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\">🥞 A fresh stack of PancakeSwap updates is readyâ€”letâ€™s take a look!Â </p><p class=\"\">1/5 🧵⁰🔥 Pancake Talks x <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://twitter.com/lavanetxyz?ref_src=twsrc%5Etfw\" rel=\"nofollow\" target=\"_blank\">@lavanetxyz</a></p><p class=\"\">This Thursday, weâ€™re featuring Lava 🌋, the protocol enabling permissionless blockchain access, powered by incentives and quality of service.</p><p class=\"\">📅 Thursday, Feb 6 - 17:00â€¦ <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/sOdtvqxNT0\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/sOdtvqxNT0</a></p></div><span class=\"date-n2KCMK3i\">Feb 04, 2025</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/PancakeSwap/status/1886751549160087563\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">CAKE Info</strong></p><p class=\"\">PancakeSwap is a decentralized exchange (DEX) built on the Binance Smart Chain (BSC). It uses an automated market maker (AMM) model, which allows users to trade directly with a liquidity pool. These pools are filled by users who deposit their funds into the pool and receive liquidity provider (LP) tokens in return. Users can also earn rewards by providing liquidity or staking LP tokens. The native utility token of PancakeSwap is CAKE, which can be used for staking to earn rewards, participating in lotteries, and voting in governance decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/coindar:3f4860d0a094b:0-pancakeswap-to-hold-live-stream-on-youtube-on-february-6th/",
            "pub_date": "2025-02-05 02:08:08",
            "source": "Coindar",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:ffc78f1fdf20a:0",
            "title": "MATERION Corp VP Finance & CFO Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Chadwick Shelly Marie</td></tr><tr><td>Relationship</td><td>Vice President, Finance &amp; CFO</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$81,498</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1688289/000110465725000003/xslF345X05/wk-form4_1738692462.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Chadwick Shelly Marie, Vice President, Finance &amp; CFO of MATERION Corp, sold 805 shares of Common Stock on January 31, 2025, at a price of $101.24 per share, totaling $81,498. Following the transaction, Marie directly owns 14,632 shares of MATERION Corp. The sale was executed automatically under a Rule 10b5-1 trading plan adopted on November 1, 2024.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1688289/000110465725000003/xslF345X05/wk-form4_1738692462.xml\" rel=\"nofollow\" target=\"_blank\">MATERION Corp [ MTRN ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:ffc78f1fdf20a:0-materion-corp-vp-finance-cfo-sells-shares/",
            "pub_date": "2025-02-05 02:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009235:0",
            "title": "KKR Ups Bid for Fuji Soft to Compete With Bain Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">KKR shares slipped after it raised its tender offer price for Fuji Soft in a bidding war with Bain Capital.</p><p class=\"\">The stock fell 8% to $150.71. It's up about 62% over the past 12 months.</p><p class=\"\">The private equity company said it increased the tender offer price to 9,850 yen a share, which is equivalent to roughly $63.82. That is a 4% increase from its November offer of 9,451 yen, or $61.27.</p><p class=\"\">KKR increased the offer after Bain Capital said in December it could offer a tender price of 9,600 yen a share, higher than KKR's original offer. Fuji Soft's share price has more than doubled over the past year, and hit 9,990 yen on Tuesday.</p><p class=\"\">KKR said it upped its offer after considering Bain's proposed price and the fact that Fuji Soft's stock hasn't declined as expected.</p><p class=\"\">Fuji Soft, an information technology company based in Japan, is owned by investment funds managed by KKR.</p><p class=\"\">The tender offer period has also been extended to Feb. 19.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009235:0/",
            "pub_date": "2025-02-05 02:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009236:0",
            "title": "89bio Initiated at Outperform by Wolfe Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009236:0/",
            "pub_date": "2025-02-05 02:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009242:0",
            "title": "Crinetics Pharmaceuticals Initiated at Peer Perform by Wolfe Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009242:0/",
            "pub_date": "2025-02-05 02:02:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV109:0",
            "title": "Canadian dollar notches 13-day high as greenback slides",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Canadian dollar gains 0.6% against the greenback</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Posts its strongest since Jan. 22 at 1.4306</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Price of U.S. oil falls 0.9%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">2-year yield eases 2.4 basis points</li></ul></span></div><span><p class=\"\">    The Canadian dollar strengthened to a near two-week high against its U.S. counterpart on Tuesday, with the currency extending the gains it notched the day before when Canada avoided the immediate implementation of planned U.S. trade tariffs.</p><p class=\"\">The loonie  was trading 0.6% higher at 1.4345 to the U.S. dollar, or 69.71 U.S. cents, after earlier touching its strongest level since Jan. 22 at 1.4306.</p><p class=\"\">\"I think what we're seeing is a broader pullback for the U.S. dollar,\" said Marc Chandler, chief market strategist at Bannockburn Global Forex LLC.</p><p class=\"\">The U.S. dollar  fell against a basket of major currencies as President Donald Trump's tariff threats were interpreted more as a negotiating tactic rather than an end goal.</p><p class=\"\">On Monday, the loonie hit its weakest intraday level since April 2003 at 1.4793. That was before Trump suspended his threat of steep tariffs on Mexico and Canada, agreeing to a 30-day pause in return for concessions on border and crime enforcement with the two neighboring countries.</p><p class=\"\">\"The takeaway is that even if the tariffs aren't imposed this month that the disruption still to businesses and consumer sentiment may require the Bank of Canada to cut rates more than previously thought,\" Chandler said.</p><p class=\"\">Investors see a roughly 70% chance the Bank of Canada will ease further in March, after last month lowering the benchmark rate by 25 basis points to 3% to support the economy. (0#BOCWATCH)        </p><p class=\"\">The price of oil , one of Canada's major exports, was trading 0.9% lower at $72.52 a barrel due in part to ongoing tensions between the U.S. and China.</p><p class=\"\">Canadian bond yields were mixed across the curve. The 2-year (CA2T=RR) was down 2.4 basis points at 2.623% but holding well above the near three-year it hit during Monday's session at 2.459%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV109:0-canadian-dollar-notches-13-day-high-as-greenback-slides/",
            "pub_date": "2025-02-05 02:02:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0YZ:0",
            "title": "GM takes full control of Cruise in autonomous personal vehicle shift",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    General Motors  said on Tuesday it had completed the full acquisition of its Cruise business to focus on developing the autonomous technology for personal vehicles not robotaxis.</p><p class=\"\">The Detroit automaker said it plans to integrate the Cruise technology into its Super Cruise system, which allows drivers to operate the vehicle hands-off on 750,000 miles of roads in North America and is available on more than 20 GM vehicle models.</p><p class=\"\">GM said in December it would halt funding of the Cruise robotaxi business. This followed a year of trying to overcome challenges that arose after one of its robotaxis struck and seriously injured a pedestrian who had been hit by another vehicle.</p><p class=\"\">The merger will result in the reduction of 50% of Cruise's staff, said a Cruise spokesperson, who declined to specify the total number of employees affected.</p><p class=\"\">\"We are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles,\" the spokesperson said in a statement. </p><p class=\"\">The GM and Cruise teams will work on expanding Super Cruise to streets in urban environments, the company said.  </p><p class=\"\">Dave Richardson, senior vice president of software and services engineering, said that the move will \"accelerate our work on both assisted-driving and autonomous driving.\"  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0YZ:0-gm-takes-full-control-of-cruise-in-autonomous-personal-vehicle-shift/",
            "pub_date": "2025-02-05 02:02:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009244:0",
            "title": "BlackSky Technology Shares Rise on Imagery Contract From EMDYN",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Josh Beckerman</p><p class=\"\">Shares of BlackSky Technology rose as the space-based intelligence company said it received a multiyear contract from EMDYN to deliver space-based imagery services to international defense customers.</p><p class=\"\">The stock was up 15% to $17.48 Tuesday and is up about 59% this year.</p><p class=\"\">Last week, BlackSky reported a contract of more than $100 million from a \"long-term strategic partner in the international defense sector.\"</p><p class=\"\">The company said on Jan. 16 that it was selected as one of the vendors in a $200 million project for the National Geospatial-Intelligence Agency.</p><p class=\"\">Write to Josh Beckerman at josh.beckerman@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009244:0/",
            "pub_date": "2025-02-05 02:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009246:0",
            "title": "AnaptysBio Initiated at Outperform by Wolfe Research",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009246:0/",
            "pub_date": "2025-02-05 02:04:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009248:0",
            "title": "Zurich Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  UBS Group                      18,930,740        29.55        -2.24        -7.05 <br/>  GAM Holding                     4,160,170         0.09        +0.00        +2.24 <br/>  Nestle                          3,428,108        77.46        -0.40        -0.51 <br/>  Novartis                        3,324,451        95.59        -0.50        -0.52 <br/>  ABB                             2,444,563        49.35        +0.32        +0.65 <br/>  Julius Baer Gruppe              1,450,558        55.64        -0.50        -0.89 <br/>  Adecco Group                    1,208,520        21.86        +0.06        +0.28 <br/>  Roche Holding Part. Cert.         964,203       286.00        +0.30        +0.11 <br/>  Alcon                             723,688        82.80        -0.12        -0.14 <br/>  Financiere Richemont              719,620       176.30        +0.55        +0.31 <br/>  Clariant                          703,683        10.08        +0.10        +0.95 <br/>  Holcim                            648,288        90.44        -0.34        -0.37 <br/>  Aryzta                            646,665         1.78        -0.02        -1.33 <br/>  Sandoz Group                      605,258        42.29        -0.11        -0.26 <br/>  Swiss Re                          525,900       139.30        +0.45        +0.32 <br/>  SIG Group                         524,443        19.77        +0.06        +0.30 <br/>  OC Oerlikon                       487,297         3.50        -0.07        -2.01 <br/>  ams-OSRAM                         467,281         6.54        +0.09        +1.40 <br/>  SoftwareONE Holding               449,905         5.85        -0.03        -0.51 <br/>  Kuehne + Nagel Intl               329,019       201.60        -1.60        -0.79 <br/>  Swatch Group Bearer               328,799       165.70        -5.55        -3.24 <br/>  Logitech International            316,959        89.06        +0.44        +0.50 <br/>  Addex Therapeutics                315,814         0.06         0.00        -7.72 <br/>  Galderma Group                    300,725       115.58        +2.36        +2.08 <br/>  SGS                               291,833        87.60        +0.14        +0.16 <br/>  Straumann Holding                 247,461       127.55        +0.10        +0.08 <br/>  Lonza Group                       239,745       606.00        +8.40        +1.41 <br/>  Sika                              238,753       228.20        +0.60        +0.26 <br/>  Avolta                            237,963        41.08        -0.04        -0.10 <br/>  Zurich Insurance Group            236,217       557.00        +3.80        +0.69 <br/>  Ascom Holding                     193,662         3.28         0.00        -0.15 <br/>  EFG International                 157,872        13.74        -0.10        -0.72 <br/>  Sunrise Communications            150,025        45.68        -0.13        -0.28 <br/>  Bachem Holding                    149,489        56.65        -0.65        -1.13 <br/>  Accelleron Industries             148,153        44.06        -0.96        -2.13 <br/>  Sonova Holding                    146,859       305.20       -10.80        -3.42 <br/>  Georg Fischer                     142,891        70.70        -0.45        -0.63 <br/>  Idorsia                           139,717         0.73        +0.02        +2.54 <br/>  Temenos                           138,201        76.95        -0.45        -0.58 <br/>  Airesis                           126,148         0.06         0.00        -1.65 <br/>  Banque Cantonale Vaudoise         125,375        90.85        -0.30        -0.33 <br/>  Stadler Rail                      124,276        20.05        +0.09        +0.45 <br/>  Swatch Group Reg.                 120,444        32.45        -1.20        -3.57 <br/>  Swisscom                          116,348       506.00        -4.00        -0.78 <br/>  Cembra Money Bank                 114,763        89.50        -0.15        -0.17 <br/>  Helvetia Holding                   97,328       159.40        +0.20        +0.13 <br/>  Schindler Holding Cert.            96,660       258.40        -1.20        -0.46 <br/>  mobilezone holding                 91,315        11.64        +0.24        +2.11 <br/>  Implenia                           88,390        35.35        +1.10        +3.21 <br/>  R&amp;S Group Holding                  84,661        18.30         unch         unch <br/>Prices in Swiss Francs <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009248:0/",
            "pub_date": "2025-02-05 02:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009249:0",
            "title": "Analysts See Increase in U.S. Crude Oil Stockpiles",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anthony Harrup</p><p class=\"\">U.S. crude oil inventories likely rose for a second straight week along with a further build in gasoline stocks, according to a survey by The Wall Street Journal.</p><p class=\"\">Commercial crude stockpiles are expected to have grown by 1.3 million barrels to 416.4 million barrels in the week ended Jan. 31, according to the average estimate of seven analysts and traders. Five expect an increase and two predict a decline. Expectations range from a stock build of 3.6 million barrels to a withdrawal of 2.4 million barrels.</p><p class=\"\">Gasoline inventories are seen edging up by 100,000 barrels to 249 million barrels in what would be a 12th consecutive weekly increase. Gasoline estimates range from a rise of 2 million barrels to a drop of 3 million barrels.</p><p class=\"\">Stocks of distillate fuels, mostly diesel, are expected to have fallen by 1.6 million barrels to 122.4 million barrels, with forecasts ranging from a build of 1 million barrels to a decline of 3 million barrels.</p><p class=\"\">Refinery capacity use is estimated to have slipped by a tenth of a percentage point to 83.4%, with predictions ranging from a decline of 1.1 percentage points to an increase of 1.5 percentage points. One analyst didn't forecast refinery runs.</p><p class=\"\">The U.S. Energy Information Administration is scheduled to release the inventory data on Wednesday at 10:30 a.m. EST.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                   Crude  Gasoline Distillates Refinery Use <br/>   Again Capital                    -2.4      1.3     -1.2      -1.1 <br/>   Commodity Research Group          1.8      1.6     -1.1       1.5 <br/>   Rystad Energy                     3.6     -0.9     -2.2      -0.6 <br/>   Excel Futures                     3.2     -1.5     -2.1      -0.8 <br/>   Spartan Capital Securities        1.6      0.9     -2.6       n/f <br/>   Price Futures Group              -2.0     -3.0     -3.0       unch <br/>   Ritterbusch and Associates        3.0      2.0      1.0       0.6 <br/> <br/>   AVERAGE                           1.3      0.1     -1.6      -0.1 <br/> </pre><p class=\"\">Note: Numbers in millions of barrels, with the exception of refinery use, which is in percentage points.</p><p class=\"\">n/f = no forecast</p><p class=\"\">unch = unchanged</p><p class=\"\">Write to Anthony Harrup at anthony.harrup@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009249:0/",
            "pub_date": "2025-02-05 02:05:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446603:0",
            "title": "Silver Rises to 3-Month High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Silver rose above $32 per ounce in February, the highest in three months, tracking the preference for safety in other precious metals as markets assessed the global growth outlook under threats of trade wars.</p><p class=\"\">US President Trump followed through with 10% tariffs on China and 25% tariffs on Canada and Mexico, before delaying measures against North American neighbors.</p><p class=\"\">In the meantime, the JOLTS report indicated fewer job openings than expected in the US during December, while manufacturing orders declined sharply.</p><p class=\"\">Consequently, the market continued to bet on multiple rate cuts by the Fed this year, supporting the case for rate-sensitive assets.</p><p class=\"\">On the supply front, the Silver Institute recently forecasted a fifth consecutive year of significant market deficits for the metal in 2025, driven by strong industrial demand and retail investment.</p><p class=\"\">These factors are expected to outweigh weaker consumption in jewelry and silverware.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446603:0-silver-rises-to-3-month-high/",
            "pub_date": "2025-02-05 01:57:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009202:0",
            "title": "Robinhood Yanks Super Bowl Betting Contracts After Regulator's Pushback — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Alexander Osipovich, Hannah Erin Lang and Katherine Sayre</p><p class=\"\">Robinhood Markets said Tuesday that it was withdrawing its plans to offer betting contracts on the Super Bowl, following pushback from the Commodity Futures Trading Commission, which raised concerns that the contracts might be illegal.</p><p class=\"\">\"We were in regular contact with the CFTC prior to launching this product, and we believe we are in full compliance with all applicable regulations,\" said Robinhood General Counsel Lucas Moskowitz.</p><p class=\"\">Robinhood said it had been asked by the CFTC to stop offering its customers access to the sports contracts on Monday afternoon, just hours after it unveiled its sports-betting plans, a move that blurred the lines between regulated financial markets and gambling.</p><p class=\"\">Robinhood launched the contracts through a partnership with Kalshi, an online prediction market that listed a family of sports-betting contracts in January.</p><p class=\"\">CFTC-regulated prediction markets such as Kalshi are barred under federal law from listing contracts that involve \"gaming\" and are against the public interest, but the definition of \"gaming\" isn't spelled out in the law, which has led to disputes over what is permitted.</p><p class=\"\">Earlier Tuesday, a CFTC spokesman said the agency had \"serious concerns\" about brokers offering customers access to contracts that \"may not be permissible under the law.\" The agency \"will exercise its oversight authority to the fullest extent as appropriate,\" the spokesman added.</p><p class=\"\">Write to Alexander Osipovich at alexo@wsj.com, Hannah Erin Lang at hannaherin.lang@wsj.com and Katherine Sayre at katherine.sayre@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009202:0/",
            "pub_date": "2025-02-05 01:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}