{
    "data": [
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7743Ua:0",
            "title": "REG - Intl Con Airline Grp - Launch of €500 million Share Buyback Programme",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7743U  International Cons Airlines Group  27 February 2026   </span><p class=\"\"><span>  INTERNATIONAL CONSOLIDATED AIRLINES GROUP, S.A                </span></p><p class=\"\"><span>(\"IAG\" or the \"Company\")</span></p><p class=\"\"><span>Launch of €500 million Share Buyback Programme</span></p><p class=\"\"><span>As announced yesterday, 26 February 2026, IAG is launching a €500 million share buyback programme (the \"Programme\"), the purpose of which is to reduce the Company's share capital (subject to the approval of such reduction by the Company's shareholders).</span></p><p class=\"\"><span>The Programme will be carried out pursuant to the authorisation granted by the Annual General Meeting held on 19 June 2025.</span></p><p class=\"\"><span>Morgan Stanley Europe SE (\"MS\") and Goldman Sachs Bank Europe SE (\"GS\") have been engaged to implement the Programme, in sequential portions. MS and GS (and/or its delegates) will make the share purchases on the Company's behalf (acting as riskless principal and not as agent) and make all trading decisions independently of, and uninfluenced by, the Company, subject to certain parameters agreed between the Company and each of MS and GS prior to the commencement of the Programme.</span></p><p class=\"\"><span>Qatar Airways Group Q.C.S.C. (\"Qatar Airways\") has agreed to participate in the Programme on a pro rata basis in order to preserve its aggregate stake in IAG at the level held immediately prior to the implementation of the Company's recent share buyback programmes, the first of which was announced on 8 November 2024 (i.e. 25.1434% of IAG's voting rights). Under the arrangements entered into with MS and GS, Qatar Airways has agreed not to sell IAG shares in the market during the Programme. Instead, it will sell to MS and GS, as applicable, for on-sale to the Company, on each trading day a number of shares proportionate to the number of shares bought by such bank in the market on that day, at a price per share equal to the volume weighted average price at which such bank purchased such shares in the market on that day.</span></p><p class=\"\"><span>The Programme will be executed through purchases of shares from market participants and purchases of shares from Qatar Airways on the terms set forth above, in an aggregate amount of up to €500 million (€374 million for purchases from market participants and €126 million for purchases from Qatar Airways).</span></p><p class=\"\"><span>The Programme will start on 2 March 2026 and is expected to end no later than 29 May 2026, unless terminated by the Company, MS or GS, as applicable, in certain circumstances.</span></p><p class=\"\"><span>The Programme will be carried out in accordance with the provisions of the Market Abuse Regulation (EU) 596/2014 and Commission Delegated Regulation (EU) 2016/1052 (including as incorporated into UK law) regarding the exemption for buyback programmes, and will have the following characteristics:</span></p><p class=\"\"><span>a)    Regulated market: the shares will be purchased on both the London Stock Exchange and the Spanish Stock Exchanges (each an \"Exchange\").</span></p><p class=\"\"><span>b)    Maximum pecuniary amount allocated to the Programme: €500,000,000, with up to €374,283,000 allocated to purchases of shares from market participants.</span></p><p class=\"\"><span>c)    Maximum number of shares to be acquired pursuant to the Programme: up to 310,717,331 ordinary shares, which represent 6.57 per cent. of the Company's issued share capital as of today's date (27 February 2026).</span></p><p class=\"\"><span>d)    Consideration per share: the shares will be purchased at a price of no more than the lower of: (i) the higher of the price of the last independent trade and the highest then current independent purchase bid on the Exchange where the purchase is carried out, and (ii) 105 per cent. of the average market value of the shares for the five business days prior to the day the purchase is made.</span></p><p class=\"\"><span>e)    Maximum volume per trading session (including share purchases from both market participants and from Qatar Airways): no more than 25 per cent. of the average daily volume of the shares traded on the Exchange in the 20 trading days immediately preceding the date of purchase.</span></p><p class=\"\"><span>Shares acquired pursuant to the Programme will be held in treasury, subject to the approval of their cancellation at IAG's Annual General Meeting.</span></p><p class=\"\"><span>Nicholas Cadbury</span></p><p class=\"\"><span>Chief Financial and Sustainability Officer </span></p><p class=\"\"><span>27 February 2026</span></p><p class=\"\"><span>LEI: 959800TZHQRUSH1ESL13</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  MSCZZGZZDNZGVZM</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7743Ua:0-reg-intl-con-airline-grp-launch-of-500-million-share-buyback-programme/",
            "pub_date": "2026-02-27 22:27:57",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2946986:0",
            "title": "DHER: Strong Q4 2025 growth driven by Quick Commerce and AdTech, with robust 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw strong growth in revenue, profitability, and cash flow, with Quick Commerce and AdTech as key drivers. 2026 guidance anticipates moderate adjusted EBITDA growth and continued investments, with free cash flow expected slightly above EUR 200 million.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2946986:0-dher-strong-q4-2025-growth-driven-by-quick-commerce-and-adtech-with-robust-2026-outlook/",
            "pub_date": "2026-02-27 22:28:12",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2946991:0",
            "title": "BBOX: Major acquisitions, data center expansion, and strong rental growth drive 2030 earnings ambition",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong strategic progress and financial performance were delivered, with major acquisitions integrated, a new data center strategy launched, and robust rental growth achieved. The business targets 50% adjusted earnings growth by 2030, supported by disciplined capital allocation and a clear focus on sustainability.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2946991:0-bbox-major-acquisitions-data-center-expansion-and-strong-rental-growth-drive-2030-earnings-ambition/",
            "pub_date": "2026-02-27 22:28:35",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2946992:0",
            "title": "SREN: Record $4.8B net income, 20% ROE, higher dividend, and $1.5B buybacks highlight strong 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record net income of $4.8B and 20% ROE driven by disciplined underwriting, strong investments, and cost savings. Dividend raised 9% and $1.5B in buybacks announced, with continued focus on resilience and prudent cycle management for 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2946992:0-sren-record-4-8b-net-income-20-roe-higher-dividend-and-1-5b-buybacks-highlight-strong-2025/",
            "pub_date": "2026-02-27 22:28:47",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0NE:0",
            "title": "Shares in Brazil's Odontoprev, Bradesco jump on major healthcare deal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Shares in Brazil's Odontoprev </span><span> surged on Friday after controlling shareholder Banco Bradesco </span><span> said it would combine all its stakes in healthcare businesses under the dental insurer, which will be renamed Bradsaude.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Odontoprev shares jumped over 25% in early Sao Paulo trading, while shares in Bradesco rose around 3%.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The new healthcare conglomerate will include brands such as Bradesco Saude, Odontoprev and Atlantica Hospitais, Bradesco said in a securities filing.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>According to Bradesco, Bradsaude has estimated annual revenue of 52 billion reais ($10 billion) and would have posted more than 50% average annual profit growth since 2022.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bradesco, one of Brazil's largest private lenders, will hold a 91.35% stake in the firm.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Analysts at Itau BBA said the move would likely be accretive for Bradesco's capital, praising the rationale for creating a more independent vehicle in the sector.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>\"The new listed vehicle could help markets better appreciate the value of its healthcare operations, which have shown strong improvement in recent years,\" they said.</span></p></li></ul><p class=\"\"><span>($1 = 5.1623 reais)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0NE:0-shares-in-brazil-s-odontoprev-bradesco-jump-on-major-healthcare-deal/",
            "pub_date": "2026-02-27 22:28:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0X6:0",
            "title": "TotalEnergies mulls sale of German charging station business, The Pioneer reports",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    French oil major TotalEnergies  </span><span> is exploring the sale of its charging station business in Germany and is looking for a possible buyer, news site The Pioneer reported on Friday, citing a sales prospectus provided by consulting firm Roland Berger.</span></p><p class=\"\"><span>Total, which operates almost 80,000 EV charge points across Europe, is increasingly shifting to a partnership model as the pace of electrification is slower than the industry had hoped. </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total signed EV charging partnerships with La Banque des Territoires for France in October and Tikehau Capital </span><span> for Belgium and the Netherlands in February.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The sale prospectus for its German unit Total Energies Charging Solutions Deutschland mostly involves charging hubs being built under a government contract worth up to 152 million euros ($179 million), The Pioneer reported.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>A spokesperson for TotalEnergies said the company does not comment on market rumours.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The unit operates over 7,000 charging stations in Germany and is building over 1,250 charging parks in 167 locations as part of the government contract, according to Total.</span></p></li></ul><p class=\"\"><span>($1 = 0.8480 euros)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0X6:0-totalenergies-mulls-sale-of-german-charging-station-business-the-pioneer-reports/",
            "pub_date": "2026-02-27 22:28:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006521:0",
            "title": "Amazon's OpenAI Investment Part of Multi-Year Partnership — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Amazon's $50 billion investment in OpenAI is part of a new multi-year partnership between the two companies, combining OpenAI's models with Amazon's cloud services. The companies will create an environment powered by OpenAI models allowing Amazon Web Services customers to build generative AI applications and agents. The companies will also develop customized models for Amazon's customer-facing applications. Meanwhile, AWS will be the exclusive third-party cloud distribution provider for OpenAI Frontier, an enterprise platform for building, deploying, and managing AI agents. OpenAI will also consume 2 gigawatts of capacity of Amazon's Trainium chips. (nicholas.miller@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006521:0/",
            "pub_date": "2026-02-27 22:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2EO:0",
            "title": "Zurich Said To Near Beazley Deal Funded By Equity Sale Next Week - Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZURICH SAID TO NEAR BEAZLEY DEAL FUNDED BY EQUITY SALE NEXT WEEK - BLOOMBERG NEWS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZURICH INSURANCE IS LIKELY TO ANNOUNCE A FIRM, RECOMMENDED BID FOR BEAZLEY AS EARLY AS MONDAY - BLOOMBERG NEWS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ZURICH INSURANCE EXPECTED TO TAP INVESTORS FOR $3 BILLION TO $5 BILLION BY MARCH 4, LATEST DEADLINE TO MAKE OFFER FOR BEAZLEY - BLOOMBERG NEWS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2EO:0-zurich-said-to-near-beazley-deal-funded-by-equity-sale-next-week-bloomberg-news/",
            "pub_date": "2026-02-27 22:29:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACSCF8TTa:0",
            "title": "The Marketing Cloud Expands its AI-Enablement Platform Agent Cloud with Major Partner Integrations and Enterprise Features",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>New specialized AI agents from Limbik and Glystn, enhanced model support, and platform improvements accelerate adoption</span></p><p class=\"\"><span>NEW YORK CITY, NEW YORK / ACCESS Newswire / February 27, 2026 / The Marketing Cloud, a Stagwell company </span><span>, today announced significant expansions to Agent Cloud, its secure AI-driven, unified platform that simplifies access to the world's leading AI tools and purpose-built marketing assistants. Since its October 2025 launch, Agent Cloud has expanded AI integrations and enterprise controls while driving real impact, growing monthly agent interactions by 30% to more than 25,000 per month, supporting 500+ custom built agents, and increasing daily engagement time by 25%.</span></p><p class=\"\"><span>Building on Agent Cloud's debut with leading AI partners including OpenAI's ChatGPT, Anthropic's Claude, Google's Gemini and creative models NanoBanana and Veo, as well as xAI's Grok, the latest updates address critical enterprise needs while expanding Agent Cloud's specialized capabilities through strategic partnerships with leading AI companies Glystn, Limbik, Parallel, and Walt AI, alongside major platform enhancements that improve user experience and administrative control.</span></p><p class=\"\"><span>Agent Cloud now features newly launched AI integrations designed for advanced marketing intelligence:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Glystn Social Intelligence</span></strong><span> - Converts scattered social media signals into clear, actionable insights by analyzing real conversations from TikTok and Instagram, uncovering emerging cultural and consumer trends through semantic searches and identifying the specific creators driving trend spaces</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Glystn Creator Discovery</span></strong><span> - Enables comprehensive creator search and analysis across TikTok and Instagram through conversational queries, analyzing content, engagement patterns, and authenticity while vetting creators for brand safety considerations and competitor partnerships</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Limbik Resonance Agent</span></strong><span> - Leverages six years of behavioral data across 6,600+ audience segments in 60+ countries to predict message resonance in real-time, often delivering insights within 10 seconds</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Parallel AI Deep Research Integration</span></strong><span> - Transforms complex research queries into comprehensive, analyst-grade intelligence reports through automated web exploration and multi-step synthesis with inline citations and confidence metrics, delivering actionable insights on competitors and industry trends within minutes</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Walt AI Database Intelligence Integration</span></strong><span> - Unlocks client data and marketing databases for instant insights through natural language queries powered by ReasonBase™ semantic layer technology, enabling questions like, \"Which campaigns drove the highest ROI last quarter?\" with accurate answers and deterministic SQL generation across platforms like Snowflake and BigQuery</span></p></li></ul><p class=\"\"><span>Other platform improvements include comprehensive budget management with organization-level caps and role-based spending controls, alongside significant user experience enhancements including universal model switching that allows seamless transitions between Claude, OpenAI, Gemini, and Grok while preserving conversation context, plus universal file support for documents across all models.</span></p><p class=\"\"><span>\"These advancements represent our commitment to continuous innovation based on real user needs,\" said Elspeth Rollert, CEO at The Marketing Cloud. \"Since launch, we've seen tremendous user adoption across the marketing spectrum, especially from agencies who need both specialized AI capabilities and enterprise-grade controls. Agent Cloud continues to be the platform that combines leading AI models with the security and flexibility that modern marketers require to drive outcomes.\"</span></p><p class=\"\"><span>\"Agent Cloud has been pivotal in advancing our AI transformation,\" said Brent Diggins, Managing Director of Performance+Intelligence at Allison Worldwide. \"Its flexible, enterprise-grade platform with robust governance and ethical safeguards has enabled us to accelerate workflows, boost productivity, and meet the evolving needs of our teams and clients worldwide. The ability to build and deploy custom AI assistants makes Agent Cloud a true differentiator.\"</span></p><p class=\"\"><span>Agent Cloud enhancements are available immediately to existing users, with new specialized agents accessible through the platform's unified interface. To learn more and request a demo, visit www.themarketingcloud.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About The Marketing Cloud</span></strong></p><p class=\"\"><br/><span>The Marketing Cloud (formerly Stagwell Marketing Cloud) is a data-driven suite of AI-powered SaaS and service solutions built for the modern marketer. Powered by proprietary data and advanced tools spanning research, communications, creative, and media, it enables organizations to achieve measurable business outcomes by making smarter decisions, faster. The Marketing Cloud was born out of Stagwell's </span><span> award-winning network, known for delivering creative performance for ambitious brands.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Stagwell</span></strong></p><p class=\"\"><span>Stagwell is the global challenger network transforming marketing through AI. We deliver scaled creative performance for the world's most ambitious brands, connecting culture-moving creativity with leading-edge technology to harmonize the art and science of marketing. Led by entrepreneurs, our specialists in 45+ countries are unified under a single purpose: to drive effectiveness and improve business results for our clients. Join us at www.stagwellglobal.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact:</span></strong></p><p class=\"\"><span>Alyssa Bourne-Peters</span></p><p class=\"\"><span>PR Director, North America</span></p><p class=\"\"><span>Alyssa.Bourne-Peters@themarketingcloud.com</span></p><p class=\"\"><span>+1 917-592-9795</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Stagwell</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACSCF8TTa:0/",
            "pub_date": "2026-02-27 22:30:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006523:0",
            "title": "LatAm Political, Economic Calendar - Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>All dates are in local time </span><br/><span> </span><br/><span>Friday, February 27, 2026                                      Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>1000/1500/1000  COL  Jan      Unemployment </span><br/><span>               National Unemployment Rate               8.0% </span><br/><span> </span><br/><span>Sunday, March 1, 2026                                          Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>1000/1500/1000  PER  Jan      ACAE - Advance Economic Activities </span><br/><span>1000/1500/1000  PER  Feb      CPI </span><br/><span>                                 CPI, M/M%                                +0.10% </span><br/><span> </span><br/><span>Monday, March 2, 2026                                          Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0830/1130/0630  CHI  Jan      IMACEC monthly index of economic activity </span><br/><span>                                 Economic Activity Idx, Y/Y%              +1.7% </span><br/><span>1000/1300/0800  BRA  Feb      Brazil Manufacturing PMI </span><br/><span>                                 PMI, Mfg                                 47.0 </span><br/><span>0900/1500/1000  MEX  Feb      Mexico Manufacturing PMI </span><br/><span>    N/A         COL  Q4       Balance of Payments </span><br/><span>                                 Current Account (USD)                    -2.85B </span><br/><span> </span><br/><span>Tuesday, March 3, 2026                                         Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0500/0800/0300  BRA  Feb      Fipe Monthly CPI </span><br/><span>                                 CPI, M/M%                                +0.21% </span><br/><span>0900/1200/0700  BRA  Q4       GDP </span><br/><span>                                 GDP, Q/Q%                                +0.1% </span><br/><span>                                 GDP, Y/Y%                                +1.8% </span><br/><span>1000/1500/1000  COL  Jan      External Trade - Exports </span><br/><span>                                 Exports, Y/Y%                            +1.3% </span><br/><span>                                 Exports (USD)                            4.54B </span><br/><span> </span><br/><span>Wednesday, March 4, 2026                                       Exp        Prev </span><br/><span> Local/GMT/ET </span><br/><span>0900/1200/0700  BRA  Jan      PPI </span><br/><span>1000/1300/0800  BRA  Feb      Brazil Services PMI </span><br/><span>                                 PMI, Services                            51.3 </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006523:0/",
            "pub_date": "2026-02-27 22:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_AQN2LO36S:0",
            "title": "BRIEF-Toronto Stock Exchange falls at open",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, Feb 27 (Reuters) - Toronto Stock Exchange S&amp;P/TSX composite index </span><span>:</span></p><p class=\"\"><span>* Falls 87.62 points, or 0.25 percent, to 34,414.34 at open.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_AQN2LO36S:0-brief-toronto-stock-exchange-falls-at-open/",
            "pub_date": "2026-02-27 22:30:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2HN:0",
            "title": "Swiss financial watchdog says liquidation order for MBaer Merchant Bank AG is effective",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Swiss financial regulator FINMA said on Friday that a liquidation order for MBaer Merchant Bank AG was now effective after Washington threatened to cut the Swiss private bank's access to the U.S. financial system for breaching sanctions against Iran, Russia and Venezuela.</span></p><p class=\"\"><span>FINMA had concluded enforcement proceedings against MBaer three weeks ago, but due to an MBaer appeal, which the bank withdrew on Friday, FINMA previously was unable to implement its own measures, it said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2HN:0-swiss-financial-watchdog-says-liquidation-order-for-mbaer-merchant-bank-ag-is-effective/",
            "pub_date": "2026-02-27 22:30:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN0WB:0",
            "title": "Asia spot prices down on tepid demand; Hormuz risk in focus ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Geopolitical risks rise with US-Iran tensions affecting LNG markets</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Strait of Hormuz crucial for global LNG shipments, potential disruptions impactful</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Mild winter and high inventories pressure Asia LNG demand</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>European gas storage hits seasonal lows, rebuilding stocks poses challenge</span></li></ul></span></div><span><p class=\"\"><span>By Marwa Rashad</span></p><p class=\"\"><span>Asia spot liquefied natural gas prices fell this week as mild winter and high inventories lowered demand and amid concerns about a potential collapse of US-Iran negotiations which could trigger a military escalation in the Middle East. </span></p><p class=\"\"><span>The average LNG price for April delivery into north-east Asia (LNG-AS) was estimated at $10.40 per million British thermal units (mmBtu), compared with $10.60/mmBtu in the previous week, industry sources said.</span></p><p class=\"\"><span>\"Fundamentally, the market is weak in north Asia with almost no demand from China whatsoever...marginal procurement appears limited,\" said Toby Copson, managing partner at Davenport Energy</span></p><p class=\"\"><span>\"There is some intraday volatility coming from the U.S.-Iran talks and the broader geopolitical landscape. However, in physical markets most of that premium has been absorbed and priced in,\" he said.</span></p><p class=\"\"><span>Most of the Asian spot demand has emerged from south and south-east Asia as price levels are palatable for many buyers in the region, said Martin Senior, head of LNG pricing at Argus.</span></p><p class=\"\"><span>     The Strait of Hormuz between Oman and Iran carries roughly one‑fifth of global LNG shipments, most of which originate from Qatar, the world’s major LNG exporter. </span></p><p class=\"\"><span>\"If Qatar were unable to export LNG cargoes because of infrastructure damage or shipping impairments, the effect on global gas prices would be dramatic,\" said Florence Schmit, energy strategist at Rabobank</span></p><p class=\"\"><span>\"While a loss of Qatari supply would hit Asian markets directly, the price rally in Europe would likely be even more pronounced,\" she added.</span></p><p class=\"\"><span>In Europe, wholesale gas prices were up on Friday afternoon, as traders braced for possible U.S. military action in the Middle East, but weak demand and warmer temperatures curbed the upside.</span></p><p class=\"\"><span>European gas storage continued has continued to go down, with inventories hitting fresh seasonal lows. As winter fades, Europe faces the challenge of rebuilding stocks from comparatively lean levels, said Aly Blakeway, manager of Atlantic LNG at S&amp;P Global Energy.</span></p><p class=\"\"><span>S&amp;P Global Energy assessed its daily Northwest Europe LNG Marker (NWM) price benchmark for cargoes delivered in April on an ex-ship (DES) basis at $9.876/mmBtu on February 26, a $1.17/mmBtu discount to the price at the TTF hub.</span></p><p class=\"\"><span>Argus assessed it at $10.11/mmBtu, while Spark Commodities assessed the March price at $9.987/mmBtu.</span></p><p class=\"\"><span>Hedge funds appear to be taking a step back from trading TTF gas futures, said independent analyst Seb Kennedy.</span></p><p class=\"\"><span>\"In a rare move, funds left their net long position virtually unchanged for two consecutive weeks. Concurrently, the number of funds actively trading TTF has dropped by 10% since hitting a record high of 465 in mid-January,\" he said.</span></p><p class=\"\"><span>In global LNG freight, Atlantic rates rose to $42,750/day, and Pacific were stable at $28,250/day, said Spark Commodities analyst Qasim Afghan.</span></p><p class=\"\"><span>     The U.S. front-month arbitrage to north-east Asia via the Cape of Good Hope has narrowed this week but it is still pointing U.S. prompt cargoes to Europe, he said. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN0WB:0-asia-spot-prices-down-on-tepid-demand-hormuz-risk-in-focus/",
            "pub_date": "2026-02-27 22:30:43",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0NO:0",
            "title": "Belgian watchdog opens probe into Google's online ad price practices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Belgium's competition watchdog said on Friday it had opened an investigation into the sale of online ads by Google </span><span>.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The competition authorities said they had \"serious indications\" that Google's model for selling online ads was in breach of antitrust rules, as the company appeared to be abusing its market power.</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The investigation is in a preliminary phase and the outcome is unclear, they said.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Google is already the subject of several European Union antitrust investigations and has been fined billions of euros in Europe for antitrust violations in recent years.</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Earlier this month, in a letter to advertisers, Google said it also risked another antitrust investigation by the European Commission over concerns it may be unfairly driving online advertising prices higher.</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Google, which dominates the multibillion-dollar online advertising market, said at the time that Google Search ads help small businesses to compete with the biggest brands and keep the web free for everyone.</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0NO:0-belgian-watchdog-opens-probe-into-google-s-online-ad-price-practices/",
            "pub_date": "2026-02-27 22:18:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006458:0",
            "title": "Ten-Year Treasury Yield Falls Below 4% — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Sam Goldfarb</span></p><p class=\"\"><span>U.S. government bond prices rallied Friday, pushing the yield on the 10-year U.S. Treasury note below 4% for the first time since November. The move coincided with declines in U.S. stock futures and held in morning trading, despite the release of hotter-than-expected wholesale inflation data.</span></p><p class=\"\"><span>Yields, which fall when bond prices rise, have been on a steady decline for most of the month, driven in part by demand for safer assets amid volatility in the stock market.</span></p><p class=\"\"><span>Lower Treasury yields have helped pull down other borrowing costs. The average rate for a 30-year fixed mortgage slipped below 6% this week for the first time in more than three years.</span></p><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006458:0/",
            "pub_date": "2026-02-27 22:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN1QM:0",
            "title": "Century Therapeutics Inc expected to post a loss of 28 cents a share - Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Century Therapeutics Inc </span><span> is expected to  show a fall in quarterly revenue when it reports  results on March 2 (estimated) for the period ending December 31 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>​LSEG's mean analyst estimate for Century Therapeutics Inc is for a loss of 28 cents per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\"  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months. ​</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Century Therapeutics Inc is $4.00, about 78.6% above its last closing price of $2.24</span></p></li></ul><p class=\"\"><span>Previous quarterly performance (using preferred earnings measure in US dollars). ​</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>STARMINESMARTESTIMATE®</span></p></td><td><p class=\"\"><span>LSEG IBES ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td><td><p class=\"\"><span>SURPRISE %</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025</span></p></td><td><p class=\"\"><span>-0.31</span></p></td><td><p class=\"\"><span>-0.34</span></p></td><td><p class=\"\"><span>-0.32</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>5.2</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025</span></p></td><td><p class=\"\"><span>-0.38</span></p></td><td><p class=\"\"><span>-0.38</span></p></td><td><p class=\"\"><span>-0.38</span></p></td><td><p class=\"\"><span>Met</span></p></td><td><p class=\"\"><span>-1.1</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025</span></p></td><td><p class=\"\"><span>0.05</span></p></td><td><p class=\"\"><span>0.06</span></p></td><td><p class=\"\"><span>0.89</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>1,518.2​</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2024</span></p></td><td></td><td><p class=\"\"><span>-0.42</span></p></td><td><p class=\"\"><span>-0.43</span></p></td><td><p class=\"\"><span>Missed</span></p></td><td><p class=\"\"><span>-1.9</span></p></td></tr><tr><td><p class=\"\"><span>​​Sep. 30 2024</span></p></td><td><p class=\"\"><span>-0.44</span></p></td><td><p class=\"\"><span>-0.45</span></p></td><td><p class=\"\"><span>-0.37</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>17.4</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2024</span></p></td><td><p class=\"\"><span>-0.47</span></p></td><td><p class=\"\"><span>-0.46</span></p></td><td><p class=\"\"><span>-0.38</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>17.6​</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2024</span></p></td><td><p class=\"\"><span>-0.52</span></p></td><td><p class=\"\"><span>-0.50</span></p></td><td><p class=\"\"><span>-0.45</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>10.4</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2023</span></p></td><td><p class=\"\"><span>-0.46</span></p></td><td><p class=\"\"><span>-0.55</span></p></td><td><p class=\"\"><span>-0.65</span></p></td><td><p class=\"\"><span>Missed</span></p></td><td><p class=\"\"><span>-17.3</span></p></td></tr></tbody></table></div><p class=\"\"><span>This summary was machine generated February 27 at 14:19 GMT.  All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN1QM:0-century-therapeutics-inc-expected-to-post-a-loss-of-28-cents-a-share-earnings-preview/",
            "pub_date": "2026-02-27 22:19:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2C2:0",
            "title": "Nidec Says Received Investigation Report From Third-Party Committee Probing Inappropriate Accounting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Nidec Corp </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NIDEC: RECEIVED INVESTIGATION REPORT FROM THIRD-PARTY COMMITTEE PROBING INAPPROPRIATE ACCOUNTING</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2C2:0-nidec-says-received-investigation-report-from-third-party-committee-probing-inappropriate-accounting/",
            "pub_date": "2026-02-27 22:19:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006461:0",
            "title": "Nymex Palladium Delivery Intentions Breakdown - Feb 27",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>Source: CME Group </span><br/><span>MARCH 2026 PALLADIUM FUTURES NYMEX </span><br/><span>INTENT DATE:   02/26/2026          DELIVERY DATE: 03/02/2026 </span><br/><span> </span><br/><span>FIRM    ORG   FIRM NAME                   ISSUED     STOPPED </span><br/><span>072      C    GOLDMAN                                      2 </span><br/><span>072      H    GOLDMAN                                      6 </span><br/><span>099      H    DEUTSCHE BANK AG                             6 </span><br/><span>104      C    MIZUHO SECURITIES US                         1 </span><br/><span>118      H    MACQUARIE FUTURES US                         3 </span><br/><span>132      C    SG AMERICAS                                  2 </span><br/><span>152      C    DORMAN TRADING, LLC              9 </span><br/><span>190      H    BMO CAPITAL MARKETS                          6 </span><br/><span>323      C    HSBC                            15 </span><br/><span>323      H    HSBC                                         6 </span><br/><span>332      H    STANDARD CHARTERED B                         1 </span><br/><span>363      H    WELLS FARGO SECURITI                         6 </span><br/><span>624      H    BOFA SECURITIES                              4 </span><br/><span>657      C    MORGAN STANLEY                               6 </span><br/><span>657      H    MORGAN STANLEY                               6 </span><br/><span>661      C    JP MORGAN SECURITIES                        10 </span><br/><span>686      C    STONEX FINANCIAL INC                         4 </span><br/><span>686      H    STONEX FINANCIAL INC                         6 </span><br/><span>690      C    ABN AMRO CLR USA LLC            50 </span><br/><span>732      C    RBC CAP MARKETS                  4 </span><br/><span>737      C    ADVANTAGE FUTURES                5           1 </span><br/><span>880      C    CITIGROUP                                    7 </span><br/><span>905      C    ADM                              4           4 </span><br/><span>                            TOTAL:            87          87 </span><br/><span>                    MONTH TO DATE:                        87 </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>Write to Linda Rice at csstat@dowjones.com </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006461:0/",
            "pub_date": "2026-02-27 22:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006464:0",
            "title": "CW BANCORP Quarterly Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>IRVINE, Calif., Feb. 27, 2026 /PRNewswire/ — CW BANCORP </span><span>, the parent company of CommerceWest Bank announced the approval of a quarterly cash dividend by its Board of Directors. The Board of Directors declared a cash dividend of $0.23 per common share, payable April 1, 2026 to shareholders of record on March 13, 2026.</span></p><p class=\"\"><span>CommerceWest Bank is determined to redefine banking for small and medium sized businesses by delivering on customized products and services. Founded in 2001 and headquartered in Irvine, California, the Bank serves businesses throughout the state of California with our digital banking platform. By employing a strategically selected team of experienced professionals, we will provide flexibility, create a complete, safe and sound banking experience for each client. We provide a wide range of commercial banking services, including, remote deposit solution,  NetBanker online banking, mobile banking, lines of credit, M&amp;A / working capital loans, commercial real estate loans, SBA loans and treasury management services.</span></p><p class=\"\"><span>Mission Statement: CommerceWest Bank will create a complete banking experience for each client, catering to businesses and their specific banking needs, while accommodating our clients and providing them high-quality, low stress and personally tailored banking and financial services.</span></p><p class=\"\"><span>Please visit www.cwbk.com to learn more about the bank. \"BANK ON THE DIFFERENCE\"</span></p><p class=\"\"><span>Statements concerning future performance, developments or events, expectations for growth and income forecasts, and any other guidance on future periods, constitute forward-looking statements that are subject to a number of risks and uncertainties. Actual results may differ materially from stated expectations. Specific factors include, but are not limited to, loan production, balance sheet management, expanded net interest margin, the ability to control costs and expenses, interest rate changes, financial policies of the United States government and general economic conditions. The Company disclaims any obligation to update any such factors or to publicly announce the results of any revisions to any forward-looking statements contained in this release to reflect future events or developments.</span></p><p class=\"\"><span>View original content to download multimedia:https://www.prnewswire.com/news-releases/cw-bancorp-quarterly-cash-dividend-302699258.html</span></p><p class=\"\"><span>SOURCE CW Bancorp</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006464:0/",
            "pub_date": "2026-02-27 22:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_EduzhtQ9a:0",
            "title": "REG - Euronext Dublin - GEM_MSF_EARLY REDEMPTION_27-02-2026 (MORGAN STANLEY FINANCE LLC) [89301]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89301</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_EduzhtQ9a:0-reg-euronext-dublin-gem_msf_early-redemption_27-02-2026-morgan-stanley-finance-llc-89301/",
            "pub_date": "2026-02-27 22:20:16",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN1QT:0",
            "title": "Cassava Sciences Inc expected to post a loss of 30 cents a share - Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cassava Sciences Inc </span><span> is expected to  show no change in quarterly revenue when it reports  results on March 2 (estimated) for the period ending December 31 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>​LSEG's mean analyst estimate for Cassava Sciences Inc is for a loss of 30 cents per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The one available analyst rating on the shares is \"buy\".  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months. ​</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Cassava Sciences Inc is $5.00, about 112.8% above its last closing price of $2.35</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN1QT:0-cassava-sciences-inc-expected-to-post-a-loss-of-30-cents-a-share-earnings-preview/",
            "pub_date": "2026-02-27 22:20:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN0TH:0",
            "title": "Xiaomi launches safety advisory committee after EV accidents in China",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Chinese electric vehicle maker Xiaomi </span><span> said on Friday that it will set up a committee of advisers to assess the safety of its cars, as it moves to combat rising criticism over a recent spate of accidents.</span></p><p class=\"\"><span>The company also plans to hold regular meetings with car owners, media and experts to hear their suggestions regarding the safety of its vehicles, with the first session set for the first half of this year, Hou Jinglei, head of Xiaomi's EV safety department, said during a livestream at the company's EV factory in Beijing.</span></p><p class=\"\"><span>The EV maker has a safety team of more than 3,500 people, including an internal investigation centre to review accidents.</span></p><p class=\"\"><span>In a fatal crash in October involving a Xiaomi SU7 sedan, the car's doors became inoperable due to a power outage after a collision with another vehicle and the driver was burned to death, Chinese media Caixin reported this week, citing a forensic report.</span></p><p class=\"\"><span>Chinese news provider Yicai, which also reported the forensic findings, ran a commentary on Friday urging Xiaomi to recall all first-generation SU7s to \"completely eliminate door handle hazards.\"</span></p><p class=\"\"><span>Xiaomi did not respond to a request for comment on the reports.</span></p><p class=\"\"><span>An earlier crash involving an SU7 travelling in driving assistance mode and in which three people were killed remains under investigation.</span></p><p class=\"\"><span>Official accounts of the two accidents have yet to be released.</span></p><p class=\"\"><span>Xiaomi issued a software update for more than 115,000 SU7s over assisted driving issues in September.</span></p><p class=\"\"><span>The company has discontinued production of the first-generation SU7 and is set to launch in April an upgraded version of its best-selling sedan with a backup power supply for the doors.</span></p><p class=\"\"><span>Deliveries of the SU7, a rival to Tesla's Model 3, had exceeded 381,000 vehicles as of February.</span></p><p class=\"\"><span>Widely reported accidents have led to tighter regulations on marketing and safety standards for assisted driving. Regulators have also decided to phase out hidden car door handles from 2027 and are considering EV acceleration limits.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN0TH:0-xiaomi-launches-safety-advisory-committee-after-ev-accidents-in-china/",
            "pub_date": "2026-02-27 22:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZF09I:0",
            "title": "Saudi Aramco bringing shale gas revolution to Arabian Desert",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Saudi Aramco betting on $100 billion Jafurah natural gas project</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Aims to be a major global natural gas player</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US, Chinese firms bring shale techniques, Aramco adapts for desert conditions</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Saudi gas drilling rose last year after oil capacity U-turn</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Jafurah could yield up to 1 million bpd in condensates, source says</span></li></ul></span></div><span><p class=\"\"><span>By Yousef Saba</span></p><p class=\"\"><span>    The shale revolution that made the United States the world's top oil producer is taking shape in the Arabian Desert. </span></p><p class=\"\"><span>Deep in the sands southeast of Saudi Arabia's giant Ghawar oilfield, state oil company Aramco </span><span> is pushing ahead with a natural gas megaproject that could boost the kingdom’s revenues by billions of dollars in the coming years.</span></p><p class=\"\"><span>It has brought in U.S. and Chinese firms like Halliburton </span><span> and Sinopec </span><span> to deploy advanced machinery - including 'walking rigs', towering structures capable of moving short distances without dismantling and reassembling - to speed up drilling and well completions at the Jafurah basin. </span></p><p class=\"\"><span>While the kingdom has scaled back its futuristic giga-projects and reversed plans to lift oil capacity, Aramco - the world's biggest oil exporter - has raised its gas production targets with this $100 billion bet at the centre, as it seeks to become a major global natural gas player. </span></p><p class=\"\"><span>Jafurah, estimated to contain 229 trillion standard cubic feet of raw gas and 75 billion barrels of condensate, is potentially the biggest shale gas development outside the U.S.     </span></p><p class=\"\"><span>For decades, Saudi Arabia has burned a portion of its most valuable asset – crude oil – to power its grid. Now, with fewer than five years left to fulfil Crown Prince Mohammed bin Salman’s Vision 2030 agenda to diversify the oil-reliant economy, the pressure is on to replace those liquid fuels with gas.</span></p><p class=\"\"><span>\"Jafurah is not just a large gas field: it is a strategic platform that supports the Kingdom's broader growth ambitions across key sectors, including energy, artificial intelligence, and major industries like petrochemicals,\" Aramco said in a statement in response to Reuters questions.</span></p><p class=\"\"><span>NEW SHALE FRONTIER</span></p><p class=\"\"><span>On Thursday, Aramco officially announced the start of production at Jafurah, a milestone for a project that underwent years of incubation mirroring the early years of the U.S. shale boom. It said output began in December 2025, a disclosure that Reuters reported that month after it was included in the Saudi finance ministry budget statement.</span></p><p class=\"\"><span>\"The excellent progress at Jafurah is a testament to a decade of relentless innovation and focus on value creation,\" Aramco’s Upstream President Nasir Al-Naimi told Reuters.</span></p><p class=\"\"><span>“Early well performance has been outstanding, validating our high-tech approach and reaffirming the significance of this flagship project to our gas growth strategy.”</span></p><p class=\"\"><span>The maths is simple: Saudi Arabia uses more than 1 million barrels per day (bpd) of crude and fuel oil for domestic power generation. Aramco aims to replace 500,000 bpd of that by 2030 with gas, freeing up the crude for export. At current prices of around $70 a barrel, 500,000 bpd of crude would generate nearly $12.8 billion in revenue a year.</span></p><p class=\"\"><span>In its statement on Thursday, Aramco said it expects the gas expansion to generate incremental operating cash flows of $12 billion to $15 billion in 2030.</span></p><p class=\"\"><span>\"Through our strategic gas expansion, we anticipate attractive double-digit returns as we set about unlocking significant volumes of high-value liquids and capitalize upon captive domestic gas demand,\" Al-Naimi told Reuters.</span></p><p class=\"\"><span>Reuters analysis of rig data from Baker Hughes, tender awards, and corporate filings reveals that Jafurah has emerged as the kingdom’s priority capital project and a new frontier for U.S. oilfield services firms just as the U.S. shale boom matures and they look for opportunities elsewhere.</span></p><p class=\"\"><span>Jafurah offers a rare prize: a massive, untapped unconventional basin requiring the hydraulic fracturing and horizontal drilling expertise perfected in Texas. </span></p><p class=\"\"><span>Rig count data shows that while activity in the U.S. Permian Basin has plateaued, gas drilling in Saudi Arabia has increased as development of Jafurah picked up and capital was redeployed after the kingdom scrapped a previously planned 1 million-bpd oil capacity expansion.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:852.0000000000001px;aspect-ratio:1.4200000000000002\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZF09I-bb05aaba102587a02b27973903f4b44e-resized.webp\" type=\"image/webp\"/><img alt=\"Chart showing divergence in Saudi oil vs rig counts\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZF09I-bb05aaba102587a02b27973903f4b44e-resized.webp\" style=\"background-color:#faf7f6\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Saudi Arabia's rig divergence</span></figcaption></figure><p class=\"\"><span>Aramco has announced around $26 billion worth of contracts for Jafurah's first two phases since 2018, when it awarded Halliburton a contract for unconventional so-called gas stimulation, usually fracking. Other first-phase contracts went to Sinopec, South Korea's Samsung Engineering and Italy's Saipem </span><span>.</span></p><p class=\"\"><span>To make shale extraction viable in the punishing desert environment, its engineers have also developed bespoke technology, according to company journals. Solutions include treating Gulf seawater to remove well-clogging sulphates for underground injection and ultra-strong diamond drill bits to cut through abrasive rock without overheating.</span></p><p class=\"\"><span>PRODUCTION TARGETS REVISED UP</span></p><p class=\"\"><span>Aramco is targeting 2 billion standard cubic feet per day (bcfd) of gas from Jafurah, 420 million standard cfd of ethane, and 630,000 bpd of associated liquids by 2030.</span></p><p class=\"\"><span>At its peak, Jafurah could produce up to 1 million bpd of condensates, a source with knowledge of the matter told Reuters. Condensates are non-gas liquids that can be processed to produce petrochemical feedstock naphtha and other refined products.</span></p><p class=\"\"><span>In November, Aramco said it was raising its kingdom-wide gas expansion goal to 80% above 2021 levels, from a 60% targeted boost announced in March 2024. Based on the company's 2021 baseline of 9.2 bcfd, Reuters calculations show the revision means Aramco aims to pump nearly 2 bcfd extra by the end of the decade, which is the same volume Aramco has targeted from the Jafurah project. </span></p><p class=\"\"><span>Some industry analysts, however, have questions about the pace of the ramp-up. Aramco had previously said Jafurah was expected to come online in early 2024.</span></p><p class=\"\"><span>\"There is still a lot of uncertainty around the pace of ramp-up and how much of the condensates will be exported or used as feedstock,\" said Monica Malik, chief economist at ADCB.</span></p><p class=\"\"><span>She projected that revenue from Jafurah could add 0.3% to Saudi GDP growth in 2026.</span></p><p class=\"\"><span>REGIONAL RIVALS ALSO ON THE MOVE</span></p><p class=\"\"><span>The gas expansion is designed to extend the lifespan of Saudi Arabia's hydrocarbon revenues, which still account for more than half of the state budget, while positioning Riyadh to benefit from booming Asian demand, said Neil Quilliam, associate fellow at think tank Chatham House.</span></p><p class=\"\"><span>While it frees up crude for export, Aramco is also building a global liquefied natural gas portfolio by investing in projects abroad. It has taken a stake in LNG firm MidOcean and signed 20-year supply agreements for supplies from Commonwealth LNG's proposed Louisiana project and NextDecade's Rio Grande terminal in Texas.</span></p><p class=\"\"><span>Aramco's focus on gas comes as Qatar - whose reserves are conventional and so easier to extract than shale - pushes ahead with its own production expansion, aiming to cement its regional gas supremacy. Abu Dhabi National Oil Company is also making a big push into gas and LNG domestically and abroad.</span></p><p class=\"\"><span>The International Energy Agency and some market participants expect a surge of new Qatari and U.S. LNG this decade that could create a global supply glut and depress prices. Aramco's long-term ambition is LNG capacity of 20 million tons per annum (mtpa), Chief Executive Amin Nasser told analysts in August. Qatar has 77 mtpa of capacity, expected to reach 142 mtpa by 2030, while ADNOC targets 20 to 25 mtpa by 2035.</span></p><p class=\"\"><span>Aramco expects domestic gas demand, meanwhile, to continue to rise, driven by industrial growth encompassing manufacturing, mining, and petrochemicals, Al-Naimi told Reuters.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZF09I:0-saudi-aramco-bringing-shale-gas-revolution-to-arabian-desert/",
            "pub_date": "2026-02-27 22:20:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3Z50X8:0",
            "title": "GKN cancels plans for magnet factory in setback for Europe's rare earth aims",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>GKN Powder Metallurgy is being taken over by US auto supplier</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Factory was among only a handful planned for Europe</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Low-cost competition from China makes profitability hard to achieve</span></li></ul></span></div><span><p class=\"\"><span>By Eric Onstad</span></p><p class=\"\"><span>    GKN Powder Metallurgy has scrapped plans to produce rare earth permanent magnets in Europe, three sources with knowledge of the matter said, highlighting the region's difficulty in creating a domestic rare earths industry to compete with dominant producer China.</span></p><p class=\"\"><span>China controls 90% of rare earth processed output and 70% of mining production. Europe has been criticised for lagging behind the U.S. in offering financial support for projects to develop its own supplies. </span></p><p class=\"\"><span>The plans by GKN PM to make rare earth magnets - used in EVs, electronics and defence applications - were dropped late last year ahead of the finalisation of a takeover by a U.S. auto supplier because it was regarded as a non-core activity with an uncertain profit outlook, one of the sources said.</span></p><p class=\"\"><span>A second source said GKN was evaluating what to do with a pilot magnet plant it had built and was assessing options.</span></p><p class=\"\"><span>The sources declined to be identified because the information had not been made public.</span></p><p class=\"\"><span>GKN PM declined to comment.</span></p><p class=\"\"><span>HANDFUL OF MAGNET FACTORIES BEING PLANNED</span></p><p class=\"\"><span>The proposed GKN PM magnet factory was among only a handful of such plants operating or being planned in Europe.</span></p><p class=\"\"><span>Neo Performance Materials </span><span> last year launched output at its permanent magnet plant in Estonia and Germany's Vacuumschmelze produces magnets, but so far its main expansion plans are in the United States. </span></p><p class=\"\"><span>The company had spent 20 million euros on the project since announcing in 2022 plans to produce permanent magnets for EVs, the first source said.</span></p><p class=\"\"><span>GKN PM told Reuters in 2024 that it was operating a pilot plant in Germany and targeted commercial capacity of 4,000 metric tons of magnets by 2030. It had not selected a location for the commercial plant in Europe.</span></p><p class=\"\"><span>It had also hoped to establish a permanent magnet plant in North America.</span></p><p class=\"\"><span>An executive told Reuters at the time that the economics were uncertain due to low-cost competition from China and the plans depended on automotive and other customers willing to guarantee orders.</span></p><p class=\"\"><span>A web page dedicated to magnets on the GKN PM website has been removed.</span></p><p class=\"\"><span>The decision to scrap the plant will undermine the EU's plans to boost domestic production of critical minerals, which was criticised earlier this month by an internal audit report.</span></p><p class=\"\"><span>The EU's Critical Raw Materials Act in 2024 set targets that the EU should extract 10% of the minerals it requires by 2030, boost recycling capacity for those materials to 15% and be able to process 40% of its annual needs of each strategic raw material.</span></p><p class=\"\"><span>GKN WORKED WITH PARTNERS</span></p><p class=\"\"><span>GKN PM was working with Ionic Technologies, a start-up which has developed a new process to recycle permanent magnets, according to a statement by its parent Ionic Rare Earths </span><span> in October. </span></p><p class=\"\"><span>GKN sent a letter to Ionic Technologies in December, informing them it was halting its work in magnets, but produced a batch of magnets for Ionic from its pilot plant before it closed down, a third source said. </span></p><p class=\"\"><span>Ionic declined to comment.</span></p><p class=\"\"><span>GKN PM had signed a memorandum of understanding in October 2023 to supply German auto parts supplier Schaeffler AG </span><span> with permanent magnets.</span></p><p class=\"\"><span>Schaeffler declined to comment.</span></p><p class=\"\"><span>TAKEOVER FINALISED</span></p><p class=\"\"><span>Earlier this month, a $1.44 billion takeover was finalised of GKN PM and its parent, British auto parts supplier Dowlais Group, by Detroit-based automotive supplier American Axle &amp; Manufacturing, which changed its name to Dauch Corp (DCH.N).</span></p><p class=\"\"><span>The takeover was announced about a year ago as the combined group aimed to benefit from greater scale as the auto industry grapples with volatile demand for electric vehicles, economic uncertainties and the global expansion of Chinese EV makers.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3Z50X8:0-gkn-cancels-plans-for-magnet-factory-in-setback-for-europe-s-rare-earth-aims/",
            "pub_date": "2026-02-27 22:20:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN293:0",
            "title": "GIP And EQT Are Nearing A Deal To Acquire Power Firm AES- Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GIP AND EQT ARE NEARING A DEAL TO ACQUIRE POWER FIRM AES - BLOOMBERG NEWS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN293:0-gip-and-eqt-are-nearing-a-deal-to-acquire-power-firm-aes-bloomberg-news/",
            "pub_date": "2026-02-27 22:21:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN1QW:0",
            "title": "Antalpha Platform Holding Co expected to post earnings of 20 cents a share - Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Antalpha Platform Holding Co </span><span> is expected to  report resultson March 3 for the period ending December 31 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The  Singapore-based   company is expected to report revenue of $26.35 million, according to the mean estimate from 2 analysts, based on LSEG data.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>​LSEG's mean analyst estimate for Antalpha Platform Holding Co is for earnings of 20 cents per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" no \"hold\" and no \"sell\" or \"strong sell.\"  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months. ​</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Antalpha Platform Holding Co is $16.00, about 80% above its last closing price of $8.89</span></p></li></ul><p class=\"\"><span>Previous quarterly performance (using preferred earnings measure in US dollars). ​</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>STARMINESMARTESTIMATE®</span></p></td><td><p class=\"\"><span>LSEG IBES ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td><td><p class=\"\"><span>SURPRISE %</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025</span></p></td><td><p class=\"\"><span>0.13</span></p></td><td><p class=\"\"><span>0.13</span></p></td><td><p class=\"\"><span>0.28</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>115.4</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025</span></p></td><td><p class=\"\"><span>0.09</span></p></td><td><p class=\"\"><span>0.09</span></p></td><td><p class=\"\"><span>0.13</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>44.4</span></p></td></tr><tr><td></td><td></td><td></td><td></td><td></td><td><p class=\"\"><span>​</span></p></td></tr><tr><td><p class=\"\"><span>​​</span></p></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td></td><td></td><td></td><td></td><td><p class=\"\"><span>​</span></p></td></tr></tbody></table></div><p class=\"\"><span>This summary was machine generated February 27 at 14:21 GMT.  All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN1QW:0-antalpha-platform-holding-co-expected-to-post-earnings-of-20-cents-a-share-earnings-preview/",
            "pub_date": "2026-02-27 22:21:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7734Ua:0",
            "title": "REG - Pulsar Group PLC - Directors' Dealings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 7734U  Pulsar Group PLC  27 February 2026   </span><p class=\"\"><span>Pulsar Group plc (\"the Company\")</span></p><p class=\"\"><span>Directors' Dealings</span></p><p class=\"\"><span>Pulsar Group plc (AIM: PULS) has been notified of a change in the details of holdings by Sarah Vawda, a Non-Executive Director of the Company.  Ms Vawda is interested in 29,823 ordinary shares of which 16,666 ordinary shares were registered under Vawda Associates Ltd, a company majority controlled by Ms Vawda.  These shares have now been transferred directly into Ms Vawda's name. Following this transfer there has been no change in the beneficial interest of Ms Vawda who remains interested in 29,823 ordinary shares in the Company, representing approximately 0.02% of the Company's issued share capital.   </span></p><p class=\"\"><span>Contact details:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td rowspan=\"2\"><p class=\"\"><span>Pulsar Group plc</span></p><p class=\"\"><span>Joanna Arnold (CEO)</span></p><p class=\"\"><span>Mark Fautley (CFO)</span></p></td><td><p class=\"\"><span> 020 3426 4070</span></p></td><td></td></tr><tr><td></td><td></td></tr><tr><td><p class=\"\"><span>Cavendish Capital Markets Limited (Nominated Adviser and Broker)</span></p><p class=\"\"><span>Corporate Finance:</span></p><p class=\"\"><span>Marc Milmo, Fergus Sullivan, Elysia Bough</span></p><p class=\"\"><span>Corporate Broking:</span></p><p class=\"\"><span>Sunila de Silva</span></p></td><td><p class=\"\"><span> 020 7220 0500 </span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span> ANNEX</span></p><p class=\"\"><span>The Notification of Dealing Forms set out below are provided in accordance with the requirements of the EU Market Abuse Regulation.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>1</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the person discharging managerial responsibilities / person closely associated</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Sarah Vawda</span></p></td></tr><tr><td><p class=\"\"><span>2</span></p></td><td colspan=\"2\"><p class=\"\"><span>Reason for the notification</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Position/status</span></p></td><td><p class=\"\"><span>Non-Executive Director</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Initial notification /Amendment</span></p></td><td><p class=\"\"><span>Initial</span></p></td></tr><tr><td><p class=\"\"><span>3</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the issuer, emission allowance market participant, auction platform, auctioneer or auction monitor</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Name</span></p></td><td><p class=\"\"><span>Pulsar Group plc</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>LEI</span></p></td><td><p class=\"\"><span>213800PPZ4ZM8OMHGT41</span></p></td></tr><tr><td><p class=\"\"><span>4</span></p></td><td colspan=\"2\"><p class=\"\"><span>Details of the transaction(s): section to be repeated for (i) each type of instrument; (ii) each type of transaction; (iii) each date; and (iv) each place where transactions have been conducted</span></p></td></tr><tr><td><p class=\"\"><span>a)</span></p></td><td><p class=\"\"><span>Description of the financial instrument, type of instrument</span></p><p class=\"\"><span>Identification code</span></p></td><td><p class=\"\"><span>Ordinary shares of 5 pence each (\"Ordinary Shares\")</span></p><p class=\"\"><span>ISIN: GB00BGQVB052</span></p></td></tr><tr><td><p class=\"\"><span>b)</span></p></td><td><p class=\"\"><span>Nature of the transaction</span></p></td><td><p class=\"\"><span> Transfer of Ordinary Shares</span></p></td></tr><tr><td><p class=\"\"><span>c)</span></p></td><td><p class=\"\"><span>Price(s) and volume(s)</span></p></td><td><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"2\"><p class=\"\"><span>27 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>Price(s)</span></p></td><td><p class=\"\"><span>Volume(s)</span></p></td></tr><tr><td><p class=\"\"><span>N/A</span></p></td><td><p class=\"\"><span>16,666</span></p></td></tr></tbody></table></div></td></tr><tr><td><p class=\"\"><span>d)</span></p></td><td><p class=\"\"><span>Aggregated information</span></p><p class=\"\"><span>- Aggregated volume</span></p><p class=\"\"><span>- Price</span></p></td><td><p class=\"\"><span>Transfer of Ordinary Shares from Vawda Associates Limited into Sarah Vawda's name</span></p></td></tr><tr><td><p class=\"\"><span>e)</span></p></td><td><p class=\"\"><span>Date of the transaction</span></p></td><td><p class=\"\"><span>27 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>f)</span></p></td><td><p class=\"\"><span>Place of the transaction</span></p></td><td><p class=\"\"><span>Off market transaction</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  DSHZDLFLQLLFBBB</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7734Ua:0-reg-pulsar-group-plc-directors-dealings/",
            "pub_date": "2026-02-27 22:13:22",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_RSa7737Ua:0",
            "title": "REG - Morgan StanleyEurope - ISM_MSESE_EARLY REDEMPTION_27-02-2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><span>RNS Number : 7737U  Morgan Stanley Europe SE  27 February 2026   </span><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Morgan Stanley &amp; Co. International plc</span></p><p class=\"\"><span>25 Cabot Square</span></p><p class=\"\"><span>Canary Wharf</span></p><p class=\"\"><span>E14 4QA</span></p></td></tr><tr><td colspan=\"2\"><p class=\"\"><span>27 February 2026</span></p></td></tr></tbody></table></div><p class=\"\"><span>Early Redemption Notification</span></p><p class=\"\"><span>Dear All,</span></p><p class=\"\"><span>Please note that there has been an Early Redemption for the following ISIN(s)/CUSIP(s):</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>ISIN(s)</span></p></td><td><p class=\"\"><span>XS3162925773</span></p></td></tr><tr><td><p class=\"\"><span>Issuer</span></p></td><td><p class=\"\"><span>MORGAN STANLEY EUROPE SE</span></p></td></tr><tr><td><p class=\"\"><span>Amount</span></p></td><td><p class=\"\"><span>200,000</span></p></td></tr><tr><td><p class=\"\"><span>Settlement Date</span></p></td><td><p class=\"\"><span>05-Mar-26</span></p></td></tr></tbody></table></div><p class=\"\"><span>Please do not hesitate to contact us for further information.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  MSCMZGZZDNZGVZM</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_RSa7737Ua:0-reg-morgan-stanleyeurope-ism_msese_early-redemption_27-02-2026/",
            "pub_date": "2026-02-27 22:13:46",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006404:0",
            "title": "Intuit Is Maintained at Outperform by Evercore ISI Group",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(14:14 GMT) </span></strong><span>Intuit Price Target Cut to $540.00/Share From $875.00 by Evercore ISI Group</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006404:0/",
            "pub_date": "2026-02-27 22:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006410:0",
            "title": "Canadian GDP Nudges Up in Per Capita Terms in 4Q — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Although Canada's economy contracted in the fourth quarter, growth remained just in positive territory on a per capita basis. GDP declined 0.6% in annual terms, but edged up 0.1% in per capital terms though this was cooler than the 1.9% growth the quarter before. Government efforts to slow immigration are tamping down population growth, which is expected to weigh on economic activity but should continue to buoy per-capita growth near term. (robb.stewart@wsj.com; @RobbMStewart)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006410:0/",
            "pub_date": "2026-02-27 22:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}