{
    "data": [
        {
            "id": "DJN_DN20250204002817:0",
            "title": "These Stocks Are Moving the Most Today: Palantir, Alphabet, Tesla, Nvidia, Super Micro, Synaptics, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stock futures declined Tuesday as China retaliated against new U.S. tariffs by unveiling levies on certain American goods and opening an investigation into Alphabet's Google for possible antitrust violations.</p><p class=\"\">These stocks were poised to make moves Tuesday:</p><p class=\"\">Palantir Technologies soared 18% in premarket trading after the software company reported fourth-quarter adjusted earnings that topped analysts' estimates and revenue jumped 36% to $828 million, beating expectations of $776 million. The company's U.S. business jumped 52% from a year earlier. \"Our business results continue to astound, demonstrating our deepening position at the center of the (artificial intelligence) revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,\" said CEO Alex Karp. For the first quarter, Palantir said it expects revenue of $858 million to $862 million, up 36% from 2024 at the midpoint and better than Wall Street estimates of $799 million.</p><p class=\"\">Tesla was down 0.5% in premarket trading after shares of the electric-vehicle giant slumped 5.2% on Monday. The stock closed lower after it was announced that tariffs levied on Mexico by the U.S. would be delayed by a month but before President Donald Trump struck a similar deal with Canada. The electric-vehicle maker assembles all its vehicles for the U.S. market in Mexico but about 15% of the parts in a Model Y sold in the U.S. come from Mexico.</p><p class=\"\">Shares of Nvidia, the leading maker of artificial-intelligence chips, were rising 0.7%. Nvidia declined 2.8% on Monday as Wall Street gauged the potential effects of the Trump administration's tariffs on chip companies and amid continued worries over AI advancements made by China's DeepSeek.</p><p class=\"\">Super Micro Computer rose 6% in premarket trading. The maker of AI servers said it would be providing a fiscal second-quarter \"business update\" on Feb. 11. The  Nasdaq Stock Market told the company in November that it wasn't in compliance with a listing rule requiring timely filing of reports with the Securities and Exchange Commission. In early December, the company said it expected to file its delayed financial statements by Feb. 25.</p><p class=\"\">Semiconductor design company Synaptics fell 5% after announcing CEO Michael Hurlston would be stepping down to become chief executive and president of Lumentum, the maker of products for cloud and AI applications. Lumentum shares rose 1.7%.</p><p class=\"\">Clorox reported a 15% drop in fiscal second-quarter sales to $1.69 billion, and said it now expects fiscal-year sales to fall 1% to 2%, down from a prior outlook for sales to be flat to down 2%. Shares of the cleaning-products maker were down 1.3% in premarket trading.</p><p class=\"\">Kyndryl Holdings, the provider of information-technology services, swung to a profit in its fiscal third quarter and raised its 2025 guidance. The stock declined 1.7% in premarket trading.</p><p class=\"\">Earnings reports are expected Tuesday from Alphabet, Merck, Advanced Micro Devices, Chipotle Mexican Grill,  PayPal Holdings,  Pfizer, PepsiCo,  Amgen, and  Spotify Technology.</p><p class=\"\">Alphabet rose 0.2% in premarket trading ahead of fourth-quarter earnings from the parent of Google. Wall Street expects Alphabet to report earnings of $2.13 a share on revenue of $96.7 billion, up from per-share profit of $1.64 on revenue of $86.3 billion a year earlier. Cloud growth at the company and updates on its AI investments will be closely watched by investors.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002817:0/",
            "pub_date": "2025-02-04 18:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Obim4lNJa:0",
            "title": "Hafslund - Approval of Base Prospectus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On 4 February 2025, the Financial Supervisory Authority of Norway approved thebase prospectus prepared by Hafslund AS.</p><p class=\"\">The prospectus is available on the company's website:https://www.hafslund.no/en/investor/lanedokumentasjon</p><p class=\"\">Hafslund ASOslo, 4 February 2025</p><p class=\"\">For further information: Andreas Wik, Head of Treasury, tel: +47 924 97 255 or e-mail:andreas.wik@hafslund.no</p><p class=\"\">https://newsweb.oslobors.no/message/637666</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Obim4lNJa:0-hafslund-approval-of-base-prospectus/",
            "pub_date": "2025-02-04 18:16:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002822:0",
            "title": "European Midday Briefing: Stocks Drop as China Retaliates Against Trump Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Stocks:</p><p class=\"\">European stocks fell on Tuesday after Trump agreed to postpone his threatened 25% tariffs on Canada and Mexico , however, a new 10% tariff on China took effect.</p><p class=\"\">China has retaliated with new tariffs on select U.S. imports  and said it was opening an antitrust probe into Google.</p><p class=\"\">\"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies said. \"Our view remains that eventually tariffs will end up not as bad as feared.\"</p><p class=\"\">Hargreaves Lansdown said U.K. investors were on edge as trade jitters continued.</p><p class=\"\">Trade tensions are dictating the market mood, especially in Europe where Trump keeps the continent guessing with lingering threats, it said.</p><p class=\"\">With volatility set to remain, there may be chances for investors to cash in on market overreactions, especially if Trump's tariff threats are a bluff, Hargreaves said.</p><p class=\"\">Stocks to Watch</p><p class=\"\">Novartis is set to overcome a wave of patent expirations during 2025, Deutsche Bank said.</p><p class=\"\">The Swiss pharma giant surprised with its margin performance in the last quarter and its 2025 outlook that came ahead of analysts expectations, Deutsche Bank said.</p><p class=\"\">While some of the 4Q revenue beat was attributed to rebates, Novartis appears well-positioned to continue exceeding market expectations, it said.</p><p class=\"\">Deutsche Bank lifted back the stock rating to buy from hold, which had been previously nudged down due to patent expiry worries.</p><p class=\"\">U.S. Markets:</p><p class=\"\">Stock futures fell after China struck back against the new U.S. tariffs. Its measures will go into effect on Feb. 10.</p><p class=\"\">Trump said the tariffs on China were just \"an opening salvo.\" He added: \"If we can't make a deal with China, then the tariffs would be very, very substantial.\"</p><p class=\"\">Forex:</p><p class=\"\">The euro remained under pressure as tariff risks remained heightened even after President Trump agreed to pause tariffs on Canada and Mexico, Danske Bank said.</p><p class=\"\">Tariff headlines will likely remain the primary driver of price action in the coming weeks, with a risk of Trump announcing measures against Europe, it said.</p><p class=\"\">Still, Trump looks to be using tariff announcements \"primarily as a negotiating tool\" and this could help the euro to recover back into a $1.04-$1.05 range.</p><p class=\"\">\"We believe Trump is ultimately likely to under-deliver on maintaining tariffs for an extended period,\" Danske Bank said.</p><p class=\"\">The dollar fell after Trump delayed tariffs on Canada and Mexico for one month, but uncertainty remains and this could soon lift the safe-haven dollar once more, Commerzbank said.</p><p class=\"\">There is a risk of new tariff announcements coming at any time, Commerzbank said.</p><p class=\"\">\"The next shock is bound to come, and this will probably be dollar-positive again.\"</p><p class=\"\">Key U.S. economic data this week--including ISM data on services Wednesday and monthly jobs data Friday--will also likely lift the dollar as long as they underpin the story of a resilient U.S. economy, it said.</p><p class=\"\">Bonds:</p><p class=\"\">Eurozone 10-year government bond yields edged higher, tracking Treasury yields after the latest twist in Trump's tariff policy.</p><p class=\"\">Eurozone rates are likely to continue to be sensitive to growth risks, ING said. \"Especially the front end may find itself even lower in the near term.\"</p><p class=\"\">Danske Bank said being long in French bonds still carries some risks.</p><p class=\"\">French Prime Minister Francois Bayrou pushed the 2025 budget bill without a vote by lawmakers, and faces a no-confidence vote. Using a constitutional tool to pass the bill \"was what led to fall of the previous French government,\" Danske said.</p><p class=\"\">\"Hence, there is still some considerable risks to being long France even at spread of some 75 basis points in the 10-year area to Germany.\"</p><p class=\"\">Energy:</p><p class=\"\">Oil prices fell more than 1% as immediate concerns over supply disruptions eased after Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude.</p><p class=\"\">Meanwhile, as a tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday.</p><p class=\"\">The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices.</p><p class=\"\">Metals:</p><p class=\"\">Gold futures slid, correcting after the Canada and Mexico made a deal that will postpone U.S. tariffs by at least a month, but ING said uncertainty over trade should keep the price relatively well supported.</p><p class=\"\">Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING said.</p><p class=\"\">Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING added.</p><p class=\"\">Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research said.</p><p class=\"\">Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800 level, leaving its bullish bias intact, RHB said.</p><p class=\"\">The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900 level, it said.</p><p class=\"\">The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, RHB added.</p><p class=\"\">EMEA HEADLINES</p><p class=\"\">UBS Aims to Boost Buybacks as Net Profit Beats Expectations</p><p class=\"\">UBS Group reported a fourth-quarter net profit that came in ahead of analysts' expectations, and said it aims to buy back shares valued at up to $3 billion this year.</p><p class=\"\">The Zurich-based bank said Tuesday that net profit for the quarter was $770 million compared with a loss of $279 million in the year-earlier period, when its results were hit by costs related to the integration of Credit Suisse.</p><p class=\"\">BNP Paribas Raises Shareholder Returns After Posting Higher Earnings</p><p class=\"\">BNP Paribas raised its dividend and intends to buy back more than 1 billion euros worth of shares from the second quarter, after posting an earnings rise.</p><p class=\"\">The French lender said it made 2.32 billion euros ($2.40 billion) in net profit for the fourth quarter, up from 1.07 billion euros a year prior, on revenue that grew 11% to 12.14 billion euros.</p><p class=\"\">Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets</p><p class=\"\">U.K. spirits maker Diageo scrapped its midterm outlook, citing macroeconomic and geopolitical uncertainty in key markets affecting the pace of recovery.</p><p class=\"\">The owner of Johnnie Walker, Guinness and Smirnoff said Tuesday that it has withdrawn its target of organic net sales growth between 5% and 7%.</p><p class=\"\">Infineon Shares Surge After Guidance Raise, Better-Than-Expected Quarter</p><p class=\"\">Infineon Technologies shares jumped after the group raised its sales forecasts for the fiscal year as it expects to benefit from a stronger U.S. dollar, while sales in the December quarter fell less than feared amid solid demand for artificial-intelligence chips.</p><p class=\"\">The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros ($15.94 billion) it reported for fiscal 2024. Infineon had previously forecast a slight decline. Meanwhile, Infineon's segment result margin-a key profitability measure-is still expected in the mid-to-high-teens percentage range.</p><p class=\"\">GLOBAL NEWS</p><p class=\"\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</p><p class=\"\">BRUSSELS-European leaders, bracing for a fight with President Trump over the world's most valuable trading relationship, said they are ready to strike back but prefer cooperation.</p><p class=\"\">Trump over the weekend announced punishing tariffs on Canada and Mexico and made clear that U.S. allies across the Atlantic were high on his target list. He later agreed to pause tariffs on Canada and Mexico for one month.</p><p class=\"\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</p><p class=\"\">Bitcoin was struggling for direction Tuesday as investors weighed up how President Donald Trump's trade policies will affect cryptocurrency prices.</p><p class=\"\">The world's largest token climbed when Trump paused plans for 25% tariffs on goods from Mexico and Canada, then slid after China said it would hit back with levies of its own.</p><p class=\"\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</p><p class=\"\">The Treasury Department said it needs to borrow less money than originally expected in the current quarter because it kicked off the year with more cash on hand than planned.</p><p class=\"\">The department, which is responsible for the government's borrowing, said Monday afternoon that in the January to March quarter, it expects to borrow $815 billion. The previous estimate, shared in October, was for $823 billion.</p><p class=\"\">Netanyahu, Trump to Hold Talks on Gaza Cease-Fire and Wider Middle-East Strategy</p><p class=\"\">WASHINGTON-The future of the precarious Gaza cease-fire is expected to dominate much of the closed-door discussion when President Trump and Israeli Prime Minister Benjamin Netanyahu meet in the Oval Office Tuesday.</p><p class=\"\">A commitment from Netanyahu to negotiate an extension and potentially a long-term cessation of hostilities would give Trump a diplomatic win, and could secure the release of remaining hostages, including some Americans.</p><p class=\"\">El Salvador Offers to Take U.S. Deportees of Any Nationality Including Imprisoned Americans</p><p class=\"\">SAN SALVADOR, El Salvador-U.S. Secretary of State Marco Rubio said on Monday that El Salvador has offered to accept deportees of any nationality from the U.S., including incarcerated American citizens who would be held in the country's maximum-security prison.</p><p class=\"\">El Salvador President Nayib Bukele offered to \"house in his jails dangerous American criminals in custody in our country,\" Rubio said in San Salvador, the second stop on his first foreign trip, after meeting with Bukele. \"No country has ever made an offer of friendship such as this,\" he said, calling it the \"most unprecedented and extraordinary, extraordinary migratory agreement anywhere in the world.\"</p><p class=\"\">Trump Hints at Curbs on Musk's Powers After Billionaire Shakes Up Washington</p><p class=\"\">WASHINGTON-President Trump on Monday said there were curbs in place to prevent Elon Musk from doing anything in the government without the White House's blessing, responding to growing confusion about who was overseeing Musk's push to dismantle multiple agencies.</p><p class=\"\">Trump described Musk's role as advisory. \"Elon can't do-and won't do-anything without our approval and we'll give him the approval where appropriate. Where not appropriate, we won't,\" Trump said.</p><p class=\"\">Write to ina.kreutz@wsj.com</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002822:0/",
            "pub_date": "2025-02-04 18:17:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0OJ:0",
            "title": "Indian shares buck global trade war fears to log best day in a month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indian shares posted their biggest one-day gain in a month on Tuesday, shrugging off the China-U.S. trade war fears that weighed on global stocks and focusing instead on the chance for a trade truce with the U.S., similar to Mexico and Canada.</p><p class=\"\">The Nifty 50  added 1.62% to 23,739.25, while the BSE Sensex  gained 1.81% to 78,583.81, with both logging their biggest single-session gains in a month.</p><p class=\"\">Asian and European stocks were hauled back by fears of a global trade war after the U.S. and China slapped retaliatory tariffs on each other, rekindling fears that were doused on Monday after U.S. President Donald Trump suspended tariffs on Mexico and Canada.</p><p class=\"\">Trump has also threatened to impose 100% tariffs on the BRICS member countries, which include India, if they replaced the dollar as a reserve currency.</p><p class=\"\">\"The real trigger for Indian markets today was the tariff pause on Mexico and Canada, which signalled that the U.S. is ready to negotiate,\" said G Chokkalingam, founder and head of research at Equinomics Research.      </p><p class=\"\">Compared to Mexico, Canada and China, India's exports to the U.S. are relatively smaller and hence investors are optimistic that they may not attract Trump's scrutiny, Chokkalingam said.</p><p class=\"\">The Nifty started February on a weak note after a mixed federal budget and the trade war fears, threatening to extend a four-month losing streak. That, however, has made stock prices relatively cheaper.    </p><p class=\"\">High-weight financials  rose 2.11%, led by a 2.6% jump in top private lender HDFC Bank .</p><p class=\"\">The small-caps  and mid-caps  rose 1.1% and 1.6%, respectively.</p><p class=\"\">State-owned firms (.NIFTYPSE) rose 2.7% after dropping 6.3% in the previous two sessions, led by oil marketing companies on softer crude prices and defence firms on a potential jump in orders.</p><p class=\"\">Divi's Laboratories  jumped 3.6%, taking its two-session gains to 8.3% since beating quarterly profit estimates.</p><p class=\"\">Asian Paints  climbed 2.7% due to stronger-than-expected volume growth in the third quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0OJ:0-indian-shares-buck-global-trade-war-fears-to-log-best-day-in-a-month/",
            "pub_date": "2025-02-04 18:18:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0R9:0",
            "title": "Higher wind output weighs on German spot prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Germany's spot power prices fell on Tuesday as wind power generation is expected to increase in the country.</p><p class=\"\">German day-ahead (TRDEBD1) power was down 1.7% to 142.0 euros per megawatt hour at 0902 GMT.</p><p class=\"\">French baseload for the day ahead (TRFRBD1) was at 143.5 euros/MWh, down 0.4%, LSEG data showed.</p><p class=\"\">On the supply side, Germany was seen increasing wind output by 3.9 gigawatts to 16.2 GW. French wind output was expected to shed 230 megawatts to 2.8 GW day-on-day.</p><p class=\"\">In Germany, solar power output was forecast to fall 1.7 GW on Wednesday to 4.0 GW, LSEG data showed.</p><p class=\"\">French nuclear availability fell by two percentage points to 81% of total capacity. </p><p class=\"\">Power consumption in Germany is expected to increase by 0.4 gigawatts (GW) to 63.1 GW on Wednesday while demand in France is seen falling 3.6 GW to 66.9 GW, LSEG data also showed.</p><p class=\"\">Average temperatures in France and Germany will ease by 2.3 degrees Celsius and 1 degree Celsius respectively up to Wednesday.</p><p class=\"\">The German year-ahead baseload contract (TRDEBYZ6) was down 0.9% at 96.0 euros/MWh, while the French year-ahead position (TRFRBYZ6) shed 2.4% to 68.0 euros/MWh.</p><p class=\"\">The European carbon market's benchmark 2025 contract (CFI2Zc1) was down 0.6% at 80.48 euros per metric ton.</p><p class=\"\">Carbon prices are under pressure from the potential impact on Europe of a trade war with the U.S., Energi Danmark analysts said.</p><p class=\"\">Belgium's new government is looking to double its nuclear power capacity from 4 GW to 8 GW by building new reactors, Energy Minister Mathieu Bihet was quoted as saying by financial daily Tijd on Tuesday. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0R9:0-higher-wind-output-weighs-on-german-spot-prices/",
            "pub_date": "2025-02-04 18:18:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0SP:0",
            "title": "India stocks, rupee, swaps, call at 3:30 p.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was up 1.8% to 78,583.81, while the broader NSE index  advanced 1.6% to 23,739.25, shrugging off the China-U.S. trade war fears that weighed on global stocks and focusing instead on the chance for a trade truce with the U.S., as struck with Mexico and Canada. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  ended higher at 87.0675 versus the U.S. dollar, against 87.1850 in the previous session, mirroring gains in regional currencies, but concerns over an escalating U.S.-China trade war kept investors on edge.  </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN071034G=CC) was quoted at 100.815 rupees, with the yield little changed at 6.6725%, as traders  awaited the central bank's monetary policy decision. </p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) was down 2 basis points at 6.3075%, while the five-year swap rate (INR5YMIBROIS=CC) was largely unchanged at 6.0775%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 6% and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.28%.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0SP:0-india-stocks-rupee-swaps-call-at-3-30-p-m-ist/",
            "pub_date": "2025-02-04 18:18:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002767:0",
            "title": "U.K. Sells 4.25 Billion Pounds in March 2030 Gilt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Miriam Mukuru</p><p class=\"\">The U.K's Debt Management Office sold 4.25 billion pounds ($5.29 billion) in March 2030-dated gilts at an auction on Tuesday, it said.</p><p class=\"\">The following are results of the auction, with amounts in pounds. Figures in brackets are data from the previous auction, held on Jan. 8, 2025.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Issue              4.375% March 7 2030 gilt <br/>Amount on offer    4.25  bln <br/>Bids received      12.95 bln <br/>Bids accepted      4.25  bln <br/>Bid-to-cover ratio 3.05    (3.00) <br/>Average yield      4.276%  (4.490%) <br/>Average price      100.43  (99.46) <br/>Maximum yield      4.281%  (4.496%) <br/>Settlement date    February 5, 2025 <br/> </pre><p class=\"\">Write to Miriam Mukuru at miriam.mukuru@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002767:0/",
            "pub_date": "2025-02-04 18:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACN95760a:0",
            "title": "Mallia Therapeutics and Northway Biotech Announce Partnership for the Manufacturing of Soluble CD83 Protein for Hair Loss Treatment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ERLANGEN, GERMANY AND VILNIUS, LITHUANIA, Feb 4, 2025 - (ACN Newswire) - Mallia Therapeutics (\"Mallia\"), a biopharmaceutical company developing novel treatments for hair loss, and Northway Biotech (\"NBT\"), a biologics Contract Development and Manufacturing Organization (CDMO), have announced a partnership for the development of the production process and manufacturing of Mallia's soluble CD83 protein (sCD83), a treatment aimed at promoting hair follicle formation and growth.</p><p class=\"\">Under the agreement, Northway Biotech will leverage its expertise in biologics manufacturing to develop the production process for the recombinant sCD83 protein for large-scale production, utilizing the Pichia pastoris expression system. This collaboration includes the development of analytical methods, technology scale-up, and the manufacturing of a cGMP Drug Substance.</p><p class=\"\">Dr. Manfred Groeppel, co-founder and Managing Director of Mallia Therapeutics, said: \"With this partnership, we are advancing the development of sCD83 to turn our research into a scalable treatment for patients.\"</p><p class=\"\">\"Interestingly, sCD83's mode of action induces both the formation of new hair follicles and thus hair growth, and has the potential to redefine treatment approaches for hormone-induced androgenetic alopecia as well as immune-mediated alopecia areata,\" emphasizes Prof. Dr. Alexander Steinkasserer, co-founder and Managing Director of Mallia. \"By developing a robust production process, we are ensuring the quality required for future clinical as well as commercial applications.\"</p><p class=\"\">Prof. Vladas Algirdas Bumelis, CEO and Chairman of Northway Biotech, expressed, \"We are excited to be working with Mallia on developing the manufacturing process of sCD83. Our priority is to ensure the highest manufacturing standards and maintain clear, open communication as we collaborate every step of the way.\"</p><p class=\"\">\"Mallia's team and their innovative solution make this project particularly appealing to us given its huge potential and the large need from people all over the world for treatment. The strong and transparent collaboration we have established allows us to support Mallia with confidence as we move forward together quickly,\"added Andre Markmann, PhD, VP of Business Development at Northway Biotech.</p><p class=\"\">About Mallia Therapeutics GmbH</p><p class=\"\">Mallia Therapeutics GmbH is a biopharmaceutical company focused on developing novel treatments for patients suffering from hair loss. The Company was founded in 2023 in Erlangen, Germany, and is led by an experienced management team and worldwide leading experts in the field of CD83, with more than 60 CD83-related publications and 20 years of experience in the field.</p><p class=\"\">With sCD83, a potential treatment for hair loss in preclinical development, Mallia aims to enter the multi-billion-dollar alopecia market and provide patients with a safe and effective topical treatment.</p><p class=\"\">Connect with us on LinkedIn or find out more here: https://mallia-therapeutics.com/</p><p class=\"\">About Northway Biotech</p><p class=\"\">Northway Biotech is a leading contract development and manufacturing organization (CDMO) supporting customers worldwide. Its highly experienced and professional team executes projects at every stage, from cell line construction and process development to cGMP manufacturing of biopharmaceutical products. The company's extensive expertise and vertically integrated service offering enable rapid execution of multiple projects from its state-of-the-art GMP facilities while ensuring full process and product compliance at all stages of research, development, and commercial manufacturing. Northway Biotech is a privately owned company founded in 2004 and operates locations in Vilnius, Lithuania; London, United Kingdom; and Waltham, MA, USA. For more information, please visit www.northwaybiotech.com.</p><p class=\"\">Mallia Therapeutics Contact:</p><p class=\"\">Mallia Therapeutics GmbH</p><p class=\"\">info@mallia-therapeutics.com</p><p class=\"\">International Media Contact:</p><p class=\"\">MC Services AG</p><p class=\"\">Dr. Regina Lutz / Katja Arnold</p><p class=\"\">Tel.: +49 (0)89 210 228 0</p><p class=\"\">E-Mail: mallia-therapeutics@mc-services.eu</p><p class=\"\">Contact Information</p><p class=\"\">Vladas Bumelis</p><p class=\"\">CEO and Chairman of the Board</p><p class=\"\">vladas.bumelis@northwaybiotech.com</p><p class=\"\">SOURCE: Northway Biotech</p><p class=\"\">Source: Northway Biotech</p><p class=\"\">Copyright 2025 ACN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACN95760a:0-mallia-therapeutics-and-northway-biotech-announce-partnership-for-the-manufacturing-of-soluble-cd83-protein-for-hair-loss-treatment/",
            "pub_date": "2025-02-04 18:12:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463394:0",
            "title": "The San-in Godo Bank's Nine-Month Profit Rises 26%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The San-in Godo Bank  recorded a 26% rise in attributable profit for the nine months ended Dec. 31, 2024, to 13.1 billion yen from 10.4 billion yen in the year-ago period. </p><p class=\"\">Earnings per share were 86.15 yen, up from 67.30 yen a year earlier, a Jan. 31 bourse filing said. </p><p class=\"\">The lender saw an 8.7% rise in ordinary income to 96.3 billion yen from 88.6 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 18.2 billion yen, basic EPS of 119.36 yen, an ordinary income of 131.9 billion yen, and total dividend of 48 yen per share for the fiscal year ending March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463394:0/",
            "pub_date": "2025-02-04 18:13:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463410:0",
            "title": "LG Chem Widens Loss in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LG Chem  widened its fourth-quarter 2024 net attributable loss to shareholders of parent company to 1.055 trillion won from 81.4 billion won a year earlier, according to a Monday filing with KIND. </p><p class=\"\">The company's sales declined 6.1% year over year to 12.3 trillion won from 13.1 trillion won. </p><p class=\"\">Shares of LG Chem fell more than 4% at market close on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463410:0/",
            "pub_date": "2025-02-04 18:13:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1A7:0",
            "title": "Arab Company For Investment Projects FY Attributable Income 273,889 Dinars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab Company for Investment Projects Psc (APCT.AM):</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ARAB COMPANY FOR INVESTMENT PROJECTS FY ATTRIBUTABLE INCOME 273,889 DINARS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1A7:0-arab-company-for-investment-projects-fy-attributable-income-273-889-dinars/",
            "pub_date": "2025-02-04 18:13:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463411:0",
            "title": "Volvo Cars Logs Lower Car Sales in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volvo Car (VOLCAR-B.ST, VOLCAR-B.ST VOLCAR-B.ST), d/b/a Volvo Cars, said Tuesday its car sales dropped 5% year over year in January. </p><p class=\"\">The Swedish automaker sold 50,820 cars, compared with 53,402 vehicles in the year-ago period.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463411:0/",
            "pub_date": "2025-02-04 18:13:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEE06FXHa:0",
            "title": "OMV Petrom's 2024 profit edges up in absence of solidarity tax",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BUCHAREST (Romania), February 4 (SeeNews) - Romania's top oil and gas group OMV Petrom [BSE:SNP] on Tuesday reported a 4.19 billion lei ($862.2 million/841.9 million euro) net profit for 2024, inching up 4% over the previous year.</p><p class=\"\">The increase in profit comes after the company no longer had to pay solidarity contribution on refined crude oil, which reduced its bottom line by 2.729 billion lei a year earlier. In 2023, Romania introduced a solidarity contribution on the profits of oil and natural gas producers and oil refining companies amounting to 60% of taxable profits that exceed by more than 20% the average profits recorded in the 2018-2021 period.</p><p class=\"\">Sales revenue fell by 8% to 35.765 billion lei last year, OMV Petrom said in an unaudited financial report filed with the Bucharest Stock Exchange.</p><p class=\"\">\"Our operational performance was strong in 2024: hydrocarbon production was better than planned, with the smallest decline in the last seven years, and the refinery and power plant operated at high capacity. Thus, we significantly contributed to Romania’s energy supply, by providing about one-third of fuels demand, one third of gas demand and 10% of electricity generation,\" OMV Petrom CEO Christina Verchere said in a separate press release on Tuesday.</p><p class=\"\">OMV Petrom's consolidated adjusted current cost of supplies (CCS) operating result declined by 32% to 5.729 billion lei in 2024, mainly due to weaker commodity prices and the impact of gas and power regulations.</p><p class=\"\">The exploration and production segment recorded a 2.96 billion lei adjusted operating result, down 29% on the year, mainly due to lower oil and gas prices and hydrocarbon sales volumes.</p><p class=\"\">In the refining and marketing segment, the group's adjusted CCS operating result amounted to 2.438 billion lei last year, down by an annual 2%. This downtick reflected lower refining margins largely offset by sales channels performance.</p><p class=\"\">The gas and power division had an adjusted operating result of 352 million lei, down 84% from 2023. Despite good operational performance, the result was affected by changes in legislation and market dynamics. Gas sales volumes dropped 7% to 43.29 TWh, while net electricity output increased by 18% to 4.92 TWh.</p><p class=\"\">\"In 2024 only, we invested 7.2 billion lei to support Neptun Deep development, renewable energy projects and electro-mobility network expansion,\" Verchere said.</p><p class=\"\">\"We expect 2025 to be a difficult and volatile year, with fiscal and regulatory challenges. Assuming a predictable and competitive fiscal and regulatory environment, we expect to reach a record high level of investments of around 8 billion euro, which would contribute to Romania’s energy security and to the country’s economy,\" she added.</p><p class=\"\">Shares of blue-chip OMV Petrom traded 0.41% lower at 0.725 lei as at 1012 CET on Tuesday on the Bucharest bourse.</p><p class=\"\">(1 euro = 4.9766 lei)</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEE06FXHa:0-omv-petrom-s-2024-profit-edges-up-in-absence-of-solidarity-tax/",
            "pub_date": "2025-02-04 18:14:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463358:0",
            "title": "South Korean Factory Sector Expands in January: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Korea's manufacturing sector expanded output and enjoyed new order growth in January, reported S&amp;P Global on Monday. </p><p class=\"\">The seasonally adjusted South Korean purchasing managers index (PMI) rose to 50.3 in January, up from 49.0 in December, and striking above the 50-marker that separates growth from contraction, reported S&amp;P Global, citing its monthly survey</p><p class=\"\">In January, manufacturers reported that \"outstanding business rose to the greatest extent in 31 months, while firms raised purchases and stocks of inputs,\" advised S&amp;P Global. </p><p class=\"\">Foreign demand added to the positive picture for manufacturers: \"In fact, new export orders rose at a stronger rate in January, and extended the current sequence of growth to three months,\" explained S&amp;P Global. </p><p class=\"\">South Korean factory managers did face higher bills in January and passed along costs of operation to customers. \"Firms often attributed the increase in cost burdens to higher raw material prices, particularly from abroad amid a weak exchange rate. In a bid to protect margins, firms opted to pass through higher expenses by raising charges at a solid pace,\" said S&amp;P Global. </p><p class=\"\">Despite stronger business, South Korean factory managers were loath to add to payrolls in January. Employment \"levels fell for the third month running,\" reported S&amp;P Global. </p><p class=\"\">Operating with fewer employees, South Korean factory managers faced capacity pressures in January. The \"pressure on capacity at South Korean manufacturers built due to a third consecutive reduction in employment levels,\" advised S&amp;P Global. </p><p class=\"\">South Korean factory managers were again confident in their 12-month outlooks in January. Business \"confidence returned to positive territory following the brief dip at the end of last year&lt;' noted S&amp;P Global. </p><p class=\"\">The South Korea manufacturing PMI for January was compiled by S&amp;P Global from survey sent to 400 manufacturers from January 9 through January 23.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463358:0/",
            "pub_date": "2025-02-04 18:14:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308419:0",
            "title": "PVH, Illumina Added to China's Unreliable Companies List",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PVH  and Illumina  have been added to the Chinese Ministry of Commerce's unreliable entity list, the government organization said Tuesday. </p><p class=\"\">The ministry said the two firms \"violated the normal market transaction principles, interrupted normal transactions with Chinese companies, took discriminatory measures against Chinese companies, and seriously damaged the legitimate rights and interests of Chinese companies,\" according to a Google translation of a statement posted on its website. </p><p class=\"\">PVH and Illumina did not immediately reply to MT Newswires' requests for comment.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308419:0/",
            "pub_date": "2025-02-04 18:14:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463405:0",
            "title": "Market Chatter: Samsung Chairman Jay Y. Lee Cleared of Accounting Fraud and Stock Manipulation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Samsung Electronics  Chairman Jay Y. Lee was acquitted of accounting fraud and stock manipulation charges by a Seoul appeals court on Monday, removing key legal challenges, Reuters reported Tuesday. </p><p class=\"\">The court upheld a lower court's dismissal of allegations surrounding a 2015 merger between Samsung C&amp;T  and its subsidiary Cheil Industries, which prosecutors claimed aimed to solidify Lee's control over Samsung, the report said. </p><p class=\"\">Despite acknowledging \"inappropriate acts\" by Samsung Biologics , the court ruled the merger was indicative of financial realities without causing shareholder losses, it said. </p><p class=\"\">Shares of Samsung Electronics rose more than 3% at market close on Tuesday while those of Samsung Biologics fell more than 2%. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463405:0/",
            "pub_date": "2025-02-04 18:14:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002810:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">China Retaliates With Levies, Antitrust Probe Into Google</strong></p><p class=\"\">The actions include 15% tariffs on U.S. coal and liquefied natural gas imports, as well as raising levies on crude oil, agricultural machinery and certain vehicles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Asia Markets Jittery as Traders Gauge First Trade War Salvos</strong></p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new tariffs on the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump's threatened tariffs might not hit clothing retailers much now, but analysts warn price increases could backfire</strong></p><p class=\"\">Lots of clothes on store shelves could get a bit more expensive if new tariffs announced by President Donald Trump over the weekend eventually take hold. But after three years of price increases and higher costs of living, some Wall Street analysts say shoppers might be too worn out to buy any of it.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Futures Set New Record on Safe-Haven Demand</strong></p><p class=\"\">Gold futures set a fresh record in volatile trading as traders digested U.S. President Trump's tariff plans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed interest-rate cuts might not come anytime soon, two top officials say</strong></p><p class=\"\">Two senior Federal Reserve officials said Monday that they are in no rush to cut interest rates further given the uncertainty surrounding the U.S. economic outlook and the White House's new policies, including tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002810:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-5-am-et/",
            "pub_date": "2025-02-04 18:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002809:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle</strong></p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The French lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tequila has to be made in Mexico. Diageo offers no financial outlook on tariff uncertainty.</strong></p><p class=\"\">The maker of Don Julio tequila and Crown Royal whisky said on Tuesday it can't provide financial guidance because of the uncertainty over tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nintendo Cuts Earnings, Switch Sales Guidance</strong></p><p class=\"\">The Japanese videogame maker said Tuesday that net profit dropped 42% from a year earlier to 237.19 billion yen, for the nine-month period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alphabet Earnings Could Provide Answers on AI and Cloud Concerns</strong></p><p class=\"\">Analysts surveyed by FactSet expect Alphabet to report a jump in earnings and revenue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ADM's Outlook Is a Worry. Earnings Are Today.</strong></p><p class=\"\">Last week, the chip maker's rival, Intel,gave a softer-than-expected forecast for its March quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Big Endeavor Group Holders Likely to Battle Silver Lake Over Buyout Price, $6 Billion Windfall</strong></p><p class=\"\">Since the $13 billion, take-private deal was unveiled in April 2024, TKO's stock has surged almost 75% to $156.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gardasil Worries Loom as Merck Reports Earnings</strong></p><p class=\"\">Merck shares are down more than 20% over the past 12 months after trouble with sales of its Gardasil vaccine in China</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002809:0-news-highlights-top-company-news-of-the-day-tuesday-at-5-am-et/",
            "pub_date": "2025-02-04 18:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_JCN95759a:0",
            "title": "Mitsubishi Heavy Industries Achieves Double-Digit Order Intake and Profit Growth in First Three Quarters, Raises Full-Year Guidance",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TOKYO, Feb 4, 2025 - (JCN Newswire) - Mitsubishi Heavy Industries, Ltd. (MHI, TSE Code: 7011) announced that order intake increased 10.5% year-on-year to JPY4,968.9 billion in the three quarters ended December 31, 2024. Revenue rose 8.8% to JPY3,547.7 billion year-on-year, resulting in profit from business activities (business profit) of JPY264.7 billion, a 38.2% increase over the previous fiscal year, which represents a profit margin of 7.5%. Profit attributable to owners of parent (net income) was JPY172.1 billion, an increase of 24.7% year-on-year, with a profit margin of 4.9%. EBITDA was JPY382.0 billion, a 28.9% increase over Q1-3 FY2023, with an EBITDA margin of 10.8%, up 1.7 percentage points year-on-year.In Energy, order intake increased by JPY228.7 billion YoY, which reflected continued strong demand in Gas Turbine Combined Cycle (GTCC) and Aero Engines. Contracts for 16 large frame gas turbine units were concluded during Q1-3, the majority of which were from customers in the Americas. Revenue increased by JPY81.4 billion YoY; the largest gains were seen in GTCC, which worked to execute its sizeable backlog, and Aero Engines. Segment business profit increased by JPY67.9 billion YoY due to higher margins in GTCC, increased revenue and the rebound from one-time expenses in Aero Engines incurred in Q1-3 FY2023, together with stable performance in Nuclear Power.</p><p class=\"\">In P&amp;I, order intake increased by JPY219.8 billion YoY due to favorable performance in Engineering, Metals Machinery, Machinery Systems, and Waste-to-Energy Systems. Revenue was mostly in line with Q1-3 FY2023 levels. Improved margins in Engineering and Metals Machinery, combined with increased revenue in Engineering and Machinery Systems helped to raise segment business profit by JPY12.6 billion YoY.</p><p class=\"\">In LT&amp;D, revenue increased by JPY9.2 billion YoY as increased sales in Engines and Heating, Ventilation &amp; Air Conditioning (HVAC) offset a decline in units sold in Logistics Systems. The decrease in units sold in Logistics System and additional costs from a supply chain disruption in Turbochargers resulted in a JPY16.5 billion YoY decrease in segment business profit.</p><p class=\"\">In ADS, order intake decreased by JPY22.0 billion YoY due to large order volume booked in Q1-3 FY2023 in Defense &amp; Space. Revenue increased by JPY162.7 billion YoY, mainly in Defense &amp; Space. Increased revenue and higher margins in Defense &amp; Space outpaced the negative impact from a drop in 777 unit deliveries in Commercial Aviation, and segment business profit increased by JPY16.1 billion YoY.</p><p class=\"\">FY2024 Earnings Forecast</p><p class=\"\">MHI revised its guidance for the period ending March 31, 2025, increasing the forecasts for order intake, revenue, business profit, net income, EBITDA, and free cash flow over the previous announcement made November 5, 2024, to reflect stronger-than-anticipated performance during Q1-3. The full-year dividend target remains unchanged.CFO Message</p><p class=\"\">\"In the first three quarters of this fiscal year, many of our businesses continued the strong performance I shared with you during our last release, with all major financial indicators up year-on-year, especially business profit and net income,\" said Hisato Kozawa, MHI's Chief Financial Officer. He continued: \"Regarding order intake, GTCC and Aero Engines in Energy, and Metals Machinery in P&amp;I were star performers, with total orders exceeding the high bar set during the same period in FY2023. Revenue increased in Energy and ADS, which were executing on substantial order backlogs. Increased revenue, improved margins, the positive impact from yen depreciation, as well as a rebound from one-time charges incurred in the previous year drove the large profit growth seen during this period.</p><p class=\"\">\"We have increased our full-year guidance for most major indicators based on our strong performance during the first three quarters. Notably, we have updated our order intake target from JPY6 trillion to JPY6.4 trillion and business profit from JPY350 billion to JPY380 billion,\" Kozawa went on. \"In the fourth quarter, we aim to outperform this updated guidance by actively mitigating risks while building on the successes of the first three quarters.\"Note regarding forward looking statements:</p><p class=\"\">Forecasts regarding future performance outlined in these materials are based on judgments made in accordance with information available at the time they were prepared. As such, these projections include risk and uncertainty. Investors are recommended not to depend solely on these projections when making investment decisions. Actual results may vary significantly from these projections due to a number of factors, including, but not limited to, economic trends affecting the Company's operating environment, fluctuations in the value of the Japanese yen to the U.S. dollar and other foreign currencies, and trends in Japan's stock markets. The results projected here should not be construed in any way as a guarantee by the Company.</p><p class=\"\">About MHI Group</p><p class=\"\">Mitsubishi Heavy Industries (MHI) Group is one of the world's leading industrial groups, spanning energy, smart infrastructure, industrial machinery, aerospace and defense. MHI Group combines cutting-edge technology with deep experience to deliver innovative, integrated solutions that help to realize a carbon neutral world, improve the quality of life and ensure a safer world. For more information, please visit www.mhi.com or follow our insights and stories on spectra.mhi.com.</p><p class=\"\">Source: Mitsubishi Heavy Industries, Ltd.</p><p class=\"\">Copyright 2025 JCN Newswire . All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_JCN95759a:0-mitsubishi-heavy-industries-achieves-double-digit-order-intake-and-profit-growth-in-first-three-quarters-raises-full-year-guidance/",
            "pub_date": "2025-02-04 18:15:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463409:0",
            "title": "Manolete Partners Says Trial for Second Wave of Truck Cartel Claims Delayed to September 2026",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Manolete Partners  said Tuesday the UK Competition and Appeals Tribunal moved the trial window for the second wave of truck cartel claims to the end of September 2026 from November 2025 after receiving many applications from interested parties. </p><p class=\"\">Settlement discussions continue on the cases and those not settled in advance will proceed to trial, according to the British insolvency litigation financing company.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463409:0/",
            "pub_date": "2025-02-04 18:15:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463407:0",
            "title": "Temenos to Power Aldermore Bank's Small Business Savings Launch",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Temenos  will supply its cloud-based software to help Aldermore Bank introduce new savings notice accounts for small businesses. </p><p class=\"\">The UK-based bank will integrate the Temenos Business &amp; Corporate Enterprise Service to quickly roll out new products and scale operations as needed, according to a Tuesday release from the Swiss banking software company. </p><p class=\"\">After launching the new accounts, Aldermore plans to transfer its existing business savings accounts to the platform to consolidate multiple legacy systems.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463407:0/",
            "pub_date": "2025-02-04 18:06:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0QU:0",
            "title": "Ferragamo shares slide after company parts ways with CEO Gobbetti",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Ferragamo  shares slide more than 5% on Tuesday after the Italian luxury group announced that its chief executive Marco Gobbetti would leave next month after little over three years in charge.</p><p class=\"\">Gobbetti, the former chief of British brand Burberry , had been attempting to turn around the Florentine brand but progress had been slower than hoped.</p><p class=\"\">\"While waiting for more clarity on the new phase of the relaunch, we see potential negative implications in the short term, also considering that the transition phase could also involve the creative team and part of the top management,\" analysts at Italian broker Equita said in their daily note. </p><p class=\"\">They added that Gobbetti's exit could be the consequence of results that fell below expectations and the delay in the brand's revival compared to initial objectives. </p><p class=\"\">Gobbetti joined the group at the beginning of 2022 and promised a quick turnaround. However, last year he warned that hitting turnaround goals could take longer than anticipated.</p><p class=\"\">Briton Maximilian Davis was hired as creative director in 2022 shortly after Gobbetti took charge of the company. </p><p class=\"\">Ferragamo, controlled by the family of late founder Salvatore Ferragamo, said on Monday it had started the search for a new CEO, who will be in charge of \"continuing the activities of brand renewal and heritage enhancement\".    </p><p class=\"\">Shares in Ferragamo were down 4.64% at 0935 GMT. </p><p class=\"\">In the last year, the shares lost around 38% of their value and hit a record low at the beginning of December. </p><p class=\"\">\"We think his departure could potentially be seen as a small positive by the market, as the brand has been underperforming the sector over the past few years,\" analysts at Barclays said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0QU:0-ferragamo-shares-slide-after-company-parts-ways-with-ceo-gobbetti/",
            "pub_date": "2025-02-04 18:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308416:0",
            "title": "Crude Oil Prices Decline as U.S. and China Exchange Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crude oil prices dropped after U.S. tariffs on China took effect and as U.S. President Donald Trump paused tariffs on Canada and Mexico for a month. </p><p class=\"\">Brent crude fell 1.4% to US$74.88/barrel and West Texas Intermediate crude lost 2.1% to US$71.62/b at last look early Tuesday. </p><p class=\"\">U.S. tariffs on China took effect at midday in Asia, resulting in retaliatory levies by China of 15% on U.S. coal and liquefied natural gas and 10% on crude starting Feb. 10, Reuters said in a Tuesday report. </p><p class=\"\">\"China's counter-tariffs on the US may be perceived as a sign of escalation and may reduce the likelihood of a temporary resolution akin to U.S. agreements with Mexico and Canada,\" Reuters quoted IG market strategist Yeap Jun Rong as saying. </p><p class=\"\">Markets are now pricing in potential downside risks to global growth on fears of a trade war between the two countries, the report said. </p><p class=\"\">Still, WTI is not expected to be significantly affected as it can go to other regions easily, Reuters quoted Sparta Commodities senior analyst June Goh as saying.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308416:0/",
            "pub_date": "2025-02-04 18:06:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0NZ:0",
            "title": "European shares decline as trade war fears loom; UBS slides",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">UBS Group falls despite profit beat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Vodafone falls as Germany performance worsens</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Infineon rises after better-than-expected Q1, positive guidance</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Diageo falls after withdrawing medium-term goals</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">STOXX down 0.3%</li></ul></span></div><span><p class=\"\">    European shares extended losses on Tuesday, led by financials following UBS's quarterly earnings, as investors grew unsettled over fears of a trade war between top global economies, the U.S. and China. </p><p class=\"\">The pan-European STOXX 600 index  was down 0.3% as of 0940 GMT. The benchmark had logged its biggest single-day drop in more than one month on Monday.</p><p class=\"\">China announced tariffs on some U.S. imports, starting from Feb. 10, in retaliation for Washington's 10% additional levies on Beijing, reigniting concerns about a trade war between the economies.</p><p class=\"\">\"The key driver right now is the trade tariff and just the uncertainty that seems to be coming with it,\" said Fiona Cincotta, senior market analyst at City Index, adding that latest developments will keep the markets \"wary of a full-blown trade war erupting\".</p><p class=\"\">Financial Services index (.SXFP) dropped 1.2%, dragged by a 5.1% fall in UBS Group  despite the Swiss lender beating its fourth-quarter profit forecast. UBS CEO Sergio Ermotti said higher capital requirements in Switzerland would hurt returns for shareholders.</p><p class=\"\">\"Those comments would be sufficient to be able to put a dampener on otherwise upbeat numbers because that's sort of pointing to lower returns going forward,\" City Index's Cincotta said.</p><p class=\"\">Diageo  fell 3.6% after the world's top spirits maker  withdrew its medium-term organic sales growth target as it took steps to try and mitigate the impact of U.S. tariffs on its tequila and Canadian whisky.</p><p class=\"\">The stock brought down the food and beverages index (.SX3P) by 0.9%. The energy index (.SXEP) lost 0.8% as crude prices fell after U.S. tariffs on China took effect.</p><p class=\"\">Telecommunications (.SXKP) fell 0.8% as Vodafone dropped 5.6% after the mobile group reported another deterioration in Germany in its third quarter. The stock was the biggest percentage loser on the UK's FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- -->, which fell 0.3%.</p><p class=\"\">        Embracer  shares fell 43.4% ahead of the gaming group's spin-off by tabletop game publisher Asmodee.</p><p class=\"\">Providing slight relief, U.S. President Donald Trump on Monday agreed to a 30-day pause in 25% tariffs on Mexico and Canada, in return for concessions on border and crime enforcement with the two neighbouring countries.</p><p class=\"\">Trump has also threatened to impose tariffs on the 27-nation European Union, but did not specify when.</p><p class=\"\">Infineon  jumped 9.7% after the German chipmaker beat first-quarter revenue estimates and slightly raised its full-year revenue outlook.</p><p class=\"\">The earnings lifted the technology index (.SX8P) by 0.5%.</p><p class=\"\">Among other stocks, France's BNP Paribas  rose 2.2% after a forecast-beating jump in net income in the fourth quarter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0NZ:0-european-shares-decline-as-trade-war-fears-loom-ubs-slides/",
            "pub_date": "2025-02-04 18:06:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463403:0",
            "title": "Japan's Mirrorless Camera Sales See Boost in December 2024, Jefferies Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's camera market showed good momentum in December 2024, with strong mirrorless camera sales and modest growth in lens sales, Jefferies said in a Monday research note. </p><p class=\"\">Mirrorless camera shipments rose about 16.8% year over year to 409,000 units, a third consecutive month of double-digit rise, data from the Camera &amp; Imaging Products Association (CIPA) said. </p><p class=\"\">Meanwhile, 35mm lens shipments rose 3.2%, continuing the growth seen in November 2024. </p><p class=\"\">Jefferies said both the mirrorless and interchangeable lens markets will maintain their robust levels even with tempered growth expectations. </p><p class=\"\">Overall digital camera shipment volume rose 14% year over year to 664,000 units, with their value surging 22.5% to 62.2 billion yen, according to the Jefferies note. </p><p class=\"\">For the full 2024, digital camera shipments reached 8.49 million units, a 10% year-over-year rise and the first volume growth in five years, Jefferies said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463403:0/",
            "pub_date": "2025-02-04 18:07:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463404:0",
            "title": "Daishi Hokuetsu Financial's Fiscal Nine-Month Profit Rises 13%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Daishi Hokuetsu Financial's  attributable profit rose 13% to 21.2 billion yen in the nine months ended Dec. 31, 2024 from 18.7 billion yen in the year-ago period. </p><p class=\"\">Basic earnings per share at the regional banking group increased to 242.78 yen from 208.73 yen in the previous year, according to a Jan. 31 filing with the Tokyo Stock Exchange. </p><p class=\"\">Ordinary revenue grew 4.1% to 143.4 billion yen from 137.7 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to rise 18% to 25 billion yen or 286.57 yen per share, while ordinary profit is forecast to increase 15% to 35.6 billion yen. </p><p class=\"\">The company is seen to declare a total of 145 yen per share at year-end.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463404:0/",
            "pub_date": "2025-02-04 18:07:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002782:0",
            "title": "Reckitt Benckiser's Portfolio Reshaping Brings Greater Risks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reckitt Benckiser's valuation seems undemanding at first look but the stock is expected to face minimal earnings per share growth until 2027 due to its reshaping of its portfolio, Barclays analysts say after downgrading the stock to equal weight from overweight. The U.K. consumer-goods company's plans to slim down the business makes sense, and the plan to return excess proceeds reflects a clear commitment to shareholder value, they say in a note. Looking ahead, the company's performance in 2027 could be in line with main peers, but Reckitt faces greater execution risks due to its portfolio transformation, they add. Shares are down 1.1% at 52.46 pounds. (michael.susin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002782:0/",
            "pub_date": "2025-02-04 18:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002780:0",
            "title": "Europe Could Be More Vulnerable From Trump Tariffs Than First Thought — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002780:0/",
            "pub_date": "2025-02-04 18:08:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308414:0",
            "title": "Update: Palantir Technologies Q4 Adjusted Earnings, Sales Rise; Sets Q1 Outlook; Shares Up Premarket",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates with the stock move and analyst comments in the headline and the last four paragraphs.)</p><p class=\"\">Palantir Technologies  reported Q4 adjusted earnings late Monday of $0.14 per share, up from $0.08 a year earlier. </p><p class=\"\">Analysts surveyed by FactSet expected $0.11. </p><p class=\"\">Revenue in the three months ended Dec. 31 rose to $827.5 million from $608.4 million a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $775.8 million. </p><p class=\"\">The company expects Q1 revenue of $858 million to $862 million. Analysts surveyed by FactSet expect $799.6 million. </p><p class=\"\">The company expects full-year revenue between $3.74 billion to $3.76 billion. Analysts polled by FactSet expect $3.50 billion. </p><p class=\"\">Shares of the company jumped more than 17% in premarket activity Tuesday. </p><p class=\"\">\"We are very impressed by these results,\" Mizuho said in a note to clients Monday. But the brokerage added that \"valuation cannot and should not be irrelevant, and we find it exceedingly difficult to justify PLTR's multiple that in our view already discounts significant further acceleration and upside versus consensus expectations.\"</p><p class=\"\">Palantir's shares have \"dramatically\" spiked over the past few months and trade at 56x calendar year 2026 estimated revenue for perhaps \"mid-30s expected growth,\" Mizuho said. </p><p class=\"\">Mizuho reiterated its underperform rating for the shares but \"materially\" raised its price target to $80 from $44 on the \"strong execution and significant upward revisions.\"</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308414:0/",
            "pub_date": "2025-02-04 18:08:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463408:0",
            "title": "Nintendo's Nine Month Profit Falls Nearly 42% Amid Slowing Switch Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nintendo's  attributable profit fell 41.9% to 237.2 billion yen in the fiscal nine months ended Dec. 31, 2024, from about 408 billion yen a year ago due to lower hardware and software sales as the Nintendo Switch platform matures. </p><p class=\"\">The company said basic earnings per share dropped to 203.73 yen from 350.48 yen a year ago, according to a Tokyo Stock Exchange filing on Tuesday. </p><p class=\"\">Net sales declined 31.4% to 956.2 billion yen compared with the previous year's 1.395 trillion yen, which was boosted by The Legend of Zelda: Tears of the Kingdom and The Super Mario Bros. Movie. </p><p class=\"\">The company has revised its full-year earnings forecast downward due to lower-than-expected Switch sales. </p><p class=\"\">It forecasted attributable profit to decline 45% to 270 billion yen or 231.91 yen per share and net sales to decrease 28.8% to 1.19 trillion yen for the fiscal year ending March 31. </p><p class=\"\">The company expects to pay a year-end dividend of 81.00 yen per share, bringing the total payout to 116.00 yen per share for the current year. </p><p class=\"\">Nintendo shares put on more than 2% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463408:0/",
            "pub_date": "2025-02-04 18:08:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}