{
    "data": [
        {
            "id": "te_news:446507:0",
            "title": "European Stocks Lack Direction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Major European bourses struggled for direction, with the STOXX 50 inching up 0.1% while the STOXX 600 slipped 0.2%, as traders continued to weigh trade tensions and fresh corporate earnings.</p><p class=\"\">A 10% US tariff on Chinese goods took effect today, prompting Beijing to announce retaliatory tariffs on select US exports, including oil, gas, and certain automobiles, along with an antitrust probe into Google.</p><p class=\"\">Meanwhile, President Trump postponed the planned 25% tariffs on Mexico and Canada for a month in exchange for measures to curb migration and drug trafficking at the border.</p><p class=\"\">Sector-wise, autos, telecom, and food &amp; beverages were among the worst performers, while basic resources led the gains.</p><p class=\"\">On the corporate front, UBS shares rose about 1% after the bank posted stronger-than-expected Q4 profits.</p><p class=\"\">Infineon surged over 11% after upgrading its financial-year outlook, while BNP Paribas gained nearly 3% following higher earnings and an increase in shareholder returns.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446507:0-european-stocks-lack-direction/",
            "pub_date": "2025-02-04 16:26:37",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:658a89349094b:0",
            "title": "Buy Aster DM Healthcare; target of Rs 620 Prabhudas Lilladher",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Prabhudas Lilladher's research report on Aster DM Healthcare</p><p class=\"\">ASTER DM Healthcare’s (ASTERDM) Q3 consolidated EBITDA (adj. for ESOP) grew 23% YoY to Rs1.94bn, in line with our estimate. ASTERDM India’s EBITDA has increased sharply over the last 2 years (29% CAGR over FY22-24). Our FY25-27E EBITDA estimate stands unchanged. We estimate 23% EBITDA CAGR over FY25-27E aided by scale-up in margins, healthy ARPOB and bed additions. ASTER DM’s board has recently approved merger with Quality care (QCIL) that makes them third largest healthcare chain by revenue and bed capacity in India. The combined entity is trading at ~20x EV/EBITDA on FY27E (adj. for minority stake and rental) which is discount to some of peers and unwarranted given higher growth profile, backing of marquee PE investors like Blackstone and combined entity scale of operations.</p><p class=\"\">Outlook</p><p class=\"\">We recommend BUY rating with TP of Rs620/share, valuing 27x EV/EBITDA for combined entity.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Aster DM Healthcare - 04022025 - prabhu</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:658a89349094b:0-buy-aster-dm-healthcare-target-of-rs-620-prabhudas-lilladher/",
            "pub_date": "2025-02-04 16:26:56",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308380:0",
            "title": "Trade Desk Insider Sold Shares Worth $17,540,007, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jeffrey Terry Green, 10% Owner, Director, President and Chief Executive Officer, on January 30, 2025, sold 143,985 shares in Trade Desk  for $17,540,007. Following the Form 4 filing with the SEC, Green has control over a total of 847,219 Class A common shares of the company, with 133,183 shares held directly and 714,036 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1671933/000167193325000007/xslF345X05/wk-form4_1738631352.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1671933/000167193325000007/xslF345X05/wk-form4_1738631352.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308380:0/",
            "pub_date": "2025-02-04 16:27:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002140:0",
            "title": "TotalEnergies Expected to Report Lower Fourth-Quarter Profit, Weakness in Downstream Division — Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Whittaker</p><p class=\"\">TotalEnergies is scheduled to report results for the fourth quarter and publish its 2025 guidance on Wednesday. Here is what you need to know.</p><p class=\"\">NET INCOME FORECAST: Analysts expects TotalEnergies to report $4.21 billion in quarterly reported net profit according to Visible Alpha consensus. This would compare with $5.06 billion it reported a year prior.</p><p class=\"\">Adjusted net profit is expected to be $3.94 billion compared with $5.23 billion for the same period last year.</p><p class=\"\">PRODUCTION FORECAST: Unlike its European peers, the French oil and gas major reported a resilient third-quarter update in January, RBC Capital Markets analysts wrote in a research note.</p><p class=\"\">TotalEnergies said it expects to report a slight sequential increase in fourth-quarter hydrocarbon production and in line with its guidance of between 2.4 million and 2.45 million oil-equivalent barrels a day. Hydrocarbon production in the third quarter was 2.4 million oil-equivalent barrels a day.</p><p class=\"\">TotalEnergies shares are down 5.5% in the past 12 months but up nearly 5% in the year-to-date.</p><p class=\"\">WHAT TO WATCH:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">SHAREHOLDER RETURNS: TotalEnergies is expected to keep quarterly buyback rate unchanged at $2 billion, analysts at UBS wrote.</li><li class=\"listItem-bmN0_SHH\">REFINING MARGINS: Weakness in its downstream division is expected to weigh on TotalEnergies fourth-quarter results, RBC Capital Markets analysts Biraj Borkhataria and Adnan Dhanani wrote. Weak refining and chemicals margins are a theme across the sector and continue to remain under pressure, they said. In January's update, TotalEnergies said its European refining margin marker was $25.9 a metric ton, an increase from $15.4 a ton in the prior quarter. However this is significantly below the $52.6 a ton it reported in the fourth quarter of 2023.</li><li class=\"listItem-bmN0_SHH\">2025 OBJECTIVES: Alongside its fourth-quarter results, TotalEnergies will present its 2025 objectives but this is not expected to contain major updates to strategy or guidance, the RBC analysts wrote. However, they expect the company to highlight the prospect of signing premium 'clean-firm power' deals in the U.S. given its growing position in the Texas power market and the excitement around U.S. data centers and power demand.</li><li class=\"listItem-bmN0_SHH\">U.S. DUAL-LISTING: TotalEnergies could formalise its U.S. dual-listing intentions in its 2025 objectives document after its Autumn investor day indicated broad support for the move, JPMorgan analysts wrote in a research note.</li></ul><p class=\"\">Write to Adam Whittaker at adam.whittaker@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002140:0/",
            "pub_date": "2025-02-04 16:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002048_20250204002142:0",
            "title": "Correct: Rheinmetall to Supply 102 HX Trucks as Part of the Contract",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002048_20250204002142:0/",
            "pub_date": "2025-02-04 16:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFNbxgbTB:0",
            "title": "Independent Equity Research Report on Navamedic - Positioned for Growth in Promising Healthcare Segments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Navamedic ASA (”Navamedic” or ”the Company”) is a Nordic pharmaceutical company offering a diversified portfolio of prescription drugs, consumer health products, and hospital solutions in the Nordic region, the Baltics, and the Benelux region. Following a strategic shift in 2019, transitioning from a distribution-based model to owning brands, Navamedic has enhanced profitability and scalability. The Company’s licensing platform, enabling control over product portfolios and facilitating market expansion, positions Navamedic for sustained growth going forward. Navamedic is estimated to reach an EBIT of NOK 71.1m in 2026 and based on an applied EV/EBIT target multiple of 10.4x, a potential price per share of NOK 37.5 is implied in a Base scenario.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read the equity research report here</strong></p><p class=\"\">About Analyst Group: One of Sweden's leading analysis houses with a focus on small and medium-sized listed companies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Read more about Analyst Group</strong></p><p class=\"\">This is a press release from Analyst Group regarding the publication of an independent equity research report on Navamedic. Navamedic has had no opportunity to influence the parts where the Analyst Group has had opinions about the Company, future valuation or anything else that could conceivably constitute a subjective assessment.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFNbxgbTB:0-independent-equity-research-report-on-navamedic-positioned-for-growth-in-promising-healthcare-segments/",
            "pub_date": "2025-02-04 16:28:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002146:0",
            "title": "Hong Kong Shares Higher; Investors Monitor Tariff Developments — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong shares ended higher, with the Hang Seng Index rising 2.8% to 20789.96. The Hang Seng Tech Index added 5.1% to 4977.38. Investors were closely monitoring for the latest tariff-related developments from the U.S., Mexico, Canada and China. Trade tensions are likely to accelerate China's domestic economic reform, while major U.S.-China currency agreements are unlikely to take place, HSBC analysts write in a research note. Among major stocks, technology names led the gains, with Meituan rising 6.0% and Alibaba adding 4.0%. Lenovo was 6.9% higher. Decliners included Greentown China, which was 2.25% lower, and Shenzhen Pagoda Industrial, which dropped 4.9%. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002146:0/",
            "pub_date": "2025-02-04 16:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002147:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0829 GMT - Hong Kong shares ended higher, with the Hang Seng Index rising 2.8% to 20789.96. The Hang Seng Tech Index added 5.1% to 4977.38. Investors were closely monitoring for the latest tariff-related developments from the U.S., Mexico, Canada and China. Trade tensions are likely to accelerate China's domestic economic reform, while major U.S.-China currency agreements are unlikely to take place, HSBC analysts write in a research note. Among major stocks, technology names led the gains, with Meituan rising 6.0% and Alibaba adding 4.0%. Lenovo was 6.9% higher. Decliners included Greentown China, which was 2.25% lower, and Shenzhen Pagoda Industrial, which dropped 4.9%. (tracy.qu@wsj.com)</p><p class=\"\">0824 GMT - Singapore banks' 4Q 2024 earnings are likely to be resilient, says Yeap Jun Rong, IG's market strategist in a note. The bulk of the banks' earnings, which remain supported by net interest income, is expected to stay resilient amid the high-for-longer interest rate environment, he writes. The banks' 4Q loan momentum may also see some pick-up, with data suggesting that overall loans have risen in December from November, he says. Higher confidence around the economy with Singapore's low unemployment rate could have partly contributed to an improvement in lending conditions, Yeap adds. (amanda.lee@wsj.com)</p><p class=\"\">0821 GMT - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0811 GMT - Novartis is set to overcome a wave of patent expirations during 2025, Deutsche Bank analyst Emmanuel Papadakis says in a note. The Swiss pharma giant surprised with its margin performance in the last quarter and its 2025 outlook that came ahead of analysts expectations, he says. While some of the 4Q revenue beat was attributed to rebates, Novartis appears well-positioned to continue exceeding market expectations, the analyst says. Deutsche Bank lifts back the stock rating to buy from hold, which had been previously nudge down due to patent expiry worries. (helena.smolak@wsj.com)</p><p class=\"\">0759 GMT - Infineon Technologies' sales guidance is slightly ahead of market expectations, Citi analysts write in a note to clients. The German chip maker said revenue would be flat to slightly up in the year to the end of September from the 14.96 billion euros it reported for fiscal 2024, better than a previous forecast of a slight decline. The new projection equates to roughly 15 billion euros against Vara Research consensus of 14.59 billion euros, Citi analysts note. Infineon's guidance lift is mostly driven by expectations of a stronger dollar based on an assumed exchange rate of $1.05 to the euro compared with $1.10 previously. (mauro.orru@wsj.com)</p><p class=\"\">0746 GMT - UBS Group's fourth-quarter results beat expectations and are likely to trigger a small positive share-price reaction, Morgan Stanley's Giulia Aurora Miotto says in a research note. The better-than-expected results will come as a relief after some investors saw negative implications from smaller peer Julius Baer's update Monday, the analyst says. UBS beat expectations mainly thanks to costs, but its top line was also a touch better than anticipated, Morgan Stanley says. By division, the Swiss group's investment bank delivered the largest outperformance relative to expectations, the analyst says. Its global wealth management unit experienced mixed trends, its asset management exceeded expectations thanks to costs, and its personal and corporate banking was weaker than anticipated, Morgan Stanley says. (adria.calatayud@wsj.com)</p><p class=\"\">0745 GMT - Nordic markets are seen opening slightly higher, with IG calling the OMXS30 up 0.2% at around 2638. The market reactions after the weekend's tariff news were largely as expected, SEB analysts say in a note. The U.S. dollar strengthened, while trade-dependent currencies such as the euro and smaller currencies such as the Swedish krona initially took a beating. Stock markets in Europe closed about 1% lower after a late recovery. The 10% tariffs on China come into force Tuesday, but are interpreted as milder than previously feared, SEB says. China has this morning responded with its own tariffs on imports of energy raw materials, agricultural equipment and some cars from the U.S. OMXS30 closed at 2632.64, OMXN40 at 2541.08 and OBX at 1411.20. (dominic.chopping@wsj.com)</p><p class=\"\">0731 GMT - The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p><p class=\"\">0727 GMT - UBS Group's fourth-quarter results were better than expected and benefited from good cost management, Vontobel's Andreas Venditti says in a research note. The Swiss banking group posted an underlying pretax profit of $1.77 billion for the fourth quarter, or 24% ahead of consensus forecasts thanks to lower expenses than expected, the analysts say. Its dividend was also higher than anticipated and came alongside plans to buy back up to $3 billion in shares this year, in line with expectations, Vontobel says. UBS remains on track to substantially complete the integration of Credit Suisse by the end of next year, even if expenses are now expected to be slightly higher than previously targeted, the analyst says. (adria.calatayud@wsj.com)</p><p class=\"\">0723 GMT - UBS Group's plans to step up share buybacks and a better-than-expected net profit mean its 4Q results look positive on several fronts, RBC Capital Markets' Anke Reingen and Matthew Russell say in a research note. The higher-than-expected net profit was mainly thanks to the Swiss group's investment bank, where revenue was well ahead of consensus expectations, RBC says. Costs came in higher than expected in some divisions, but this could be due to seasonal factors, the analysts say. UBS provided more detailed targets for the turnaround of its U.S. global-wealth-management unit, which is positive, RBC says. On the integration of Credit Suisse, it reiterated its end-2026 savings target but raised its expectations for expenses, RBC says. (adria.calatayud@wsj.com)</p><p class=\"\">0705 GMT - Japanese shares closed higher, in line with most Asian markets, which took a breather after U.S. President Trump agreed to postpone the start of tariffs on Mexico and Canada by a month. The Nikkei Stock Average rose 0.7% to 38798.37. The index trimmed earlier gains after China announced retaliatory tariffs on some U.S. goods. Auto and financial stocks advanced. Toyota Motor was up 1.7%, while Nissan Motor closed 0.7% higher. Mitsubishi UFJ Financial and Sumitomo Mitsui Financial gained 0.8% and 0.7%, respectively. USD/JPY was at 154.79, compared with 155.37 as of Monday 5 p.m. Eastern time. (venkat.pr@wsj.com)</p><p class=\"\">0541 GMT - Hong Kong shares pare gains after China announces retaliatory tariffs on some U.S. goods. The benchmark Hang Seng Index is up 1.6% at 20545.64, while the Hang Seng Tech Index is 3.4% higher at 4900.52. China's move comes days after U.S. President Trump announced an additional 10% tariff on imports from the country, which take effect Tuesday. Among advancers, SMIC rises 6.8%, Li Auto climbs 6.6% and Lenovo Group adds 6.3%. Meanwhile, ENN Energy falls 1.3% and NetEase sheds 1.6%. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002147:0/",
            "pub_date": "2025-02-04 16:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463329:0",
            "title": "Vår Energi Plans to Use OneSubsea's Subsea Production Systems",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vår Energi  signed a letter of intent with OneSubsea to secure subsea production systems for its projects, according to a Tuesday release. </p><p class=\"\">The oil and gas company aims to shorten its subsea tie-back development by up to one year through the pre-commitment deal with the joint venture by SLB (SLB.PA), Aker Solutions  and Subsea7 . </p><p class=\"\">The order includes a standard four-well slot template and a single-well satellite structure, with the components needed for drilling to be delivered in 2026. Meanwhile, the complete subsea production system is scheduled for delivery before the summer of 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463329:0/",
            "pub_date": "2025-02-04 16:29:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463327:0",
            "title": "US Tightens Customs Rules for Packages from China, Hong Kong",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Packages mailed from China and Hong Kong will now be subject to formal customs entry, and will no longer be eligible for administrative exemption from duties, according to a notice by the US Customs and Border Protection released Monday night in the US. </p><p class=\"\">The rules come into effect after US tariffs against Chinese goods came into effect midnight of Tuesday to \"address the synthetic opioid supply chain in the People's Republic of China,\" CBP said. </p><p class=\"\">Among the exemptions that will be removed are goods eligible for de minimis clearance, CBP said. </p><p class=\"\">Customs and Border Protection also informed shippers on how to handle such shipments in accordance with tariff guidelines on Chinese goods. </p><p class=\"\">\"As we transition to execution of the Executive Order, it is extremely important that the trade maintain awareness of the shipments they are responsible for and are aware of the messaging that they are receiving from CBP,\" according to the notice.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463327:0/",
            "pub_date": "2025-02-04 16:29:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU1M0:0",
            "title": "Poland needs to cut spending and raise taxes, OECD says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Poland's higher social, health and defence spending requires sustained fiscal adjustment to reduce the budget deficit and avoid excess demand, the Organisation for Economic Co-operation and Development (OECD) said in a report on Tuesday.</p><p class=\"\">   The OECD sees Poland's economy expanding by 3.4% in 2025 and 3% in 2026, supported by improving demand from abroad, falling inflation and an eventual gradual easing of interest rates.</p><p class=\"\">The report recommends ensuring that monetary policy remains sufficiently restrictive to bring inflation to target in the medium-term, amid pressures from a robust labour market and strong wage growth.</p><p class=\"\">\"Fiscal support measures, combined with additional spending on social policies, health and defence, have opened up a substantial fiscal deficit,\" the OECD said in the report.</p><p class=\"\">The OECD sees Poland's 2025 fiscal deficit remaining broadly similar to the 5.8% of GDP in 2024. It said the government's plan to lower the general government deficit-to-GDP ratio by around one percentage point annually over 2026-28 was \"ambitious\" and likely to dampen growth. </p><p class=\"\">\"Achieving a prudent fiscal path will require reducing expenditures and boosting tax revenues, while ensuring sustainable pension provision and adequately funding the green transition,\" the report said.</p><p class=\"\">According to the OECD, Poland could boost revenues by changing the property tax to value-based from area-based, taxing vehicles according to emissions, raising fuel duties, restricting preferential VAT rates and hiking environmental taxes.</p><p class=\"\">It also suggested reviewing Poland's universal family benefits and cutting benefits for those on higher incomes.</p><p class=\"\">Poland's headline inflation has fallen sharply from a peak in early 2023, but it has rebounded since coming within target in the first half of 2024 and core inflation remains elevated amid a tight labour market and strong wage growth, the OECD said. </p><p class=\"\">\"While the economy has been recovering since mid-2023 as inflation declined, inflationary pressure from the relatively robust labour market suggests that monetary policy should remain sufficiently restrictive to ensure that inflation durably returns to target,\" it said.</p><p class=\"\">The report said with the withdrawal of the remaining government energy support measures in the second half of 2025, headline inflation is projected to rise to 5% in 2025 before falling to 3.9% in 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU1M0:0-poland-needs-to-cut-spending-and-raise-taxes-oecd-says/",
            "pub_date": "2025-02-04 16:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Wkr2QPY1:0",
            "title": "Invitation to presentation of the year-end report January-December 2024 for Truecaller AB (publ)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Truecaller AB<p class=\"\">Truecaller, the leading global platform for verifying contacts and blocking unwanted communication, is publishing its year-end report for January-December on Tuesday 18<strong class=\"root-Tkn6WL2y\">th</strong> <strong class=\"root-Tkn6WL2y\">of February 2024 at 07.30 CET.</strong></p><p class=\"\">Rishit Jhunjhunwala, CEO and Odd Bolin, CFO presents the report and answers questions in a webcast and conference call at 13.00 CET the same day. The presentation will be held in English.</p><p class=\"\">If you wish to participate via webcast please use the link:</p><p class=\"\">https://truecaller.events.inderes.com/q4-report-2024</p><p class=\"\">If you wish to participate via teleconference please register on the link below. After registration you will be provided phone numbers and a conference ID to access the conference. You can ask questions verbally via the teleconference.</p><p class=\"\">https://conference.inderes.com/teleconference/?id=50050364</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\">Andreas Frid, Head of IR &amp; Communication</p><p class=\"\">+46 705 29 08 00</p><p class=\"\">andreas.frid@truecaller.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Truecaller:</strong></p><p class=\"\">Truecaller (TRUE B) is the leading global platform for verifying contacts and blocking unwanted communication. We enable safe and relevant conversations between people and make it efficient for businesses to connect with consumers. Fraud and unwanted communication are endemic to digital economies. especially in emerging markets. We are on a mission to build trust in communication. Truecaller is an essential part of everyday communication for more than 433 million active users. Truecaller is listed on Nasdaq Stockholm since 8 October 2021. For more information please visit corporate.truecaller.com</p><p class=\"\">https://news.cision.com/truecaller-ab/r/invitation-to-presentation-of-the-year-end-report-january-december-2024-for-truecaller-ab--publ-%2Cc4100016</p><p class=\"\">Press release invitation Q4 2024 250204</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Wkr2QPY1:0-invitation-to-presentation-of-the-year-end-report-january-december-2024-for-truecaller-ab-publ/",
            "pub_date": "2025-02-04 16:30:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0G3:0",
            "title": "Bavarian Nordic drops 10% after earnings guidance comes short",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Bavarian Nordic  slump around 10% after the Danish vaccine maker announced 2025 earnings guidance below expectations </p><p class=\"\">** The company sees 2025 revenue in the range of 5.7-6.7 billion Danish crowns vs an LSEG estimate of 6.42 billion and expects EBITDA margin of 26%-30%</p><p class=\"\">** It also flagged that revenue and EBITDA will vary throughout the year, with first quarter of 2025 being light</p><p class=\"\">** Kempen Life Sciences Research says the revenue guidance is in line with consensus, but EBITDA outlook came in below</p><p class=\"\">**  The stock falls to its lowest since November and is among top losers on Europe-wide STOXX 600  index</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0G3:0-bavarian-nordic-drops-10-after-earnings-guidance-comes-short/",
            "pub_date": "2025-02-04 16:30:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463323:0",
            "title": "Market Chatter: 2025 Spring Festival Box Office Surpasses 8.3 Billion Yuan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's 2025 Spring Festival box office surpassed 8.3 billion yuan as of Feb. 3, STCN reported Monday, citing Lighthouse Professional Edition. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463323:0/",
            "pub_date": "2025-02-04 16:21:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463315:0",
            "title": "Market Chatter: UK Considers Pulling Out of $1.5 Billion Commitment for TotalEnergies Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UK government is seeking legal advice for potentially withdrawing a commitment of $1.5 billion for a TotalEnergies  liquefied natural gas project in Mozambique. </p><p class=\"\">Government agency UK Export Finance made the commitment in June 2020 for the $20 billion project, which faced delays due to terrorist attacks, London's Financial Times reported on Tuesday, citing two people familiar with the situation. The French oil and gas giant has now been attempting to restart the project. </p><p class=\"\">The current Labour government in the UK is pushing to move away from fossil fuels. A person close to the matter told the publication that the government is seeking ways to pull out of the commitment but also fears legal action. </p><p class=\"\">TotalEnergies did not immediately respond to MT Newswires' request for comment. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463315:0/",
            "pub_date": "2025-02-04 16:21:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:829e8e7cb094b:0",
            "title": "Why Is XRP Going Up? Price Prediction Suggests Crypto Token May Jump 37%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">XRP lost nearly 40% during Monday's session, dropping to its lowest levels since November, only to recover and close up 5% by the end of the day. This volatility was triggered by Donald Trump's announcement of 25% tariffs on Mexico and Canada, which he later temporarily withdrew.</p><p class=\"\">The new-again U.S. president shook global markets, including cryptocurrencies, leaving a notable hammer formation (or bullish pin bar) on XRP's chart, demonstrating how strongly buyers rejected attempts to fall below the psychological $2 level.</p><p class=\"\">In this article, we explore why XRP is going up and whether its price will reach new all-time highs, presenting the latest technical analysis and XRP price prediction for 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Why XRP Fell and Rebounded: Trump's Tariffs Shake Markets</strong></p><p class=\"\">On Sunday, Donald Trump announced 25% tariffs on neighboring Canada and Mexico, with new regulations set to take effect on Tuesday. He also suggested similar fees might be imposed on the EU.</p><p class=\"\">This triggered massive panic across markets, from currencies and commodities to stocks and cryptocurrencies. Bitcoin dropped sharply, testing yearly lows, while altcoins followed suit. XRP led the decline with over 30% losses, while Ethereum (ETH) fell more than 20% and Dogecoin (DOGE) dropped 25%.</p><p class=\"\">However, Trump later backtracked from his initial announcements, stating that tariffs might be suspended for a month if border controls are increased to combat migration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Why Is XRP Price Up Today?</strong></p><p class=\"\">Following this turmoil, XRP's price first plummeted by almost 40% on Monday to just $1.77, its lowest since November, before ultimately ending the day at $2.7, up approximately 5%.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900px;aspect-ratio:1.5\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/financemagnates:829e8e7cb094b-fd4e76d1adfa2459417f271cefc1f659-resized.webp\" type=\"images/webp\"/><img alt=\"XRP price today. Source: CoinMarketCap.com\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/financemagnates:829e8e7cb094b-fd4e76d1adfa2459417f271cefc1f659-resized.jpeg\" style=\"background-color:#fafdfc\"/></picture></div></figure></span><p class=\"\">XRP price today. Source: CoinMarketCap.com</p><p class=\"\">Although today (Tuesday, February 4, 2025), XRP's price is slightly declining to $2.49, it has managed to recover a significant portion of its sudden losses from the beginning of the week.</p><p class=\"\">The maintained tariffs on China prevented a green candle from forming on today's chart. Trump's actions caused considerable devastation in crypto markets, triggering cascading liquidations of leveraged positions. While losses have decreased, they still total $544 million over the last 24 hours, affecting both short and long positions. XRP saw liquidations of longs worth nearly $19 million and shorts worth almost $13 million.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Major Hammer Formation on XRP Chart: Technical Analysis</strong></p><p class=\"\">A bullish case for XRP in the coming days and weeks is supported by the candlestick formation that appeared on Monday's daily chart. We observed a very long lower wick with a short body, clearly rejecting the lower boundary of the consolidation drawn since November and the psychological $2 level.</p><p class=\"\">This indicates buyers are ready to defend this level and accumulate XRP at local bottoms. Bullish momentum could soon drive the price back to around $2.90, where early December highs are located.</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:509.153713298791px;max-width:1200px;aspect-ratio:2.35685210312076\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/financemagnates:829e8e7cb094b-dda6e7978a6f5f7cbbcee125b40d6c96-resized.webp\" type=\"images/webp\"/><img alt=\"XRP price has the potential to jump almost 40%. Source: Tradingview.com\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/financemagnates:829e8e7cb094b-dda6e7978a6f5f7cbbcee125b40d6c96-resized.jpeg\" style=\"background-color:#f3f3f4\"/></picture></div></figure></span><p class=\"\">XRP price has the potential to jump almost 40%. Source: Tradingview.com</p><p class=\"\">Breaking above this level would open the path to the upper boundary of the current consolidation and XRP's previous ATH at $3.40.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><td><p class=\"\">XRP Price Support</p></td><td><p class=\"\">XRP Price Resistance</p></td></tr></thead><tbody><tr><td><p class=\"\">$1.60 - 200 EMA</p></td><td><p class=\"\">$2.90 - Early December highs</p></td></tr><tr><td><p class=\"\">$2.00 - Lower consolidation boundary</p></td><td><p class=\"\">$3.00 - Psychological level</p></td></tr><tr><td><p class=\"\">$2.60 - 50 EMA</p></td><td><p class=\"\">$3.40 - Previous ATH</p></td></tr></tbody></table></div><p class=\"\">The bullish scenario would be invalidated by a drop below the mentioned $2 support and breach of the 200 EMA. This would signal bears returning to control, potentially pushing XRP's price to $1 or lower.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP Price Prediction: DeepSeek AI Predicts XRP to Reach $5 </strong></p><p class=\"\">DeepSeek AI, a predictive analytics platform, has entered the conversation on XRP’s outlook for 2025. Using machine learning, sentiment analysis, and economic data, the service aims to offer forward-looking perspectives on various digital assets.</p><p class=\"\">Its projections suggest that XRP could trade between $3.50 and $5.00 by late 2025. The model assigns a 70% chance that a favorable outcome in Ripple’s legal proceedings will bolster investor sentiment and encourage institutional adoption. </p><p class=\"\">Meanwhile, expanded use of Ripple’s On-Demand Liquidity platform by financial institutions could further elevate XRP demand. Broader market sentiment, especially trends tied to Bitcoin’s performance, along with global economic factors, is also expected to shape XRP’s price trajectory.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP Price, FAQ</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Why is XRP increasing?</strong></p><p class=\"\">XRP’s recent price upswing is largely attributed to a rapid sell-off and subsequent recovery triggered by Donald Trump’s tariff announcements on Mexico and Canada. Despite initially plummeting by nearly 40%, XRP rebounded after Trump indicated a temporary withdrawal of the tariffs, suggesting a more favorable macroeconomic environment than initially feared. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Is it worth investing in XRP now?</strong></p><p class=\"\">The price has bounced back from steep losses, supported by positive technical signals such as the notable hammer candlestick and potential upside targets near $2.90 to $3.40. However, the cryptocurrency market remains volatile, and external factors—such as tariff policies, broader economic conditions, and Bitcoin’s performance—can influence XRP’s price. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Could XRP reach $5?</strong></p><p class=\"\">According to projections from DeepSeek AI, a predictive analytics platform mentioned in the article, XRP could trade in the $3.50 to $5.00 range by late 2025. This forecast assumes a favorable outcome in Ripple’s ongoing legal matters and increased institutional interest through the On-Demand Liquidity platform. </p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:829e8e7cb094b:0-why-is-xrp-going-up-price-prediction-suggests-crypto-token-may-jump-37/",
            "pub_date": "2025-02-04 16:21:54",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002115:0",
            "title": "OMV's Higher-Than-Expected Dividend the Highlight of 4Q Results — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002115:0/",
            "pub_date": "2025-02-04 16:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002116:0",
            "title": "Global Energy Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Energy markets. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002116:0/",
            "pub_date": "2025-02-04 16:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463319:0",
            "title": "Market Chatter: Harbin Airport Handles Record Passengers, Flights, Cargo in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Harbin Airport transported about 2.7 million passengers in January, a record high, STCN reported Monday. </p><p class=\"\">The airport also handled 17% more flights over the year, amounting to 16,848. It also handled 16,900 tons of cargo and mail, significantly higher than the previous year. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463319:0/",
            "pub_date": "2025-02-04 16:22:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446506:0",
            "title": "Hang Seng Surges 2.8% as China Responds with Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Hang Seng surged 573 points or 2.8% to close at its highest in nearly two months of 20,790 on Tuesday, as traders shrugged off news of reciprocal tariffs between China and the US. As Washington's new tariffs took effect, Beijing moved with levies of 15% on US coal and LNG and 10% on crude oil, farm equipment, and certain autos, set to begin on Feb. 10, China’s finance ministry said.</p><p class=\"\">In addition, Chinese regulators launched a probe into Google over alleged anti-monopoly practices.</p><p class=\"\">Sentiment was further lifted by the resumption of mainland trading Wednesday after a week-long Lunar break.</p><p class=\"\">The Hong Kong tech index jumped by 5% as investors poured into AI stocks after startup DeepSeek unveiled a cost-effective large language model.</p><p class=\"\">The EV sector also rallied, with XPeng soaring 12.3% after reporting an almost threefold rise in January smart EV deliveries.</p><p class=\"\">Geely Auto climbed 7.7%, while Semicon Manufacturing surged 8.5%.</p><p class=\"\">Meituan and Xiaomi Corp. also surged 6.0% and 4.2%, respectively.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446506:0-hang-seng-surges-2-8-as-china-responds-with-tariffs/",
            "pub_date": "2025-02-04 16:22:25",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002126:0",
            "title": "Singapore Banks' 4Q Earnings Likely to Remain Resilient — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore banks' 4Q 2024 earnings are likely to be resilient, says Yeap Jun Rong, IG's market strategist in a note. The bulk of the banks' earnings, which remain supported by net interest income, is expected to stay resilient amid the high-for-longer interest rate environment, he writes. The banks' 4Q loan momentum may also see some pick-up, with data suggesting that overall loans have risen in December from November, he says. Higher confidence around the economy with Singapore's low unemployment rate could have partly contributed to an improvement in lending conditions, Yeap adds. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002126:0/",
            "pub_date": "2025-02-04 16:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV00V:0",
            "title": "HT Media Dec-Quarter Consol Net Loss 59.9 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HT Media Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET LOSS 59.9 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 4.9 BILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">INVESTMENT OF UPTO 110 MLN RUPEES BY SUBSCRIBING TO SHARES OF MOSAIC MEDIA VENTURES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV00V:0-ht-media-dec-quarter-consol-net-loss-59-9-mln-rupees/",
            "pub_date": "2025-02-04 16:24:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001513:0",
            "title": "Mitsubishi UFJ Reports Higher Net Profit as Lending Spreads Improve",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:06 GMT) </strong>*Mitsubishi UFJ Financial Group Maintains FY Net-Profit Guidance<br/><strong class=\"root-Tkn6WL2y\">(07:09 GMT) </strong>*Mitsubishi UFJ 9-Mos Net Interest Income Y2.174T Vs Y1.800T a Year Earlier<br/><strong class=\"root-Tkn6WL2y\">(07:10 GMT) </strong>*Mitsubishi UFJ 9-Mos Gross Profit Y4.121T Vs Y3.619T<br/><strong class=\"root-Tkn6WL2y\">(07:11 GMT) </strong>*Mitsubishi UFJ 9-Mos Net Fees, Commissions Y1.413T Vs Y1.183T<br/><strong class=\"root-Tkn6WL2y\">(07:13 GMT) </strong>*Mitsubishi UFJ 9-Mos Net Trading Profit Y288.13B Vs Y321.12B<br/><strong class=\"root-Tkn6WL2y\">(07:14 GMT) </strong>*Mitsubishi UFJ 9-Mos Net Loss on Debt Securities Y221.18B Vs Loss Y197.03B<br/><strong class=\"root-Tkn6WL2y\">(07:16 GMT) </strong>*Mitsubishi UFJ 9-Mos Total Credit Costs Y251.00 Vs Y263.62B<br/><strong class=\"root-Tkn6WL2y\">(07:17 GMT) </strong>*Mitsubishi UFJ 9-Mos Gains From Earnings of Equity Method Investees Y428.15B Vs Y361.89B<br/><strong class=\"root-Tkn6WL2y\">(08:25 GMT) </strong>Mitsubishi UFJ Reports Higher Net Profit as Lending Spreads Improve</p><p class=\"\">By Kosaku Narioka</p><p class=\"\">Mitsubishi UFJ Financial Group reported higher nine-month net profit as lending spreads improved on the back of the Bank of Japan's gradual rate increases.</p><p class=\"\">The Japanese financial company said Tuesday that net profit climbed 35% from a year earlier to 1.749 trillion yen, equivalent to $11.30 billion, for the nine months ended Dec. 31.</p><p class=\"\">In January, the Bank of Japan raised interest rates to the highest level since October 2008 as the economy makes steady progress toward its goal of stable 2% inflation. That marked the third rate increase after the central bank in March last year ended its negative interest-rate policy, which weighed on commercial banks' earnings.</p><p class=\"\">On Tuesday, the 10-year Japanese government bond yield rose to 1.275%, its highest level since April 2011. Higher government bond yields mean banks may charge higher interest rates on commercial loans and earn better yields from bonds and other investments.</p><p class=\"\">In late January, Mitsubishi UFJ's stock climbed to a record high since listing in April 2001, buoyed by growing confidence that modest inflation is taking hold in Japan and that the central bank will keep gradually raising rates.</p><p class=\"\">For the fiscal year ending March, the company maintained its net profit guidance at Y1.750 trillion.</p><p class=\"\">Nine-month net interest income--the difference between interest earned on loans and that paid on deposits--rose 21% to Y2.174 trillion as lending spreads widened at home and abroad. Net fees and commissions increased 19% to Y1.413 trillion.</p><p class=\"\">Mitsubishi UFJ booked net losses on debt securities of Y221.18 billion, narrowing from losses of Y197.03 billion recorded in the year-earlier period. It also booked total credit costs of Y251.00 billion, down from Y263.62 billion a year earlier.</p><p class=\"\">Write to Kosaku Narioka at kosaku.narioka@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001513:0/",
            "pub_date": "2025-02-04 16:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308376:0",
            "title": "Metsera Insider Bought Shares Worth $39,999,996, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kristina Burow, 10% Owner, Director, on February 03, 2025, executed a purchase for 2,222,222 shares in Metsera  for $39,999,996. Following the Form 4 filing with the SEC, Burow has control over a total of 8,313,680 common shares of the company, with 8,313,680 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2040807/000095017025012590/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/2040807/000095017025012590/xslF345X05/ownership.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308376:0/",
            "pub_date": "2025-02-04 16:25:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463324:0",
            "title": "UBS Downgrades Nine Entertainment to Neutral from Buy, Price Target is AU$1.45",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nine Entertainment  has an average rating of outperform and price targets ranging from AU$1.20 to AU$2.50, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463324:0/",
            "pub_date": "2025-02-04 16:25:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV018:0",
            "title": "V-Mart Retail Dec-Quarter Profit 716.3 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">V-mart Retail Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER PROFIT 716.3 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER REVENUE FROM OPERATIONS 10.27 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV018:0-v-mart-retail-dec-quarter-profit-716-3-mln-rupees/",
            "pub_date": "2025-02-04 16:25:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463314:0",
            "title": "Aozora Bank Turns to Profit in Nine Months Ended December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aozora Bank  recorded an attributable profit of 16.2 billion yen for the nine months ended Dec. 31, 2024, compared with an attributable loss of 14.7 billion yen in the year-ago period, a Monday bourse filing said. </p><p class=\"\">Basic earnings per share stood at 123.67 yen in the three quarters, while the company incurred a loss per share of 125.88 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The lender's ordinary income fell by 11% year over year to 171.9 billion yen in the period from 193.3 billion yen a year prior. </p><p class=\"\">The company forecasts an attributable profit of 18 billion yen, a basic EPS of 135.31 yen, an ordinary profit of 24 billion yen, and a total dividend of 76 yen per share for the year ending March 31. </p><p class=\"\">Shares of the company were down over 3% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463314:0/",
            "pub_date": "2025-02-04 16:17:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002098:0",
            "title": "China's Relatively Restrained Tariff Response Likely Opens Door to Talks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's relatively restrained retaliation against U.S. tariffs, targeting only a few product categories, was in line with CreditSights' expectations. \"The measured response likely opens the door for trade talks with the U.S.,\" says analyst Zerlina Zeng. On the monetary policy front, CreditSights expects the PBOC to allow only moderate FX depreciation and delay high-profile monetary easing, such as rate cuts, to avoid escalation. On the fiscal front, the firm anticipates more expansionary policies to cushion against external risks. Retaliatory measures and headlines could dampen global risk sentiment and are negative for Asian credits, despite their limited direct exposure to U.S. revenues, Zeng and Stephanie Sim note. \"We expect market sentiment towards China $ bonds to weaken if no concrete incremental fiscal stimulus are rolled out by 1H,\" they write. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002098:0/",
            "pub_date": "2025-02-04 16:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0N2:0",
            "title": "UK's Diageo falls after withdrawing medium-term goals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of spirits maker Diageo  fall about 2.4% to 2,308.5p, hitting a near three-month low</p><p class=\"\">** Stock among top losers in FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- --> index</p><p class=\"\">** Co withdrew its medium-term organic sales growth target and took actions to mitigate the impact of U.S. tariffs.</p><p class=\"\">** May undertake pricing, inventory management, re-allocation of investments and supply chain optimization to counter tariff impacts</p><p class=\"\">** Had previously guided medium-term organic net sales growth of 5% to 7%. </p><p class=\"\">** In H1 of fiscal 2025, organic net sales grew 1% vs company compiled analysts expectations of 0.4% growth.</p><p class=\"\">** The stock fell over 11% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0N2:0-uk-s-diageo-falls-after-withdrawing-medium-term-goals/",
            "pub_date": "2025-02-04 16:18:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEE8PPkna:0",
            "title": "Albania's economic confidence index slightly down in Jan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TIRANA (Albania), February 4 (SeeNews) - Albania’s economic sentiment index (ESI) decreased by 0.8 points in January, compared with the previous month, but remained around 6 percentage points (pp) above the long-term average, the central bank said.</p><p class=\"\">The fall in the ESI was the result of the weaker confidence across all sectors, expect services, the Bank of Albania said in a monthly business and consumer confidence survey on Monday.</p><p class=\"\">The services confidence index increased by 4.4 pp in January.</p><p class=\"\">The industry confidence indicator fell by 4.7 pp in the month under review. The consumer confidence index declined by 3 pp in January.</p><p class=\"\">The construction indicator decreased by 4.1 pp, whereas the confidence indicator of the trade sector fell by 2.9 pp.</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEE8PPkna:0-albania-s-economic-confidence-index-slightly-down-in-jan/",
            "pub_date": "2025-02-04 16:18:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}