{
    "data": [
        {
            "id": "forexlive:7b9e5df9b094b:0",
            "title": "Another catch your breath session in Europe today",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:886.6171003717473px;aspect-ratio:1.4776951672862455\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:7b9e5df9b094b-980673d837515e986ff75a2ec1f55035-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:7b9e5df9b094b-980673d837515e986ff75a2ec1f55035-resized.jpeg\" style=\"background-color:#594b48\"/></picture></div></figure></span><p class=\"\">At the end of it all, the tariff can gets kicked down the road. Trump pushed the 25% tariffs on Canada and Mexico to a month from now, allowing for trade negotiations to take place in the meantime. His team might be pushing the narrative that with Canada, it's a fentanyl issue. However, most of his disdain towards Canada seems to be on trade. So, go figure.</p><p class=\"\">As things stand, all there's left is that 10% tariffs on China - at least in this opening salvo. But Trump did say that there would be talks with Xi \"probably in the next 24 hours\". So, we'll see.</p><p class=\"\">But for now at least, markets can look to catch their breath. The tariff threats are no doubt still in the picture but it also shows how Trump loves to play out his political agenda. Go big and loud in the opening gambit before trying to extract concessions after. And when a deal gets struck, it'll be \"the best deal in history for the US\". Sounds familiar, eh?</p><p class=\"\">The dollar is seeing a little bounce back on the day but not after having seen gains evaporate in trading yesterday. The greenback opened with a gap higher across the board but as Trump relented on tariffs, that gap higher was erased. A look at USD/CAD:</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1060.9037328094303px;aspect-ratio:1.768172888015717\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:7b9e5df9b094b-6e7ef84cecde9c666028eb855d6c73a6-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:7b9e5df9b094b-6e7ef84cecde9c666028eb855d6c73a6-resized.jpeg\" style=\"background-color:#1a1e27\"/></picture></div></figure></span><p class=\"\">USD/CAD hourly chart</p><p class=\"\">As Trump calls it a day and heads to bed, markets will be able to catch a breather in European trading today. That's somewhat similar to yesterday. The only difference is that broader markets will surely feel better about the current position as opposed to the \"all hell is about to break loose\" possibility yesterday.</p><p class=\"\">As such, risk trades might find some incentive to push higher but it's still quite a tricky landscape.</p><p class=\"\">With Canada and Mexico now joining the negotiating table, Trump will look to the EU and China next. And those are likely to be tougher propositions to muster.</p><p class=\"\">His erratic nature means that you never know when he's going to start to reignite tariff threats on that front. And it will keep market players more guarded than they were at the start of the year at least.</p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:7b9e5df9b094b:0-another-catch-your-breath-session-in-europe-today/",
            "pub_date": "2025-02-04 12:54:48",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV05A:0",
            "title": "Multiply Group Posts FY Loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MULTIPLY GROUP :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">MULTIPLY GROUP FY NET LOSS ATTRIBUTABLE AED 5.6 MILLION VERSUS PROFIT AED 337.8 MILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">MULTIPLY GROUP PJSC FY REVENUE 2.02 BILLION DIRHAMS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV05A:0-multiply-group-posts-fy-loss/",
            "pub_date": "2025-02-04 12:55:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463184:0",
            "title": "KEC International Posts Surge in Fiscal Q3 Consolidated Net Profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KEC International's  consolidated net profit jumped to 1.30 billion Indian rupees in the fiscal third quarter from 968.7 million rupees a year ago, according to a Monday filing with the Indian exchanges by the infrastructure services provider. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 4.87 rupees from 3.77 rupees of the year-ago period. </p><p class=\"\">Revenue from operations in fiscal Q3 also increased to 53.5 billion rupees from 50.1 billion rupees a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463184:0/",
            "pub_date": "2025-02-04 12:56:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OU0PW:0",
            "title": "HK-listed Chinese stocks surge on AI, EV rally as Trump tariffs loom",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Chinese stocks listed in Hong Kong surged on Tuesday as investors loaded up on AI and EV shares, despite looming U.S. tariffs on China.</p><p class=\"\">U.S. President Trump's 10% levy on Chinese goods is due to go into effect at 1:01 pm in Beijing (0501 GMT), but investors hope Trump's last-minute decision to suspend imminent tariffs on Canada and Mexico may signal there is room to negotiate.</p><p class=\"\">Trump's press secretary said the president will speak with Chinese President Xi Jinping in the next couple of days.</p><p class=\"\">\"With Trump delaying tariffs on Canada and Mexico, will there be negotiations before further escalation on China as well? The market thinks there could still be room for talks,\" Jason Chan, senior investment strategist at Bank of East Asia. </p><p class=\"\">The Hang Seng China Enterprises Index  jumped 2.6% at midday trading break to a three-month high, while Hang Seng Tech Index  surged 3.9%. The benchmark Hang Seng index  added 2%.  </p><p class=\"\">AI-related stocks led the rally as investors continued to pile up wagers on home-grown firms after startup DeepSeek released a large language model at a cheap cost. </p><p class=\"\">China's top chipmaker SMIC  surged as much as 9% to a record high, and peer Hua Hong Semiconductor  advanced 8.7%. </p><p class=\"\">The EV sector also lifted the market, with carmaker XPeng  jumping 12.6% after the company said it delivered a nearly three-fold increase in smart EVs in January year-on-year. </p><p class=\"\">Financial markets in mainland China will reopen on Wednesday after the long Lunar New Year holiday, and are poised to play catch-up with global markets, he added. </p><p class=\"\">China's benchmark blue chip index  fell 3% in January before the holiday, surrendering nearly half of September's 40% rally. </p><p class=\"\">The markets may look through the political noise to focus on China’s responses to U.S. tariffs and the upcoming National People's Congress (NPC) meeting in the next few weeks, analysts at Citi said in a note.</p><p class=\"\">Capital Economics said the additional 10% tariff that Donald Trump has applied on Chinese goods will have a relatively modest impact on China’s economy, especially if the PBOC allows the yuan to adjust, but predicted the trade war with the U.S. will be protracted.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OU0PW:0-hk-listed-chinese-stocks-surge-on-ai-ev-rally-as-trump-tariffs-loom/",
            "pub_date": "2025-02-04 12:56:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0C2:0",
            "title": "Grab and GoTo accelerate merger talks and aim for deal in 2025- Bloomberg News",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/2nwaz3br</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0C2:0-grab-and-goto-accelerate-merger-talks-and-aim-for-deal-in-2025-bloomberg-news/",
            "pub_date": "2025-02-04 12:58:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463183:0",
            "title": "Market Chatter: London Court Approves Sino-Ocean's $6 Billion Debt Restructuring Plan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">London's High Court greenlit Chinese property developer Sino-Ocean Group's  plan to restructure $6 billion of offshore debt, overriding objections from creditor Long Corridor, Reuters reported Monday. </p><p class=\"\">Sino-Ocean Group is navigating a dual restructuring process in London and Hong Kong amid China's property sector crisis, according to the report. </p><p class=\"\">Opposition came from creditor Long Corridor, which claims the move unfairly favored shareholders, including state-owned China Life and Dajia Insurance Group, which each hold a roughly a 30% stake, Reuters wrote. Meanwhile, Sino-Ocean argued maintaining at least 15% ownership for these entities was vital to its status as a state-owned enterprise and its survival in China's property market. </p><p class=\"\">In his ruling, Judge Nicholas Thompsell said retaining these stakes \"increases the value of the plan\" for all creditors, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463183:0/",
            "pub_date": "2025-02-04 12:58:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463185:0",
            "title": "Wellnex Life Secures Regulatory Approval for Paracetamol Plus Caffeine Soft Gel; Shares Up 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wellnex Life  received market authorization from Australia's Therapeutic Goods Administration for its new liquid paracetamol plus caffeine soft gel, the company said in a Tuesday Australian bourse filing. </p><p class=\"\">The product will provide opportunities to use it in the company's own brands as well as opportunities to license it to third parties, the filing added. </p><p class=\"\">Company shares rose past 3% in recent Tuesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463185:0/",
            "pub_date": "2025-02-04 12:59:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSgXP0Ma:0",
            "title": "IXOPAY Appoints Yasser Abou-Nasr as SVP of Product to Drive Execution and Scale",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Seasoned Fintech Leader Joins IXOPAY to Advance Product Innovation and Drive Scalable Growth in Payment Orchestration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LEHI, UT / ACCESS Newswire / February 4, 2025 /</strong> IXOPAY, a leading enterprise payment orchestration platform, announced the appointment of Yasser Abou-Nasr as SVP of Product. With over 16 years of senior product leadership in payments and fintech, Yasser joins IXOPAY to execute the company's strategic vision and scale its product offerings to meet the growing demand for seamless and secure payment solutions.</p><p class=\"\">Yasser brings a proven track record of driving product execution at scale, combined with deep expertise in product management, operational transformation, and the development of B2B SaaS platforms. His leadership will be instrumental in advancing IXOPAY's enterprise payment orchestration platform, enabling businesses worldwide to simplify, secure, and optimize their payment systems through scalable and flexible solutions.</p><p class=\"\">\"Yasser's ability to execute and scale complex product strategies aligns perfectly with IXOPAY's mission to lead the global payment orchestration market,\" said Brady Harris, CEO of IXOPAY. \"With his extensive experience in the payments ecosystem and a visionary approach to product innovation, Yasser will ensure our solutions deliver exceptional value to our customers while accelerating IXOPAY's growth trajectory.\"</p><p class=\"\">Yasser's impressive career spans key leadership roles, including Senior Vice President of Product at Dwolla, where he successfully restructured the product organization and drove strategic execution, and Vice President of Payments Strategy and Operations at Vesta, where he oversaw the global expansion of payment acceptance and optimization initiatives.</p><p class=\"\">\"I am thrilled to join IXOPAY, a company that is reshaping the global payments landscape,\" said Yasser Abou-Nasr. \"As businesses increasingly embrace multiprocessor strategies, IXOPAY's enterprise-grade platform offers unparalleled flexibility and innovation. I look forward to scaling our product offerings and delivering next-generation payment solutions to our customers worldwide.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About IXOPAY</strong></p><p class=\"\">IXOPAY is a leading provider of enterprise-grade payment orchestration, enabling businesses to simplify, secure, and scale their payment systems. In 2024, IXOPAY orchestrated over $35 billion in transactions for customers from over 30 countries. With a fully integrated platform, tokenization, and flexible payment optimization modules, IXOPAY empowers enterprises to manage payments seamlessly across multiple providers. Learn more at www.ixopay.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong> Mills Forni, Verdis, mills@verdis.xyz</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> IXOPAY</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSgXP0Ma:0/",
            "pub_date": "2025-02-04 12:59:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463179:0",
            "title": "New Talisman Welcomes Inclusion of Gold in NZ Government's Critical Minerals List; Shares Rise 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Talisman Gold Mines  said the inclusion of gold in the New Zealand government's critical minerals list will provide the company a \"clear pathway\" towards full mining, according to a Monday filing with the New Zealand bourse. </p><p class=\"\">As previously announced, the mining company plans to re-apply through the Fast Track Authorization Bill for full mining consent for the historic Talisman mine and Rahu Minerals Exploration tenement, the filing said. </p><p class=\"\">It said it is on track to begin production in the first quarter of 2025, per the filing. </p><p class=\"\">New Talisman's shares climbed past 6% at market close on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463179:0/",
            "pub_date": "2025-02-04 12:59:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000006:0",
            "title": "News Highlights: Top Financial Services News of the Day - Tuesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Is Delivering Its Biggest Fee Cut Ever. New CEO Salim Ramji Explains Why.</strong></p><p class=\"\">The asset manager says the move at 87 funds will save investors $350 million this year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin rebounds after Trump pauses Mexico, Canada tariffs. Here's why the crypto reacts to tariffs.</strong></p><p class=\"\">Bitcoin rebounded to above $100,000 Monday evening, after President Donald Trump said he would pause imposing tariffs on Mexico and Canada, respectively.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bessent Takes Helm of Consumer Finance Watchdog, Orders Halt to Work</strong></p><p class=\"\">Treasury Secretary Scott Bessent is ordering a freeze to work at the Consumer Financial Protection Bureau, after being named its acting director by President Trump</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Inflation will slow this year, allowing the Fed to cut rates further, says former St. Louis Fed chief</strong></p><p class=\"\">Former St. Louis Federal President James Bullard said that inflation will slow markedly this year, allowing the central bank to continue to lower interest rates.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Private Credit Executives Grapple With Price Hurdles, Rising Competition</strong></p><p class=\"\">Industry leaders point to persistent disagreements on asset prices and swelling ranks of competitors for deals.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">It's Write-Down Season, and Some Companies Look Due for Asset Adjustments</strong></p><p class=\"\">Warner Bros. Discovery, CVS and Kraft Heinz all have intangible-asset values that appear out of whack.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Julius Baer Shares Fall After Targeting Hundreds of Job Cuts</strong></p><p class=\"\">The wealth manager's shares fell after it said it envisions cutting around 400 positions, extending its cost-saving program.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Services Roundup: Market Talk</strong></p><p class=\"\">Find insight on gold prices, ETFs, Julius Baer, the Malaysian banking sector and more in the latest Market Talks covering Financial Services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Wall Street Is Nervous About Scott Bessent's Borrowing Plans</strong></p><p class=\"\">The new Treasury secretary has criticized a borrowing strategy that helped calm markets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000006:0/",
            "pub_date": "2025-02-04 13:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204000008:0",
            "title": "News Highlights: Top Energy News of the Day - Tuesday at 12 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Read about tariffs on Canadian oil, natural gas prices, Galp Energia and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Shell Keeps $3.5 Billion Buyback Amid Earnings Miss</strong></p><p class=\"\">The oil-and-gas company's adjusted earnings fell more than expected, weighed by lower oil prices and refining margins.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Crude Oil Stockpiles Rise for First Time in 10 Weeks</strong></p><p class=\"\">U.S. crude oil inventories increased for the first time in 10 weeks, beating analyst's expectations, as exports fell and refineries lowered their capacity use.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Here's how much gas could cost you if Trump's threatened tariffs go through</strong></p><p class=\"\">President Trump has threatened to place 25% tariffs on Canada and Mexico as soon as this Saturday, potentially disrupting the relatively stable prices drivers have been paying for gasoline during a seasonally slow period for fuel demand.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204000008:0/",
            "pub_date": "2025-02-04 13:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012253:0",
            "title": "OpenAI to Jointly Develop AI Products With South Korean Tech Giant Kakao",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">ChatGPT creator OpenAI and South Korean mobile internet giant Kakao plan to jointly develop artificial-intelligence products for the local market.</p><p class=\"\">The companies said Tuesday that they plan to form a strategic partnership, under which Kakao will integrate OpenAI's technology for its products and services, including its widely used messaging app Kakao Talk, tailored to local users.</p><p class=\"\">Kakao said it will also deploy ChatGPT Enterprise, the version of ChatGPT aimed at large companies for business use, for its employees, and use OpenAI models to power its AI communication service Kanana, which Kakao describes as a \"user-friendly AI mate that delivers personalized, context-aware responses.\"</p><p class=\"\">\"We're excited to bring advanced AI to Kakao's millions of users and work together to integrate our technology into services that transform how Kakao's users communicate and connect,\" OpenAI Chief Executive Sam Altman said in a statement.</p><p class=\"\">Kakao CEO Chung Shin-a said the collaboration will help the South Korean company advance its AI efforts.</p><p class=\"\">The announcement was made at a joint press conference in Seoul on the back of Altman's visit to the country. Local media outlet Yonhap News Agency reported that he has met with SK Group Chairman Chey Tae-won, who was accompanied by SK Hynix CEO Kwak Noh-jung, to discuss possible collaborations in AI.</p><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012253:0-openai-to-jointly-develop-ai-products-with-south-korean-tech-giant-kakao/",
            "pub_date": "2025-02-04 12:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463157:0",
            "title": "PointsBet Lowers Fiscal Year 2025 Guidance on Weaker Results in Australia and Canada, Jarden Research Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PointsBet Holdings  has downgraded its full fiscal year revenue and earnings before interest, taxes, depreciation, and amortization (EBITDA) guidance after weaker-than-expected results in Australia and Canada, falling short of analyst forecasts, according to a Jan. 31 note by Jarden Research. </p><p class=\"\">The company now expects full fiscal year EBITDA of AU$11 million to AU$14 million from the previous AU$11 million to AU$16 million, while revenue is forecasted to be between AU$260 million to AU$270 million, reduced from AU$280 million to AU$290 million, Jarden said. </p><p class=\"\">The company reported fiscal-first half Australian turnover of AU$1.15 billion, down 23% year-on-year and below the analyst's estimate of $1.5 billion, driven by a shift from lower-margin clients, Jarden added. </p><p class=\"\">PointsBet's fiscal first-half net win for Australia was AU$117 million, up 4% year-on-year but below the AU$133 million estimate, the broker noted. </p><p class=\"\">Meanwhile, performance in Canada also missed expectations. PointsBet's net win in Canada was AU$18.1 million, missing the AU$24.9 million estimate by 27%, due to unfavorable NFL and iGaming results. </p><p class=\"\">Despite setbacks, the gaming firm reported a modest AU$500,000 operating cash inflow for the fiscal first half ended Dec. 30, beating Jarden's AU$600,000 outflow, and expects positive net cash flows in the second half of the fiscal year. </p><p class=\"\">Jarden Research has a buy rating and AU$1 price target on PointsBet Holdings. </p><p class=\"\">Shares of the company fell 2% in recent Tuesday trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463157:0/",
            "pub_date": "2025-02-04 12:51:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463176:0",
            "title": "Hibiscus Petroleum Repurchases Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hibiscus Petroleum  bought back 200,000 shares for 369,010 ringgit on Monday, according to a same-day Malaysian bourse disclosure. </p><p class=\"\">The shares were repurchased at a price between 1.83 ringgits and 1.87 ringgits apiece, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463176:0/",
            "pub_date": "2025-02-04 12:52:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BO:0",
            "title": "India's Power Grid Corp drops after Q3 profit misses estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Power Grid Corporation of India  slides as much as 4.1% to 272.1 rupees, its lowest in near 10 months</p><p class=\"\">** Stock among top five losers on benchmark Nifty 50 index , which is up 0.7% </p><p class=\"\">** State-run energy transmission firm reported Q3 profit below estimates, hurt by sluggish power demand</p><p class=\"\">** PGRD is the only stock trading in red on the Nifty PSE index (.NIFTYPSE), which is trading up 1.8% </p><p class=\"\">** PGRD rated \"Buy\" on avg, same as peer NTPC , while Tata Power , Torrent Power  rated \"Hold\" - LSEG data</p><p class=\"\">** PGRD last down 1.2% </p><p class=\"\">** YTD, PGRD, NTPC, TTPW down ~9%, ~6%, ~8% and ~9% </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BO:0-india-s-power-grid-corp-drops-after-q3-profit-misses-estimates/",
            "pub_date": "2025-02-04 12:53:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463180:0",
            "title": "Yinson Repurchases Shares Worth About MYR4 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yinson  bought back 1,645,100 shares for around 3.9 million ringgit, according to a Monday disclosure with Bursa Malaysia. </p><p class=\"\">The shares were repurchased at between 2.330 ringgit and 2.360 ringgit apiece, the energy infrastructure and technology company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463180:0/",
            "pub_date": "2025-02-04 12:53:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463165:0",
            "title": "Sarytogan Graphite Identifies Copper Anomalies at Kazakhstan Project; Shares Rise 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sarytogan Graphite  said an exploration review at the Baynazar copper exploration project in Kazakhstan identified three new anomalies at the Aminbay target, according to a Tuesday Australian bourse filing. </p><p class=\"\">The company identified metal zonation and aeromagnetic features consistent with the possible presence of porphyry, the filing said. The review also confirmed previous results at the Ilken target. </p><p class=\"\">Soil sampling will be infilled across the anomalies identified and extended ahead of planning drilling at these targets, according to the firm's managing director, Sean Gregory. </p><p class=\"\">The firm's shares rose past 3% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463165:0/",
            "pub_date": "2025-02-04 12:55:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:260191000094b:0",
            "title": "Hong Kong’s SFC proposes expanding crypto regulatory staff in new fiscal budget",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong’s securities watchdog has proposed adding headcounts for cryptocurrency-specific staff as the region continues its drive to become a crypto hub.</p><p class=\"\">In a budget plan for the financial year 2025 to 2026, the Securities and Futures Commission proposed 15 new headcounts, with eight dedicated to “enhancing the staffing support for virtual asset regulatory regimes, market surveillance, and enforcement investigations.”</p><p class=\"\">The SFC presented the budget on Monday at a Legislative Council meeting. The regulator estimated that its recurrent expenditure for the next fiscal year—starting April 1, 2025—would be HK$2.59 billion ($332.4 million), an increase of 7.2% from the forecast expenditure for 2024-25.</p><p class=\"\">Much of the budget increase stems from a rise in staff costs by HK$130.5 million ($16.7 million), which includes an average salary hike of about 2.1%. The SFC noted that it froze its headcount in three out of the five financial years since 2020-21.</p><p class=\"\">The SFC pointed out in a separate document on Monday that it has deployed staff with experience in licensing and supervision to cope with crypto-related regulatory work. However, it could only conduct on-site inspections of some 200 licensed corporations in 2023, which “fell short of the target of 300.” </p><p class=\"\">Hong Kong has opened its doors to crypto firms. In June 2023, it officially launched a crypto licensing regime for “virtual asset trading platforms” (VATPs), allowing licensed exchanges to offer retail trading services. The government’s proposed stablecoin bill is also progressing through the Legislative Council.</p><p class=\"\">In December, the SFC said it has worked to speed up the VATP licensing process. “We have been proactively engaging with VATPs’ senior management and ultimate controllers, which helps drive home our expected regulatory standards and expedite our licensing process for VATPs,” Eric Yip, the SFC’s Executive Director of Intermediaries, said in a December statement.</p><p class=\"\">Last month, the SFC approved licenses for two additional crypto trading platforms — PantherTrade and YAX, according to the regulator’s website. This brought the total number of licensed platforms to nine, including OSL and HashKey.</p><p class=\"\">Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</p><p class=\"\">© 2024 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</p></span></div>",
            "link": "https://www.tradingview.com/news/the_block:260191000094b:0-hong-kong-s-sfc-proposes-expanding-crypto-regulatory-staff-in-new-fiscal-budget/",
            "pub_date": "2025-02-04 12:45:59",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463168:0",
            "title": "Market Chatter: China's Currency May Further Weaken Amid Trade Tensions With US",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Analysts believe the China's renminbi may further weaken if US President Donald Trump's new tariffs become effective, Bloomberg reported Tuesday. </p><p class=\"\">Economists at Australia &amp; New Zealand Banking Group, along with those at Malayan Banking, said People's Bank of China may set the currency's fixing at 7.2 yuan per dollar. Goldman Sachs Group forecasted a 7.3 yuan per dollar fixing, the report said. </p><p class=\"\">The renminbi reached its lowest since October 2022 to as much as 0.7% to 7.3734 yuan per dollar on Monday after Trump announced a 10% duty on China, which is lower than the 60% levy previously planned, the media outlet said. </p><p class=\"\">China's central bank may announce its fixing limit plans on Wednesday when the mainland's markets resume after the Chinese New Year holiday, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463168:0/",
            "pub_date": "2025-02-04 12:46:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012248:0",
            "title": "LIC Housing Finance Likely to Continue Delivering Healthy Asset Quality — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LIC Housing Finance is likely to continue delivering healthy asset quality, Nomura analysts say in a research report. Its gross and net non-performing assets dropped by 152 bps and 32 bps, respectively, in 3Q FY 2025, and it posted a credit cost of negative 0.1% driven by provision write-backs, the analysts note. Thanks to further resolutions of such assets, the Indian housing finance company's credit costs are expected to remain contained at around 35 bps over FY 2026-2027, the analysts estimate. Nomura raises the stock's target price to INR 735.00 from INR 700.00, maintaining an unchanged buy rating. Shares are 2.3% higher at INR 570.70. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012248:0/",
            "pub_date": "2025-02-04 12:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463172:0",
            "title": "HSBC Buys Back Another 3.4 Million Shares in Hong Kong",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HSBC Holdings  bought back 3,397,000 shares in Hong Kong on Monday at a weighted average price of HK$79.85 per share, according to a Tuesday filing with the Hong Kong Stock Exchange. </p><p class=\"\">Since the current buy-back program has started, the British lender has repurchased 301,116,739 shares for about $2.84 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463172:0/",
            "pub_date": "2025-02-04 12:48:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463170:0",
            "title": "Vinci Consortium Wins EUR183 Million River Access Contract in France",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Vinci  consortium won a contract worth 183 million euros to build a river link to Port 2000 in Le Havre in Normandy, France. </p><p class=\"\">The project, named La Chatière, will deliver a 1.8-kilometer river channel directly connecting Port 2000 and the Seine river basin, according to a Monday release from the construction, energy and concessions company. The project is scheduled to commence operations in 2027. </p><p class=\"\">Vinci Construction holds a 62% stake in the consortium, while Belgium's Deme holds 38%. Vinci also owns a 12.1% stake in Deme.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463170:0/",
            "pub_date": "2025-02-04 12:49:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463171:0",
            "title": "Mitrajaya Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitrajaya Holdings  bought back 241,000 shares on Monday for 78,897 ringgit, according to a same-day bourse disclosure. </p><p class=\"\">The shares were purchased at 0.325 ringgit apiece, the Malaysian construction company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463171:0/",
            "pub_date": "2025-02-04 12:49:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463173:0",
            "title": "PMI: Saudi Arabia's Non-oil Private Sector Growth Hits 10-Year High in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Business activity growth in Saudi Arabia's non-oil private sector strengthened significantly in January 2025 due to the fastest increase in total new orders since June 2011 and the strongest year-ahead outlook in 10 months, the Riyad Bank and S&amp;P Global said Tuesday. </p><p class=\"\">The Riyad Bank Saudi Arabia PMI climbed to 60.5 from 58.4 in December 2024, reflecting the highest reading since September 2014.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463173:0/",
            "pub_date": "2025-02-04 12:49:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012251_20250203012251:0",
            "title": "Kasikornbank Target Price Lowered to THB187.00 From THB188.00 by CGS International >KBANK.TH",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012251_20250203012251:0/",
            "pub_date": "2025-02-04 12:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0B4:0",
            "title": "Australia's Astute Metals jumps on lithium find at US project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Astute Metals  soars 18.8% to A$0.038, highest since Jan. 20</p><p class=\"\">** Stock rose as much as 21.9% to A$0.039 earlier in the day, marking the biggest intraday gain since Jan. 20</p><p class=\"\">** Diversified explorer says it has identified new zone of lithium bearing clay-rich rocks at its Red Mountain Lithium Project in Nevada, USA</p><p class=\"\">** Adds, \"Identification of new high-grade lithium-bearing unit increases project's potential\"</p><p class=\"\">** Around 784,720 shares traded, 2.3x the 30-day avg    </p><p class=\"\">** ASE up 35.7% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0B4:0-australia-s-astute-metals-jumps-on-lithium-find-at-us-project/",
            "pub_date": "2025-02-04 12:50:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463177:0",
            "title": "BH Global Forms New Subsidiary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Marine electrical products supplier BH Global  established a wholly-owned subsidiary, namely, Infravision Technology, according to a filing with the Singapore Exchange on Monday. </p><p class=\"\">The new company has an initial issued and paid up capital of SG$100 comprising 100 shares and is involved in the manufacturing and repairing of engineering and scientific instruments.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463177:0/",
            "pub_date": "2025-02-04 12:50:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463178:0",
            "title": "Power Root Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Power Root  on Tuesday bought back 104,200 shares for 152,594 ringgit, according to a same-day bourse disclosure. </p><p class=\"\">The shares were repurchased at between 1.460 ringgit and 1.500 ringgit apiece, the beverage company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463178:0/",
            "pub_date": "2025-02-04 12:50:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0A5:0",
            "title": "India's long-duration bond yields steady as profit booking curbs decline",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Indian government bond yields of longer duration were little changed on Tuesday amid profit booking, while shorter-duration yields dipped in the early session, ahead of a widely expected interest rate cut from the central bank later this week.</p><p class=\"\">The 10-year bond yield (IN067934G=CC) was at 6.6721% as of 10:00 a.m. IST, compared with the previous close of 6.6665%.</p><p class=\"\">\"With hopes of more liquidity injection from the Reserve Bank of India and an almost certain rate cut, the shorter end has started to become more attractive,\" a trader with a private bank said. </p><p class=\"\">Also, heavy offers in longer duration due to profit booking from state-run banks have limited moves in yields, the trader added. </p><p class=\"\">The RBI more than doubled bond purchases in the secondary market, with its net purchases reaching 208.50 billion rupees ($2.40 billion) in the week ended Jan. 24, after buying bonds worth 101.75 billion rupees in the previous week.</p><p class=\"\">It has also bought bonds worth 200 billion rupees in an open market auction as part of its liquidity infusion package. Of the total purchases, one-fourth comprised the benchmark paper.</p><p class=\"\">The RBI conducted a $5.1 billion forex swap last week and will also undertake a 56-day variable rate repo on Feb. 7, followed by additional bond purchases worth 400 billion rupees later this month.</p><p class=\"\">Ashhish Vaidya, managing director and treasurer of global financial markets at DBS Bank India, expects the central bank to purchase bonds worth 2 trillion rupees in the next financial year and does not see any major impact on yields from higher-than-expected gross borrowing in fiscal 2025-26.</p><p class=\"\">A majority of economists are expecting the RBI to announce a 25-basis-point rate cut at its meeting on Feb. 7. </p><p class=\"\">Sandeep Yadav, head of fixed income at DSP Mutual Fund, said the 10-year bond has become attractive, as he anticipates rate cuts and bond purchases to aid this part of the curve. </p><p class=\"\">($1 = 87.0325 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0A5:0-india-s-long-duration-bond-yields-steady-as-profit-booking-curbs-decline/",
            "pub_date": "2025-02-04 12:42:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BE:0",
            "title": "India's Nahar Spinning Mills jumps on posting Q3 profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Nahar Spinning Mills  jumps 6.4% to 237.6 rupees; set for biggest intraday pct rise in nearly six months</p><p class=\"\">** Cotton yarns maker posts Q3 profit from cont ops of 7.6 mln rupees ($87,360.34) vs year-ago loss of 152.1 mln rupees</p><p class=\"\">** Stock sees most active session since Dec. 19, 2024, with ~79,000 shares traded - 2.6x its 30-day moving avg</p><p class=\"\">** NHRS fell 5.7% in 2024</p><p class=\"\">($1 = 86.9960 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BE:0-india-s-nahar-spinning-mills-jumps-on-posting-q3-profit/",
            "pub_date": "2025-02-04 12:43:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}