{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463380:0",
            "title": "Kissei Pharmaceutical's Attributable Profit Climbs 6% in Nine Months Ended December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kissei Pharmaceutical's  attributable profit rose 6% to 8.84 billion yen in the nine months ended Dec. 31, 2024 from 8.34 billion yen in the year-ago period, according to a Monday filing with the Tokyo Stock Exchange. </p><p class=\"\">Basic earnings per share at the drug company increased to 201.40 yen from 182.87 yen in the previous year. </p><p class=\"\">Net sales grew 14% to 65.7 billion yen from 57.9 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, the company expects attributable profit to rise 4.8% to 11.7 billion yen or 268.21 yen per basic share, and net sales to increase 14% to 86.5 billion yen. </p><p class=\"\">The company is seen to declare a total of 90 yen per share at year-end. </p><p class=\"\">Shares closed 6% lower during Tuesday's trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463380:0/",
            "pub_date": "2025-02-04 17:42:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002629:0",
            "title": "Singapore Shares Edge Lower; U.S.-China Trade Tensions in Focus — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's FTSE Straits Times Index edged 0.1% lower to close at 3823.01, bucking the regional trend. China said earlier that it will impose new tariffs on some U.S. imports, responding to President Trump's latest levy on Chinese goods. Beijing's tariff retaliation \"inadvertently ups the ante on an escalatory tit-for-tat trade conflict\" if Trump exercises the clause in his executive order to raise levies in response to retaliation, Vishnu Varathan, head of macro research for Asia ex-Japan at Mizuho Securities (Singapore), says in an email. Among the worst performers on the benchmark index, Venture Corp. fell 3.2%, while Sembcorp Industries and SATS dropped 1.8% each. (ronnie.harui@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002629:0/",
            "pub_date": "2025-02-04 17:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463378:0",
            "title": "Kagome's 2024 Profit Balloons 140%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kagome  recorded a 139.8% rise in 2024 attributable net income to 25 billion yen from 10.4 billion yen in 2023, a Monday bourse filing said. </p><p class=\"\">Earnings per share climbed to 278.19 yen from 120.98 yen in the previous year. </p><p class=\"\">The food product manufacturer's revenue rose 37% to 306.9 billion yen from 224.7 billion yen a year prior. </p><p class=\"\">The company declared a final dividend of 57 yen per share. </p><p class=\"\">The company expects an attributable net income of 14 billion yen, EPS of 149.48 yen, revenue of 300 billion yen, and total dividend of 48 yen for the year ending Dec. 31, 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463378:0/",
            "pub_date": "2025-02-04 17:43:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0DC:0",
            "title": "Suncorp completes NZ$410mn sale of NZ life units",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Suncorp Group has completed the previously announced sale of its New Zealand life insurance business after receiving regulatory approval.</p><p class=\"\">The sale of Asteron Life Limited to Resolution Life NOHC formally completed on 31 January 2025.</p><p class=\"\">The group’s New Zealand general insurance business remains unchanged and part of Suncorp.</p><p class=\"\">Suncorp received NZ$250mn ($140mn) plus the estimated excess capital in the business as at 31 January 2025. The level of excess capital is subject to the completion accounts processes post completion.</p><p class=\"\">This payment is the first tranche of the NZ$410mn sale price, with the remaining NZ$160mn to be paid 18 months after completion.</p><p class=\"\">As part of the sale, Suncorp has entered into a transitional services agreement for a period of up to two years post completion.</p><p class=\"\">ASX-listed Suncorp will release its 2025 first half results on 12 February 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0DC:0-suncorp-completes-nz-410mn-sale-of-nz-life-units/",
            "pub_date": "2025-02-04 17:43:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002634:0",
            "title": "Terreno Realty Initiated at Market Perform by BMO Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(09:44 GMT) </strong>Terreno Realty Price Target Announced at $71.00/Share by BMO Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002634:0/",
            "pub_date": "2025-02-04 17:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002631:0",
            "title": "Metal Prices Mixed in Uncertain Trading After Tariff Agreement — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002631:0/",
            "pub_date": "2025-02-04 17:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002636_20250204002636:0",
            "title": "Guangzhou Automobile Group: Zeng Qinghong Resigns as Chairman, Director and Chairman of Strategy Committee",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002636_20250204002636:0/",
            "pub_date": "2025-02-04 17:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0BH:0",
            "title": "UBS slides despite strong Q4 profit, as revenue in some segments lags estimates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in UBS  are down 5.6%, reversing course after rising around 3% in early trading, as the lender's Q4 profit smashed expectations but analysts said revenue was lacklustre vs expectations in some segments</p><p class=\"\">** Deutsche Bank says Q4 results were solid, but the divisional mix could have been better, as the Global Wealth Management business was in line and Personal &amp; Corporate Banking missed market expectations</p><p class=\"\">** Vontobel says the profit beat is down to good cost management and highlights the 29% dividend hike, 13% above consensus</p><p class=\"\">** J.P.Morgan says \"the devil is in the detail\" and notes the question of meeting future Swiss regulatory changes remains unresolved</p><p class=\"\">** However, JPM adds the overall beat should give the market confidence that UBS can \"resolve the capital issues organically with ongoing buybacks maintained\", after UBS said it would buy back up to $3 billion in shares this year</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0BH:0-ubs-slides-despite-strong-q4-profit-as-revenue-in-some-segments-lags-estimates/",
            "pub_date": "2025-02-04 17:44:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463393:0",
            "title": "StanChart Names New Chair",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Standard Chartered  appointed Maria Ramos as its new group chair to succeed José Viñals, according to a Tuesday filing. </p><p class=\"\">Viñals will retire from the role after the British banking group's annual general meeting on May 8. Ramos will take over her new role the same day.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463393:0/",
            "pub_date": "2025-02-04 17:44:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0O3:0",
            "title": "FX mixed as markets assess US-China tariff tit-for-tat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">China slaps tariffs on some U.S. imports, expands export control</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Egypt, Saudi Arabia's non-oil private sector grows in Jan</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">MSCI FX up 0.3%, stocks jump 1.6%</li></ul></span></div><span><p class=\"\">    Emerging market currencies were mixed on Tuesday as investors weighed the impact of escalating trade war concerns after China's retaliatory tariffs on the U.S., while stocks soared after the U.S. agreed to pause tariffs on Canada and Mexico.</p><p class=\"\">MSCI's index tracking global EM currencies (.MIEM00000CUS) recovered 0.3%, after logging its worst day in over a month on Monday. </p><p class=\"\">China ordered retaliatory tariffs on some U.S. imports and expanded mineral export controls, in response to the new 10% duties on Chinese goods by the U.S. that came into effect on Tuesday, renewing a trade war between the world's biggest economies. </p><p class=\"\">The offshore yuan  was trading flat after briefly touching a record low on Monday. Mainland Chinese markets were closed for a long holiday and will reopen on Wednesday, with investors closely watching the central bank's daily currency guidance for possible clues on Beijing's broader trade policy intentions.</p><p class=\"\">Most Asian currencies were higher against the dollar on the day, recovering from Monday's declines after U.S. President Donald Trump's threatened Feb. 1 tariffs came into effect, unsettling markets globally. </p><p class=\"\">However, Trump's last-minute decision to pause tariffs on Mexico and Canada for a month after the countries came to a border security agreement led EM assets to regain much of their lost ground later in the session. </p><p class=\"\">The Mexican peso  was 0.4% lower, while the loonie  was down 0.1% on the day. </p><p class=\"\">The tit-for-tat measures and Trump's changing stance on tariffs has left investors uncertain about the outlook for emerging economies, with policy divergence between the U.S. Federal Reserve and other central banks only compounding pressures. </p><p class=\"\">\"Markets are not fully pricing out the tariff threat just yet because tariffs have been only delayed by a month and the roller-coaster of trade news leaves markets with a higher degree of unpredictability,\" ING analysts said in a note. </p><p class=\"\">Analysts at Ashmore said that they see a chance of a negotiated reduction in tariffs in coming days. </p><p class=\"\">Stock indexes, on the other hand, cheered the U.S. pause on measures against Canada and Mexico, with the MSCI stocks gauge <!-- -->CBOE:EFS<!-- --> up 1.6%, on track to claw back most of its losses from Monday. </p><p class=\"\">Philippine stocks  added 3.5% while Turkey's BIST 100  was up 0.3%. Indexes in South Africa  and Czech Republic (.PX) advanced 0.6% and 0.7% respectively. </p><p class=\"\">The rand , however, weakened 0.2% against the greenback, on track for its fourth session of declines. Trump's plans to cut funding for the country led to turbulent trade on Monday. </p><p class=\"\">Data showed the non-oil private sector in Egypt put up its best performance in over four years, and the one in Saudi Arabia expanded at its strongest pace in just over a decade. </p><p class=\"\">Most emerging Europe currencies were subdued against the euro, but the Polish zloty  depreciated some 0.2%. </p><p class=\"\">HIGHLIGHTS:</p><p class=\"\">** India's central bank seen cutting rates for first time since May 2020 </p><p class=\"\">** Poland needs to cut spending and raise taxes, OECD says</p><p class=\"\">For TOP NEWS across emerging markets </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0O3:0-fx-mixed-as-markets-assess-us-china-tariff-tit-for-tat/",
            "pub_date": "2025-02-04 17:44:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002636_20250204002637:0",
            "title": "Guangzhou Automobile Group: Zeng Has Reached the Retirement Age",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002636_20250204002637:0/",
            "pub_date": "2025-02-04 17:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0AJ:0",
            "title": "HSBC deputy global equities chief takes leave, sources say",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    HSBC's  deputy global head of equities Selene Chong is taking a leave of absence from her role, two sources with knowledge of the matter told Reuters, the latest in a slew of senior leadership changes at the Asia-focused lender.</p><p class=\"\">Chong, who also serves as head of equities for HSBC in the Asia Pacific region and is based in Hong Kong, has worked for the bank for more than two decades, according to a profile on professional social media platform LinkedIn.</p><p class=\"\">The sources could not be named discussing information that is not yet public. HSBC did not immediately respond to a request for comment. Chong also did not immediately respond to a request for comment sent by Reuters via LinkedIn.</p><p class=\"\">The leadership change comes just a week after the bank said it was shuttering its equities capital markets and M&amp;A advisory teams in Europe, Britain and the Americas in an attempt to streamline its business and save costs. Chong's sabbatical is not related to the restructuring, a third source said.</p><p class=\"\">        Kenneth Hon has been appointed to head up the bank's APAC equities team in her absence, according to the sources. He is taking on the role in addition to his existing job as head of HSBC's prime financing unit for Asia.</p><p class=\"\">Chief Executive Georges Elhedery has stepped up an overhaul of the bank's senior management ranks globally, slashing duplicate roles to boost returns and tighten its focus on Asia, where HSBC already earns the bulk of its profit.</p><p class=\"\">Several high-profile managers have exited the bank in recent months since HSBC said last October it wanted to merge some operations and split its geographic footprint into East and West in order to compete more effectively with global rivals.</p><p class=\"\">The bank is expected to share more details on the savings it hopes to make following the changes when it releases financial results later this month. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0AJ:0-hsbc-deputy-global-equities-chief-takes-leave-sources-say/",
            "pub_date": "2025-02-04 17:45:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0BE:0",
            "title": "Prices edge lower on profit taking, mixed temperature outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dutch and British wholesale gas prices edged lower on Tuesday morning on some profit-taking after prices reached a fresh 15-month high on Monday amid a mixed temperature outlook this week.</p><p class=\"\">The benchmark front-month contract at the Dutch TTF hub (TRNLTTFMc1) was down  0.65 euro at 53.10 euros per megawatt-hour (MWh), or $16.10/mmBtu, by 0925 GMT, according to LSEG data..</p><p class=\"\">The contract hit an intra-day high of 54.61 euros/MWh on Monday, its highest level since October 2023.</p><p class=\"\">Analysts at Engie EnergyScan said prices had weakened on profit-taking on Tuesday, but fundamentally, the market remains strong.</p><p class=\"\">The Dutch April contract (TRNLTTFMc2) was down 0.45 euro at 53.20 euros/MWh.</p><p class=\"\">In Britain, the front-month contract (TRGBNBPMc1)  fell 1.15 pence at 129.9 p/therm.</p><p class=\"\">Analysts at LSEG said temperatures were expected to rise around 2 degrees Celsius in Northwest Europe for Wednesday but that cooler temperatures towards the end of the week will follow this.</p><p class=\"\">“Temperature forecasts are still limiting the downside as the duration of that cold spell remains uncertain,” said LSEG analyst Ulrich Weber.</p><p class=\"\">Europe’s gas stores are currently 52.65% full, data from gas Infrastructure Europe showed.</p><p class=\"\">“Colder temperatures are expected for the week ahead, much lower than seasonal normal levels, which is likely to add some further pressure to EU gas stocks,” analysts at consultancy Auxilione said.</p><p class=\"\">In the European carbon market (CFI2Zc1), the benchmark contract was down 0.33 euros at 80.63 euros a metric ton.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0BE:0-prices-edge-lower-on-profit-taking-mixed-temperature-outlook/",
            "pub_date": "2025-02-04 17:45:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463381:0",
            "title": "Singapore Shares Close Lower as Trump Tariffs Trigger Regional Panic; CapitaLand Investment Up 2%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Singapore's stock market remained in the red zone on Tuesday with investor confidence taking a beating after China retaliated with tariffs on US goods following US President Donald Trump's tariffs. </p><p class=\"\">The Straits Times Index (STI), a key benchmark for the Singapore Exchange, ranged between 3,817.58 and 3,858.17 throughout the day. It ended the session at 3,823.01, down 3.46 points or 0.1% compared to Monday's close. </p><p class=\"\">In company news, shares of CapitaLand Investment  were up nearly 2% at the close after it acquired a freehold land parcel in Osaka, Japan, to develop its first data center in the country. </p><p class=\"\">Lendlease Global Commercial REIT's  was down nearly 1% after its distribution per unit or DPU declined 14% for the fiscal first half ended Dec. 31, 2024, to SG$0.018 from SG$0.021 a year earlier. </p><p class=\"\">Meanwhile, Keppel Pacific Oak US REIT's  income available for distribution for the second half of 2024 was down nearly 9% to $23.8 million from $26.1 million a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463381:0-singapore-shares-close-lower-as-trump-tariffs-trigger-regional-panic-capitaland-investment-up-2/",
            "pub_date": "2025-02-04 17:36:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463379:0",
            "title": "Hong Lai Huat Expecting Net Loss in 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Lai Huat Group  is expected to book a net loss for the year ended Dec. 31, 2024, according to a filing with the Singapore Exchange on Tuesday. </p><p class=\"\">The company will disclose its financial results on Feb. 28, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463379:0/",
            "pub_date": "2025-02-04 17:36:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:800891156094b:0",
            "title": "Owens & Minor Shares Plunge 35% as Company Reports Preliminary 2024 Losses",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Owens &amp; Minor Inc. (OMI, Financials) shares plummeted 35.2% on Monday, closing at $9.23, after the company said it is moving forward with its planned acquisition of Rotech Healthcare Holdings, announcing that it has begun raising funds to support the deal. The company expects to finalize the purchase in the first half of 2025.</p><p class=\"\">Owens &amp; Minor projects a net loss between $288 million and $311 million but sales for the fourth quarter between $2.67 billion and $2.70 billion. A major component of the loss is a $310 million goodwill impairment charge linked to its Apria subsidiary, which the firm ascribed to market conditionsincluding a declining stock price and increasing interest rates.</p><p class=\"\">With a net loss ranging from $355 million to $378 million, full-year income for 2024 is anticipated to be between $10.67 billion and $10.70 billion. Notwithstanding the losses, the business highlighted strong success in its Patient Direct division, which witnessed consistent mid-single-digit growth. Over the previous year, Owens &amp; Minor also lowered overall debt by more than $240 million.</p><p class=\"\">Pesicka said he still sees great demand for the company's goods and services and is hopeful about its long-term plan.</p><p class=\"\">On Feb. 28, Owens &amp; Minor will provide its complete fourth-quarter and yearly financial figures.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:800891156094b:0-owens-minor-shares-plunge-35-as-company-reports-preliminary-2024-losses/",
            "pub_date": "2025-02-04 17:36:28",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0B3:0",
            "title": "Sterling drops versus euro after biggest daily rise in months, awaits BoE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The pound edged lower against the euro on Tuesday after recording its biggest daily rise in three months a day earlier as investors expect U.S. tariffs to hurt the economy more in Europe than in the UK.</p><p class=\"\">It dropped against a strengthening dollar as tariffs against China took effect. It was down 0.15% at $1.2433.  </p><p class=\"\">Market participants also awaited the Bank of England's policy meeting later this week.</p><p class=\"\">The pound \"seems to be retaining some solid footing after an American trade war was averted,\" said Francesco Pesole, forex strategist at ING.</p><p class=\"\">\"The reason is simple: the UK has little to lose from U.S. tariffs. UK exports to the U.S. are less than 2% of GDP and those to China less than 1%,\" he added.</p><p class=\"\">The pound fell 0.1% to 83.18 pence per euro after being up 0.55% the day before in its biggest rise since early November. On Monday, it hit highest since Jan. 8 at 82.88 pence.</p><p class=\"\">The BoE, which is widely expected to cut rates by 25 basis points (bps) on Thursday, could nudge investors to expect faster rate reductions. </p><p class=\"\">\"Looking ahead, we see room for deeper cuts than what financial markets expect. Trade uncertainty is rising, labour demand is falling, fiscal policy is tight, and the policy rate is well above our neutral estimate of 2-3%,\" said Peder Beck-Friis, economist at PIMCO.</p><p class=\"\">However, there is still uncertainty about BoE's possible suggestions about future rate cuts.</p><p class=\"\">\"The economy is vibing 'stagflation'. We think the bank will lean dovish to these risks, as it has done throughout this cycle,\" said Shaan Raithatha, senior economist at Vanguard, adding Vanguard base case is for a 25-basis-point cut on Thursday to be followed by one cut every quarter thereafter.</p><p class=\"\">BofA said February was too early for a decisive dovish shift because inflation will likely pick up in the coming months.</p><p class=\"\">British Prime Minister Keir Starmer told European Union leaders on Monday that he wanted to work together to expand the continent's defences, including greater cooperation on missions and the cost of rearmament. </p><p class=\"\">\"Markets may be double reading an intent by Starmer to gradually reconnect with the EU politically,\" said ING’s Pesole, adding that would be positive for sterling, which remains highly sensitive to developments that can affect the growth outlook. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0B3:0-sterling-drops-versus-euro-after-biggest-daily-rise-in-months-awaits-boe/",
            "pub_date": "2025-02-04 17:36:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV01M:0",
            "title": "Italian Wine Brands Prelim. FY Adj EBITDA At Over EUR 50 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Italian Wine Brands S.P.A. :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY ADJUSTED EBITDA PRELIM OVER EUR 50 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY PRELIM TOTAL REVENUE EUR 401.8 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV01M:0-italian-wine-brands-prelim-fy-adj-ebitda-at-over-eur-50-mln/",
            "pub_date": "2025-02-04 17:36:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002597:0",
            "title": "Expand Energy Initiated at Strong Buy by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(09:37 GMT) </strong>Expand Energy Price Target Announced at $135.00/Share by Raymond James</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002597:0/",
            "pub_date": "2025-02-04 17:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1DL:0",
            "title": "Bharat Bijlee Dec-Qtr Profit 406.2 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bharat Bijlee Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BHARAT BIJLEE DEC-QUARTER PROFIT 406.2 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">BHARAT BIJLEE DEC-QUARTER REVENUE FROM OPERATIONS 5.14 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1DL:0-bharat-bijlee-dec-qtr-profit-406-2-mln-rupees/",
            "pub_date": "2025-02-04 17:37:15",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:25b27e65b094b:0",
            "title": "Dollar gains ease in European morning trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Trump may have delayed the 25% tariffs on Canada and Mexico but the additional 10% tariffs on China did go into effect earlier. Beijing did respond with their own counter-tariffs but they will only go into effect on 10 February. And with Trump teasing talks with Xi before heading to bed, there's still some hope.</p><p class=\"\">The dollar opened the week with a gap higher but lost all of its allure from there in trading yesterday. There was a slight bounce earlier but even that seems to have faded quite a bit now. EUR/USD is flat on the day as it starts to eat back into that opening gap on the week:</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1067.1936758893282px;aspect-ratio:1.7786561264822136\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:25b27e65b094b-291328cd09a6820ea7e69910bedcc9d4-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:25b27e65b094b-291328cd09a6820ea7e69910bedcc9d4-resized.jpeg\" style=\"background-color:#1c1f28\"/></picture></div></figure></span><p class=\"\">EUR/USD hourly chart</p><p class=\"\">The near-term chart still shows sellers in control, with price action resting below the key hourly moving averages. But any major downside move will be contingent on tariff headlines and trade developments in the next few days.</p><p class=\"\">For now, the tariffs can being kicked down the road suggests hope that Trump may not let all hell break loose on the trade front. However, the EU and China are definitely in the crosshairs next.</p><p class=\"\">Elsewhere, USD/JPY is still seen up 0.2% to 155.10 but off its earlier high of 155.51 on the session. AUD/USD is also still down 0.3% to 0.6205 but off its earlier low of 0.6170 after the China retaliation headlines hit.</p><p class=\"\">Meanwhile, USD/CAD itself is nearly flat at 1.4440 with sellers stepping back in after a push to 1.4500 earlier in the day.</p><p class=\"\">Looking to broader markets, there is still caution to be heeded though. S&amp;P 500 futures are down 0.2% and 10-year Treasury yields are holding the line but only marginally higher today by 1.2 bps to 4.565% at the moment.</p></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:25b27e65b094b:0-dollar-gains-ease-in-european-morning-trade/",
            "pub_date": "2025-02-04 17:37:40",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002599:0",
            "title": "Vodafone Shares Fall After Revenue Declines in Biggest Market — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Najat Kantouar</p><p class=\"\">Vodafone Group shares fell after the group reported a sharp revenue decline in Germany, its biggest market, reflecting the impact from a TV law change in the country and a more competitive environment.</p><p class=\"\">In early trading in Europe, London-listed shares were down 5.4% at 66.14 pence. Year to date, shares have fallen 3.7%.</p><p class=\"\">The telecommunications company said revenue in Germany fell 7.6% on a reported basis to 3.09 billion euros ($3.20 billion). Service revenue--a closely watched metric in the telecom sector--in the country represents 34% of group service revenue and fell 6.4% to 2.89 billion euros for the quarter ended Dec. 31. This was partly due to the expected impact from German regulatory changes, which prevent landlords from bundling TV services with rental agreements, as well as lower broadband customer base.</p><p class=\"\">Germany's turnaround will take time as the group is still absorbing the impact of the law change and face a highly competitive market environment, Chief Executive Margherita Della Valle said on Tuesday.</p><p class=\"\">Meanwhile, U.K. service revenue climbed 3.3% on organic basis to 1.51 billion euros, boosted by significant investments in customer experience. On a group level, service revenue rose to 7.93 billion euros from 7.505 billion euros.</p><p class=\"\">Adjusted earnings before interest, taxes, depreciation and amortization and after lease expenses increased 2.2% on an organic basis to 2.83 billion euros. This was driven by service revenue growth in most markets and lower energy costs in Europe that offset the law impact in Germany. Revenue rose to 9.81 billion euros from 9.35 million euros.</p><p class=\"\">This represents the first set of earnings following the group's exit from Italy. Vodafone sale of the Italian business to Swisscom was approved by Italy's competition regulator in the quarter, marking the final step for getting full clearance. The proceeds, 8 billion euros in cash, have been used to reduce the group's net debt.</p><p class=\"\">Vodafone expects to complete the merger of its U.K. business with its rival operator Three during the first half of 2025, putting an end to group's reshaping plan for growth, Della Valle said.</p><p class=\"\">Separately, the group launched a share buyback of up to 480 million euros to reduce its share capital.</p><p class=\"\">Vodafone reiterated its fiscal 2025 guidance, which includes adjusted EbitdaaL of around 11.0 billion euros and adjusted free cash flow to be at least 2.4 billion euros.</p><p class=\"\">Write to Najat Kantouar at najat.kantouar@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002599:0/",
            "pub_date": "2025-02-04 17:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0DB:0",
            "title": "IAG: Queensland flooding claims top 108 ahead of policyholder meetings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Australian insurer IAG Limited has so far received 108 claims across its brands from the devastating storms and floods which have impacted northern Queensland.</p><p class=\"\">IAG, which includes brands NRMA Insurance, CGU, WFI and ROLLiN’, currently has claims specialists on the ground providing support to policyholders impacted by the extreme rainfall and flooding in the north and far north of Queensland.</p><p class=\"\">Torrential rains have hammered the state of Queensland over the past four days and the rainfall has left around 10,000 homes without power, according to reports in Australia.</p><p class=\"\">The impact has been felt most significantly in and around Townsville, Innisfail, Ingham, Gordonvale and Cardwell, with the ASX-listed insurer confirming it had received 108 claims from policyholders across the state.</p><p class=\"\">IAG made the claims disclosure on 4 February alongside a statement confirming that its claims teams would be on-hand in Townsville from Wednesday to help policyholders lodge claims in person.</p><p class=\"\">It comes shortly after the Insurance Council of Australia (ICA) declared a “significant event” for the regions in North Queensland impacted by the extreme weather.</p><p class=\"\">Under a significant event declaration, the ICA commences its claims data collection, analysis, and reporting processes in consultation with its members.</p><p class=\"\">The ICA said the event may be escalated to an insurance catastrophe if there is a significant increase in claim numbers or complexity, if the geographical spread of this event is extended, or in consultation with insurers.</p><p class=\"\">In August 2024, the ICA said that Australian insurers had incurred A$2.19bn ($1.34bn) of claims from declared extreme weather events over the previous 12 months.</p><p class=\"\">The event with the greatest impact on individual customers was ex-Tropical Cyclone Jasper, which hit far north Queensland in mid-December 2023 causing total insured losses of A$357mn.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0DB:0-iag-queensland-flooding-claims-top-108-ahead-of-policyholder-meetings/",
            "pub_date": "2025-02-04 17:38:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0BQ:0",
            "title": "Japan offers to buy 96,725 tons of food wheat via tender",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan's Ministry of Agriculture, Forestry and Fisheries (MAFF) is seeking to buy a total of 96,725 metric tons of food-quality wheat from the U.S. and Canada in a regular tender that will close late on Thursday.</p><p class=\"\">Japan, the world's sixth-biggest wheat importer, maintains a tight grip on imports of the country's second-most important staple after rice, and buys a majority of the grain for milling through tenders typically issued three times a month.</p><p class=\"\"> Details are as follows (in metric tons):</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">COUNTRY </p></td><td><p class=\"\">TYPE</p></td><td><p class=\"\">QUANTITY</p></td><td></td></tr><tr><td><p class=\"\">U.S.        </p></td><td><p class=\"\">Western White</p></td><td><p class=\"\">19,885</p></td><td><p class=\"\">*</p></td></tr><tr><td><p class=\"\">U.S.            </p></td><td><p class=\"\">Dark Northern Spring (protein minimum 14 pct)</p></td><td><p class=\"\">14,260</p></td><td><p class=\"\">*</p></td></tr><tr><td><p class=\"\">U.S.              </p></td><td><p class=\"\">Hard Red Winter(Semi Hard)</p></td><td><p class=\"\">31,630</p></td><td><p class=\"\">*</p></td></tr><tr><td><p class=\"\">Canada</p></td><td><p class=\"\">Western Red Spring(protein minimum 13.5 pct)</p></td><td><p class=\"\">32,180</p></td><td><p class=\"\">*</p></td></tr></tbody></table></div><p class=\"\">Shipments:  * Loading between Mar. 21 and Apr 20</p><p class=\"\">Source: MAFF</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0BQ:0-japan-offers-to-buy-96-725-tons-of-food-wheat-via-tender/",
            "pub_date": "2025-02-04 17:38:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463382:0",
            "title": "The Kiyo Bank's Nine-Month Profit Rises 14%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Kiyo Bank's  attributable profit rose 14% to 11.4 billion yen in the nine months ended Dec. 31, 2024 from 10.1 billion yen in the year-ago period, according to a Monday filing with the Tokyo Stock Exchange. </p><p class=\"\">Earnings per share at the regional bank increased to 176.13 yen from 153.90 yen in the previous year. </p><p class=\"\">Ordinary income grew 11% to 68.3 billion yen from 61.4 billion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to fall 3.5% to 14.5 billion yen or 224.28 yen per share, while ordinary income is forecast to increase 1% to 85.6 billion yen. </p><p class=\"\">The company is expected to declare a year-end dividend of 45 yen per share.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463382:0/",
            "pub_date": "2025-02-04 17:39:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463369:0",
            "title": "Mitsubishi Motors' Fiscal Nine-Month Profit Plunges 68%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitsubishi Motors'  attributable profit fell 68% to 33.2 billion yen in the nine months ended Dec. 31, 2024 from 102.8 billion yen in the year-ago period, according to a Monday filing with the Tokyo Stock Exchange. </p><p class=\"\">Earnings per share at the car manufacturer decreased to 22.79 yen from 69.03 yen in the previous year. </p><p class=\"\">Net sales declined 3.6% to 1.989 trillion yen from 2.064 trillion yen a year earlier. </p><p class=\"\">For fiscal 2025, attributable profit is seen to fall 77% to 35 billion yen yen or 26.16 yen per share, while net sales are forecast to fall 1.1% to 2.760 trillion yen. </p><p class=\"\">The company is seen to declare a total of 15 yen per share at year-end. </p><p class=\"\">Shares closed 15% lower during Tuesday's trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463369:0/",
            "pub_date": "2025-02-04 17:40:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002481_20250204002561:0",
            "title": "Kion Group Expects 2025 One-Off Expenses of EUR240M to EUR260M",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002481_20250204002561:0/",
            "pub_date": "2025-02-04 17:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_S8N3ME0DK:0",
            "title": "South African government sells 3.75 billion rand of bonds at auction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Africa's government sold 3.75 billion rand ($199.99 million) of its 2032 (ZAR2032=), 2037 (ZAR2037=) and 2048 (ZAR2048=) bonds at auction on Tuesday.</p><p class=\"\">For the results click here and scroll down to Weekly Government Bond Auctions.</p><p class=\"\">($1 = 18.7509 rand)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_S8N3ME0DK:0-south-african-government-sells-3-75-billion-rand-of-bonds-at-auction/",
            "pub_date": "2025-02-04 17:31:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0ML:0",
            "title": "Generali says to keep investment decisions in BPCE deal, won't cut stake",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Deal under scrutiny by Italy's government</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Rome worried about decision-making power over investments</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Asset management JV to be Europe's biggest by revenue</li></ul></span></div><span><p class=\"\">    Generali  will remain in charge of decisions over how to allocate its own clients' savings under the asset management deal with France's BPCE, the insurer said, addressing concerns raised by Italy's government and two leading investors. </p><p class=\"\">In a bid to smooth the deal's approval process, Generali also reassured in a statement on Tuesday that it did not plan to reduce its stake in the venture it is finalising with BPCE.</p><p class=\"\">Generali and BPCE last month struck a non-binding accord to create Europe's largest asset manager by revenue, by combining their Generali Investments Holding (GIH) and Natixis Investment Managers units in a joint venture of which the subsidiaries would each own 50%.</p><p class=\"\">The deal faces regulatory hurdles, especially in Italy, where the government is keen for domestic savings to keep supporting the refinancing of its large public debt. </p><p class=\"\">Sources told Reuters last week that Rome wanted further guarantees that Generali will remain in full control of allocating savings collected in the country.  </p><p class=\"\">\"The creation of the partnership would have no impact on the continuity of savings management policies entrusted by Italian clients to the Generali group's companies, which remain the owners of the assets and decide on their allocation\", it said.</p><p class=\"\">    Italy must clear the deal under \"golden power\" legislation that gives it clout over firms it deems as strategic. </p><p class=\"\">\"Generali and its board of directors – just as it is the case today – will continue to define the strategic investment guidelines and asset allocation for the entire group\", Generali said.</p><p class=\"\">GIH has Taiwanese insurance Cathay Life  as a minority investor with 16.75%, meaning Generali itself will hold less than 50% of the JV it is forming through GIH.</p><p class=\"\">    The insurer said the accord envisaged mechanisms to allow and regulate any exit from the venture after a certain period of time.  </p><p class=\"\">    \"It is however not Generali's intention to – nor are there any contractual provisions that could compel it to – reduce its stake or governance rights,\" it said.  </p><p class=\"\">    From a tax perspective the deal does not imply any transfer of value outside Italy, the insurer said, adding that \"it is indeed plausible that the Italian tax burden would increase\". </p><p class=\"\">Two major Generali investors -  Francesco Gaetano Caltagirone and Delfin, the holding company of late billionaire Leonardo Del Vecchio - have concerns about the influence the French side could exert in the partnership, sources have previously said. </p><p class=\"\">Directors appointed by the two shareholders voted against the Natixis deal, which is expected to close in early 2026.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0ML:0-generali-says-to-keep-investment-decisions-in-bpce-deal-won-t-cut-stake/",
            "pub_date": "2025-02-04 17:31:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OU0Y6:0",
            "title": "COMMENT-The dollar is Trump's Achilles heel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The dollar is Donald Trump's Achilles heel as its strength, stemming from his plans to help the United States, could undo any good that results from the trade war he is fuelling.</p><p class=\"\">The stronger the dollar becomes, the larger U.S. trade deficits may become, with monetary policy effectively tightening and strangling the economy.</p><p class=\"\">The dollar is already having a huge impact. Its trade-weighted value has boomed almost 6% since September, reaching a near two-decade peak last month. </p><p class=\"\">While tariff threats have forced Mexico and Canada to the negotiating table, China's been quick to fight back, and for currencies, delays which prolong uncertainty could be just as potent as the tariffs themselves.</p><p class=\"\">For those trying to hedge the future direction of currencies it remains prudent to adopt a defensive position that will support assets deemed safer. The dollar is the most liquid and safest of all.</p><p class=\"\">While some money may flow toward Japan's yen and Swiss franc, both are undermined by monetary policy, which in the U.S. - where the balance sheet has been reduced and interest rates are set to remain high - supports the greenback.</p><p class=\"\">There is great potential for the dollar to rise further and should this sledgehammer approach to policy turn a spat into a war, the U.S. currency could rocket.</p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:582.4817518248176px;max-width:1200px;aspect-ratio:2.0601503759398496\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OU0Y6-dafe967cee2d9e13fec091019fb4fa71-resized.webp\" type=\"images/webp\"/><img alt=\"BUZZ\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OU0Y6-dafe967cee2d9e13fec091019fb4fa71-resized.jpeg\" style=\"background-color:#282728\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Trade weighted value of the dollar</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OU0Y6:0-comment-the-dollar-is-trump-s-achilles-heel/",
            "pub_date": "2025-02-04 17:32:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}