{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308829:0",
            "title": "DA Davidson Adjusts Price Target on Caterpillar to $357 From $350, Keeps Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Caterpillar  has an average rating of hold and mean price target of $338.77, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308829:0/",
            "pub_date": "2025-02-04 21:43:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006571:0",
            "title": "Hyatt Hotels Is Maintained at Overweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:44 GMT) </strong>Hyatt Hotels Price Target Cut to $170.00/Share From $172.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006571:0/",
            "pub_date": "2025-02-04 21:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308836:0",
            "title": "Evercore ISI Adjusts Fifth Third Bancorp Price Target to $48 From $47, Maintains In Line Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fifth Third Bancorp  has an average rating of overweight and mean price target of $51.33, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308836:0/",
            "pub_date": "2025-02-04 21:44:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_NFC7ffhLQ:0",
            "title": "Berger Montague Reminds Marqeta (MQ) Investors With Substantial Losses to Inquire About a Securities Fraud Class Action by February 7, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Philadelphia, Pennsylvania--(Newsfile Corp. - February 4, 2025) - Berger Montague PC advises investors that a securities class action lawsuit has been filed against <strong class=\"root-Tkn6WL2y\">Marqeta, Inc.</strong> (\"Marqeta\" or the \"Company\")  on behalf of purchasers of Marqeta securities between <strong class=\"root-Tkn6WL2y\">May 7, 2024 through November 4, 2024,</strong> inclusive (the \"Class Period\").</p><p class=\"\">Investor Deadline: Investors who purchased or acquired <strong class=\"root-Tkn6WL2y\">MARQETA</strong> <!-- -->securities during the Class Period may, no later than <strong class=\"root-Tkn6WL2y\">FEBRUARY 7, 2025</strong>, seek to be appointed as a lead plaintiff representative of the class.</p><p class=\"\">Headquartered in Oakland, CA, Marqeta operates a cloud-based platform which enables businesses to issue and manage their own payment cards.</p><p class=\"\">According to the lawsuit, throughout the Class Period, Marqeta and its executives violated federal securities laws by making false and/or misleading statements and/or failing to disclose that: (1) Marqeta understated the regulatory challenges affecting its business outlook; and (2) as a result, Marqeta would have to lower its guidance for the fourth quarter of 2024.</p><p class=\"\">On November 4, 2024, the Company issued a press release entitled \"Marqeta Reports Third Quarter 2024 Financial Results.\" In addition to reporting its third quarter results, Marqeta announced lower fourth quarter guidance which reflected \"several changes that became apparent over the last few months with regards to the heightened scrutiny of the banking environment and specific customer program changes.\"</p><p class=\"\">On this news, the price of Marqeta stock fell $2.53 per share - more than 42% - from a close of $5.95 per share on November 4, 2024 to close at $3.42 per share on November 5, 2024.</p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">To learn your rights,</strong></em> <em><strong class=\"root-Tkn6WL2y\">CLICK HERE</strong></em> <!-- -->or please contact Berger Montague: Andrew Abramowitz at <em><strong class=\"root-Tkn6WL2y\">aabramowitz@bm.net</strong></em> <em><strong class=\"root-Tkn6WL2y\">or (215) 875-3015, or Peter Hamner at</strong></em> <em><strong class=\"root-Tkn6WL2y\">phamner@bm.net</strong></em>.</p><p class=\"\">A lead plaintiff is a representative party who acts on behalf of all class members in directing the litigation. The lead plaintiff is usually the investor or small group of investors who have the largest financial interest and who are also adequate and typical of the proposed class of investors. The lead plaintiff selects counsel to represent the lead plaintiff and the class and these attorneys, if approved by the court, are lead or class counsel. Your ability to share in any recovery is not, however, affected by the decision whether or not to serve as a lead plaintiff. Communicating with any counsel is not necessary to participate or share in any recovery achieved in this case. Any member of the purported class may move the Court to serve as a lead plaintiff through counsel of his/her choice, or may choose to do nothing and remain an inactive class member.</p><p class=\"\">Berger Montague, with offices in Philadelphia, Minneapolis, Delaware, Washington, D.C., San Diego, San Francisco and Chicago, has been a pioneer in securities class action litigation since its founding in 1970. Berger Montague has represented individual and institutional investors for over five decades and serves as lead counsel in courts throughout the United States.</p><p class=\"\">Contact:</p><p class=\"\">Andrew Abramowitz, Senior Counsel</p><p class=\"\">Berger Montague</p><p class=\"\">(215) 875-3015</p><p class=\"\">aabramowitz@bm.net</p><p class=\"\">Peter Hamner</p><p class=\"\">Berger Montague PC</p><p class=\"\">phamner@bm.net</p><p class=\"\">To view the source version of this press release, please visit https://www.newsfilecorp.com/release/239533</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_NFC7ffhLQ:0-berger-montague-reminds-marqeta-mq-investors-with-substantial-losses-to-inquire-about-a-securities-fraud-class-action-by-february-7-2025/",
            "pub_date": "2025-02-04 21:44:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308835:0",
            "title": "Daiwa Securities Adjusts Price Target on AbbVie to $190 From $180, Keeps Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AbbVie  has an average rating of overweight and mean price target of $207.40, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308835:0/",
            "pub_date": "2025-02-04 21:44:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA20NWY2:0",
            "title": "ClubLink Acquires Deer Creek",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLUBLINK ACQUIRES DEER CREEK</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLUBLINK: ACQUIRES DEER CREEK FOR $45 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA20NWY2:0-clublink-acquires-deer-creek/",
            "pub_date": "2025-02-04 21:44:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX5bL7zX:0",
            "title": "Latin Metals Discovers Visible Gold at La Flora Project, Santa Cruz, Argentina",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, British Columbia, Feb.  04, 2025  (GLOBE NEWSWIRE) — <strong class=\"root-Tkn6WL2y\">Latin Metals Inc. </strong>(<strong class=\"root-Tkn6WL2y\">“Latin Metals” </strong>or the <strong class=\"root-Tkn6WL2y\">“Company”</strong>) - <strong class=\"root-Tkn6WL2y\"></strong> <strong class=\"root-Tkn6WL2y\">(OTCQB: LMSQF)</strong> provides an update on recent exploration results at its Cerro Bayo (“<strong class=\"root-Tkn6WL2y\">Cerro Bayo</strong>”) and La Flora (“<strong class=\"root-Tkn6WL2y\">La Flora</strong>”) projects.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Positive Exploration Results at La Flora</strong></p><p class=\"\">Samples were collected from two outcropping structures where visible gold was observed as part of a grey, microgranular silica event within the La Flora project area. Assay results from these samples returned values of up to 82 g/t gold and 1,239 g/t silver. To the north, these structures are concealed beneath overburden material and further testing of these bonanza-grade veins will need to be undertaken as part of future drilling.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:835.3605560382277px;aspect-ratio:1.392267593397046\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX5bL7zX-dca1594e6f64a6ec9ec7b19742168fd3-resized.webp\" type=\"images/webp\"/><img alt=\"Figure Cerro Bayo\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX5bL7zX-dca1594e6f64a6ec9ec7b19742168fd3-resized.jpeg\" style=\"background-color:#e9e4e7\"/></picture></div></figure></span></p><p class=\"\">Figure 1: Map showing in plan view the Cerro Bayo property, including the La Flora area. It provides an enhanced view of the Flora zone, highlighting the recognized veins, collected samples, and the interpreted vein traces beneath the overburden.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Cerro Bayo and Regional Significance</strong></p><p class=\"\">The Cerro Bayo district is located within the highly prospective Deseado Massif geological province, an area known for its significant precious metal deposits. The region has a long history of mining activity and hosts several producing and past-producing mines, highlighting its exploration potential. The mineralization in the area is typically associated with epithermal systems that have yielded high-grade gold and silver deposits. Latin Metals’ exploration efforts at Cerro Bayo are supported by a wealth of historical data from previous operators, including Barrick Gold, and demonstrate the potential for further discoveries within this established mining jurisdiction.</p><p class=\"\">Argentina’s mining sector has seen increasing foreign investment due to its rich mineral endowment and improving regulatory framework. The country is recognized for its world-class gold, silver, and lithium deposits, with the Santa Cruz province, in particular, playing a vital role in Argentina’s gold and silver production. Latin Metals’ Cerro Bayo and La Flora projects align with this broader trend of mineral development and underscore the company’s commitment to unlocking value through systematic exploration and strategic partnerships.</p><p class=\"\">Initial exploration in the Cerro Bayo project was completed by Barrick Gold. In late 2024, the Latin Metals team completed additional mapping at Cerro Bayo and expanded exploration to La Flora for the first time, using Barrick’s historical data as a foundation to standardize lithological interpretations in the La Flora area.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Updated Presentation</em></strong></p><p class=\"\">The Company’s technical presentation for Cerro Bayo has been significantly updated to include geological mapping, sampling, and photographs of outcropping altered and mineralized rocks results at drill target scale. Identification of visible gold during our first exploration at the La Flora project reflects the district-scale perspective of the Cerro Bayo district.</p><p class=\"\">The updated presentation materials can be downloaded <em>here</em>.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Next Steps</em></strong></p><p class=\"\">The Company has completed all work and met all requirements for granting of an exploration and drilling permit. We are hopeful that the permit will be approved by government authorities in Q1 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Latin Metals to Attend PDAC 2025 – Booth #2329</em></strong></p><p class=\"\">Latin Metals will attend PDAC 2025 in Toronto from March 2-5, 2025, engaging with investors and industry leaders to discuss its prospect generator model and exploration projects in Argentina &amp; Peru. Visit us at Booth #2329 or schedule a meeting at info@latin-metals.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>About Latin Metals</em></strong></p><p class=\"\">Latin Metals is a mineral exploration company acquiring a diversified portfolio of assets in South America. The Company operates with a Prospect Generator model focusing on the acquisition of prospective exploration properties at minimum cost, completing initial evaluation through cost-effective exploration to establish drill targets, and ultimately securing joint venture partners to fund drilling and advanced exploration. Shareholders gain exposure to the upside of a significant discovery without the dilution associated with funding the highest-risk drill-based exploration.</p><p class=\"\">Stay up-to-date on Latin Metals developments by joining our online communities on X, Facebook, LinkedIn and Instagram.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>QA/QC</em></strong></p><p class=\"\">The work program at Cerro Bayo was designed and supervised by Eduardo Leon, the Company's Exploration Manager, who is responsible for all aspects of the work, including the quality control/quality assurance program. On-site personnel at the project rigorously prepare and track samples which are security sealed and shipped to the Alex Stewart laboratory in Perito Moreno. Samples used for the results described herein are prepared and analyzed for Gold and Silver.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Qualified Person</em></strong></p><p class=\"\">Keith J. Henderson, P.Geo., is the Company's qualified person as defined by NI 43-101 and has reviewed the scientific and technical information that forms the basis for portions of this news release. He has approved the disclosure herein. Mr. Henderson is not independent of the Company, as he is an employee of the Company and holds securities of the Company.</p><p class=\"\">On Behalf of the Board of Directors of</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">LATIN METALS INC.</strong></p><p class=\"\">“<em>Keith Henderson</em>”</p><p class=\"\">President &amp; CEO</p><p class=\"\">For further details on the Company readers are referred to the Company's web site (www.latin-metals.com) and its Canadian regulatory filings on SEDAR+ at www.sedarplus.com.</p><p class=\"\">For further information, please contact:</p><p class=\"\">Keith Henderson</p><p class=\"\">Suite 890 - 999 West Hastings Street,</p><p class=\"\">Vancouver, BC, V6C 2W2</p><p class=\"\">Phone: 604-638-3456</p><p class=\"\">E-mail: info@latin-metals.com</p><p class=\"\">Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</p><p class=\"\">Cautionary Note Regarding Forward-Looking Statements</p><p class=\"\">This news release contains forward-looking statements and forward-looking information (collectively, \"forward-looking statements\") within the meaning of applicable Canadian and U.S. securities legislation, including the United States Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical fact, included herein including, without limitation, the anticipated content, commencement, timing and cost of exploration programs in respect of the Property and otherwise, anticipated exploration program results from exploration activities, and the Company's expectation that it will be able to enter into agreements to acquire interests in additional mineral properties, the discovery and delineation of mineral deposits/resources/reserves on the Properties, and the anticipated business plans and timing of future activities of the Company, are forward-looking statements. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Often, but not always, forward looking information can be identified by words such as \"pro forma\", \"plans\", \"expects\", \"may\", \"should\", \"budget\", \"scheduled\", \"estimates\", \"forecasts\", \"intends\", \"anticipates\", \"believes\", \"potential\" or variations of such words including negative variations thereof, and phrases that refer to certain actions, events or results that may, could, would, might or will occur or be taken or achieved. In making the forward-looking statements in this news release, the Company has applied several material assumptions, including without limitation, market fundamentals will result in sustained precious and base metals demand and prices, the receipt of any necessary permits, licenses and regulatory approvals in connection with the future development of the Company’s Argentine projects in a timely manner, the availability of financing on suitable terms for the development, construction and continued operation of the Company projects, and the Company’s ability to comply with environmental, health and safety laws.</p><p class=\"\">Forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to differ materially from any future results, performance or achievements expressed or implied by the forward-looking information. Such risks and other factors include, among others, operating and technical difficulties in connection with mineral exploration and development and mine development activities at the Properties, including the geological mapping, prospecting and sampling programs being proposed for the Properties (the \"Programs\"), actual results of exploration activities, including the Programs, estimation or realization of mineral reserves and mineral resources, the timing and amount of estimated future production, costs of production, capital expenditures, the costs and timing of the development of new deposits, the availability of a sufficient supply of water and other materials, requirements for additional capital, future prices of precious metals and copper, changes in general economic conditions, changes in the financial markets and in the demand and market price for commodities, possible variations in ore grade or recovery rates, possible failures of plants, equipment or processes to operate as anticipated, accidents, labour disputes and other risks of the mining industry, delays or the inability of the Company to obtain any necessary permits, consents or authorizations required, any current or future property acquisitions, financing or other planned activities, changes in laws, regulations and policies affecting mining operations, hedging practices, currency fluctuations, title disputes or claims limitations on insurance coverage and the timing and possible outcome of pending litigation, environmental issues and liabilities, risks related to joint venture operations, and risks related to the integration of acquisitions, as well as those factors discussed under the heading as well as those factors discussed under the heading “Risk Factors” in the Company’s annual management’s discussion and analysis and other filings of the Company with the Canadian Securities Authorities, copies of which can be found under the Company’s profile on the SEDAR+ website at <em>www.sedarplus.ca</em><em>.</em></p><p class=\"\">Readers are cautioned not to place undue reliance on forward looking statements. Except as otherwise required by law, the Company undertakes no obligation to update any of the forward-looking information in this news release or incorporated by reference herein.</p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/bb834eef-2a8c-4b57-a100-c0565d454e81</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Figure 1: </strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Map showing in plan view the Cerro Bayo property, including the La Flora area. It provides an enhanced view of the Flora zone, highlighting the recognized veins, collected samples, and the interpreted vein traces beneath the overburden.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX5bL7zX:0-latin-metals-discovers-visible-gold-at-la-flora-project-santa-cruz-argentina/",
            "pub_date": "2025-02-04 21:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX14JdWV:0",
            "title": "La-Z-Boy Incorporated Announces Timing of Fiscal 2025 Third Quarter Earnings Release and Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MONROE, Mich., Feb.  04, 2025  (GLOBE NEWSWIRE) — La-Z-Boy Incorporated  will report its Fiscal 2025 Third Quarter results for the period ended January 25, 2025 after the close of trading on the New York Stock Exchange on Tuesday, February 18, 2025, and will hold its quarterly investor conference call at 8:30 a.m. Eastern Time the following day, Wednesday, February 19, 2025.</p><p class=\"\">The conference call will be webcast live with corresponding slides at https://lazboy.gcs-web.com/. The dial-in phone number for the live conference call will be (888) 506-0062 for persons calling from within the U.S. or Canada, and the number for international callers will be (973) 528-0011. The participant access code is 837177.</p><p class=\"\">The conference call will be archived on the internet and accessible for one year. A telephone replay will be available for two weeks following the call. This replay will be accessible to callers from the U.S. and Canada at (877) 481-4010 and to international callers at (919) 882-2331. The replay passcode is 51987.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact</strong></p><p class=\"\">Mark Becks, CFA, (734) 457-9538</p><p class=\"\">mark.becks@la-z-boy.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About La-Z-Boy</strong></p><p class=\"\">La-Z-Boy Incorporated brings the transformational power of comfort to people, homes, and communities around the world - a mission that began when its founders invented the iconic recliner in 1927. Today, the company operates as a vertically integrated furniture retailer and manufacturer, committed to uncompromising quality and compassion for its consumers.</p><p class=\"\">The Retail segment consists of 193 company-owned La-Z-Boy Furniture Galleries® stores and is part of a broader network of over 350 La-Z-Boy Furniture Galleries® that, with La-Z-Boy.com, serve customers nationwide. Joybird®, an e-commerce retailer and manufacturer of modern upholstered furniture, has 12 stores in the U.S. In the Wholesale segment, La-Z-Boy manufactures comfortable, custom furniture for its Furniture Galleries® and a variety of retail channels, England Furniture Co. offers custom upholstered furniture, and casegoods brands Kincaid®, American Drew®, and Hammary® provide pieces that make every room feel like home. To learn more, please visit: https://www.la-z-boy.com/.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX14JdWV:0-la-z-boy-incorporated-announces-timing-of-fiscal-2025-third-quarter-earnings-release-and-conference-call/",
            "pub_date": "2025-02-04 21:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_MFN7YMgkF:0",
            "title": "oodash Group AB's (publ) CEO has been interviewed by CNBC regarding Open-Source AI",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">oodash Group AB's (publ) CEO Arli Charles Mujkic has been interviewed by CNBC about the development in Open-Source AI and the Chinese company DeepSeek's launch of the AI models V3 and R1 with open source code.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Arli Charles Mujkic, CEO, quote from the article:</strong></p><p class=\"\">“DeepSeek’s R1 reasoning model is also “on par” with OpenAI’s o1 while running as much as 80% cheaper. This is the kind of paradigm shift that’s happening now.”</p><p class=\"\">The article can be read in its entirety at the link:</p><p class=\"\">https://www.cnbc.com/2025/02/04/how-deepseeks-new-ai-models-are-impacting-the-profits-of-global-companies.html</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For further information, please contact:</strong></p><p class=\"\">Arli Charles Mujkic, CEO, oodash Group AB</p><p class=\"\">Email: charlie@ooda.ai</p><p class=\"\">Telephone: +49 176 626 999 64</p><p class=\"\">Måns Pontén Söderlind, Deputy CEO, oodash Group AB</p><p class=\"\">Email: mans@ooda.ai</p><p class=\"\">Telephone: +46 70 766 47 71</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About oodash Group AB</strong></p><p class=\"\">OODA AI is a group of companies with a focus on artificial intelligence (AI) and software-as-a-service (SaaS). The group of companies provides AI services in the form of decentralized and distributed AI computing, AI tools as well as AI consulting, training and implementation. The group of companies operates on a global market, the head offices are located in Stockholm (Sweden) and Munich (Germany). Listed on Nasdaq Stockholm First North, also traded on Börse Frankfurt, Börse Stuttgart and Börse München.</p><p class=\"\">For more information, www.ooda.ai</p><p class=\"\">The company's Certified Adviser is Eminova Fondkommission AB | 08-684 211 00 | info@eminova.se</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_MFN7YMgkF:0-oodash-group-ab-s-publ-ceo-has-been-interviewed-by-cnbc-regarding-open-source-ai/",
            "pub_date": "2025-02-04 21:45:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308779:0",
            "title": "Agnico Eagle Completes Takeover of O3 Mining",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Agnico Eagle Mines  said on Tuesday that following the closing of its takeover bid it holds 97% of O3 Mining . </p><p class=\"\">Agnico said it acquired 115 million tendered O3 shares at $1.67 apiece. Agnico now owns a total of 116 million O3 shares. </p><p class=\"\">Agnico Eagle Abitibi Acquisition, an Agnico Eagle subsidiary, and O3 Mining will merge and the combined entity will become a wholly-owned subsidiary of Agnico Eagle. </p><p class=\"\">Each O3 Mining shareholder will receive one redeemable preferred share of the combined entity for each share held prior to the merger. </p><p class=\"\">The merger, which is expected to close before March 31, must be approved by at least two-thirds O3 shareholders during a special meeting. The O3 board recommends that shareholders approve the deal. </p><p class=\"\">Agnico's share price rose 0.6% at last look to US$95.44 in NYSE pre-market trading after gaining 2.3% on Monday to $138.17 on the TSX. </p><p class=\"\">O3's share price closed Monday at $1.67 on the TSXV.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308779:0/",
            "pub_date": "2025-02-04 21:45:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463504:0",
            "title": "Saudi Regulator OKs Sedco Capital Saudi Freestyle Artificial Intelligence Fund Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saudi Arabia's Capital Market Authority approved Saudi Economic and Development Securities' public offer of Sedco Capital Saudi Freestyle Artificial Intelligence Fund, according to a Tuesday notice.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463504:0/",
            "pub_date": "2025-02-04 21:45:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308841:0",
            "title": "Correction: Wolfe Initiates Coverage on AnaptysBio With Outperform Rating, $25 Price Target",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Corrected to include Wolfe's name in the headline). </p><p class=\"\">AnaptysBio  has an average rating of overweight and mean price target of $33.09, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308841:0/",
            "pub_date": "2025-02-04 21:45:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308832:0",
            "title": "Outfront Media Appoints Nick Brien as Interim CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Outfront Media  said Tuesday that board member Nick Brien has been appointed as interim chief executive officer, starting Feb. 10. </p><p class=\"\">Brien will continue to serve on the company's board during his tenure, the company said. </p><p class=\"\">The company also said it is considering Brien and other candidates for the permanent CEO role as part of a global search. </p><p class=\"\">Meanwhile, Outfront said Chief Financial Officer Matthew Siegel will take on additional operational responsibilities.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308832:0/",
            "pub_date": "2025-02-04 21:45:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA8T0DCW:0",
            "title": "USA Rare Earth and Inflection Point Acquisition Corp. II Announce Upsized PIPE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Inflection Point Acquisition Corp II :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">USA RARE EARTH AND INFLECTION POINT ACQUISITION CORP. II ANNOUNCE UPSIZED PIPE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">INFLECTION POINT ACQUISITION CORP II - FUND INCREASES PIPE INVESTMENTS BY $15.25 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">INFLECTION POINT ACQUISITION CORP II - AGGREGATE GROSS PROCEEDS FROM PIPE TRANSACTIONS NOW $40.75 MILLION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA8T0DCW:0-usa-rare-earth-and-inflection-point-acquisition-corp-ii-announce-upsized-pipe/",
            "pub_date": "2025-02-04 21:37:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA6J7QZG:0",
            "title": "ZenaTech Signes LOI to Acquire a Fifth Land Survey Company; Focused on Assisting Border Patrol and Law Enforcement to Control Illegal Immigration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ZenaTech Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ZENATECH SIGNES LOI TO ACQUIRE A FIFTH LAND SURVEY COMPANY; FOCUSED ON ASSISTING BORDER PATROL AND LAW ENFORCEMENT TO CONTROL ILLEGAL IMMIGRATION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA6J7QZG:0-zenatech-signes-loi-to-acquire-a-fifth-land-survey-company-focused-on-assisting-border-patrol-and-law-enforcement-to-control-illegal-immigration/",
            "pub_date": "2025-02-04 21:37:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463503:0",
            "title": "Abu Dhabi's Borouge Mulls Potential New Polyolefins Complex in China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Borouge (ADX:BOROUGE) plans to potentially establish a specialized polyolefins production complex in China as part of its expansion in its key growth market, the WAM news agency reported Tuesday. </p><p class=\"\">Chief Executive Officer Hazeem Sultan Al Suwaidi told the media outlet that the petrochemicals company is working with Wanhua Chemical's Wanrong New Materials (Fujian) to finalize plans and determine the next steps. </p><p class=\"\">The planned Chinese facility is expected to have an annual production capacity of 1.6 million tonnes.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463503:0/",
            "pub_date": "2025-02-04 21:37:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ObiBTlT0a:0",
            "title": "Oncoinvent ASA: Grant of share options - mandatory notification of trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Oncoinvent ASA (\"Oncoinvent\" or the \"Company\") has today granted 3,560,000shareoptions under its long term share incentive scheme for employees (the \"OptionProgram\"), each with a strike price of NOK 2.4991 of these 2,210,000 shareoptions were granted to primary insiders of the Company. For more informationabout the grant of share options to primary insiders, see the attached forms.</p><p class=\"\">Following today's grant, a total of 4,789,808 share options have been grantedunder the Option Program.</p><p class=\"\">This information is subject to the disclosure requirements pursuant to article19 of the regulation EU 596/2014 (the EU Market Abise Regulation) and section5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">About OncoinventOncoinvent ASA is a clinical stage, radiopharmaceutical company developinginnovative treatments for solid cancers. The technology platform is focused onthe use of alpha-emitting radionuclides to deliver powerful radiation directlyto cancer cells. The Company's lead product candidate, Radspherin®, is beingadvanced through clinical development by a team with experience from allstagesof radiopharmaceutical development. Internal manufacturing and supply chaincapabilities have been established, which now have the capacity to supplyRadspherin® for multi-center phase 2 clinical studies.</p><p class=\"\">For further information, please contact:Øystein Soug, Chief Executive OfficerEmail: soug@oncoinvent.com</p><p class=\"\">Tore Kvam, Chief Financial OfficerEmail: kvam@oncoinvent.com</p><p class=\"\">https://newsweb.oslobors.no/message/637685</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ObiBTlT0a:0-oncoinvent-asa-grant-of-share-options-mandatory-notification-of-trade/",
            "pub_date": "2025-02-04 21:38:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV18K:0",
            "title": "Hubbell Reports Fourth Quarter 2024 and Full Year Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hubbell Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK  FY25 TOTAL SALES GROWTH AND ORGANIC SALES GROWTH OF 4%-5%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK  FY25 ADJUSTED DILUTED EPS FROM CONTINUING OPERATIONS IN THE RANGE OF $17.35 TO $17.85</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Q4 NET SALES $1.33 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY2025 EARNINGS PER SHARE VIEW $17.70 — LSEG IBES DATA</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV18K:0-hubbell-reports-fourth-quarter-2024-and-full-year-results/",
            "pub_date": "2025-02-04 21:38:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0KN:0",
            "title": "Most Gulf markets gain despite trade war fears",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Most stock markets in the Gulf ended higher on Tuesday as investors focused on upcoming corporate earnings, despite escalating trade tensions between the U.S. and China.</p><p class=\"\">China slapped tariffs on U.S. imports in a swift response to new U.S. duties on Chinese goods, renewing a trade war between the world's top two economies even as President Donald Trump offered reprieves to Mexico and Canada.</p><p class=\"\">    An additional 10% tariff on all Chinese imports into the U.S. came into effect at 12:01 a.m. ET on Tuesday (0501 GMT) after Trump repeatedly warned Beijing it was not doing enough to halt the flow of illicit drugs into the United States.</p><p class=\"\">Saudi Arabia's benchmark index  gained 0.5%, led by a 1.6% rise in Al Rajhi Bank  and a 1.4% increase in Saudi Telecom Company . </p><p class=\"\">The kingdom's non-oil business sector expanded at its strongest pace in just over a decade in January, driven by a surge in new orders and robust business activity, a survey showed on Tuesday.</p><p class=\"\">Dubai's main share index  rose 0.7%, with toll operator Salik Company  jumping 3.5% and blue-chip developer Emaar Properties  advancing 0.7%.</p><p class=\"\">Dubai's market continued its recovery following a period of uncertainty. Investor optimism about upcoming fourth-quarter earnings drove positive performance across most sectors, particularly in financials and real estate, said Milad Azar, market analyst at XTB MENA.</p><p class=\"\">Abu Dhabi's benchmark index  edged higher 0.1%, supported by a 0.4% gain in Borouge  after it reported a sharp rise in fourth-quarter profit.</p><p class=\"\">The petrochemical firm also proposed a second-half dividend of 7.9 fils per share.</p><p class=\"\">Crude prices fell as U.S. tariffs on China took effect and Beijing retaliated with its own measures, heightening trade war fears.</p><p class=\"\">The Qatari index  finished 0.3% higher, with Qatar Gas Transport Nakilat  climbing 2.9%.</p><p class=\"\">Outside the Gulf, Egypt's blue-chip index  fell 0.3%, hit by a 1.3% fall in Talaat Moustafa Group Holding .</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">SAUDI ARABIA</p></td><td><p class=\"\"> added 0.5% to 12,434</p></td></tr><tr><td><p class=\"\">Abu Dhabi</p></td><td><p class=\"\"> rose 0.1% to 9,585</p></td></tr><tr><td><p class=\"\">Dubai</p></td><td><p class=\"\"> gained 0.7% to 5,219</p></td></tr><tr><td><p class=\"\">QATAR</p></td><td><p class=\"\"> was up 0.3% to 10,659</p></td></tr><tr><td><p class=\"\">EGYPT</p></td><td><p class=\"\"> eased 0.3% to 29,668</p></td></tr><tr><td><p class=\"\">BAHRAIN</p></td><td><p class=\"\"> lost 0.3% to 1,865</p></td></tr><tr><td><p class=\"\">OMAN</p></td><td><p class=\"\">(.MSX30) added 0.7% to 4,587</p></td></tr><tr><td><p class=\"\">KUWAIT</p></td><td><p class=\"\">(.BKP) increased 0.6% to 8,452</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0KN:0-most-gulf-markets-gain-despite-trade-war-fears/",
            "pub_date": "2025-02-04 21:38:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006516:0",
            "title": "First Business Fincl Svcs Is Maintained at Overweight by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:39 GMT) </strong>First Business Fincl Svcs Price Target Raised to $63.00/Share From $58.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006516:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006518:0",
            "title": "Choice Hotels Intl Is Maintained at Underweight by Wells Fargo",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:39 GMT) </strong>Choice Hotels Intl Price Target Raised to $138.00/Share From $133.00 by Wells Fargo</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006518:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002699:0",
            "title": "China Hits Back at Trump With U.S. Tariffs. Why Google Is in Its Crosshairs. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Brian Swint</p><p class=\"\">President Donald Trump's decision to impose additional 10% tariffs on goods from China provoked an immediate response from the world's second-largest economy.</p><p class=\"\">The new levies took effect overnight, prompting China to announce import taxes of 15% on U.S. crude oil, machinery, and some cars, as well as a 10% increase of tariffs on coal and liquified natural gas. In a move that wasn't explicitly tied to Trump's tariffs, China also said it was starting an antitrust probe into Alphabet's Google, the internet search engine.</p><p class=\"\">Beijing added two U.S. companies to its unreliable entity list — Calvin Klein owner PVH Corp. and biotechnology company Illumina.</p><p class=\"\">China also announced export controls on scarce elements that are critical for making electronics, including tungsten, tellurium, bismith, molybdenum and indium. China is a big miner of these materials.</p><p class=\"\">The moves follow a last minute delay to Trump's plans to raise taxes on imports from Mexico and Canada. That sparked a relief rally in stocks, which had fallen sharply on concern that the new tariffs would fan inflation and hamper economic growth. The question now is whether Trump and China can work out a similar deal to prevent the trade war from escalating further.</p><p class=\"\">\"For the most part, these moves are warnings that China intends to harm U.S. interests if need be but still give China the option to back down,\" said Julian Evans-Pritchard, head of China economics at Capital Economics. \"The tariffs could be postponed or cancelled before they come into effect\" on Feb. 10.</p><p class=\"\">Evans-Pritchard also noted that the Chinese retaliation only targets about $20 billion worth of imports, compared to the $450 billion in Chinese wares that Trump has targeted. What's more, China didn't raise tariffs on strategic goods such as semiconductors and pharmaceuticals.</p><p class=\"\">Write to Brian Swint at brian.swint@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002699:0/",
            "pub_date": "2025-02-04 21:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV18L:0",
            "title": "IES Holdings Reports Fiscal 2025 First Quarter Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">IES Holdings Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">IES HOLDINGS INC: QTRLY ADJUSTED EPS $2.64</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV18L:0-ies-holdings-reports-fiscal-2025-first-quarter-results/",
            "pub_date": "2025-02-04 21:39:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006523:0",
            "title": "TGI Fridays Sells Bankrupt Restaurants — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006523:0/",
            "pub_date": "2025-02-04 21:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006525:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0840 ET - TGI Fridays has sold more of the 39 company restaurants it declared bankruptcy on last year. The casual-dining chain sold 16 locations to franchisee Yadav Enterprises for $3 million in debt, along with curing costs, according to a court filing. Sugarloaf Hospitality, a current franchisee who is also managing the chain's hundreds of franchised locations, picked up three others. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">0834 ET - Diageo has had little to toast so far in 2025, AJ Bell's Russ Mould says in a note. First the calls from U.S. surgeon general for warnings about the health impacts of alcohol consumption and now it has withdrawn its medium-term guidance. The Guinness beer owner scrapped its midterm outlook of organic net sales growth of between 5% and 7%, citing uncertainty in key markets. The company said U.S. tariffs would affect the Mexican tequila and Canadian whisky it sells in the U.S. AJ Bell's investment director says the group will be relieved to see the imposition of tariffs for these two countries delayed for now, as imports from these countries account for a good chunk of Diageo's U.S. sales. Shares are down 0.7% at 23.49 pounds. (andrea.figueras@wsj.com)</p><p class=\"\">0829 ET - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">0745 ET - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">0701 ET - Kion Group posted a better-than-expected finish to the year, JPMorgan analysts say in a research note. The German industrial trucks and forklifts manufacturer's full-year adjusted EBIT exceeded the top end of the guidance, with margins ahead in both segments and fourth-quarter orders ahead of consensus, JPMorgan says. One of the risks to the medium-term margin target is the continued weakness in Supply Chain Solutions segment, where order recovery is still not visible, JPMorgan says. The company will issue 2025 guidance with the full set of results in late February, after which any possible changes to consensus will be made, the analysts say. Shares trade 11.5% higher at 38.90 euros. (nina.kienle@wsj.com)</p><p class=\"\">0645 ET - UBS Group's guidance suggests more top-line pressure to come for its global-wealth-management and personal-and-corporate banking units this quarter, Deutsche Bank's Benjamin Goy and Sharath Kumar say in a research note. The bank guided for a decline in net interest income in global wealth management in the low to mid-single percentage digits this quarter and a 10% decline in the personal and corporate banking unit. While the Swiss bank's fourth-quarter results looked solid, the business mix behind them wasn't ideal, Deutsche Bank says. The group's key global wealth management business was only in line with expectations and its personal and corporate banking unit missed estimates, the analysts say. UBS shares fall 6.1%. (adria.calatayud@wsj.com)</p><p class=\"\">0626 ET - Geberit's margins will come under pressure from higher wage costs this year but consensus estimates could move higher as the year progresses, Stifel Tobias Woerner and Augustin Cendre say in a research note. Generally, the market is too pessimistic on earnings, while the Swiss sanitary-products maker offers quality and value, the analysts say. The company should continue to grow over the years, they say. Germany remains an important part of the group's exposure and the lead indicators for residential construction in that region are better than what the stock suggests, Stifel says. Shares trade broadly flat at 504 Swiss francs. (nina.kienle@wsj.com)</p><p class=\"\">0620 ET - Machinery cyclical stock would be the most affected by U.S tariffs in the capital-goods sector, Deutsche Bank Research analyst Gael de-Bray says in a research note. Most industrial companies that have reported so far beat expectations on orders and revenue. The downturn in manufacturing activity that began in 2022 was just starting to show signs of easing, de-Bray says. However, the uncertainty, extra costs and inflation brought forth by new U.S tariffs could derail this nascent industrial recovery, the analyst says. With the risk of a global recession rising, Swedish SKF and Sandvik are likely first in line to feel the impact. (nina.kienle@wsj.com)</p><p class=\"\">0615 ET - Scor provided a positive update on its January reinsurance-treaty renewals, but this was largely as expected and might not be enough to move the needle, RBC Capital Markets' Derald Goh and Sarah Chong say in a research note. The update points to healthy volumes and flat profit margins, which are consistent with comments the French reinsurer made at its December capital-markets day, the analysts say. \"While it's a positive development we think it's largely as expected and hence we do not see anything incremental to sway the story on the back of this,\" RBC says. Shares rise 3.2%. (adria.calatayud@wsj.com)</p><p class=\"\">0606 ET - Publicis Groupe beat expectations once again in 4Q, but its guidance for the year ahead is in line with expectations, UBS analysts say in a research note. The French advertising group reported net revenue organic growth of 6.3% for 4Q, ahead of both consensus expectations and the company's guidance, UBS says. This is likely to be well received by the market, the analysts say. However, Publicis's outlook seems unlikely to prompt major changes to consensus estimates, according to UBS. Shares rise 2.8% to 105.10 euros, trading near record highs reached last year. (adria.calatayud@wsj.com)</p><p class=\"\">0545 ET - Vodafone is struggling to remain relevant, AJ Bell's Russ Mould writes in a note. \"While there are some reasons for encouragement, the market has tuned these out and is focused on the growing problems in its German operation,\" Mould says. The London-listed telecom company's U.K. segment showed some growth, ahead of the now-approved merger with Three. However, the group needs to demonstrate it can achieve sustainable growth to reassure investors, Mould says. Shares fall 6.3% to 65.62 pence. (najat.kantouar@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006525:0/",
            "pub_date": "2025-02-04 21:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308820:0",
            "title": "Stephens Adjusts Price Target on Vulcan Materials Company to $335 From $325, Maintains Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vulcan Materials Company  has an average rating of overweight and mean price target of $305.02, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308820:0/",
            "pub_date": "2025-02-04 21:40:45",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006432:0",
            "title": "Collegium Pharmaceutical Is Maintained at Neutral by Piper Sandler",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:33 GMT) </strong>Collegium Pharmaceutical Price Target Cut to $36.00/Share From $37.00 by Piper Sandler</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006432:0/",
            "pub_date": "2025-02-04 21:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308822:0",
            "title": "Evercore ISI Adjusts Synchrony Financial Price Target to $79 From $76, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Synchrony Financial  has an average rating of overweight and mean price target of $78.38, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308822:0/",
            "pub_date": "2025-02-04 21:33:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308817:0",
            "title": "McKesson Agrees to Acquire 80% Stake in PRISM Vision for $850 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">McKesson  said Tuesday it has agreed to acquire a controlling interest in PRISM Vision Holdings from Quad-C for $850 million</p><p class=\"\">McKesson will retain an 80% stake in the provider of ophthalmology and retina management services, while PRISM Vision physicians will hold the rest. </p><p class=\"\">Upon closing, PRISM Vision is anticipated to add about $0.20 to $0.30 to McKesson's adjusted earnings per diluted share in the first 12 months, and $0.65 to $0.75 by the end of the third year, the company said. </p><p class=\"\">The transaction will add 180 providers, 91 office locations, and seven ambulatory surgery centers to McKesson's platform.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308817:0/",
            "pub_date": "2025-02-04 21:33:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204006346:0",
            "title": "Jabil Acquires Pharmaceutics International, Inc. (Pii)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:30 GMT) </strong>*Jabil Acquires Pharmaceutics International, Inc. (Pii) &gt;JBL<br/><strong class=\"root-Tkn6WL2y\">(13:34 GMT) </strong>Press Release: Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">Jabil Acquires Pharmaceutics International, Inc. (Pii)</p><p class=\"\">The acquisition of Pii, a science-driven contract development and manufacturing organization (CDMO), complements Jabil's existing pharmaceutical solutions, enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale.</p><p class=\"\">ST. PETERSBURG, Fla.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Jabil Inc. , a global leader in engineering, manufacturing, and supply chain solutions, today announced the successful acquisition of Pharmaceutics International, Inc. (Pii), a contract development and manufacturing organization (CDMO) specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing, completed February 3, 2025.</p><p class=\"\">This press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">Pii's four state-of-the-art manufacturing facilities in Hunt Valley, Maryland, include dedicated space for aseptic filling, oral solid dose production, and handling high potency compounds and hormones. (Photo: Business Wire)</p><p class=\"\">\"As the pace of healthcare innovation accelerates, pharmaceutical companies need partners who can help them scale rapidly with a focus on quality and safety. Jabil and Pii's combined capabilities can provide end-to-end support for pharmaceutical customers, offering one safe, trusted pair of hands to simplify their entire supply chain,\" said Mike Mahaz, SVP, Global Business Units, Healthcare, at Jabil.</p><p class=\"\">Jabil is a leader in parenteral drug delivery, in support of markets like GLP-1s. This acquisition will significantly enhance Jabil's existing Pharmaceutical Solutions offering, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps. With the addition of Pii's leading scientific insights, depth of product knowledge, and capabilities across aseptic filling, lyophilization, and oral solid dose manufacturing, Jabil can meet the clinical and commercial drug manufacturing demands of healthcare customers.</p><p class=\"\">\"Jabil is very pleased to announce this acquisition. With our shared commitment to creating the best solutions possible for patients around the world, we believe the addition of Pii's capabilities, supported by over 300 team members, is a perfect fit for Jabil and our customers,\" said James O'Gorman, Vice President, Pharmaceutical Solutions, at Jabil. \"The convergence of Jabil's and Pii's complementary capabilities will bolster Jabil's customer offering and support business growth potential as we enter the CDMO market.\"</p><p class=\"\">Founded in 1994, Pii's footprint has grown to over 360,000 square feet across four sites on a single campus in Hunt Valley, Maryland. Pii's state-of-the-art Good Manufacturing Practice (GMP) facilities contain over 70 manufacturing rooms, including containment suites for handling high potency compounds and hormones, dedicated manufacturing suites for oral products (e.g., soft gels), an aseptic facility for injectables (e.g., vials, syringes, and cartridges), a formulation development center, and analytical and microbiology laboratories. This expertise will add a comprehensive portfolio of pharmaceutical development and manufacturing services to Jabil's current healthcare solutions.</p><p class=\"\">By joining Jabil, Pii gains access to an expanded global infrastructure, cutting-edge automation, and enhanced supply chain efficiencies, enabling even greater responsiveness and innovation for their pharmaceutical partners.</p><p class=\"\">\"This acquisition marks an exciting new chapter for Pii. We look forward to leveraging Jabil's extensive expertise to accelerate our mission of delivering best-in-class drug development and manufacturing solutions to our customers and ultimately the patients we serve,\" said John Fowler, President and CEO at Pii.</p><p class=\"\">\"On behalf of our board and fellow shareholders at Athyrium Capital Management, Hildred Capital and Pharmascience Inc., I want to thank our management and staff for their splendid work in building the Company over the past several years,\" said James Gale, Chairman of Pii and managing director of Signet Healthcare Partners. \"Jabil is the perfect owner to continue the momentum of the business. With their resources and capabilities, we believe our customers and employees will be well served going forward.\"</p><p class=\"\">For more information, please visit https://www.pharm-int.com/.</p><p class=\"\">About Jabil:</p><p class=\"\">At Jabil , we are proud to be a trusted partner for the world's top brands, offering comprehensive engineering, manufacturing, and supply chain solutions. With over 50 years of experience across industries and a vast network of over 100 sites worldwide, Jabil combines global reach with local expertise to deliver both scalable and customized solutions. Our commitment extends beyond business success as we strive to build sustainable processes that minimize environmental impact and foster vibrant and diverse communities around the globe. Discover more at www.jabil.com.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204436085/en/</p><p class=\"\">CONTACT:    Investor Contact</p><p class=\"\">Adam Berry</p><p class=\"\">Senior Vice President, Investor Relations and Communications</p><p class=\"\">adam_berry@jabil.com</p><p class=\"\">Media Contact</p><p class=\"\">Timur Aydin</p><p class=\"\">Senior Director, Enterprise Marketing and Communications</p><p class=\"\">publicrelations@jabil.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204006346:0/",
            "pub_date": "2025-02-04 21:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}