{
    "data": [
        {
            "id": "urn:summary_document_transcript:quartr.com:2938378:0",
            "title": "USPH: Record revenue, margin gains, and new hospital alliances set the stage for accelerated 2026 growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Adjusted EBITDA and net revenue grew over 16% year-over-year, with record patient visit volumes and strong margin improvement despite Medicare headwinds. Two exclusive hospital alliances and multiple acquisitions are set to drive further growth and margin expansion in 2026.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938378:0-usph-record-revenue-margin-gains-and-new-hospital-alliances-set-the-stage-for-accelerated-2026-growth/",
            "pub_date": "2026-02-27 01:14:31",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938379:0",
            "title": "FWONA: F1 and MotoGP drove double-digit revenue and EBITDA growth, with record fan engagement and new deals",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Delivered strong revenue and EBITDA growth in 2025, driven by F1 and MotoGP expansion, record attendance, and new partnerships. Focus remains on operational excellence, deleveraging, and leveraging digital and sponsorship opportunities for future growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938379:0-fwona-f1-and-motogp-drove-double-digit-revenue-and-ebitda-growth-with-record-fan-engagement-and-new-deals/",
            "pub_date": "2026-02-27 01:14:31",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938380:0",
            "title": "VICI: AFFO rose 6.6% in 2025, with robust guidance and continued portfolio diversification",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>AFFO grew 6.6% year-over-year in 2025, driven by disciplined capital allocation and new partnerships, with 2026 AFFO guidance set at $2.59–$2.625 billion. Portfolio diversification advanced through major transactions, while risk management and liquidity remain strong.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938380:0-vici-affo-rose-6-6-in-2025-with-robust-guidance-and-continued-portfolio-diversification/",
            "pub_date": "2026-02-27 01:14:33",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938385:0",
            "title": "PAHC: Zoetis MFA integration and innovation drive strong growth, margin expansion, and strategic continuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong quarterly growth was driven by the Zoetis MFA integration, robust vaccine and nutritional specialty performance, and positive market dynamics. The business expects continued margin expansion, steady strategic direction, and a seamless leadership transition, with a focus on innovation and operational efficiency.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938385:0-pahc-zoetis-mfa-integration-and-innovation-drive-strong-growth-margin-expansion-and-strategic-continuity/",
            "pub_date": "2026-02-27 01:14:54",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012373:0",
            "title": "TP: 2025 Annual Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Following a succession process led by Chairman Moulay Hafid Elalamy,   founder and CEO Daniel Julien and Deputy CEO Thomas Mackenbrock, the   Board has appointed Jorge Amar, an AI transformation expert, as Chief   Executive Officer   </span></li><li class=\"listItem-bmN0_SHH\"><span>As part of this transition, Daniel Julien and Thomas Mackenbrock have   decided to step down from their executive roles   </span></li><li class=\"listItem-bmN0_SHH\"><span>All 2025 objectives met in a challenging environment   </span></li><li class=\"listItem-bmN0_SHH\"><span>Solid revenue growth in Core Services: +2.7% like-for-like in 2025   </span></li><li class=\"listItem-bmN0_SHH\"><span>Key milestones achieved in transformation and first year of   implementation of the 'Future Forward' strategic plan </span></li></ul><p class=\"\"><span>PARIS--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>Regulatory News:</span></p><p class=\"\"><span>TP </span><span>:</span></p><p class=\"\"><span>A renewed governance to supercharge the strategic plan execution</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Jorge Amar, a renowned global expert in at-scale AI-native customer   operations, appointed Group CEO   </span></li><li class=\"listItem-bmN0_SHH\"><span>Daniel Julien, Thomas Mackenbrock and Deputy CEO in charge of finance   Olivier Rigaudy to step down from their executive mandates effective   March 15, 2026. Daniel Julien will also step down from the Board of   Directors that same day.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Cooptation of 4 new members to the Board of Directors, including two   newly appointed independent directors alongside Jorge Amar and Thomas   Mackenbrock </span></li></ul><p class=\"\"><span>2025 Group revenue: EUR10,209 million, up +1.3% like-for-like(1) excluding the hyperinflation effect(2) (reported -0.7%)</span></p><p class=\"\"><span>Core Services: 2025 revenue growth of +2.7% LFL (reported -0.8%)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Solid momentum mainly driven by the Data Services for AI, Sales,   Customer Care and Back-office solutions business lines   </span></li><li class=\"listItem-bmN0_SHH\"><span>Americas back to growth with improved momentum in H2 2025; +1.4% LFL   growth in 2025 </span></li></ul><p class=\"\"><span>Specialized Services revenue growth impacted by the volatile business environment in the USA</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>2025 revenue down -9.3% LFL (up +0.6% LFL excluding the impact of the   non-renewal of a significant visa application management contract)   </span></li><li class=\"listItem-bmN0_SHH\"><span>Strong resilience of LanguageLine Solutions: sustained profitability   vs. 2024 thanks to efficiency measures </span></li></ul><p class=\"\"><span>2025 Group recurring EBITA of EUR1,485 million, with a margin of 14.8% excluding currency effect (14.6% reported)</span></p><p class=\"\"><span>Net free cash flow excl. non-recurring cash-outs: EUR901 million, with record-high generation in H2 (EUR642 million)</span></p><p class=\"\"><span>'Future Forward' strategic plan in full swing:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>More than 150+ go-to-market and 90+ efficiency initiatives established     </span></li><li class=\"listItem-bmN0_SHH\"><span>Internal AI / Efficiency program started with targeted run rate savings   of EUR100+ million   </span></li><li class=\"listItem-bmN0_SHH\"><span>TP.ai FAB progressed, over 500 AI projects in 2025   </span></li><li class=\"listItem-bmN0_SHH\"><span>Launch of a strategic portfolio review </span></li></ul><p class=\"\"><span>2026 annual outlook:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Group LFL revenue growth between +0.0% and +2.0% with an expected soft   Q1, below the annual guidance   </span></li><li class=\"listItem-bmN0_SHH\"><span>Stable recurring EBITA margin of around 14.6%3   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net free cash flow generation between EUR800 and EUR850 million4,   excluding non-recurring cash-outs   </span></li><li class=\"listItem-bmN0_SHH\"><span>Proposal to increase the dividend from EUR4.20 to EUR4.50 per share,   subject to shareholders' approval </span></li></ul><p class=\"\"><span>GOVERNANCE</span></p><p class=\"\"><span>With 2026 being the first full year of implementation of the Future Forward strategic plan, the decision has been made to optimize the group's governance and shape it for growth and acceleration.</span></p><p class=\"\"><span>Executive Committee</span></p><p class=\"\"><span>The Succession Committee(5) , composed of Chairman Moulay Hafid Elalamy, Chief Executive Officer Daniel Julien and Deputy Chief Executive Officer Thomas Mackenbrock, has decided to propose to the Board the appointment of Jorge Amar as Chief Executive Officer.</span></p><p class=\"\"><span>Jorge Amar, a renowned global expert in at-scale AI-native customer operations, has therefore been appointed Group CEO by the board of Directors, effective March 16, 2026. Previously, he served as Senior Partner and Global Lead of McKinsey's Digital Customer Care Practice, where for over a decade his mandate was to design and execute AI-native customer operations for the world's largest companies — many of them TP's own clients. He is the author of the landmark March 2025 McKinsey publication on the human-AI balance in contact centers. He has been working closely with TP's leadership team for the past nine months, advising on transformation and strategic implementation. He holds a bachelor's degree in Accounting from the University of Buenos Aires and an MBA from Harvard Business School.</span></p><p class=\"\"><span>As part of the succession process, Daniel Julien and Thomas Mackenbrock have decided to step down from their executive roles as of March 15, 2026, convinced that, at this stage in the group's life, a fresh perspective will optimize its transformation and further strengthen its market leadership. They shall counsel Jorge Amar in his new position until the end of the year. The Succession Committee has therefore fulfilled its mandate and has been formally dissolved.</span></p><p class=\"\"><span>Olivier Rigaudy, deputy CEO in charge of finance, has decided to retire, stepping down from his executive position as of March 15, 2026, and shall counsel the new CEO until December 31(st) , 2026. Benoît Gabelle, currently Deputy CFO, will be appointed interim Chief Financial Officer.</span></p><p class=\"\"><span>Board of Directors</span></p><p class=\"\"><span>The Board of Directors, at its meeting held on February 26, 2026, has also decided to significantly renew its composition with the proposed cooptations of four new members:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Jorge Amar, effective as of March 16, 2026   </span></li><li class=\"listItem-bmN0_SHH\"><span>Thomas Mackenbrock   </span></li><li class=\"listItem-bmN0_SHH\"><span>Sheikha Hanadi bint Nasser Al Thani: a Qatari entrepreneur, investor,   and business leader whose career embodies three enduring hallmarks:   institution-building, large-scale social transformation, and the   development of globally competitive talent.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Ingrid Johnson: an accomplished international executive with over three   decades of leadership experience across banking, insurance, and financial   services in Sub Saharan Africa, UK, North America and Asia. Her   leadership of transformational change and organizational renewal - as   described in a Harvard Business School case study - brings direct and   credible expertise to TP. </span></li></ul><p class=\"\"><span>They are coopted to replace Daniel Julien, Alain Boulet, Christobel Selecky and Angela Maria Sierra-Moreno. Those cooptations and their renewals are subject to shareholders' approval at the Annual Meeting to be held on May 21, 2026. Moreover, the Board of Directors will also propose at this Annual Meeting to appoint a new member to replace Varun Bery, whose term is coming to an end.</span></p><p class=\"\"><span>Moulay Hafid Elalamy, Chairman of the Board of Directors declares: \"Daniel Julien and Thomas Mackenbrock have worked with strong determination to prepare for the Group's transformation through the rollout of the Future Forward strategic plan. Together, we concluded that the time had come to initiate the long-considered and well-prepared evolution in the Group's governance. During this process, we have identified an internationally recognized expert in customer experience, who we have seen in action in his support to the Group. He now assumes the role of Chief Executive Officer of a Group he knows from the inside--one that has demonstrated resilience and delivered solid 2025 results and is fully positioned to successfully execute its transformation.</span></p><p class=\"\"><span>I would like to warmly thank Daniel Julien for his exceptional contribution at the helm of TP, which he built into a global leading player in digital business services. He has been an unwavering source of support in recent months, preparing the Group for the path ahead and ensuring the smoothest and most effective succession possible. I also would like to extend my gratitude to Olivier Rigaudy for his decisive contribution to the Group over the last 16 years. Finally, I am delighted to continue working with Thomas Mackenbrock who has successfully completed the integration of Majorel and launched the 'Future Forward' plan. His deep knowledge of the Group and the industry will be of great value to Jorge and the Board of Directors.\"</span></p><p class=\"\"><span>Daniel Julien, CEO of TP Group, said: \"Founding and leading TP for so many years has been an amazing journey. I have always sought to make decisions in the best interests of the Group, its clients, its employees, and its shareholders. Over recent months, I have devoted all my energy with Chairman Moulay Hafid Elalamy and Thomas Mackenbrock to ensuring that the Group is not only able to navigate change, but to emerge stronger as the agentic revolution unfolds, offering exceptional opportunities for those able to make the right decisions and execute them with strength, discipline, and speed. In light of these necessary changes, we concluded that Jorge was the right person and I am pleased to entrust him with the leadership of a solid Group, which again in 2025 demonstrated the resilience of its business model in a challenging environment, while delivering its transformation agenda. I am fully aware of the extraordinary privilege I have had in leading this Group, and at this moment I feel deep gratitude toward all those I have encountered along the way, starting with our clients. I will leave the Group with great confidence in its strengths and its prospects. As founder, I have been--and will remain--a long-term shareholder, and I intend to further support TP as we enter this new chapter.\" Jorge Amar, designated CEO of TP Group, commented: \"I am very pleased to be joining TP, a group I have come to know in depth over the last year. I would like to thank Chairman Moulay Hafid Elalamy and founder Daniel Julien for their trust. I am fully aware of the responsibility I am assuming. Since the unveiling of Future Forward, important decisions have been made, and significant progress has been achieved. We now need to accelerate rolling out our existing offerings, enriching our solution portfolio, and enabling our clients to capture the efficiency and productivity gains that technology now makes possible. I am eager to get to work and to deliver on the 2028 objectives we have set for ourselves.\"</span></p><p class=\"\"><span>Thomas Mackenbrock, incoming Board Member, said: \"Working alongside Chairman Moulay Hafid, Daniel and the exceptional team at TP has been a remarkable experience. We have achieved significant milestones, including the integration of Majorel, the acquisition of ZP and the launch of the 'Future Forward' strategic plan and TP.ai FAB. As I am transitioning to the Board of Directors, I do so with confidence in the direction Jorge will take this Group. He brings precisely the expertise this moment requires, and I look forward to supporting him and the Group as a Board member and, personally, as a committed future shareholder in this next chapter.\"</span></p><p class=\"\"><span>FINANCIAL HIGHLIGHTS</span></p><p class=\"\"><span>The Board of Directors of TP, a global leader in digital business services, met today and reviewed the consolidated financial statements for the year ended December 31, 2025.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span> EUR millions                                              2025           2024 </span><br/><span>                                                   EUR1=US$1.13   EUR1=US$1.08 </span><br/><span>------------------------------------------------  -------------  ------------- </span><br/><span> Revenue                                                 10,209         10,280 </span><br/><span>       Reported growth                                    -0.7% </span><br/><span>       Like-for-like growth (1)                        +1.3%(2) </span><br/><span> EBITDA before non-recurring items                        2,006          2,096 </span><br/><span> % of revenue                                             19.7%          20.4% </span><br/><span> EBITA before non-recurring items                         1,485          1,537 </span><br/><span> % of revenue                                             14.6%          15.0% </span><br/><span> EBIT                                                     1,055          1,082 </span><br/><span> Adjusted net profit -- Group share(3)                      781            807 </span><br/><span> Diluted adjusted earnings per share (EUR)                13.20          13.44 </span><br/><span> Net profit -- Group share                                  497            523 </span><br/><span> Diluted earnings per share (EUR)                          8.40           8.71 </span><br/><span> Dividend per share (EUR)                                  4.50           4.20 </span><br/><span> Net free cash flow excluding non-recurring </span><br/><span>  cash-outs                                                 901          1,084 </span><br/><span>------------------------------------------------  -------------  ------------- </span><br/><span> </span></pre><p class=\"\"><span>(1) At constant scope and exchange rates</span></p><p class=\"\"><span>(2) Excluding the effect from hyperinflation of -0.3% in 2025</span></p><p class=\"\"><span>(3) As defined in the Appendix (see Alternative Performance Measures)</span></p><p class=\"\"><span>Revenue by activity</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>                   2025     2024                    Change (%) </span><br/><span>--------------  -------  -------  --------------------------------------------- </span><br/><span>                                                                  LFL(1) excl. </span><br/><span> EUR millions                      Reported   Like-for-like(1)   hyperinflation </span><br/><span>--------------  -------  -------  ---------  -----------------  --------------- </span><br/><span> CORE SERVICES    8,724    8,791      -0.8%              +2.7% </span><br/><span> Americas         4,026    4,190      -3.9%              +1.4% </span><br/><span> Europe, MEA &amp; </span><br/><span>  Asia-Pacific    4,698    4,601      +2.1%              +3.8% </span><br/><span> SPECIALIZED </span><br/><span>  SERVICES        1,485    1,489      -0.2%              -9.3% </span><br/><span>--------------  -------  -------  ---------  -----------------  --------------- </span><br/><span> TOTAL           10,209   10,280      -0.7%              +1.0%            +1.3% </span><br/><span>--------------  -------  -------  ---------  -----------------  --------------- </span><br/><span> </span><br/><span> </span><br/><span>                    Q4 </span><br/><span>                  2025  Q4 2024                   Change (%) </span><br/><span>--------------  ------  -------  --------------------------------------------- </span><br/><span>                                                                 LFL(1) excl. </span><br/><span> EUR millions                     Reported   Like-for-like(1)   hyperinflation </span><br/><span>--------------  ------  -------  ---------  -----------------  --------------- </span><br/><span> CORE SERVICES   2,232    2,311      -3.4%              +1.0% </span><br/><span> Americas        1,034    1,091      -5.2%              +1.4% </span><br/><span> Europe, MEA &amp; </span><br/><span>  Asia-Pacific   1,198    1,220      -1.8%              +0.7% </span><br/><span> SPECIALIZED </span><br/><span>  SERVICES         355      373      -5.0%             -10.9% </span><br/><span>--------------  ------  -------  ---------  -----------------  --------------- </span><br/><span> TOTAL           2,587    2,684      -3.6%              -0.6%             0.0% </span><br/><span>--------------  ------  -------  ---------  -----------------  --------------- </span><br/><span> </span></pre><p class=\"\"><span>(1) At constant scope and exchange rates</span></p><p class=\"\"><span>EBITA before non-recurring items by activity</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span> EUR millions                                2025     2024 </span><br/><span>----------------------------------------  ---------  ------ </span><br/><span> CORE SERVICES                              1,048     1,091 </span><br/><span> % of revenue                               12.0%     12.4% </span><br/><span> Americas                                    498       518 </span><br/><span> % of revenue                               12.4%     12.4% </span><br/><span> Europe, MEA &amp; Asia-Pacific                  510       515 </span><br/><span> % of revenue                               10.9%     11.2% </span><br/><span> Holdings                                     40       58 </span><br/><span> SPECIALIZED SERVICES                        437       446 </span><br/><span> % of revenue                               29.4%     30.0% </span><br/><span>----------------------------------------  ---------  ------ </span><br/><span> TOTAL EBITA before non-recurring items     1,485     1,537 </span><br/><span>----------------------------------------  ---------  ------ </span><br/><span> % of revenue                              14.6%(1)   15.0% </span><br/><span>----------------------------------------  ---------  ------ </span><br/><span> </span></pre><p class=\"\"><span>(1) Of which a negative impact from currency effect of -20bps; at constant currency, EBITA margin in 2025 would have been 14.8%</span></p><p class=\"\"><span>Group revenue for 2025 was up +1.3%(6) like-for-like (excluding a -0.3% negative effect from hyperinflation), driven by the positive momentum in Core Services. Reported revenue for 2025 includes:</span></p><p class=\"\"><span>- a positive scope effect (+EUR196 million) mainly related to the consolidation of ZP 'Better Together' (ZP) since February 1(st) , 2025 and the consolidation of Agents Only since June 30, 2025;</span></p><p class=\"\"><span>- a negative currency effect (-EUR362 million) arising mainly from the strengthening of the euro since Q2 2025 against the US dollar, Indian rupee, Turkish lira, Egyptian pound and most currencies in Latin America.</span></p><p class=\"\"><span>Revenue for Q4-25 was flat on a like-for-like(2) basis (excluding a -0.6% negative effect from hyperinflation), due to lower activity in onshore solutions, increased offshoring in Core Services and the challenging environment in the US in Specialized Services. Reported revenue for Q4-25 includes:</span></p><p class=\"\"><span>- a positive scope effect (+EUR53 million) from the consolidation of ZP and Agents Only</span></p><p class=\"\"><span>- a significant negative currency effect (-EUR136 million) from the further strengthening of the euro against the US dollar, and, albeit at a slower pace, the Indian rupee, Turkish lira and most currencies in Latin America.</span></p><p class=\"\"><span>EBITDA before non-recurring items amounted to EUR2,006 million in 2025, compared with EUR2,096 million in the prior year.</span></p><p class=\"\"><span>EBITA before non-recurring items was EUR1,485 million and the EBITA margin amounted to 14.6%, compared with EUR1,537 million and a margin of 15.0% in 2024. At constant exchange rates, i.e., excluding the translation effect, the EBITA margin would have been 14.8% in 2025. The 20 bps contraction mainly reflects:</span></p><p class=\"\"><span>- the impact from the non-renewal of a significant visa application management contract at TLScontact, although partially offset by the consolidation of ZP. Together the net impact on the 2025 EBITA margin is around -10 bps.</span></p><p class=\"\"><span>- AI-related IT costs, which accounted for a -15 bps impact on the 2025 EBITA margin.</span></p><p class=\"\"><span>Core Services</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Americas </span></li></ul><p class=\"\"><span>The Americas region returned to positive revenue growth on a like-for-like basis in 2025, driven by:</span></p><p class=\"\"><span>- the sustained demand for offshore BPO solutions and subsequent accelerating revenue growth in India throughout the year;</span></p><p class=\"\"><span>- the domestic solutions in Latin America, which grew at a rapid pace, with the ramp-up of several new contracts, notably in Trust &amp; Safety and back-office solutions business lines</span></p><p class=\"\"><span>- the domestic operations in the US, though still subdued, which showed a significant improvement in the second half relative to the first half, with less negative impact from offshore migration.</span></p><p class=\"\"><span>Growth in 2025 was supported by public sector, travel, telecom, consumer goods and energy sectors. Activity was lower in the automotive and technology sectors.</span></p><p class=\"\"><span>In 2025, Core Services in the Americas delivered a stable EBITA margin before non-recurring items compared with 2024 (12.4%), despite adverse currency effects.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Europe, MEA &amp; Asia-Pacific </span></li></ul><p class=\"\"><span>Across the region, most of the business lines recorded a dynamic momentum, notably in Customer Care, Sales, Back-office solutions, Data Services for AI and Analytics.</span></p><p class=\"\"><span>Activities in the United Kingdom and Sub-Saharan Africa posted solid growth over the year, thanks to the ramp-up of new contracts, especially in the public sector and banking and financial services.</span></p><p class=\"\"><span>In the Asia-Pacific region, business remained well-oriented, especially in southeast Asia where the Group benefitted from an increase in volumes in the Customer Care and Trust &amp; Safety business lines in the media, entertainment &amp; gaming and retail and e-commerce sectors.</span></p><p class=\"\"><span>The growth of multilingual services was supported by a strong performance in the Middle East and Africa, particularly in Egypt and Turkey, where the Group is quickly developing attractive solutions.</span></p><p class=\"\"><span>Core Services in Europe, MEA &amp; Asia-Pacific delivered an EBITA margin before non-recurring items of 10.9% in 2025, compared with 11.2% in 2024, mainly reflecting the slowdown in onshore activities in the last quarter of the year and the adverse currency effect.</span></p><p class=\"\"><span>Specialized Services</span></p><p class=\"\"><span>Like-for-like growth in 2025 was mainly affected by the non-renewal of a significant visa application management contract at TLScontact. Adjusted for this impact, growth in Specialized Services would have come out at +0.6% in 2025 and -5.3% in Q4-25.</span></p><p class=\"\"><span>In 2025, revenue for LanguageLine Solutions (LLS), the largest component of Specialized Services and TP's high-value-added interpretation activities, was slightly lower than last year on a like-for-like basis, given a negative momentum in Q4. In light of a highly challenging environment in the US affecting this activity, this resilient performance reflects the strength of its business model. Efficiency measures have been successfully deployed from Q2 2025 to protect the Group's profitability and allowed for the preservation of its profitability, with a EBITA margin in 2025 slightly higher than in 2024.</span></p><p class=\"\"><span>Overall, the EBITA margin before non-recurring items of Specialized Services reached 29.4% in 2025, compared with 30.0% in 2024. The improved profitability of LanguageLine solutions was offset by the lower profitability of PSG Global Solutions, TP's recruitment process outsourcing activities, and Health Advocate, TP's healthcare navigation and support activities, which were both affected by the challenging environment in the US, as well as by the adverse currency effect. Lastly, the negative impact from the non-renewal of a significant visa application management contract was almost offset by the positive contribution from the consolidation of ZP from February 1(st) , 2025.</span></p><p class=\"\"><span>Other income statement items</span></p><p class=\"\"><span>EBIT reached EUR1,055 million, versus EUR1,082 million in 2024. It included in particular:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>EUR218 million in amortization of acquisition-related intangible   assets;   </span></li><li class=\"listItem-bmN0_SHH\"><span>EUR77 million in accounting expenses relating to performance share   plans;   </span></li><li class=\"listItem-bmN0_SHH\"><span>EUR97 million in impairment losses on goodwill and intangible assets,   related to PSG Global Solutions and Health Advocate;   </span></li><li class=\"listItem-bmN0_SHH\"><span>EUR16 million in synergy generation costs related to the acquisition of   Majorel. </span></li></ul><p class=\"\"><span>The financial result represented a net expense of EUR269 million, versus EUR213 million in 2024. This change is mainly explained by the impact of exchange rate gains and losses. The cost of gross debt was flat compared with 2024, reflecting both the stability of gross debt and its average cost maintained at 3.85%.</span></p><p class=\"\"><span>Income tax expense came to EUR289 million, significantly down compared with 2024 (EUR345 million). This corresponds to an effective tax rate (excluding goodwill impairments) of 33.1%, compared with 38.5% in 2024. This improvement reflects the progresses made on Majorel's integration.</span></p><p class=\"\"><span>In 2025, net profit — Group share totaled EUR497 million, while diluted earnings per share amounted to EUR8.40, versus EUR523 million and EUR8.71 in 2024.</span></p><p class=\"\"><span>The adjusted net profit amounted EUR781 million in 2025, while diluted adjusted earnings per share reached EUR13.20, versus EUR807 million and EUR13.44 last year.</span></p><p class=\"\"><span>Cash flows and financial structure</span></p><p class=\"\"><span>Net free cash flow after lease expenses, interest and tax paid amounted to EUR901 million, excluding non-recurring cash-outs of EUR31 million, compared with EUR1,084 million the year before. This reflects a record high FCF generation in H2 2025 to EUR642 million thanks to strong working capital management, as expected.</span></p><p class=\"\"><span>The change in consolidated working capital requirement was an inflow of EUR52 million, compared with an inflow of EUR103 million in 2024.</span></p><p class=\"\"><span>Net capital expenditure amounted to EUR246 million, or 2.4% of revenue in 2025, versus EUR214 million and 2.1% in 2024. The increase was mainly attributable to the investments in offshore locations.</span></p><p class=\"\"><span>After the payment of EUR248 million in dividends, the execution of the share buyback program for EUR114 million, the acquisitions net of cash (mainly ZP and AgentsOnly) and minority investments in AI partnerships, net debt stood at EUR3,966 million at December 31, 2025, compared with EUR3,890 million at December 31, 2024.</span></p><p class=\"\"><span>OTHER HIGHLIGHTS OF 2025</span></p><p class=\"\"><span>AI strategic partnerships and acquisitions</span></p><p class=\"\"><span>Supporting the launch of TP.ai FAB, as part of its 'Future Forward' strategy, TP has been expanding its AI capabilities through strategic acquisitions and partnerships in 2025:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>the acquisition of Agents Only, an AI-enabled crowdsourcing platform,   to strengthen Data Services for AI position; and   </span></li><li class=\"listItem-bmN0_SHH\"><span>the partnerships with leading AI pioneers, including:   </span><br/><span> -- Sanas, a real-time speech understanding company </span><br/><span> </span><br/><span> -- Parloa, a leading agentic AI platform for customer service </span><br/><span> </span><br/><span> -- Ema, a leading horizontal agentic AI start-up </span><br/><span> </span></li></ul><p class=\"\"><span>2025 sustainable performance</span></p><p class=\"\"><span>TP has been active in 2025 to deliver upon its sustainability objectives across its four pillars: People, Ethics, Planet and Social Impact.</span></p><p class=\"\"><span>The Group made considerable progress on its environmental commitments. Scope 1 and 2 greenhouse gas emissions decreased by 50% versus 2019, while scope 3 emissions related to procurement, employee commuting, and business travel fell by 10%, placing TP ahead of its 2030 Science Based Targets initiative (SBTi) trajectory. The Group also surpassed a major operational milestone, with renewable energy representing more than 50% of global electricity consumption, compared with 11% in 2019.</span></p><p class=\"\"><span>In 2025, TP received an A-- rating from CDP, recognizing the robustness of its climate strategy, the alignment of its targets with climate science, and the quality of the Group's disclosure and governance practices.</span></p><p class=\"\"><span>On the social front, the Group renewed its Great Place to Work(R) certifications in 69 countries, supported by a 77% Trust Index from employees. TP continued to invest in employee development, providing 134 training hours per employee on average, and maintained strong internal mobility with a 68% internal promotion rate for managerial positions.</span></p><p class=\"\"><span>Consequently, TP was ranked as 7(th) among the World's Best Workplaces(TM) by Great Place to Work(R) and Fortune, marking the fifth consecutive year the Group appears in the global Top 10.</span></p><p class=\"\"><span>OUTLOOK</span></p><p class=\"\"><span>Value Creation Office in full swing to implement the 'Future Forward' strategy</span></p><p class=\"\"><span>TP announced in its Q3 2025 revenue publication the formation of a Value Creation Office to fast-track the implementation of the 'Future Forward' strategy across growth, efficiency and transformation. It is supported by McKinsey &amp; Company, with whom TP entered into a transformation contract in Q3-25.</span></p><p class=\"\"><span>It is up and running with 150+ go-to-market initiatives already conducted, including verticals growth, win-room activation and seller upskilling.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Leveraging AI to enhance internal efficiency and process excellence </span></li></ul><p class=\"\"><span>As an additional part of the 'Future Forward' plan, TP has led a thorough review of its processes and structures on the back of the acceleration of AI adoption to drive operating efficiencies. To date, 90+ efficiency initiatives have been launched to drive cost savings, productivity, and operational excellence along 3 pillars:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Internal AI Transformation: deployment of AI across core operations to   increase efficiency and reduce manual work in recruiting, training,   Workforce Management, supervisors and Quality Management   </span></li><li class=\"listItem-bmN0_SHH\"><span>Cost optimization: structural reduction of SG&amp;A and other direct costs   optimization through delayering, automation and optimized procurement   practices and controls   </span></li><li class=\"listItem-bmN0_SHH\"><span>Organizational redesign: simplification of organizational structure </span></li></ul><p class=\"\"><span>These initiatives will lead to workforce adaptation and restructuring costs estimated between EUR70m and EUR90m in 2026. The annual run-rate savings are estimated to be above EUR100m. As for 2026, and depending on the actual deployment timeline, subject to local legislation and negotiations with the employee representatives, the group expects to record around half of these annual run-rate savings. Since the beginning of 2026, plans have already been announced with corresponding costs of EUR56m.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Scaling TP.ai FAB </span></li></ul><p class=\"\"><span>TP is building up with TP.ai FAB AI-powered solution suites addressing horizontal as well as vertical specific tasks to transform services for its clients across various industry verticals. TP.ai FAB aims for example to achieve greater outcomes and efficiency through the integration of agentic AI in the field of human augmentation, collections, customer experience, revenue generation, data services for AI and operations.</span></p><p class=\"\"><span>Over 500 AI projects were launched in 2025, allowing for scale across the different FAB solution suites.</span></p><p class=\"\"><span>Lastly, TP has been certified with the ISO/IEC 42001: 2023 AI Management System from BSI. ISO 42001 is the world's first international standard specifically covering AI systems, providing a structured framework that demonstrates AI governance, risk management, and responsible AI systems. The certification creates an additional competitive advantage for the Group, demonstrating its commitment to AI and the rigorous set of standards it adheres to. It complements other standards in the fields of Information Security, Privacy and Compliance, reflecting robust standards for the protection of client data and adherence to global regulations, including the EU AI Act.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Investing in growing lines of business </span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012373:0/",
            "pub_date": "2026-02-27 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5995Ua:0",
            "title": "REG - Takeover Panel - Disclosure Table",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><span>RNS Number : 5995U  Takeover Panel  26 February 2026   </span><p class=\"\"></p><p class=\"\"><span>THE TAKEOVER PANEL - DISCLOSURE TABLE</span></p><p class=\"\"></p><p class=\"\"><span>26 February 2026 - FINAL</span></p><p class=\"\"></p><p class=\"\"><span>The following are today's changes to the Disclosure Table:</span></p><p class=\"\"></p><p class=\"\"><span>ADDITIONS</span></p><p class=\"\"></p><p class=\"\"><span>None</span></p><p class=\"\"></p><p class=\"\"><span>DELETIONS</span></p><p class=\"\"></p><p class=\"\"><span>None</span></p><p class=\"\"></p><p class=\"\"><span>OTHER AMENDMENTS</span></p><p class=\"\"></p><p class=\"\"><span>None</span></p><p class=\"\"></p><p class=\"\"><span>DISCLOSURE TABLE</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: 1Spatial plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 12-Dec-2025</span></p></td></tr><tr><td><p class=\"\"><span>10p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BFZ45C84</span></p></td><td><p class=\"\"><span>NSI: 111,860,753</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: VertiGIS Ltd (a portfolio company of Battery Ventures)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 12-Dec-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Aferian plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 10:04 29-Sep-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B013SN63</span></p></td><td><p class=\"\"><span>NSI: 111,212,107</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Audioboom Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 17:09 03-Oct-2025</span></p></td></tr><tr><td><p class=\"\"><span>Ordinary NPV</span></p></td><td><p class=\"\"><span>ISIN: JE00BJYJFG60</span></p></td><td><p class=\"\"><span>NSI: 17,984,655</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Augmentum Fintech plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 25-Feb-2026</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BG12XV81</span></p></td><td><p class=\"\"><span>NSI: 167,280,902</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Frontier Bidco Limited (a newly formed company indirectly and wholly controlled by Verdane Fund Manager AB in its capacity as manager of Verdane Freya XII Investments AB)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 25-Feb-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Beazley plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 12:55 19-Jan-2026</span></p></td></tr><tr><td><p class=\"\"><span>5p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BYQ0JC66</span></p></td><td><p class=\"\"><span>NSI: 599,509,906</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Zurich Insurance Group Ltd</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 12:55 19-Jan-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: 17:00 04-Mar-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Bluefield Solar Income Fund Limited</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 05-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>0.01p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GG00BB0RDB98</span></p></td><td><p class=\"\"><span>NSI: 592,080,033</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: CAB Payments Holdings plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 02-Feb-2026</span></p></td></tr><tr><td><p class=\"\"><span>0.033 1/3p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BMCYKB41</span></p></td><td><p class=\"\"><span>NSI: 254,143,218</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: A consortium comprising Helios Investors V, L.P., Helios Investors V (Mauritius) L.P. and Helios Fairfax Partners Corporation, with the support of Helios Investors III, L.P. and Helios Investors III (A), L.P.</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 02-Feb-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: 17:00 02-Mar-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: CyanConnode Holdings plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 13:30 03-Feb-2026</span></p></td></tr><tr><td><p class=\"\"><span>2p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BF93WP34</span></p></td><td><p class=\"\"><span>NSI: 359,035,103</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Esyasoft Holding Ltd</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 13:30 03-Feb-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: 17:00 03-Mar-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Deltic Energy plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 12:07 30-Jun-2025</span></p></td></tr><tr><td><p class=\"\"><span>10p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BNTY2N01</span></p></td><td><p class=\"\"><span>NSI: 93,096,600</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Rockrose Energy Limited (a wholly-owned subsidiary of Viaro Energy Limited)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 12:07 30-Jun-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: essensys plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 28-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>0.25p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BJL1ZF49</span></p></td><td><p class=\"\"><span>NSI: 64,811,336</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: essensys Bidco Limited (a newly incorporated company)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 28-Nov-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Frenkel Topping Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 11:00 02-Jun-2025</span></p></td></tr><tr><td><p class=\"\"><span>0.5p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B01YXQ71</span></p></td><td><p class=\"\"><span>NSI: 128,013,064</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Irwell Financial Services Bidco Limited (a newly formed company indirectly owned by a limited partnership managed by Harwood Private Equity LLP)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 11:00 02-Jun-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Idox plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 28-Oct-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB0002998192</span></p></td><td><p class=\"\"><span>NSI: 461,682,046</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Frankel UK Bidco Limited (a newly-formed company indirectly owned by Long Path Co-Investment Fund Number 6, LP, Long Path Smaller Companies Fund, LP, Long Path Smaller Companies Master Fund, Ltd. and Long Path Opportunities Fund II, LP)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 28-Oct-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Inspecs Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 16:32 23-Oct-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BK6JPP03</span></p></td><td><p class=\"\"><span>NSI: 101,671,525</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Bidco 1125 Limited (a newly formed company indirectly owned by Luke Johnson and Ian Livingstone)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 16:32 23-Oct-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: International Personal Finance plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:01 30-Jul-2025</span></p></td></tr><tr><td><p class=\"\"><span>10p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B1YKG049</span></p></td><td><p class=\"\"><span>NSI: 219,846,660</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: IPF Parent Holdings Limited (a newly formed company in the same group as BasePoint Capital LLC)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:01 30-Jul-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: IQE plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 08-Sep-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB0009619924</span></p></td><td><p class=\"\"><span>NSI: 978,697,331</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: JTC plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 11:39 29-Aug-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: JE00BF4X3P53</span></p></td><td><p class=\"\"><span>NSI: 172,386,504</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Papilio Bidco Limited (a newly incorporated company indirectly wholly-owned by funds advised by Permira Advisers LLP)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 11:39 29-Aug-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Just Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 31-Jul-2025</span></p></td></tr><tr><td><p class=\"\"><span>10p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BCRX1J15</span></p></td><td><p class=\"\"><span>NSI: 1,038,702,932</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: BWS Holdings Ltd. (a wholly owned subsidiary of Brookfield Wealth Solutions Ltd.)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 31-Jul-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Kitwave Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 22-Jan-2026</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BNYKB709</span></p></td><td><p class=\"\"><span>NSI: 83,736,538</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Kite UK Bidco Limited (a newly-incorporated company indirectly wholly-owned by funds managed or advised by OEP Capital Advisors, L.P.)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 22-Jan-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Kore Potash plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:30 04-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>USD 0.001 ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BYP2QJ94</span></p></td><td><p class=\"\"><span>NSI: 5,175,938,315</span></p></td></tr><tr><td><p class=\"\"><span>CDI</span></p></td><td><p class=\"\"><span>ISIN: AU000000KP25</span></p></td><td></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Life Science REIT plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 28-Jan-2026</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BP5X4Q29</span></p></td><td><p class=\"\"><span>NSI: 350,000,000</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: British Land Company plc, The</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 28-Jan-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td><p class=\"\"><span>25p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB0001367019</span></p></td><td><p class=\"\"><span>NSI: 999,893,583</span></p></td></tr><tr><td><p class=\"\"><span>ADR</span></p></td><td><p class=\"\"><span>ISIN: US1108281007</span></p></td><td></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Management Consulting Group plc (See Note 9 below)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 16:44 14-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB0001979029</span></p></td><td><p class=\"\"><span>NSI: 1,516,528,424</span></p></td></tr><tr><td><p class=\"\"><span>0.01p preference (A)</span></p></td><td><p class=\"\"><span>ISIN: GB00BMC7BY33</span></p></td><td><p class=\"\"><span>NSI: 1,945,319,013</span></p></td></tr><tr><td><p class=\"\"><span>0.01p preference (B)</span></p></td><td><p class=\"\"><span>ISIN: GB00BN2S8316</span></p></td><td><p class=\"\"><span>NSI: 3,461,847,437</span></p></td></tr><tr><td><p class=\"\"><span>0.01p preference (C)</span></p></td><td><p class=\"\"><span>ISIN: GB00BP6WH811</span></p></td><td><p class=\"\"><span>NSI: 12,499,900,477</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Mind Gym plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 18:17 27-Jan-2026</span></p></td></tr><tr><td><p class=\"\"><span>0.001p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BF3SQB83</span></p></td><td><p class=\"\"><span>NSI: 100,338,882</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: NCC Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 18:24 16-Jul-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B01QGK86</span></p></td><td><p class=\"\"><span>NSI: 305,140,485</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Picton Property Income Limited</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 13-Jan-2026</span></p></td></tr><tr><td><p class=\"\"><span>Ordinary NPV</span></p></td><td><p class=\"\"><span>ISIN: GB00B0LCW208</span></p></td><td><p class=\"\"><span>NSI: 513,827,021</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: LondonMetric Property plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 10:05 11-Feb-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td><p class=\"\"><span>10p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B4WFW713</span></p></td><td><p class=\"\"><span>NSI: 2,344,406,347</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: PPHE Hotel Group Limited</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 14-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>Ordinary NPV</span></p></td><td><p class=\"\"><span>ISIN: GG00B1Z5FH87</span></p></td><td><p class=\"\"><span>NSI: 41,856,324</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: No named offeror</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Schroders plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 12-Feb-2026</span></p></td></tr><tr><td><p class=\"\"><span>20p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BP9LHF23</span></p></td><td><p class=\"\"><span>NSI: 1,610,711,278</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Pantheon, LLC (a newly incorporated subsidiary of Nuveen, LLC, a Teachers Insurance and Annuity Association of America company)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 12-Feb-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: SolGold plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 14:23 28-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B0WD0R35</span></p></td><td><p class=\"\"><span>NSI: 3,013,831,741</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Jiangxi Copper (Hong Kong) Investment Company Limited</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 14:23 28-Nov-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Spire Healthcare Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 19:36 18-Sep-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00BNLPYF73</span></p></td><td><p class=\"\"><span>NSI: 402,759,599</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Bridgepoint Advisers Limited</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 15:18 24-Jan-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: 17:00 21-Mar-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Triton Investment Advisers LLP</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 15:18 24-Jan-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: 17:00 21-Mar-2026</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Walker Crips Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 07:00 24-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>6 2/3p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B1YMRV88</span></p></td><td><p class=\"\"><span>NSI: 42,577,328</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: PhillipCapital UK LTD (an indirect wholly-owned subsidiary of Phillip Brokerage Pte Ltd)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 07:00 24-Nov-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: WH Ireland Group plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 21:17 12-Nov-2025</span></p></td></tr><tr><td><p class=\"\"><span>1p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB0009241885</span></p></td><td><p class=\"\"><span>NSI: 235,986,209</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Team plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 21:17 12-Nov-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td><p class=\"\"><span>Ordinary NPV</span></p></td><td><p class=\"\"><span>ISIN: JE00BM90BX45</span></p></td><td><p class=\"\"><span>NSI: 62,340,022</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"3\"><p class=\"\"><span>OFFEREE: Wood Group (John) plc</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offer period commenced: 14:31 24-Feb-2025</span></p></td></tr><tr><td><p class=\"\"><span>4 2/7 p ordinary</span></p></td><td><p class=\"\"><span>ISIN: GB00B5N0P849</span></p></td><td><p class=\"\"><span>NSI: 691,839,369</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>OFFEROR: Sidara Limited (an entity controlled by Dar Al-Handasah Consultants Shair and Partners Holdings Ltd)</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Offeror identified: 14:31 24-Feb-2025</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Rule 2.6 deadline: N/A</span></p></td></tr><tr><td colspan=\"3\"><p class=\"\"><span>Disclosure of dealings and positions in this offeror is not required</span></p></td></tr></tbody></table></div><p class=\"\"></p><p class=\"\"><span>Notes:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>1.</span></p></td><td><p class=\"\"><span>Rule 8 of the Takeover Code (the \"Code\") sets out the circumstances in which Dealing Disclosures and/or Opening Position Disclosures are required to be made by the parties to an offer, persons acting in concert with them, persons with an interest in relevant securities of 1% or more and exempt principal traders (\"EPTs\") connected with the parties to an offer.</span></p></td></tr><tr><td><p class=\"\"><span>2.</span></p></td><td><p class=\"\"><span>Where an offeror is marked \"Disclosure of dealings and positions in this offeror is not required\", dealings and positions in relevant securities of that offeror are not required to be disclosed under Rule 8. This is either because it has been announced that the offer or possible offer is, or is likely to be, solely in cash or because disclosure is not required for some other reason.</span></p></td></tr><tr><td><p class=\"\"><span>3.</span></p></td><td><p class=\"\"><span>Dealings and positions required to be disclosed under Rule 8 of the Code include dealings and positions in derivatives referenced to, and options in respect of, relevant securities of an offeree company and, where appropriate, an offeror (see Note 2 above).</span></p></td></tr><tr><td><p class=\"\"><span>4.</span></p></td><td><p class=\"\"><span>The information set out in the Disclosure Table relating to the relevant securities in issue of an offeree company or of an offeror (and any amendments thereto) has been extracted from the relevant announcement made by such company under Rule 2.9 of the Code. Similarly, details of any deadline set under Rule 2.6 by which a potential offeror must announce either a firm intention to make a bid or that it does not intend to make an offer (or, in the case of Rule 2.6(a), by which the Panel must consent to an extension of the deadline) has been extracted from the relevant announcement made by the offeree company.</span></p></td></tr><tr><td><p class=\"\"><span>5.</span></p></td><td><p class=\"\"><span>Additions and deletions of offeree companies and offerors are reflected in the Disclosure Table throughout the day, following the relevant announcement. Other amendments may also be made throughout the day. In any event, details of the classes of relevant securities issued by an offeree or offeror company, the number of such securities in issue (\"NSI\") and the International Securities Identification Number (\"ISIN\") of such securities announced under Rule 2.9 of the Code before 5.00 pm each day will be included in the final version of the Disclosure Table by 5.30 pm that day. The final version of the Disclosure Table issued each day will be marked \"Final\" and persons required to make Dealing Disclosures and Opening Position Disclosures are advised to use that final version. Any changes to the Rule 2.6 deadline of a potential offeror will also be reflected in the \"Final\" version of the Disclosure Table, although any such changes will not be shown in the \"Amendments\" section at the top of the Disclosure Table.</span></p></td></tr><tr><td><p class=\"\"><span>6.</span></p></td><td><p class=\"\"><span>Dealing Disclosures by the parties to an offer, persons acting in concert with them and connected EPTs must be made by no later than 12 noon on the business day (as defined in the Code) following the date of the relevant dealing and Dealing Disclosures by persons with an interest in relevant securities of 1% or more must be made by 3.30 pm on the business day following the date of the relevant dealing.</span></p></td></tr><tr><td><p class=\"\"><span>7.</span></p></td><td><p class=\"\"><span>Opening Position Disclosures by the parties to an offer and by connected EPTs must be made by no later than 12 noon on the 10th business day after the commencement of the offer period or the announcement that first identifies an offeror (as the case may be). Where required, Opening Position Disclosures by persons with interests in relevant securities of 1% or more must be made by no later than 3.30 pm on the 10th business day after the commencement of the offer period or the announcement that first identifies an offeror (as the case may be). Details of the time and date at which an offer period commenced and at which an offeror was first identified are set out in the Disclosure Table. In order to calculate the deadline for Opening Position Disclosures, it is therefore necessary to count forward 10 business days from the relevant date.</span></p></td></tr><tr><td><p class=\"\"><span>8.</span></p></td><td><p class=\"\"><span>Opening Position Disclosures and Dealing Disclosures required under Rule 8 of the Code must be made to a Regulatory Information Service (\"RIS\").</span></p></td></tr><tr><td><p class=\"\"><span>9.</span></p></td><td><p class=\"\"><span>This Note is applicable if it says \"See Note 9 below\" by the name of the company in the Disclosure Table above.  The Executive has granted the company a dispensation from the requirements under the Code that announcements must be published via a RIS. The company is instead required to publish all announcements on its website. The Executive has also granted a dispensation from Note 3 on Rule 8 of the Code that disclosures made under Rule 8 of the Code must be made to a RIS. Therefore, Opening Position Disclosures and Dealing Disclosures required under Rule 8 of the Code may be made to the company at the address stated in the announcement that commenced the offer period.</span></p></td></tr></tbody></table></div><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>10.</span></p></td><td><p class=\"\"><span>The following are approved Regulatory Information Services:</span></p></td><td></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>Business Wire Regulatory Disclosure provided by Business Wire</span></p></td><td><p class=\"\"><span>+44 (0)20 7626 1982</span></p></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>EQS IR COCKPIT provided by EquityStory AG</span></p></td><td><p class=\"\"><span>+49 89 21 02 98-50</span></p></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>GlobeNewswire provided by West Digital Media Solutions</span></p></td><td><p class=\"\"><span>+44 (0)20 3753 2071</span></p></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>MFN provided by Modular Finance</span></p></td><td><p class=\"\"><span>+44 (0)20 3026 4414</span></p></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>PR Newswire Disclose provided by PR Newswire</span></p></td><td><p class=\"\"><span>+44 (0)20 7454 5210</span></p></td></tr><tr><td><p class=\"\"><span>.</span></p></td><td><p class=\"\"><span>RNS provided by the London Stock Exchange</span></p></td><td><p class=\"\"><span>+44 (0)20 7797 4400</span></p></td></tr></tbody></table></div><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  TABTFMRTMTMTBRF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5995Ua:0-reg-takeover-panel-disclosure-table/",
            "pub_date": "2026-02-27 01:15:00",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012386:0",
            "title": "Flutter Entertainment Is Maintained at Outperform by Oppenheimer",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(17:15 GMT) </span></strong><span>Flutter Entertainment Price Target Cut to $210.00/Share From $280.00 by Oppenheimer</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012386:0/",
            "pub_date": "2026-02-27 01:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e76ad4720646a:0",
            "title": "THERMO FISHER SCIENTIFIC INC. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Thermo Fisher Scientific Inc., a global leader in serving science, has released its 2025 Form 10-K report, detailing significant financial and operational achievements. The report highlights the company's robust performance across various business segments, strategic initiatives aimed at sustaining growth, and the challenges and risks it faces in a competitive and rapidly evolving market.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Total Revenues</span></strong><span>: $44,556 million, reflecting a 4% increase from the previous year, driven by growth in the pharma and biotech market.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income</span></strong><span>: $7,746 million, with an operating income margin of 17.4%, benefiting from strong productivity improvements.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income</span></strong><span>: $6,721 million, an increase from the previous year, supported by lower amortization expenses and strategic investments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Diluted EPS</span></strong><span>: $17.74, representing a 7% increase, reflecting improved profitability and share repurchases.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Business Segments and Products</span></strong><span>: Thermo Fisher operates through four main business segments: Life Sciences Solutions, Analytical Instruments, Specialty Diagnostics, and Laboratory Products and Biopharma Services. Each segment offers a diverse range of products and services tailored to specific markets, including pharmaceutical, biotechnology, academic, government, and industrial sectors.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Life Sciences Solutions Segment</span></strong><span>: This segment provides reagents, instruments, and consumables for biological and medical research, drug discovery, and disease diagnosis. It includes biosciences, genetic sciences, and bioproduction businesses, with a focus on genomic and proteomic solutions and biologics production.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Analytical Instruments Segment</span></strong><span>: Offers a wide range of instruments and supporting consumables, software, and services for applications in pharmaceutical, biotechnology, academic, government, and industrial markets. Key businesses include chromatography and mass spectrometry, chemical analysis, and electron microscopy.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Specialty Diagnostics Segment</span></strong><span>: Provides diagnostic test kits, reagents, culture media, and instruments for healthcare, clinical, pharmaceutical, industrial, and food safety laboratories. It includes clinical diagnostics, immunodiagnostics, microbiology, and transplant diagnostics businesses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Laboratory Products and Biopharma Services Segment</span></strong><span>: Offers lab consumables, equipment, chemicals, and outsourced services for drug development and clinical research. It serves pharmaceutical, biotechnology, academic, government, and industrial markets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance</span></strong><span>: In 2025, sales grew in North America, Europe, and Asia-Pacific, but declined in China. The company experienced increased demand in the pharma and biotech markets, while the academic and government markets faced challenges due to macroeconomic conditions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches</span></strong><span>: The company continues to focus on high-impact innovation, introducing new products and services to enhance its competitive position and meet customer needs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Production Launches</span></strong><span>: The company has made significant investments in capacity and capability expansions, including the construction of new facilities and the enhancement of existing ones to support growth in various segments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: Thermo Fisher plans to continue its growth strategy through high-impact innovation, strengthening customer partnerships, and leveraging its commercial engine. The company anticipates ongoing investments in research and development to drive future growth and maintain its leadership position in the industry.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong><span>: Thermo Fisher continues to execute its growth strategy through high-impact innovation, maintaining trusted partner status with customers, and leveraging its commercial engine. The company made strategic acquisitions, including Olink Holding AB to enhance its proteomics capabilities and a filtration and separation business from Solventum Corporation to strengthen its bioproduction offerings. These acquisitions are aimed at expanding capabilities in high-growth markets and improving operational efficiency.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management</span></strong><span>: In 2025, Thermo Fisher issued $7.76 billion in debt and repaid $2.41 billion, reflecting a strategic approach to managing its capital structure. The company also repurchased $3.00 billion of its common stock and paid $0.64 billion in dividends. The Board authorized a $5.00 billion share repurchase program, with $2.00 billion remaining available for future repurchases. The company maintains a revolving credit facility of $5.00 billion, providing liquidity and financial flexibility.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook</span></strong><span>: Looking ahead, Thermo Fisher plans to continue its strategic investments in enhancing commercial capabilities, expanding geographic reach, and improving e-commerce platforms. The company expects its GAAP effective tax rate in 2026 to be between 7% and 9%, with an adjusted tax rate of approximately 11.5%. It also anticipates capital expenditures for property, plant, and equipment to be between $1.8 billion and $2.0 billion in 2026, supporting its growth and operational efficiency initiatives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Competitive and Technological Risks</span></strong><span>: Thermo Fisher operates in a highly competitive environment with rapid technological changes. The company must continuously innovate and adapt to maintain its market position. The integration of AI and machine learning into products and services is crucial, but failure to keep pace with these technologies could adversely affect the company's competitive position.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Industry and Economic Risks</span></strong><span>: The company faces significant industry and economic risks, including potential declines in the markets it serves, which could impact demand for its products and services. Inflationary pressures and economic instability in key markets like Europe and the U.S. could adversely affect operations. International sales expose the company to foreign currency fluctuations, which could impact profitability. Emerging markets present additional risks due to political and financial instability, and the company's strategy to grow in these regions may not be successful.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks</span></strong><span>: These include reliance on sole or limited suppliers, which could lead to production interruptions. Cybersecurity threats are a major concern, with the potential for significant disruptions and data breaches. The company also faces challenges in attracting and retaining qualified talent, which is critical for maintaining its competitive edge.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks</span></strong><span>: The company is subject to various laws and regulations, including those related to environmental protection, data privacy, and government contracts. Changes in these regulations could increase compliance costs and impact operations. The company is also exposed to risks related to product liability and intellectual property, which could result in significant legal expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Strategies</span></strong><span>: Management highlights the impact of strategic investments and productivity improvements on operating margins. The company is focused on enhancing commercial capabilities and expanding its geographic reach to mitigate market risks. Recent acquisitions, such as Olink Holding AB and a filtration and separation business, are expected to strengthen the company's offerings and provide synergy opportunities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks</span></strong><span>: Thermo Fisher is exposed to market risks related to foreign currency exchange rates, interest rates, and commodity prices. The company uses financial instruments to hedge against these risks, but fluctuations could still impact financial results. The company's significant international operations mean that changes in foreign exchange rates can affect reported revenues and profitability.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/97745/000009774526000018/tmo-20251231.htm\" rel=\"nofollow\" target=\"_blank\">THERMO FISHER SCIENTIFIC INC. [ TMO ] - 10-K - Feb. 26, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:e76ad4720646a:0-thermo-fisher-scientific-inc-sec-10-k-report/",
            "pub_date": "2026-02-27 01:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:1933fe4e032db:0",
            "title": "POOL CORP SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>POOL CORP, the world's largest wholesale distributor of swimming pool supplies, equipment, and related leisure products, has released its 2025 10-K report. The report provides a comprehensive overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the current market environment.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><span>POOL CORP reported net sales of $5,289.4 million for 2025, maintaining consistency with the previous year. The company's gross profit stood at $1,572.5 million, with a gross margin of 29.7%, unchanged from 2024. Operating income was $580.2 million, reflecting a 6% decrease from the prior year, primarily due to increased operating expenses driven by technology investments and inflationary pressures. Net income for 2025 was $406.4 million, down from $434.3 million in 2024, influenced by the absence of a prior year import tax reversal benefit. The diluted earnings per share (EPS) was $10.85, a 4% decline from $11.30 in 2024, impacted by a lower tax benefit from share-based payment accounting.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><span>POOL CORP continues to hold a dominant position in the industry as the world's largest wholesale distributor of swimming pool supplies, equipment, and related leisure products. The company operates 456 sales centers across North America, Europe, and Australia, distributing products through five main networks: SCP Distributors, Superior Pool Products, Horizon Distributors, National Pool Trends, and Sun Wholesale Supply. Serving approximately 125,000 customers, primarily small, entrepreneurial, family-owned businesses, the company offers over 200,000 products, including pool maintenance products, repair and replacement parts, building materials, pool equipment, irrigation products, and commercial pool products.</span></p><p class=\"\"><span>In 2025, approximately 95% of sales were generated in North America, with California, Florida, Texas, and Arizona accounting for about 53% of net sales. The company also operates in Europe and Australia, contributing 4% and less than 1% of sales, respectively. Sales segmentation for 2025 showed that 64% of sales were from recurring maintenance and minor repair, 22% from pool remodeling and upgrades, and 14% from new pool construction.</span></p><p class=\"\"><span>Looking ahead, POOL CORP plans to open 5 to 8 new sales centers in 2026 and make selective acquisitions. The company expects sales to increase slightly, with a focus on leveraging existing infrastructure and managing discretionary spending. The business remains highly seasonal, with peak sales and operating income occurring in the second and third quarters, and weather conditions significantly impacting sales.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><span>POOL CORP is focused on expanding its geographic presence by opening new sales centers and making selective acquisitions when appropriate opportunities arise. The company is also investing in technology and automation to enhance operational efficiency and customer service. In 2025, POOL CORP repurchased $346.3 million of its own shares and paid $184.9 million in cash dividends. The company utilized its credit facilities to manage liquidity and fund operations, maintaining a target leverage ratio between 1.5 and 2.0. Capital expenditures were approximately 1.1% of net sales, consistent with previous years.</span></p><p class=\"\"><span>For 2026, POOL CORP projects earnings per diluted share to be in the range of $10.85 to $11.15. The company plans to continue using cash for dividend payments and opportunistic share repurchases, maintaining capital expenditure at approximately 1% to 1.5% of net sales. The company aims to fund these through cash from operations and borrowings, leveraging its digital transformation initiatives and existing investments to drive growth and efficiency.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><span>POOL CORP operates in a highly competitive and fragmented industry, facing intense competition from national, regional, and local distributors, as well as mass market retailers and internet-based merchants. The low barriers to entry in the industry could lead to new competitors emerging, particularly in key markets like California, Florida, Texas, and Arizona, which represent a significant portion of the company's sales.</span></p><p class=\"\"><span>The company is exposed to several macroeconomic risks, including unfavorable economic conditions that could reduce consumer discretionary spending, impacting sales of swimming pool, irrigation, and outdoor living products. High interest rates and inflation have already led to decreased new pool construction and remodeling activities. Additionally, the company faces operational risks from adverse weather conditions, which can significantly impact sales during peak seasons.</span></p><p class=\"\"><span>Supply chain disruptions pose a risk, particularly if key suppliers decide to bypass distribution channels or face operational difficulties. The reliance on a few large suppliers for a significant portion of product costs poses a risk if these suppliers change their terms or face financial instability. Technological risks include the potential for cybersecurity attacks and the challenges of integrating artificial intelligence responsibly into business operations. The evolving legal and regulatory landscape around AI and data privacy could impose additional compliance costs and risks.</span></p><p class=\"\"><span>Regulatory risks include potential changes in environmental, health, and safety regulations, which could increase operational costs. The company also faces risks from international operations, including currency fluctuations and compliance with foreign laws. Management plans to leverage existing infrastructure and manage discretionary spending strategically, while continuing to invest in digital transformation to enhance customer experience and operational efficiency. The company expects to face continued inflationary pressures and plans to pass these costs through to customers where possible, leveraging technological solutions to enhance capacity and efficiency.</span></p><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/945841/000119312526074833/pool-20251231.htm\" rel=\"nofollow\" target=\"_blank\">POOL CORP [ POOL ] - 10-K - Feb. 26, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:1933fe4e032db:0-pool-corp-sec-10-k-report/",
            "pub_date": "2026-02-27 01:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:a693f1d29982b:0",
            "title": "Genpact LTD SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Genpact LTD, a global professional services firm focused on delivering digital transformation through advanced technology solutions, has released its annual Form 10-K report. The report provides a detailed overview of the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the rapidly evolving market landscape.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><span>While the specific financial metrics such as Revenue, Gross Profit, Operating Income, Net Income, and Net Income Per Share are not provided in the summary, the full Form 10-K report typically includes these details in Part 2 Item 8 and Part 2 Item 7. These sections contain the detailed financial statements and management's discussion and analysis, which are essential for summarizing the company's financial performance.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments:</span></strong><span> Genpact's Advanced Technology Solutions generated $1.2 billion in 2025, accounting for 23.7% of total net revenues. Core Business Services contributed $3.9 billion, representing 76.3% of total net revenues.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Industry Segments:</span></strong><span> The Financial Services segment generated $1.4 billion, representing 26.7% of 2025 net revenues. The Consumer and Healthcare segment contributed $1.7 billion, or 34.0% of net revenues. The High Tech and Manufacturing segment accounted for $2.0 billion, or 39.3% of net revenues.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Advanced Technology Solutions:</span></strong><span> This segment includes Data and AI, Digital Technology, Advisory Services, and Agentic Solutions, focusing on embedding AI to transform business processes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Core Business Services:</span></strong><span> Encompasses Decision Support Services, Technology Services, and Digital Operations, focusing on enhancing client operations through technology and process expertise.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> Genpact operates in over 35 countries, leveraging a global network of more than 100 delivery centers to manage complex processes worldwide.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Product Launches:</span></strong><span> Genpact is embedding AI as a driver of enterprise-wide value, building agentic solutions that act and learn alongside humans to unlock transformational outcomes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Workforce Development:</span></strong><span> Genpact has over 146,500 employees and is focusing on scaling AI talent, with more than 7,000 AI builders and nearly 20,000 AI practitioners as of 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> Genpact aims to continue its pivot towards Agentic and Advanced Technology Solutions, enhancing its capabilities in AI and digital transformation to drive client value.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><span>Genpact has undertaken strategic initiatives to enhance its financial flexibility and support growth. This includes a focus on optimizing its capital structure by refinancing existing debt to take advantage of favorable interest rates, and investing in technology and infrastructure to support long-term growth. Additionally, the company is exploring strategic partnerships and acquisitions to expand its market presence and product offerings.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The company has been actively managing its capital through a combination of debt refinancing and equity management strategies. It has repurchased $100 million of its own shares as part of an ongoing buyback program, reflecting confidence in its financial position and commitment to returning value to shareholders. The company also declared a quarterly dividend, maintaining a consistent dividend policy to provide steady returns to investors.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> Looking ahead, the company plans to continue its focus on strategic investments in technology and infrastructure to drive innovation and efficiency. It aims to further optimize its capital structure by reducing leverage and enhancing liquidity. The company is also committed to maintaining a balanced approach to capital allocation, prioritizing investments that support sustainable growth while continuing to return capital to shareholders through dividends and share repurchases.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><span>Genpact faces significant challenges related to the rapid evolution and competitive nature of AI and advanced technologies. The development and use of AI present competitive, reputational, and legal risks, and there is no assurance of realizing anticipated benefits from investments in these technologies. The market for AI is highly competitive, with traditional competitors, new market entrants, and even clients developing their own AI capabilities. This could lead to reduced demand for services and impact financial performance.</span></p><p class=\"\"><span>The legal and regulatory landscape for AI is rapidly evolving, with significant variations by jurisdiction. Compliance with new laws, such as the EU AI Act, may impose significant operational costs and limit the ability to develop or deploy AI technologies. The SEC's focus on AI-related disclosures adds another layer of regulatory scrutiny.</span></p><p class=\"\"><span>Operational risks include the need to attract and retain skilled employees, particularly in advanced technologies. High attrition rates and competition for talent, especially in India and the United States, pose challenges. The company also faces cybersecurity risks, with increasing sophistication of cyberattacks, including those enhanced by AI capabilities.</span></p><p class=\"\"><span>Management highlights the importance of developing and executing business strategies to achieve growth and profitability. The complexity of the business and the need for significant investments in technology and workforce transformation are emphasized. Failure to adapt to changes in technology and client demand could negatively impact competitiveness and financial results.</span></p><p class=\"\"><span>The company is exposed to foreign currency exchange rate fluctuations, particularly between the Indian rupee, euro, and U.S. dollar. These fluctuations could adversely affect financial results, despite hedging strategies. Additionally, geopolitical tensions and economic conditions in key markets like North America and Europe could impact demand for services and overall financial performance.</span></p><p class=\"\"><span>Overall, the company must navigate a complex landscape of technological, regulatory, and market challenges to maintain its competitive position and achieve its strategic objectives.</span></p><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1398659/000139865926000004/g-20251231.htm\" rel=\"nofollow\" target=\"_blank\">Genpact LTD [ G ] - 10-K - Feb. 26, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:a693f1d29982b:0-genpact-ltd-sec-10-k-report/",
            "pub_date": "2026-02-27 01:15:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EduCrzcka:0",
            "title": "REG - Euronext Dublin - GEM Market Cancellation Notice (EURONEXT DUBLIN) [89225]",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>This announcement has been issued through the Companies Announcement ServiceofEuronext Dublin.</span></p><p class=\"\"><span>To view the announcement in full, please click on the associated attachment</span></p><p class=\"\"><span>https://newsserviceweb.oslobors.no/message/89225</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EduCrzcka:0-reg-euronext-dublin-gem-market-cancellation-notice-euronext-dublin-89225/",
            "pub_date": "2026-02-27 01:16:03",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ6012Ua:0",
            "title": "REG - Hunters Moon Cap Permanent TSB Group - Form 8.3 - Permanent TSB Group Holdings PLC",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 6012U  Hunters Moon Capital LLP  26 February 2026   </span><p class=\"\"><span>Ap27</span></p><p class=\"\"><span>FORM 8.3</span></p><p class=\"\"><span>IRISH TAKEOVER PANEL</span></p><p class=\"\"><span>OPENING POSITION DISCLOSURE/DEALING DISCLOSURE UNDER RULE 8.3 OF THE IRISH TAKEOVER PANEL ACT, 1997, TAKEOVER</span></p><p class=\"\"><span>RULES, 2022 BY PERSONS WITH INTERESTS IN RELEVANT SECURITIES REPRESENTING 1% OR MORE</span></p><p class=\"\"><span>1.             KEY INFORMATION</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>(a)   Full name of discloser</span></p></td><td><p class=\"\"><span>Hunters Moon Capital LLP</span></p></td></tr><tr><td><p class=\"\"><span>(b)   Owner or controller of interests and short positions disclosed, if different from 1(a)</span></p><p class=\"\"><span>The naming of nominee or vehicle companies is insufficient. For a trust, the trustee(s), settlor and beneficiaries must be named.</span></p></td><td></td></tr><tr><td><p class=\"\"><span>(c)   Name of offeror/offeree in relation to whose relevant securities this form relates</span></p><p class=\"\"><span>Use a separate form for each offeror/offeree</span></p></td><td><p class=\"\"><span>Permanent TSB Group Holdings PLC</span></p></td></tr><tr><td><p class=\"\"><span>(d)   If an exempt fund manager connected with an offeror/offeree, state this and specify identity of offeror/offeree (Note 1)</span></p></td><td></td></tr><tr><td><p class=\"\"><span>(e)   Date position held/dealing undertaken</span></p><p class=\"\"><span>For an opening position disclosure, state the latest practicable date prior to the disclosure</span></p></td><td><p class=\"\"><span>26 February 2026</span></p></td></tr><tr><td><p class=\"\"><span>(f)    In addition to the company in 1(c) above, is the discloser also making disclosures in respect of any other party to the offer?</span></p><p class=\"\"><span>If it is a cash offer or possible cash offer, state \"N/A\"</span></p></td><td><p class=\"\"><span>NO</span></p></td></tr></tbody></table></div><p class=\"\"><span>2.             INTERESTS AND SHORT POSITIONS</span></p><p class=\"\"><span>If there are interests and short positions to disclose in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 2 for each additional class of relevant security.</span></p><p class=\"\"><span>Ap28</span></p><p class=\"\"><span>Interests and short positions in the relevant securities of the offeror or offeree to which the disclosure relates following the dealing (if any)</span></p><p class=\"\"><span>(Note 2)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of relevant security </span></p><p class=\"\"><span> (Note 3)</span></p></td><td colspan=\"4\"><p class=\"\"><span>Euro 0.01 Ordinary Shares</span></p></td></tr><tr><td rowspan=\"2\"></td><td colspan=\"2\"><p class=\"\"><span>Interests</span></p></td><td colspan=\"2\"><p class=\"\"><span>Short positions</span></p></td></tr><tr><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td><td><p class=\"\"><span>Number</span></p></td><td><p class=\"\"><span>%</span></p></td></tr><tr><td><p class=\"\"><span>(1)   Relevant securities owned and/or controlled</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(2)   Cash-settled derivatives</span></p></td><td><p class=\"\"><span>9,507,935</span></p></td><td><p class=\"\"><span>1.7446</span></p></td><td></td><td></td></tr><tr><td><p class=\"\"><span>(3)   Stock-settled derivatives (including options) and agreements to purchase/ sell</span></p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Total</span></p></td><td><p class=\"\"><span>9,507,935</span></p></td><td><p class=\"\"><span>1.7446</span></p></td><td></td><td></td></tr></tbody></table></div><p class=\"\"><span>All interests and all short positions should be disclosed.</span></p><p class=\"\"><span>Details of options including rights to subscribe for new securities and any open stock-settled derivative positions (including traded options), or agreements to purchase or sell relevant securities, should be given on a Supplemental Form 8.</span></p><p class=\"\"><span>3.             DEALINGS (IF ANY) BY THE PERSON MAKING THE DISCLOSURE (Note 4)</span></p><p class=\"\"><span>Where there have been dealings in more than one class of relevant securities of the offeror or offeree named in 1(c), copy table 3(a), (b), (c) or (d) (as appropriate) for each additional class of relevant security dealt in.</span></p><p class=\"\"><span>The currency of all prices and other monetary amounts should be stated.</span></p><p class=\"\"><span>(a)           Purchases and sales</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of relevant</span></p><p class=\"\"><span>security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Purchase/sale</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of</span></p><p class=\"\"><span>securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit</span></p><p class=\"\"><span> (Note 5)</span></p></li></ul><p class=\"\"><span>Ap29</span></p><p class=\"\"><span>(b)           Cash-settled derivative transactions</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Class of</span></p><p class=\"\"><span> relevant</span></p><p class=\"\"><span> security</span></p></td><td><p class=\"\"><span> Eur 0.01</span></p></td></tr><tr><td><p class=\"\"><span>Product </span></p><p class=\"\"><span> description </span></p><p class=\"\"><span> e.g. CFD</span></p></td><td><p class=\"\"><span>CFD</span></p></td></tr><tr><td><p class=\"\"><span>Nature of dealing</span></p><p class=\"\"><span> e.g. opening/ closing a long/ short position, increasing/ reducing a long/ short position</span></p></td><td><p class=\"\"><span>Increasing Long Position</span></p></td></tr><tr><td><p class=\"\"><span>Number of</span></p><p class=\"\"><span> reference </span></p><p class=\"\"><span> securities </span></p><p class=\"\"><span> (Note 6)</span></p></td><td><p class=\"\"><span>165,343</span></p></td></tr><tr><td><p class=\"\"><span>Price </span></p><p class=\"\"><span> per unit </span></p><p class=\"\"><span> (Note 5)</span></p></td><td><p class=\"\"><span>3.1912</span></p></td></tr></tbody></table></div><p class=\"\"><span>(c)           Stock-settled derivative transactions (including options)</span></p><p class=\"\"><span>(i)            Writing, selling, purchasing or varying</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of </span></p><p class=\"\"><span> relevant </span></p><p class=\"\"><span> security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product </span></p><p class=\"\"><span> description e.g. call </span></p><p class=\"\"><span> option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Writing, purchasing, selling, varying </span></p><p class=\"\"><span> etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number </span></p><p class=\"\"><span> of </span></p><p class=\"\"><span> securities </span></p><p class=\"\"><span> to which </span></p><p class=\"\"><span> option </span></p><p class=\"\"><span> relates </span></p><p class=\"\"><span> (Note 6)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise</span></p><p class=\"\"><span>price per </span></p><p class=\"\"><span> unit</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Type </span></p><p class=\"\"><span> e.g. </span></p><p class=\"\"><span> American, </span></p><p class=\"\"><span> European</span></p><p class=\"\"><span>etc.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Expiry </span></p><p class=\"\"><span> date</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Option </span></p><p class=\"\"><span> money</span></p><p class=\"\"><span>paid/ </span></p><p class=\"\"><span> received per unit</span></p></li></ul><p class=\"\"><span>(ii)           Exercise</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of </span></p><p class=\"\"><span> relevant </span></p><p class=\"\"><span> security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Product </span></p><p class=\"\"><span> description </span></p><p class=\"\"><span> e.g. call </span></p><p class=\"\"><span> option</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercising/ </span></p><p class=\"\"><span> exercised </span></p><p class=\"\"><span> against</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Number of </span></p><p class=\"\"><span> securities</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Exercise </span></p><p class=\"\"><span> price per </span></p><p class=\"\"><span> unit </span></p><p class=\"\"><span> (Note 5)</span></p></li></ul><p class=\"\"><span>(d)           Other dealings (including transactions in respect of new securities) (Note 3)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Class of </span></p><p class=\"\"><span> relevant </span></p><p class=\"\"><span> security</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nature of dealing </span></p><p class=\"\"><span> e.g. subscription, </span></p><p class=\"\"><span> conversion, exercise</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Price per unit (if </span></p><p class=\"\"><span> applicable) </span></p><p class=\"\"><span> (Note 5)</span></p></li></ul><p class=\"\"><span>Ap30</span></p><p class=\"\"><span>4.             OTHER INFORMATION</span></p><p class=\"\"><span>(a)           Indemnity and other dealing arrangements</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Details of any indemnity or option arrangement, or any agreement or understanding, formal or informal, relating to relevant securities which may be an inducement to deal or refrain from dealing entered into by the person making the disclosure and any party to the offer or any person acting in concert with a party to the offer.</span></p><p class=\"\"><span>Irrevocable commitments and letters of intent should not be included. If there are no such agreements, arrangements or understandings, state \"none\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NONE</span></p></li></ul><p class=\"\"><span>(b)           Agreements, arrangements or understandings relating to options or derivatives</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Full details of any agreement, arrangement or understanding between the person disclosing and any other person relating to the voting rights of any relevant securities under any option referred to on this form or relating to the voting rights or future acquisition or disposal of any relevant securities to which any derivative referred to on this form is referenced. If none, this should be stated.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NONE</span></p></li></ul><p class=\"\"><span>(c)           Attachments</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Is a Supplemental Form 8 attached?</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NO</span></p></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Date of disclosure</span></p></td><td><p class=\"\"><span>26/02/2026</span></p></td></tr><tr><td><p class=\"\"><span>Contact name</span></p></td><td><p class=\"\"><span>David Russell</span></p></td></tr><tr><td><p class=\"\"><span>Telephone number</span></p></td><td><p class=\"\"><span>+442039577511</span></p></td></tr></tbody></table></div><p class=\"\"><span>Public disclosures under Rule 8.3 of the Rules must be made to a Regulatory Information Service.</span></p><p class=\"\"><span>Ap31</span></p><p class=\"\"><span>NOTES ON FORM 8.3</span></p><p class=\"\"><span>1.             See the definition of \"connected fund manager\" in Rule 2.2 of Part A of the Rules.</span></p><p class=\"\"><span>2.             See the definition of \"interest in a relevant security\" in Rule 2.5 of Part A of the Rules and see Rule 8.6(a) and (b) of Part B of the Rules.</span></p><p class=\"\"><span>3.             See the definition of \"relevant securities\" in Rule 2.1 of Part A of the Rules.</span></p><p class=\"\"><span>4.             See the definition of \"dealing\" in Rule 2.1 of Part A of the Rules.</span></p><p class=\"\"><span>5.             If the economic exposure to changes in the price of securities is limited, for example, by virtue of a stop loss arrangement relating to a spread bet, full details must be given.</span></p><p class=\"\"><span>6.             See Rule 2.5(d) of Part A of the Rules.</span></p><p class=\"\"><span>7.             If details included in a disclosure under Rule 8 are incorrect, they should be corrected as soon as practicable in a subsequent disclosure. Such disclosure should state clearly that it corrects details disclosed previously, identify the disclosure or disclosures being corrected, and provide sufficient detail for the reader to understand the nature of the corrections. In the case of any doubt, the Panel should be consulted.</span></p><p class=\"\"><span>For full details of disclosure requirements, see Rule 8 of the Rules. If in doubt, consult the Panel.</span></p><p class=\"\"><span>References in these notes to \"the Rules\" are to the Irish Takeover Panel Act, 1997, Takeover Rules, 2022.</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  ITPTFMRTMTBTBJF</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ6012Ua:0-reg-hunters-moon-cap-permanent-tsb-group-form-8-3-permanent-tsb-group-holdings-plc/",
            "pub_date": "2026-02-27 01:16:10",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM1JH:0",
            "title": "FCC FY EBITDA 1.42 Bln Euros",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Fomento de Construcciones y Contratas SA </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY EBITDA 1.42 BILLION EUROS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM1JH:0-fcc-fy-ebitda-1-42-bln-euros/",
            "pub_date": "2026-02-27 01:16:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5996Ua:0",
            "title": "REG - JPMorgan Japanese IT - Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5996U  JPMorgan Japanese Inv. Trust PLC  26 February 2026   </span><p class=\"\"><span>LONDON STOCK EXCHANGE ANNOUNCEMENT</span></p><p class=\"\"><span>JPMORGAN JAPANESE INVESTMENT TRUST PLC</span></p><p class=\"\"><span>(the 'Company')</span></p><p class=\"\"><span>REPURCHASE OF ORDINARY SHARES INTO TREASURY</span></p><p class=\"\"><span>Legal Entity Identifier: 549300JZW3TSSO464R15</span></p><p class=\"\"><span>The Company announces that it has today repurchased 25,000 Ordinary Shares into Treasury at 827.00 pence per share.</span></p><p class=\"\"><span>Following the transaction, the Company holds 26,276,985 shares in Treasury. The shares in issue less the total number of Treasury shares is 158,336,203. The Company will only re-issue shares held in Treasury at a premium to net asset value.</span></p><p class=\"\"><span>26th February 2026</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>Priyanka Vijay Anand</span></p><p class=\"\"><span>JPMorgan Funds Limited - Company Secretary</span></p><p class=\"\"><span>Telephone 0800 20 40 20 (or +44 1268 44 44 70 )</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  POSDQLFLQLLBBBD</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5996Ua:0-reg-jpmorgan-japanese-it-transaction-in-own-shares/",
            "pub_date": "2026-02-27 01:08:43",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938324:0",
            "title": "IBAT: Net income turned positive on non-cash gains as focus shifts to commercial execution and contracts",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q3 2026 saw modest service revenue and a net income turnaround due to non-cash warrant gains, while the company remains pre-commercial and focused on securing commercial contracts. Strategic priorities include full flow sheet solutions, technology upgrades, and maintaining strong liquidity.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938324:0-ibat-net-income-turned-positive-on-non-cash-gains-as-focus-shifts-to-commercial-execution-and-contracts/",
            "pub_date": "2026-02-27 01:08:44",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938325:0",
            "title": "KRP: Q4 2025 saw record production, higher distributions, and a robust outlook for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Strong Q4 and full-year 2025 results featured organic production growth, a major Permian acquisition, and increased distributions. Financial discipline reduced debt, while 2026 guidance signals stable production and continued M&amp;A opportunities.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938325:0-krp-q4-2025-saw-record-production-higher-distributions-and-a-robust-outlook-for-2026/",
            "pub_date": "2026-02-27 01:08:45",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938327:0",
            "title": "BALL: Operational excellence, disciplined capital allocation, and strong demand drive profitable growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Management is executing a four-pillar strategy focused on operational excellence, customer proximity, and profitable growth, with strong regional performance and early demand from major events. Financial discipline is maintained through strict capital allocation, targeted leverage, and robust forward contract coverage.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938327:0-ball-operational-excellence-disciplined-capital-allocation-and-strong-demand-drive-profitable-growth/",
            "pub_date": "2026-02-27 01:08:48",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5979Ua:0",
            "title": "REG - MonEuroSmllCosTst - Transaction in Own Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5979U  Montanaro European Smaller C.TstPLC  26 February 2026   </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Montanaro European Smaller Companies Trust PLC ('the Company')</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>LEI: 213800CWSC5B8BG3RS21</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Transaction in Own Shares</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In accordance with the Financial Conduct Authority's ('FCA') Disclosure Guidance and Transparency Rules, the Company announces that it has today purchased 115,148 of its own ordinary shares of 5p each at a price of 165.30p per share. These shares will be held in Treasury.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Following this transaction, the Company's share capital comprises:</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total issued share capital: 189,427,600</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Shares held in Treasury (with no voting rights): 59,330,012</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total voting rights: 130,097,588</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The total voting rights figure of 130,097,588 may be used by shareholders as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change to their interest in, the Company under the FCA's Disclosure Guidance and Transparency Rules.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>For further information, please contact:</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Juniper Partners Limited</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company Secretary</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>email: cosec@junipartners.com</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Telephone: 0131 378 0500</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>26 February 2026</span></p></li></ul><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  POSAKABKOBKDABB</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5979Ua:0-reg-moneurosmllcostst-transaction-in-own-shares/",
            "pub_date": "2026-02-27 01:08:53",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012159_20260226012290:0",
            "title": "Valeo Sees Oper Margin From 4.7% to 5.3% in 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012159_20260226012290:0/",
            "pub_date": "2026-02-27 01:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012159_20260226012293:0",
            "title": "Valeo Expects Free Cash Flow of More than EUR400M in 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012159_20260226012293:0/",
            "pub_date": "2026-02-27 01:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012280_20260226012292:0",
            "title": "Raiffeisen Bank: Mandate Extended by Five Years From Nov 1",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012280_20260226012292:0/",
            "pub_date": "2026-02-27 01:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_EM3KwtpCa:0",
            "title": "mBank Spółka Akcyjna - English version of mBank Group Consolidated Annual Report for the 12-month period ending 31 December 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>POLISH FINANCIAL SUPERVISION AUTHORITY</span></p><p class=\"\"><span>UNI - EN REPORT No 2 / 2026</span></p><p class=\"\"><span>Date of issue: 2026-02-26</span></p><p class=\"\"><span>Short name of the issuer</span></p><p class=\"\"><span>mBank S.A.</span></p><p class=\"\"><span>Subject</span></p><p class=\"\"><span>English version of mBank Group Consolidated Annual Report for the 12-month period ending 31</span></p><p class=\"\"><span>December 2025</span></p><p class=\"\"><span>Official market - legal basis</span></p><p class=\"\"><span>Art. 56. 1. 2 of Act on Public Offering</span></p><p class=\"\"><span>Unofficial market - legal basis</span></p><p class=\"\"><span>/-/</span></p><p class=\"\"><span>Contents of the report:</span></p><p class=\"\"><span>mBank Independent Auditor Report Consolidated 2025;</span></p><p class=\"\"><span>Letter of the President of the Management Board to the Shareholders;</span></p><p class=\"\"><span>Letter of the Chairwoman of the Supervisory Board to the Shareholders;</span></p><p class=\"\"><span>Opinion of the Supervisory Board of mBank S.A. on the situation of the Group 2025;</span></p><p class=\"\"><span>Opinion of Supervisory Board on Financial Statements 2025;</span></p><p class=\"\"><span>Statements of the Supervisory Board with respect to the Audit Committee;</span></p><p class=\"\"><span>The Management Board Information on the selection of an audit firm to audit the Financial</span></p><p class=\"\"><span>Statements;</span></p><p class=\"\"><span>The Management Board Information on the selection of an audit firm to attest the Sustainability</span></p><p class=\"\"><span>Statement;</span></p><p class=\"\"><span>mBank Group Consolidated Financial Statement YE 2025;</span></p><p class=\"\"><span>mBank S.A. Group Management Board Report 2025;</span></p><p class=\"\"><span>Independent Auditor's Assurance Report on the Sustainability Statement 2025.</span></p><p class=\"\"><span>Annexes</span></p><p class=\"\"><span>File Description</span></p><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260226_180900_2142964885_EN_Sprawozdanie_BR_z_atestacji_SZR_mBank_2025.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM66jdcna\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_esef_mBank_SSF-2025-12-31-1-en.zip</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM6S78vqa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-ListCEO-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM6ftB5ra\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-ListPRN-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEMkmsKXa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-OcenaRN-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM8L78jGa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-RN-OswKA-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM485w65a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-RNOcenaSpr-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM7nzDgta\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-ZBAudytor-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM1CLQMHa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank-ZBAudytorSZR-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM3llc3Ba\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank_B044AY_Sprawozdanie_z_badania_SSF_31122025_ENG_FINAL.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM5Ytts3a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260226_180900_2142964885_mBank_SDZ-2025-12-31-1-en.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260226:nEM86LZwha\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_EM3KwtpCa:0-mbank-sp-ka-akcyjna-english-version-of-mbank-group-consolidated-annual-report-for-the-12-month-period-ending-31-december-2025/",
            "pub_date": "2026-02-27 01:09:13",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:bc146a469094b:0",
            "title": "AKBA Shares Rise On Clinical Pipeline Optimism As Anemia Drug Gains Traction",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Enrollment is also underway for the company’s study of its other experimental therapy praliciguat in focal segmental glomerulosclerosis (FSGS).</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>In 2026, the company expects a significant revenue growth for Vafseo through expanded access to therapy at dialysis organizations, new patient starts, and improved adherence rates.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The company ended Q4 with cash and cash equivalents of about $184.8 million, which it expects to be sufficient to fund current operating plan for at least two years.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Akebia Therapeutics Inc (AKBA) rose 7% on Thursday after the company announced that it expects significant revenue growth for its approved anemia medicine Vafseo in 2026 while it also advances its clinical pipeline.</span></p><p class=\"\"><span>The company said on Thursday that it now expects its mid-stage trial of AKB-097 in rare kidney diseases to start in the second half of 2026, with initial data expected in 2027. Akebia acquired the experimental drug from Q32 Bio in November. The company will explore the drug in IgA nephropathy, lupus nephritis and C3 glomerulopathy, it said.</span></p><p class=\"\"><span>Enrollment is also underway for the company’s study of its other experimental therapy praliciguat in focal segmental glomerulosclerosis (FSGS). Target enrollment for the trial is approximately 60 patients.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Future Of FDA-Approved Medicines</span></strong></p><p class=\"\"><span>Akebia has two medicines approved by the U.S. Food and Drug Administration including </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/akebia-therapeutics-stock-slumps-after-fda-meeting-ends-without-path-forward-for-vafseo-label-expansion/cLGZtPhR3wx\" rel=\"nofollow\" target=\"_blank\">Vafseo </a><span>for the treatment of anemia due to chronic kidney disease (CKD) in dialysis patients. In 2026, the company expects a significant revenue growth for Vafseo through expanded access to therapy at dialysis organizations, new patient starts, and improved adherence rates.</span></p><p class=\"\"><span>“Vafseo commercial trends are showing marked improvement in early 2026... Patient access to Vafseo therapy now stands at 290,000 patients, and early data points to improved patient adherence rates, which we believe are enhanced as a result of dialysis organizations deciding to implement observed dosing protocols. These dynamics, along with the building evidence of clinical differentiation, are expected to drive significant Vafseo revenue growth in 2026 and beyond…, ” said CEO John P. Butler.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Q4 Numbers</span></strong></p><p class=\"\"><span>For the fourth quarter, the company reported net product revenues of $54.3 million, owing to a quarter-on-quarter increase in prescribers for Vafseo which was launched in the U.S. in Jan. 2025 and an increase in sales volume for Auryxia. Analysts on average were expecting the company to report revenue of $46.09 million.</span></p><p class=\"\"><span>Net loss per share for the period came in at $0.05, compared to a loss of $0.10 in the corresponding quarter of 2024, but above an analyst estimate of a loss of $0.04.</span></p><p class=\"\"><span>The company ended the quarter with cash and cash equivalents of about $184.8 million, which it expects to be sufficient to fund current operating plan for at least two years.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around AKBA stock rose from ‘neutral’ to ‘bullish’ territory over the past 24 hours, while message volume remained at ‘high’ levels.</span></p><p class=\"\"><span>A Stocktwits user highlighted the several potential catalysts for the stock including accelerating adoption for Vafseo and cash hoard.</span></p><p class=\"\"><span>https://www.stocktwits.com/ROCKET123/message/645988666</span></p><p class=\"\"><span>Another voiced hopes for stock as much as doubling “sooner or later.”</span></p><p class=\"\"><span>https://www.stocktwits.com/Andi77/message/645980832</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/AKBA\" rel=\"nofollow\" target=\"_blank\">AKBA stock</a><span> has fallen 28% over the past 12 months. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:bc146a469094b:0/",
            "pub_date": "2026-02-27 01:09:31",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226012280_20260226012306:0",
            "title": "Raiffeisen Bank: She Has Been Management Board Member Since Nov 2023",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226012280_20260226012306:0/",
            "pub_date": "2026-02-27 01:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM14E:0",
            "title": "France's Bonduelle H1 revenue falls slightly",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>French vegetable producer's H1 revenue declined 0.7% on reported figures, but rose 0.3% like-for-like</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net income from continuing operations increased by 18.5% yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Consolidated net income improved significantly due to salad business disposal</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bonduelle targets operating profitability of 80 mln euros for fiscal year ending June 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BRAND GROWTH - Growth of Cassegrain brand in France and Bonduelle brand in emerging markets contributed to sales</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COST MANAGEMENT - Initiatives to improve industrial performance and manage costs supported operating income</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DISPOSAL IMPACT - Disposal of loss-making salad business positively impacted net income</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>H1 Revenue</span></p></td><td></td><td><p class=\"\"><span>EUR 1.11 bln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>H1 Net Income</span></p></td><td></td><td><p class=\"\"><span>EUR 56.5 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>H1 Current Operating Income</span></p></td><td></td><td><p class=\"\"><span>EUR 50.5 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>H1 EBIT Margin</span></p></td><td></td><td><p class=\"\"><span>4.5%</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy\", 4 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the food processing peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Bonduelle SA is €9.30, about 6.9% below its February 25 closing price of €9.99</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 7 times the next 12-month earnings vs. a P/E of 7 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM14E:0-france-s-bonduelle-h1-revenue-falls-slightly/",
            "pub_date": "2026-02-27 01:10:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2938336:0",
            "title": "GEST: Strong FY 2025 profitability and cash flow achieved amid market volatility and EV realignment",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>FY 2025 saw strong profitability and record free cash flow despite revenue declines from forex and scrap prices. All targets were met, leverage hit a record low, and strategic actions realigned EV exposure. 2026 is expected to be flat, with focus on profitability and balance sheet strength.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2938336-1b784d54191ece548e87d0897aae865c\" target=\"_blank\">Gestamp Automocion S.A. [GEST] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2938336:0-gest-strong-fy-2025-profitability-and-cash-flow-achieved-amid-market-volatility-and-ev-realignment/",
            "pub_date": "2026-02-27 01:10:35",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938291:0",
            "title": "NWPX: Record financials, strong backlog, and strategic growth position for a robust 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record 2025 results featured strong revenue, margin expansion, and robust cash flow, driven by operational excellence and strategic growth in both WTS and Precast segments. The company enters 2026 with a strong backlog, healthy order books, and continued focus on organic growth and disciplined capital allocation.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938291:0-nwpx-record-financials-strong-backlog-and-strategic-growth-position-for-a-robust-2026/",
            "pub_date": "2026-02-27 01:03:16",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938292:0",
            "title": "HTO: Raised long-term EPS growth target to 6–8% CAGR, driven by record CapEx and Texas expansion",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Reported strong 2025 results with adjusted EPS of $2.99, record CapEx, and a 31% increase in the five-year CapEx plan. Raised long-term EPS growth target to 6–8% CAGR, with Quadvest acquisition set to drive significant Texas expansion and future earnings accretion.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938292:0-hto-raised-long-term-eps-growth-target-to-6-8-cagr-driven-by-record-capex-and-texas-expansion/",
            "pub_date": "2026-02-27 01:03:17",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938293:0",
            "title": "AMSF: Strong premium growth, high retention, and robust capital offset higher claim severity in 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ROE reached 18.5% and combined ratio was 91.3% in 2025, with strong premium growth and retention. Loss ratio rose to 72% due to higher claim severity, but growth is broad-based and sustainable. Capital position remains robust.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938293:0-amsf-strong-premium-growth-high-retention-and-robust-capital-offset-higher-claim-severity-in-2025/",
            "pub_date": "2026-02-27 01:03:18",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938294:0",
            "title": "IBP: Record profitability and strong commercial growth offset residential softness, supporting a positive 2026 outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record sales and profitability in 2025 were driven by strong commercial performance and disciplined capital allocation, offsetting residential market headwinds. Heavy commercial and complementary products fueled margin expansion, while a robust acquisition pipeline and healthy backlogs support a positive 2026 outlook.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938294:0-ibp-record-profitability-and-strong-commercial-growth-offset-residential-softness-supporting-a-positive-2026-outlook/",
            "pub_date": "2026-02-27 01:03:20",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        }
    ]
}