{
    "data": [
        {
            "id": "DJN_DN20250204014656_20250204014658:0",
            "title": "Toyota Motor 3Q Rev Y12.391T Vs. Y12.041T >7203.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014658:0/",
            "pub_date": "2025-02-05 12:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014656:0",
            "title": "Toyota Motor 3Q Net Y2.193T Vs. Net Y1.358T >7203.TO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014656:0/",
            "pub_date": "2025-02-05 12:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014661:0",
            "title": "Toyota 3Q Net Profit Beat Y1.175T Expected in Poll of Analysts by Quick",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014661:0/",
            "pub_date": "2025-02-05 12:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463688:0",
            "title": "New Zealand Shares Fall as China Responds to US Tariffs; Unemployment Rate Rises to 5.1% in Q4 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand shares fell Wednesday, while Asia-Pacific equities traded mixed as investors weighed China's retaliation against US tariffs. </p><p class=\"\">The S&amp;P/NZX 50 Index was down 0.5%, or 60.45 points, to close at 12,844.59. </p><p class=\"\">Health technology stocks led the decline, followed by industrial services and distribution services. </p><p class=\"\">Asia-Pacific peers were mixed, with Hong Kong's Hang Seng down 0.5%, Australia's ASX 200 up 0.5%, and Japan's Nikkei 225 flat. Returning from a long break, Chinese equities were in the red with the Shanghai SSE down 0.4%. </p><p class=\"\">Overnight, Wall Street shrugged off China's countermeasures against US tariffs as equities climbed. The Nasdaq Composite jumped 1.4%, the S&amp;P 500 rose 0.7%, and the Dow Jones Industrial Average gained 0.3%. </p><p class=\"\">On Tuesday, China announced additional tariffs of 15% on imported coal and liquefied natural gas from the US, as well as 10% tariffs on crude oil, agricultural machinery, large-displacement cars, and pickup trucks. These duties will take effect Feb. 10. </p><p class=\"\">Bank of America Research analysts said China's response \"leaves room for potential negotiations,\" although US President Donald Trump said Tuesday he was in \"no rush\" to speak with China President Xi Jinping. </p><p class=\"\">In domestic news, the unemployment rate jumped to 5.1% in the December 2024 quarter from 4.8% in the preceding three-month period, in line with expectations, Stats NZ data showed Wednesday. </p><p class=\"\">In corporate news, Air New Zealand's  group capacity dropped 1.2% year on year in December impacted by lower aircraft availability due to maintenance requirements. </p><p class=\"\">SKY Network Television  Chief Financial Officer Ciara McGuigan has resigned, effective immediately. She will be succeeded by Andrew Hirst in an interim capacity. The company's shares finished more than 1% lower.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463688:0-new-zealand-shares-fall-as-china-responds-to-us-tariffs-unemployment-rate-rises-to-5-1-in-q4-2024/",
            "pub_date": "2025-02-05 12:29:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0RO:0",
            "title": "Indonesia's Q4 GDP at 5%, in line with poll forecast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indonesia's economy grew 5.02% in the final quarter of 2024 from a year earlier driven by household spending and investment, official data showed on Wednesday, close to analysts' forecasts and little changed from the rate in the previous quarter.</p><p class=\"\">Analysts polled by Reuters had expected annual growth of 4.98%, after the economy had grown 4.95% in the third quarter.</p><p class=\"\">On a non-seasonally adjusted basis, gross domestic product (GDP) rose 0.53% in the October-December quarter from the previous three months, Statistics Indonesia data showed.</p><p class=\"\">For all of 2024, the economy grew 5.03% from 2023.</p><p class=\"\">Growth in Southeast Asia's largest economy has hovered around 5% since the COVID-19 pandemic, a solid pace but far behind new President Prabowo Subianto's 8% target.</p><p class=\"\">The growth outlook this year is clouded by the prospect of U.S. tariffs disrupting trade and weakening global demand, the central bank said last month when it downgraded its 2025 growth forecast to a range of 4.7%-5.5% from 4.8%-5.6%.</p><p class=\"\">Bank Indonesia has cut interest rates twice since September, by a total of 50 basis points, to try to stimulate the economy. </p><p class=\"\">Prabowo's administration has also launched programmes the government believes would boost growth, including providing electricity tariff discounts to bolster purchasing power, free meals for school children, and building affordable housing.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0RO:0-indonesia-s-q4-gdp-at-5-in-line-with-poll-forecast/",
            "pub_date": "2025-02-05 12:29:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW00D:0",
            "title": "Toyota - Toyota Battery Manufacturing North Carolina To Begin Production And Shipments Of Batteries For North American EVs In April",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toyota Motor Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TOYOTA BATTERY MANUFACTURING NORTH CAROLINA TO BEGIN PRODUCTION AND SHIPMENTS OF BATTERIES FOR NORTH AMERICAN EVS IN APRIL</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW00D:0-toyota-toyota-battery-manufacturing-north-carolina-to-begin-production-and-shipments-of-batteries-for-north-american-evs-in-april/",
            "pub_date": "2025-02-05 12:29:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014680:0",
            "title": "Wellington Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in NZ$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Air New Zealand                 0.64       0.64       unch       unch <br/>  Auckland Intl Airport           8.75       8.85      -0.10      -1.07 <br/>  Contact Energy                  9.29       9.29       unch       unch <br/>  Fisher &amp; Paykel Health         34.60      35.92      -1.32      -3.67 <br/>  Fletcher Building               2.86       2.85      +0.01      +0.35 <br/>  Spark New Zealand               2.90       2.92      -0.02      -0.86 <br/>  Warehouse Group                 1.04       1.02      +0.02      +1.96 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014680:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014656_20250204014681:0",
            "title": "Toyota Maintains FY Group Vehicle-Sales Forecast at 10.85M Units",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014656_20250204014681:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014677_20250204014677:0",
            "title": "SGX Sicom May RSS3 Rubber Up 0.8 Cent at 244.0 U.S. Cents/Kg",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014677_20250204014677:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014676_20250204014676:0",
            "title": "SGX Sicom March RSS3 Rubber Untraded at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014676_20250204014676:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014675_20250204014675:0",
            "title": "SGX Sicom Benchmark March TSR20 Rubber Down 1.3 Cents at 192.5 U.S. Cents/Kg",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014675_20250204014675:0/",
            "pub_date": "2025-02-05 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463681:0",
            "title": "EU Seeks Balanced Relationship With China Amid Trade Wars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The European Union is seeking to strike a balance in its relationship with China amid the latter's global trade tensions with the US. </p><p class=\"\">European Commission President Ursula von der Leyen called on EU ambassadors to \"rebalance this relationship\" with China as there are \"growing imbalances and risks\" in its business with the country, according to her speech published on the European Commission on Tuesday. </p><p class=\"\">In her speech at the EU Ambassadors Conference 2025, von der Leyen said that the EU should keep on de-risking its economic relationship with the world's second-biggest economy, as there is room to \"engage constructively\" to find mutual solutions. </p><p class=\"\">The speech also highlighted Europe's need to maintain its level-headedness in \"this hot-headed world\", following Donald Trump's return to presidency. </p><p class=\"\">Trump recently imposed new 10% tariffs on Chinese goods, leading to Beijing retaliating with a new set of duties on US goods and filing a complaint at the World Trade Organization.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463681:0/",
            "pub_date": "2025-02-05 12:30:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463683:0",
            "title": "Saint-Gobain Invests EUR40 Million to Upgrade Spanish Insulation Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Compagnie de Saint-Gobain  is investing 40 million euros to modernize and expand its insulation facility in Azuqueca, Spain. </p><p class=\"\">The construction materials and services company said Tuesday it will replace its fossil fuel-powered furnace with an electric furnace at its stone wool production line, with operations expected to begin in the first half of 2026. </p><p class=\"\">Modernizing its facilities will allow Saint-Gobain to increase stone wool production by 40% to meet Spanish demand for sustainable construction materials and cut carbon dioxide emissions by 70% compared to 2017 levels, contributing to the company's 2050 net-zero target.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463683:0/",
            "pub_date": "2025-02-05 12:30:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW03O:0",
            "title": "Yuan weakens as fresh tariff war dogs post-holiday trade",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    China's yuan weakened against the dollar on Wednesday in the first trading session after the week-long holiday, pressured by a new trade dispute between the world's two largest economies.</p><p class=\"\">Beijing on Tuesday slapped tariffs on U.S. imports in an immediate response to new U.S. duties on Chinese goods, renewing a Sino-American trade war as President Donald Trump sought to punish China for not halting the flow of illicit drugs.</p><p class=\"\">But the losses in the yuan were capped by a persistent strengthening bias in central bank guidance, currency traders said, which they interpreted as an official attempt to limit yuan weakness.</p><p class=\"\">Prior to the market opening, the People's Bank of China (PBOC) set the midpoint , around which the yuan is allowed to trade in a 2% band, at 7.1693 per dollar, its strongest since Nov. 8, 2024 and 968 pips firmer than a Reuters' estimate (CNY=RTRS) of 7.2661.</p><p class=\"\">The central bank has been setting its official guidance on the firmer side of market projections since mid-November, which analysts and traders say is a sign of unease over the yuan's decline.</p><p class=\"\">China's yuan hit a low of about 7.35 per dollar in 2023, weighed down by a combination of a widening yield differential with the United States and a slowing domestic economy. Many market watchers believe any sharp depreciation beyond the key level could mean China is loosening its grip on the currency.</p><p class=\"\">Traders also said they would monitor the daily midpoint fixing, which is widely seen by markets as an expression of official policy stance. </p><p class=\"\">    \"Any sharp depreciation beyond 7.35 or signs that the PBOC is loosening its grip on the yuan fixing rate could trigger massive selling pressure on the yuan and unleash market expectations for further depreciation,\" said Serena Zhou, senior China economist at Mizuho Securities.  </p><p class=\"\">    \"We believe the last thing Chinese policymakers want to see is soaring volatility in the FX and financial markets as they are working hard to revive economic sentiment onshore.\"  </p><p class=\"\">As of 0315 GMT, the yuan  was 0.64% lower at 7.2845 to the dollar, compared with the previous close of 7.2469 last week.</p><p class=\"\">While the onshore yuan was closed for the Lunar New Year holiday, its offshore counterpart  shed 0.6% against the dollar and hit a lifetime low this week. It last traded at 7.2917 around midday.</p><p class=\"\">        In equity markets, the benchmark Shanghai Composite index  dropped 0.36% and the blue-chip CSI 300 Index slipped 0.27% in morning deals. </p><p class=\"\">Still, investors will see any attempts by China to weaken the currency as a hint Beijing expects a protracted trade war and is using the yuan to counter the effect of tariffs, as it did during Trump's first term in 2018.</p><p class=\"\">\"While the tariffs imposed on China are not as aggressive as those on Mexico and Canada, this marks the beginning of another leg of the long-running trade war, with risks of further escalation,\" analysts at Barclays said in a note.</p><p class=\"\">\"We see intensified downside risk to the Chinese yuan (CNY) and other Asian currencies such as Korean won (KRW), Malaysian ringgit (MYR), and Thai baht (THB).\"</p><p class=\"\">During Trump's first term as president, the yuan weakened more than 12% against the dollar during a series of tit-for-tat U.S.-China tariff announcements between March 2018 and May 2020. </p><p class=\"\">\"The future path of U.S.-China trade conflicts remains highly uncertain, and reactions from the U.S. to China's retaliation, the potential Trump-Xi phone call, and PBOC's daily dollar-yuan pair (USD/CNY) fixing in the coming days are key events to watch,\" analysts at Goldman Sachs said in a note.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:799.2895204262877px;aspect-ratio:1.3321492007104796\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03O-2186c634d6d65c12b7251a4d0f4ccfbc-resized.webp\" type=\"images/webp\"/><img alt=\"China markets in 2025\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW03O-2186c634d6d65c12b7251a4d0f4ccfbc-resized.jpeg\" style=\"background-color:#ececeb\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">China markets in 2025</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW03O:0-yuan-weakens-as-fresh-tariff-war-dogs-post-holiday-trade/",
            "pub_date": "2025-02-05 12:21:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0DA:0",
            "title": "Australia's Macquarie drops most in 3 months; MS flags renewable energy exposure",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Macquarie Group  fall 3.0% to A$230.78, set for its worst day since Nov. 1</p><p class=\"\">** Morgan Stanley highlights investors' concerns about MQG's exposure to renewable energy investments, as the sector's stocks have de-rated by about 2x PE points in past few months</p><p class=\"\">** Still, MS highlights MQG's strong position in data centres should support performance fees in next 2-3 years; expects FY26 earnings increase of 19%</p><p class=\"\">** Keeps 'outperform' rating, hikes PT to Street-high of A$255</p><p class=\"\">** Avg rating of 11 analysts is equivalent to \"hold\" and their median PT is A$235.00 – LSEG data</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0DA:0-australia-s-macquarie-drops-most-in-3-months-ms-flags-renewable-energy-exposure/",
            "pub_date": "2025-02-05 12:21:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014622:0",
            "title": "Hong Kong PMI Data Points to Continued Pessimism Among Private Sector — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong PMI data show continued concern among private sector firms about the year ahead as global uncertainty rises. The headline S&amp;P Global PMI for January signaled only a modest improvement in business conditions and slipped to its lowest since September 2024. Weak external demand was the main growth constraint, says Tim Moore, economics director at S&amp;P Global Market Intelligence. \"Survey respondents noted subdued willingness to spend among clients amid concerns about the near-term global economic outlook, in particular the impact of potential U.S. tariffs.\" Export sales fell at the fastest pace since September 2024, while new business from Mainland China decreased to the greatest extent since April 2022. Despite an upturn in total new work, Hong Kong firms remain pessimistic about the year ahead, Moore says. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014622:0/",
            "pub_date": "2025-02-05 12:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW058:0",
            "title": "BOJ will keep raising rates if prices move as forecast, c.bank official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Bank of Japan will continue to raise interest rates if underlying inflation accelerates toward its 2% target as projected, a senior central bank official said on Wednesday.</p><p class=\"\">\"Underlying inflation is heading toward 2% but still remains below that level now. As such, we must support economic activity with loose monetary policy,\" Kazuhiro Masaki, director-general of the BOJ's monetary affairs department, told parliament.</p><p class=\"\">\"Having said that, we will continue to raise interest rates and adjust the degree of monetary support, if underlying inflation accelerates toward 2% as we project,\" he said.</p><p class=\"\">    Japan's     core consumer inflation     hit 3.0% in December, marking the fastest year-on-year pace in 16 months and exceeding the BOJ's 2% target for nearly three years.  </p><p class=\"\">    But the central bank has said it focuses on underlying inflation, or the broad trend of price moves that strips away one-off factors such as fuel and volatile fresh food costs, in judging whether inflation will sustainably hit its 2% target.  </p><p class=\"\">In January, the BOJ's board raised its forecast for core-core CPI, which strips away the effect of volatile fresh food and fuel costs, to 2.1% for fiscal 2025, up from a previous estimate of 1.9% in October.</p><p class=\"\">    Japan's post-pandemic price increases have been driven mostly by rising raw material costs, blamed in part by higher import costs from a weak yen, Masaki said.  </p><p class=\"\">    Such cost-push inflationary pressure is likely to dissipate, while rising wages are leading to moderate increases in services prices, he added.  </p><p class=\"\">    \"We expect underyling inflation to gradually head toward our 2% target,\" Masaki said.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW058:0-boj-will-keep-raising-rates-if-prices-move-as-forecast-c-bank-official-says/",
            "pub_date": "2025-02-05 12:23:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463677:0",
            "title": "Market Chatter: BP Expected to Invest Up to $25 Billion to Redevelop Oil, Gas Fields in Iraq",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BP (BP.L) is expected to spend up to $25 billion to redevelop four oil and gas fields in Kirkuk, Iraq, Reuters reported Tuesday, citing an unnamed senior oil official in the country with direct knowledge of the issue. </p><p class=\"\">As part of the profit-sharing agreement, which is expected to run for over 25 years, the British oil and gas giant aims to raise the oilfields' capacity to 450,000 barrels per day in the next two to three years, the unnamed source noted. </p><p class=\"\">The official added that technical and economic negotiations are underway and that a deal for the project could be signed in the first half of February and possibly by the end of the week. </p><p class=\"\">BP did not immediately respond to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463677:0/",
            "pub_date": "2025-02-05 12:23:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014632_20250204014632:0",
            "title": "Toyota Motor Sees FY Net Y4.52T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014632_20250204014632:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014631_20250204014631:0",
            "title": "Toyota Motor Raises FY Dividend to Y90.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014631_20250204014631:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014627:0",
            "title": "Toyota Motor 9-Mos Rev Y35.67T Vs Y34.02T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014627:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014629_20250204014629:0",
            "title": "Toyota Motor 9-Mos Pretax Pft Y5.43T Vs Pft Y5.36T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014629_20250204014629:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014628_20250204014628:0",
            "title": "Toyota Motor 9-Mos Oper Pft Y3.68T Vs Pft Y4.24T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014628_20250204014628:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014626_20250204014626:0",
            "title": "Toyota Motor 9-Mos Net Y4.10T Vs Net Y3.95T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014626_20250204014626:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204014630_20250204014630:0",
            "title": "Toyota Motor 9-Mos EPS Y307.95 Vs EPS Y291.87",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204014630_20250204014630:0/",
            "pub_date": "2025-02-05 12:25:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463680:0",
            "title": "Green Technology Metals Progresses Canada Lithium Conversion Facility; Shares Rise Over 6%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Green Technology Metals  progressed its lithium conversion facility development strategy in Ontario, Canada, according to a Wednesday Australian bourse filing. </p><p class=\"\">The company is conducting pilot test work at battery producer EcoPro's Pohang-Yeongil Bay industrial complex in South Korea to produce battery-grade lithium hydroxide from ore mined from Green Technology's Seymour project in Canada. </p><p class=\"\">It shipped a one-tonne spodumene concentrate sample to the facility and it expects to achieve lithium hydroxide production in the second quarter of 2025. </p><p class=\"\">It will also conduct test work on a tonne of concentrate from the Root lithium project. </p><p class=\"\">The pre-feasibility study remains on track for completion by the fourth quarter. </p><p class=\"\">The firm's shares rose over 6% in recent trading on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463680:0/",
            "pub_date": "2025-02-05 12:25:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463671:0",
            "title": "Japanese Service Sector Sees Strongest Growth in Four Months Amid Rising Inflation and Employment Surge -S&P",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In January, the Japanese service sector experienced its strongest growth in business activity in four months, as indicated by the au Jibun Bank Japan Services Business Activity Index reaching 53.0. </p><p class=\"\">This upturn was driven by a significant rise in new business inflows, which prompted firms to increase employment levels to meet growing demand, according to S&amp;P Global statement on Wednesday. </p><p class=\"\">The sector's expansion was primarily seen in Transport &amp; Storage and Finance &amp; Insurance, while Information &amp; Communication faced a slight decline. </p><p class=\"\">Export demand contributed positively, rising for the first time in four months, particularly from parts of Asia. </p><p class=\"\">However, inflationary pressures intensified, with input price inflation reaching a five-month high due to rising wages, as well as increased fuel and raw material costs. </p><p class=\"\">As a result, service providers raised prices, leading to the highest inflation in prices charged since May 2024. </p><p class=\"\">Meanwhile,the au Jibun Bank Japan Composite PMI Output Index rose to 51.1 in January from 50.5 in December, remaining above the neutral 50.0 for the third month and indicating the strongest private sector output expansion since last September. </p><p class=\"\">This growth was driven by a solid increase in the service economy, although it was partially offset by a contraction in manufacturing output, as new business volumes reached a five-month high. </p><p class=\"\">Despite a quicker pace of input cost inflation, particularly in the service sector, output price inflation remained historically strong but little changed from December.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463671:0/",
            "pub_date": "2025-02-05 12:17:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "forexlive:2f3b0f60b094b:0",
            "title": "Federal Reserve speakers on Wednesday include Barkin, Goolsbee, Bowman, and Jefferson",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The times below are listed GMT/US Eastern time. </p><p class=\"\">1400/0900 Federal Reserve Bank of Richmond President Thomas Barkin participates in fireside chat before the Conference Board \"2025: A Year in Preview\" Conference, in New York</p><p class=\"\">1800/1300 Federal Reserve Bank of Chicago President Austan Goolsbee speaks on economic perspectives before hybrid 31st Annual Automotive Insights Symposium</p><p class=\"\">2000/1500 Federal Reserve Board Governor Michelle Bowman gives brief economic update and bank regulation remarks before the 2025 Kansas Bankers Association Harold A. Stones Government Relations Conference</p><p class=\"\">0030/1930 Federal Reserve Vice Chair Philip Jefferson gives lecture, \"Do Non-Inflationary Economic Expansions Promote Shared Prosperity?\" at Swarthmore College, in Swarthmore, Pa</p><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1115.2941176470588px;aspect-ratio:1.8588235294117648\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.webp\" type=\"images/webp\"/><img alt=\"Federal Reserve\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/forexlive:2f3b0f60b094b-6e7c5db741cdb978729e7f77eb491dba-resized.jpeg\" style=\"background-color:#b3b2a6\"/></picture></div></figure></span></span></div>",
            "link": "https://www.tradingview.com/news/forexlive:2f3b0f60b094b:0-federal-reserve-speakers-on-wednesday-include-barkin-goolsbee-bowman-and-jefferson/",
            "pub_date": "2025-02-05 12:18:19",
            "source": "Forexlive",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0ET:0",
            "title": "India's Swiggy slides ahead of Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Swiggy  falls ~2% ahead of Q3 results later in the day</p><p class=\"\">** This will be food and grocery delivery firm's first quarterly report since going public in November 2024</p><p class=\"\">** Analysts expect consol loss of 6.17 bln rupees ($70.8 mln), per data compiled by LSEG</p><p class=\"\">** Co's Q2 consol loss was 6.26 bln rupees</p><p class=\"\">** ICICI Securities sees 20% y/y rise in SWIG's food delivery gross order value (GOV)</p><p class=\"\">** Expects quick-commerce (QC) segment GOV to grow 108.9% y/y</p><p class=\"\">** Anand Rathi Research says QC segment's EBITDA margins will contract 80-100 bps q/q on heightened competition, rival Zepto's relentless cash burn</p><p class=\"\">** Last month, SWIG dropped below IPO price (390 rupees) for the first time</p><p class=\"\">** Rival Zomato 's Q3 profit more-than-halved on rising competition in QC, increased expenses</p><p class=\"\">($1 = 87.1200 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0ET:0-india-s-swiggy-slides-ahead-of-q3-results/",
            "pub_date": "2025-02-05 12:19:25",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZRN00AWSR:0",
            "title": "UAE non-oil business sector expands robustly in January, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The UAE's non-oil private sector continued to expand robustly at the start of 2025, although capacity pressures and competitive challenges posed headwinds, a survey showed on Wednesday.</p><p class=\"\">The seasonally adjusted S&amp;P Global UAE Purchasing Managers' Index was 55.0 in January, slightly down from December's nine-month high of 55.4, but well above the 50.0 mark indicating expansion. </p><p class=\"\">Business activity and new orders rose sharply, driven by favourable market conditions and easing cost pressures, although at a slightly slower pace, with the new orders sub index easing to 59.0 in January, from December's 59.3.  </p><p class=\"\">\"Robust expansions in activity and new business, as well as lower input cost inflation, suggest the economy is in a healthy position,\" said David Owen, Senior Economist at S&amp;P Global Market Intelligence. </p><p class=\"\">Input cost inflation fell to a 13-month low, allowing firms to increase purchases, but capacity pressures persisted, with backlogs of work rising at their fastest pace in eight months.</p><p class=\"\">\"Strong competition and cash flow concerns arising from heavy backlogs have appeared to sow doubt among firms that they can continue to boost their revenues,\" Owen said, noting that total confidence was at its lowest level since December 2022. </p><p class=\"\">A separate index for Dubai eased slightly to 55.3 from December's 55.5, as businesses reported improved conditions but expressed subdued expectations for future activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZRN00AWSR:0-uae-non-oil-business-sector-expands-robustly-in-january-pmi-shows/",
            "pub_date": "2025-02-05 12:19:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}