{
    "data": [
        {
            "id": "DJN_DN20250204007190:0",
            "title": "Markets See Room to Negotiate on Tariffs Now — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0918 ET - Much of the past few days has been about gauging how inflexible the Trump administration will be on tariffs; in other words, whether they're better understood as firm policy or a negotiating tool. Quick postponements of the Canada and Mexico tariffs point to the latter category, strategist Will Compernolle of FHN Financial writes. He notes China's retaliatory tariffs against the only barriers Trump has actually implemented so far don't start until Feb. 10. That \"implies room for negotiation, something traders may take as a sign these tariffs will not be long term,\" Compernolle writes. \"The trade relationship may nevertheless be scarred, but there's a sense, rightly or wrongly, the more maximalist policies will not be the equilibrium.\" (matt.grossman@wsj.com; @mattgrossman)</p><p class=\"\">0835 ET - Treasury yields rise as the U.S. trade war against Mexico and Canada takes a pause while China announces retaliatory tariffs on U.S. exports. Inflation concerns are rising while it remains to be seen how the Fed will react to trade tensions. December JOLTS report is due at 10 a.m. ET. ADP employment data will come tomorrow, followed by jobless claims on Thursday and nonfarm payrolls Friday. Economists surveyed by The Wall Street Journal forecast a slowdown in job creation last month, with unemployment stable at 4.1%. The 10-year is at 4.577% and the two-year at 4.257%. (paulo.trevisani@wsj.com; @ptrevisani)</p><p class=\"\">0722 ET - The U.K. might have to pick a side between the U.S. and Europe in a trade conflict even if it avoids direct U.S. tariffs, Pantheon Macroeconomics economists say in a note. \"The EU has reportedly prepared retaliation should President Trump apply tariffs to the eurozone, and we doubt the U.K. could stand neutral in the middle,\" they say. Britain is highly exposed to global trade disruption because total exports and imports are worth 64% of GDP, the economists say. The U.K. might need to take Trump's other threats, including tax cuts and deportations that threaten to raise global inflation, more seriously given that other countries could respond with fiscal stimulus. Trump's actions would be hawkish for U.K. policy, they say. (edward.frankl@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">0627 ET - The cost of insuring euro credit against default using credit default swaps stays steady after the U.S. delayed tariffs on Canada and Mexico by a month. \"Tariff-related volatility has subsided to an extent following news that both Mexico and Canada had managed to delay the imposition of new import costs,\" IG analysts say in a note. The iTraxx Europe Crossover index which tracks euro junk bond CDS is unchanged at 294 basis points, S&amp;P Global Market Intelligence data show. The iTraxx Europe Senior Financials index which tracks euro investment-grade financial bonds CDS is steady at 61bps. (miriam.mukuru@wsj.com)</p><p class=\"\">0621 ET - Bitcoin falls, albeit remaining above lows hit Monday when risky assets were stung by U.S. President Trump announcing 25% tariffs on Canada and Mexico. He later agreed to delay these tariffs, providing some brief relief but risks remains and a new 10% tariff on China took effect Tuesday. \"China's tariffs keep risk high and cause cryptos to retreat,\" Saxo analysts say in a note. Uncertainty remains and the China tariffs mean further retaliation is possible, they say. Bitcoin falls 3.1% to $98,742 after hitting a three-and-a-half-week low of $91,439 Monday, according to LSEG. (renae.dyer@wsj.com)</p><p class=\"\">0614 ET - The Bank of England could cut interest rates only twice more, including once at this week's meeting, pausing rate reductions by the second half of the year, Berenberg's Andrew Wishart says in a note. Concerns about weak growth and rising unemployment rate are likely to result in faster initial rate reductions, but fears about a rebound in U.K. inflation could then cause the BOE to pause, he says. \"Rising government spending and rate cuts will encourage demand and allow firms to cover higher costs by raising prices.\" Berenberg expects U.K. inflation could reaccelerate to 3.0% in 2025. U.K. money markets price in three rate cuts this year, though a second reduction isn't fully priced in until June. (miriam.mukuru@wsj.com)</p><p class=\"\">0544 ET - The Canadian dollar remain vulnerable even after President Trump agreed to pause 25% tariffs on Canada, Monex Europe analysts say in a note. Any celebrations look somewhat premature, they say. \"The Canadian government will likely have to make much more onerous concessions to ensure that the tariff threat is lifted permanently, and this appears far from a done deal to us.\" This recent drama could resume in a few weeks with risks that next time won't result in another deal for U.S. tariffs to be suspended, they say. USD/CAD trades flat at 1.4434 after hitting a 22-year high of 1.4793 Monday, according to FactSet. (renae.dyer@wsj.com)</p><p class=\"\">0529 ET - The Bank of England is widely expected to cut interest rates when it announces a decision Thursday, and it could hint at another interest-rate cut in March, Berenberg's senior economist Andrew Wishart says in a note. \"Until now, the BOE has cut at alternate meetings, but a stagnating economy and declining employment argue for more urgent action,\" he says. Markets price in a total of 30 basis points of interest-rate cuts in February and March, LSEG Refinitiv data show. \"It is sensible for the BOE to lower interest rates to prevent a larger drop in [U.K.] employment,\" Wishart says. (miriam.mukuru@wsj.com)</p><p class=\"\">0527 ET - China's tariff retaliation is smaller than expected and largely symbolic, Morningstar analyst Kai Wang says in a note. Trump's latest 10% blanket tariff on Chinese goods has an immediate impact only on some industries, such as home appliances, lithium batteries and EVs, the analyst says. Wang notes that the products included in China's countermeasures, such as coal and liquefied natural gas, accounted for just 12% of the country's imports from the U.S., implying less risk than previously expected. However, the analyst still warns of the possibility of an escalating trade war given Trump's unpredictability.(sherry.qin@wsj.com)</p><p class=\"\">0508 ET - Donald Trump's trade policy announcements over the weekend raise the question of whether there is a bigger risk from tariffs to the eurozone than previously thought, according to Capital Economics' Andrew Kenningham. A 10% universal tariff imposed by the U.S. might shave 0.1% to 0.2% off eurozone GDP, he says in a note. But a 25% tariff, as imposed but suspended on Canada and Mexico, would have a more-than-proportionately larger effect because it would be harder for companies and exchange-rate moves to cushion the blow, Kenningham warns. A ball-park estimate is that would cut eurozone GDP by around 0.5%, leaving growth close to zero this year. Additionally, a prohibitive tariff of, say, 100% on European vehicles could on its own push Germany into recession. (edward.frankl@wsj.com)</p><p class=\"\">0505 ET - The dollar could suffer a further pullback if the U.S. and China move towards a de-escalation in their trade dispute, ING analyst Francesco Pesole says in a note. A new 10% U.S. tariff on China took effect Tuesday and China has announced retaliatory tariffs. Markets seem to price in a good chance of the U.S. and China striking a deal and delaying tariffs after Trump agreed to pause planned 25% tariffs on Canada and Mexico. However, the case for significant dollar depreciation is weak as the tariff threat remains, Pesole says. Trump has \"more concretely introduced the tariff threat into daily market news.\" The DXY dollar index falls 0.5% to 108.484. (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007190:0/",
            "pub_date": "2025-02-04 22:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007188:0",
            "title": "Antitrust Shouldn't Become Trade War Weapon, EU Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Edith Hancock</p><p class=\"\">Antitrust enforcement shouldn't become a weapon in trade disputes, a European Commission spokesperson said as the U.S. and China imposed tariffs on each other this week.</p><p class=\"\">\"[European Union competition enforcement] is agnostic to the country of establishment of the company involved,\" commission spokesperson Lea Zuber said on Tuesday.</p><p class=\"\">Zuber's comments come after U.S. President Trump slapped 10% tariffs on some Chinese goods, triggering a tit-for-tat reaction from China and escalating tensions between the two largest global economies.</p><p class=\"\">China's State Administration of Market Regulation also said that it has opened an investigation into Alphabet's Google over suspected antitrust violations. Google's use is already heavily restricted in China and its search engine was pulled from the mainland in 2010.</p><p class=\"\">Zuber said the commission wouldn't speculate on the reasons behind the Google probe. She said the sole focus of the EU's antitrust investigations is to identify violations related to the behavior investigated and not harms related to any possible tariffs or other measures.</p><p class=\"\">\"We don't think that competition enforcement should become a tool in trade disputes,\" she said.</p><p class=\"\">Trump has spent his first days back in office criticizing the EU's trade relations with the U.S. On Sunday he said that the region is \"really taking advantage\" of the U.S., complaining that the bloc exports far more than it takes from the country and that the U.S. could impose fresh tariffs on the region \"very soon.\"</p><p class=\"\">Write to Edith Hancock at edith.hancock@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007188:0-antitrust-shouldn-t-become-trade-war-weapon-eu-says/",
            "pub_date": "2025-02-04 22:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "financemagnates:f162f242f094b:0",
            "title": "Finalto Names Paul Jackson as Joint Head of Sales, Partnering with Chauncey Boreham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Finalto has appointed Paul Jackson as Joint Head of Sales for the EU, UK, and LATAM regions. Jackson brings sales leadership experience in financial markets to the role. He joins Finalto from iSAM Securities, where he served as Sales Director, focusing on global business growth.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Finalto Appoints Jackson as Sales Head</strong></p><p class=\"\">Chauncey Boreham, Source: Finalto</p><p class=\"\">Jackson commented: \"I’m delighted to be part of such a dynamic sales team. This is a great opportunity to build on Finalto’s ongoing success and help deliver on the company’s strategic vision for 2025 and beyond.\"</p><p class=\"\">Jackson has prior experience with Finalto, having worked for five years as Sales Director at CFH Clearing before it became part of Finalto in 2021.Paul Groves, Finalto UK CEO, Source: Finalto</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Joint Leadership to Oversee Sales</strong></p><p class=\"\">Jackson will lead the Sales department alongside Chauncey Boreham, who has been promoted from Senior Sales Director to Joint Head of Sales. The two will collaborate on Finalto's Sales strategy.</p><p class=\"\">Boreham added: \"I’m thrilled to welcome Paul to Finalto. His expertise and experience will be an immediate asset to the Sales team.\"</p><p class=\"\">Finalto UK CEO Paul Groves stated that the new appointments would strengthen the Sales Department’s operations.</p><p class=\"\">\"Chauncey and Paul are consummate sales professionals with extensive market experience. Their guidance will help the Sales team drive ongoing growth, across the markets in which we operate,\" Groves commented.</p></span></div>",
            "link": "https://www.tradingview.com/news/financemagnates:f162f242f094b:0-finalto-names-paul-jackson-as-joint-head-of-sales-partnering-with-chauncey-boreham/",
            "pub_date": "2025-02-04 22:18:05",
            "source": "Finance Magnates",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308892:0",
            "title": "Sector Update: Financial Stocks Lean Lower Premarket Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Financial stocks leaned lower premarket Tuesday with the Financial Select Sector SPDR Fund  recently declining marginally. </p><p class=\"\">The Direxion Daily Financial Bull 3X Shares  was down 0.4% and its bearish counterpart Direxion Daily Financial Bear 3X Shares  was 0.6% higher. </p><p class=\"\">PayPal Holdings  shares fell past 8% even after the company reported higher Q4 non-GAAP earnings and net revenue. </p><p class=\"\">KKR  shares declined by nearly 3% after the company reported a decline in Q4 revenue. </p><p class=\"\">Apollo Global Management  shares were down nearly 3% after the company reported a lower Q4 revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308892:0-sector-update-financial-stocks-lean-lower-premarket-tuesday/",
            "pub_date": "2025-02-04 22:18:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308898:0",
            "title": "GUIDANCE: (BERY) Berry Global Expects Fiscal 2025 Adjusted EPS Range $6.10 - $6.60, vs. FactSet Est of $6.26",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308898:0/",
            "pub_date": "2025-02-04 22:18:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308900:0",
            "title": "Evercore ISI Adjusts Lowe's Companies Price Target to $290 From $260",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lowe's Companies  has an average rating of overweight and mean price target of $284.45, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308900:0/",
            "pub_date": "2025-02-04 22:19:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308901:0",
            "title": "Morgan Stanley Adjusts Price Target on Elevance Health to $405 From $388, Keeps Equalweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Elevance Health  has an average rating of overweight and mean price target of $481.56, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308901:0/",
            "pub_date": "2025-02-04 22:19:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0MK:0",
            "title": "Morocco, Mauritania to connect electricity grids",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Morocco's state-owned electricity utility ONEE said it signed a power interconnection deal with Mauritania counterpart SOMELEC on Tuesday without disclosing cost details or project deadlines.</p><p class=\"\">The Moroccan electricity grid is already connected to Spain via two undersea cables.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0MK:0-morocco-mauritania-to-connect-electricity-grids/",
            "pub_date": "2025-02-04 22:19:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX23TT1G:0",
            "title": "Stryve Foods, Inc. Transforms Balance Sheet Issuing $9.4 Million of Preferred Stock to Retire Debt",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em>Eliminates $8.7 Million of Maturing Liabilities</em><em>Deleverages Assets &amp; Strengthens Balance Sheet</em>Creates Flexibility to Pursue More Attractive Financing Options</p><p class=\"\">PLANO, Texas, Feb.  04, 2025  (GLOBE NEWSWIRE) — Stryve Foods, Inc.  (“Stryve” or the “Company”), a leader in high-protein, better-for-you snacking, today announced the successful completion of a balance sheet transforming transaction, marking the second step in a multi-pronged approach to fortify its financial foundation and support its path to profitability.</p><p class=\"\">As part of this initiative, Stryve has issued 877,878 shares of newly created Series A-1 Convertible Preferred Stock, valued at approximately $10.71 per share, for a total of $9.4 million in preferred stock. The transaction closed on Thursday, January 30th, 2025, and was priced at a premium to market. As part of this transaction, approximately $8.7 million of maturing liabilities have been retired in exchange for the Series A-1 Convertible Preferred Stock. This strategic transaction eliminates a substantial portion of the Company's outstanding debt obligations, significantly improving its financial flexibility and capital structure.</p><p class=\"\">Strong Insider Participation Reflects Confidence in Stryve’s Future:</p><p class=\"\">Demonstrating a high level of confidence in Stryve’s future, insiders represent approximately $3.0 million of the preferred stock, with Chris Boever, Stryve’s Chief Executive Officer, personally representing $2.7 million. This strong insider participation underscores management’s continued belief in the Company’s transformation strategy and long-term growth potential.</p><p class=\"\">“This transaction represents a major milestone in our efforts to transform the Company and position Stryve for long-term success,” said Mr. Boever. “By eliminating the near-term maturities, we seek to make it easier for investors to value the Company on the basis of the business instead of its capital structure – hopefully allowing the market to acknowledge the overall transformation in operating results we’ve completed over the last two years. This transaction represents an important step forward in our multi-phased approach to transform the business, enhance our financial stability, and drive sustainable growth.”</p><p class=\"\">Key Terms of the Series A-1 Convertible Preferred Stock:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Conversion</strong>: Beginning six months after issuance, the preferred equity is convertible into Class A common stock at a conversion price of $0.7599 per share. On an as-converted basis and before contemplating any preferred dividends, this represents approximately 12.4 million shares of common stock in total.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Dividends</strong>: Preferred shares accrue dividends at 12% per annum, payable in cash or additional preferred stock, at the Company’s discretion.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Voting Rights</strong>: Each share of preferred stock will vote on a one-to-one basis with the Class A common stock, subject to a 19.99% voting cap.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Company’s Call Option</strong>: Beginning two years after issuance, the Company has the right to redeem the preferred stock at 102% of the stated value, plus any unpaid accrued dividends.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Forced Conversion</strong>: If, within nine months of issuance of the preferred stock, the Company raises at least $6.0 million in gross proceeds from the sale of Class A common stock at a price equal to or greater than the preferred stock’s conversion price ($0.7599 per share), Stryve may, at its option, force the conversion of the preferred stock into common shares at the conversion price.</li></ul><p class=\"\">“We believe that this transaction is a win-win for Stryve and our stakeholders,” added R. Alex Hawkins, Chief Financial Officer of Stryve Foods. “We have effectively addressed upcoming debt maturities while preserving our ability to raise additional capital in a way that supports our long-term growth objectives. The strong insider participation further underscores our leadership team’s confidence in Stryve’s vision and the steps we are taking to execute on our profitability goals.”</p><p class=\"\">This transaction builds on Stryve’s ongoing financial transformation efforts, following previous initiatives aimed at streamlining operations and improving cost efficiencies. With a strengthened balance sheet and a focus on operational execution, the Company remains committed to driving value for shareholders and accelerating its journey to profitability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Stryve Foods, Inc.</strong>Stryve is a premium air-dried meat snack company that is conquering the intersection of high protein, great taste, and health under the brands of Braaitime®, Kalahari®, Stryve®, and Vacadillos®. Stryve sells highly differentiated healthy snacking and food products in order to disrupt traditional snacking and CPG categories. Stryve’s mission is “to help Americans eat better and live happier, better lives.” Stryve offers convenient products that are lower in sugar and carbohydrates and higher in protein than other snacks and foods. Stryve’s current product portfolio consists primarily of air-dried meat snack products marketed under the Stryve®, Kalahari®, Braaitime®, and Vacadillos® brand names. Unlike beef jerky, Stryve’s all-natural air-dried meat snack products are made of beef and spices, are never cooked, contain zero grams of sugar*, and are free of monosodium glutamate (MSG), gluten, nitrates, nitrites, and preservatives. As a result, Stryve’s products are Keto and Paleo diet friendly. Further, based on protein density and sugar content, Stryve believes that its air-dried meat snack products are some of the healthiest shelf-stable snacks available today. Stryve also markets and sells human-grade pet treats under the brands Two Tails and Primal Paws, made with simple, all-natural ingredients and 100% real beef with no fillers, preservatives, or by-products.</p><p class=\"\">Stryve distributes its products in major retail channels, primarily in North America, including grocery, convenience store, mass merchants, and other retail outlets, as well as directly to consumers through its ecommerce websites and through the Amazon and Wal*mart platforms. For more information about Stryve, visit www.stryve.com or follow us on social media at @stryvebiltong.</p><p class=\"\">* All Stryve Biltong and Vacadillos products contain zero grams of added sugar, with the exception of the Chipotle Honey flavor of Vacadillos, which contains one gram of sugar per serving.</p><p class=\"\">Cautionary Note Regarding Forward-Looking Statements</p><p class=\"\">Certain statements made herein are “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995. Forward-looking statements may be identified by the use of words such as “anticipate”, “may”, “will”, “would”, “could”, “intend”, “aim”, “believe”, “anticipate”, “continue”, “target”, “milestone”, “expect”, “estimate”, “plan”, “outlook”, “objective”, “guidance” and “project” and other similar expressions that predict or indicate future events or trends or that are not statements of historical matters, including, but not limited to, statements regarding Stryve’s plans, strategies, objectives, targets and expected financial performance. These forward-looking statements reflect Stryve’s current views and analysis of information currently available. This information is, where applicable, based on estimates, assumptions and analysis that Stryve believes, as of the date hereof, provide a reasonable basis for the information and statements contained herein. These forward-looking statements involve various known and unknown risks, uncertainties and other factors, many of which are outside the control of Stryve and its officers, employees, agents and associates. These risks, uncertainties, assumptions and other important factors, which could cause actual results to differ materially from those described in these forward-looking statements, include: (i) the inability to achieve profitability due to commodity prices, inflation, supply chain interruption, transportation costs and/or labor shortages; (ii) the ability to meet financial and strategic goals, which may be affected by, among other things, competition, supply chain interruptions, the ability to pursue a growth strategy and manage growth profitability, maintain relationships with customers, suppliers and retailers and retain its management and key employees; (iii) the risk that retailers will choose to limit or decrease the number of retail locations in which Stryve’s products are carried or will choose not to carry or not to continue to carry Stryve’s products; (iv) the possibility that Stryve may be adversely affected by other economic, business, and/or competitive factors; (v) the ability to remain listed on NASDAQ; (vi) the possibility that Stryve may not achieve its financial outlook; (vii) risks around the Company’s ability to continue as a going concern and (viii) other risks and uncertainties described in the Company’s public filings with the SEC. Actual results, performance or achievements may differ materially, and potentially adversely, from any projections and forward-looking statements and the assumptions on which those projections and forward-looking statements are based.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Investor Relations</p><p class=\"\">ir@stryve.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX23TT1G:0-stryve-foods-inc-transforms-balance-sheet-issuing-9-4-million-of-preferred-stock-to-retire-debt/",
            "pub_date": "2025-02-04 22:20:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308876:0",
            "title": "Sector Update: Consumer Stocks Mixed Pre-Bell Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Consumer stocks were mixed pre-bell Tuesday, with the Consumer Staples Select Sector SPDR Fund  0.2% lower and the Consumer Discretionary Select Sector SPDR Fund  was flat. </p><p class=\"\">Estee Lauder  shares were down more than 5% after the company reported lower fiscal Q2 adjusted net earnings and net sales. The company also issued fiscal Q3 outlook for adjusted earnings per share below market expectations. In addition, Estee Lauder said it expects to eliminate 5,800 to 7,000 job roles as part of a restructuring plan. </p><p class=\"\">PepsiCo  shares declined by more than 2% after the company reported a decline in fiscal Q4 revenue. </p><p class=\"\">Archer-Daniels-Midland  shares fell by over 2% after the company reported lower Q4 adjusted earnings and revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308876:0-sector-update-consumer-stocks-mixed-pre-bell-tuesday/",
            "pub_date": "2025-02-04 22:20:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS4Jdr9a:0",
            "title": "Cisco: Innovation - and Independence - for People With Diverse Abilities",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A Cisco-sponsored project explores how technology can better support seniors, people with developmental disabilities, and other challenged communities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">By Kevin Delaney</strong></p><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / Keeping our rooms clean and safe. Maintaining personal hygiene. Staying connected with family.</p><p class=\"\">For many of us, these are simple, everyday tasks. But for those with diverse abilities - including seniors and people with cognitive disabilities - handling such tasks can be a daily triumph. And they can mean the difference between independence and constant supervision.</p><p class=\"\">A pilot project funded by Cisco's Country Digital Acceleration (CDA) program, Ignite Technology, and other partners has been exploring how digital solutions can help. Under the brand name Hayla, a suite of high-tech innovations has evolved into a streamlined, secure, app-based platform that is ready for market.</p><p class=\"\">\"A lot of these individuals are looking to live more independently, autonomously, maybe move to a situation where they're on their own,\" explained Ignite CEO Steven Taylor. \"And the Autonomous Living Project, now branded Hayla, uses technology to help people work towards the goal of self-sufficiency, independence, and greater dignity.\"</p><p class=\"\">The origins of Hayla began in 2021 at the Lou Fruitman Residence in Toronto, which is run by Reena, another partner in the project. The Residence houses 138 adults and seniors with diverse needs. And as part of this project, it adopted a number of technologies - including Internet of Things (IoT) sensors, automated alerts, smart-device integration, collaboration hubs, and a proprietary app - all supported by customized Cisco and Cisco Meraki products.</p><p class=\"\">The concept is built around self-sufficiency, not surveillance. Through remote monitoring, smart notifications, alert services, and smart-device integration, users receive in-home support that enables them to live independently and safely. However, if the need arises - whether for an emergency, basic reminders, or emotional/mental counseling - caregivers can step in quickly.</p><p class=\"\">It's technology that's geared to individual outcomes.</p><p class=\"\">\"If we're talking to an individual and a caregiver,\" Taylor said, \"we don't simply talk about the sensors they can have. We talk about the challenges they're experiencing today, and we look at implementing a solution that leverages technology to actually help address those challenges.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Security and simplicity for positive good</strong></p><p class=\"\">With their shared commitment to simple-to-use, secure technologies, Cisco and Ignite were ideal partners.</p><p class=\"\">\"Like Cisco, Ignite is committed and visionary,\" said Wayne Cuervo, director of Cisco Canada's Digital Impact Office. \"They have an ideal view of how technology can not only help, but how technology can get out of the way - to simplify the experience.\"</p><p class=\"\">Hayla represents a big commitment in time, technology, and expertise from Cisco, particularly its CDA program.</p><p class=\"\">\"We consider Hayla to be one of our most important projects,\" said Cuervo. \"It's a profound story that helps transform the lives of people. And we feel it's very scalable to other use cases around the world.\"</p><p class=\"\">As for the outcomes so far, Jessica Noftle, day program supervisor for another partner, the Toronto-based family-support organization Creating Alternatives, weighed in from a caretaker's perspective.</p><p class=\"\">\"With Hayla's expertise, innovation and devices,\" she said, \"we have successfully been able to help more than 10 supported individuals transition out of fully supported days, to semi-independent living. Hayla's dedication, along with their mentorship, has been a huge success for us at Creating Alternatives. We hope to continue to work alongside them for years to come.\"</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A scalable solution for aging populations</strong></p><p class=\"\">Hayla makes it all happen with a foundation of Cisco technology.</p><p class=\"\">\"At the core of the hardware is a Cisco firewall router and an access point,\" Taylor stressed. \"That access point communicates with the Meraki IoT sensors in the unit, which monitor things like the refrigerator, doors, and showers. Essentially, you have your network equipment - that is, access points, firewalls, and switches for larger implementations, - and IoT sensors that are set in the environment for safety and peace of mind. Maybe it's actually detecting water leakage, smoke in units, or simply helping to track daily living tasks.\"</p><p class=\"\">Communication, of course, is equally critical. And Cisco Webex - either through handheld devices or hardware like the Cisco DeskPro, combined with Webex Calling - keeps users, their families, and caregiving teams connected on both emotional and practical levels.</p><p class=\"\">\"Webex Calling is part of our custom software that we've integrated,\" Taylor continued. \"This allows individuals to call a parent, caregiver, or therapist simply by clicking their picture. Everything is handled on the back end, so it's just one button to call.\"</p><p class=\"\">Security is a key concern, especially when sensitive medical or personal data is shared among vulnerable populations. So, Cisco and Meraki's built-in end-to-end security ensures further confidence in the system. Despite a constant flow of data coming from sensors, monitoring is automated and intuitive.</p><p class=\"\">\"All of this is managed on the back end through the Meraki Dashboard and Cisco Control Hub,\" Taylor added. \"We have automated alerts through Meraki dashboard.\"</p><p class=\"\">For Cuervo - and Cisco's Country Digital Acceleration program - supporting Ignite's effort to bring Hayla to market is a great opportunity. CDA's mission is to use technology for positive transformation around the world (in more than 50 countries so far), and Hayla is a perfect fit.</p><p class=\"\">\"We're all about using technology to address challenges and doing it in a way that benefits society,\" Cuervo said. \"Hayla is significant at an individual level, but also at a national and global scale. In Canada and other countries, populations are aging, increasing the demand for social services, while the number of caregivers is shrinking. This solution enables caregivers to be more effective while improving the quality of life for those in need. For us, it's a perfect combination of technology excellence and real-world, positive impact.\"</p><p class=\"\">View original content here.</p><p class=\"\">View additional multimedia and more ESG storytelling from Cisco Systems on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: Cisco Systems</p><p class=\"\">Website: https://www.3blmedia.com/profiles/cisco-systems</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Cisco Systems</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS4Jdr9a:0/",
            "pub_date": "2025-02-04 22:20:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308905:0",
            "title": "Evercore ISI Adjusts Genuine Parts Price Target to $130 From $155",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Genuine Parts  has an average rating of overweight and mean price target of $131.89, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308905:0/",
            "pub_date": "2025-02-04 22:20:12",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA54XW8S:0",
            "title": "Blüm Holdings Moves Forward with Binding LOI for Key Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Blum Holdings Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BLÜM HOLDINGS MOVES FORWARD WITH BINDING LOI FOR KEY ACQUISITION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA54XW8S:0-bl-m-holdings-moves-forward-with-binding-loi-for-key-acquisition/",
            "pub_date": "2025-02-04 22:20:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007145:0",
            "title": "Global Commodities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Commodities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0910 ET - Oil futures are lower as China retaliates against U.S. tariffs with duties on U.S. exports including oil and LNG, to take effect Feb. 10. The tariff is particularly negative for WTI, says TP ICAP's Scott Shelton in a note. \"I would assume with a $7 tax roughly, that arb is firmly shut and WTI will have to go elsewhere in the next few months as we go into turnarounds.\" U.S. refineries reduce their crude use during the maintenance season, leading to builds in U.S. crude stocks. WTI is down 2.7% at $71.16 a barrel. Brent is 1.8% lower at $74.61 a barrel. (anthony.harrup@wsj.com)</p><p class=\"\">0853 ET - ADM falls 2% premarket after saying it expects an uncertain 2025 and posts a 6% decline in sales for the quarter ending Dec. 31 compared with a year ago, and below analyst estimates. ADM says operating profit at its crushing subsegment, which turns oilseeds into oils and biofuels, was 46% lower versus the prior year quarter, because of higher manufacturing costs among other issues. \"With softer market conditions and policy uncertainty around the world going into 2025, we are focused on improving our operational performance, accelerating costs savings, and simplifying our portfolio,\" says ADM CEO Juan Luciano in a statement. (patrick.thomas@wsj.com)</p><p class=\"\">0829 ET - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">0631 ET - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">0509 ET - Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p><p class=\"\">0444 ET - Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0426 ET - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">0359 ET - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">0321 ET - OMV delivered positive fourth-quarter results underlined by a better-than-expected dividend per share of 4.75 euros, Jefferies analysts Giacomo Romeo and Kai Ye Loh write. The Austrian oil and gas company's net income exceeded expectations by 14% due to a lower-than-expected tax rate and net financial result, they write. Despite reporting profit in-line with expectations, quarterly cash-flow generation was 10% lower than expected, they add. The company's 2025 guidance is now for lower-than-expected capital expenditure of 3.5 billion euros and weak production of 300,000 barrels of oil-equivalent a day, the analysts write. Shares fall 0.9% to 38.84 euros. (adam.whittaker@wsj.com)</p><p class=\"\">0310 ET - Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research's Joseph Chai says in a research report. Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800/oz level, leaving its bullish bias intact, Chai says. The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900/oz level, Chai says. The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, the analyst adds. Spot gold is 0.1% lower at $2,812.28/oz. (ronnie.harui@wsj.com)</p><p class=\"\">2213 ET - Palm oil prices fall in early Asian trading, tracking weakness in soybean oil on the Chicago Board of Trade, says David Ng, a trader at Kuala Lumpur-based Iceberg X. However, the price weakness won't persist, he adds, citing expectations for weak palm oil output. CPO production for Jan. 1-31 is estimated to have fallen 15% on month, according to Malaysia's Southern Peninsular Palm Oil Millers Association. Ng pegs CPO support at 4,250 ringgit/ton and resistance at 4,400 ringgit/ton. The Bursa Malaysia Derivatives contract for April delivery is 43 ringgit lower at 4,324 ringgit/ton. (yingxian.wong@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007145:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX42ZFZ4:0",
            "title": "Fatboy Bean Bag Chairs: The Ultimate Blend of Comfort, Style, and Durability",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MONTREAL, Feb.  04, 2025  (GLOBE NEWSWIRE) — Fatboy, the global icon in casual furniture, offers a premium collection of bean bag chairs designed for both indoor and outdoor relaxation. With an unwavering commitment to quality and innovation, Fatboy's bean bags and ottomans are filled and manufactured in Canada, ensuring a product that meets the highest standards of comfort and durability for Canadian homes and lifestyles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A Collection for Every Space</strong></p><p class=\"\">Whether you're looking to create a cozy indoor lounge or a stylish outdoor retreat, Fatboy has a bean bag chair for every setting. From the classic Original bean bag to the compact Junior, the versatile Slim, and the durable outdoor-friendly Buggle-Up, Fatboy’s collection offers a variety of shapes, sizes, and textures to suit any space.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Premium Fabrics for Maximum Comfort</strong></p><p class=\"\">Fatboy’s bean bag chairs are available in an exclusive selection of high-quality fabrics, each crafted for specific needs:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nylon</strong> – A durable and stainproof option, perfect for vibrant and easy-to-maintain indoor seating.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Stonewashed Cotton</strong> – A soft, natural fabric with a vintage-inspired look, offering timeless comfort and a relaxed aesthetic.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Olefin</strong> – A UV-resistant, water-repellent material ideal for outdoor use, built to withstand the elements.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Velvet</strong> – Luxuriously soft and made from recycled polyester, adding a touch of elegance to any interior.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Teddy &amp; Sherpa</strong> – Ultra-plush fabrics designed for cozy indoor lounging with a warm, inviting feel.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Corduroy</strong> – A stylish, textured option that adds depth and sophistication to any space.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Mingle</strong> – A durable woven bouclé fabric with a 100,000 Martindale rating, providing both beauty and longevity.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Polyester</strong> – A versatile, strong fabric that is easy to clean and perfect for both indoor and outdoor relaxation.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Proudly Made for Canada</strong></p><p class=\"\">Fatboy is a Dutch design brand known for its bold and innovative approach to casual furniture. While its roots are in the Netherlands, Fatboy's bean bag chairs and ottomans are filled and manufactured in Canada for the Canadian market, ensuring quality craftsmanship, shorter lead times, and a commitment to local production. With a focus on sustainable materials and innovative designs, Fatboy continues to redefine casual seating with products that are as stylish as they are functional.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Experience the Fatboy Difference</strong></p><p class=\"\">From living rooms to patios, Fatboy’s products elevate comfort and design in any space. Discover the full collection and find your perfect bean bag chair match today.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Fatboy</strong></p><p class=\"\">Fatboy is a global leader in modern casual furniture, known for its bold designs, high-quality materials, and innovative approach to comfort. Since launching the Original bean bag, Fatboy has expanded its product range to include furniture, lighting, and accessories that redefine contemporary living.</p><p class=\"\">For more information, interviews, or high-resolution images, please contact:</p><p class=\"\">Fatboy Canada</p><p class=\"\">Email: hello@fatboycanada.com</p><p class=\"\">Website: fatboycanada.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX42ZFZ4:0-fatboy-bean-bag-chairs-the-ultimate-blend-of-comfort-style-and-durability/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007143:0",
            "title": "Bristol-Myers Squibb Is Maintained at Neutral by Cantor Fitzgerald",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>Bristol-Myers Squibb Price Target Raised to $55.00/Share From $50.00 by Cantor Fitzgerald</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007143:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007152:0",
            "title": "Berry Global Group Sees FY25 Cash Flow From Ops of $1.125 B-$1.225 B >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007152:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007115:0",
            "title": "Berry Global Group Sees FY Adj EPS $6.10-Adj EPS $6.60 >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007115:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007116:0",
            "title": "Berry Global Group 1Q Sales $2.4B >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007116:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007119:0",
            "title": "Berry Global Group 1Q Net $14M >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007119:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007117:0",
            "title": "Berry Global Group 1Q EPS 69c >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007117:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115_20250204007118:0",
            "title": "Berry Global Group 1Q Adj EPS $1.09 >BERY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115_20250204007118:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007115:0",
            "title": "Berry Announces First Quarter 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group Sees FY Adj EPS $6.10-Adj EPS $6.60 &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Sales $2.4B &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q EPS 69c &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Adj EPS $1.09 &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group 1Q Net $14M &gt;BERY<br/><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>Press Release: Berry Announces First Quarter 2025 Results</p><p class=\"\">Berry Announces First Quarter 2025 Results</p><p class=\"\">Strategy Update</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Successful completion of the spin of Berry's Health, Hygiene and   Specialties Global Nonwovens and Films Business ('HHNF') and merger with   Glatfelter Corporation in November     </li><li class=\"listItem-bmN0_SHH\">Entered into a definitive merger agreement with Amcor, to combine, in   an all-stock transaction and expected to be completed in the middle of   calendar 2025     </li><li class=\"listItem-bmN0_SHH\">Announcement of the sale of our Tapes business; Closed in early   February 2025   </li></ul><p class=\"\">First Quarter Highlights</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">GAAP: Net sales of $2.4 billion; Operating income of $152 million;   Earnings per share of $0.69     </li><li class=\"listItem-bmN0_SHH\">Non-GAAP: Operating EBITDA of $378 million; Adjusted earnings per share   of $1.09     </li><li class=\"listItem-bmN0_SHH\">Organic volume growth of +2%     </li><li class=\"listItem-bmN0_SHH\">Operating EBITDA growth of +4% and Adjusted EPS growth of +5%     </li><li class=\"listItem-bmN0_SHH\">Reaffirmed fiscal year 2025 guidance   </li></ul><p class=\"\">EVANSVILLE, Ind.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Kevin Kwilinski, Berry's CEO, stated, \"We had a very busy quarter to start fiscal 2025, continuing our transition into a more streamlined and focused provider of consumer packaging solutions. Our recent strategic actions, including the completion of the spin-off/merger of our HHNF business, announcement of the expected combination with Amcor, and the sale of our Tapes business, mark significant milestones in our journey. These actions, combined with our commitment to innovation and sustainability, position us for sustainable long-term growth. I want to also acknowledge the hard work, dedication and focus by all of our team members around the world during these eventful times.</p><p class=\"\">Financially, we had a strong start to fiscal 2025, delivering 2% organic volume growth and a 5% increase in adjusted earnings per share compared to the prior year. Our intentional focus on fast-moving consumer goods will lead to more predictable earnings growth and cash generation, providing stability and resilience to our business. We are confident that our strategic investments and operational excellence will continue to enhance value for our shareholders.</p><p class=\"\">Today we are reaffirming our guidance and, looking ahead into fiscal 2025, we anticipate continued low-single digit volume growth, as demonstrated over the last three quarters, along with strong adjusted free cash flow. As we move forward, we will deliver enhanced value to our shareholders by pursuing three key strategic objectives: accelerating organic growth, increasing margins through improved operations, and deleveraging.\"</p><p class=\"\">Key Financials (1)</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                          December Quarter     Reported <br/>GAAP results               2024       2023     &lt;DELTA&gt;% <br/>----------------------  -----------  -------  ---------- <br/>Net sales                $    2,385  $ 2,333     2% <br/>Operating income                152      165    (8%) <br/>EPS (diluted)                  0.69     0.55    25% <br/>                            -------   ------  ----   --- <br/> <br/>                          December Quarter     Reported    Comparable <br/>Adjusted non-GAAP <br/>results                    2024       2023     &lt;DELTA&gt;%     &lt;DELTA&gt;% <br/>----------------------  -----------  -------  ----------  ------------ <br/>Operating EBITDA                378      365     4%          4% <br/>Adjusted EPS (diluted)         1.09     1.04     5%          5% <br/>                                                          ---- ----- <br/> <br/> <br/>(1)    Adjusted non-GAAP results exclude items not considered to be ongoing <br/>       operations. In addition, comparable change % excludes the impacts of <br/>       foreign currency, acquisitions, and recent divestitures. Further <br/>       details related to non-GAAP measures and reconciliations can be found <br/>       under our \"Non-GAAP Financial Measures and Estimates\" section and in <br/>       reconciliation tables in this release. In millions of USD, except per <br/>       share data. <br/> </pre><p class=\"\">Financial Results — First Quarter 2025</p><p class=\"\">Consolidated Overview</p><p class=\"\">Net sales increased 2%, to $2.4 billion, primarily attributed to organic volume growth of 2%, increased selling prices, and current year acquisitions, partially offset by prior year divestiture sales. All three segments delivered positive organic volume growth.</p><p class=\"\">The operating income decrease is primarily attributed to an increase in business integration costs primarily associated with the proposed merger with Amcor. These costs were partially offset by 2% organic volume growth and a $16 million favorable impact from price cost spread.</p><p class=\"\">Consumer Packaging — International</p><p class=\"\">Net sales decreased by 3% compared to the prior year, coming in at $885 million. The decrease was primarily attributed to prior year divestiture sales, partially offset by 1% organic volume growth and the impact of higher selling prices. The organic volume increase was primarily driven by emerging market growth and share gains offsetting a weaker demand environment in Europe.</p><p class=\"\">The operating income change is primarily attributed to an increase in general administrative and business integration costs, partially offset by a $15 million favorable impact from price cost spread.</p><p class=\"\">Consumer Packaging — North America</p><p class=\"\">Net sales increased 10% to $769 million primarily driven by 4% organic volume growth, along with higher selling prices and a 2% benefit from acquisition sales. The volume growth was broad based and led by our food, beverage, and foodservice markets.</p><p class=\"\">The operating income change is primarily attributed to an increase in general administrative and business integration costs, offset by 4% organic volume growth.</p><p class=\"\">Flexibles</p><p class=\"\">Net sales increased by 2%, reaching $731 million, primarily driven by increased selling prices and organic volume growth of 1%. The organic volume growth is primarily driven by the continued recovery in European industrial markets.</p><p class=\"\">The operating income decrease is primarily attributed to an increase in general administrative and business integration costs, partially offset by 1% organic volume growth.</p><p class=\"\">Cash Returns to Shareholders</p><p class=\"\">Berry generates significant cash flow and is committed to returning capital to shareholders. This annual cash flow provides substantial capacity to simultaneously reinvest in the business for organic growth, pay down debt, pursue bolt-on acquisitions, and return cash to shareholders through a compelling dividend as well as share repurchases. We expect to further reduce leverage in fiscal 2025, while also returning cash to shareholders during the year, subject to market conditions, available cash on hand and cash needs, overall financial condition, and other factors considered relevant by our Board of Directors.</p><p class=\"\">Dividend and Share Repurchases</p><p class=\"\">As previously announced, Berry's Board of Directors declared a quarterly cash dividend of $0.31 per share payable on March 17, 2025 to stockholders of record as of March 3, 2025. Berry did not repurchase any shares during the first fiscal quarter of fiscal 2025.</p><p class=\"\">Fiscal Year 2025 Guidance - Reaffirmed</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Adjusted earnings per share range of $6.10-$6.60 (Fiscal 2024   comparable $6.00)     </li><li class=\"listItem-bmN0_SHH\">Cash flow from operations of $1.125-$1.225 billion; free cash flow of   $600-$700 million     </li><li class=\"listItem-bmN0_SHH\">Committed to further debt reduction   </li></ul><p class=\"\">Due to the pending transaction with Amcor plc, the Company will not host a quarterly conference call to review its first quarter results. We have posted this release and a presentation regarding our first fiscal 2025 quarter on the Company's website at https://ir.berryglobal.com/financials.</p><p class=\"\">About Berry</p><p class=\"\">At Berry Global Group, Inc. , we create innovative packaging solutions that we believe make life better for people and the planet. We do this every day by leveraging our unmatched global capabilities, sustainability leadership, and deep innovation expertise to serve customers of all sizes around the world. Harnessing the strength in our diversity and industry-leading talent of over 34,000 global employees across more than 200 locations, we partner with customers to develop, design, and manufacture innovative products with an eye toward the circular economy. The challenges we solve and the innovations we pioneer benefit our customers at every stage of their journey. For more information, visit our website, or connect with us on LinkedIn or X.</p><p class=\"\">Non-GAAP Financial Measures and Estimates</p><p class=\"\">This press release includes non-GAAP financial measures such as operating EBITDA, Adjusted operating income, Adjusted earnings per share (or adjusted EPS), free cash flow, and comparable basis net sales, comparable adjusted EPS and comparable operating EBITDA. A reconciliation of these non-GAAP financial measures to comparable measures determined in accordance with accounting principles generally accepted in the United States of America (GAAP) is set forth at the end of this press release. Fiscal year 2025 cash flow from operations, free cash flow and adjusted earnings per share guidance excludes the impact from the Amcor/Berry combination transaction. Information reconciling forward-looking adjusted EPS and free cash flow is not provided because such information is not available without unreasonable effort due to the high variability, complexity, and low visibility with respect to certain items, including debt refinancing activity or other non-comparable items. These items are uncertain, depend on various factors, and could be material to our results computed in accordance with U.S. GAAP.</p><p class=\"\">Important Information for Investors and Shareholders This communication does not constitute an offer to sell or the solicitation of an offer to buy or exchange any securities or a solicitation of any vote or approval in any jurisdiction, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction. It does not constitute a prospectus or prospectus equivalent document. No offering or sale of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the US Securities Act of 1933, as amended, and otherwise in accordance with applicable law.</p><p class=\"\">In connection with the proposed transaction between Berry Global Group, Inc. (\"Berry\") and Amcor plc (\"Amcor\"), on January 13, 2025, Amcor filed with the Securities and Exchange Commission (the \"SEC\") a registration statement on Form S-4, as amended on January 21, 2025, containing a joint proxy statement of Berry and Amcor that also constitutes a prospectus of Amcor (the \"Joint Proxy Statement/Prospectus\"). The registration statement was declared effective by the SEC on January 23, 2025, and Berry and Amcor commenced mailing the Joint Proxy Statement/Prospectus to their respective shareholders on or about January 23, 2025. This document is not a substitute for the Joint Proxy Statement/Prospectus or any other document which Berry or Amcor may file with the SEC. INVESTORS AND SECURITY HOLDERS OF BERRY AND AMCOR ARE URGED TO READ THE JOINT PROXY STATEMENT/PROSPECTUS AND ANY OTHER DOCUMENTS FILED OR THAT WILL BE FILED WITH THE SEC, AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THESE DOCUMENTS, CAREFULLY AND IN THEIR ENTIRETY BECAUSE THEY CONTAIN OR WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION AND RELATED MATTERS. Investors and security holders may obtain free copies of the registration statement and the Joint Proxy Statement/Prospectus and other documents filed with the SEC by Berry or Amcor through the website maintained by the SEC at http://www.sec.gov. Copies of the documents filed with the SEC by Berry are available free of charge on Berry's website at berryglobal.com under the tab \"Investors\" and under the heading \"Financials\" and subheading \"SEC Filings.\" Copies of the documents filed with the SEC by Amcor are available free of charge on Amcor's website at amcor.com under the tab \"Investors\" and under the heading \"Financial Information\" and subheading \"SEC Filings.\"</p><p class=\"\">Certain Information Regarding Participants</p><p class=\"\">Berry, Amcor and their respective directors and executive officers may be considered participants in the solicitation of proxies from the shareholders of Berry and Amcor in connection with the proposed transaction. Information about the directors and executive officers of Berry is set forth in its Annual Report on Form 10-K for the year ended September 28, 2024, which was filed with the SEC on November 26, 2024, and its proxy statement for its 2025 annual meeting, which was filed with the SEC on January 7, 2025. Information about the directors and executive officers of Amcor is set forth in its Annual Report on Form 10-K for the year ended June 30, 2024, which was filed with the SEC on August 16, 2024, its proxy statement for its 2024 annual meeting, which was filed with the SEC on September 24, 2024 and its Current Report on Form 8-K, which was filed with the SEC on January 6, 2025. To the extent holdings of Berry's or Amcor's securities by its directors or executive officers have changed since the amounts set forth in such filings, such changes have been or will be reflected on Initial Statements of Beneficial Ownership on Form 3 or Statements of Beneficial Ownership on Form 4 filed with the SEC. Information about the directors and executive officers of Berry and Amcor, including a description of their direct or indirect interests, by security holdings or otherwise, and other information regarding the potential participants in the proxy solicitations, which may be different than those of Berry's stockholders and Amcor's shareholders generally, are contained in the Joint Proxy Statement/Prospectus and other relevant materials to be filed with the SEC regarding the proposed transaction. You may obtain these documents free of charge through the website maintained by the SEC at http://www.sec.gov and from Berry's or Amcor's website as described above.</p><p class=\"\">Cautionary Statement Regarding Forward-Looking Statements</p><p class=\"\">This communication contains certain statements that are \"forward-looking statements\" within the meaning of Section 27A of the Securities Act and Section 21E of the Exchange Act. Some of these forward-looking statements can be identified by words like \"anticipate,\" \"approximately, \" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"outlook,\" \"plan,\" \"potential,\" \"possible,\" \"predict,\" \"project,\" \"target,\" \"seek,\" \"should,\" \"will,\" or \"would,\" the negative of these words, other terms of similar meaning or the use of future dates. Such statements, including projections as to the anticipated benefits of the proposed transaction, the impact of the proposed transaction on Berry's and Amcor's business and future financial and operating results and prospects, the amount and timing of synergies from the proposed transaction, the terms and scope of the expected financing in connection with the proposed transaction, the aggregate amount of indebtedness of the combined company following the closing of the proposed transaction and the closing date for the proposed transaction, are based on the current estimates, assumptions and projections of the management of Berry and Amcor, and are qualified by the inherent risks and uncertainties surrounding future expectations generally, all of which are subject to change. Actual results could differ materially from those currently anticipated due to a number of risks and uncertainties, many of which are beyond Berry's and Amcor's control. None of Berry, Amcor or any of their respective directors, executive officers, or advisors, provide any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements will actually occur, or if any of them do occur, what impact they will have on the business, results of operations or financial condition of Berry or Amcor. Should any risks and uncertainties develop into actual events, these developments could have a material adverse effect on Berry's and Amcor's businesses, the proposed transaction and the ability to successfully complete the proposed transaction and realize its expected benefits. Risks and uncertainties that could cause results to differ from expectations include, but are not limited to, the occurrence of any event, change or other circumstance that could give rise to the termination of the merger agreement; the risk that the conditions to the completion of the proposed transaction (including shareholder and regulatory approvals) are not satisfied in a timely manner or at all; the risks arising from the integration of the Berry and Amcor businesses; the risk that the anticipated benefits of the proposed transaction may not be realized when expected or at all; the risk of unexpected costs or expenses resulting from the proposed transaction; the risk of litigation related to the proposed transaction; the risks related to disruption of management's time from ongoing business operations as a result of the proposed transaction; the risk that the proposed transaction may have an adverse effect on the ability of Berry and Amcor to retain key personnel and customers; general economic, market and social developments and conditions; the evolving legal, regulatory and tax regimes under which Berry and Amcor operate; potential business uncertainty, including changes to existing business relationships, during the pendency of the proposed transaction that could affect Berry's and/or Amcor's financial performance; and other risks and uncertainties identified from time to time in Berry's and Amcor's respective filings with the SEC, including the Joint Proxy Statement/Prospectus to be filed with the SEC in connection with the proposed transaction. While the list of risks presented here is, and the list of risks presented in the Joint Proxy Statement/Prospectus will be, considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties, and other risks may present significant additional obstacles to the realization of forward-looking statements. Forward-looking statements included herein are made only as of the date hereof and neither Berry nor Amcor undertakes any obligation to update any forward-looking statements, or any other information in this communication, as a result of new information, future developments or otherwise, or to correct any inaccuracies or omissions in them which become apparent. All forward-looking statements in this communication are qualified in their entirety by this cautionary statement.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                         Berry Global Group, Inc. <br/>               Consolidated Statements of Income (Unaudited) <br/> <br/>                                             Quarterly Period Ended <br/>                                       ----------------------------------- <br/>(in millions of USD, except per share    December 28,       December 30, <br/>data)                                         2024              2023 <br/>-------------------------------------  -----------------  ---------------- <br/> <br/>Net sales                                $        2,385    $      2,333 <br/>Costs and expenses: <br/>   Cost of goods sold                             1,929           1,903 <br/>   Selling, general and <br/>    administrative                                  223             206 <br/>   Amortization of intangibles                       46              47 <br/>   Business consolidation and other <br/>    activities                                       35              12 <br/>-------------------------------------  ---  -----------       --------- <br/>Operating income                                    152             165 <br/>Other expense (income)                              (22)             15 <br/>Interest expense, net                                75              71 <br/>-------------------------------------  ---  -----------       --------- <br/>Income before income taxes                           99              79 <br/>Income tax expense                                   18              14 <br/>-------------------------------------  ---  -----------       --------- <br/>Net income from continuing operations                81              65 <br/>Discontinued operations, net of tax                 (67)             (6) <br/>-------------------------------------  ---  -----------       --------- <br/>Net income                               $           14    $         59 <br/>-------------------------------------  ---  -----------       --------- <br/> <br/>Net income per share: <br/>Basic - continuing operations            $         0.70    $       0.56 <br/>Basic - discontinued operations                   (0.58)          (0.05) <br/>-------------------------------------  ---  -----------       --------- <br/>   Total basic net income per share      $         0.12    $       0.51 <br/> <br/>Diluted - continuing operations          $         0.69    $       0.55 <br/>Diluted - discontinued operations                 (0.57)          (0.05) <br/>-------------------------------------  ---  -----------       --------- <br/>   Total diluted net income per share    $         0.12    $       0.50 <br/> <br/> <br/>Outstanding weighted average shares <br/>(in millions) <br/>Basic                                             115.3           115.6 <br/>Diluted                                           118.2           118.3 <br/>-------------------------------------  ---  -----------       --------- <br/> <br/> <br/>             Condensed Consolidated Balance Sheets (Unaudited) <br/> <br/>                                              December 28,    September 28, <br/>(in millions of USD)                              2024             2024 <br/>-------------------------------------------  --------------  --------------- <br/>Cash and cash equivalents                     $       1,181   $          865 <br/>Accounts receivable                                   1,089            1,269 <br/>Inventories                                           1,328            1,371 <br/>Other current assets                                    501              184 <br/>Current assets of discontinued operations                 -              885 <br/>Property, plant, and equipment                        3,483            3,627 <br/>Goodwill, intangible assets, and other <br/> long-term assets                                     5,955            6,362 <br/>Non-current assets of discontinued <br/> operations                                               -            2,050 <br/>-------------------------------------------      ----------      ----------- <br/>Total assets                                  $      13,577   $       16,613 <br/>-------------------------------------------      ----------      ----------- <br/>Current liabilities, excluding current debt           1,809            2,451 <br/>Current liabilities of discontinued <br/> operations                                               -              411 <br/>Current and long-term debt                            8,129            8,315 <br/>Other long-term liabilities                           1,433            1,683 <br/>Non-current liabilities of discontinued <br/> operations                                               -              145 <br/>Stockholders' equity                                  2,206            3,608 <br/>-------------------------------------------      ----------      ----------- <br/>Total liabilities and stockholders' equity    $      13,577   $       16,613 <br/>-------------------------------------------      ----------      ----------- <br/> <br/> <br/>       Condensed Consolidated Statements of Cash Flows (Unaudited) <br/> <br/>                                              Quarterly Period Ended <br/>                                        ---------------------------------- <br/>                                          December 28,      December 30, <br/>(in millions of USD)                          2024              2023 <br/>--------------------------------------  ----------------  ---------------- <br/>Cash flows from operating activities: <br/>Net income                                $          14    $         59 <br/>Income (loss) from discontinued <br/> operations                                         (67)             (6) <br/>--------------------------------------  ---  ----------       --------- <br/>Income from continuing operations                    81              65 <br/>Adjustments to reconcile net cash from <br/>operating activities: <br/>   Depreciation                                     124             123 <br/>   Amortization of intangibles                       46              47 <br/>   Non-cash interest, net                           (12)            (20) <br/>   Share-based compensation expense                  21              18 <br/>   Deferred income tax                              (28)            (16) <br/>   Settlement of derivatives                          -              19 <br/>   Other non-cash operating <br/>    activities, net                                 (23)             14 <br/>   Changes in working capital                      (581)           (418) <br/>--------------------------------------  ---  ----------       --------- <br/>      Operating cash used in <br/>       continuing operations                       (372)           (168) <br/>      Operating cash used in <br/>       discontinued operations                     (106)            (31) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from operating <br/>       activities                                  (478)           (199) <br/> <br/>Cash flows from investing activities: <br/>Additions to property, plant, and <br/> equipment, net                                    (134)           (168) <br/>Acquisitions of business and other                  (48)              - <br/>--------------------------------------  ---  ----------       --------- <br/>      Investing cash used in <br/>       continuing operations                       (182)           (168) <br/>      Investing cash used in <br/>       discontinued operations                       (9)            (15) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from investing <br/>       activities                                  (191)           (183) <br/> <br/>Cash flows from financing activities: <br/>Repayments on long-term borrowings                 (106)         (1,858) <br/>Cash transferred to Magnera related to <br/> spin, net                                         (624)              - <br/>Proceeds from long-term borrowings                1,585           1,550 <br/>Repurchase of common stock                            -              (7) <br/>Proceeds from issuance of common stock               19              13 <br/>Dividends paid                                      (36)            (36) <br/>Debt financing costs and other                      (39)             (4) <br/>--------------------------------------  ---  ----------       --------- <br/>      Net cash from financing <br/>       activities                                   799            (342) <br/>--------------------------------------  ---  ----------       --------- <br/>Effect of currency translation on cash              (44)             28 <br/>--------------------------------------  ---  ----------       --------- <br/>Net change in cash and cash <br/> equivalents                                         86            (696) <br/>Cash and cash equivalents at beginning <br/> of period                                        1,095           1,203 <br/>--------------------------------------  ---  ----------       --------- <br/>      Cash and cash equivalents at end <br/>       of period                          $       1,181    $        507 <br/>--------------------------------------  ---  ----------       --------- <br/> <br/> <br/>    Segment and Supplemental Comparable Basis Information (Unaudited) <br/> <br/>                          Quarterly Period Ended December 28, 2024 <br/>                  -------------------------------------------------------- <br/>                                       Consumer <br/>                      Consumer         Packaging- <br/>(in millions of      Packaging -         North <br/>USD)                International       America      Flexibles     Total <br/>----------------  -----------------  -------------  -----------  --------- <br/>Net sales            $   885            $      769   $      731  $2,385 <br/> <br/>Operating income     $    28            $       59   $       65  $  152 <br/>Depreciation and <br/> amortization             78                    58           34     170 <br/>Business <br/> consolidation <br/> and other <br/> activities(1)            17                     9            9      35 <br/>Other non-cash <br/> charges                   8                     7            6      21 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/>Operating EBITDA     $   131            $      133   $      114  $  378 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/>                          Quarterly Period Ended December 30, 2023 <br/>----------------  -------------------------------------------------------- <br/>Reported net <br/> sales               $   916            $      699   $      718  $2,333 <br/>Foreign <br/> currency, <br/> acquisitions &amp; <br/> divestitures            (40)                   16            2     (22) <br/>----------------  ----  ----   ----  ----  -------      -------   ----- <br/>Comparable net <br/> sales (1)           $   876            $      715   $      720  $2,311 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/>Operating income     $    29            $       60   $       76  $  165 <br/>Depreciation and <br/> amortization             80                    57           33     170 <br/>Business <br/> consolidation <br/> and other <br/> activities                6                     5            1      12 <br/>Other non-cash <br/> charges                   6                     6            6      18 <br/>Foreign <br/> currency, <br/> acquisitions &amp; <br/> divestitures             (3)                    3            -       - <br/>----------------  ----  ----   ----  ----  -------      -------   ----- <br/>Comparable <br/> operating <br/> EBITDA (2)          $   118            $      131   $      116  $  365 <br/>----------------  ----  ----  -----  ----  -------      -------   ----- <br/> <br/> <br/>(1)    During the current quarter, the Company incurred $18 million of <br/>       transaction related activities associated with the proposed merger with <br/>       Amcor. <br/> <br/>(2)    The prior year comparable basis change excludes the impacts of foreign <br/>       currency, acquisitions, and divestitures. Further details related to <br/>       non-GAAP measures and reconciliations can be found under our \"Non-GAAP <br/>       Financial Measures and Estimates\" section or in reconciliation tables <br/>       in this release. <br/> <br/> <br/>Discontinued Operations (a) <br/> <br/>                                             Quarterly Period Ended <br/>                                     --------------------------------------- <br/>                                         December 28,         December 30, <br/>                                              2024                2023 <br/>-----------------------------------  ---------------------  ---------------- <br/>Net sales                               $         204         $      520 <br/> <br/>Cost of sales                                     179                476 <br/>Selling, general, and <br/> administrative                                     9                 29 <br/>Amortization of intangibles                         4                 13 <br/>Other income (expense), net                        79                 10 <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Operating loss                                    (67)                (8) <br/>Other non-operating items, net                      2                 (3) <br/>Interest expense, net                               1                  1 <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Loss before income taxes                          (70)                (6) <br/>Income tax (expense) benefit                        3                  - <br/>-----------------------------------  ----  ----------  ---  ---  ------- <br/>Discontinued operations, net of tax     $         (67)        $       (6) <br/> <br/> <br/>(a)    In connection with the HHNF transaction, this table summarizes the <br/>       results of discontinued operations for the HHNF business. <br/> <br/> <br/>                   Reconciliation of Non-GAAP Measures <br/> <br/>Reconciliation of Net income and earnings per share (EPS) to adjusted <br/>operating income, operating earnings before interest, tax, depreciation <br/>and amortization (EBITDA), and adjusted earnings per share (adjusted EPS) <br/> <br/>(in millions of USD, except per share data amounts) <br/> <br/>                                             Quarterly Period Ended <br/>                                       ----------------------------------- <br/>                                         December 28,       December 30, <br/>                                              2024              2023 <br/>-------------------------------------  -----------------  ---------------- <br/>Net income attributable to Berry <br/> Global Group, Inc.                        $         14    $         59 <br/>Discontinued operations, net of tax                 (67)             (6) <br/>-------------------------------------  -----  ---------       --------- <br/>Net income from continuing operations      $         81    $         65 <br/>   Add: other expense (income)                      (22)             15 <br/>   Add: interest expense                             75              71 <br/>   Add: income tax expense                           18              14 <br/>-------------------------------------  -----  ---------       --------- <br/>Operating income                           $        152    $        165 <br/> <br/>   Add: business consolidation and <br/>    other activities                                 35              12 <br/>   Add: other non-cash charges (1)                   21              18 <br/>-------------------------------------  -----  ---------       --------- <br/>Adjusted operating income (3)              $        208    $        195 <br/> <br/>   Add: depreciation                                124             123 <br/>   Add: amortization of intangibles                  46              47 <br/>-------------------------------------  -----  ---------       --------- <br/>Operating EBITDA (3)                       $        378    $        365 <br/>-------------------------------------  -----  ---------       --------- <br/> <br/>   Net income per diluted share            $       0.69    $       0.55 <br/>   Other expense (income)                         (0.19)           0.13 <br/>   Business consolidation and other <br/>    activities                                     0.30            0.10 <br/>   Amortization of intangibles from <br/>    acquisitions (2)                               0.39            0.40 <br/>   Income tax impact on items above               (0.10)          (0.14) <br/>   Foreign currency, acquisitions, <br/>   and divestitures                                                   - <br/>-------------------------------------  -----------------      --------- <br/>Adjusted net income per diluted share <br/> (3)                                       $       1.09    $       1.04 <br/>-------------------------------------  -----  ---------       --------- <br/> <br/> <br/>   Non-U.S. GAAP Free Cash Flow <br/>   (continuing operations): <br/>   Cash flow from operating <br/>    activities                             $       (372)   $       (168) <br/>   Additions to property, plant, and <br/>    equipment (net)                                (134)           (168) <br/>-------------------------------------  -----  ---------       --------- <br/>   Non-U.S. GAAP Free Cash Flow <br/>    (continuing operations)                $       (488)   $       (336) <br/>-------------------------------------  -----  ---------       --------- <br/> <br/> <br/>                                              Estimated Fiscal 2025 <br/>                                       ----------------------------------- <br/>   Cash flow from operating <br/>    activities                                    $1,125-$1,225 <br/>   Net additions to property, plant, <br/>    and equipment                                     (525) <br/>-------------------------------------  ----------------------------------- <br/>Free cash flow (3)                                  $600-$700 <br/>-------------------------------------  ----------------------------------- <br/> <br/> <br/>(1)    Other non-cash charges are primarily stock compensation expense <br/> <br/>(2)    Amortization of intangibles from acquisition are added back to better <br/>       align our calculation of adjusted EPS with peers. <br/> <br/>(3)    Supplemental financial measures that are not required by, or presented <br/>       in accordance with, accounting principles generally accepted in the <br/>       United States (\"GAAP\"). These non-GAAP financial measures should not be <br/>       considered as alternatives to operating or net income or cash flows <br/>       from operating activities, in each case determined in accordance with <br/>       GAAP. Organic sales growth and comparable basis measures exclude the <br/>       impact of currency translation effects and acquisitions. These non-GAAP <br/>       financial measures may be calculated differently by other companies, <br/>       including other companies in our industry, limiting their usefulness as <br/>       comparative measures. Berry's management believes that adjusted net <br/>       income and other non-GAAP financial measures are useful to our <br/>       investors because they allow for a better period-over-period comparison <br/>       of operating results by removing the impact of items that, in <br/>       management's view, do not reflect our core operating performance. <br/> <br/>       We define \"free cash flow\" as cash flow from operating activities, less <br/>       net additions to property, plant, and equipment. We believe free cash <br/>       flow is useful to an investor in evaluating our liquidity because free <br/>       cash flow and similar measures are widely used by investors, securities <br/>       analysts, and other interested parties in our industry to measure a <br/>       company's liquidity. We also believe free cash flow is useful to an <br/>       investor in evaluating our liquidity as it can assist in assessing a <br/>       company's ability to fund its growth through its generation of cash. <br/> <br/>       Adjusted EBITDA is used by our lenders for debt covenant compliance <br/>       purposes. We also use Adjusted operating income, Operating EBITDA, <br/>       adjusted EPS and comparable basis measures, among other measures, to <br/>       evaluate management performance and in determining performance-based <br/>       compensation. Operating EBITDA is a measure widely used by investors, <br/>       securities analysts, and other interested parties in our industry to <br/>       measure a company's performance. We also believe EBITDA and Adjusted <br/>       operating income are useful to an investor in evaluating our <br/>       performance without regard to revenue and expense recognition, which <br/>       can vary depending upon accounting methods. <br/> </pre><p class=\"\">(BERY-F)</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204633666/en/</p><p class=\"\">CONTACT:    Dustin Stilwell</p><p class=\"\">VP, Head of Investor Relations</p><p class=\"\">+1 (812) 306 2964</p><p class=\"\">ir@berryglobal.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:15 GMT) </strong>*Berry Global Group Sees FY25 Cash Flow From Ops of $1.125 B-$1.225 B &gt;BERY</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007115:0/",
            "pub_date": "2025-02-04 22:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX8F2s4b:0",
            "title": "Matterport and CAPTUR3D Partner to Recognize Digital Twin Innovation Around the World",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SUNNYVALE, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — Matterport, Inc. , a pioneer in digital twin technology and spatial data capture, is proud to sponsor the 2025 Digital Twins Awards (DTAs), powered by Matterport partner, CAPTUR3D.</p><p class=\"\">Now in its fourth year, the DTAs are a global stage for inspiring individuals and forward-thinking businesses to showcase their most engaging Matterport digital twins in 2024. From real estate to cultural preservation, the awards showcase the best and most impactful digital twin projects from over 170 countries worldwide. All Matterport users and partners—from developers to capture technicians and photographers—are invited to participate in one of the largest digital twin awards events in the world.</p><p class=\"\">“The Digital Twin Awards are a tribute to the expert skill and dedication within our global community who push the limits of creativity, technology, and digital transformation,\" said RJ Pittman, Chairman and CEO, Matterport. \"These awards inspire the next generation of ideas, showcasing how digital twins are unlocking a new era of possibilities for real-world spaces.\"</p><p class=\"\">This year’s award categories include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Best Digital Twin of 2024</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Arts &amp; Culture</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Education</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Real Estate</li><li class=\"listItem-bmN0_SHH\">Most Unique Use of Matterport</li><li class=\"listItem-bmN0_SHH\">Best Digital Twin for Historical Preservation</li><li class=\"listItem-bmN0_SHH\">NEW: Best Non Pro Series Device Scan (includes 360, smartphone, DSLR, and synthetic CGI)</li></ul><p class=\"\">Submissions are now open and will be accepted until February 28, 2025. Participants may submit one entry per category, with a panel of expert judges shortlisting the top five nominees in each. Winners will be selected by the judges and revealed on April 4, 2025 during the official announcement. The awards will also feature a public voting period from March 14-28, 2025, giving the global community an opportunity to celebrate their favorite projects. Winners across seven categories will receive Matterport hardware, accessories, and subscriptions, with prizes valued up to $6,300 USD and a total prize pool of $28,000 USD.</p><p class=\"\">For submission details and to participate in the 2025 Digital Twin Awards, please visit https://www.digitaltwinawards.com/2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Matterport </strong></p><p class=\"\">Matterport, Inc.  is leading the digital transformation of the built world. Our groundbreaking spatial data platform turns buildings into data to make nearly every space more valuable and accessible. Millions of buildings in more than 177 countries have been transformed into immersive Matterport digital twins to improve every part of the building lifecycle from planning, construction, and operations to documentation, appraisal and marketing. Learn more at matterport.com and browse a gallery of digital twins at matterport.com/discover.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact:</strong></p><p class=\"\">press@matterport.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Contact:</strong></p><p class=\"\">ir@matterport.com</p><p class=\"\">This press release was published by a CLEAR® Verified individual.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX8F2s4b:0-matterport-and-captur3d-partner-to-recognize-digital-twin-innovation-around-the-world/",
            "pub_date": "2025-02-04 22:15:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNE3Sj18l:0",
            "title": "College of Commercial Arbitrators Expands Mentorship Program to Foster Future Leaders in Commercial Arbitration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The College of Commercial Arbitrators (CCA), a leading professional organization dedicated to advancing excellence in commercial arbitration, is proud to announce the launch of the fourth year of its highly regarded mentorship initiative.</p><p class=\"\">AUSTIN, TX, Feb.  04, 2025  (GLOBE NEWSWIRE) — The College of Commercial Arbitrators (CCA), a leading professional organization dedicated to advancing excellence in commercial arbitration, is proud to announce the launch of the fourth year of its highly regarded mentorship initiative. Building on the success of previous years, the CCA is expanding its mentorship opportunities for two additional years to accommodate an increasing number of emerging arbitrators eager to refine their skills and deepen their expertise in commercial arbitration.</p><p class=\"\">The CCA Associates Mentorship Program provides a unique platform for less experienced, diverse arbitrators to benefit from the knowledge, mentorship, and networking opportunities offered by CCA Fellows. This initiative is designed to support individuals who have historically been underrepresented in the field of commercial arbitration, including women, people of color, and other historically disadvantaged groups to empower them to succeed and jumpstart their careers as commercial arbitrators.</p><p class=\"\">\"By pairing emerging, diverse arbitrators with seasoned experts, we are nurturing the leaders who will shape the future of the profession,” said Tyrone Holt, CCA Fellow, Past President and Co-Chair of the Associates Mentorship Program. “The success of the Program over the past three years underscores the growing demand for targeted mentorship in the commercial arbitration community.\"</p><p class=\"\">Following an increase in applicants over the program’s first three years, this year’s cohort is expected to attract even greater interest. The selected participants will embark on a two-year mentorship journey, running through 2027, which includes education, practical experience, and ongoing professional development.</p><p class=\"\">To be eligible for the program, applicants must meet the following criteria:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Active practice in the alternative dispute resolution fields</li><li class=\"listItem-bmN0_SHH\">Less than five years of experience as a commercial arbitrator</li><li class=\"listItem-bmN0_SHH\">A demonstrated commitment to learning and developing high-quality commercial arbitration skills</li></ul><p class=\"\">Arbitrators interested in applying for the 2025-2027 mentorship cycle can learn more and submit their applications by visiting <!-- -->https://www.ccarbitrators.org/cca-associates-program/.</p><p class=\"\">The application deadline is April 21, 2025, with selections announced on June 23, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About the College of Commercial Arbitrators (CCA)</strong></p><p class=\"\">Founded in 2001, the CCA is an exclusive, invitation-only organization that promotes excellence in commercial arbitration, both in the U.S. and internationally. CCA Fellows possess the professional training, experience, and judgment to handle the most complex and challenging arbitration assignments. By fostering collaboration, innovation, and thought leadership, CCA makes unique and significant contributions to the field of commercial dispute resolution. For more information or to find an arbitrator, visit www.ccarbitrators.org.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNE3Sj18l:0-college-of-commercial-arbitrators-expands-mentorship-program-to-foster-future-leaders-in-commercial-arbitration/",
            "pub_date": "2025-02-04 22:15:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PLXDE4193:0",
            "title": "BRIEF-Berry Global Group Q1 Adjusted EPS USD 1.09 Vs. IBES Estimate USD 0.97",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 04 (Reuters) - Berry Global Group Q1 EPS USD 0.69.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q1 sales USD 2,400 million vs. IBES estimate USD 2,345 million</li><li class=\"listItem-bmN0_SHH\">Q1 operating income USD 152 million vs. IBES estimate USD 211.9 million</li><li class=\"listItem-bmN0_SHH\">Q1 adjusted EBITDA USD 378 million vs. IBES estimate USD 368.1 million</li><li class=\"listItem-bmN0_SHH\">outlook FY free cash flow USD 600-700 million</li><li class=\"listItem-bmN0_SHH\">outlook FY adjusted EPS USD 6.1-6.6</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PLXDE4193:0-brief-berry-global-group-q1-adjusted-eps-usd-1-09-vs-ibes-estimate-usd-0-97/",
            "pub_date": "2025-02-04 22:15:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308852:0",
            "title": "Thermo Fisher Scientific Partners With X-ELIO on Renewable Energy Deal",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thermo Fisher Scientific  said Tuesday that it signed a 10-year virtual power purchase agreement with X-ELIO, designed to increase access to renewable electricity across pharmaceutical and healthcare supply chains. </p><p class=\"\">The medical device maker said the Lorca solar project is set to begein operations early next year and will involve three partners from the pharmaceutical and healthcare sectors. </p><p class=\"\">The company said its 73 megawatt share of the project will generate 150,000 megawatt-hours of renewable electricity per year, enough to power 40,500 European homes for a year.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308852:0/",
            "pub_date": "2025-02-04 22:09:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV118:0",
            "title": "Tilaknagar Industries Dec-Quarter Consol Net Profit 539.3 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tilaknagar Industries Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 539.3 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 8.05 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV118:0-tilaknagar-industries-dec-quarter-consol-net-profit-539-3-mln-rupees/",
            "pub_date": "2025-02-04 22:09:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308872:0",
            "title": "Sector Update: Tech Stocks Edge Higher Premarket Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Technology stocks were edging higher premarket Tuesday, with The Technology Select Sector SPDR Fund  and SPDR S&amp;P Semiconductor ETF  up 0.5%. </p><p class=\"\">Palantir Technologies  shares were up past 23% after the company reported higher Q4 adjusted earnings and revenue in addition to issuing Q1 and 2025 revenue outlook that surpassed analyst expectations. </p><p class=\"\">Spotify Technology  stock was over 8% higher after the company reported that it swung to Q4 earnings as revenue increased during the period. </p><p class=\"\">Gartner  shares were up more than 4% after the company posted higher Q4 adjusted earnings and revenue.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308872:0-sector-update-tech-stocks-edge-higher-premarket-tuesday/",
            "pub_date": "2025-02-04 22:09:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV043:0",
            "title": "Three Canadian Western Bank executives after National Bank takeover",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Three former Canadian Western Bank  executives will be leaving National Bank , the new parent company of the Alberta-based lender, following a C$5 billion ($3.47 billion) takeover, according to an internal memo seen by Reuters. </p><p class=\"\">The executives leaving the bank are CWB CEO Chris Fowler, who is retiring, Chief Risk Officer Carolina Parra and Stephen Murphy, who is the head of the commercial, personal and wealth business, according to a Jan. 30 memo by Fowler to CWB staff.</p><p class=\"\">Murphy's last day is April 30 and Parra's is Feb. 28. </p><p class=\"\">Fowler, whose retirement was also publicly announced on Monday, will continue as executive advisor to National Bank CEO Laurent Ferreira until April 30. </p><p class=\"\">CWB's CFO Matt Rudd will join National Bank's finance team and Jeff Wright, the head of client solutions and specialty business, will join the bank as the head of integration for the commercial team, the memo said. </p><p class=\"\">National Bank closed the deal on Monday following an approval from Canada's finance minister in December.   </p><p class=\"\">The deal gives National Bank, the largest bank in the province of Quebec, scope to expand in Western Canada, a region where CWB has grown its footprint over the past 37 years through a slew of acquisitions.</p><p class=\"\">CWB focuses on providing commercial banking, personal banking and wealth advisory services to small and medium-sized business owners. It has also expanded in Ontario through the opening of new branches. </p><p class=\"\">($1 = 1.4399 Canadian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV043:0-three-canadian-western-bank-executives-after-national-bank-takeover/",
            "pub_date": "2025-02-04 22:09:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}