{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_P8N3O506H:0",
            "title": "KKR Raises Tender Offer Price For Fuji Soft To 9,850 Yen From 9,451 Yen, Regulatory Filing Shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">KKR RAISES TENDER OFFER PRICE FOR FUJI SOFT  TO 9,850 YEN FROM 9,451 YEN, REGULATORY FILING SHOWS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KKR EXTENDS TENDER OFFER PERIOD FOR FUJI SOFT TO FEB 19, REGULATORY FILING SHOWS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_P8N3O506H:0-kkr-raises-tender-offer-price-for-fuji-soft-to-9-850-yen-from-9-451-yen-regulatory-filing-shows/",
            "pub_date": "2025-02-04 12:34:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463158:0",
            "title": "Humana Closes EUR25 Million Sale of Elderly Care Units in Finland",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Humana  said Monday it completed the sale of its elderly care units in Finland for 25 million euros. </p><p class=\"\">The transaction covered an operation that caters to 500 clients and employs 430 full-time staff. The Nordic care company said completion followed approval from the Finnish Competition Authority.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463158:0/",
            "pub_date": "2025-02-04 12:35:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012083:0",
            "title": "OpenAI to Jointly Develop AI Products With South Korean Tech Giant Kakao",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">ChatGPT creator OpenAI and South Korean mobile internet giant Kakao plan to jointly develop artificial-intelligence products for the local market.</p><p class=\"\">The companies said Tuesday that they plan to form a strategic partnership, under which Kakao will integrate OpenAI's technology for its products and services, including its widely used messaging app Kakao Talk, tailored to local users.</p><p class=\"\">Kakao said it will also deploy ChatGPT Enterprise, the version of ChatGPT aimed at large companies for business use, for its employees, and use OpenAI models to power its AI communication service Kanana, which Kakao describes as a \"user-friendly AI mate that delivers personalized, context-aware responses.\"</p><p class=\"\">\"We're excited to bring advanced AI to Kakao's millions of users and work together to integrate our technology into services that transform how Kakao's users communicate and connect,\" OpenAI Chief Executive Sam Altman said in a statement.</p><p class=\"\">Kakao CEO Chung Shin-a said the collaboration will help the South Korean company advance its AI efforts.</p><p class=\"\">The announcement was made at a joint press conference in Seoul on the back of Altman's visit to the country. Local media outlet Yonhap News Agency reported that he has met with SK Group Chairman Chey Tae-won, who was accompanied by SK Hynix CEO Kwak Noh-jung, to discuss possible collaborations in AI.</p><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012083:0/",
            "pub_date": "2025-02-04 12:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-03:newsml_ACSc4Hhca:0",
            "title": "Onco-Innovations Completes Acquisition of Inka Health to Accelerate AI-Driven Cancer Research and Drug Development",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">VANCOUVER, BC / ACCESS Newswire / February 3, 2025 / Onco-Innovations Limited (CSE:<strong class=\"root-Tkn6WL2y\">ONCO</strong>)(Frankfurt:<strong class=\"root-Tkn6WL2y\">W1H</strong>,WKN: <strong class=\"root-Tkn6WL2y\">A3EKSZ</strong>) (\"<strong class=\"root-Tkn6WL2y\">Onco</strong>\" or the \"<strong class=\"root-Tkn6WL2y\">Company</strong>\") is pleased to announce, further to its news release dated January 22, 2025, that it has completed the acquisition (the \"<strong class=\"root-Tkn6WL2y\">Acquisition</strong>\") of all of the outstanding share capital of Inka Health Corp. (\"<strong class=\"root-Tkn6WL2y\">Inka Health</strong>\"), a Canadian-based software company pioneering the use of advanced AI-driven analytics and real-world multimodal data to revolutionize clinical research and drug development. In consideration for the Acquisition, Onco has issued to the former holders of the Inka Health shares an aggregate of 1,775,147 common shares of the Company (\"<strong class=\"root-Tkn6WL2y\">Consideration Shares</strong>\"). All of the Consideration Shares are subject to resale restrictions whereby 10% will be released and tradeable four months from the closing date of the Acquisition (\"<strong class=\"root-Tkn6WL2y\">Closing Date</strong>\"), 15% of the remaining Consideration Shares will be released and tradeable within six months from the Closing Date, and a further 15% of the remaining amount will be released and tradeable every six months thereafter.</p><p class=\"\">By integrating Inka Health's (www.inkahealth.ai) cutting-edge AI-driven analytics and multimodal data capabilities, Onco aims to enhance its ability to accelerate cancer detection, precision oncology research, and drug development. Inka Health has developed the proprietary SynoGraph™ platform, which merges genomic, proteomic, and multimodal datasets to uncover deep insights into disease mechanisms, potentially enabling more personalized and effective treatment strategies. Inka Health's technology simulates precision-medicine clinical trials, offering the potential to significantly streamline late-stage drug discovery and clinical research by reducing both time and cost. Backed by a robust network of genomics partnerships and the expertise of Dr. Steven Jones-Head of Bioinformatics and Co-Director of the Genome Sciences Centre in Vancouver, as well as a Distinguished Scientist at the BC Cancer Research Institute1 -Inka Health's expertise and technology is expected to strengthen Onco's capabilities in precision oncology.</p><p class=\"\">Inka Health has built a strong track record of delivering innovative solutions in precision medicine, as evidenced by its partnerships with industry leaders such as AstraZeneca Canada, one of the world's largest pharmaceutical companies, and global data firm Quantify Research. These collaborations reflect Inka Health's established reputation for driving meaningful advancements in the field of science and research.</p><p class=\"\">\"<!-- -->The completion of this acquisition marks an important milestone for Onco, as it significantly enhances our ability to drive forward AI-powered precision oncology. Inka Health's cutting-edge technology and proven track record with industry leaders helps advance our capabilities in cancer therapeutic development and treatment. We are excited to integrate Inka's expertise into our operations as we continue to advance towards the next stages in the development of our technology and research,\" said Thomas O'Shaughnessy, CEO of Onco-Innovations.</p><p class=\"\">\"<!-- -->Joining forces with Onco-Innovations marks an exciting step forward for Inka Health. By leveraging our combined capabilities, we aim to enhance the speed and precision of cancer research, enabling the potential for developments that were previously out of reach or extremely time-consuming. Our AI-driven technology is designed to unlock deeper insights into cancer biology, and I believe that together we can push the boundaries of data-driven research, accelerate the research and development for more effective treatments, and ultimately make significant strides towards advancing the field of oncology research,\" said Dr. Paul Arora, CEO of Inka Health.</p><p class=\"\">The Company is also pleased to announce that it has closed its previously-announced (see news release dated January 27, 2025) non-brokered private placement (the \"<strong class=\"root-Tkn6WL2y\">Private Placement</strong>\") of 408,164 units of the Company (the \"<strong class=\"root-Tkn6WL2y\">Units</strong>\") at a price of $2.45 per Unit, for aggregate gross proceeds of $1,000,000. The proceeds from the Private Placement will be used for general working capital, corporate and research and development purposes, including to continue to fund research studies, to provide funding to pursue the further development of Inka Health's AI technology, and to continue to increase market awareness of Onco and its business activities. Pursuant to applicable securities laws, all securities issued under the Private Placement will be subject to a statutory hold period of four months and one day, expiring on June 4, 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Onco-Innovations Limited</strong></p><p class=\"\">Onco-Innovations is a Canadian-based company dedicated to cancer research and treatment, specializing in oncology. Onco's mission is to prevent and cure cancer through pioneering research and innovative solutions. The Company has secured an exclusive worldwide license to patented technology that targets solid tumours, setting new standards in cancer treatment. Onco's commitment to excellence and innovation drives it to develop advanced therapies that improve patient outcomes and offer hope in the fight against cancer.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ON BEHALF OF ONCO-INNOVATIONS LIMITED,</strong></p><p class=\"\">\"<strong class=\"root-Tkn6WL2y\">Thomas O'Shaughnessy</strong>\"</p><p class=\"\">Chief Executive Officer</p><p class=\"\">For more information, please contact:</p><p class=\"\">Thomas O'Shaughnessy</p><p class=\"\">Chief Executive Officer</p><p class=\"\">Tel:+ 1 888 261 8055</p><p class=\"\">investors@oncoinnovations.com</p><p class=\"\">oncoinnovations.com</p><p class=\"\">The CSE and Information Service Provider have not reviewed and do not accept responsibility for the accuracy or adequacy of this release.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements Caution.</strong> This news release contains forward-looking statements, including in relation to the expected synergies relating to the acquisition of Inka Health, and the Company's ability generally to realize the benefits therefrom, as well as in relation to the expected use of proceeds from the Private Placement, and to the prospects of the Company, and the Company's business and plans generally, and other statements that are not historical facts. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"potential\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact, included in this release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include the failure to realize the anticipated benefits of acquiring Inka Health, that the Company may elect or need to utilize the proceeds of the Private Placement other than as disclosed herein, and other risks detailed from time to time in the filings made by the Company with securities regulators. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will update or revise publicly any of the included forward-looking statements as expressly required by applicable law.</p><p class=\"\">1 https://www.inkahealth.ai/</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Onco-Innovations Limited</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-03:newsml_ACSc4Hhca:0/",
            "pub_date": "2025-02-04 12:36:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012235:0",
            "title": "Real Impact of U.S. Tariff Too Early to Determine — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The real impact of U.S. tariffs is too early to determine, according to Stephen Dover, chief market strategist and head of the Franklin Templeton Institute, in a commentary. It is unclear whether these tariffs are a long-term policy or a negotiation tactic by President Trump to secure concessions, the strategist notes. At the margin, these tariffs should encourage more domestic production of goods in the United States. However, the uncertainty surrounding the permanence of these tariffs makes it challenging for companies to make informed capital investment decisions, Dover adds. Chinese policymakers and businesses are likely to implement measures to mitigate the impact should the situation escalate further, Dover notes. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012235:0/",
            "pub_date": "2025-02-04 12:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0AQ:0",
            "title": "NLC India jumps after Q3 profit surge",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of lignite and coal miner NLC India  rise 9.3% to 231 rupees</p><p class=\"\">** Co reports over two-fold rise in Q3 net profit to 6.68 billion rupees ($76.8 mln), rev up 39.4% at 44.11 billion rupees</p><p class=\"\">** Power generation segment rev grows 39.7% to 36.69 billion rupees</p><p class=\"\">** More than 9 mln shares traded as of 9:51 a.m. IST, 5.9x their 30-day moving avg</p><p class=\"\">** NLC trims YTD losses to 15%</p><p class=\"\">($1 = 87.0300 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0AQ:0-nlc-india-jumps-after-q3-profit-surge/",
            "pub_date": "2025-02-04 12:37:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463163:0",
            "title": "Coface to Buy Information Services Company Cedar Rose Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coface  will buy Cedar Rose Group to boost its information services in the Middle East and Africa. </p><p class=\"\">The French credit insurance company intends to turn Cedar Rose into its exclusive information provider in the region for credit insurance and information services sales, according to a Monday release. </p><p class=\"\">Completion is subject to standard closing conditions.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463163:0/",
            "pub_date": "2025-02-04 12:38:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0BC:0",
            "title": "India stocks, rupee, swaps, call at 10:00 a.m. IST",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">STOCKS:</p><p class=\"\">The benchmark BSE Sensex  was up 0.91% to 77875, while the broader NSE Nifty 50  advanced 0.86% to 23562 tracking the gains in other Asian markets, after the U.S. paused its planned tariffs on Canada and Mexico, easing concerns over a potential worldwide trade war. </p><p class=\"\">RUPEE: </p><p class=\"\">The Indian rupee  rose 0.2% versus the U.S. dollar to 87.03,  boosted by the dollar's decline after U.S. President Donald Trump delayed tariffs on Canada and Mexico by a month.  </p><p class=\"\">GOVERNMENT BONDS:</p><p class=\"\">The benchmark 10-year bond (IN067934G=CC) was quoted at rupees, with the yield little changed at 6.6721%, as profit booking caps downmove on bets of central bank easing. </p><p class=\"\">OVERNIGHT INDEX SWAPS:</p><p class=\"\">The one-year overnight index swap rate (INR1YMIBROIS=CC) was down 2 basis points at 6.30%, while the five-year swap rate (INR5YMIBROIS=CC) rose 1 basis point to 6.08%.</p><p class=\"\">CALL MONEY: </p><p class=\"\">India's overnight call money rate (INROND=) was at 6.35%, and the overnight TREPS rate (INTREPTOT=TCCL) was at 6.26%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0BC:0-india-stocks-rupee-swaps-call-at-10-00-a-m-ist/",
            "pub_date": "2025-02-04 12:38:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463162:0",
            "title": "Market Chatter: Samsung Electronics Tops YouGov Rankings for Second Straight Year; Shares Up 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Samsung Electronics  secured the top spot in YouGov's brand rankings with 43.0 points, maintaining its first-place position in 2022, Pulse News reported Monday. </p><p class=\"\">The company secured 48.8 points in quality, 47.8 in impression, 44.1 in recommendation, and 42.3 in reputation. YouGov's evaluation involves six factors and over 1 million consumer surveys across 28 global markets, the report said. </p><p class=\"\">Shares of Samsung Electronics rose nearly 4% in recent trade on Tuesday. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463162:0/",
            "pub_date": "2025-02-04 12:38:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV03B:0",
            "title": "LME copper hits one-week high after Trump pauses tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    LME copper prices touched a one-week high on Tuesday, recovering from a sharp retreat in the previous session, after U.S. President Donald Trump delayed tariffs on Canada and Mexico for a month, easing concerns over a potential trade war.</p><p class=\"\">        Benchmark copper  was up 0.5% at $9,145 a metric ton, as of 0425 GMT, its highest point since Jan. 27. The metal fell to a four-week low on Monday.</p><p class=\"\">The dollar index  fell 0.2% on Tuesday, making greenback-priced commodities cheaper for holders of other currencies.</p><p class=\"\">Trump backed away from his threat to impose steep tariffs on Mexico and Canada for a month, but U.S. tariffs on China, the largest consumer of industrial metals, were still due to take effect soon. </p><p class=\"\">He will speak with Chinese President Xi Jinping as soon as this week, setting up a major diplomatic exchange as the world's two largest economies seek a deal that could avert a broader trade war.</p><p class=\"\">\"The focus turns whether the 10% tariff proposed by the U.S. on Chinese imports goes ahead ... That's going to be very impactful for the copper market because of the consequences for Chinese demand,\" said Kyle Rodda, senior financial markets analyst at Capital.com.</p><p class=\"\">U.S. companies will look to the Middle East and India for more aluminium and to Chile and Peru for copper in case they have to circumvent tariffs in future. </p><p class=\"\">Meanwhile, recent data showed that China's factory activity grew at a slower pace in January. The Caixin/S&amp;P Global manufacturing PMI slipped to 50.1 in January from 50.5 the previous month. </p><p class=\"\">        Three-month aluminium  rose 0.1% to $2,625.5. LME zinc  gained 0.7% to $2,817.5 a ton, tin  was up 0.1% at $29,945, lead  climbed 0.2% to $1,949, while nickel  lost 0.4% to $15,150.</p><p class=\"\">The Shanghai Futures Exchange is closed for the Lunar New Year holiday. Markets will resume trade on Wednesday, Feb. 5.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV03B:0-lme-copper-hits-one-week-high-after-trump-pauses-tariffs/",
            "pub_date": "2025-02-04 12:39:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0AX:0",
            "title": "India's Titan gains ahead of Q3 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tata-owned Titan  rise 0.8% ahead of Q3 results, while broader Nifty 50  is off 0.3%</p><p class=\"\">** Analysts expect the jeweller-cum-watchmaker to post a 6.4% drop in Q3 net profit to 9.86 bln rupees ($113.3 mln)</p><p class=\"\">** Revenue though rose 23% on strong demand for jewellery during festival season</p><p class=\"\">** TITN had warned of hit to Q3 profit from customs duty cut, same as in Q2, as it had bought inventory before the cut, which lowered avg value of stock and forced it to sell at reduced prices</p><p class=\"\">** Avg rating of 29 analysts is \"buy\"; median PT is 3,625 rupees vs current price of 3,608 rupees -LSEG data</p><p class=\"\">** TITN has gained 10.7% YTD, 6th highest on Nifty 50, while its fwd 12-month PE of ~68x is 3rd highest on Nifty -LSEG</p><p class=\"\"> ($1 = 87.0325 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0AX:0-india-s-titan-gains-ahead-of-q3-results/",
            "pub_date": "2025-02-04 12:40:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012195_20250203012197:0",
            "title": "Mitsubishi Heavy Inds Sees FY Net Y240.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012195_20250203012197:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012221:0",
            "title": "China Could Continue to Increase FDI Investment in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China could ramp up foreign direct investment in 2025 to ease the impact of higher U.S. tariffs on its exports and the broader economy, ANZ economists say in a research note. Chinese companies have invested heavily in third countries like Mexico since the initial U.S.-China trade dispute in 2018. According to China's commerce ministry, 326 Chinese enterprises registered to invest in Mexico in 2023, up from 133 in 2020. The economists think the trend is not only tariff driven, but also due to supply chain shifts. \"Low industrial profit under overcapacity concerns and relatively high production costs drives supply-chain shift overseas,\" they say. ANZ expects more overseas investment from Chinese companies to reduce reliance on traditional markets and diversify trade influence, they add. (sherry.qin@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012221:0/",
            "pub_date": "2025-02-04 12:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446470:0",
            "title": "Saudi Arabia Non-Oil Private Sector Growth Nears Record Peak",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Riyad Bank Saudi Arabia's PMI rose to 60.5 in January 2025, up from 58.4 in December, approaching its record high of 61.8 set in September 2014.</p><p class=\"\">New orders saw the highest increase since June 2011, while output and export sales expanded the most in 18 months.</p><p class=\"\">Firms recruited additional staff for the ninth month, reducing outstanding business levels.</p><p class=\"\">Buying activity improved, with 35% of respondents reporting an increase since December.</p><p class=\"\">Delivery times shortened to the greatest extent in 10 months.</p><p class=\"\">Input costs rose at the steepest rate in nearly 4.5 years due to higher material prices and geopolitical tensions, leading firms to increase output prices at the quickest pace in a year.</p><p class=\"\">Sentiment reached a 10-month peak, driven by hopes of sustained demand growth and supportive market conditions for the year.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446470:0-saudi-arabia-non-oil-private-sector-growth-nears-record-peak/",
            "pub_date": "2025-02-04 12:32:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463159:0",
            "title": "Borouge's FY24 Profit, Revenue Climb",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Borouge (ADX:BOROUGE) said Tuesday that its profit and revenue for full-year 2024 rose year over year. </p><p class=\"\">Profit attributable to owners for the 12 months ended Dec. 31, 2024, was $1.23 billion, compared with $991.1 million earlier. EPS moved to $0.04 from $0.03. </p><p class=\"\">The Abu Dhabi-listed petrochemicals company's revenue was $6.03 billion, compared with $5.79 billion a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463159:0/",
            "pub_date": "2025-02-04 12:33:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463160:0",
            "title": "New Zealand Shares Rebound as Trump Pauses Tariffs on Canada, Mexico; Briscoe Up 2% on Upbeat Q4 Sales",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Zealand shares staged a rebound Tuesday as the US halted its tariffs on Mexican and Canadian goods in a move that temporarily averted a trade war. </p><p class=\"\">The S&amp;P/NZX 50 Index rose 0.7%, or 94.72 points, to close at 12,905.04. </p><p class=\"\">Japan's Nikkei 225 climbed 1.2% and Hong Kong's Hang Seng rallied 2%. Australia's ASX 200 was flat. </p><p class=\"\">US equities trimmed their losses overnight, with the Nasdaq Composite dropping 1.2%, the S&amp;P 500 shedding 0.8%, and the Dow Jones Industrial Average down 0.3%. </p><p class=\"\">Investors got a temporary reprieve after the US decided to pause the 25% tariffs on Mexico and Canada for a month as both nations pledged to tighten border controls. </p><p class=\"\">China, meanwhile, has said it would refer the case to the World Trade Organization (WTO) after getting slapped with a further 10% tariff on exports to the US. </p><p class=\"\">Analysts expect Beijing to respond cautiously to US tariffs and avoid a tit-for-tat escalation at least for the time being. </p><p class=\"\">\"Beijing's response so far has been muted, limited to threatened WTO action, suggesting that Xi Jinping sees room for negotiation and will hold off on significant retaliation for now,\" TS Lombard analyst Rory Green wrote in a Monday note. </p><p class=\"\">In domestic news, New Zealand's approved new dwellings fell 5.6% to 2,478 in December 2024, following a 4.9% rise in the prior month, Stats NZ data showed Tuesday. </p><p class=\"\">Barfoot &amp; Thompson's home sales in Auckland totaled 700 properties in January, or roughly NZ$737.4 million, down 16% from the prior month's 833 sold properties, the real estate agency said. </p><p class=\"\">In corporate news, Briscoe Group's  shares climbed about 2% after the company reported fiscal fourth-quarter sales of NZ$245.3 million, up from NZ$243 million a year earlier. </p><p class=\"\">Elsewhere, the manager of Vital Healthcare Property Trust , Northwest Healthcare Properties Management, said it decided not to pursue restructuring under a dual-listed trust proposal following feedback from stakeholders.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463160:0-new-zealand-shares-rebound-as-trump-pauses-tariffs-on-canada-mexico-briscoe-up-2-on-upbeat-q4-sales/",
            "pub_date": "2025-02-04 12:34:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:96701db20094b:0",
            "title": "Tata Chemicals stock drops 4% as firm swings back into losses in Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shares of Tata Chemicals took a beating and fell over 4 percent on February 4, weighed down by the company's poor Q3 earnings. The company reported a a net loss of Rs 21 crore for the December quarter, a stark turnaround from the net profit of Rs 194 crore that it clocked in the year ago period.</p><p class=\"\">At 09.48 am, shares of Tata Chemicals were trading at Rs 905.40 on the NSE.</p><p class=\"\">Lower soda ash prices along with a one-time exceptional loss of Rs 70 crore dragged the company's bottomline. The one-time exceptional loss was on account of expenses related to employee termination benefits, decommissioning of plant and machinery, and other closure-related costs following the cessation of soda ash production at the Lostock plant in Northwich, UK.</p><p class=\"\">Follow our market blog to catch all the live action</p><p class=\"\">Meanwhile, revenue from operations declined 3.8 percent on year to Rs 3,590 crore as compared to Rs 3,730 crore in the same period last fiscal. Operating margin also contracted to 12.1 percent in Q3, down from 14.5 percent in the year ago period.</p><p class=\"\">“The company’s overall performance was down as compared to the same quarter of the previous year, mainly due to lower soda ash pricing across geographies and higher fixed costs in the US due to a plant production outage during the quarter,\" R Mukundan, Managing Director and CEO, Tata Chemicals said in an exchange filing.</p><p class=\"\">Looking ahead, Mukundan expects challenges to persist for Tata Chemicals. \"In the short-term, the current demand-supply adverse situation is likely to persist but should improve and stabilise over the long term driven by growth sectors based on sustainability trends,\" he said.</p><p class=\"\">The company's gross debt stood at Rs 6,722 crore as of December 31, 2024, reflecting an increase of Rs 810 crore on year, while net debt rose by Rs 952 crore to Rs 5,329 crore due to lower EBITDA and higher working capital requirements across the US, Kenya, and India.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:96701db20094b:0-tata-chemicals-stock-drops-4-as-firm-swings-back-into-losses-in-q3/",
            "pub_date": "2025-02-04 12:24:51",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012190:0",
            "title": "India's Sensex Rises 0.9%, Led by Bank, Auto Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indian shares are higher, led by gains in bank and auto stocks, as the delay of new U.S. tariffs on Mexico and Canada boosts market sentiment across Asia. ICICI Bank is up 2.2%, and Tata Motors is 1.9% higher. Among individual movers, Castrol India is up 8.7% after its 4Q net profit climbed 12% on year. Earnings are in focus, with Asian Paints and Tata Power set to release their quarterly results later in the day. The Sensex is up 0.9% at 77889.39. (kosaku.narioka@wsj.com; @kosakunarioka)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012190:0/",
            "pub_date": "2025-02-04 12:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV04Z:0",
            "title": "Turkey - Factors To Watch on Feb 4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Here are news, reports and events that may affect Turkish financial markets on Tuesday.</p><p class=\"\">The lira  traded at 35.9990 against the U.S. dollar at 0148 GMT, after closing at 35.9645 on Monday.</p><p class=\"\">The main BIST 100 share index  closed 2.30% lower at 9,774.40 points on Monday.</p><p class=\"\">GLOBAL MARKETS</p><p class=\"\">Hong Kong shares hit two-month highs, U.S. equity futures rose and currencies swung to-and-fro in big ranges as investors scrambled to keep up with sudden changes in U.S. trade policy.</p><p class=\"\">ERDOGAN SCHEDULE</p><p class=\"\">President Tayyip Erdogan will make a speech at a meeting to present the national employment strategy and launch a youth programme. (1100 GMT)</p><p class=\"\">Erdogan will then host Syria's newly appointed transitional president, Ahmad al-Sharaa, at the presidential palace. (1400 GMT). After talks they will hold a joint press conference. (1630 GMT)</p><p class=\"\">TRADE MINISTER</p><p class=\"\">Trade Minister Omer Bolat will attend a Syria trade workshop and visit authorities in the southern provinces of Gaziantep and Kilis bordering Syria. (0600 GMT)</p><p class=\"\">RESERVE REQUIREMENT RATIOS</p><p class=\"\">The Turkish Central Bank said on Tuesday it had raised reserve requirement ratios for funds and loans from aboard to 12% from 8% to strengthen the monetary transmission mechanism.</p><p class=\"\">PRICE DEVELOPMENTS REPORT</p><p class=\"\">The Central Bank will release its latest price developments report after data on Monday showed Turkey's monthly inflation rate climbed more than expected to 5.03% in January due to a minimum wage hike and several new-year price updates. (1500 GMT)</p><p class=\"\">FEBRUARY INFLATION</p><p class=\"\">A recent change in Turkey's health regulations is expected to add 0.6 percentage points to inflation in February and push annual inflation up by 1.5 percentage points, economists estimate.</p><p class=\"\">REAL EFFECTIVE EXCHANGE RATE</p><p class=\"\">The Central Bank will announce the real effective exchange rate for January. (1130 GMT)</p><p class=\"\">EGYPTIAN FOREIGN MINISTER</p><p class=\"\">Foreign Minister Hakan Fidan will host his Egyptian counterpart Bedr Abdulati for talks in Ankara.</p><p class=\"\">GETIR CEO REMOVED</p><p class=\"\">The CEO of Turkish grocery delivery company Getir said on Monday he had been removed from his position, weeks after a shareholder meeting approved an updated restructuring plan that was disputed by one of the firm's co-founders.</p><p class=\"\">OSCE PARLIAMENTARY ASSEMBLY HEAD</p><p class=\"\">Parliament Speaker Numan Kurtulmus will hold a joint press conference with Pia Kauma, president of the Parliamentary Assembly of the Organization for Security and Co-operation in Europe (OSCE). (0945 GMT)</p><p class=\"\">OPPOSITION PARTIES </p><p class=\"\">Ozgur Ozel, head of the main opposition Republican People's Party, will speak at the party's parliamentary group meeting. (1030 GMT). The pro-Kurdish DEM Party will also hold their parliamentary meeting. (0945 GMT)</p><p class=\"\">EARTHQUAKE ANNIVERSARY</p><p class=\"\">Environment Minister Murat Kurum and Presidential Communications Director Fahrettin Altun will attend a symposium ahead of the second anniversary of the devastating earthquake in southern Turkey on Feb. 6, 2023. (0630 GMT)</p><p class=\"\">For other related news, double-click on:</p><p class=\"\">Turkish politics (TR-POL)</p><p class=\"\">Turkish equities (TR-E)</p><p class=\"\">Turkish money (TR-M)</p><p class=\"\">Turkish debt (TR-D)</p><p class=\"\">Turkish hot stocks (TR-HOT)</p><p class=\"\">Forex news (FRX)</p><p class=\"\">All emerging market news (EMRG)</p><p class=\"\">All Turkish news </p><p class=\"\">For real-time quotes, double click on:</p><p class=\"\">Istanbul National-100 stock index , interbank lira trading (IYIX=), lira bond trading (0#TRTSYSUM=IS)   </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV04Z:0-turkey-factors-to-watch-on-feb-4/",
            "pub_date": "2025-02-04 12:29:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012206:0",
            "title": "Wellington Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in NZ$ <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Air New Zealand                 0.64       0.63      +0.01      +0.79 <br/>  Auckland Intl Airport           8.85       8.78      +0.07      +0.74 <br/>  Contact Energy                  9.29       9.29       unch       unch <br/>  Fisher &amp; Paykel Health         35.92      35.10      +0.82      +2.34 <br/>  Fletcher Building               2.85       2.88      -0.03      -1.04 <br/>  Spark New Zealand               2.92       2.85      +0.07      +2.46 <br/>  Warehouse Group                 1.02       1.03      -0.01      -0.97 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012206:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012192_20250203012192:0",
            "title": "SGX Sicom RSS3 Rubber Untraded at Midday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012192_20250203012192:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012191_20250203012191:0",
            "title": "SGX Sicom Benchmark March TSR20 Rubber Up 0.6 Cent at 196.7 U.S. Cents/Kg",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012191_20250203012191:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012197_20250203012197:0",
            "title": "Mitsubishi Heavy Inds Sees FY Net Y240.00B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012197_20250203012197:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012196_20250203012196:0",
            "title": "Mitsubishi Heavy Inds 9-Mos Rev Y3.55T Vs Y3.26T",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012196_20250203012196:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012195_20250203012195:0",
            "title": "Mitsubishi Heavy Inds 9-Mos Net Y172.11B Vs Net Y138.05B",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012195_20250203012195:0/",
            "pub_date": "2025-02-04 12:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463155:0",
            "title": "Australian Gold and Copper Reports Copper-Zinc Zone at New South Wales Project; Shares Jump Past 7%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian Gold and Copper  said assays from the final hole of a drilling program at the Achilles deposit in its South Cobar project in New South Wales intercepted low-grade copper-zinc mineralization, according to a Tuesday Australian bourse filing. </p><p class=\"\">The zone of copper-zinc mineralization contains up to 0.4% grade of copper and 1.6% grade of zinc. </p><p class=\"\">The copper mineralization represents a new copper-dominant search space, not associated with the Achilles silver-gold-base metal deposit, the filing said. </p><p class=\"\">The company has started a helicopter-borne electromagnetic survey to test for additional mineralization. </p><p class=\"\">The firm's shares jumped past 7% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463155:0/",
            "pub_date": "2025-02-04 12:30:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463156:0",
            "title": "Holcim Plans to Capitalize on Growth in US Infrastructure Investments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Holcim  Chief Executive Miljan Gutovic said the company is looking to capitalize on increased infrastructure investments and the reshoring trend in the US, Reuters reported Monday. </p><p class=\"\">As part of the strategy, the Swiss building materials company is looking to expand further in the US, which is also its biggest market. Gutovic said the expansion would be achieved via organic growth and acquisitions. </p><p class=\"\">Regarding the listing of Holcim's North American business, Gutovic said the group is committed to making it happen by the end of the first half. </p><p class=\"\">Amid concerns surrounding US President Donald Trump's tariffs, Gutovic said he does not see how it could affect the group since it uses locally sourced materials for its production within the US.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463156:0/",
            "pub_date": "2025-02-04 12:30:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012186:0",
            "title": "Hong Kong Shares Rise 2.0% at Midday, Led by Tech Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's benchmark Hang Seng Index is up 2.0% to 20622.1 at the midday break. The Hang Seng Tech Index is 3.9% higher at 4922.58. Investor sentiment was boosted after President Trump agreed to delay tariffs for Mexico and Canada. The markets may look through the economic data to focus on China's responses to U.S. tariffs and the coming National People's Congress session in early March, Citi analysts say. Tech stocks are leading the gains with Meituan up 4.2%, Lenovo adding 6.5% and Alibaba gaining 2.45%. Decliners include Greentown China Holdings, which is down 1.8%, and Sihuan Pharmaceutical Holdings Group 3.45% lower. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012186:0/",
            "pub_date": "2025-02-04 12:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012187:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0421 GMT - Hong Kong's benchmark Hang Seng Index is up 2.0% to 20622.1 at the midday break. The Hang Seng Tech Index is 3.9% higher at 4922.58. Investor sentiment was boosted after President Trump agreed to delay tariffs for Mexico and Canada. The markets may look through the economic data to focus on China's responses to U.S. tariffs and the coming National People's Congress session in early March, Citi analysts say. Tech stocks are leading the gains with Meituan up 4.2%, Lenovo adding 6.5% and Alibaba gaining 2.45%. Decliners include Greentown China Holdings, which is down 1.8%, and Sihuan Pharmaceutical Holdings Group 3.45% lower. (tracy.qu@wsj.com)</p><p class=\"\">0415 GMT - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">0410 GMT - New Zealand's NZX-50 index ended 0.7% higher at 12905.04 after U.S. President Trump agreed to delay tariffs on imports from the country's closest neighbors by a month. Still, the index didn't recapture all of Monday's fall in a sign that investors remain skittish. Trump has also signaled unhappiness with the U.S.'s trade relationship with the EU. Fisher &amp; Paykel Healthcare, Monday's biggest loser, advanced 2.3% as analysts said any effort to expand manufacturing in New Zealand to shield itself from tariffs on products made in Mexico would take time. Skellerup rose 0.2% as Forsyth Barr said the additional 10% tariff on China wouldn't put a big dent in its earnings. Energy stocks were mostly lower, however, with Genesis Energy down 1.8% and Meridian Energy declining 0.6%. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">0344 GMT - LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p><p class=\"\">0327 GMT - Centurion Corp. looks well-placed to generate higher rental rates in Singapore given the dormitory supply shortage situation, RHB Research's Alfie Yeo says in a research report. Its purpose-built workers' accommodation bed rates in Singapore continue to be robust, and thanks to the demand-supply situation, RHB sees ongoing upward rental adjustments boosting its average bed rates. RHB lifts its 2025-2026 earnings estimates for the Singapore-listed manager of workers and student accommodations by 9% each year. RHB maintains the stock's buy rating and raises the stock's target price to S$1.16 from S$1.06. Shares are 0.5% higher at S$0.995. (ronnie.harui@wsj.com)</p><p class=\"\">0256 GMT - MC Group retains its buy call from Thanachart Securities as the stock is a high-yield play, the brokerage's Phannarai Tiyapittayarut says in a research report. The stock looks inexpensive at a 10.1X 2025 price-to-earnings multiple and a 9.9% dividend yield, the analyst says. Also, the Thai company's sales from online channels are still growing, with contribution to its total sales expected to increase to 19.2% in 2027 from 10.4% in 2024. However, the manufacturer and marketer of 'Mc Jeans' is slowing store openings, which prompts the brokerage to cut its earnings estimates by 6% for 2025, 8% for 2026, and 11% for 2027. Thanachart Securities lowers its target price to THB12.00 from THB15.00. Shares closed 1% higher at THB10.00 on Monday. (ronnie.harui@wsj.com)</p><p class=\"\">0233 GMT - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p><p class=\"\">0219 GMT - SD Guthrie's Marvesa 48% stake acquisition looks set to help strengthen its downstream business expansion, diversify into other soft oils and boost trading between Europe and Asia-Pacific, MIDF Research says in a note. The 250 million ringgit acquisition comes as a surprise, particularly as many of the company's peers have adopted a cautious stance toward the region due to the impending European Union deforestation regulation policy, it notes. However, considering the plantation giant's strong supply-chain credentials, SD Guthrie views Europe as a key growth driver, MIDF says. SD Guthrie's balance sheet remains healthy and is well-positioned for expansion, it adds. MIDF maintains a buy rating on SD Guthrie and keeps its target price at MYR5.43. Shares are 0.6% higher at MYR4.88. (yingxian.wong@wsj.com)</p><p class=\"\">0203 GMT - Hong Kong shares open higher, with the Hang Seng Index rising 1.6% to 20546.6. The Hang Seng Tech Index adds 2.9% to 4875.99. Market sentiment is boosted after Canada and Mexico reached a deal to delay U.S. President Donald Trump's tariffs. Among major stocks, technology stocks are leading the gains, with Bilibili adding 4.7% and JD.com rising 3.0%. Tencent is 1.0% higher. The few decliners include C&amp;D International Investment Group, which drops 1.3% and LVGEM (China) Real Estate Investment, which is 1.4% lower. (tracy.qu@wsj.com)</p><p class=\"\">0144 GMT - Sunway REIT could post 11.6% earnings growth in 2025, driven by the record MYR899 million in asset acquisitions completed in 2024, rental reversion and higher occupancy rates, CIMB Securities analysts Lim Yue Jia and Ivy Ng Lee Fang say in a note. Upgrades at Sunway Pyramid Mall and Sunway Carnival Mall may also support earnings, they add. They raise Sunway REIT's 2025-2026 earnings forecasts by 0.9%-1.8% following the completion of the Sunway Kluang Mall acquisition. CIMB Securities raises Sunway REIT's target price to MYR2.11 from MYR2.09, while maintaining a buy rating on the stock. Shares are 2.1% higher at MYR1.91. (yingxian.wong@wsj.com)</p><p class=\"\">0114 GMT - AMMB Holdings' canceling the sale of its life insurance unit to Great Eastern comes as no surprise, given the prolonged delay, Maybank IB analyst Desmond Ch'ng says in a note. He notes that there has been no progress on the deal since it was first proposed in October 2023. The impact on AMMB's capital is minimal, with its Common Equity Tier 1 ratio at a solid 15.3%, he reckons. While a sale may still be considered, there is no urgency, he adds. Ch'ng expects AMMB to see 11.7% earnings growth in FY 2025, supported by better net interest margins and lower credit costs. Maybank maintains a buy rating on AMMB and keeps the target price at MYR6.30. Shares are 0.2% higher at MYR5.65. (yingxian.wong@wsj.com)</p><p class=\"\">0108 GMT - Singapore's FTSE Straits Times Index rises 0.7% to 3853.13 in early trade. Market sentiment is rosier after President Trump and leaders of Canada and Mexico reached a deal to put tariffs on hold for a month. \"Tariff headlines are still likely to dominate,\" UOB's Global Economics &amp; Markets Research team says in a note. Among advancers, Seatrium climbs 0.9%, DBS adds 1.3% and Yangzijiang Shipbuilding is up 1.0%. Meanwhile, Venture Corp. falls 0.4% and Keppel Ltd. loses 0.3%. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012187:0/",
            "pub_date": "2025-02-04 12:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463150:0",
            "title": "Market Chatter: EU to Strengthen Checks on Low-Value Products from Temu, Shein",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In an effort to ensure fair competition and product safety, the European Union is planning to strengthen customs checks on goods shipped directly by non-EU ecommerce retailers, Reuters reported Monday. </p><p class=\"\">The directive, set for release on Wednesday, targets the rapid growth of platforms like Temu and Shein, which have gained an edge with ultra-low prices on Chinese-made products, according to the report. </p><p class=\"\">The above retailers benefited from an EU rule exempting parcels under 150 euros from duties, a policy critics argued creates unfair advantages, Reuters wrote. </p><p class=\"\">The new measures will focus on online purchases posing safety risks or non-compliance with EU laws, with the European Commission urging member states to collaborate on identifying high-risk products, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463150:0/",
            "pub_date": "2025-02-04 12:21:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}