{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463314:0",
            "title": "Aozora Bank Turns to Profit in Nine Months Ended December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aozora Bank  recorded an attributable profit of 16.2 billion yen for the nine months ended Dec. 31, 2024, compared with an attributable loss of 14.7 billion yen in the year-ago period, a Monday bourse filing said. </p><p class=\"\">Basic earnings per share stood at 123.67 yen in the three quarters, while the company incurred a loss per share of 125.88 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The lender's ordinary income fell by 11% year over year to 171.9 billion yen in the period from 193.3 billion yen a year prior. </p><p class=\"\">The company forecasts an attributable profit of 18 billion yen, a basic EPS of 135.31 yen, an ordinary profit of 24 billion yen, and a total dividend of 76 yen per share for the year ending March 31. </p><p class=\"\">Shares of the company were down over 3% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463314:0/",
            "pub_date": "2025-02-04 16:17:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002098:0",
            "title": "China's Relatively Restrained Tariff Response Likely Opens Door to Talks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's relatively restrained retaliation against U.S. tariffs, targeting only a few product categories, was in line with CreditSights' expectations. \"The measured response likely opens the door for trade talks with the U.S.,\" says analyst Zerlina Zeng. On the monetary policy front, CreditSights expects the PBOC to allow only moderate FX depreciation and delay high-profile monetary easing, such as rate cuts, to avoid escalation. On the fiscal front, the firm anticipates more expansionary policies to cushion against external risks. Retaliatory measures and headlines could dampen global risk sentiment and are negative for Asian credits, despite their limited direct exposure to U.S. revenues, Zeng and Stephanie Sim note. \"We expect market sentiment towards China $ bonds to weaken if no concrete incremental fiscal stimulus are rolled out by 1H,\" they write. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002098:0/",
            "pub_date": "2025-02-04 16:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0N2:0",
            "title": "UK's Diageo falls after withdrawing medium-term goals",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of spirits maker Diageo  fall about 2.4% to 2,308.5p, hitting a near three-month low</p><p class=\"\">** Stock among top losers in FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- --> index</p><p class=\"\">** Co withdrew its medium-term organic sales growth target and took actions to mitigate the impact of U.S. tariffs.</p><p class=\"\">** May undertake pricing, inventory management, re-allocation of investments and supply chain optimization to counter tariff impacts</p><p class=\"\">** Had previously guided medium-term organic net sales growth of 5% to 7%. </p><p class=\"\">** In H1 of fiscal 2025, organic net sales grew 1% vs company compiled analysts expectations of 0.4% growth.</p><p class=\"\">** The stock fell over 11% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0N2:0-uk-s-diageo-falls-after-withdrawing-medium-term-goals/",
            "pub_date": "2025-02-04 16:18:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SEE8PPkna:0",
            "title": "Albania's economic confidence index slightly down in Jan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TIRANA (Albania), February 4 (SeeNews) - Albania’s economic sentiment index (ESI) decreased by 0.8 points in January, compared with the previous month, but remained around 6 percentage points (pp) above the long-term average, the central bank said.</p><p class=\"\">The fall in the ESI was the result of the weaker confidence across all sectors, expect services, the Bank of Albania said in a monthly business and consumer confidence survey on Monday.</p><p class=\"\">The services confidence index increased by 4.4 pp in January.</p><p class=\"\">The industry confidence indicator fell by 4.7 pp in the month under review. The consumer confidence index declined by 3 pp in January.</p><p class=\"\">The construction indicator decreased by 4.1 pp, whereas the confidence indicator of the trade sector fell by 2.9 pp.</p> </span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SEE8PPkna:0-albania-s-economic-confidence-index-slightly-down-in-jan/",
            "pub_date": "2025-02-04 16:18:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446502:0",
            "title": "Spain Jobless Rises Less than Anticipated",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The number of people registering as jobless in Spain rose by 38,725 people, or 1.5%, over a month, to 2.599 million in January 2025, the lowest figure for a January in the last 17 years.</p><p class=\"\">Analysts had expected an increase of 45,400 people.</p><p class=\"\">Compared to December 2024, registered unemployment decreased in the construction sector by 4,527 (-2.28%), in industry by 241 (-0.12%), and among the group with no previous employment by 2,201 (-0.93%), while it increased in services by 44,595 (2.42%) and in agriculture by 1,099 (1.31%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446502:0-spain-jobless-rises-less-than-anticipated/",
            "pub_date": "2025-02-04 16:18:50",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463321:0",
            "title": "China Starts Google Probe Over Alleged Antitrust Violations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's market regulation administrator on Tuesday launched an investigation into Google over alleged antitrust violations, according to a same-day news release. </p><p class=\"\">The announcement from the State Administration for Market Regulation offered no information about what prompted the inquiry. </p><p class=\"\">The move comes as China imposed retaliatory tariffs against the US and placed Calvin Klein owner PVH and Illumina to an entity blacklist in response to the Trump administration's imposition of 10% tariffs on Chinese goods, which took effect at 12:01 a.m. Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463321:0/",
            "pub_date": "2025-02-04 16:18:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446503:0",
            "title": "US Natgas Prices Fall on Trump Tariff Pause",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US natural gas futures dropped over 3% to $3.23/MMBtu on Tuesday, down from a 10.1% rally on Monday, after President Trump delayed tariffs on Canada and Mexico by a month following agreements on border enforcement.</p><p class=\"\">Meanwhile, China imposed retaliatory tariffs, including a 15% levy on US coal and LNG, raising fears of a trade war.</p><p class=\"\">This move could disrupt LNG trade between the world’s largest buyer and seller.</p><p class=\"\">On the supply side, average US gas output in the Lower 48 states rose to 105.7 bcfd in February, surpassing January’s 102.5 bcfd.</p><p class=\"\">However, daily output has fallen to 105.4 bcfd from an 11-month high of 106.1 bcfd.</p><p class=\"\">Warmer-than-normal weather is expected through Feb. 8 before turning colder.</p><p class=\"\">Gas flows to US LNG export plants increased to 15.3 bcfd in February, exceeding January’s 14.6 bcfd and setting a new record.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446503:0-us-natgas-prices-fall-on-trump-tariff-pause/",
            "pub_date": "2025-02-04 16:19:05",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463246:0",
            "title": "Spanish Unemployment Levels Rise in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The number of individuals registered as unemployed in Spain rose by 38,725 in January, after a fall of 25,300 in the prior month, according to government data published Tuesday. </p><p class=\"\">Analysts expected an increase of 45,400 in unemployment levels for the month.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463246:0/",
            "pub_date": "2025-02-04 16:19:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV015:0",
            "title": "AD Ports Group Signs 50-Yr Land Lease Agreement For Grains Storage And Processing Facility",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Abu Dhabi Ports Company PJSC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SIGNS 50-YEAR LAND LEASE AGREEMENT WITH AL AIN MILLS LLC</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">LAND LEASE AGREEMENT FOR GRAINS STORAGE AND PROCESSING FACILITY AT KHALIFA PORT</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FACILITY EXPECTED TO GO LIVE WITHIN TWO AND A HALF YEARS AFTER START OF CONSTRUCTION</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV015:0-ad-ports-group-signs-50-yr-land-lease-agreement-for-grains-storage-and-processing-facility/",
            "pub_date": "2025-02-04 16:20:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446504:0",
            "title": "Armenia Cuts Interest Rate to 6.75%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The central bank of Armenia lowered its benchmark interest rate by another 25 basis points to 6.75% during its February 2024 meeting, marking the fourteenth consecutive rate cut since the loosening campaign began in June 2023.</p><p class=\"\">Policymakers also reduced the deposit and lending rates by 25bps to 5.25% and 8.25%, respectively.</p><p class=\"\">The decision came as the country's CPI rose to 1.5% year-on-year in December, the highest reading in over one year but still well below the regulator's 4% target.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446504:0-armenia-cuts-interest-rate-to-6-75/",
            "pub_date": "2025-02-04 16:20:21",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463322:0",
            "title": "Eris Lifesciences' Consolidated Profit Slides in Fiscal Q3; Shares Down 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Eris Lifesciences'  consolidated profit fell to 836.3 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, against a 1.03 billion rupees a year ago. </p><p class=\"\">Earnings per share contracted to 6.14 rupees compared with the year-ago figure of 7.54 rupees, according to a Tuesday filing with the Indian stock exchanges by the pharmaceutical company. </p><p class=\"\">Revenue from operations in fiscal Q3 increased to 7.27 billion rupees from 4.86 billion rupees a year earlier. </p><p class=\"\">Shares of the company were down nearly 4% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463322:0/",
            "pub_date": "2025-02-04 16:20:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV016:0",
            "title": "Iraq's Al Ameen Estate Investment Qtrly Surplus At 50.3 Mln Dinars",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AL AMEEN ESTATE INVESTMENT CO (SAEI.ISX):</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">AL AMEEN ESTATE INVESTMENT QTRLY SURPLUS 50.3 MILLION DINARS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">AL AMEEN ESTATE INVESTMENT QTRLY TOTAL REVENUE 93.3 MILLION DINARS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV016:0-iraq-s-al-ameen-estate-investment-qtrly-surplus-at-50-3-mln-dinars/",
            "pub_date": "2025-02-04 16:20:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CN:0",
            "title": "Veefin Solutions Says Group Acquires Dubai-Based Tradeassets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Veefin Solutions Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GROUP ACQUIRES DUBAI-BASED TRADEASSETS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CN:0-veefin-solutions-says-group-acquires-dubai-based-tradeassets/",
            "pub_date": "2025-02-04 16:21:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308382:0",
            "title": "Celestica Insider Sold Shares Worth $1,383,937, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Jason Phillips, President, on January 30, 2025, sold 10,851 common shares in Celestica  for $1,383,937. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1030894/000095017025012623/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1030894/000095017025012623/xslF345X05/ownership.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308382:0/",
            "pub_date": "2025-02-04 16:12:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002078_20250204002082:0",
            "title": "Hang Seng Tech Index Ends 5.1% Higher at 4977.38",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002078_20250204002082:0/",
            "pub_date": "2025-02-04 16:13:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNEbZt7nZ:0",
            "title": "EcoEngineers Expands Accreditation and Scope Extensions Internationally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">ANAB Scope Extension Blosters Firm’s Auditing and Verification Capabilities</p><p class=\"\">DES MOINES, Iowa, Feb.  04, 2025  (GLOBE NEWSWIRE) — EcoEngineers (Eco), a consulting, auditing, and advisory firm with an exclusive focus on the energy transition and decarbonization, today announced two new scope extensions granted by the American National Standards Institute (ANSI) National Accreditation Board (ANAB).</p><p class=\"\">The ANAB scope accreditations are a testament to the firm’s commitment to robust and comprehensive quality management systems. The accreditations underscore the firm’s dedication to providing clients with the assurance, credibility, rigor, and continuous improvement they need on their journey to develop green hydrogen and greenhouse gas (GHG)-mitigation projects worldwide.</p><p class=\"\">Specifically, Eco was granted scope accreditation for the following:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Green Hydrogen (CFR Sector 4):</strong> Verification of applications and reports under Canada’s Clean Fuel Regulations (CFR), strengthening the company’s leadership in hydrogen verification and bolstering Eco’s ability to support U.S.-based clients expanding into Canada and open new avenues for verification projects.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Land Use and Forestry (ANAB Group 3):</strong> Verification of GHG emission reductions and removals, including soil carbon sequestration, positioning the company as a leading verifier of sustainable farming practices for Climate-Smart Agriculture (CSA) crops used as biofuel feedstock.</li></ul><p class=\"\">The latest scope extensions follow Eco's accreditation granted by ANAB as a validation and verification body (VVB) in accordance with International Organization for Standardization (ISO) standards in 2023 and the CFR Sector 2 Renewable/Bio/Low-CI Fuels scope accreditation achieved in 2024.</p><p class=\"\">“These new scope extensions demonstrate Eco’s ongoing dedication to excellence in verification and our ability to adapt to the evolving needs of the carbon marketplace,” said Randy Prati, vice president of strategic initiatives at EcoEngineers. “Our clients can rely on us to deliver robust, credible, and transparent verification services.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Poised for Growth</strong></p><p class=\"\">In parallel, Eco is pursuing additional accreditations such as becoming a certification body under international voluntary and regulatory compliance schemes. Eco is also expanding its presence in Europe to obtain national body accreditation recognition, which will allow the firm to offer its clients verification and certification services under multiple European voluntary schemes.</p><p class=\"\">“Our ability to help clients substantiate their GHG claims through accurate and transparent processes strengthens their credibility and advances the energy transition,” said Shashi Menon, CEO of EcoEngineers. “These new capabilities highlight our position as a trusted partner in the carbon marketplace.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About ANAB</strong></p><p class=\"\">Launched in 2008, ANAB's accreditation program for GHG/verification bodies oversees the competence and professional conduct of third parties responsible for verifying the accuracy of emission attestations and applies to a broad spectrum of industries. For more information, visit www.anab.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About EcoEngineers</strong></p><p class=\"\">EcoEngineers is a consulting, auditing, and advisory firm with an exclusive focus on the energy transition and decarbonization. Its team of engineers, scientists, auditors, consultants, and researchers live and work at the intersection of low-carbon fuel policy, innovative technologies, and the carbon marketplace. Eco’s global team is shaping the response to climate change by advising businesses across the energy transition. Visit www.ecoengineers.us.</p><p class=\"\">Contact:</p><p class=\"\">Mary Shaughnessy</p><p class=\"\">For EcoEngineers</p><p class=\"\">marys@astorystore.com</p><p class=\"\">312.218.4508</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNEbZt7nZ:0-ecoengineers-expands-accreditation-and-scope-extensions-internationally/",
            "pub_date": "2025-02-04 16:13:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0JZ:0",
            "title": "TomTom falls after annual revenue drop, forecast for softer 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares in Dutch digital mapping specialist TomTom  fall 9.5% after it reports a 2024 revenue drop and forecasts a further decline for 2025</p><p class=\"\">** Its annual revenue was 574.4 million euros ($591.2 million), above the 573 million euros expected by analysts in a company-provided consensus</p><p class=\"\">** TomTom says it has limited visibility for 2025 and expects lower revenue of 505-565 million euros for the year</p><p class=\"\">** \"There's a lot of moving parts, more so than I've ever seen before in my career,\" CEO Harold Goddijn says</p><p class=\"\">** The shares are on track for their worst day since April 17, 2024 if the losses hold</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0JZ:0-tomtom-falls-after-annual-revenue-drop-forecast-for-softer-2025/",
            "pub_date": "2025-02-04 16:13:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1D8:0",
            "title": "J Kumar Infraprojects Dec-Quarter Consol PAT 997.3 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">J Kumar Infraprojects Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL PAT 997.3 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 14.87 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1D8:0-j-kumar-infraprojects-dec-quarter-consol-pat-997-3-mln-rupees/",
            "pub_date": "2025-02-04 16:14:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308381:0",
            "title": "Axis Capital Holdings Insider Sold Shares Worth $199,999,922, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Charles A Davis, Director, on February 03, 2025, sold 2,234,636 shares in Axis Capital Holdings  for $199,999,922. Following the Form 4 filing with the SEC, Davis has control over a total of 4,604,049 common shares of the company, with 60,879 shares held directly and 4,543,170 controlled indirectly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1214816/000121481625000045/xslF345X05/wk-form4_1738631328.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1214816/000121481625000045/xslF345X05/wk-form4_1738631328.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308381:0/",
            "pub_date": "2025-02-04 16:14:17",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0JM:0",
            "title": "Volvo Cars January sales down 5%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Volvo Cars'  sales fell by 5% year-on-year in January to 50,820 cars, the Sweden-based automaker said on Tuesday, adding that the decrease was largely due to the timing of the Chinese New Year.</p><p class=\"\">Volvo Cars, which is majority-owned by China's Geely Holding, said the number of electrified cars, including fully electric and plug-in hybrid vehicles, was up by 17% from last year and accounted for 44% of its total sales.</p><p class=\"\">Shares in the company fell 2.61% by 0810 GMT, underperforming a 0.6% drop in Stockholm's benchmark index .</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0JM:0-volvo-cars-january-sales-down-5/",
            "pub_date": "2025-02-04 16:14:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0F2:0",
            "title": "Infibeam Avenues Dec-Quarter Consol Net Profit 624 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Infibeam Avenues Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL NET PROFIT 624 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DEC-QUARTER CONSOL REVENUE FROM OPERATIONS 10.7 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0F2:0-infibeam-avenues-dec-quarter-consol-net-profit-624-mln-rupees/",
            "pub_date": "2025-02-04 16:14:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0MZ:0",
            "title": "UK's VH Global Energy gains on downplaying Trump tariff impact",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** VH Global Energy Infrastructure  rises 3% to 53p; among top gainers on FTSE small cap index (.FTSC)</p><p class=\"\">** Sustainable energy investor says its investment manager is reviewing more definitive details related to Trump tariffs</p><p class=\"\">** Concludes tariff has no impact on northbound flow of residual slurry from Mexico to terminals in Texas</p><p class=\"\">** Says potential negative financial impact of tariff on customer rev and co's terminal assets is low currently</p><p class=\"\">** Stock fell 14.5% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0MZ:0-uk-s-vh-global-energy-gains-on-downplaying-trump-tariff-impact/",
            "pub_date": "2025-02-04 16:14:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002086:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 3 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">China Retaliates With Levies, Antitrust Probe Into Google</strong></p><p class=\"\">The actions include 15% tariffs on U.S. coal and liquefied natural gas imports, as well as raising levies on crude oil, agricultural machinery and certain vehicles.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Asia Markets Jittery as Traders Gauge First Trade War Salvos</strong></p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new tariffs on the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin rebounds after Trump pauses Mexico, Canada tariffs. Here's why the crypto reacts to tariffs.</strong></p><p class=\"\">Bitcoin rebounded to above $100,000 Monday evening, after President Donald Trump said he would pause imposing tariffs on Mexico and Canada, respectively.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Tariffs Caused a Market Meltdown, but Investors Shook It Off</strong></p><p class=\"\">Stocks pared declines after the U.S. and Mexico struck a deal to delay new levies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</strong></p><p class=\"\">Manufacturers anticipate higher costs for steel and aluminum would arise from Trump administration tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump's threatened tariffs might not hit clothing retailers much now, but analysts warn price increases could backfire</strong></p><p class=\"\">Lots of clothes on store shelves could get a bit more expensive if new tariffs announced by President Donald Trump over the weekend eventually take hold. But after three years of price increases and higher costs of living, some Wall Street analysts say shoppers might be too worn out to buy any of it.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002086:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-3-am-et/",
            "pub_date": "2025-02-04 16:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002085:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 3 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nintendo Cuts Earnings, Switch Sales Guidance</strong></p><p class=\"\">The Japanese videogame maker said Tuesday that net profit dropped 42% from a year earlier to 237.19 billion yen, for the nine-month period.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">KKR Raises Offer Price for Fuji Soft in Bid to End Takeover Battle</strong></p><p class=\"\">The U.S. investment company bought a more than one-third stake in Fuji Soft in November and has said it is best positioned to work with the company to take it private.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The French lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Alphabet Earnings Could Provide Answers on AI and Cloud Concerns</strong></p><p class=\"\">Analysts surveyed by FactSet expect Alphabet to report a jump in earnings and revenue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">ADM's Outlook Is a Worry. Earnings Are Today.</strong></p><p class=\"\">Last week, the chip maker's rival, Intel,gave a softer-than-expected forecast for its March quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gardasil Worries Loom as Merck Reports Earnings</strong></p><p class=\"\">Merck shares are down more than 20% over the past 12 months after trouble with sales of its Gardasil vaccine in China</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nvidia's stock falls as these two questions dog investors</strong></p><p class=\"\">Wall Street is trying to assess how tariffs would impact the chip sector. Plus, the DeepSeek fallout lingers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Berkshire Adds to Its Sirius Position</strong></p><p class=\"\">It now holds a $2.9 billion stake in the satellite radio company.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002085:0-news-highlights-top-company-news-of-the-day-tuesday-at-3-am-et/",
            "pub_date": "2025-02-04 16:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Ind863CZd:0",
            "title": "Eezy Plc: Invitation to briefing on the 2024 Financial statements bulletin",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EEZY OYJ — INVESTOR NEWS — 4 FEBRUARY 2025 AT 10:15</p><p class=\"\">Eezy Plc: Invitation to briefing on the 2024 Financial statements bulletin</p><p class=\"\">Eezy Plc will publish the Financial statements bulletin on year 2024 on Thursday 13th February 2025 approx. at 8.00.</p><p class=\"\">A Finnish-language briefing for investors, analysts and media will be held on 13th February 2025 at 14.00 Finnish time as webcast at . https://eezy.events.inderes.com/q4-2024</p><p class=\"\">The webcast will be hosted by CEO Siina Saksi and CFO Joni Aaltonen. During the presentation, there will be an opportunity to ask questions.</p><p class=\"\">A recording of the webcast will be later available at the company's website.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Further information</strong> <strong class=\"root-Tkn6WL2y\">:</strong></p><p class=\"\">Joni AaltonenCFOEezy Plctel. +358 (0) 40 524 7270</p><p class=\"\">joni.aaltonen@eezy.fi</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Ind863CZd:0-eezy-plc-invitation-to-briefing-on-the-2024-financial-statements-bulletin/",
            "pub_date": "2025-02-04 16:15:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0I9:0",
            "title": "French far-right unlikely to back no-confidence vote against government",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    French far-right leader Jordan Bardella said on Tuesday that the French people would suffer most from more uncertainty over the budget, suggesting his party would likely not back no-confidence motions against Francois Bayrou's minority government.</p><p class=\"\">Bayrou rammed the 2025 budget bill through parliament on Monday, betting that he has made enough concessions to his rivals to survive a no-confidence motion that could cut short his premiership.</p><p class=\"\">\"The question is: Is it better to have a bad budget or no budget at all? We will decide tomorrow,\" Bardella told CNews television.</p><p class=\"\">\"I think that in the period we are going through, the French people would not benefit from a new form of instability that would strongly impact the economy,\" he said.</p><p class=\"\">In addition, based on pure voting numbers, Bayrou's government would in any case survive after the centre-left Socialist Party decided on Monday against supporting the upcoming no-confidence vote, scheduled for Wednesday, he said</p><p class=\"\">\"Mathematically, the government cannot fall,\" Bardella said.</p><p class=\"\">Pressure had been mounting on France to approve the much-delayed budget, with business leaders, European Union partners and voters showing impatience with a political class that has struggled to overcome its differences.</p><p class=\"\">France has been mired in political instability since President Emmanuel Macron's surprise decision to call a snap election last June backfired, with voters delivering a hung parliament just as an unexpected hole in public finances emerged.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0I9:0-french-far-right-unlikely-to-back-no-confidence-vote-against-government/",
            "pub_date": "2025-02-04 16:15:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002043:0",
            "title": "China Retaliates in a Calculated Way but Still Risks Further Escalation — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's retaliation against U.S. tariffs has been calibrated to send a message to Washington--and domestic audiences--without inflicting too much damage, Capital Economics says. \"But there is a risk that retaliation backfires by encouraging Trump to escalate tariffs further,\" says Julian Evans-Pritchard. CE calculates that the countermeasures target, at most, $20 billion of annual imports versus the more than $450 billion of Chinese goods in the crosshairs. China also announced nontariff moves, such as a probe into Google. For the most part, these are warnings that it will harm U.S. interests if needed but still give the option to walk the measures back, he says. Beijing presumably hopes it can reach a deal with Trump, but U.S.-China grievances run deep, making de-escalation challenging. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002043:0/",
            "pub_date": "2025-02-04 16:06:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Tnw8PKnDg:0",
            "title": "Golden Cariboo Intersects 172.6 m (566.3 ft) of 0.43 g/t gold Near Surface in the Halo Zone",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(TheNewswire)</p><p class=\"\">February 4, 2025 – TheNewswire- Vancouver, Canada – Golden Cariboo ResourcesLtd. (the “Company”)   (WKN:A402CQ) (FSE:3TZ)wishes to announce a significant extension to the Halo zone in drillhole QGQ24-18, which intersected 172.6 m (566.3 ft) of 0.43 g/t goldnear surface from a depth of 10.4 m (34.1 ft), including intersectionscontaining 26.3 m (86.3 ft) of 0.88 g/t gold and 20.0 m (65.6 ft) of1.17 g/t gold. Core recovery in the 26.3 m interval was only 47% (seeTable 1 below), which could result in overall lower values due to theloss of mineralized soft sulphide bearing, brecciated, fracturedand/or altered intervals. The 172.6 m intersection extends goldmineralization 60 m from the drill hole QGQ24-13 collar (see Figure 1enclosed and on the Company website www.goldencariboo.com), and extendsgold mineralization vertically by 125 m (410.1 ft) below surface,which returned up to 5.15 g/t gold in outcrop (see News Release dated December 3,2024 and Figure 2 enclosed). A deeperintersection of gold mineralization in QGQ24-18 was also encountered,which returned 19.22 m (63.1 m) of 0.45 g/t gold from 351.66 m (1153.7ft).</p><p class=\"\">Drill hole QGQ24-18, set up at an azimuth of035° and inclination of -45°, was the thirddrill hole completed following the Halo Discovery in holes QGQ24-13 to-15, with an objective to extend mineralization and enhance theunderstanding of the lithological, structural and vein geometries ofthe Discovery. Lithological contacts trend southeast with a steepsouthwest dip, while quartz-carbonate+/-pyrite veins with observedvisible gold occur both parallel and oblique to lithological contacts.Subsequent drill holes QGQ24-19 and QGQ24-20 were drilled in anortherly orientation in approximately 100 m step-outs to extend theHalo Discovery, have been previously announced to contain broad zonesof quartz veining with visible gold (see News Release dated November 26,2024), and assay results are pending.</p><p class=\"\">Golden Cariboo’s President and CEO, Frank Callaghan,stated “Drill hole QGQ24-18 represents another strong follow up tothe Discovery made this past summer, and reinforces our growingconfidence in the Halo zone’s potential. The broad intercepts ofgold mineralization, shallow overburden cover, shallow topography, andlocation approximately 4 kilometers from a major highway in centralBC, demonstrates the exceptional nature of this Discovery.”</p><p class=\"\">Table 1: Reported gold intercepts for QGQ24-18</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Drill hole</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">From (m)</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">To (m)</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Interval (m)*</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Au g/t</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Au g/t (capped^)</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">Interval (ft)*</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">QGQ24-18</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">10.40</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">183.00</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">172.60</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.43</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.42</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">566.3</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">including</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">10.40</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">36.70</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">26.30</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.88</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.88</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">86.3</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">which includes</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">10.40</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">26.21</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">15.81**</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">1.45</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">1.45</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">51.9</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">including</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">163.00</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">183.00</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">20.00</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">1.17</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">1.17</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">65.6</p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\">QGQ24-18</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">351.66</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">370.88</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">19.22</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.45</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">0.45</p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\">63.1</p></td></tr></tbody></table></div><p class=\"\">* Interval widths reported at this point haveinsufficient data to reliably estimate true width.</p><p class=\"\">**Core recovery for this interval is 23%.</p><p class=\"\">^ Gold grades have been capped at 10 g/t (“grams pertonne”).</p><p class=\"\">Click Image To View Full Size</p><p class=\"\">Figure 1: Reported drill intercepts in the Halo andNorth Hixon zones</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:528px;aspect-ratio:0.8799999999999999\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_Tnw8PKnDg-e6348eb3880324e55c67b011a8bd8228-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_Tnw8PKnDg-e6348eb3880324e55c67b011a8bd8228-resized.jpeg\" style=\"background-color:#f8f7f6\"/></picture></div></figure></span></p><p class=\"\">Click Image To View Full Size</p><p class=\"\">Figure 2: Cross section of drill hole QGQ24-18 in theHalo zone</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:763.1160572337043px;aspect-ratio:1.2718600953895072\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_Tnw8PKnDg-b4e59097ed3bb4d43384308e3724a3e5-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_Tnw8PKnDg-b4e59097ed3bb4d43384308e3724a3e5-resized.jpeg\" style=\"background-color:#7d8786\"/></picture></div></figure></span></p><p class=\"\">Click Image To View Full Size</p><p class=\"\">Figure 3: Location of the Halo Zone Discovery andnearby infrastructure</p><p class=\"\">QA/QC samples including blanks, standards and coarsereject duplicates constitute 5% of the total number of samples.</p><p class=\"\">The shipments were sent to the ALS laboratory in NorthVancouver (accredited) for laboratory analysis. Assays were crushed byALS to &gt;70% passing below 2 mm and split using a riffle splitter,and 1 kg splits were pulverized to &gt;85% passing below 75 microns.An aqua regia digest with an inductively coupled plasma atomicemission spectroscopy (ICP-AES) finish was used for 36-elementanalysis on 0.5 g aliquots. All samples were analyzed for gold contentby fire assay with an inductively coupled plasma atomic emissionspectroscopy (ICP-AES) finish on 50 g aliquots. Any sample returning&gt;10 g/t Au was reanalysed by fire assay with a gravimetric finishon a 50 g sample (ALS code: Au-GRA21). Additionally select sampleshave been chosen for metallic screening. For metallic screening, a 1kg pulp was screened to 100 microns. The entire oversize fraction andduplicate 50 g assays on the undersize fraction were completed.</p><p class=\"\">The technical information in this news release has beenreviewed by Jean Pautler, P.Geo., a qualified person with respect toNI 43-101.</p><p class=\"\">About Golden Cariboo Resources Ltd.</p><p class=\"\">Golden Cariboo Resources Ltd. is rediscovering theCariboo Gold Rush by proceeding with highly targeted drilling andtrenching programs on its Quesnelle Gold Quartz Mine property, whichis bordered by Osisko Development (NSE:ODV/TSXV:ODV) and partlyintertwined with them at the north end of the Cariboo Gold Project,and located along favorable corridor adjacent the Spanish and Eurekathrust faults over a 95,122 hectare (235,150 acre) area. Historically,over 101 placer gold creeks on the 90 km trendfrom the Cariboo Hudson mine north to the Quesnelle Gold Quartz Mineproperty have recorded production and successful placer miningcontinues to this day.  </p><p class=\"\">Golden Cariboo’s Quesnelle Gold Quartz Mine propertyis 4 km northeast of, and road accessible from, Hixon in centralBritish Columbia. The Project includes the Quesnelle Quartzgold-silver deposit, which was discovered in 1865 in conjunction withplacer mining activities. Hixon Creek, which dissects the oldworkings, is a placer creek which has seen small-scale placerproduction since the mid 1860s. </p><p class=\"\">For further information please contact:</p><p class=\"\">GOLDEN CARIBOO RESOURCES LTD      </p><p class=\"\">“J. Frank Callaghan”       </p><p class=\"\">J. Frank Callaghan, President &amp;CEO</p><p class=\"\">Tel:  604-669-6463</p><p class=\"\">VISIT OUR WEBSITE FOR MOREDETAILS</p><p class=\"\">www.goldencariboo.com</p><p class=\"\">LIKE AND FOLLOW</p><p class=\"\">Instagram,Facebook,X (Twitter), LinkedIn</p><p class=\"\">Neither the “CSE” Canadian Securities Exchange norits Regulation Service Provider (as that term is defined in thepolicies of the Canadian Securities Exchange) accepts responsibilityfor the adequacy or accuracy of this release.</p><p class=\"\">Cautionary Statements:</p><p class=\"\">This news release containsstatements which constitute “forward-looking information” withinthe meaning of applicable securities laws, including statementsregarding the plans, intentions, beliefs and current expectations ofthe Company with respect to future business activities and plans ofthe Company. Forward-looking information is often identified by thewords “may”, “would”, “could”, “should”, “will”,“intend”, “plan”, “anticipate”, “believe”,“estimate”, “expect” or similar expressions and includesinformation regarding; the expectation that the Company will receiveall necessary exemptions and approvals to complete the Offering; theexpectation that the Company will complete the Offering on the termsdisclosed, or at all; the expectation that the proceeds will be usedfor property exploration and for general working capital; theCompany’s exploration plans with respect to its Quesnelle GoldQuartz Mine property; and the anticipated participation of the insiderin the Offering.</p><p class=\"\">Such forward-looking statements arebased on a number of assumptions of management, including, withoutlimitation, that the Company will receive all necessary exemptions andapprovals to complete the Offering; that the Company will complete theOffering on the terms disclosed, or at all; that the proceeds will beused for property exploration and for general working capital; thatthe Company will have the resources required to proceed with itsexploration plans; that the Company will not run into regulatory orother barriers in carrying out its business plans; that the insiderwill participate in the Offering, on the terms and conditions and inthe amount currently expected by management; and that the Company willbe able to rely on the exemption from the formal valuation andminority shareholder approval requirements on the basisanticipated.</p><p class=\"\">Additionally, forward-lookinginformation involve a variety of known and unknown risks,uncertainties and other factors which may cause the actual plans,intentions, activities, results, performance or achievements of theCompany to be materially different from any future plans, intentions,activities, results, performance or achievements expressed or impliedby such forward-looking statements. Such risks include, withoutlimitation: that the Company will not receive the necessary exemptionsand approvals to complete the Offering; that the Company will notcomplete the Offering on the terms disclosed, or at all; that theCompany will be unable to use the proceeds for property explorationand for general working capital; that the Company may incurunanticipated costs; that the Company may not have the resourcesrequired to pursue its exploration plans; that the Company’soperations could be adversely affected by possible future governmentlegislation policies and controls or by changes in applicable laws andregulations; that the insider may not participate in the Offering onthe terms and conditions and in the amount currently expected bymanagement, or at all; and that the Company may not be able to rely onthe exemption from the formal valuation and minority shareholderapproval requirements on the basis currently expected. Suchforward-looking information represents management’s best judgmentbased on information currently available. No forward-looking statementcan be guaranteed and actual future results may vary materially.Accordingly, readers are advised not to place undue reliance onforward-looking statements or information. Neither the Company nor anyof its representatives make any representation or warranty, express orimplied, as to the accuracy, sufficiency or completeness of theinformation in this news release. Neither the Company nor any of itsrepresentatives shall have any liability whatsoever, under contract,tort, trust or otherwise, to you or any person resulting from the useof the information in this news release by you or any of yourrepresentatives or for omissions from the information in this newsrelease.</p><p class=\"\">The forward-looking statementsherein speak only as of the date they were originally made. TheCompany has no intention and undertakes no obligation to update orrevise any forward-looking statements, whether as a result of newinformation, future events or otherwise, except as required bylaw.</p><p class=\"\">Copyright (c) 2025 TheNewswire - All rights reserved.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Tnw8PKnDg:0-golden-cariboo-intersects-172-6-m-566-3-ft-of-0-43-g-t-gold-near-surface-in-the-halo-zone/",
            "pub_date": "2025-02-04 16:06:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0MU:0",
            "title": "India's Eris Lifesciences falls on Q3 profit drop",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Eris Lifesciences  shed 4.3% to 1,196.45 rupees</p><p class=\"\">** Drugmaker reports ~19% Y/Y drop in Q3 consol net profit, profit margin contracts to 11.9% from 20.9% year ago  </p><p class=\"\">** Even though revenue grew ~50% Y/Y, it was offset due to expenses tied to change in ERIS's business mix due to its acquisition of Biocon's  branded formulations business, ERIS says</p><p class=\"\">** ERIS's total expenses jump ~64% Y/Y</p><p class=\"\">** Avg rating of eight analysts on ERIS at \"Buy\"; median PT is 1,505 rupees - LSEG data</p><p class=\"\">** Stock gained ~51% in 2024</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0MU:0-india-s-eris-lifesciences-falls-on-q3-profit-drop/",
            "pub_date": "2025-02-04 16:06:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3308386:0",
            "title": "Celestica Insider Sold Shares Worth $1,170,945, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Yann L Etienvre, Chief Operations Officer, on January 30, 2025, sold 9,181 common shares in Celestica  for $1,170,945. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1030894/000095017025012645/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1030894/000095017025012645/xslF345X05/ownership.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3308386:0/",
            "pub_date": "2025-02-04 16:07:10",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}