{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463228:0",
            "title": "Saudi Fisheries Signs 12-month Contract for Feed Production with Arasco",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Saudi Fisheries (SASE:6050) on Monday signed a 12-month nonbinding memorandum of understanding with Arabian Agricultural Services Co., or Arasco. </p><p class=\"\">The fishing company and the agricultural products manufacturer will develop a general framework, define the work's scope, and explore potential areas for cooperation in feed production, according to a Tuesday release.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463228:0/",
            "pub_date": "2025-02-04 14:11:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CA:0",
            "title": "Navigation specialist TomTom's 2024 revenue drops on automotive market concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dutch digital mapping specialist TomTom  reported a 2% drop in its full-year revenue on Tuesday, slightly above expectations, impacted by a deterioration of the global automotive market.</p><p class=\"\">The Amsterdam-based company posted a revenue of 574.4 million euros ($591.17 million) for the year ended Dec. 31, above the 573 million euros expected in a company-provided consensus.</p><p class=\"\">It now expects group revenue between 505 million euros and 565 million euros, location technology revenue between 440 million euros and 490 million euros, and free-cash flow at break-even in 2025.</p><p class=\"\">($1 = 0.9716 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CA:0-navigation-specialist-tomtom-s-2024-revenue-drops-on-automotive-market-concerns/",
            "pub_date": "2025-02-04 14:12:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1C7:0",
            "title": "Austrian OMV reports FY results led by chemicals division",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Austrian oil and gas firm OMV  on Tuesday reported full-year results in line with expectations, as better performance at its chemicals division offset weakness at its fuel and feedstock and energy divisions. </p><p class=\"\">The Vienna-based company reported a clean operating result of 5.14 billion euros, down 15% year-on-year but roughly in line with expectations of 5.13 billion euros, according to a consensus compiled by Vara Research.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1C7:0-austrian-omv-reports-fy-results-led-by-chemicals-division/",
            "pub_date": "2025-02-04 14:12:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463226:0",
            "title": "Arab National Bank Closes SAR3.4 Billion Additional Tier 1 Capital Sukuk Offering",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Arab National Bank (SASE:1080) finalized its private placement of a 3.35 billion-Saudi-riyal additional tier 1 capital sukuk. </p><p class=\"\">A total of 3,350 perpetual bonds, with a par value of 1 million riyals and carrying an annual return rate of 6.20% were issued, according to a Tuesday release from the Saudi Arabia-based bank.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463226:0/",
            "pub_date": "2025-02-04 14:14:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV0A6:0",
            "title": "OMV FY Group Sales Of Eur 34 Bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMV AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GROUP SALES OF EUR 34 BN WITH HIGHER OPERATING CASH FLOW IN FY 2024</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS OPERATING RESULT AT EUR 5.1 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CASH FLOW FROM OPERATING ACTIVITIES EXCLUDING NET WORKING CAPITAL EFFECTS STRONG AT EUR 5.3 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY 2025 OMV GROUP EXPECTS ORGANIC CAPEX AT AROUND EUR 3.6 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS NET INCOME ATTRIBUTABLE TO STOCKHOLDERS OF EUR 2.1 BILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY CLEAN CCS EARNINGS PER SHARE WERE EUR 6.39</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025:  OMV GROUP ORGANIC CAPEX PROJECTED AT AROUND EUR 3.6 BN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 AVERAGE BRENT PRICE USD 75/BBL EXPECTED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 OMV HYDROCARBON PRODUCTION AROUND 300 KBOE/D EXPECTED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 AVERAGE REALIZED NATURAL GAS PRICE AROUND EUR 35/MWH, WITH A PRICE FORECAST OF EUR 40-45/MWH</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025:  REFINERY UTILIZATION RATE EUROPE BETWEEN 85 AND 90%</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2025 REFINERY UTILIZATION RATE EUROPE BETWEEN 85 AND 90%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV0A6:0-omv-fy-group-sales-of-eur-34-bln/",
            "pub_date": "2025-02-04 14:14:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CB:0",
            "title": "Siltronic reports FY preliminary sales in line with market expectations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">German semiconductor materials supplier Siltronic  reported a 7% drop in its preliminary annual sales on Tuesday, citing high inventory levels amid a delay in demand recovery.</p><p class=\"\">    The company, which makes silicon wafers used in semiconductor chips, posted revenue of 1.41 billion euros  ($1.45 billion) for 2024, down from 1.51 billion euros a year earlier but in line with analysts' forecast of 1.40 billion euros in a poll by Vara research.</p><p class=\"\">($1 = 0.9713 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CB:0-siltronic-reports-fy-preliminary-sales-in-line-with-market-expectations/",
            "pub_date": "2025-02-04 14:14:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463230:0",
            "title": "UBS Plans $3 Billion Share Repurchases in FY25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  plans to repurchase $1 billion worth of its shares in the first half and another $2 billion in the second half. </p><p class=\"\">The Swiss bank announced the repurchase targets with its 2024 results on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463230:0/",
            "pub_date": "2025-02-04 14:15:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463219:0",
            "title": "Container Throughput at Chinese Trade Corridor Rises in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Container throughput at China's New International Land-Sea Trade Corridor, which connects the western part of the country to the world, jumped 31% to 104,000 twenty-foot equivalent units in January, Xinhua News Agency reported Monday, citing the China Railway Nanning Group. </p><p class=\"\">The 100,000 TEU milestone was achieved the fastest during the period since its opening in 2017, the report said. </p><p class=\"\">Among those transported through the corridor in January include phosphate rock powder, zinc concentrate, pyrophyllite, paper pulp and other goods, the report said. </p><p class=\"\">The trade corridor is based in Chongqing and spans railways, sea routes, and highways in southern Chinese provincial regions, the report said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463219:0/",
            "pub_date": "2025-02-04 14:15:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV008:0",
            "title": "Reka Kumi Invests In Energy Efficiency And Co2 Emissions Reduction",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reka Industrial Oyj :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">REKA KUMI INVESTS IN ENERGY EFFICIENCY AND CO2 EMISSIONS REDUCTION AT THE AURA FACTORY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">TOTAL INVESTMENT IN ENERGY PROJECT IS ABOUT 1.35 MILLION EUROS, BUSINESS FINLAND HAS GRANTED PROJECT 20% ENERGY SUBSIDY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV008:0-reka-kumi-invests-in-energy-efficiency-and-co2-emissions-reduction/",
            "pub_date": "2025-02-04 14:03:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:0b2e09f68094b:0",
            "title": "Thomas Cook shares drop 12% after firm's Q3 net profit falls 40% to Rs 50 crore",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thomas Cook shares dropped over 12 percent on February 4, a day after the company announced its Q3 FY25 earnings results. The company reported a major decline of nearly 40 percent in its Q3 net profit during the post-market hours of February 3.</p><p class=\"\">Shares of Thomas Cook (India) Ltd are trading at Rs 143.95 apiece, as seen at 11.24 am. This marks a decline of 12.01 percent from the stock's previous closing price.</p><p class=\"\">Read about Stock Market updates LIVE</p><p class=\"\">Thomas Cook's consolidated results for the quarter ended December 2024 reflected higher sales, with an increase of 8.87 percent to Rs 2,061.01 crore, as against Rs 1,893.13 crore in the same quarter of the previous year (December 2023).</p><p class=\"\">Despite the rise in sales, the company experienced a significant decline in net profit, which dropped by 39.82 percent to Rs 49.58 crore in the quarter ended December 2024, from Rs 82.39 crore in the corresponding quarter of the previous year. Therefore, higher sales did not translate into proportional profitability, possibly due to increased costs or reduced margins.</p><p class=\"\">In another exchange filing, the company notified that Madhavan Menon, chairperson of Thomas Cook India, has been redesignated as non-executive chairman of the board of the travel company. In its filings to BSE on Monday, the travel company said that he will change from his current role starting 1 June.</p><p class=\"\">Menon was re-appointed as executive chairman of the company for another term of five years, back in July 2023. However, the board has now redesignated him as non-executive chairman upon him having requested for the same.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:0b2e09f68094b:0-thomas-cook-shares-drop-12-after-firm-s-q3-net-profit-falls-40-to-rs-50-crore/",
            "pub_date": "2025-02-04 14:05:30",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUABM8LCD:0",
            "title": "Fagron Acquires Guinama In Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fagron NV :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FAGRON SOLIDIFIES ITS LEADERSHIP POSITION WITH THE ACQUISITION OF GUINAMA IN SPAIN</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ACQUISITION VALUED AT €22 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">KEY SYNERGIES INCLUDE OPTIMIZED SOURCING AND CENTRALIZED WAREHOUSING</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUABM8LCD:0-fagron-acquires-guinama-in-spain/",
            "pub_date": "2025-02-04 14:06:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1CD:0",
            "title": "At & S Says Anticipates Price Pressure To Continue Beyond End Of Fiscal Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">AT &amp; S Austria Technologie &amp; Systemtechnik AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ANTICIPATES PRICE PRESSURE TO CONTINUE BEYOND END OF FISCAL YEAR</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">AT&amp;S NOW ASSUMES FY 2026/27 REVENUE OF ABOUT EUR 2.1 TO EUR 2.4 BILLION (PREVIOUSLY: EUR 3 BILLION)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY 2026/27 EXPECTS AN EBITDA MARGIN OF 24 TO 28% (PREVIOUSLY: 27 TO 32%)</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">REDUCTION OF UP TO 1,000 EMPLOYEES TAKING PLACE AT EXISTING LOCATIONS, NEARLY COMPLETED</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">OUTLOOK 2024/25: PLANNING INVESTMENTS OF JUST UNDER EUR 500 MILLION (PREVIOUSLY: ROUGHLY EUR 500 MILLION)</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1CD:0-at-s-says-anticipates-price-pressure-to-continue-beyond-end-of-fiscal-year/",
            "pub_date": "2025-02-04 14:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA32HSXF:0",
            "title": "Lugman Group Withdraws From Purchase Of “Industrial Park Fechenheim”",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Clariant AG :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">LUGMAN GROUP WITHDRAWS FROM PURCHASE OF “INDUSTRIAL PARK FECHENHEIM”</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CLARIANT AG - REMAINS COMMITTED TO DIVEST \"INDUSTRIAL PARK FECHENHEIM\" AS COMPANY HAS NO OPERATIONAL ACTIVITIES IN INDUSTRIAL PARK</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA32HSXF:0-lugman-group-withdraws-from-purchase-of-industrial-park-fechenheim/",
            "pub_date": "2025-02-04 14:06:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV055:0",
            "title": "US dollar ratchets higher as China tariffs kick in; Aussie slides with yuan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Deadline passes without deal, spurring reciprocal measures from Beijing</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">U.S. President Trump earlier granted 30-day reprieve to Canada, Mexico</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Yuan, Aussie, Canadian dollar, Mexican peso, euro all see selling</li></ul></span></div><span><p class=\"\">    The dollar strengthened broadly on Tuesday after U.S. tariffs on Chinese goods came into effect, triggering swift retaliation from Beijing and prompting a selloff in the Chinese yuan and the Australian dollar.</p><p class=\"\">        The Canadian dollar and Mexican peso also weakened despite earlier winning a reprieve on their own U.S. tariffs. The euro declined, with the European Union also finding itself in Washington's trade crosshairs.</p><p class=\"\">    U.S. President Donald Trump's administration slapped additional 10% tariffs on imports from China from 12:01 a.m. ET on Tuesday (0501 GMT).   </p><p class=\"\">    Beijing responded with tariffs to take effect Feb. 10 on things such as American cars, farm equipment and energy shipments.  </p><p class=\"\">    That reignited worries about a widening and possibly protracted global trade war, which had receded somewhat overnight following Trump's last-minute deals with Ottawa and Mexico City.  </p><p class=\"\">    \"Unlike Canada and Mexico, it is clearly harder for the U.S. and China to agree on what Trump demands economically and politically,\" said Gary Ng, senior economist at Natixis.  </p><p class=\"\">    \"The previous market optimism on a quick deal still looks uncertain. Even if the two countries can agree on some issues, it is possible to see tariffs being used as a recurrent tool, which can be a key source of market volatility this year.\"  </p><p class=\"\">        The Chinese yuan edged down about 0.3% to 7.3213 per dollar in offshore trading , although that was well back from the record trough reached overnight at 7.3765 yuan. There is no official yuan trading until Wednesday, with mainland markets still closed for the week-long Lunar New Year holidays.</p><p class=\"\">    The Aussie , which often acts as a liquid proxy for the yuan, sank 0.7% to $0.6186, but that was well above Monday's low of $0.60886, the weakest level in nearly five months.  </p><p class=\"\">Those currencies, along with Canada's loonie, Mexico's peso and the euro, had rebounded sharply overnight after both Canadian Prime Minister Justin Trudeau and Mexican President Claudia Sheinbaum said they had agreed to bolster border enforcement efforts in response to Trump's demand to crack down on immigration and drug smuggling, leading to a 30-day reprieve on 25% tariffs.</p><p class=\"\">The loonie  lost 0.4% to C$1.4485 against its U.S. counterpart on Tuesday, following a sharp rebound from a low of C$1.4792 on Monday, the weakest level since 2003.</p><p class=\"\">The peso was about 0.4% lower at 20.4100 per dollar , but well above the previous session's nearly three-year trough at 21.1882.</p><p class=\"\">\"Risk sentiment improved markedly following the late-day announcement, but we'd caution that trade concerns could start to weigh on markets again if there are no tangible signs of progress on a lasting deal by the end of the month,\" TD Securities analysts wrote in a note.</p><p class=\"\">\"Our tracking of trading uncertainty is rising, not falling, suggesting markets will continue to price in a risk premium in FX associated with this theme of disruption.\"</p><p class=\"\">TD expects \"USDCAD dips will be brief and shallow\", and the currency pair will rise to C$1.50 by end-March, based on Canada's \"relatively weak macro story\", as well as trade uncertainty.</p><p class=\"\">The euro  slid 0.4% to $1.0297, after recovering from the lowest since November 2022 at $1.0125 on Monday.</p><p class=\"\">    Sterling  declined 0.4% to $1.24047, despite Trump's suggestion that Britain might be spared tariffs.</p><p class=\"\">The U.S. dollar gained 0.3% to 155.24 yen .</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV055:0-us-dollar-ratchets-higher-as-china-tariffs-kick-in-aussie-slides-with-yuan/",
            "pub_date": "2025-02-04 14:06:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463214:0",
            "title": "Australian Shares Flat as Trump Moves to Delay Taxes on Canada, Mexico;Seek, Xref Agree to Terminate Scheme for Proposed Merger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian shares were flat with a negative bias on Tuesday's close, as US President Trump agreed with Mexico and Canada to delay tariffs for a month. </p><p class=\"\">The S&amp;P/ASX 200 Index changed little to close at 8,374. </p><p class=\"\">Trump's move to postpone tariffs on Mexico and Canada helped shift market sentiment, reversing Monday's losses, Bloomberg reported. </p><p class=\"\">With no deal yet, it is unclear whether talks have failed or if it is in a \"wait and see\" phase, making markets increasingly edgy, the report said. </p><p class=\"\">On the domestic front, Australia's national home values barely moved in January, with the CoreLogic Home Value Index little changed, the property data provider said in a report. </p><p class=\"\">Consumer confidence in Australia rose to its highest level in nearly three years last week, with households feeling more upbeat about their short-term economic prospects, according to a survey by ANZ Research and Roy Morgan Research. </p><p class=\"\">The Melbourne Institute's monthly inflation gauge edged 0.1% higher in January, according to a Monday report. </p><p class=\"\">In company news, Westpac Banking  appointed Paul Fowler as chief executive of its business and wealth unit. </p><p class=\"\">Woolworths Group  reorganized its retail business, with Metro, red meat supply business Greenstock, and Woolworths Food Company Retail moving into the retail business. </p><p class=\"\">Seek  and Xref  agreed to terminate their scheme implementation deed for Seek to acquire Xref. Shares of Xref fell nearly 23% at market close.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463214:0-australian-shares-flat-as-trump-moves-to-delay-taxes-on-canada-mexico-seek-xref-agree-to-terminate-scheme-for-proposed-merger/",
            "pub_date": "2025-02-04 14:07:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463218:0",
            "title": "Court Sides with Shuaa Capital in Former Board Member's Labor Dues Claim",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Shuaa Capital (DFM:SHUAA) received a favorable court judgment in a case filed by a former board member claiming labor dues. </p><p class=\"\">The Dubai-listed financial services company said Tuesday the former board member had filed a claim for 22 million Emirati dirhams of labor dues.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463218:0/",
            "pub_date": "2025-02-04 14:09:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV09L:0",
            "title": "Automation Systems Says Consob Suspends Review Period For Offer Document Approval In Bid For Piovan",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Piovan SpA  on behalf Automation Systems SpA:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAID ON MONDAY ITALY'S MARKET WATCHDOG CONSOB HAD SUSPENDED TIME LIMIT OF REVIEW PERIOD FOR MANDATORY TENDER OFFER DOCUMENT IN BID FOR PIOVAN </p></li></ul><p class=\"\"> Further company coverage:  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV09L:0-automation-systems-says-consob-suspends-review-period-for-offer-document-approval-in-bid-for-piovan/",
            "pub_date": "2025-02-04 14:09:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463220:0",
            "title": "Dredging Corporation of India's Profit Slides in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Dredging Corporation of India  witnessed a decline in its profit to 160.6 million Indian rupees in the fiscal third quarter ended Dec. 31, 2024, from 272.3 million rupees a year ago. </p><p class=\"\">Earnings per share contracted to 5.73 rupees compared with 9.72 rupees of the corresponding period last year, according to a Monday filing with the Indian stock exchanges. </p><p class=\"\">Revenue from operations in fiscal Q3 increased to 3.24 billion rupees from 2.65 billion rupees a year earlier. </p><p class=\"\">Shares of the company were up nearly 2% in recent trade.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463220:0/",
            "pub_date": "2025-02-04 14:09:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV0E0:0",
            "title": "Ossdsign Proposes That No Dividend Be Paid For 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OssDsign AB :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOD PROPOSES DIRECTORS PROPOSES THAT NO DIVIDEND BE PAID FOR FINANCIAL YEAR 2024</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV0E0:0-ossdsign-proposes-that-no-dividend-be-paid-for-2024/",
            "pub_date": "2025-02-04 14:00:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_Pexv7gFda:0",
            "title": "Publication of quarterly report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV Aktiengesellschaft</strong></p><p class=\"\">by Thomas Hölzl</p><p class=\"\"><em>Publication of quarterly report</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV Aktiengesellschaft: Publication of quarterly report</strong></p><p class=\"\">Vienna (pta000/04.02.2025/07:00 UTC+1) - OMV Aktiengesellschaft announces that the following financial reports shall be disclosed:</p><p class=\"\">Report: Quarter report 2024 (Q4)</p><p class=\"\">Web publication: https://www.omv.com/en/investors/publications/quarterly-publications/2024/q4</p><p class=\"\">Publication date: 04.02.2025</p><p class=\"\">Short description: OMV Group Report January–December and Q4 2024</p><p class=\"\">(end)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><th>Emitter:</th><td>OMV AktiengesellschaftTrabrennstraße 6-81020 WienAustria</td><td rowspan=\"4\"></td></tr><tr><th>Contact Person:</th><td>Thomas Hölzl</td></tr><tr><th>Phone:</th><td>+43 1 40440/23760</td></tr><tr><th>E-Mail:</th><td>compliance@omv.com</td></tr><tr><th>Website:</th><td>www.omv.com</td><td></td></tr><tr><th>ISIN(s):</th><td>AT0000743059 (Share)</td><td></td></tr><tr><th>Stock Exchange(s):</th><td>Vienna Stock Exchange (Official Trade)</td><td></td></tr></tbody></table></div><p class=\"\">[ source: https://www.pressetext.com/news/1738648800956 ]</p><p class=\"\">(c) pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext. Archive: https://www.pressetext.com/channel/Adhoc The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_Pexv7gFda:0-publication-of-quarterly-report/",
            "pub_date": "2025-02-04 14:01:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PexnLTQ1a:0",
            "title": "PTA-AFR: OMV Aktiengesellschaft: Publication of quarterly report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV Aktiengesellschaft</strong></p><p class=\"\">by Thomas Hölzl</p>Publication of quarterly report Vienna (pta/04.02.2025/07:00) - OMV Aktiengesellschaft announces that the following financial reports shall be disclosed: report: quarter report 2024 (Q4) web publication: https://www.omv.com/en/investors/publications/quarterly-publications/2024/q4 publication date: 04.02.2025 Short description: OMV Group Report January–December and Q4 2024 (end) emitter: OMV Aktiengesellschaft address: Trabrennstraße 6-8, 1020 Wien country: Austria contact person: Thomas Hölzl phone: +43 1 40440/23760 e-mail: compliance@omv.com website: www.omv.com ISIN(s): AT0000743059 (share) stock exchanges: official trade in Vienna pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext.adhoc. Archive: http://adhoc.pressetext.com The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PexnLTQ1a:0-pta-afr-omv-aktiengesellschaft-publication-of-quarterly-report/",
            "pub_date": "2025-02-04 14:01:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446478:0",
            "title": "Australian Shares Slip as US Imposes Tariffs on China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P/ASX 200 Index edged down 0.06% to close at 8,374 on Tuesday, reversing earlier gains after the U.S. imposed 10% tariffs on Chinese goods, as previously promised by President Donald Trump.</p><p class=\"\">In response, Beijing announced retaliatory tariffs on U.S. exports, including oil, gas, coal, cars, and farm equipment, set to take effect on February 10.</p><p class=\"\">However, losses were limited by the news that the U.S. had postponed planned tariffs on Mexico and Canada for a month following successful negotiations.</p><p class=\"\">In Australia, investors are awaiting December trade figures, due for release on Thursday, to gauge the health of the country’s export-driven economy.</p><p class=\"\">Heavyweight sectors such as banks, energy, and consumer stocks led the decline, with notable losses from Commonwealth Bank (-0.3%), Woodside Energy (-0.9%), and Wesfarmers (-1%).</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446478:0-australian-shares-slip-as-us-imposes-tariffs-on-china/",
            "pub_date": "2025-02-04 14:01:23",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OQ0HV:0",
            "title": "BNP Paribas beats Q4 forecast but trims profit target for year ahead",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">BNP reports 15.7% rise in Q4 net profit</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Investment banking revenue climbs 20%, driven by FICC trading</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Cuts 2025 profitability target, flags further cost savings</li></ul></span></div><span><p class=\"\">France's BNP Paribas  reported a forecast-beating jump in net income in the fourth quarter as its investment bankers rode a surge in trading activity, but the lender lowered a key profit target for 2025 and said it would cut costs further.</p><p class=\"\">The euro zone's biggest bank by assets said group net income rose by 15.7% to 2.32 billion euros ($2.39 billion) for the three months ending in December, beating the 2.24 billion-euro average of 13 analyst estimates compiled by the company. </p><p class=\"\">Revenue over the period increased by 10.8% to 12.1 billion euros, also above the 11.6 billion-euro analyst average estimate. </p><p class=\"\">BNP has disappointed investors in recent quarters and its shares were among the worst performing of major lenders last year, losing nearly 7% while European rivals' stock (.SX7P) soared, so Tuesday's fourth-quarter and full-year results will be a relief for long-time CEO Jean-Laurent Bonnafe.</p><p class=\"\">Investment banking revenue climbed 20% in the fourth quarter, driven by revenue from trading in fixed income, currencies and commodities (FICC) soaring 34% and equity prime services' sales by 30%. </p><p class=\"\">BNP's performance in FICC trading beat the average growth among Wall Street banks, which Jefferies calculated at 26%.</p><p class=\"\">Bonnafe has bet on BNP's investment bank to fill gaps left by retreating European rivals and compete with dominant U.S. peers.</p><p class=\"\">In recent quarters, the investment bank has helped offset sluggish retail performance at BNP, as record inflows into government-regulated high-interest savings squeezed French banks' margins, while lenders elsewhere in the euro zone benefited from higher rates.</p><p class=\"\">Yet BNP also struck a cautious note on the outlook. </p><p class=\"\">The bank revised a key profitability target down for 2025, without giving a clear reason, and announced 600 million euros more in cost savings in 2026, on top of 600 million euros this year. </p><p class=\"\">BNP is now targeting a return on tangible equity (ROTE) of 11.5% for this year, down from a previous target of 11.5%-12%. </p><p class=\"\">The group expects to reach 12% ROTE in 2026, but said the number should rise, helped by its 5.1 billion-euro acquisition of AXA's asset management arm, set to close mid-year.</p><p class=\"\">BNP has also been hit by political uncertainty in debt-laden France since President Emmanuel Macron called snap elections in June, resulting in a hung parliament.          </p><p class=\"\">($1 = 0.9712 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OQ0HV:0-bnp-paribas-beats-q4-forecast-but-trims-profit-target-for-year-ahead/",
            "pub_date": "2025-02-04 14:01:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV089:0",
            "title": "India's Sundaram Finance jumps on strong Q3 disbursement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Sundaram Finance  jumps ~8% to 4,648.95 rupees</p><p class=\"\">** NBFC posts 19% y/y growth in Q3 disbursement</p><p class=\"\">** Systematix Institutional Equities says co gains market share after exceptionally strong Q3 disbursements growth vs peers</p><p class=\"\">** Raises PT to 4,450 rupees from 4,300 rupees; retains \"hold\"</p><p class=\"\">** Stock rated \"hold\" on avg; median PT is 4,525 rupees - LSEG</p><p class=\"\">** SNFN up 4% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV089:0-india-s-sundaram-finance-jumps-on-strong-q3-disbursement/",
            "pub_date": "2025-02-04 14:02:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1C8:0",
            "title": "Flex LNG Expects Results In 2025 To Be In Line With 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">FLEX LNG Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DECLARED A DIVIDEND FOR Q4 2024 OF $0.75 PER SHARE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SHORT TO MEDIUM TERM OUTLOOK FOR LNG SHIPPING IS CHALLENGING GIVEN NUMEROUS SHIP DELIVERIES AHEAD OF RAMPED UP NEW EXPORT CAPACITY</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">EXPECTS FINANCIAL PERFORMANCE IN 2025 TO BE IN LINE WITH 2024</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1C8:0-flex-lng-expects-results-in-2025-to-be-in-line-with-2024/",
            "pub_date": "2025-02-04 14:02:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU198:0",
            "title": "Telenor's Grameenphone Q4 Adj EBITDA Down At NOK 2.18 Bln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Telenor ASA :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GRAMEENPHONE Q4 REVENUE NOK 3,808  MILLION VERSUS NOK 3,964 MILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GRAMEENPHONE Q4 ADJUSTED EBITDA NOK 2,184 MILLION VERSUS NOK 2,428 MILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">GRAMEENPHONE: DURING Q4  NUMBER OF SUBSCRIPTIONS DECREASED BY NOK 0.3 MILLIONS</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU198:0-telenor-s-grameenphone-q4-adj-ebitda-down-at-nok-2-18-bln/",
            "pub_date": "2025-02-04 14:02:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463215:0",
            "title": "Market Chatter: Independent Report Says Eight Chinese Firms Receive Warnings, Fine For Environmental Rule Violations",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">An independent report found that about eight listed Chinese companies were reprimanded or fined due to environmental regulation breaches, according to the Daily Economic News' report on Jan. 27. </p><p class=\"\">The data was collected on the fourth week of January by non-government organization Institute for Public Environmental Research, the report said. </p><p class=\"\">Anhui Tongfeng Electronics Company  and United Faith Auto-Engineering  were among those that were fined by their respective local governments. Tongfeng Electronics received a 320,000 yuan fine for failing to purchase hydrogen peroxide due to cost considerations despite obtaining an environmental protection acceptance in April 2023, while United Faith was slapped with a 640,000 yuan fine for entrusting the treatment of hazardous waste to an unlicensed unit, the report said. </p><p class=\"\">Lingshi County China Coal Jiuxin Coking was also warned for exceeding pollutant emissions and failing to take measures according to environmental impact assessment requirements, the report said. </p><p class=\"\">Moreover, Anhui Liuguo Chemical  was reprimanded for starting the construction of a phosphorus resource full-efficiency utilization technology improvement and transformation project without getting environmental impact assessment approvals, the report said. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463215:0/",
            "pub_date": "2025-02-04 14:02:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463216:0",
            "title": "Hirogin's Nine-Month Profit Hikes 24%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hirogin  recorded a 24% rise in attributable profit for the nine months ended Dec. 31, 2024, to 29 billion yen from 23.3 billion yen in the year-ago period, a Monday bourse filing said. </p><p class=\"\">Earnings per share were 95.74 yen in the nine months, up from 75.9 yen in the corresponding period of the last fiscal year. </p><p class=\"\">The banking services company saw a 6% rise in ordinary revenue to 149.2 billion yen in the period from 140.8 billion yen a year prior. </p><p class=\"\">The company expects an attributable profit of 35 billion yen, a basic EPS of 115.67 yen per share, an ordinary revenue of 50.5 billion yen, and a year-end dividend of 47 yen per share for the fiscal year ending March 31.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463216:0/",
            "pub_date": "2025-02-04 14:03:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463213:0",
            "title": "Lendlease Global REIT Reports Lower DPU in Fiscal H1",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Lendlease Global REIT's  distribution per unit or DPU declined 14% for the fiscal first half ended Dec. 31, 2024, to SG$0.018 from SG$0.021 a year earlier, a filing with the Singapore Exchange said on Monday. </p><p class=\"\">Net property income was down 20% year over year to SG$74.9 million from SG$93.4 million. </p><p class=\"\">Gross revenue declined 14% year over year to SG$103.6 million from SG$119.9 million, mainly due to the absence of supplementary rent in relation to the lease restructure of Sky Complex. </p><p class=\"\">Committed portfolio occupancy stood at 92.3% as at Dec. 31, 2024. </p><p class=\"\">Shares of the REIT were down nearly 2% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463213:0/",
            "pub_date": "2025-02-04 14:03:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463217:0",
            "title": "UBS Reports Lower FY24 Net Profit; Total Revenue Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">UBS Group  said Tuesday that net profit for full-year 2024 decreased, while revenue increased year over year. </p><p class=\"\">Net profit attributable to shareholders for the 12 months ended Dec. 31, 2024, was $5.09 billion, compared with $27.37 billion earlier. EPS moved to $1.52 from $8.30. </p><p class=\"\">The Swiss lender's total revenue was $48.61 billion, compared with $40.83 billion a year ago. </p><p class=\"\">Meanwhile, the board intends to propose a dividend of $0.90 per share for the period, payable April 17 to shareholders on record April 16. It paid $0.70 per share a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463217:0/",
            "pub_date": "2025-02-04 14:04:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}