{
    "data": [
        {
            "id": "DJN_SN20260227010716:0",
            "title": "Trump suggests military attack on Iran is still on the table, boosting oil prices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Barbara Kollmeyer</span></p><p class=\"\"><span>U.S. government on Friday urges nonemergency government workers to leave Israel</span></p><p class=\"\"><span>The State Department on Friday urged nonemergency U.S. workers to leave Israel after talks on Tehran's nuclear program ended Thursday without a deal.</span></p><p class=\"\"><span>Oil prices were up sharply Friday after President Donald Trump reportedly suggested that a U.S. military strike on Iran is still being considered after a deal to end Tehran's nuclear ambitions didn't materialize this week.</span></p><p class=\"\"><span>Trump told reporters outside the White House that he would \"love not to use\" the U.S. military to attack Iran, but \"sometimes you have to,\" according to a report from CNBC.</span></p><p class=\"\"><span>Oil prices moved back up toward session highs in the wake of those reported comments. April West Texas Intermediate crude (CLJ26) (CL.1) rose 2.6% to $66.91 a barrel. The contract is set to gain nearly 1% for the week and over 3% for the month of February, FactSet data show.</span></p><p class=\"\"><span>April Brent crude (BRNJ26) was up 2.5% to $72.50 a barrel, with the contract set to gain 1% for the week and 4.6% for the month.</span></p><p class=\"\"><span>The oil market is providing a reminder that until \"documents are signed and money changes hands, there is no deal,\" Colin Cieszynski, portfolio manager and chief market strategist at SIA Wealth Management, told MarketWatch.</span></p><p class=\"\"><span>The Oman-mediated talks between the U.S. and Iran in Geneva ended on Thursday with \"significant progress,\" Badr Albusaidi, Oman's foreign minister, said in a post on X Thursday. He said talks would resume after \"consultation in the respective capitals,\" with the two sides holding \"technical level\" discussions next week in Vienna.</span></p><p class=\"\"><span>\"Talks are extending into another week, but ironically, the longer they go on, the higher oil prices seem to go. This is because the markets are sensing that the Iranians could be stringing [President] Trump along and at one point, Mr. Trump may lose his patience and tell his negotiators to come home,\" Edward Meir, an analyst at Marex, said in comments emailed Friday morning.</span></p><p class=\"\"><span>\"At the end of the day, it should not take weeks and weeks to come to an agreement and the markets are getting nervous waiting,\" Meir added.</span></p><p class=\"\"><span>Read: U.S.-Iran nuclear talks end, but with hope that negotiations continue. That still leaves the oil market in limbo.</span></p><p class=\"\"><span>Congressional Democrats are expected to force a vote on a war powers resolution linked to Iran next week, in a bid to prevent Trump from taking military action against Iran without the prior approval of Congress.</span></p><p class=\"\"><span>Friday saw the U.S. State Department authorize nonemergency U.S. government personnel and their family members to leave Israel \"due to safety risks,\" which weren't specified. The order also warned of potential restrictions on travel to areas of Israel, the Old City of Jerusalem and the West Bank, while suggesting \"persons may wish to consider leaving Israel while commercial flights are available.\"</span></p><p class=\"\"><span>Trump has said the U.S. military has assembled an armada of warships and fighter jets near Iran.</span></p><p class=\"\"><span>David Morrison, senior market analyst at Trade Nation, said markets are also focused on the meeting of the Organization of the Petroleum Exporting Countries and its allies on Sunday. There has been speculation that members may resume production increases starting in April, he said, after the group decided to leave output quotas unchanged for the first quarter of 2026.</span></p><p class=\"\"><span>\"While OPEC+ estimates that supply and demand will be in balance throughout this year, the International Energy Agency maintains its forecast of an oversupply of 3.7 million barrels per day throughout 2026,\" Morrison said in a note to clients.</span></p><p class=\"\"><span>-Barbara Kollmeyer</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260227010716:0/",
            "pub_date": "2026-02-28 02:55:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:8373a4c61c7bf:0",
            "title": "iShares Silver Trust SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The iShares Silver Trust, a grantor trust formed under New York law, has released its 2025 10-K report, showcasing a year of substantial growth driven by a significant increase in silver prices. The Trust, which aims to reflect the performance of the price of silver, provides investors with a cost-effective alternative to investing in physical silver. The Trust's shares are backed by silver held by JPMorgan Chase Bank N.A., London Branch, and are listed on NYSE Arca under the ticker symbol SLV.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Asset Value:</span></strong><span> $38,046 million, increased 183.90% from $13,401 million at December 31, 2024, primarily due to a 149.01% increase in the price of silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Resulting from Operations:</span></strong><span> $21,306.9 million, driven by a net realized gain of $23.6 million from investment in silver bullion sold to pay expenses and an unrealized gain on investment in silver bullion of $17,752.9 million.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Investment Loss:</span></strong><span> $95.5 million, primarily due to the Sponsor’s fees, which were 0.50% of the Trust’s average weighted assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $23.75 for the quarter ended December 31, 2025, reflecting the significant appreciation in silver prices.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Objective:</span></strong><span> The iShares Silver Trust aims to reflect the performance of the price of silver, providing a cost-effective alternative to investing in physical silver. The Trust's shares are backed by silver held by the Custodian and are listed on NYSE Arca under the ticker symbol SLV.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> The Trust is a grantor trust formed under New York law, with no officers, directors, or employees. It issues and redeems shares in exchange for silver, only in Baskets of 50,000 shares, and only with Authorized Participants.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Custody and Valuation:</span></strong><span> Silver is held by JPMorgan Chase Bank N.A., London Branch, and valued using the LBMA Silver Price. The Trust's net asset value is calculated daily by subtracting accrued fees and liabilities from the total value of silver and other assets.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Secondary Market Trading:</span></strong><span> Shares may trade at, above, or below their net asset value due to market supply and demand, with arbitrage opportunities potentially mitigating price discrepancies.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Activities:</span></strong><span> The Trust's activities are limited to issuing Baskets in exchange for silver, selling silver to cover fees and expenses, and delivering silver for redeemed Baskets. It does not engage in active management or lend its silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Insurance and Liability:</span></strong><span> The Custodian maintains insurance for its custodial obligations, but the insurance is for the Custodian's benefit, not the Trust's. The Custodian's liability is limited to the market value of any lost silver.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust seeks to continue reflecting the performance of silver prices, with the Sponsor assuming most administrative and marketing expenses. The Trust's only ordinary recurring expense is the Sponsor's fee, which is 0.50% of the net asset value.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Discussion:</span></strong><span> The Trust's net asset value increased significantly in 2025 due to a rise in silver prices and an increase in outstanding shares. The Trust remains a passive investment vehicle, not engaging in activities to profit from or mitigate losses due to silver price changes.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives:</span></strong><span> The Trust is a passive investment vehicle that seeks to reflect the performance of the price of silver. It does not engage in activities designed to obtain a profit from changes in the price of silver, focusing instead on maintaining its holdings in silver bullion. The Trust's strategic initiative is to provide a vehicle for investors to gain exposure to silver prices without the complexities of physical silver ownership.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The Trust's capital management activities include issuing and redeeming shares in exchange for silver, only in Baskets or integral multiples thereof, and only in transactions with Authorized Participants. During 2025, the Trust created 411,600,000 shares and redeemed 337,600,000 shares. The Trust's only source of liquidity is its sales of silver, and it does not declare cash distributions to shareholders. The Trust's expenses are primarily covered by the Sponsor's fees, which were $95,546,277 for 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust does not anticipate any material changes to its liquidity needs and will continue to operate as a passive investment vehicle reflecting the price of silver. The Trust will maintain its current strategy of issuing and redeeming shares in exchange for silver and does not plan to make periodic distributions to shareholders.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The price of silver is subject to wide fluctuations due to factors such as changes in economic conditions, investor sentiment, and global supply and demand. Events like the Russia-Ukraine conflict have added to market volatility, impacting silver prices and, consequently, the Trust's performance.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The Trust relies heavily on electronic systems for trading and record-keeping, which are susceptible to failures and cyber incidents. Any disruption could adversely affect the Trust's operations and the value of the Shares.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Changes in government policies, such as those affecting trading in physical commodities, could impact silver prices. The Trust is also subject to regulations by the Financial Conduct Authority in the UK, which oversees the LBMA Silver Price.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Custodial Risks:</span></strong><span> The Custodian's operations are not directly regulated, and the Trust's silver is not insured. Any loss or damage to the silver could result in a decrease in the Trust's NAV and the value of the Shares.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity Risks:</span></strong><span> A lack of active trading in the Shares could lead to price volatility and affect the ability of investors to sell their Shares at desired prices.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management Discussion:</span></strong><span> Management acknowledges the inherent risks in the silver market and the Trust's exposure to these risks due to its passive investment strategy. The Trust does not engage in active management or hedging strategies to mitigate price fluctuations. The Trust's performance is solely dependent on the price of silver, and any decline in silver prices will directly impact the value of the Shares. Investors are advised to consider these risks carefully and assess their ability to bear potential losses associated with an investment in the Trust.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1330568/000143774926006059/slv20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">iShares Silver Trust [ SLV ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:8373a4c61c7bf:0-ishares-silver-trust-sec-10-k-report/",
            "pub_date": "2026-02-28 02:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:c65979f50b3c6:0",
            "title": "iShares S&P GSCI Commodity-Indexed Trust SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The iShares S&amp;P GSCI Commodity-Indexed Trust, a Delaware statutory trust that issues units of beneficial interest representing fractional undivided beneficial interests in its net assets, has released its 2025 10-K report. The Trust, operated by iShares Delaware Trust Sponsor LLC and advised by BlackRock Fund Advisors, aims to track the results of a fully collateralized investment in futures contracts on a diversified group of commodity futures. The report highlights the Trust's financial performance, business operations, strategic initiatives, and the challenges and risks it faces.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Investment Income:</span></strong><span> $34.25 million, reflecting a strong performance in interest income from U.S. Treasury bills.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Realized and Unrealized Gain:</span></strong><span> $22.71 million, driven by gains on futures contracts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Resulting from Operations:</span></strong><span> $56.97 million, indicating a positive operational performance for the year ended December 31, 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.98 for the quarter ended March 31, 2025, highlighting a significant increase in value per share.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.87 for the quarter ended September 30, 2025, showing continued growth in share value.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Increase in Net Assets Per Share:</span></strong><span> $0.19 for the quarter ended December 31, 2025, reflecting a modest increase in share value.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Overview:</span></strong><span> The Trust's assets consist of long positions in exchange-traded index futures contracts on the S&amp;P GSCI™ Excess Return Index, along with cash and U.S. Treasury securities.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Structure:</span></strong><span> The Trust is a commodity pool as defined by the Commodity Exchange Act and is not registered under the Investment Company Act of 1940.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Investment Objective:</span></strong><span> The Trust aims to match the investment returns of the S&amp;P GSCI Total Return Index before fees and expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Share Issuance and Redemption:</span></strong><span> Shares are offered on a continuous basis in blocks of 50,000 Shares, known as 'Baskets,' and can only be purchased or redeemed by registered broker-dealers with an authorized participant agreement.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Index Futures and Collateral Assets:</span></strong><span> The Trust holds long positions in Index Futures and Collateral Assets to satisfy margin requirements, with the Advisor authorized to manage these assets on behalf of the Trust.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Trading and NAV:</span></strong><span> The Trust's Shares are traded on NYSE Arca, and the NAV is determined based on the settlement prices of Index Futures, which may fluctuate due to market value changes.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Trust Expenses:</span></strong><span> The Sponsor covers various administrative, operational, and marketing expenses in exchange for a fee of up to 0.75% of the Trust's Adjusted Net Asset Value, while the Trust is responsible for brokerage commissions and extraordinary expenses.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Liquidity and Capital Resources:</span></strong><span> The Trust's assets consist of Index Futures and Collateral Assets, with interest income used to cover expenses. The Trust does not anticipate further liquidity needs as creations and redemptions occur in kind.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market and Credit Risk:</span></strong><span> The Trust's capital is at risk due to market fluctuations in Index Futures and potential defaults by the CME's clearing house or its FCM. The Trust is also exposed to credit risk from its U.S. Treasury bill holdings.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust continues to focus on tracking the S&amp;P GSCI Total Return Index and managing its positions in Index Futures and Collateral Assets to achieve its investment objectives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Shift:</span></strong><span> The Trust transitioned from a two-tiered structure to directly holding and transacting in Index Futures, aiming to streamline operations and potentially reduce costs associated with managing a subsidiary. This change was completed following the liquidation of the Investing Pool on December 31, 2013.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The Trust's capital management activities included the creation and redemption of Shares, with 17,800,000 Shares created and 15,450,000 Shares redeemed in 2025, resulting in a net increase in the number of outstanding Shares and contributing to the increase in the Trust's net asset value. No cash distributions were declared to Shareholders during the fiscal years ended December 31, 2025, and 2024. Additionally, 2,100,000 Shares were redeemed during the fourth quarter of 2025 at an average price of $23.05 per Share.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The Trust does not anticipate any further need for liquidity due to the in-kind nature of Share creations and redemptions and the use of interest income to cover ordinary expenses. However, the limited number of market participants in the Index Futures market could pose a risk if the Trust is required to liquidate its positions. The Sponsor is unaware of any trends or events likely to materially change the Trust's liquidity needs.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The Trust faces significant market risks due to the volatility of commodity prices, influenced by factors such as production costs, demand fluctuations, geopolitical events, and speculative trading. The COVID-19 pandemic has exacerbated these risks, leading to increased market volatility and potential for negative pricing, as seen in the May 2020 WTI crude oil futures contract.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> These include the potential for illiquidity in commodity futures trading, disruptions in market trading, and the impact of contango and backwardation on futures contracts. The Trust's reliance on electronic systems and the potential for cybersecurity incidents pose additional operational challenges.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Potential changes in futures and OTC derivatives market regulations, including position limits imposed by the CFTC and exchanges, could affect the liquidity and pricing of the Trust's investments.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Management and Oversight Risks:</span></strong><span> The Trust's performance is subject to risks related to the management and oversight by the Sponsor, Trustee, and Advisor, as well as the operational integrity of key service providers. The interconnectedness of these entities, many of which are affiliated with BlackRock, may amplify these risks.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate Risks:</span></strong><span> The Trust is exposed to interest rate risks, which could affect the value of its cash equivalents and marketable securities. Changes in interest rates may lead to increased market volatility and reduced liquidity, impacting the Trust's performance.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1332174/000143774926006060/gsg20251231_10k.htm\" rel=\"nofollow\" target=\"_blank\">iShares S&amp;P GSCI Commodity-Indexed Trust [ GSG ] - 10-K - Feb. 27, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:c65979f50b3c6:0-ishares-s-p-gsci-commodity-indexed-trust-sec-10-k-report/",
            "pub_date": "2026-02-28 02:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw30fypd:0",
            "title": "Astron Connect Inc. Reports First Quarter 2026 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>VANCOUVER, BC – TheNewswire - February 27, 2026 –Astron Connect Inc. (the “Company” or “Astron”) (TSX-V:AST) today announced its first quarter results for the threemonths ended December 31, 2025. </span></p><p class=\"\"><span>Highlights for the three months ended December 31,2025:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net loss of $105,892for</span><br/><span>the three months ended December 31, 202</span><br/><span>(202– net loss of $28,162), aincrease of 70</span><br/><span>% from FY202 </span><br/></p><br/></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Operating expenses of $105,729</span><br/><span>for the three months ended December 31,</span><br/><span>202 (202 - $29,064), a</span><br/><span>decrease of 73% from</span><br/><span>FY202 </span><br/></p><br/></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>As of December 31, 202, the</span><br/><span>Company had a working capital of $149,216(202 - $151,477deficiency).  </span><br/></p><br/></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Selected First Quarter</span><br/><span>Information</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><span> </span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>December 31, 2024</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>December 31, 2023</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span> </span></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>CAD$</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>CAD$</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Operating expenses</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>105,729</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>29,064</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Other loss (income)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>163</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>(902)</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Net loss</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>         (105,892)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>         (28,162)</span><br/></p><br/><br/></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>Basic and diluted EPS</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>               (0.00)</span><br/></p><br/><br/></td><td colspan=\"1\" rowspan=\"1\"><br/><br/><p class=\"\"><br/><span>               (0.00)</span><br/></p><br/><br/></td></tr></tbody></table></div><p class=\"\"><br/><span>For further financial information, please refer to the</span><br/><span>annual audited consolidated financial statements www.sedar.com or</span><br/><span>www.astronconnect.com. </span><br/></p><p class=\"\"><br/><span> Financial Statements and</span><br/><span>MD&amp;A</span><br/></p><p class=\"\"><br/><span>The Company's Financial Statements and</span><br/><span>Management's Discussion and Analysis (MD&amp;A) for the three</span><br/><span>months ended December 31, 2022 will be accessible on SEDAR at</span><br/><span>www.sedar.com under Astron's profile and on the Company's websiteat www.astronconnect.com.</span></p><p class=\"\"><span>ABOUT ASTRON CONNECT</span></p><p class=\"\"><span>Astron Connect Inc. (TSX-V:AST) helps Canadianenterprises in the food and beverage industry break through the noiseand bring their products to new international markets in the emergingworld. Astron Connect brings Canadianfood and beverage companies to the world through its extensive connections and export logistics capabilitiesin China and emerging markets. Manna Water and Sachiel Water (both Astron brands) supply China and other emerging markets with pure Canadian bottled spring water. For more information, visit www.astronconnect.com.</span></p><p class=\"\"><span>For more information, pleasecontact:</span></p><p class=\"\"><span>S. Randall Smallbone Chairman and Director AstronConnect Inc.</span></p><p class=\"\"><span> rsmallbone@cogeco.ca</span></p><p class=\"\"><span>The TSXV has neither approved nor disapproved the contents of this news release. Neither the TSXV nor its Regulation Service Provider (as that term is defined in the policies of the TSXV) accepts responsibility for theadequacy or accuracy of this release.</span></p><p class=\"\"><span>Notice regardingforward looking statements:</span></p><p class=\"\"><span>This press release may contain “forward-lookinginformation” within the meaning of applicable Canadian securitieslegislation. All statements, other than statements of historical fact,included herein may be forward-looking information. Generally,forward-looking information may be identified by the use offorward-looking terminology such as “plans” “expects” or“does not expect”, “proposed”, “is expected”,“estimates”, “forecasts”, “intends”, “anticipates” or“does not anticipate”, or “believes”, or variations of suchwords and phrases, or by the use of words or phrases which state thatcertain actions, events or results may, could, would, or might occuror be achieved. This forward-looking information reflects the currentbeliefs of Astron and is based on information currently available toAstron and on assumptions Astron believes are reasonable. Theseassumptions include, but are not limited to, management’sassumptions about receiving TSXV acceptance of the Transaction asconstituting Astron’s “qualifying transaction”.</span></p><p class=\"\"><span>Forward-looking information is subject to known andunknown risks, uncertainties and other factors that may cause theactual results, level of activity, performance or achievements ofAstron to be materially different from those expressed or implied bysuch forward-looking information. Although Astron has attempted toidentify important factors that could cause actual results to differmaterially from those contained in forward-looking information, theremay be other factors that cause results not to be as anticipated,estimated or intended. Accordingly, readers should not place unduereliance on forward- looking information as there can be no assurancethat the plans, intentions or expectations upon which theyare placed will occur. Such information, although considered reasonable by management at the time of preparation, may prove tobe incorrect and actual results may differ materially fromthose anticipated. Forward-looking statementscontained in this press release are expressly qualified by thiscautionary statement.</span></p><p class=\"\"><span>The forward-looking statements contained in this pressrelease represent the expectations of Astron as of the date of this press release and, accordingly, aresubject to change after such date. However, Astron expressly disclaimsany intention or obligation to update or revise any forward-lookingstatements, whether as a result of new information, future events orotherwise, except as expressly required by applicablesecurities law.</span></p><p class=\"\"><span>Investors are cautioned that, except as disclosed inthe filing statement prepared in connection with the Transaction, anyinformation released or received with respect to the Transaction maynot be accurate or complete and should not be relied upon. Trading inthe securities of a capital pool company should be considered highlyspeculative.</span></p><p class=\"\"><span>The TSX Venture Exchange has in noway passed on the merits of the Transaction and has neither approved or disapproved thecontents of this press release.</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor its RegulationServices Provider (as that term is defined in the policies of the TSXVenture Exchange) accepts responsibility of the adequacy or accuracyof this press release.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw30fypd:0-astron-connect-inc-reports-first-quarter-2026-results/",
            "pub_date": "2026-02-28 02:55:18",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009104:0",
            "title": "Elastic Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:56 GMT) </span></strong><span>Elastic Price Target Cut to $90.00/Share From $115.00 by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009104:0/",
            "pub_date": "2026-02-28 02:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009106:0",
            "title": "American Woodmark Raised to Neutral From Underperform by Zelman & Assoc",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009106:0/",
            "pub_date": "2026-02-28 02:56:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009112:0",
            "title": "Sure, Inflation Has Cooled. But It's a Long Way From Cold, No Matter What Trump Says. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Megan Leonhardt</span></p><p class=\"\"><span>Federal Reserve officials and politicians like to trumpet the fact that inflation has cooled dramatically from its peak of nearly 9% in June 2022. But for those of us who buy groceries or pay utility bills, that's small consolation. Have you seen the price of a skirt steak, or even ground beef these days? It's enough to consider becoming a vegetarian.</span></p><p class=\"\"><span>President Donald Trump attempted to assuage consumers' concerns last Tuesday night during his State of the Union address, citing the \"roaring\" economy and plummeting prices. \"The cost of chicken, butter, food, hotels, automobiles, rent is lower today than when I took office, by a lot, and even beef, which was very high, is starting to come down significantly,\" Trump said.</span></p><p class=\"\"><span>While the president is right that prices for some items, such as eggs and gasoline, have fallen from a year ago, inflation hasn't been tamed. Official measures indicate that it's still well above the Fed's 2% annual target. Friday's release of the producer price index reading for January showed that wholesale inflation rose by a higher-than-expected 0.5% month over month.</span></p><p class=\"\"><span>The president called out the price of eggs, which he noted are down 60% from their high. While he got the direction right, the consumer price index indicates that the average price of a carton of large Grade A eggs has fallen by 48% since Trump took office in January 2025. Prices plummeted last year as a bird flu outbreak eased, but the pace of cooling has slowed in recent months.</span></p><p class=\"\"><span>Gasoline prices, which Trump also highlighted, fell significantly over the past year. Prices at the pump were $2.98, on average, this past week, according to AAA. That's down from $3.14 a year ago.</span></p><p class=\"\"><span>Trump touted that inflation averaged 1.7% in the final three months of 2025. The administration's measure, which it has used before, is based on the average of the annualized rates of the monthly CPI change during specific periods — for example, from the start of Trump's second term or in the final three months of the year.</span></p><p class=\"\"><span>Official calculations, considered standard by economists, tell a less celebratory story. The Bureau of Labor Statistics calculates the change in the consumer price index compared with one year earlier. By that measure, inflation rose 2.4% year over year in January. The Fed's preferred inflation gauge, the personal consumption expenditures price index, rose 2.9% in December, the latest data available.</span></p><p class=\"\"><span>Sticky inflation has been driven by rising prices for a range of goods and services. Beef costs, for example, rose substantially in the past year. Ground beef prices were up 22% in January from a year earlier, and steak prices rose about 12% year to year.</span></p><p class=\"\"><span>Electricity costs, which Trump didn't mention, were up 6.3% year over year in January on a seasonally adjusted basis, according to the BLS.</span></p><p class=\"\"><span>Price trends like this help to explain why surveys show that consumers remain focused on inflation, prices, and affordability. Consumer confidence improved slightly in February, but is still down by almost 9% from a year ago and remains at historically low levels, according to the latest report, released this past week.</span></p><p class=\"\"><span>Regarding the impact of tariffs, Trump said that \"there was no inflation, tremendous growth.\" But there is mounting evidence that tariffs are increasing prices, even if not by the levels that economists initially assumed. Core goods inflation was unchanged in the January CPI report, largely due to a sizable drop in used-car prices. But core goods excluding autos rose 0.36% in the month, and at a 4.4% annualized rate, according to Omair Sharif, founder of Inflation Insights.</span></p><p class=\"\"><span>Prices for household furnishings, personal-care products, and electronic devices such as computers, tablets, and smart-home assistants all rose sharply in January.</span></p><p class=\"\"><span>The Supreme Court recently struck down the tariffs that the Trump administration issued under the International Emergency Economic Powers Act, but consumers are unlikely to see any relief in prices. If refunds are issued, companies aren't likely to pass those savings along to consumers. And, the White House has already implemented workarounds to keep tariffs in place.</span></p><p class=\"\"><span>\"Trump gave no indication he would relent from his tariff agenda,\" said Thierry Wizman, global foreign-exchange and rates strategist at Macquarie Group.</span></p><p class=\"\"><span>That alone suggests consumers shouldn't expect price growth to ease soon.</span></p><p class=\"\"><span>Write to Megan Leonhardt at megan.leonhardt@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009112:0/",
            "pub_date": "2026-02-28 02:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009114:0",
            "title": "NCR Atleos Cut to Neutral From Outperform by Wedbush",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009114:0/",
            "pub_date": "2026-02-28 02:57:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009120:0",
            "title": "Globant Is Maintained at Hold by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009120:0/",
            "pub_date": "2026-02-28 02:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN12F:0",
            "title": "Nordic Fibreboard Q4 revenue rises",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Fibreboard producer's Q4 2025 revenue grew 14.7% yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company's Q4 net loss widened to €580,000</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Q4 EBITDA remained negative, impacted by planned factory shutdown</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nordic Fibreboard did not provide specific guidance for future quarters or fiscal year</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INDUSTRIAL CLIENTS - Increased order volumes from industrial sector clients supported revenue growth in Q4 2025</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FINNISH MARKET - Revenue growth in Q4 2025 was bolstered by sales to Finland, the largest export market</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FACTORY SHUTDOWN - Planned shutdown in December for new gas boiler house transition impacted Q4 2025 results</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-EUR 580,000</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 EBITDA</span></p></td><td></td><td><p class=\"\"><span>-EUR 335,000</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>-19%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Income</span></p></td><td></td><td><p class=\"\"><span>-EUR 466,000</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN12F:0-nordic-fibreboard-q4-revenue-rises/",
            "pub_date": "2026-02-28 02:58:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009122:0",
            "title": "Employment Report and Retail Sales on the Docket — Data Week Ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The following are median forecasts for next week's U.S. data from a survey compiled by The Wall Street Journal.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>DATE      TIME  RELEASE                       PERIOD     CONSENSUS    PREVIOUS </span><br/><span>Monday    0945  S&amp;P Global U.S. Mfg PMI        Feb        NA           51.2* </span><br/><span>          1000  ISM Mfg PMI                    Feb        52.0   (11)  52.6 </span><br/><span>Wednesday 0815  ADP Jobs                       Feb       +50K    (5)   +22K </span><br/><span>          0945  S&amp;P Global U.S. Svcs PMI       Feb        NA           52.3* </span><br/><span>          1000  ISM Non-Mfg PMI                Feb        53.5   (9)   53.8 </span><br/><span>Thursday  0830  Jobless Claims                 Feb 28     215K   (8)   212K </span><br/><span>          0830  Import Prices                  Jan       +0.4%   (4)  +0.1% </span><br/><span>          0830  Productivity (Prelim)          4Q        +1.8%   (10) +4.9%** </span><br/><span>          0830  Unit Labor Costs (Prelim)      4Q        +2.0%   (9)  -1.9%** </span><br/><span>Friday    0830  Nonfarm Payrolls               Feb       +54K    (12) +130K </span><br/><span>          0830  Unemployment Rate              Feb        4.3%   (12)  4.3% </span><br/><span>          0830  Avg. Hourly Wages M/M***       Feb       +0.3%   (11) +0.41% </span><br/><span>          0830  Avg. Hourly Wages Y/Y***       Feb       +3.7%   (4)  +3.71% </span><br/><span>          0830  Retail Sales                   Jan       -0.4%   (10) +0.0% </span><br/><span>          0830    -- ex autos                  Jan       -0.1%   (9)  +0.0% </span><br/><span>          1000  Business Inventories           Dec       +0.1%   (3)  +0.1% </span><br/><span>          1500  Consumer Credit                Jan      +$10.0B  (5) +$24.0B </span><br/><span> </span><br/><span>*Feb Flash Reading </span><br/><span>**3Q Final Reading </span><br/><span>***All private-sector workers </span><br/><span> </span><br/><span> </span><br/><span>(Figures in parentheses refer to number of economists surveyed.) </span><br/><span> </span><br/><span>Write to Donna Huneke at dataweekahead@wsj.com </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009122:0/",
            "pub_date": "2026-02-28 02:59:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009125:0",
            "title": "This Innovation Could Make the Perfect Silicon Chip — and End Moore's Law — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Christopher Mims | Photography by Justin T. Gellerson for WSJ</span></p><p class=\"\"><span>Sometime in the next 15 years, the same technology that produced the world's first photograph will allow us to make the most powerful, densely packed silicon microchips allowed by physics. It will be a triumph of engineering — and the final step in the march of chip-industry progress known as Moore's Law.</span></p><p class=\"\"><span>Getting there is the multitrillion-dollar challenge the entire semiconductor industry now faces. It's so difficult that experts believe it won't happen commercially until 2040. Without this final step, electronics will only gain capability by bulking up.</span></p><p class=\"\"><span>The most valuable companies on earth are all watching this space. And that's why an innovation currently being tested at Johns Hopkins University is so interesting to them all.</span></p><p class=\"\"><span>Moore's end</span></p><p class=\"\"><span>Moore's Law says that every two years, the number of transistors packed into a microchip doubles. That can only happen so many times before there's no physical way to shrink transistors down any further — at least not on silicon wafers, which is what microchips have been made from since their inception.</span></p><p class=\"\"><span>The technology that will get us to this endpoint, photolithography, is familiar to anyone who remembers how film used to be developed: Light shines through a negative and onto a sheet of paper coated with a light-sensitive chemical, re-creating the image.</span></p><p class=\"\"><span>With chips, the precision of that \"image\" is measured in tens of atoms. A light source with a very tight wavelength, somewhere between ultraviolet light and X-rays, shines through a chip-shaped stencil and onto the silicon wafer. On the wafer's surface, a chemical substrate called a photoresist reacts to the light, and etches the stencil pattern into the silicon.</span></p><p class=\"\"><span>The most advanced version of this tech currently in use today — building the chips that go into Nvidia-powered AI supercomputers and potentially Apple's next-generation iPhones — gets to a precision of 10 nanometers, or roughly 60 silicon atoms. The final frontier of silicon etching aims to cut that down to about 5 nanometers. If it's any smaller than that, the electric current flowing through the chip just won't stay in its lanes.</span></p><p class=\"\"><span>More transistors packed into a smaller space means you get the same processing power with less energy demand — or it means for the same energy, you get more processing power. So Moore's Law has fueled both the mobile-computing revolution and the artificial-intelligence datacenter boom.</span></p><p class=\"\"><span>From camera obscura to X-ray lithography</span></p><p class=\"\"><span>The problem with etching patterns with atomically precise beams of light is that the material you shine it on also has to be atomically precise, or the pattern comes out blurry.</span></p><p class=\"\"><span>Back in the 1990s, chemists invented a weird substance called a metal-organic framework. It's a nearly perfect pattern of alternating shapes, where metal atoms hold longer carbon-based molecules in place in a sort of lattice. Best of all, it's self-organizing: Under the right conditions, it automatically forms a regular, crystalline pattern. The chemists who discovered it just won the Nobel Prize for their invention.</span></p><p class=\"\"><span>These properties make metal-organic frameworks an ideal photoresist — that chemical layer on a silicon wafer that absorbs light to create the etched pattern of transistors and connections. Another advantage of metal-organic frameworks: You can create them using a huge variety of metals and organic molecules.</span></p><p class=\"\"><span>The key to designing a photoresist? \"Making sure you have some type of regular structure that is very, very small,\" says Kayley Waltz, a fifth-year Ph.D. student at Johns Hopkins. Recently, I visited the labs of Waltz's adviser, chemical engineer Michael Tsapatsis, and Howard Fairbrother, a chemist. Together, their students and postdocs collaborated on a string of papers pioneering chip-making techniques involving metal-organic frameworks.</span></p><p class=\"\"><span>On a screen, Waltz showed me a super-magified image of a blue jay — the Johns Hopkins mascot. She etched it into silicon using the metal-organic photoresist invented by the team she led. (Waltz's success at the university landed her a job at Micron, one of the top makers of memory chips.)</span></p><p class=\"\"><span>To take advantage of the atomic precision of this new photoresist, the light beam needs to be sharpened as well. Today's cutting-edge chips with 10nm features are created using extreme ultraviolet light sources from machines made by Dutch company ASML. Each can cost up to $400 million, and is as big as a city bus. To etch features any smaller, ASML or one of its nascent competitors will have to find a way to go from extreme UV light to X-rays, which have an even tighter wavelength.</span></p><p class=\"\"><span>Barriers to commercialization</span></p><p class=\"\"><span>I spoke to three additional researchers who lauded the Johns Hopkins team for its pathbreaking work. But all of them have explored alternative photoresist chemicals that will compete to be the one semiconductor companies settle on.</span></p><p class=\"\"><span>Whichever substance will win must be compatible with existing microchip fabrication processes, because so many billions have already been invested in them, says Kaiying Wang of the University of South-Eastern Norway. \"How to adopt this process into the current, mature semiconductor industry is a challenge,\" he adds.</span></p><p class=\"\"><span>Chang-Yong Nam, a senior scientist at Brookhaven National Laboratory, says he thinks the properties of metal-organic frameworks make them an alluring candidate, though he himself is currently at work on a photoresist option that builds on current approaches.</span></p><p class=\"\"><span>Given the enormous engineering challenge of integrating metal-organic frameworks into commercial chip-making, we probably won't see it in fabs until 2040 at the earliest, says Tsapatsis of Johns Hopkins.</span></p><p class=\"\"><span>Even so, today's technological momentum is probably enough to get us there. Assuming Apple stays on its yearly cadence of device renewal, we will be on the iPhone 32 by then. Makers of smartglasses need such more powerful yet less power hungry chips. Same goes for all the AI companies, which seek computational power that doesn't add to the energy demands already threatening to drive our electricity bills higher than our mortgages.</span></p><p class=\"\"><span>Beyond 2040, if we want features on chips to become any smaller and gadgets to become more capable, we will probably have to abandon silicon altogether, according to every expert I spoke with. The good news for the Johns Hopkins team: The metal-organic frameworks they've pioneered are potentially so precise that future microchips made of graphene or other exotic materials might be patterned using them.</span></p><p class=\"\"><span>What comes after silicon microchips — pocket quantum computers, say, or transistors only an atom thick — could be as strange to people living today as microchips were in the 1960s, when Gordon Moore started laying down the law.</span></p><p class=\"\"><span>Write to Christopher Mims at christopher.mims@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009125:0/",
            "pub_date": "2026-02-28 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009129:0",
            "title": "Major Canadian Economic Indicators Expected Next Week",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span>All dates are in ET Time. </span><br/><span> </span><br/><span>Monday, March 2, 2026                                        Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0930/1430  Feb      Canada Manufacturing PMI </span><br/><span> </span><br/><span>Wednesday, March 4, 2026                                     Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0815/1315  Feb      Official International Reserves </span><br/><span>                       Monetary Reserves (USD)                          +868M </span><br/><span>0830/1330  Q4       Labour productivity, hourly compensation &amp; unit labour cost </span><br/><span>0930/1430  Feb      Canada Services PMI </span><br/><span>1030/1530           Global Risk Institute (GRI) fireside chat with Bank of Canada </span><br/><span>                    Governor Tiff Macklem </span><br/><span> </span><br/><span>Thursday, March 5, 2026                                      Exp        Prev </span><br/><span> ET/GMT </span><br/><span>0830/1330  Mar      Intentions of principal field crop areas </span><br/><span> </span><br/><span>Friday, March 6, 2026                                        Exp        Prev </span><br/><span> ET/GMT </span><br/><span>1000/1500  Feb      Ivey Purchasing Managers Index </span><br/><span>                       Ivey PMI                                         47.0 </span><br/><span>                       Ivey PMI-SA                                      50.9 </span><br/><span> </span><br/><span> </span></pre></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009129:0/",
            "pub_date": "2026-02-28 03:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009029:0",
            "title": "MannKind Cut to Sector Perform From Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009029:0/",
            "pub_date": "2026-02-28 02:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009034:0",
            "title": "Bank Stocks Head for Worst Day Since April — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By WSJ staff</span></p><p class=\"\"><span>Worries about AI and problems in the private-credit market hit bank stocks on Friday, sending the KBW Nasdaq Bank Index down more than 5% and headed toward its worst day since April's tariff turmoil.</span></p><p class=\"\"><span>Shares of large U.S. lenders slumped across the board, with Goldman Sachs recently leading the way with a 7.5% decline. Morgan Stanley fell 6.9%.</span></p><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009034:0/",
            "pub_date": "2026-02-28 02:41:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN0YA:0",
            "title": "Paramount expected to easily secure EU nod for Warner Bros deal, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount's market share below 20% in Europe, faces fewer hurdles</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Paramount open to divesting minor channels if required</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Regulatory approvals needed from US, UK, EU</span></li></ul></span></div><span><p class=\"\"><span>By Foo Yun Chee</span></p><p class=\"\"><span>    Paramount Skydance </span><span> is expected to easily gain European Union antitrust approval to buy Warner Bros Discovery </span><span> while divestments, if required to address regulatory concerns, will likely be minor, two people with direct knowledge of the matter said on Friday.</span></p><p class=\"\"><span>Unlike Netflix's </span><span> aborted bid, Paramount's offer faces fewer regulatory hurdles because a combined Paramount and Warner Bros has a market share of below 20% in all markets across Europe, the people said. They spoke anonymously because of the sensitivity of the matter.</span></p><p class=\"\"><span>European Commission antitrust regulators usually take a tough line when market share is 30% or more. Paramount has yet to formally seek EU approval, but is providing information on its businesses.</span></p><p class=\"\"><span>The deal would also require approval under the EU's foreign subsidies regulation because Saudi Arabia's Public Investment Fund, Abu Dhabi's L'imad Holding Company and the Qatar Investment Authority are also bankrolling the bid. The FSR targets unfair foreign state aid.</span></p><p class=\"\"><span>Paramount declined to comment. The Commission did not immediately respond to a request for comment.</span></p><p class=\"\"><span>PARAMOUNT OPEN TO DIVESTING MINOR CHANNELS: SOURCES</span></p><p class=\"\"><span>While Paramount hopes to secure unconditional EU approval, the company is willing to divest minor channels such as its children's brands if required, the people said. Overlapping businesses include the combination of two studios and several TV channels.</span></p><p class=\"\"><span>Paramount has Nickelodeon while Warner Bros owns the Cartoon Network.</span></p><p class=\"\"><span>Paramount will likely seek formal EU approval in the coming months, the people said, which will then kick off a 25-working-day preliminary review, which can be extended by 10 working days if remedies are offered at the end of the 25 days.</span></p><p class=\"\"><span>California may be the biggest obstacle to the deal. Regulatory approvals from the U.S. and UK are also key deal requirements.</span></p><p class=\"\"><span>Paramount has been on the charm offensive in Europe since January, with CEO David Ellison meeting French President Emmanuel Macron that month while Chief Legal Officer Makan Delrahim met the European Commission's top merger official Guillaume Loriot that same week, the people said.</span></p><p class=\"\"><span>Delrahim is well-acquainted with Loriot from his previous stint as assistant attorney general at the U.S. Department of Justice's antitrust division.</span></p><p class=\"\"><span>European Parliament lawmaker Andreas Schwab, who has criticised Netflix's bid and led the negotiations in several pieces of tech legislation in recent years and also met Delrahim last month, said a Paramount bid poses fewer issues.</span></p><p class=\"\"><span>\"I think Paramount is something we could accept. It is a concentration in the production of films. There is no risk of a digital champion taking over the video streaming market,\" he said.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN0YA:0-paramount-expected-to-easily-secure-eu-nod-for-warner-bros-deal-sources-say/",
            "pub_date": "2026-02-28 02:41:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009042:0",
            "title": "Arbe Robotics Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009042:0/",
            "pub_date": "2026-02-28 02:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947590:0",
            "title": "IOX: Argentine exit finalized; H2 2025 net loss deepens to USD 20.2M as focus shifts to Colombia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Divestment of Argentine assets in early 2026 led to a strategic refocus on Colombia. H2 2025 saw a net loss of USD 20.2 million, with revenues rising to USD 9.9 million despite lower production. Financial stability measures and capital structure adjustments are underway.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947590-41386e2a07e106e79a42a2a343ba5f40\" target=\"_blank\">InterOil Exploration and Production ASA [IOX] Interim report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947590:0-iox-argentine-exit-finalized-h2-2025-net-loss-deepens-to-usd-20-2m-as-focus-shifts-to-colombia/",
            "pub_date": "2026-02-28 02:42:28",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009052:0",
            "title": "BlackSky Technology Is Maintained at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009052:0/",
            "pub_date": "2026-02-28 02:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227007071:0",
            "title": "Quantum Computing Is No Longer a Speculative Bet. IonQ's Surging Stock Drives Home That Point. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni</span></p><p class=\"\"><span>Quantum computing has frequently been touted as the next big technology, with transformative potential spanning sectors from healthcare to finance to defense. Now, investors appear to be buying in.</span></p><p class=\"\"><span>Just look at the reaction to IonQ's earnings. The stock surged 22% on Thursday, marking its largest single-day percent increase since a 37% jump in May 2025, which came after a Barron's article highlighting IonQ's efforts to grow into the so-called Nvidia of quantum computing.</span></p><p class=\"\"><span>In an interview after the company's latest earnings, which beat consensus estimates, CEO Niccolo de Masi doubled down on the Nvidia comparison, saying he believed IonQ could experience explosive growth in years to come.</span></p><p class=\"\"><span>\"I look at companies with $100 billion market caps, and I go, that's not an absurd concept,\" de Masi said. \"Nvidia had $60 billion in quarterly revenue and we had $62 million, but they had $60 million of revenue in a quarter at one point.\" (Nvidia logged less than $200 million in revenue in its first quarter as a public company).. \"There's room for us to go a long way — I don't knows exactly how far.\"</span></p><p class=\"\"><span>Call him bombastic, but the argument about quantum being a speculative bet has weakened as Wall Street increasingly piles into the space, with more and more analysts initiating coverage on shares of the pure-play companies that are concentrating their efforts on quantum.</span></p><p class=\"\"><span>That can mean focusing solely on computing, as D-Wave does, or diversifying across technologies — including sensing and networking — like IonQ.</span></p><p class=\"\"><span>The companies use different modalities. D-Wave pioneered quantum annealing, tailored to optimization tasks. Gate-model systems also vary.</span></p><p class=\"\"><span>\"An investment of us is a bet on the quantum industry,\" de Masi said in reference to the company's growing reach across technologies. IonQ has been on an acquisition spree, snapping up companies specializing in atomic clocks to quantum sensors and, most recently, semiconductors. The latter will help IonQ take control of its own chip production.</span></p><p class=\"\"><span>While the aggressive M&amp;A has drawn scrutiny from some on the Street, analysts noted in the wake of IonQ's latest earnings that the \"overall diversification of the business across products\" contributed to its strength in the quarter.</span></p><p class=\"\"><span>Expanding too far, too quickly could be a problem for the pure plays. The companies are all fairly young, have yet to turn an annual profit, and have yet to broadly commercialize their technology. It's the larger players that have room to experiment.</span></p><p class=\"\"><span>Alphabet's Google is often cited as a leader in quantum. Its Willow chip helped spark hype at the end of 2024. Still, it isn't counting on the technology as a major revenue driver yet.</span></p><p class=\"\"><span>IonQ's de Masi conceded that one big player stood out: International Business Machines, which Barron's profiled in December. \"I feel like there's two ecosystems right? There's IBM and there's the rest of us,\" he said. \"I think we have the greatest chance of mounting a meaningful, if not prevailing, challenge.\"</span></p><p class=\"\"><span>It's a tall order. IBM's efforts in quantum have spanned decades, and they haven't gone unnoticed. Gartner, a technology research firm that monitors the sector, in a report last year called IBM \"the quantum computing company to beat,\" citing its scale and ecosystem.</span></p><p class=\"\"><span>IBM recently elevated Jay Gambetta, the former head of its quantum division, to lead its research efforts as a whole — a sign of how seriously it takes quantum.</span></p><p class=\"\"><span>Wall Street has been even more excited about the smaller players. Shares in pure plays have doubled — and in some cases tripled — over the past 12 months.</span></p><p class=\"\"><span>IonQ stock has surged 66% over that period, outstripping a 23% gain for the tech-heavy Nasdaq Composite. Rival D-Wave has gained nearly 270%. Rigetti Computing, another closely-watched player that is just starting to break out of R&amp;D in earnest, has risen about 120%.</span></p><p class=\"\"><span>No one is more enthusiastic than the quantum CEOs themselves, but they can't be too aspirational. D-Wave CEO Alan Baratz told Barron's after earnings on Thursday that investors could expect to see unpredictable revenue patterns for the foreseeable future.</span></p><p class=\"\"><span>\"We're still at the early stages of the commercialization of quantum,\" Baratz said. It's a surprisingly modest take from a company that frequently touts its roster of clients including AT&amp;T, whose representatives spoke at D-Wave's annual user conference in January.</span></p><p class=\"\"><span>Rosenblatt analyst John McPeake called D-Wave's latest quarter \"uneventful,\" though bookings were strong. Year over year, bookings fell 27%, largely because of last year's first sale of an Advantage system.</span></p><p class=\"\"><span>Investors must reckon with how new this all is. CEOs still have to convince customers — and shareholders — that quantum will be transformative.</span></p><p class=\"\"><span>The company's expansion into gate-model systems supports D-Wave's aspirations to become a \"one-stop shop\" for quantum computing, Baratz told Barron's. \"We want to make sure we can deliver everything our customers need to be able to solve their hard computational problems leveraging quantum computing.\"</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227007071:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009062:0",
            "title": "Chemed Cut to Sector Perform From Outperform by RBC Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:45 GMT) </span></strong><span>Chemed Price Target Cut to $422.00/Share From $572.00 by RBC Capital</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009062:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009059:0",
            "title": "Bitcoin Stays Vulnerable in Choppy Geopolitical Situation — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>1345 ET - Bitcoin is wrapping up another negative month, says Antonio Di Giacomo of XS.com in a note. Cryptocurrencies in general are rudderless, he says, with traders needing new developments to spur a rush of volume back into the space. As American foreign policy is experiencing higher tensions with both Iran and Cuba, choppy trading is a recurring feature in a cryptocurrency market that doesn't want too much risk exposure heading into the weekend. \"Volatility remains elevated, with wide intraday swings underscoring the fragile balance between buyers and sellers,\" said Di Giacomo. BTC is down 2.8%, to $65,500, while ethereum drops to just over $1,920 Friday. (kirk.maltais@wsj.com)</span></p><p class=\"\"><span>1220 ET - CoreWeave can still raise capital despite concerns about its capital structure and backlog risks, D.A. Davidson analyst Alex Platt says. Recent news indicating that CoreWeave is looking to raise $8.5 billion in debt capital to finance its Meta capacity is an incremental positive to alleviating capital structure risk, Platt says. Platt also believes that OpenAI will raise enough capital to meet its commitments to CoreWeave, which will help with concerns about backlog. \"While remaining pragmatic and acknowledging there still remains concerns around CoreWeave, we believe these are concerns that can and likely will be alleviated in the near-to-medium term,\" Platt says. (katherine.hamilton@wsj.com)</span></p><p class=\"\"><span>1136 ET - U.S. corporate bond yields rise faster than comparable Treasurys, leading spreads to widen from historically low levels. The driver \"has been the perception of AI displacement,\" Angel Oak's Matt Kennedy says. Renewed uncertainty around President Trump's tariffs hasn't been a factor, as the trade aspect \"has been in the market for a year now\" and most issuers \"have had time to take actions to mitigate the impact.\" Kennedy says corporations have altered their supply chains, reduced costs, or passed through price increases to offset tariffs. Fixed-income investors expect U.S. corporations to greatly increase debt issuance this year to finance AI-related capex. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1133 ET - This month's widening of U.S. credit spreads reflects a normalization from historically tight levels, Comerica's Bill Adams says. He compares the move with equity markets' poor performance this month. \"Credit markets have normalized a little bit over the last month as the stock market has treaded water,\" he says. \"But they still point to a generally upbeat view for the outlook for business financial health.\" An ICE BofA index tracked by the St. Louis Fed puts the spread at 0.8 percentage point as of Feb. 23, up from 0.73 p.p. a month ago. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1130 ET - Canada's economy on balance was more resilient last year than feared as U.S. tariffs ramped up last spring, says Royal Bank's Nathan Janzen. GDP contracted 0.6% annualized in 4Q 2025, weaker than the flat reading the economist and Bank of Canada forecast. Yet Janzen says that if anything, the firm underlying details lower the off the central bank will need to cut interest rates further. The weakness was largely due to a pull-back in inventories, with consumer spending and government investment up. And net exports added significantly to growth for a second quarter running, following the sharp drop in 2Q. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1127 ET - The latest U.S. inflation gauge indicates that price increases are likely to remain above the Fed's 2% target for a while. January producer price index unexpectedly accelerates, leading economists to foresee the Fed's preferred inflation indicator, the PCE, still around 3%. \"The data out this morning actually points to inflation being a nagging frustration for the U.S. economy,\" Comerica's Bill Adams says. That would be \"a reason for the Fed to be more cautious on rate cuts,\" he says. Markets are mostly pricing in a Fed hold in coming months and two or more cuts this year, according to CME data. (paulo.trevisani@wsj.com; @ptrevisani)</span></p><p class=\"\"><span>1118 ET - Friday's Commerce Department data on December construction spending rounds out the full-year picture. It shows an overall 1.4% decline in U.S. construction spending — driven in large part by a 6.5% decline in spending on construction of factories. Along with declining employment in manufacturing last year, the numbers are evidence that the first year of the second Trump administration didn't see a decisive revival in U.S. goods production. On the other hand, manufacturing activity itself hasn't slowed — data from the Fed show that between January 2025 and January 2026, output from extant U.S. factories rose by 2.4%. (matt.grossman@wsj.com; @mattgrossman)</span></p><p class=\"\"><span>1116 ET - The 0.6% annualized drop in 4Q Canada GDP doesn't reflect underlying momentum in the economy, says Douglas Porter, chief economist at BMO Capital Markets. Porter says the weakness was concentrated on a big pullback inventories, while consumer spending rebounded, exports were solid, and business investment eked out a gain. Regardless, he says the economy is going to struggle amid heightened trade-policy uncertainty, highlighted by the upcoming US-led review of USMCA. This will keep the door \"slightly ajar\" for possible Bank of Canada rate cuts, \"but we're not there quite yet,\" says Porter. (paul.vieira@wsj.com; @paulvieira)</span></p><p class=\"\"><span>1035 ET - Underlying momentum in Canada's economy isn't consistently strong but it isn't weak enough for the Bank of Canada to cut interest rates further, Desjardins' Royce Mendes reckons. GDP shrank 0.6% annualized in 4Q 2025, but outside of a drag from a drop in business inventories and housing weakness, the economy showed positive numbers. Mendes says there are hurdles to pass in the coming months for the economy but for now it is likely the central bank will remain on the sidelines. He notes neither Canadian government bond yields of the currency really reacted to the GDP data, and markets still price in a 40% probability of another rate cut this year. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1028 ET - Oxford economics will be on recession watch in early 2026 after Canada's economy slipped into reverse in the last quarter. GDP shrank 0.2% on-quarter, or 0.6% annualized, driven by a large drawdown in inventories that shaved about 1 percentage point off growth, economist Michael Davenport says. Statistics Canada's estimate for January shows flat GDP, suggesting shaky footing starting the year. Davenport says Canada should narrowly avoid a recession, but soft momentum will persist near term to keep risks elevated. (robb.stewart@wsj.com; @RobbMStewart)</span></p><p class=\"\"><span>1017 ET - A notable revision in Canada GDP data suggests the amount of spare capacity sloshing around in the economy didn't grow despite the 4Q decline, says Dominic Lapointe, director of macro strategy at Manulife Investment Management. He says Statistics Canada revised its 2Q data, and it now indicates the drop in output was much shallower than originally estimated. Canada's 2Q GDP fell 0.9% annualized versus the original 1.8% estimate. The economy grew by a revised 2.4% in 3Q, and now followed by a 0.6% drop in 4Q. For the Bank of Canada, Lapointe says, \"this leaves the output gap largely unchanged — albeit negative — and does not open the door to additional rate cuts.\" (paul.vieira@wsj.com; @paulvieira)</span></p><p class=\"\"><span>1011 ET - Bringing the Mercosur free-trade deal into effect will boost European distillers, says Mark Titterington, director-general of industry association SpiritsEUROPE. The EU is provisionally applying the long-awaited trade pact with four South American nations, a move set to boost trade flows between the two blocs. The move will offer new market access for European spirits makers, as well as protecting geographical designations and phasing out costly trade duties, Titterington says in a release. It will also \"provide companies with greater options in terms of diversification,\" he sys. \"Most importantly, it reinforces the EU's leadership in promoting open and fair trade.\" (joshua.kirby@wsj.com; @joshualeokirby)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009059:0/",
            "pub_date": "2026-02-28 02:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw3wr1hV:0",
            "title": "Euromax Enters into Agreements to Extend Maturity Dates of Previously Issued Convertible Debentures",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>VANCOUVER, BC – TheNewswire- February 27, 2026 - EuromaxResources Ltd. </span><span>: (\"Euromax\" or the\"Company\"), announces that, further to its press release dated February 19, 2026,the Company has obtained agreements from each of the European Bank for Reconstruction and Development (“EBRD”) and CC Ilovitza Limited (“CCC”), an affiliate of Consolidated Contractors Company Group,to extend the maturity dates of EBRD’s and CCC’s previouslyissued convertible debentures in the aggregateprincipal amounts of USD$5,000,000 and CAD$5,200,000, respectively, from February 28, 2026 to February 28, 2027(collectively, the “Debenture Amendments”).</span></p><p class=\"\"><span>The Debenture Amendments do not make any changes to theconversion price applicable to principal under the convertibledebentures ($0.15 per share) or to the applicable interest rate (20%for the period from and including April 30, 2018 to and excludingMarch 31, 2019 and 7% for the period from and including March 31, 2019to and excluding February 28, 2027). </span></p><p class=\"\"><span>In order to comply with the requirements of the TSXVenture Exchange, EBRD and CCC had previously agreed that for as longas the Company is listed on the TSX Venture Exchange, any issuance ofshares pursuant to a conversion of accrued and unpaid interest underthe convertible debentures and of any fees under the EBRD convertibledebenture will be subject to the policies of the TSX Venture Exchange,including the requirement that such issuance would be subject to prioracceptance by the TSX Venture Exchange and that such shares would beissued at a price that is not less than the market price (as definedin the policies of the TSX Venture Exchange) at the time such accruedand unpaid interest or fees become payable.    </span></p><p class=\"\"><span>In completing the Debenture Amendments, the Company isrelying on the exemptions from the formal valuation and minorityapproval requirements in Multilateral Instrument 61-101 –Protection of MinoritySecurity Holders in Special Transactions(“MI 61-101”) contained in sections 5.5(e) and 5.7(1)(c) of MI 61-101,respectively. </span></p><p class=\"\"><span>The Debenture Amendments remain subject to the finalacceptance of the TSX Venture Exchange.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange norits regulation services provider accepts responsibility for theadequacy or accuracy of this news release.</span></p><p class=\"\"><span>About Euromax Resources Ltd.</span><br/></p><p class=\"\"><br/><span>Euromax has a major development project in North Macedonia and is</span><br/><span>focused on building and operating the Ilovica-Shtuka gold-copper</span><br/><span>project.</span><br/></p><p class=\"\"><br/><span>Forward-Looking Information</span><br/></p><p class=\"\"><br/><span>This news release contains</span><br/><span>statements that are forward-looking, such as those relating to the</span><br/><span>conversion of any fees and interest under the convertible debentures</span><br/><span>and the final acceptance of the TSX Venture Exchange of the Debenture</span><br/><span>Amendments. Forward-looking statements are frequently characterized by</span><br/><span>words such as “plan”, “expect”, “project”, ”intend”,</span><br/><span>”believe”, ”anticipate” and other similar words, or statements</span><br/><span>that certain events or conditions “may” or “will” occur.</span><br/><span>Forward-looking statements are based on the opinions and estimates of</span><br/><span>management at the dates the statements are made, and are subject to a</span><br/><span>variety of risks and uncertainties and other factors that could cause</span><br/><span>actual events or results to differ materially from those projected in</span><br/><span>the forward-looking statements. This information is qualified in its</span><br/><span>entirety by cautionary statements and risk factor disclosure contained</span><br/><span>in filings made by the Company, including its annual information form</span><br/><span>for the year ended December 31, 2024 and financial statements and</span><br/><span>related management’s discussion and analysis (“MD&amp;A”) for the financial years ended</span><br/><span>December 31, 2024 and 2023, and the unaudited condensed consolidated</span><br/><span>interim financial statements for the three months ended September 30,</span><br/><span>2025 and 2024 along with the accompanying MD&amp;A, filed with the</span><br/><span>securities regulatory authorities in certain provinces of Canada and</span><br/><span>available on SEDAR+ at www.sedarplus.ca. The forward-looking</span><br/><span>statements contained in this document are as of the date of this</span><br/><span>document, and are subject to change after this date. Readers are</span><br/><span>cautioned that the assumptions used in the preparation of such</span><br/><span>information, although considered reasonable at the time of</span><br/><span>preparation, may prove to be imprecise and, as such, undue reliance</span><br/><span>should not be placed on forward-looking statements. Euromax disclaims</span><br/><span>any intention or obligation to update or revise any forward-looking</span><br/><span>statements, whether as a result of new information, future events or</span><br/><span>otherwise, except as</span><br/><span>otherwise required by applicable law.</span><br/></p><p class=\"\"><br/><span>For more information, please visit www.euromaxresources.com or contact:</span></p><p class=\"\"><span>Tim Morgan-Wynne, Chief Executive</span><br/><span>Officer</span><br/></p><p class=\"\"><br/><span>+44 20 3918 5160</span><br/></p><p class=\"\"><br/><span>tmorganwynne@euromaxresources.com</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw3wr1hV:0-euromax-enters-into-agreements-to-extend-maturity-dates-of-previously-issued-convertible-debentures/",
            "pub_date": "2026-02-28 02:45:10",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2947573:0",
            "title": "NWN: Net income surged to $113.3M on higher rates and acquisitions, with strong customer and revenue growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net income rose to $113.3M, driven by new rates, acquisitions, and strong customer growth. Capital expenditures reached $466.9M, and the company maintained a robust capital structure and liquidity. Regulatory, operational, and market risks remain key considerations.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2947573-55c4c0615c05ef5c9835b778d6a9765a\" target=\"_blank\">Northwest Natural Holding Company [NWN] SEC 10-K Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2947573:0-nwn-net-income-surged-to-113-3m-on-higher-rates-and-acquisitions-with-strong-customer-and-revenue-growth/",
            "pub_date": "2026-02-28 02:35:08",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:1cebf9859094b:0",
            "title": "Novo Nordisk Shares Sink 21% as Obesity Shot Trails Lilly Rival",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Novo Nordisk </span><span> has now surrendered the last of the gains that followed the 2021 US approval of Wegovy, marking a decisive turn in what had been one of Europe's most powerful pharmaceutical rallies. After a week in which the shares fell 21%, the stock is on track for its steepest weekly drop since August, surpassing the more than 20% slide earlier this month that came after a dire sales forecast. The reversal effectively erases a roughly fivefold surge built over several years, compressing in less than two years what had once propelled Novo to become briefly Europe's most valuable company and placing renewed pressure on Chief Executive Officer Mike Doustdar to consider broadening the company's focus beyond diabetes and obesity.</span></p><p class=\"\"><span>The immediate catalyst was new data for Novo's next-generation obesity shot CagriSema, which delivered 20.2% weight loss, compared with 23.6% achieved by Eli Lilly &amp; Co.'s </span><span> next-generation candidate tirzepatide. While Doustdar highlighted the 20.2% figure on an investor call after an analyst suggested the drug looks somewhat obsolete, several research teams responded cautiously. Five analysts downgraded the shares following the update, including Deutsche Bank's Emmanuel Papadakis, who shifted to hold, and JPMorgan's Richard Vosser, who moved to neutral, both pointing to potential limits on the drug's commercial outlook. The developments have further underscored how Novo and Eli Lilly's trajectories have diverged as competition in obesity treatments intensifies.</span></p><p class=\"\"><span>Against that backdrop, some analysts argue the near-term thesis may now lean heavily on the newly launched Wegovy pill. Doustdar said more than 240,000 Americans have already taken the pill, describing it as one of the most successful pharmaceutical debuts ever. Intron Health analyst Naresh Chouhan warned that if there were any material slowdown from what has been a strong launch, the shares could de-rate further. Looking beyond the immediate data, HSBC's Rajesh Kumar suggested Novo's ability to manage its obesity franchise past the 2032 patent cliffs may come under increasing scrutiny as rivals advance higher-efficacy and less-frequent dosing drugs, potentially adding another layer to the investment debate.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:1cebf9859094b:0-novo-nordisk-shares-sink-21-as-obesity-shot-trails-lilly-rival/",
            "pub_date": "2026-02-28 02:35:28",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZN2FP:0",
            "title": "Biglari Capital Calls For Immediate Resignation Of Jack In The Box Chairman David Goebel",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BIGLARI CAPITAL: </span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL CALLS FOR IMMEDIATE RESIGNATION OF JACK IN THE BOX CHAIRMAN DAVID GOEBEL, WHO WAS OVERWHELMINGLY REJECTED BY STOCKHOLDERS WITH \"SKIN IN THE GAME\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BIGLARI CAPITAL: RESERVES RIGHT TO PURSUE ALL AVAILABLE LEGAL REMEDIES AGAINST JACK IN THE BOX</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZN2FP:0-biglari-capital-calls-for-immediate-resignation-of-jack-in-the-box-chairman-david-goebel/",
            "pub_date": "2026-02-28 02:35:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009014:0",
            "title": "Neurogene Initiated at Buy by Canaccord Genuity",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(18:36 GMT) </span></strong><span>Neurogene Price Target Announced at $200.00/Share by Canaccord Genuity</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009014:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227009006:0",
            "title": "Block Was Already Eyeing Job Cuts Before AI Shifts — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Block's mass job cuts were clearly motivated by AI, but RBC Capital Markets analysts think the company was already moving toward a material shrink in workforce. Block has had siloed structures for Cash App and Square, and in 2023 made several rounds of job reductions to remove duplication and redundancies, the RBC analysts say. CEO Jack Dorsey said he chose to make all the job cuts at once to avoid frequent eliminations that would erode morale. The analysts think this suggests Block is making a \"one and done reduction\" to settle potential ongoing concerns for surviving employees. (katherine.hamilton@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227009006:0/",
            "pub_date": "2026-02-28 02:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN1Q6:0",
            "title": "Warner Bros signs $110 billion deal with Paramount, its executive discloses in townhall",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Karol Badohal and Harshita Mary Varghese</span></p><p class=\"\"><span>    Warner Bros Discovery </span><span> has agreed to be acquired by Paramount Skydance </span><span> in a $110 billion deal signed Friday morning, according to an audio clip of a global townhall by the company, which was reviewed by Reuters.</span></p><p class=\"\"><span>\"Netflix had the legal right to match the PSKY offer. As you all know, they ultimately decided not to do that. That then resulted in a signed agreement with PSKY as of this morning. So that's where everything stands,\" Bruce Campbell, Warner Bros' chief revenue and strategy officer, said in the townhall.</span></p><p class=\"\"><span>Paramount and Warner Bros did not immediately respond to requests for comment.</span></p><p class=\"\"><span>The deal - which includes some $29 billion in debt - is among Hollywood's biggest media shake-ups and will create one of the largest film studios in the world, allowing Paramount to tap Warner's trove of intellectual property, including franchises such as \"Fantastic Beasts\" and \"The Matrix\".</span></p><p class=\"\"><span>It will also allow Paramount to bolster its streaming efforts, with a potential combination of HBO Max and Paramount+, enabling it to gain market share and tussle with market leader Netflix. </span></p><p class=\"\"><span>The agreement caps a bidding war after Netflix declined to match Paramount's latest $31-per-share offer, which was deemed superior by Warner Bros to the streaming pioneer's $27.75-per-share agreement for its assets.</span></p><p class=\"\"><span>Paramount was in pursuit of Warner Bros since late last year when it launched a hostile campaign to wrestle the company from the streaming giant by consistently raising its offer. </span></p><p class=\"\"><span>The company, led by billionaire Larry Ellison's son David Ellison, enticed Warner's board back to the bargaining table by raising the possibility of an improved cash offer.</span></p><p class=\"\"><span>In its revised bid, Paramount raised the termination fee it would pay should the deal fail to gain regulatory approval to $7 billion from $5.8 billion. </span></p><p class=\"\"><span>Activist investor Ancora Holdings, which owns a small stake in Warner Bros, had also stepped up pressure on the HBO owner to engage more with Paramount.</span></p><p class=\"\"><span>Still, the merger is likely to draw antitrust scrutiny in Washington, foreign countries and U.S. states, including California, despite the Ellisons' ties to President Donald Trump. </span></p><p class=\"\"><span>Lawmakers on both sides of the political aisle have raised concerns that any deal to acquire Warner Bros could result in fewer choices and higher prices for consumers. </span></p><p class=\"\"><span>Cinema operators are also concerned that combining large Hollywood studios could cost jobs and reduce the number of movies released in theaters.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN1Q6:0-warner-bros-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall/",
            "pub_date": "2026-02-28 02:36:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227006086:0",
            "title": "Amazon Leads Record $110 Billion OpenAI Funding Round. AWS Is Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni and Adam Levine</span></p><p class=\"\"><span>Amazon.com unveiled a strategic partnership with OpenAI that includes a $50 billion investment in the ChatGPT maker and positions Amazon Web Services to compete more effectively in AI computing.</span></p><p class=\"\"><span>Under the terms of the deal, Amazon Web Services will be the exclusive third-party cloud distribution provider for OpenAI Frontier, which allows users to build, deploy, and manage teams of artificial-intelligence agents. Amazon will make an initial $15 billion investment, with the remaining $35 billion coming after certain conditions are met.</span></p><p class=\"\"><span>The partners pledged to create a computing environment powered by OpenAI models that will be available for AWS customers \"to build generative AI applications and agents at production scale.\"</span></p><p class=\"\"><span>OpenAI and Amazon also plan to develop customized models that can power Amazon's customer-facing applications. The agreement comes with a pledge from OpenAI to use 2 gigawatts of capacity from Amazon's Trainium chips. This gives AWS some traction among the crowd of producers of AI chips trying to steal some of Nvidia's business.</span></p><p class=\"\"><span>Amazon shares ticked up 0.1% on Friday morning. The tech-heavy Nasdaq Composite was down 0.9%.</span></p><p class=\"\"><span>OpenAI said separately Friday that it had closed a $110 billion funding round, more than double the $40 billion it raised last year. The figure includes the $50 billion from Amazon, $30 billion from SoftBank, and $30 billion from Nvidia.</span></p><p class=\"\"><span>The $110 billion funding round is by far the largest ever. Early investor Microsoft remains the biggest outside shareholder.</span></p><p class=\"\"><span>The investment brings OpenAI to a $730 billion so-called pre-money valuation, up from $500 billion in October.</span></p><p class=\"\"><span>The partnerships with Amazon, Nvidia, and the like \"expand our global reach, deepen our infrastructure, and strengthen our balance sheet so we can bring frontier AI to more people, more businesses, and more communities worldwide,\" OpenAI said in a blog post.</span></p><p class=\"\"><span>OpenAI is a customer of both Amazon and Nvidia, so much of their investments will wind up in those companies' pockets.</span></p><p class=\"\"><span>More importantly for investors, the latest funding arrives before a possible OpenAI initial public offering. Multiple reports have suggested the company could make its trading debut as soon as the second half of the year.</span></p><p class=\"\"><span>The developments come at a time when concerns over artificial-intelligence disruption have reached a fever pitch. Software stocks have been hammered in a broad-based selloff that reflects a downward spiral in tech valuations.</span></p><p class=\"\"><span>Although Nvidia reported blowout earnings on Wednesday, the results failed to assuage investor concerns over the longevity of the AI boom. Shares of the chip maker suffered their worst single-day drop in nearly a year on Thursday.</span></p><p class=\"\"><span>OpenAI has about a trillion dollars in multiyear commitments via contracts with Oracle, Microsoft, Nvidia, Advanced Micro Devices and others. While revenue is growing very quickly at the start-up, even under generous assumptions the sales will probably not be enough to fulfill these long-term commitments profitably. OpenAI may have to scale back its ambitions, or keep returning to funding markets to push forward.</span></p><p class=\"\"><span>Amazon backed almost half of the new round, which appears to be no accident. The AI offerings at AWS were losing out to competitors Microsoft Azure, Google Cloud, and even smaller cloud providers. Hosting Frontier puts AWS on better footing.</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com and Adam Levine at adam.levine@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227006086:0/",
            "pub_date": "2026-02-28 02:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}