{
    "data": [
        {
            "id": "DJN_DN20260226006596_20260226006597:0",
            "title": "ACM Research 4Q Adj EPS 25c >ACMR",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226006596_20260226006597:0/",
            "pub_date": "2026-02-26 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226006557:0",
            "title": "'Piloting' AI Tools Isn't Cool Anymore — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Isabelle Bousquette</span></p><p class=\"\"><span>America's largest corporations are talking about their artificial-intelligence ambitions as much as ever in earnings calls, investor days and events. But there is one word that has noticeably left the chat: \"Pilot.\"</span></p><p class=\"\"><span>Piloting an AI use case, understood as running a small-scale test, used to curry favor with investors. It meant companies were gaining a foothold in the potentially market-upending technology. But over the past year it has come to mean something entirely different, namely that companies just doing pilots aren't doing anything valuable with AI.</span></p><p class=\"\"><span>\"We are not a pilot company,\" said AT&amp;T Chief Data and AI Officer Andy Markus. \"What we're doing truly is driving value.\"</span></p><p class=\"\"><span>Many companies still engage in smaller-scale testing of certain solutions before committing to full enterprise deployments. But they are doing so more sparingly than a year ago, and when they are, they are actively shying away from the word pilot, which has come to be associated with tests that never come to fruition.</span></p><p class=\"\"><span>Worldwide, the word \"pilot\" in reference to AI was used in about 18% fewer earnings calls in the fourth quarter of 2025, compared with the third quarter, according to data from AlphaSense.</span></p><p class=\"\"><span>A now infamous 2025 Massachusetts Institute of Technology study, which found that 95% of enterprise AI pilots fail to produce a measurable financial impact, is partly to blame. But so is the broader cultural conversation that has sparked terms like \"Pilot Purgatory,\" referring to the vast amount of pilots that never move on to any real deployment.</span></p><p class=\"\"><span>Markus sees AI pilots as analogous to flipping a coin: You have a roughly 50/50 chance of it working out. Instead, he said, AT&amp;T is only pursuing use cases where the value is clear from the outset.</span></p><p class=\"\"><span>While some projects might need tweaking before going live, he doesn't use the term \"pilot\" for that phase. \"Maybe you can call it a 'development plan to go to production,' but I wouldn't call it a pilot because most things actually do work,\" he said.</span></p><p class=\"\"><span>Likewise, at Bristol-Myers Squibb, pilots aren't an accurate way to characterize the company's AI work, Chief Digital and Technology Officer Greg Meyers said. The term has become caught up in the \"PowerPoint washing\" of companies that want to get credit for AI without doing anything meaningful, he said.</span></p><p class=\"\"><span>\"Pilots are a really safe way to say that you're doing something with AI without actually having to change anything or take any risk,\" Meyers said.</span></p><p class=\"\"><span>Another problem is that employees often ignore pilots, he said, making it hard to get a sense of whether there will be real alignment with the business needs.</span></p><p class=\"\"><span>Meyers calls his AI testing \"proof of concept,\" a phrase also used in the pharmaceutical development side of the business.</span></p><p class=\"\"><span>\"To me, a pilot often means, 'I'm just going to try something with no commitment,'\" he added.</span></p><p class=\"\"><span>Some technology executives are still sticking with the old terminology. \"There's nothing wrong in my mind with the word pilot. I've always used pilots to roll out new technologies,\" said New York Life Chief Information Officer Deepa Soni.</span></p><p class=\"\"><span>But she added that she is aware the term has taken on some negative connotations. \"I think it got a bad rap because pilots never scaled and operationalized to value,\" she said. Soni said the key isn't overdoing it on pilots, and instead thinking critically about which ones to pursue.</span></p><p class=\"\"><span>\"We could do a hundred pilots, but if nothing made it to production, that to me is not the value of [information technology]. I would rather do half a dozen or a dozen big impactful things,\" she said.</span></p><p class=\"\"><span>Write to Isabelle Bousquette at isabelle.bousquette@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226006557:0/",
            "pub_date": "2026-02-26 20:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS3Rq25a:0",
            "title": "White Gold Corp. Intersects Multiple Zones of Gold Mineralization and Expands the High-Grade Core at Golden Saddle Intersecting 3.23 g/t Gold over 56.1 m and Intersects High Grade Gold on the Arc Deposit Significantly Extending Gold Mineralization by 100m Down Plunge",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, ON / ACCESS Newswire / February 26, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>White Gold Corp. (TSX.V:WGO)(OTCQX:WHGOF)(FRA:29W</span></strong><span> ) (the \"Company\") is pleased to report additional assay results from its 2025 diamond drilling program at the flagship Golden Saddle and Arc deposits, located on the White Gold Property in west-central Yukon (Figure 1 and 2). Hole WHTGS25D0216 successfully intersected high-grade gold mineralization, returning 3.23 g/t Au over 56.10m, expanding the width of the high-grade core by more than 50m to the west at a vertical depth of 350m, and further demonstrating the potential for additional growth of the high-grade core in multiple directions. The same hole also intersected the Footwall breccia zone beneath the current pit shell, confirming continuity of key mineralization, lithology, and structural features down plunge and along strike. Furthermore, multiple lenses of gold mineralization were intersected in the shallow hanging wall zone, again further supporting recent 3D modeling refinements that capture this mineralization in the hanging wall more consistently, and confirming prospectivity of assaying unsampled historic drill intervals throughout this zone. At the Arc deposit, drilling successfully intersected high grade gold mineralization, including 2.73 g/t Au over 4.35m in WHTAR25D038, as well as multiple other gold intercepts in parallel mineralized panels. Prior to this drilling, Arc mineralization was defined along 1.5 km striking northwest to southeast, and only to an average vertical depth of approximately 120m. These drill results represent the first step in significantly extending Arc mineralization down plunge, which has now been extended by at least 100 m, with the zone remaining open for further expansion. These results form part of the Company's fully funded work program supported by strategic partners including Agnico Eagle Mines Limited (TSX:AEM, NYSE:AEM).</span></p><p class=\"\"><span>All of the Company's deposits remain open in multiple directions for further expansion which will be the primary focus of the Company's upcoming fully funded 2026 exploration program. The 2026 exploration program is anticipated to be the largest drill program in the history of the Company and is being designed with the objective of significantly increasing the size of the Company's known large high-grade gold resource and making new gold and critical mineral discoveries across the Company's district scale land package. Further details on the 2026 exploration program will be announced in due course.</span></p><p class=\"\"><span>The company's flagship White Gold project hosts four near-surface gold deposits, which collectively contain an estimated 1,732,300 ounces of gold in indicated resources (35.2 million tonnes grading 1.53 grams per tonne gold) and 1,265,900 ounces of gold in inferred resources (32.2 million tonnes grading 1.22 g/t Au), with significant expansion potential on the resource itself and in the immediately surrounding area. The Golden Saddle Main Zone hosts a consistent high-grade core containing 1,100,000 oz Indicated (12.3 Mt @ 2.84 g/t Au) and 93,000 oz Inferred (1.4 Mt @ 2.03 g/t Au) at a 1.0 g/t cut-off. At 3.0 g/t cut-off, this core contains 695,000 oz Indicated (4.4 Mt @ 4.88g/t Au) and 35,000 oz Inferred (269 kt @ 4.07 g/t Au) (see the Company's news release dated October 6, 2025).</span></p><p class=\"\"><span>In addition to the White Gold project, the Company's district-scale exploration portfolio comprised of 21 properties includes a robust pipeline of early stage to discovery stage exploration targets, including gold and other critical minerals. Regional exploration work has also produced several new discoveries and prospective targets on the Company's claim packages which border other sizable gold deposits including the Coffee project owned by Fuerte Metals Corporation </span><span> and Western Copper and Gold Corporation's </span><span>(NYSE:WRN) Casino project.</span></p><p class=\"\"><span>CEO of White Gold Corp., David D'Onofrio stated \"These results clearly demonstrate that Golden Saddle and Arc deposits remain highly expandable with strong and uniquely high-grade gold continuity. Expanding the Golden Saddle high-grade core and significantly extending the plunge direction at Arc further confirms the geological modelling and validates our strategy of systematically demonstrating resource growth potential. With a fully funded 2026 exploration program being designed to significantly increase resources and make new discoveries on our district scale portfolio in the Yukon's prolific White Gold District, our maiden PEA on track for release in Q2 and several other near term catalysts, we believe that 2026 has the potential to be a transformative year for White Gold Corp.\"</span></p><p class=\"\"><span>Dylan Langille, VP of Exploration, added \"The 2025 drilling results successfully achieved our stated goals of proving structural targets and validating recent model refinements as we aim to aggressively grow our total gold resources. Today's announcement demonstrates a significant expansion to the width of the high-grade core by 50m to the west at depth, further validating the potential for additional growth of the high-grade core. As previously released, we also encountered some of the highest grades to date on the project in 2025 (6.89g/t over 50.2m in hole WHTGS25D0218A) providing more evidence of the deposit's unique high-grade potential. At Arc, this was the first meaningful down-plunge test beneath the current resource envelope and it successfully intersected strong mineralization as well as several other parallel panels of mineralization. With multiple zones at Golden Saddle, Arc and our other deposits remaining open and underexplored, we look forward to hitting these deposits with a very sizable drill program in the coming months, and the Company's largest program to date, to further increase the size of the resources and to also drill test other exciting earlier stage targets on our large property package in 2026.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Highlights:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WHTGS25D0216 broadens high-grade core at the Golden Saddle main zone by 50m to the west, intersecting 3.23 g/t Au over 56.10 m at a vertical depth of 350 m (Figure 3 and 4).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Confirmation of continued mineralization in the footwall breccia with the intersection including the presence of visible gold.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Intersection of multiple lenses of mineralization confirms confidence of hanging wall mineralization recently captured in the new geological model and updated mineral resource estimate. The Hanging Wall Mineralization will be further supported by a relogging and sampling program of significant amounts of historical un-assayed core in the vicinity of previously encountered hanging wall mineralization, which will also aid in the future exploration of these domains at depth.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>100m down-plunge extension of Arc gold mineralization with an intercept of 2.73 g/t over 4.35 m, paving the way for significant growth in 2026 along the deposit's 1.5 km strike length (Figure 5 and 6).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Given the relatively under drilled nature of each deposit and the understanding of structurally controlled and hosted orogenic gold deposit models, significant growth potential (Figure 7) remains untested at depth and along strike.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Additional exploration results from the Company's exploration program on its district scale portfolio to be released in due course.</span></p></li></ul><p class=\"\"><span>To view images, please click below:</span></p><p class=\"\"><span>District Mapping</span></p><p class=\"\"><span>Topographic Collar Locations</span></p><p class=\"\"><span>Golden Saddle Main Zone Long Section</span></p><p class=\"\"><span>Cross Section Hole</span></p><p class=\"\"><span>Arc Long Section</span></p><p class=\"\"><span>Cross Section WHTAR25D038_F</span></p><p class=\"\"><span>Resource Growth Potential</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>PDAC 2026</span></strong></p><p class=\"\"><span>White Gold Corp. will be exhibiting at PDAC 2026 Investors Exchange. Conference attendees are invited to visit the Company booth to learn more. Management is also participating in the PDAC One on One Meeting Program. Interested parties are encouraged to book a meeting through the conference portal website below.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Booth Number:</span></strong><span> 2312</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dates:</span></strong><span> March 1 st to 4 th</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Exhibition Hours:</span></strong><span> 10 a.m. to 5 p.m. ET</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>One on One Meetings:</span></strong><span> https://www.precioussummit.com/events/pdac-2026-one-on-one-meeting-program/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Diamond Drill Program Results</span></strong></p><p class=\"\"><span>The 2025 diamond drill program on the Golden Saddle deposit was designed to target three zones of mineralization: the hanging wall, main zone, and footwall. At the Arc deposit drilling was designed to test the down-plunge extent of gold mineralization below 120 m vertical, as well as provide material for metallurgical test work programs as contribution towards a Preliminary Economic Assessment (PEA), expected to be published in Q2 of 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Table 1: Significant Intervals</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Hole ID</span></p></td><td><p class=\"\"><span>Zone</span></p></td><td><p class=\"\"><span>From (m)</span></p></td><td><p class=\"\"><span>To (m)</span></p></td><td><p class=\"\"><span>Width (m)*</span></p></td><td><p class=\"\"><span>Au (g/t)</span></p></td></tr><tr><td rowspan=\"9\"><p class=\"\"><span>WHTGS25D0216</span></p></td><td rowspan=\"6\"><p class=\"\"><span>Hanging Wall</span></p></td><td><p class=\"\"><span>16.00</span></p></td><td><p class=\"\"><span>18.00</span></p></td><td><p class=\"\"><span>2.00</span></p></td><td><p class=\"\"><span>1.26</span></p></td></tr><tr><td><p class=\"\"><span>70.55</span></p></td><td><p class=\"\"><span>71.30</span></p></td><td><p class=\"\"><span>0.75</span></p></td><td><p class=\"\"><span>2.24</span></p></td></tr><tr><td><p class=\"\"><span>166.00</span></p></td><td><p class=\"\"><span>177.70</span></p></td><td><p class=\"\"><span>5.70</span></p></td><td><p class=\"\"><span>0.71</span></p></td></tr><tr><td><p class=\"\"><span>235.50</span></p></td><td><p class=\"\"><span>239.50</span></p></td><td><p class=\"\"><span>4.00</span></p></td><td><p class=\"\"><span>1.00</span></p></td></tr><tr><td><p class=\"\"><span>251.90</span></p></td><td><p class=\"\"><span>257.00</span></p></td><td><p class=\"\"><span>5.10</span></p></td><td><p class=\"\"><span>0.80</span></p></td></tr><tr><td><p class=\"\"><span>338.00</span></p></td><td><p class=\"\"><span>343.50</span></p></td><td><p class=\"\"><span>5.50</span></p></td><td><p class=\"\"><span>0.95</span></p></td></tr><tr><td><p class=\"\"><span>Main Zone</span></p></td><td><p class=\"\"><span>408.90</span></p></td><td><p class=\"\"><span>465.00</span></p></td><td><p class=\"\"><span>56.10</span></p></td><td><p class=\"\"><span>3.23</span></p></td></tr><tr><td></td><td><p class=\"\"><span>474.85</span></p></td><td><p class=\"\"><span>483.50</span></p></td><td><p class=\"\"><span>8.65</span></p></td><td><p class=\"\"><span>0.71</span></p></td></tr><tr><td><p class=\"\"><span>Footwall</span></p></td><td><p class=\"\"><span>527.45</span></p></td><td><p class=\"\"><span>536.30</span></p></td><td><p class=\"\"><span>8.85</span></p></td><td><p class=\"\"><span>1.02</span></p></td></tr><tr><td rowspan=\"3\"><p class=\"\"><span>WHTGS25D0217</span></p></td><td><p class=\"\"><span>Main Zone</span></p></td><td><p class=\"\"><span>296.80</span></p></td><td><p class=\"\"><span>300.20</span></p></td><td><p class=\"\"><span>3.40</span></p></td><td><p class=\"\"><span>1.54</span></p></td></tr><tr><td rowspan=\"2\"><p class=\"\"><span>Footwall</span></p></td><td><p class=\"\"><span>504.00</span></p></td><td><p class=\"\"><span>506.50</span></p></td><td><p class=\"\"><span>2.50</span></p></td><td><p class=\"\"><span>1.44</span></p></td></tr><tr><td><p class=\"\"><span>519.70</span></p></td><td><p class=\"\"><span>526.70</span></p></td><td><p class=\"\"><span>7.00</span></p></td><td><p class=\"\"><span>0.75</span></p></td></tr><tr><td rowspan=\"4\"><p class=\"\"><span>WHTAR25D038</span></p></td><td rowspan=\"4\"><p class=\"\"><span>Arz Zone</span></p></td><td><p class=\"\"><span>110.00</span></p></td><td><p class=\"\"><span>112.40</span></p></td><td><p class=\"\"><span>2.40</span></p></td><td><p class=\"\"><span>0.87</span></p></td></tr><tr><td><p class=\"\"><span>117.00</span></p></td><td><p class=\"\"><span>117.70</span></p></td><td><p class=\"\"><span>0.70</span></p></td><td><p class=\"\"><span>1.26</span></p></td></tr><tr><td><p class=\"\"><span>137.50</span></p></td><td><p class=\"\"><span>139.30</span></p></td><td><p class=\"\"><span>1.80</span></p></td><td><p class=\"\"><span>1.61</span></p></td></tr><tr><td><p class=\"\"><span>185.15</span></p></td><td><p class=\"\"><span>189.50</span></p></td><td><p class=\"\"><span>4.35</span></p></td><td><p class=\"\"><span>2.73</span></p></td></tr><tr><td rowspan=\"2\"><p class=\"\"><span>WHTAR25D039</span></p></td><td rowspan=\"2\"><p class=\"\"><span>Arc Zone</span></p></td><td><p class=\"\"><span>126.90</span></p></td><td><p class=\"\"><span>128.40</span></p></td><td><p class=\"\"><span>1.50</span></p></td><td><p class=\"\"><span>1.95</span></p></td></tr><tr><td><p class=\"\"><span>202.85</span></p></td><td><p class=\"\"><span>203.50</span></p></td><td><p class=\"\"><span>0.65</span></p></td><td><p class=\"\"><span>1.31</span></p></td></tr></tbody></table></div><p class=\"\"><span>*True thickness estimated at 80 - 95% of the reported intervals</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Table 2: 2025 Diamond Drill Hole Details</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Hole ID</span></p></td><td><p class=\"\"><span>Type</span></p></td><td><p class=\"\"><span>Azimuth</span></p></td><td><p class=\"\"><span>Dip</span></p></td><td><p class=\"\"><span>Length</span></p></td><td><p class=\"\"><span>UTM E</span></p></td><td><p class=\"\"><span>UTM N</span></p></td><td><p class=\"\"><span>Target</span></p></td><td><p class=\"\"><span>Purpose</span></p></td></tr><tr><td><p class=\"\"><span>WHTGSD25D0216</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>163.79</span></p></td><td><p class=\"\"><span>-63.51</span></p></td><td><p class=\"\"><span>629</span></p></td><td><p class=\"\"><span>576216.5</span></p></td><td><p class=\"\"><span>7005606</span></p></td><td><p class=\"\"><span>Golden Saddle</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td><p class=\"\"><span>WHTGSD25D0217</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>164.26</span></p></td><td><p class=\"\"><span>-63.18</span></p></td><td><p class=\"\"><span>581</span></p></td><td><p class=\"\"><span>576218.0</span></p></td><td><p class=\"\"><span>7005498</span></p></td><td><p class=\"\"><span>Golden Saddle</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td><p class=\"\"><span>WHTGSD25D0218*</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>165.50</span></p></td><td><p class=\"\"><span>-71.33</span></p></td><td><p class=\"\"><span>145</span></p></td><td><p class=\"\"><span>576348.6</span></p></td><td><p class=\"\"><span>7005288</span></p></td><td><p class=\"\"><span>Golden Saddle</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td><p class=\"\"><span>WHTGSD25D0218A*</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>169.78</span></p></td><td><p class=\"\"><span>-71.34</span></p></td><td><p class=\"\"><span>440</span></p></td><td><p class=\"\"><span>576348.6</span></p></td><td><p class=\"\"><span>7005288</span></p></td><td><p class=\"\"><span>Golden Saddle</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td><p class=\"\"><span>WHTAR25D038</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>214.39</span></p></td><td><p class=\"\"><span>-46.32</span></p></td><td><p class=\"\"><span>236</span></p></td><td><p class=\"\"><span>577475.4</span></p></td><td><p class=\"\"><span>7004556</span></p></td><td><p class=\"\"><span>Arc</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td><p class=\"\"><span>WHTAR25D038</span></p></td><td><p class=\"\"><span>DDH</span></p></td><td><p class=\"\"><span>219.13</span></p></td><td><p class=\"\"><span>-45.49</span></p></td><td><p class=\"\"><span>221</span></p></td><td><p class=\"\"><span>577441.2</span></p></td><td><p class=\"\"><span>7004642</span></p></td><td><p class=\"\"><span>Arc</span></p></td><td><p class=\"\"><span>Exploration</span></p></td></tr><tr><td colspan=\"9\"><p class=\"\"><span>*See Company press release dated November 4, 2025</span></p></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Golden Saddle Deposit</span></strong></p><p class=\"\"><span>The Golden Saddle deposit consists of the GS Main, GS Footwall and GS West zones and together the zones define mineralization over a 1,500 m strike length and up to a maximum 500 m vertical depth based on drilling done to date, which continues to remain open for expansion in multiple directions. Gold mineralization at the Golden Saddle deposit is hosted in a metavolcanic and metaintrusive assemblage broadly consisting of felsic orthogneiss, amphibolite, and ultramafic units. Gold generally occurs as micron-scale blebs along fractures or encapsulated by pyrite, and as visible gold (less than 5 mm in size) located as free grains in quartz. Mineralization is present in quartz veins and stockwork or breccia with disseminated pyrite. Drill hole intersected gold mineralization is spatially co-incident with structures, or faults which are interpreted to be the primary conduits for hydrothermal fluids responsible for gold deposition. A series of north-south striking thrust faults and a large east-west strike-slip sinistral fault act as both mineralizing pathways and controls on the geometry of gold mineralization. The 2025 drilling program was successful in demonstrating the robust nature of mineralization at all three zones.</span></p><p class=\"\"><span>Main Zone Mineralization</span></p><p class=\"\"><span>The Golden Saddle Main Zone hosts a consistent high-grade core containing 1,100,000 oz Indicated (12.3 Mt @ 2.84 g/t Au) and 93,000 oz Inferred (1.4 Mt @ 2.03 g/t Au) at a 1.0 g/t cut-off. At 3.0 g/t cut-off, this core contains 695,000 oz Indicated (4.4 Mt @ 4.88g/t Au) and 35,000 oz Inferred (269 kt @ 4.07 g/t Au). The intersection of 6.89g/t over 50.2 m in hole WHTGS25D0218A (see Company press release dated November 4, 2025), infilled a 75 m gap and increased the grade of this high-grade core. WHTGS25D0216 released herein, intersected 3.23 g/t over 56.10 m, extending the high-grade core 50 metres westward at depth and confirming continuity along the interpreted plunge direction (47° toward 285°). These results demonstrate that the high-grade domain remains open along strike and down plunge.</span></p><p class=\"\"><span>Foot Wall Mineralization</span></p><p class=\"\"><span>The high-grade footwall breccia zone that was previously identified in historic drilling, but remained underexplored, was intersected by all three 2025 diamond drill holes targeting the Golden Saddle Deposit. Previously released hole WHTGS25D0218A intersected 6.89 g/t Au over 2.80 m (with roughly 2 m of lost core), while WHTGS25D0216 and WHTGS25D0217 intersected 1.02 g/t Au over 8.85 m and 0.75 g/t Au over 7.00 m, respectively. The consistent geological signature - strongly hematized semi-matrix supported breccia with carbonate veining and fracture-controlled pyrite - confirms the Footwall Zone as a compelling future resource growth target.</span></p><p class=\"\"><span>Hanging Wall Mineralization</span></p><p class=\"\"><span>Inthe Hanging Wall Zone, gold mineralization occurs in quartz-carbonate-sulphide veins contained throughout strongly oxidized orthogneiss and amphibolite units. Multiple lenses of parallel gold mineralization have been identified and captured by recent reinterpretation and modelling exercises (see press release dated August 21, 2025). The three Golden Saddle diamond holes drilled in 2025 have intersected multiple very shallow mineralized gold domains that strengthen modelled gold wire frames. The Hanging Wall results outlined in Table 1 reiterate the importance of the relogging and sampling program to be carried out on historic unassayed drill holes.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Arc Deposit</span></strong></p><p class=\"\"><span>The Arc deposit is located 400 m south of the Golden Saddle and consists of two zones, the Arc Main and Arc Footwall zones, both with an arcuate shape trending E-W and NW-SE and dipping to the north and north-east at approximately 50 degrees. Mineralization at the Arc is defined along a 1.5km strike length and to an average vertical depth of approximately 120 m.</span></p><p class=\"\"><span>The 2025 diamond drilling program completed the first meaningful down-plunge test of the system, intersecting 2.73 g/t Au over 4.35m 100 m down plunge, extending the vertical depth of mineralization by nearly double the length. This result opens a substantial vertical growth corridor beneath the existing resource shell. The Arc system remains open below 120 m vertical depth across its entire 1.5km strike length.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2025 Exploration Program Update</span></strong></p><p class=\"\"><span>The 2025 exploration season was strategically focused on advancing and expanding the Company's flagship White Gold Project, following a renewed emphasis on resource growth opportunities within and adjacent to the existing deposits. The program has been successful in:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Testing the continuity, grade and extent of the high-grade main zone of the Golden Saddle Deposit. Achieving a 50 m expansion to the west at a vertical depth of 350 m with the intersection of 3.23 g/t gold over 56.10 m.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Infilled a 75 m gap and increased the grade of the Golden Saddle main zone within 150 m of surface, intersecting one of the best holes to date with WHTGS25D0218A returning 6.89 g/t over 50.1 m (see press release dated November 4, 2025)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Confirming the potential for high-grade ore bodies to exist internal to the broader mineralization envelope, with significant room to test for growth / expansion down plunge and along strike.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Intersecting high-grade mineralization 100 m down plunge on the Arc Deposit for the first time, breaking way for significant down=plunge growth along a 1.5 km strike length.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Delivering material across all four deposits (Golden Saddle, Arc, Ryan's Surprise, and VG) for metallurgical test work programs contributing to maiden PEA (Preliminary Economic Assessment) to be release in Q2 2026.</span></p></li></ul><p class=\"\"><span>These results validate the technical strategy implemented this year, which targeted the footwall breccia, multiple hanging wall zones, and high-grade core continuity at Golden Saddle. It has demonstrated the presence of multiple parallel zones of mineralization that remain open along strike and at depth, supporting confidence for targeted resource growth. The Company's Phase II work has also advanced key metallurgical and geotechnical studies across the Golden Saddle and Arc deposits in preparation for a future preliminary economic assessment (PEA), while district-wide data compilation and target generation continued in parallel to define the next pipeline of drill-ready prospects.</span></p><p class=\"\"><span>The success of the 2025 drilling reinforces the excellent exploration potential that remains across the White Gold Project and provides a strong foundation for the Company's fully funded 2026 exploration program currently being designed following the completion of a $23 million private placement (see Company press release dated October 15, 2025). These results mark an encouraging start to the next chapter of systematic resource expansion and discovery across the Company's district-scale portfolio in Yukon's premier mining jurisdiction.</span></p><p class=\"\"><span>Phase I of the 2025 exploration program is a continuation of the Company's successful expanded exploration focus beyond gold, targeting critical metals including copper (Cu), molybdenum (Mo), tungsten (W), antimony (Sb) and bismuth (Bi) amongst others. Geophysical work was conducted on three of the Company's highly prospective critical mineral targets - the Bridget target on the Pedlar Property, the Guilder target of the Loonie Property, and the Mt. Hart target on the Nolan Property. The program included both gradient and dipole-dipole induced polarization (IP) surveys designed to refine high-priority porphyry style targets for drill testing. Results on the Bridget target of the Pedlar property (see Company press release dated December 16, 2025) demonstrated favourable chargeability and resistivity anomalies favourable for porphyry style mineralization systems residing directly beneath strong surface soil geochemistry signatures. Results from the other two properties are expected to be released in the near future.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Preliminary 2026 Outlook</span></strong></p><p class=\"\"><span>Heading into 2026 with a fully funded exploration program significantly larger than the previous years, the primary objective remains resource growth and expansion within, adjacent and in close proximity to the Golden Saddle, Arc, Ryan's Surprise, and VG deposits. All four deposits remain open for expansion along strike and down-dip. In addition to resource growth, the company will look to advance discovery-stage targets such as Betty Ford, Vertigo, and Chris Creek as well as assess high priority early-stage prospects for discovery potential. In addition, the Company is working toward a maiden Preliminary Economic Assessment on the White Gold Project, expected to be released in Q2 of 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Resource Growth</span></strong></p><p class=\"\"><span>All four of White Gold's near-surface deposits, which form the </span><strong class=\"root-Tkn6WL2y\"><span>White Gold Project</span></strong><span> , are interpreted to represent </span><strong class=\"root-Tkn6WL2y\"><span>structurally controlled orogenic gold systems</span></strong><span> . These deposits collectively form the Company's gold resource base in the heart of its extensive land package and all </span><strong class=\"root-Tkn6WL2y\"><span>remain open for expansion</span></strong><span> . Additional information on each of these deposits can be found below.</span></p><p class=\"\"><span>Golden Saddle Deposit</span></p><p class=\"\"><span>The Golden Saddle contains an open-pit resource of 1.614 M oz Indicated (31.03 Mt @ 1.62 g/t Au) and 268.7 k oz Inferred (7.84 Mt @ 1.07 g/t Au) defined by 210 drill holes for a total of approximately 61,000 m. Significant growth opportunity exists with parallel zones of mineralization in the hanging wall and footwall zones, the plunge of the high-grade ore shoots, and extension along strike toward Golden Saddle West and beyond.</span></p><p class=\"\"><span>Arc Deposit</span></p><p class=\"\"><span>The Arc deposit contains 115,800 oz Indicated (4.113 Mt @ 0.88 g/t Au) and 397,000 oz Inferred (12.25 Mt @ 1.01 g/t) across a 1.5 km strike length and down to an average vertical depth of approximately 100 m defined by 73 drill holes for a total of approximately 15,000 m. Limited drilling on mineralization, particularly below 120 m vertical, presents an exceptional potential growth opportunity to add additional ounces to the mineral resource estimate.</span></p><p class=\"\"><span>VG Deposit</span></p><p class=\"\"><span>The VG deposit is located approximately 85 km south of Dawson City and 11 km north of the Golden Saddle deposit. Gold mineralization at the VG deposit is hosted in quartz ± carbonate veins, stockwork and breccia zones, and pyrite veinlets, including cubic pyrite and visible gold, associated with intense-quartz-carbonate-sericite alteration, pervasive K-spar and hematite emplaced along en-echelon faults or shear zones. Visually, the style of gold mineralization and alteration appears identical to the Golden Saddle deposit, along with similar dominant host rocks of biotite-feldspar (± augen)-quartz gneisses.</span></p><p class=\"\"><span>To date, the VG deposit comprises 296,000 oz Inferred (6.285 Mt @ 1.46 g/t Au) defined by 65 drill holes for a total of approximately 7,600 m. Gold mineralization is modelled to a maximum vertical depth of 200 m, with the geometry of the modelled mineralization being cone shaped due to limited drilling across the deposit. A large drill campaign in 2026 will look to deliver meaningful growth to the existing resource estimate as well as explore additional targets on the QV Property, including the Chris Creek target.</span></p><p class=\"\"><span>Ryan's Surprise Deposit</span></p><p class=\"\"><span>Ryan's Surprise is located 1.5 km west of the Golden Saddle deposit, along a 6.5 km long x 1 km wide north-northwest trend of anomalous gold and arsenic in soils (\"Ryan's Trend\"), which also hosts several other prospective early-stage targets in close proximity with significant surface gold mineralization and represent further potential for expansion of this project. Gold mineralization at the Ryan's Surprise deposit is primarily hosted within a meta-sedimentary sequence dominated by banded (graphitic) quartzite and interbedded pelitic biotite schist cross-cut by numerous felsic - intermediate dikes and sills. Gold mineralization appears to be focused within breccia and shear zones that have been affected by hydrothermal alteration and sulphide mineralization.</span></p><p class=\"\"><span>The mineralization footprint at the Ryan's Surprise deposit measures approximately 550 m north-south by 500 m east-west to a vertical depth of 650 m remains open along strike and at depth. To date, the Ryan's Surprise deposit contains 280,300 oz Inferred (5.693 Mt @ 1.53 g/t Au) defined by 35 drill holes for a total of approximately 8,370 m.</span></p><p class=\"\"><span>Overall, given the relatively under drilled nature of each deposit and the understanding of structurally controlled and hosted orogenic gold deposit models, significant growth potential remains untested at depth and along strike.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Discovery-Stage Projects</span></strong></p><p class=\"\"><span>QV Property and Chris Creek Target</span></p><p class=\"\"><span>The Chris Creek target forms a 2.2 km+ long east-northeast trending gold-in-soil anomaly, located approximately 9 km northwest of the VG deposit and appears to be similar geochemically to the Company's VG and Golden Saddle deposits. The anomaly was originally identified in 2023 and follow-up exploration work early in the 2024 field season included infill and extension soil sampling, rock sampling, and 2D inversions of ground VLF-EM survey lines.</span></p><p class=\"\"><span>A maiden 2024 diamond drill program at Chris Creek identified a broad zone of gold mineralization dipping moderately (30°) to the NNW (see Company press release dated February 27, 2025). The geological features of Chris Creek closely resemble those of the Golden Saddle and VG deposits, all of which remain open for expansion. At Golden Saddle and VG, gold is hosted within brittle-ductile fault zones, quartz vein breccias, and stockwork veining, like the structures seen at Chris Creek. Initial rock sampling results suggest Chris Creek shares many of the same features as the Golden Saddle and VG deposits. The strong similarities between Chris Creek, which remains underexplored and open for expansion, and the established Golden Saddle and VG deposits, represent substantial potential for future discoveries within the Chris Creek system. With multiple mineralization styles (Au-Te-Ag, As-Sb, Mo-bearing quartz-carbonate veins, and skarn) across a large structural corridor, there is significant opportunity for continued geophysical surveys, trenching, and drilling to further define and expand the mineralized zones.</span></p><p class=\"\"><span>Betty Property</span></p><p class=\"\"><span>The Betty Property represents one of the Company's most strategically positioned and geologically compelling discovery-stage assets in the White Gold District. Located along the eastern strike extension of the Coffee Creek Fault - the principal structural control on Fuerte Metals's multi-million-ounce Coffee deposit - Betty occupies a highly prospective corridor between the Coffee gold deposit and Western Copper and Gold's Casino porphyry system.</span></p><p class=\"\"><span>Drilling at the Betty Ford target which is located in close proximity to the Coffee Project has consistently returned broad zones of near-surface high grade gold mineralization hosted within polylithic breccia units along east-west splay structures related to the Coffee Creek Fault. Recent diamond drilling has delivered multiple significant intercepts including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>3.38 g/t Au over 53 m</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>2.96 g/t Au over 46.5 m including 5.03 g/t Au over 25 m</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>5.04 g/t Au over 20.85 m</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>3.46 g/t Au over 50 m</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>8.94 g/t Au over 18.29 m</span></p></li></ul><p class=\"\"><span>Mineralization remains open for expansion, with gold traced approximately 175 m along strike and to 75 m vertical depth to date. The scale and consistency of near-surface mineralization suggest strong potential for a bulk-tonnage style system with room for expansion.</span></p><p class=\"\"><span>Beyond Betty Ford, the property hosts multiple additional high-priority targets including Betty Ford West, Mascot, Black Betty, and Betty White East - each defined by strong gold-in-soil anomalies and structural controls along the Coffee Creek Fault corridor.</span></p><p class=\"\"><span>The Betty Property offers exposure to multiple deposit styles including orogenic gold, intrusion-related gold systems, and porphyry copper-gold mineralization, positioning it as a potential new district-scale discovery opportunity within the Company's broader land package.</span></p><p class=\"\"><span>Vertigo Target</span></p><p class=\"\"><span>The Vertigo target, located on the JP Ross property approximately 75 km south of Dawson City, represents an advanced discovery-stage gold system characterized by multiple mineralized structures over a 1.5 km by 650 m corridor.</span></p><p class=\"\"><span>Vertigo comprises at least six west-northwest striking, steeply south-dipping mineralized structures consisting of quartz veining, brecciation, and fracture-controlled sulphide mineralization including arsenopyrite, galena, and pyrite with locally visible gold.</span></p><p class=\"\"><span>Historical RAB and RC drilling has returned significant near-surface high-grade intercepts including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>23.44 g/t Au over 24.38 m from surface</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>9.46 g/t Au over 22.86 m from surface</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>14.23 g/t Au over 6.10 m</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>8.11 g/t Au over 18.29 m</span></p></li></ul><p class=\"\"><span>More recently, diamond drilling confirmed the presence of broader bulk-tonnage style mineralization, including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>1.4 g/t Au over 58.4 m, including 9.10 g/t Au over 2.85 m and 6.68 g/t Au over 4.80 m</span></p></li></ul><p class=\"\"><span>Structural reinterpretation has identified multiple vein arrays with varying orientations, suggesting previous drilling only partially tested the system. The target remains largely shallow-tested and open along strike and at depth. Given the combination of high-grade vein zones and emerging bulk-tonnage potential, Vertigo represents a compelling 2026 drill candidate with significant discovery upside.</span></p><p class=\"\"><span>Resources &amp; Opportunities in the White Gold District</span></p><p class=\"\"><span>West-central Yukon is host to several highly prospective mineral districts, including the </span><strong class=\"root-Tkn6WL2y\"><span>White Gold</span></strong><span> , </span><strong class=\"root-Tkn6WL2y\"><span>Dawson Range</span></strong><span> , </span><strong class=\"root-Tkn6WL2y\"><span>Klondike</span></strong><span> , and </span><strong class=\"root-Tkn6WL2y\"><span>Sixtymile</span></strong><span> districts. The Klondike was the epicenter of the historic Klondike Gold Rush in 1896, with over </span><strong class=\"root-Tkn6WL2y\"><span>20 million ounces of placer gold</span></strong><span> production having occurred in the region since that time.</span></p><p class=\"\"><span>The Company's property portfolio, which covers large portions of the White Gold District, was assembled by renowned prospector </span><strong class=\"root-Tkn6WL2y\"><span>Shawn Ryan</span></strong><span> , and represents the </span><strong class=\"root-Tkn6WL2y\"><span>largest contiguous claim package</span></strong><span> in the region.</span></p><p class=\"\"><span>Two other significant advanced-stage projects border the Company's claims to the south:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The </span><strong class=\"root-Tkn6WL2y\"><span>Coffee Project</span></strong><span> , owned by </span><strong class=\"root-Tkn6WL2y\"><span>Fuerte Metals</span></strong><span> with Measured and Indicated Resources of 80.0.2 Mt grading 1.15 g/t Au for 2.96 million ounces of gold, and Inferred Resources of 21.2 Mt grading 1.17 g/t Au for 0.80 million ounces gold (2) (3) . Fuerte recently announced a PEA and intentions to arrive at a construction decision in early 2027. Development of the Coffee project would enhance infrastructure in the district significantly also benefiting White Gold.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The </span><strong class=\"root-Tkn6WL2y\"><span>Casino Project</span></strong><span> , owned by </span><strong class=\"root-Tkn6WL2y\"><span>Western Copper and Gold Corporation</span></strong><span> (TSX: WRN, NYSE: WRN), containing Measured and Indicated Resources of 2,490.7 Mt grading 0.18 g/t Au, 0.14% Cu for 14.8 million ounces of gold and 7.6 billion pounds of copper, and Inferred Resources of 1,412.5 Mt grading 0.14 g/t Au, 0.10% Cu for 6.3 million ounces of gold and 3.1 billion pounds of copper (4)(3)</span></p></li></ul><p class=\"\"><span>The region has also seen significant investment by major mining companies in recent years, and the Yukon is consistently highly ranked among the </span><strong class=\"root-Tkn6WL2y\"><span>top global mining jurisdictions</span></strong><span> on the </span><strong class=\"root-Tkn6WL2y\"><span>Fraser Institute's Investment Attractiveness Index</span></strong><span> .</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>QA/QC</span></strong></p><p class=\"\"><span>The diamond drilling on the White Gold Property consisted of NQII size drill core and was cut in half on site using a diamond saw. Analytical work on the half core was performed by Bureau Veritas, an internationally recognized analytical services provider, at its South Vancouver, British Columbia laboratory. Sample preparation was carried out at its Whitehorse, Yukon facility. All diamond drill core samples were prepared using the PRP70-250 package, where samples were weighed, dried, and crushed to greater than 70% passing a 2mm sieve, then pulverized to greater than 85% passing 75 microns. Samples were then analyzed in accordance with BV's FA430 and MA250 packages, for both gold analysis by fire assay (30g fire assay with AAS finish) and ultra-trace multi-element ICP analysis (0.25g, 4 acid digestion and ICP-MS analysis).</span></p><p class=\"\"><span>The reported diamond drilling sampling program was completed using industry standard procedures, including a quality assurance/quality control (\"QA/QC\") program consisting of insertion of standard, blank, and duplicate samples into the sample stream. BV also runs a comprehensive QA/QC program of standards, duplicates, and blanks within each sample stream.</span></p><p class=\"\"><span>Qualified Person</span></p><p class=\"\"><span>Steven Walsh, P.Geo. and Senior Geologist for the Company is a \"qualified person\" as defined under National Instrument 43-101 - Standards of Disclosure of Mineral Projects and has reviewed and approved the content of this news release.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About White Gold Corp.</span></strong></p><p class=\"\"><span>The Company owns a portfolio of 15,364 quartz claims across 21 properties covering 305,102 hectares (3,051 km 2 ) representing approximately 40% of the Yukon's emerging White Gold District. The Company's flagship White Gold project hosts four near-surface gold deposits which collectively contain resource estimate of 1,732,300 ounces of gold in indicated resources (35.2 million tonnes grading 1.53 grams per tonne gold) and 1,265,900 ounces of gold in inferred resources (32.2 million tonnes grading 1.22 g/t Au) (see the Company's news release dated October 6, 2025) (1)(5) . Regional exploration work has also produced several other new discoveries and prospective targets on the Company's claim packages which border sizable gold discoveries including the Coffee project owned by Fuerte Metals with Measured and Indicated Resources of 80.0.2 Mt grading 1.15 g/t Au for 2.96 million ounces of gold, and Inferred Resources of 21.2 Mt grading 1.17 g/t Au for 0.80 million ounces gold (2)(3) , and Western Copper and Gold Corporation's Casino project which has Measured and Indicated Resources of 2,490.7 Mt grading 0.18 g/t Au, 0.14% Cu for 14.8 million ounces of gold and 7.6 billion pounds of copper, and Inferred Resources of 1,412.5 Mt grading 0.14 g/t Au, 0.10% Cu for 6.3 million ounces of gold and 3.1 billion pounds of copper ((4)(3) . For more information visit www.whitegoldcorp.ca.</span></p><p class=\"\"><span>(1) A technical report to support the MRE for the White Gold project, prepared in accordance with NI 43-101, will be filed on SEDAR+ ( https://www.sedarplus.ca /) and the Company's website ( https://www.whitegoldcorp.ca/ ) within 45 days of the issuance of this news release.</span></p><p class=\"\"><span>(2) See Fuerte Metals Corp. technical report titled \"NI 43-101 Technical Report for the 2025 Mineral Resource Estimate Update on the Coffee Gold Project, Yukon, Canada\", Effective Date August 21, 2025, Report Date October 6, 2025, NI43-101 Compliant Technical Report prepared by Alan J. San Martin, P.Eng., Andy Holloway, P. Eng., Charley Murahwi, P.Geo., FAusIMM., available on SEDAR+</span></p><p class=\"\"><span>(3) The QP has been unable to verify the information. The information is not necessarily indicative to the mineralization on the properties that are subject of the disclosure</span></p><p class=\"\"><span>(4) See Western Copper and Gold Corporation technical report titled \"Casino project, Form 43-101F1 Technical Report Feasibility Study, Yukon Canada\", Effective Date June 13, 2022, Issue Date August 8, 2022, NI 43-101 Compliant Technical Report prepared by Daniel Roth, PE, P.Eng., Mike Hester, F Aus IMM, John M. Marek, P.E., Laurie M. Tahija, MMSA-QP, Carl Schulze, P.Geo., Daniel Friedman, P.Eng., Scott Weston, P.Geo., available on SEDAR+.</span></p><p class=\"\"><span>(5) All numbers are rounded. Overall numbers may not be exact due to rounding</span></p><p class=\"\"><span>Cautionary Note Regarding Forward Looking Information</span></p><p class=\"\"><span>This news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that involves discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"proposed\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. In this news release, forward-looking statements relate, among other things, the Company's objectives, goals and exploration activities conducted and proposed to be conducted at the Company's properties; future growth potential of the Company, including whether any proposed exploration programs at any of the Company's properties will be successful; exploration results; and future exploration plans and costs and financing availability.</span></p><p class=\"\"><span>These forward-looking statements are based on reasonable assumptions and estimates of management of the Company at the time such statements were made. Actual future results may differ materially as forward-looking statements involve known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to materially differ from any future results, performance or achievements expressed or implied by such forward-looking statements. Such factors, among other things, include:</span></p><p class=\"\"><span>The expected benefits to the Company relating to the exploration conducted and proposed to be conducted at the White Gold properties; the receipt of all applicable regulatory approvals for the Offering; failure to identify any additional mineral resources or significant mineralization; the preliminary nature of metallurgical test results; uncertainties relating to the availability and costs of financing needed in the future, including to fund any exploration programs on the Company's properties; business integration risks; fluctuations in general macroeconomic conditions; fluctuations in securities markets; fluctuations in spot and forward prices of gold, silver, base metals or certain other commodities; fluctuations in currency markets (such as the Canadian dollar to United States dollar exchange rate); change in national and local government, legislation, taxation, controls, regulations and political or economic developments; risks and hazards associated with the business of mineral exploration, development and mining (including environmental hazards, industrial accidents, unusual or unexpected formations pressures, cave-ins and flooding); inability to obtain adequate insurance to cover risks and hazards; the presence of laws and regulations that may impose restrictions on mining and mineral exploration; employee relations; relationships with and claims by local communities and indigenous populations; availability of increasing costs associated with mining inputs and labour; the speculative nature of mineral exploration and development (including the risks of obtaining necessary licenses, permits and approvals from government authorities); the unlikelihood that properties that are explored are ultimately developed into producing mines; geological factors; actual results of current and future exploration; changes in project parameters as plans continue to be evaluated; soil sampling results being preliminary in nature and are not conclusive evidence of the likelihood of a mineral deposit; title to properties; ongoing uncertainties relating to the COVID-19 pandemic; and those factors described under the heading \"Risks Factors\" in the Company's annual information form dated July 29, 2020 available on SEDAR+. Although the forward-looking statements contained in this news release are based upon what management of the Company believes, or believed at the time, to be reasonable assumptions, the Company cannot assure shareholders that actual results will be consistent with such forward-looking statements, as there may be other factors that cause results not to be as anticipated, estimated or intended. Accordingly, readers should not place undue reliance on forward-looking statements and information. There can be no assurance that forward-looking information, or the material factors or assumptions used to develop such forward-looking information, will prove to be accurate. The Company does not undertake to release publicly any revisions for updating any voluntary forward-looking statements, except as required by applicable securities law.</span></p><p class=\"\"><span>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this news release.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>For Further Information, Please Contact:</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information:</span></strong></p><p class=\"\"><span>David D'Onofrio</span></p><p class=\"\"><span>Chief Executive Officer</span></p><p class=\"\"><span>White Gold Corp.</span></p><p class=\"\"><span>(647) 930-1880</span></p><p class=\"\"><span>ir@whitegoldcorp.ca</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Request Meeting:</span></strong><span> https://calendly.com/meet-with-wgo/15min</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> White Gold Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS3Rq25a:0/",
            "pub_date": "2026-02-26 20:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSrwPpsa:0",
            "title": "Larlyn Property Management Ltd. Recognized with 2026 Consumer Choice Award in London",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>LONDON, ONTARIO / ACCESS Newswire / February 26, 2026 / Larlyn Property Management Ltd. has received the 2026 Consumer Choice Award in the Property Management category, marking a notable recognition for a Canadian firm with more than 50 years of experience in the industry.</span></p><p class=\"\"><span>Larlyn provides full-service property management for condominiums, residential rental properties, and commercial assets. The firm also works closely with developers and investors on new construction projects and property conversions, supporting properties from early development through long-term operation.</span></p><p class=\"\"><span>Operating with a combination of local market expertise and national resources, Larlyn delivers financial, technical, and operational management services designed to meet the evolving needs of property owners and stakeholders. This structure allows the firm to manage diverse portfolios while maintaining consistency, regulatory compliance, and operational oversight.</span></p><p class=\"\"><span>Larlyn's work is supported by recognized industry certifications, including ACMO 2000 and IREM AMO. These designations reflect established standards in governance, financial controls, and professional management practices within the property management sector.</span></p><p class=\"\"><span>Over the years, the firm has developed long-standing relationships with condominium boards, property owners, developers, and institutional partners. Its approach emphasizes planning, accountability, and long-term asset performance in environments where expectations and regulatory requirements continue to evolve.</span></p><p class=\"\"><span>\"This recognition reflects the work our teams do every day to manage properties responsibly and consistently,\" said the team at Larlyn Property Management Ltd. \"With more than 50 years of experience, our focus remains on long-term performance, professional standards, and supporting the clients and communities we serve.\"</span></p><p class=\"\"><span>Recognition through the 2026 Consumer Choice Award reflects Larlyn's continued presence in the London market and its ongoing role in managing residential and commercial properties with a structured, professional approach.</span></p><p class=\"\"><span>As Larlyn continues its work in London and across Canada, the firm remains focused on delivering property management services grounded in experience, operational discipline, and industry standards.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Larlyn Property Management Ltd.</span></strong></p><p class=\"\"><span>Larlyn Property Management Ltd. is a Canadian property management firm with over 50 years of experience. The company provides full-service management for condominiums, residential rentals, and commercial properties, and partners with developers and investors on new construction and conversion projects. Supported by certifications including ACMO 2000 and IREM AMO, Larlyn combines local market expertise with national resources to deliver financial, technical, and operational property management services. To learn more, visit www.larlyn.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Consumer Choice Award</span></strong></p><p class=\"\"><span>Consumer Choice Award has been recognizing and promoting business excellence in North America since 1987. Its rigorous selection process ensures that only the most outstanding service providers in each category earn this prestigious recognition. Visit www.ccaward.com to learn more.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information</span></strong></p><p class=\"\"><span>Sumi Saleh</span></p><p class=\"\"><span>Communications Manager</span></p><p class=\"\"><span>ssaleh@ccaward.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Consumer Choice Award</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSrwPpsa:0/",
            "pub_date": "2026-02-26 20:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSQNhh0a:0",
            "title": "CSR Talent Group: Reignite Your Employee Engagement Strategy With Proven Experts",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NEW YORK, NY / ACCESS Newswire / February 26, 2026 / CSR Talent Group</span></p><p class=\"\"><span>Over the past year, we've seen companies retrench their CSR staffing and programs in response to economic and stakeholder pressures. However, there is a bright spot - the renewed focus on employee engagement. Given these uncertain times, CSR leaders are understanding the importance of building high-impact employee engagement programs.</span></p><p class=\"\"><span>CSR Talent Group has over 30 experts in employee engagement, averaging more than 15 years of experience, working across the Fortune 1000. We are placing these experts in environments where participation rates are lagging and strategy, implementation, and measurement (or all three) need strengthening.</span></p><p class=\"\"><span>Recently, we've helped our clients:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revamp an employee engagement strategy</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Address immediate capacity needs for a global volunteer day</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Fill in on a fractional basis to manage an employee engagement program during maternity leave</span></p></li></ul><p class=\"\"><span>Using their deep field experience across multiple industries, our experts can:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Assist with developing impactful stakeholder strategies</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Provide seamless staffing and program support</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Identify and implement software solutions and systems</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Create leadership-worthy communications plans</span></p></li></ul><p class=\"\"><span>The result is a set of cohesive programs that align employees' day-to-day work with purpose, culture, and long-term impact.</span></p><p class=\"\"><span>If you're struggling with lack of leadership buy-in, misaligned strategies, declining engagement levels, communicating your impact, or a general capacity deficit, we have your solution. Get in touch.</span></p><p class=\"\"><span>Find more stories and multimedia from CSR Talent Group at 3blmedia.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Info:</span></strong></p><p class=\"\"><span>Spokesperson: CSR Talent Group</span></p><p class=\"\"><span>Website: https://www.3blmedia.com/profiles/csr-talent-group</span></p><p class=\"\"><span>Email: info@3blmedia.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> CSR Talent Group</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSQNhh0a:0/",
            "pub_date": "2026-02-26 20:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSTCb97a:0",
            "title": "Stillwater Critical Minerals Reports Wide and High-Grade Near-Surface Ni-Cu-Co-PGE-Au Sulphide Mineralization Extending CZ Deposit at Stillwater West Project in Montana, USA",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>VANCOUVER, BC / ACCESS Newswire / February 26, 2026 / </span><span>Stillwater Critical Minerals Corp. (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\", or \"</span><strong class=\"root-Tkn6WL2y\"><span>Stillwater</span></strong><span>\") reports the first results from its 2025 resource expansion drill campaign at the Company's 100%-owned Stillwater West project in Montana, USA. Stillwater West is one of the few U.S. critical minerals projects with a significant nickel and platinum group element (\"PGE\") resource and is located immediately adjacent to Sibanye-Stillwater's Stillwater mines, the only primary PGE producer in the United States. This release is focused on the CZ deposit area at Iron Mountain where drilling intersected shallow, near-surface sulphide-rich polymetallic nickel-copper-cobalt-platinum-palladium-gold (\"Ni-Cu-Co-PGE-Au\") mineralization that extends beyond the limits of the January 2023 Mineral Resource Estimate (\"MRE\").</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Highlights</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The 2025 drill program was designed to expand the January 2023 MRE along a 10-kilometer (\"Km\") mineralized trend at Stillwater West, where a broad zone of sulphide-rich nickel, copper, cobalt, PGE, gold and chromium mineralization has been defined across multiple deposits.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Two holes were completed at the CZ deposit and both intersected shallow, near-surface sulphide mineralization. As detailed in Table 1, broad, continuous bulk-tonnage intercepts contain internal higher-grade horizons, demonstrating continuity across a thick mineralized package and confirming significant opportunity for resource expansion beyond current MRE boundaries:</span></p></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CZ2025-01:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bulk tonnage zone: </span><strong class=\"root-Tkn6WL2y\"><span>201.6 meters (\"m\") @ 0.20%</span></strong><span> Recovered Nickel Equivalent (\"NiEq\") from 16.9 m (see Table 1 for full metal grades);</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mid-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>53.3 m @ 0.37% NiEq</span></strong><span> from 24.4 m;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Higher-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>29.0 m @ 0.44% NiEq</span></strong><span> from 41.5 m; and</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>High-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>4.0 m @ 0.76% NiEq</span></strong><span> from 43.3 m.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>These intercepts include </span><span>1.52 m grading 0.92% Ni, 0.27% Cu, 0.085% Co, and 0.58 g/t 3E (Pt+Pd+Au) starting at 43.3 m, and </span><strong class=\"root-Tkn6WL2y\"><span>3.7 m grading 1.0 g/t 3E</span></strong><span> starting at 44.8m.</span></p></li></ul></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CZ2025-02:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Bulk tonnage zone: </span><strong class=\"root-Tkn6WL2y\"><span>106.1 m @ 0.34% NiEq</span></strong><span> from 12.2 m (see Table 1);</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mid-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>84.4 m @ 0.38% NiEq</span></strong><span> from 13.4 m;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Higher-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>30.5 m @ 0.51% NiEq</span></strong><span> from 60.0 m;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>High-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>4.9 m @ 0.73 % NiEq</span></strong><span> from 75.9 m as </span><strong class=\"root-Tkn6WL2y\"><span>0.40% Ni, 0.23%Cu, 0.042% Co, and 0.48 g/t 3E</span></strong><span>; and</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>High-grade zone: </span><strong class=\"root-Tkn6WL2y\"><span>4.9 m @ 0.72% NiEq</span></strong><span> from 85.6 m as </span><strong class=\"root-Tkn6WL2y\"><span>0.43% Ni, 0.29% Cu, 0.043% Co, and 0.40 g/t 3E</span></strong><span>.</span></p></li></ul></li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Results extend known mineralization toward the Central and HGR deposits, confirming strike continuity of the shallow-dipping conductive sulphide target and highlighting potential for meaningful resource expansion east and west along the open Peridotite and Basal Zones.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Assays are pending from the remaining six holes, along with rhodium results for the 2025 program.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stillwater is funded and permitted and is finalizing 2026 drill plans focused on resource growth and step-out testing of conductive sulphide targets.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Drill core will be on display at core shack 3116B on March 3rd and 4th, 2026, at PDAC.</span></p></li></ul><p class=\"\"><span>Table 1 - Highlight 2025 drill results from Iron Mountain CZ deposit area.</span></p><p class=\"\"><span>Notes: 1) Highlighted significant intercepts with grade-thickness values over 7 percent-meter recovered NiEq are presented above, except as noted. 2) Recovered Nickel Equivalents (\"NiEq\") are presented for comparative purposes using conservative long-term metal prices (all USD): $8.00/lb nickel (Ni), $4.50/lb copper (Cu), $15.00/lb cobalt (Co), $1,250/oz platinum (Pt), $1,250/oz palladium (Pd), $3,000/oz gold (Au), and $6,500/oz rhodium (Rh). 3) NiEq is determined as follows: NiEq% = [Ni% x recovery] + [Cu% x recovery x Cu price/ Ni price] + [Co% x recovery x Co price / Ni price] + [Pt g/t x recovery / 31.103 x Pt price / Ni price / 2,204 x 100] + [Pd g/t x recovery / 31.103 x Pd price / Ni price / 2,204 x 100] + [Au g/t x recovery / 31.103 x Au price / Ni price / 2,204 x 100]. 4) In the above calculations: 31.103 = grams per troy ounce, 2,204 = lbs per metric tonne, and 100 and 0.01 convert assay results reported in % and g/t. 5) The following recoveries have been assumed for purposes of the above equivalent calculations: 85% for Ni and 90% for all other listed metals, based on recoveries at similar nearby operations. 6) Total metal equivalent values include both base and precious metals. In terms of dollar value, 0.20% nickel equates to a copper value of 0.36%, or a palladium value of 0.88 g/t, using the above metal values. 7) Intervals are reported as drilled widths and are believed to be representative of the actual width of mineralization.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Table 2 - Drill Hole Location and Depths</span></strong></p><p class=\"\"><span>Stillwater's President and CEO, Michael Rowley, said \"These results confirm the extension of shallow sulphide-rich mineralization beyond the current CZ deposit resource and demonstrate the effectiveness of our updated geological model. Importantly, continuity of mineralization towards the Central and HGR deposits to the east reinforces the district-scale scale potential of Stillwater West. With additional assays pending and an updated Mineral Resource Estimate targeted for the first half of 2026, we see a clear path to meaningfully growing one of the few significant U.S.-based nickel-PGE resources.\"</span></p><p class=\"\"><span>Dr. Danie Grobler, Vice-President Exploration, commented \"Our 2025 work defined two near-surface, highly prospective areas at Chrome Mountain and Iron Mountain. All eight holes intersected magmatic sulphide mineralization, confirming that the large geophysical anomalies map sulphide-rich stratigraphy beyond current resource boundaries. At Iron Mountain, the CZ deposit conductive trend appears to connect toward the Central-HGR resource areas, while at Chrome Mountain a large anomaly extends to the southeast-together indicating potential continuity over a 10-kilometer strike length of mineralized magmatic stratigraphy. These results validate our model and materially expand the set of drill-ready targets for resource growth. Furthermore, our current geological interpretation including results from CZ2025-01 indicates probable thrust-fault duplication of the lower Peridotite zone with its mineralized zones in the CZ deposit area, as shown in Figures 8 and 9.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>2025 Drill Program Overview</span></strong></p><p class=\"\"><span>As shown in Figures 3 to 5, the 2025 exploration drilling program consisted of </span><strong class=\"root-Tkn6WL2y\"><span>eight drill holes totaling 3,471 meters</span></strong><span>, focused on expanding mineralisation at existing resources including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Chrome Mountain</span></strong><span> - four holes in the DR/Hybrid deposit area</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Iron Mountain</span></strong><span> - two holes in the CZ deposit area and two holes in the HGR deposit area</span></p></li></ul><p class=\"\"><span>The CZ deposit holes were collared near the eastern margin of the 2023 CZ deposit resource to test the eastern strike extension of a shallow-dipping sulphide-rich conductive target associated with the Peridotite-Basal Zone contact (Figures 6 and 7).</span></p><p class=\"\"><span>Drilling was located approximately </span><strong class=\"root-Tkn6WL2y\"><span>300 meters east</span></strong><span> of historic high-grade mineralization intersected in IM2008-01, and </span><strong class=\"root-Tkn6WL2y\"><span>600 meters east</span></strong><span> of high-grade near-surface mineralization intersected in hole CZ2021-01 which returned </span><span>64.8 m grading 0.76% NiEq from 13.2 m including higher grade zones of 0.98% NiEq over 40.1 m and 1.24% NiEq over 17 m.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 1 -</span></strong><span> Core from the Camp Zone deposit area drill hole CZ2025-01 showing near-surface net-textured to semi-massive mineralization.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Figure 2 -</span></strong><span> Core from the Camp Zone deposit area drill hole CZ2025-01 showing near-surface net-textured to semi-massive mineralization.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Geological Interpretation and Targeting</span></strong></p><p class=\"\"><span>Target selection for the 2025 CZ deposit drilling was guided by integrated interpretation of electromagnetic, chargeability, and magnetic data, together with the updated geological model.</span></p><p class=\"\"><span>Both 2025 CZ deposit drill holes intersected shallow, net-textured to semi-massive sulphide mineralization, confirming the conductive response observed in the 2024 MobileMT (\"MMT\") geophysical survey. Drill hole CZ2025-01 was extended to a final depth of 450 metres and successfully intersected the targeted low-resistivity MMT anomaly, confirming the presence of contact-style, sulphide-rich base metal and palladium-rich PGE mineralization along the Peridotite-Basal Zone floor contact (Figures 8 and 9).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Mineralization Styles and Resource Implications</span></strong></p><p class=\"\"><span>Results from the 2025 CZ deposit drilling continue to support the first comprehensive geological model developed across the lower Stillwater Igneous Complex. The results demonstrate the presence of </span><strong class=\"root-Tkn6WL2y\"><span>three key mineralization styles</span></strong><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broad Platreef-style Ni-PGE-Cu-Co mineralization,</span></strong><span> characterized as thick, shallow-dipping sulphide-rich intervals developed along the lower Stillwater Igneous Complex stratigraphy;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nickel sulphide-rich structurally upgraded N-series mineralization; and</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Stratiform reef-type PGE-Ni-Cu chromitite mineralization.</span></p></li></ul><p class=\"\"><span>The intersections reported demonstrate the potential to significantly expand the 2023 MRE, including:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Bulk-tonnage mineralization</span></strong><span> at &gt;0.20% NiEq;</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Thick mid-grade intervals</span></strong><span> at &gt;0.35% NiEq; and</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Higher-grade zones</span></strong><span> at &gt;0.70% NiEq contained within broader mineralized envelopes.</span></p></li></ul><p class=\"\"><span>All CZ mineralization remains open along strike and at depth, with follow-up drilling planned to test step-outs along the conductive trend toward the Central deposit (Figure 7).</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Additional 2025 Drilling and Next Steps</span></strong></p><p class=\"\"><span>Assays remain pending from drilling at the Chrome Mountain and Iron Mountain HGR deposit areas.</span></p><p class=\"\"><span>The 3,471 meters completed in 2025, together with 2,310 meters drilled in 2023 and select historic holes, are being incorporated into an updated Mineral Resource Estimate targeted for the first half of 2026.</span></p><p class=\"\"><span>Follow-up drilling at CZ and adjacent deposits is planned for 2026, focused on extending shallow sulphide mineralization along strike and at depth. The Company continues to refine targets across the lower Stillwater Igneous Complex in collaboration with Glencore via the technical committee in advance of the 2026 drill program.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Glencore Strategic Investments</span></strong></p><p class=\"\"><span>The 2025 drill program was funded partially by a third </span><span>strategic equity investment by Glencore Canada Corporation, a wholly owned subsidiary of Glencore plc, as announced August 13, 2025. Glencore maintains a 13.1% equity ownership and provides ongoing technical support through participation in the project's technical committee.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CZ Deposit Resource Growth Implications</span></strong></p><p class=\"\"><span>The CZ deposit drill results confirm the Company's updated model for sulphide-rich mineralization within the Peridotite and Basal Zone contact and demonstrate scale - from broad, near-surface bulk-tonnage envelopes to internal higher-grade horizons that could support selective mining and blending scenarios.</span></p><p class=\"\"><span>Step-out drilling shows mineralization extending beyond the 2023 MRE and remaining open along strike and at depth, providing multiple clear vectors for resource expansion. Pending assays from Chrome Mountain and the HGR area at Iron Mountain are expected to add further growth potential ahead of the updated MRE targeted for H1 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Upcoming Events</span></strong></p><p class=\"\"><span>Company representatives will attend PDAC 2026 in Toronto, where drill core from the CZ, HGR and Chrome Mountain programs will be available for viewing at the Core Shack. In addition, the Company will attend the following upcoming events:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Red Cloud Pre-PDAC - Toronto, Canada, February 26-27, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Metals Investor Forum - Toronto, Canada, February 27-28, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PDAC 2026 - Toronto, Canada, March 1-4, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SMI Conference - Zurich, Switzerland, March 18-19, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SAFE Summit 2026 - Washington, D.C., USA, April 27-28, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Top Shelf Partners - Washington, D.C., USA, May 17-19, 2026. For information, click here.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Top Shelf Partners - Ft. Lauderdale, Florida, USA, May 20-22, 2026. For information, click here.</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Stillwater Critical Minerals Corp.</span></strong></p><p class=\"\"><span>Stillwater Critical Minerals (TSX.V:PGE)(OTCQB:PGEZF)(FSE:J0G) is a mineral exploration and development company advancing its 100%-owned Stillwater West Ni-PGE-Cu-Co + Au project in the Stillwater mining district of Montana, USA. Stillwater West is directly adjacent to Sibanye-Stillwater's operating Stillwater mines and processing infrastructure, the only primary PGE-producing complex in the United States. An NI 43-101 mineral resource estimate released in January 2023 positions Stillwater West as one of the few significant U.S.-based nickel + PGE resources and includes ten minerals currently listed as critical in the United States. With strategic investments by Glencore and an experienced technical team with Bushveld and Platreef-style expertise, the Company is well positioned to advance the project toward the next phase of technical studies and resource growth drilling.</span></p><p class=\"\"><span>Stillwater also holds a 49% interest in the high-grade Drayton-Black Lake-gold project adjacent to Nexgold</span></p><p class=\"\"><span>Mining's development-stage Goliath Gold Complex in northwest Ontario, currently under an earn-in agreement with Heritage Mining, and the Kluane PGE-Ni-Cu-Co critical minerals project on trend with Nickel Creek Platinum's Wellgreen deposit in Canada's Yukon Territory. The Company also holds the Duke Island Cu-Ni-PGE property in Alaska and maintains a back-in right on the high-grade past-producing Yankee-Dundee in BC, following its sale in 2013.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FOR FURTHER INFORMATION, PLEASE CONTACT:</span></strong></p><p class=\"\"><span>Michael Rowley, President, CEO &amp; Director - Stillwater Critical Minerals</span></p><p class=\"\"><span>Email: info@criticalminerals.com Phone: (604) 357 4790</span></p><p class=\"\"><span>Web: http://criticalminerals.com Toll Free: (888) 432 0075</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This news release includes certain statements that may be deemed \"forward-looking statements\" or \"forward-looking information\". In particular, this press release contains forward-looking information relating to, among other things, the interpretation of exploration results, the potential for resource expansion, the timing and results of future resource estimates (including the targeted H1 2026 updated MRE), the timing and success of exploration activities, permitting timelines, and future plans and objectives of the Company. All statements in this release, other than statements of historical facts, are forward-looking statements that involve various risks and uncertainties. Although Stillwater Critical Minerals believes the expectations expressed in such forward-looking statements are based on reasonable assumptions, such statements are not guarantees of future performance and actual results or developments may differ materially from those in the forward-looking statements. For more information on Stillwater Critical Minerals and the risks and challenges of their businesses, investors should review their annual filings that are available at www.sedarplus.ca.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><span>A consolidated PDF containing the figures referenced below is available at the following link.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Stillwater Critical Minerals Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSTCb97a:0/",
            "pub_date": "2026-02-26 20:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS21pLZa:0",
            "title": "Southwest Pet Earns 2026 Consumer Choice Award Recognition as a Trusted Destination for Pet Care in London",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>LONDON, ONTARIO / ACCESS Newswire / February 26, 2026 / For pet owners, confidence matters. Knowing where to turn for the right products, reliable guidance and genuine care can make all the difference. Southwest Pet has been recognized with the 2026 Consumer Choice Award in the Pet &amp; Aquarium Centre category, highlighting its role as a trusted, customer focused retailer serving pet owners across the London community.</span></p><p class=\"\"><span>Southwest Pet specializes in high quality products for dogs and cats, offering a carefully selected range that supports everyday care, nutrition and enrichment. Beyond traditional pet retail, the store is also known for its expertise in reptiles and exotic animals, providing knowledgeable guidance that helps customers navigate the unique needs of less common pets.</span></p><p class=\"\"><span>What sets Southwest Pet apart is its commitment to education and service. The team takes time to understand each customer's situation, whether they are welcoming a new pet, managing specific care requirements or exploring exotic species for the first time. This personalized approach creates a shopping experience that feels supportive rather than transactional, empowering customers to make informed decisions.</span></p><p class=\"\"><span>The store's welcoming environment and friendly service encourage conversation, questions and learning. Customers value the ability to access trusted advice alongside quality products, knowing they are supported by a team that prioritizes animal well-being and responsible pet ownership.</span></p><p class=\"\"><span>Receiving the 2026 Consumer Choice Award reflects the strong relationships Southwest Pet has built with its customers. \"We are proud to be recognized by the London community,\" said the team at Southwest Pet. \"Our goal has always been to help people care for their pets with confidence by offering reliable products, honest guidance and a positive in store experience.\"</span></p><p class=\"\"><span>Consumer Choice Award highlights businesses that earn consistent support within their communities by delivering value and service. For Southwest Pet, this recognition underscores its dedication to creating an engaging retail experience rooted in knowledge, care and trust.</span></p><p class=\"\"><span>As Southwest Pet looks ahead, the team remains committed to supporting pet owners at every stage of their journey. By combining quality products with expert advice and friendly service, the store continues to be a go to destination for pet care in London.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Southwest Pet</span></strong></p><p class=\"\"><span>Southwest Pet is a customer focused pet retailer based in London, Ontario. Specializing in dog and cat products while offering expert guidance on reptiles and exotic animals, the store provides high quality products, trusted advice and friendly service. Southwest Pet is dedicated to helping customers confidently care for their pets through knowledge, support and an engaging in store experience. To learn more, visit www.southwestpet.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Consumer Choice Award</span></strong></p><p class=\"\"><span>Consumer Choice Award has been recognizing and promoting business excellence in North America since 1987. Its rigorous selection process ensures that only the most outstanding service providers in each category earn this prestigious recognition. Visit www.ccaward.com to learn more.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information</span></strong></p><p class=\"\"><span>Sumi Saleh</span></p><p class=\"\"><span>Communications Manager</span></p><p class=\"\"><span>ssaleh@ccaward.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Consumer Choice Award</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS21pLZa:0/",
            "pub_date": "2026-02-26 20:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSZ5696Ua:0",
            "title": "REG - Polar Cap Glb Health PCGH ZDP PLC - Net Asset Value(s)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><span>RNS Number : 5696U  Polar Capital Global Health Tst PLC  26 February 2026   </span><p class=\"\"><span>POLAR CAPITAL GLOBAL HEALTHCARE TRUST PLC (\"the Company\")</span></p><p class=\"\"><span>Legal Entity Identifier: 549300YV7J2TWLE7PV84</span></p><p class=\"\"><span>26 February 2026</span></p><p class=\"\"><span>Net Asset Value</span></p><p class=\"\"><span>As at close of business on 25th February 2026 the Company's unaudited Net Asset Value, calculated in accordance with the guidelines of the Association of Investment Companies, was 409.02p (cum income).</span></p><p class=\"\"><span>-     ENDS -</span></p><p class=\"\"><span>For further information, please call:</span></p><p class=\"\"><span>Sabrina Yim</span></p><p class=\"\"><span>Investment Trust Operations Department</span></p><p class=\"\"><span>Polar Capital Partners Limited</span></p><p class=\"\"><span>Tel: +44 20 3758 6519</span></p><p class=\"\"><span>http://www.polarcapitalglobalhealthcaretrust.co.uk</span></p><span>This information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.</span><p class=\"\"><span>RNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.   END  NAVPPUBAPUPQGGQ</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSZ5696Ua:0-reg-polar-cap-glb-health-pcgh-zdp-plc-net-asset-value-s/",
            "pub_date": "2026-02-26 20:00:02",
            "source": "London Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_AQN2LNUFR:0",
            "title": "Mexico Jan seasonally adjusted jobless rate 2.6 pct",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>MEXICO CITY, Feb 26 (Reuters) - Mexico's seasonally adjusted unemployment rate was 2.6 percent in January, the national statistics agency said on Thursday.</span></p><p class=\"\"><span>The headline unadjusted rate was 2.7 percent in January.</span></p><p class=\"\"><span>((Mexico City newsroom, +52 55 5282-7153, mexicocity.newsroom@reuters.com))</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_AQN2LNUFR:0-mexico-jan-seasonally-adjusted-jobless-rate-2-6-pct/",
            "pub_date": "2026-02-26 20:00:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSlP8cza:0",
            "title": "Karviva and Founder Dr. Angela Zeng Recognized by Missouri Agriculture as Brand Gains National Editorial Attention and Expands Retail Footprint",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>SAINT LOUIS, MI / ACCESS Newswire / February 26, 2026 / Karviva, the functional beverage company founded by nutritional scientist Dr. Angela Zeng, continues to gain momentum across retail and industry platforms, following recognition from the Missouri Department of Agriculture and its recent selection as one of RangeMe's Top 50 Brands in Food and Beverage. The milestones reflect growing demand for Karviva's science-backed wellness drinks and increasing interest from major retailers nationwide.</span></p><p class=\"\"><span>Karviva was recognized by the Missouri Department of Agriculture for its contribution to the state's food and beverage innovation ecosystem. As a member of the Grown in Missouri program, the brand develops and manufactures its products in St. Louis, supporting local production while transforming whole-food ingredients into functional beverages designed for everyday wellness. The recognition highlights Karviva's alignment with value-added agriculture, responsible sourcing, and sustainable growth.</span></p><p class=\"\"><span>In addition to the state-level acknowledgment, Karviva has been named one of RangeMe's Top 50 Brands in Food and Beverage and featured in the research section of MMR Magazine. RangeMe's Top 50 list tracks buyer engagement across more than 250,000 brands on its platform and highlights companies generating strong interest from retail buyers through profile activity, meeting requests, and product engagement. The designation serves as an indicator of retail readiness and future shelf potential.</span></p><p class=\"\"><span>These recognitions come amid continued retail expansion for Karviva. The brand recently launched Karviva Energy Juices and ACE Collagen Juices at Gelson's Market locations across Southern California, expanding its presence on the West Coast among premium grocery shoppers. On the East Coast, Stop and Shop has added Karviva Energy Juices to its assortment. The products are currently in the launch phase, following a delayed reset timeline related to distributor scheduling, with broader in-store placement expected as the rollout continues.</span></p><p class=\"\"><span>Karviva has also gained national editorial attention for its approach to wellness and detox, including coverage that highlights the brand's emphasis on consistency, nourishment, and digestive support rather than extreme or short-term cleansing practices. Dr. Zeng's perspective draws from both evidence-based nutrition science and traditional wellness philosophies, shaping formulations that are designed to fit into daily routines.</span></p><p class=\"\"><span>Dr. Zeng shared that the combination of state recognition, industry validation, and retail growth reflects the brand's steady progress. She noted that interest from retailers and buyers continues to build as consumers become more informed about functional beverages and look for options that deliver real benefits without artificial ingredients.</span></p><p class=\"\"><span>With recognition from Missouri Agriculture, inclusion on the RangeMe Top 50 list, and expanding retail partnerships across both coasts, Karviva enters 2026 positioned for continued growth and broader national visibility.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Karviva</span></strong></p><p class=\"\"><span>Founded by Dr. Angela Zeng, PhD, MBA, Karviva is a functional beverage brand rooted in Traditional Chinese Medicine principles and evidence-based nutrition science. The company develops clean-label juices and wellness drinks that support digestion, hydration, energy, and balance without extremes. Karviva is based in St. Louis, Missouri, and is a proud member of the Grown in Missouri program.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact</span></strong></p><p class=\"\"><span>Organization: Karviva</span></p><p class=\"\"><span>Contact Person Name: Dr. Angela Zeng</span></p><p class=\"\"><span>Website: https://karviva.com/</span></p><p class=\"\"><span>Email: angela@karviva.com</span></p><p class=\"\"><span>City: Saint Louis</span></p><p class=\"\"><span>State: Missouri</span></p><p class=\"\"><span>Country: United States</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Karviva</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSlP8cza:0/",
            "pub_date": "2026-02-26 20:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS9j8Zfa:0",
            "title": "Simply The Best Digital Ranked #1 Marketing Agency in Boca Raton for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>BOCA RATON, FLORIDA / ACCESS Newswire / February 26, 2026 / Simply The Best Digital has officially been ranked the </span><strong class=\"root-Tkn6WL2y\"><span>#1 Marketing Agency in Boca Raton (33487)</span></strong><span> for 2026, earning top honors based on benchmark score, performance metrics, and verified Google review data.</span></p><p class=\"\"><span>The prestigious recognition places Simply The Best Digital ahead of every competing marketing agency in the region, solidifying its position as the premier digital growth partner for business owners across South Florida and beyond.</span></p><p class=\"\"><span>With a benchmark score of </span><strong class=\"root-Tkn6WL2y\"><span>239</span></strong><span>, the agency outperformed other top contenders in key performance categories, including Endurance, Momentum, and Review Quality - metrics that reflect long-term client success, growth acceleration, and reputation strength.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Leadership That Drives Results</span></strong></p><p class=\"\"><span>At the helm of Simply The Best Digital are </span><strong class=\"root-Tkn6WL2y\"><span>Adam Goodkin and Chris Jacques</span></strong><span>, two visionary leaders who have built the agency around one core principle:</span></p><p class=\"\"><span>Marketing should produce measurable revenue growth - not just reports.</span></p><p class=\"\"><span>Under their leadership, Simply The Best Digital has evolved from a boutique agency into a dominant marketing force known for:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SEO strategies that generate top Google rankings</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>High-converting Google Ads &amp; Local Service Ads campaigns</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Performance-driven social media marketing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Reputation management that builds authority and trust</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Strategic growth consulting for scaling businesses</span></p></li></ul><p class=\"\"><span>Chris Jacques, known for his operational precision and strategic oversight, has played a critical role in building scalable systems that deliver consistent client success. Adam Goodkin's forward-thinking marketing strategies and client-first philosophy have helped businesses transform stagnant growth into measurable expansion.</span></p><p class=\"\"><span>Together, their combined leadership has created a results-driven culture focused on one objective: </span><strong class=\"root-Tkn6WL2y\"><span>winning for their clients.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>More Than an Award - A Proven Track Record</span></strong></p><p class=\"\"><span>The 2026 Best Marketing Agency recognition is not simply a badge - it reflects:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Hundreds of successful campaigns</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Proven ranking improvements across competitive markets</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Strong Google review performance</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Long-term client retention</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sustainable marketing growth systems</span></p></li></ul><p class=\"\"><span>Simply The Best Digital's client roster spans industries including healthcare, legal, home services, luxury brands, med spas, marine, real estate, and more.</span></p><p class=\"\"><span>Business owners consistently choose the agency because they want more than impressions and clicks - they want predictable revenue growth.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Business Owners Are Making the Switch</span></strong></p><p class=\"\"><span>In today's digital landscape, many agencies focus on vanity metrics. Simply The Best Digital focuses on:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ROI</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Lead generation</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Conversion strategy</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Sales alignment</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Long-term market dominance</span></p></li></ul><p class=\"\"><span>This award reinforces what clients already know: Simply The Best Digital delivers.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A Message to Boca Raton Business Owners</span></strong></p><p class=\"\"><span>\"This recognition belongs to our clients as much as it belongs to us,\" said leadership at Simply The Best Digital. \"Our mission has always been to build marketing systems that create real growth. Being ranked #1 in Boca Raton validates the results our clients experience every day.\"</span></p><p class=\"\"><span>For business owners looking to increase leads, improve rankings, dominate local search, and scale revenue in 2026, the message is clear:</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Partner with the agency ranked #1.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Simply The Best Digital</span></strong></p><p class=\"\"><span>Simply The Best Digital is a full-service digital marketing agency headquartered in Boca Raton, Florida. The agency specializes in SEO, Google Ads, Local Service Ads, Social Media Marketing, Website Development, and Strategic Growth Consulting. Known for its performance-first philosophy, the agency works with growth-minded businesses seeking measurable results.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information</span></strong></p><p class=\"\"><span>Chris Jacques</span></p><p class=\"\"><span>Vice President | Chief Marketing Officer</span></p><p class=\"\"><span>chris@simplythebestdigital.com</span></p><p class=\"\"><span>(561) 577-6885</span></p><p class=\"\"><span>Adam Goodkin</span></p><p class=\"\"><span>Chief Executive Officer</span></p><p class=\"\"><span>adam@goodpresspublishing.com</span></p><p class=\"\"><span>(561) 789-1001</span></p><p class=\"\"><span>https://simplythebestdigital.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Simply The Best Digital</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS9j8Zfa:0/",
            "pub_date": "2026-02-26 20:00:03",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS56PgFa:0",
            "title": "Richmond Commences Drilling Program at Aguara East",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TORONTO, ON / ACCESS Newswire / February 26, 2026 / Richmond Minerals Inc. </span><strong class=\"root-Tkn6WL2y\"><span>(TSX-V:RMD) (\"Richmond\" or the \"Company\")</span></strong><span> is pleased to provide an update for exploration work at the Company's Ridley Lake Gold Project (the \"Property\") located in the west central area of the Swayze Greenstone belt.</span></p><p class=\"\"><span>This milestone represents a strategic pivot toward modernizing the exploration of the Swayze Greenstone Belt, a region that has emerged as a premier gold zone following Iamgold's acquisition of the Cote Lake deposit for $585 million in 2012 and Newmonts' significant Borden Lake mine, situated approximately 23 miles to the west and on strike with our holdings.</span></p><p class=\"\"><span>This program effectively concludes a protracted period of project dormancy. The project's progress is underpinned by its situation within the Swayze-Deloro metavolcanic-metasedimentary complex, where specific structural and lithological features provide the ideal architecture for hydrothermal gold deposition.</span></p><p class=\"\"><span>Historical exploration has identified two primary prospects on the property: the \"Aguara\" and the \"Cyril Knight\" zones. The current drilling campaign at Aguara East represents the most technically advanced exploration effort in the history of the Ridley Lake Property. By synthesizing historical high-grade geochemistry with modern structural modelling and deep-penetration IP, Richmond Minerals Inc. is systematically targeting the roots and potential extensions of the Aguara zone.</span></p><p class=\"\"><span>6 drill holes with individual length up to 500m are planned to test the Auguara East Zone.</span></p><p class=\"\"><span>Parallel to the actual drilling 4 new drill holes are within the process of permitting to test the Aguara West Zone in detail following up the Phase 4 drilling.</span></p><p class=\"\"><span>On April 14, 2021, the company announced that Phase IV diamond drilling consisted of drilling six holes totaling 2,227 m that tested for Aguara Zone western extensions of gold mineralization. Promising assay results were announced on May 6, 2021. The assay results show values of 19,62 g/t Au, 21,52 g/t Au and 13,52 g/t Au at the bottom of hole RS20-33. In hole RS 21-37 the interval from 43 to 44m shows a value of 3,58 g/t Au.</span></p><p class=\"\"><span>The actual program and its extension are testing the prospective zone between Aguara West and East at a striking lenght of 1500 m.</span></p><p class=\"\"><span>The company was also notified on Feb 17, 2026 that it has been selected to receive grant funding of up to $200,000 under the Ontario Junior Exploration Program (\"OJEP\") from the Ontario Government. This amount will cover up to 50% of eligible exploration costs, to a maximum of $200,000 in respect of expenditures incurred by the Company during the period from April 1, 2025 to February 28, 2026, on the Ridley Lake Project.</span></p><p class=\"\"><span>Dr. Thomas Unterweissacher EurGeol, a \"Qualified Person\", within the meaning of National Instrument 43-101 - Standards of Disclosure for Minerals Projects, has reviewed and approved the scientific and technical information contained in this news release. Dr. Unterweissacher is not considered to be \"independent\" of the Corporation (as defined in National Instrument 43-101), as he is member of the board of directors and currently holds securities of the Corporation.</span></p><p class=\"\"><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</span></p><p class=\"\"><span>On Behalf of Richmond Minerals,</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>David Ellis</span></strong></em></p><p class=\"\"><span>President, Richmond Minerals Inc.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CONTACT:</span></strong></p><p class=\"\"><span>Franz Kozich, CEO, +43 664 201 45 10;</span></p><p class=\"\"><span>David Ellis, President, + 1 416 7040937</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Richmond Minerals Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS56PgFa:0/",
            "pub_date": "2026-02-26 20:00:03",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSBR7Q9a:0",
            "title": "Electrovaya To Host Investor Webcast on March 5, 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, ON / ACCESS Newswire / February 26, 2026 / Electrovaya Inc. </span><span>, a leading lithium-ion battery technology and manufacturing company, today announced that it will host an investor webcast presentation on March 5, 2026 at 2:00 PM EST.</span></p><p class=\"\"><span>During the webcast, Dr. Raj DasGupta, CEO and John Gibson, CFO, will conduct an introductory presentation that will cover key aspects of Electrovaya's business including corporate strategy, business model, and industry-leading technology. After the formal presentation, investors will have an opportunity to ask relevant questions through an interactive Q&amp;A portal.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Webcast Link</span></strong></em><span> : </span><span>https://us02web.zoom.us/webinar/register/WN_yxD4upe-RnmMDhzm0-f4AQ</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor and Media Contact</span></strong><span> :     </span></p><p class=\"\"><span>Jason Roy</span></p><p class=\"\"><span>VP, Corporate Development and Investor Relations</span></p><p class=\"\"><span>Electrovaya Inc.</span></p><p class=\"\"><span>jroy@electrovaya.com / 905-855-4618</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Electrovaya Inc.</span></strong></p><p class=\"\"><br/><span>Electrovaya Inc. </span><span> is a technology-driven lithium-ion battery company commercializing its proprietary Infinity Battery Technology, designed for superior safety, longevity, and performance in mission-critical industrial, robotics, defense and energy-storage applications. The Company leverages a strong intellectual-property portfolio and advanced materials expertise to deliver durable, high-value battery solutions to global OEMs and end users. To support growing demand and advancing energy-security and national-security objectives, Electrovaya is expanding U.S. manufacturing through its 52-acre Jamestown, New York site, which includes a 137,000-square-foot facility planned as its first gigafactory. Electrovaya also operates two Canadian sites focused on research, engineering, and product commercialization. For more information, please visit www.electrovaya.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Electrovaya, Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSBR7Q9a:0/",
            "pub_date": "2026-02-26 20:00:04",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2935855:0",
            "title": "NOMD: Revenue, profit, and margins declined; transformation and share buybacks continued",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue and net income declined year-over-year due to lower sales, margin compression, and higher exceptional costs, while the company continued significant share repurchases and refinancing activities. Material weaknesses in internal controls persist, and the outlook remains cautious amid competitive and macroeconomic pressures.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2935855-83ef63ff6ab3612114aa4c5b1a0dc0d8\" target=\"_blank\">Nomad Foods Limited [NOMD] SEC 20-F Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2935855:0-nomd-revenue-profit-and-margins-declined-transformation-and-share-buybacks-continued/",
            "pub_date": "2026-02-26 19:52:52",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM14X:0",
            "title": "Floating wind market 'much smaller' than expected, Technip chief says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Vera Dvorakova and ELENA SMIRNOVA</span></p><p class=\"\"><span>    Demand for floating wind turbines is much lower than imagined only three to five years ago, Technip Energies </span><span> CEO Arnaud Pieton said on Thursday, reflecting broader concerns across the wind power industry.</span></p><p class=\"\"><span>Ekwil, Technip's joint venture with SBM Offshore </span><span> that focuses on floating wind power solutions, will be present where projects are made. However, there are very few projects currently, Pieton told reporters in a post-earnings call.</span></p><p class=\"\"><span>\"We were starting to see signs of a slowdown in floating wind power last year,\" Pieton said, noting the technology is expensive and there is a limited number of environments in which it can operate.</span></p><p class=\"\"><span>The offshore wind power industry has been facing global headwinds. In Europe, several countries failed to attract bidders for their offshore wind farm development last year.</span></p><p class=\"\"><span>In the U.S., President Donald Trump issued stop-orders on offshore wind projects in December, including those developed by Orsted </span><span>. However, a U.S. court allowed the Danish group to resume work on the projects in February.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM14X:0-floating-wind-market-much-smaller-than-expected-technip-chief-says/",
            "pub_date": "2026-02-26 19:53:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_Obi5qkxCa:0",
            "title": "Goodtech ASA: New Share Capital Registered",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Reference is made to the stock exchange announcement of 13 February 2026 inwhich Goodtech ASA announced that the company had resolved a share capitalincrease through the issuance of 679,139 new shares in connection with thecompany's employee share saving program.</span></p><p class=\"\"><span>The share capital increase has now been registered with the Norwegian Registerof Business Enterprises in accordance with the resolution adopted by thegeneralmeeting on 24 April 2025. The company's share capital is now NOK 60,616,020divided into 30,308,010 shares, each with a nominal value of NOK 2.</span></p><p class=\"\"><span>For further information, please contact</span></p><p class=\"\"><span>Margrethe Hauge, CEOTel +47 95 79 69 20e-mail: margrethe.hauge@goodtech.no</span></p><p class=\"\"><span>Anders Engelsen, CFOTel.: +47 93 20 79 01e-mail: anders.engelsen@goodtech.no</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/666934</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_Obi5qkxCa:0-goodtech-asa-new-share-capital-registered/",
            "pub_date": "2026-02-26 19:53:33",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0KC:0",
            "title": "TopBuild Q4 EPS misses as acquisitions dent margins",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Insulation installer reported Q4 sales of $1.49 bln, meeting analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Adjusted EPS for Q4 missed analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company completed SPI acquisition, boosting Q4 sales growth</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TopBuild expects 2026 sales between $5.925 bln and $6.225 bln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company anticipates 2026 adjusted EBITDA of $1.005 bln to $1.155 bln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TopBuild sees mid-single digit decline in residential sales for 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ACQUISITIONS DRIVE GROWTH - TopBuild's Q4 sales growth of 13.2% was largely driven by acquisitions, including SPI and Progressive Roofing, which offset weakness in residential and light commercial construction</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MARGINS IMPACTED - Specialty Distribution margins declined due to the SPI acquisition, but the company plans to drive operating improvements and synergies over the next two years</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>COMMERCIAL ROOFING GROWTH - TopBuild sees significant growth potential in commercial roofing, with the SPI acquisition strengthening its leadership in mechanical insulation</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Sales</span></p></td><td><p class=\"\"><span>Meet</span></p></td><td><p class=\"\"><span>$1.49 bln</span></p></td><td><p class=\"\"><span>$1.49 bln (15 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EPS</span></p></td><td><p class=\"\"><span>Miss</span></p></td><td><p class=\"\"><span>$4.50</span></p></td><td><p class=\"\"><span>$4.54 (15 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>21.00%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Margin</span></p></td><td></td><td><p class=\"\"><span>17.20%</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 12 \"strong buy\" or \"buy\", 4 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the construction &amp; engineering peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for TopBuild Corp is $510.00, about 5.1% below its February 25 closing price of $485.32</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 23 times the next 12-month earnings vs. a P/E of 20 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0KC:0-topbuild-q4-eps-misses-as-acquisitions-dent-margins/",
            "pub_date": "2026-02-26 19:53:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM1DD:0",
            "title": "Denmark to hold parliamentary election as Frederiksen bets on Greenland crisis boost",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Denmark will hold a parliamentary election on March 24, Prime Minister Mette Frederiksen announced on Thursday, seeking to capitalise on a surge in support for her defiant stance against U.S. pressure over Greenland.</span></p><p class=\"\"><span>Frederiksen has spent recent months rallying European leaders against President Donald Trump's renewed interest in annexing the Arctic island, an effort that opinion polls suggest has bolstered her popularity after public dissatisfaction over rising living costs and pressures on welfare services.</span></p><p class=\"\"><span>The Greenland crisis has further raised Frederiksen's profile on the international stage, where she gained attention for her swift response in navigating Denmark through the COVID-19 pandemic and for building European support for </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/ukraine-russia-war/\" rel=\"nofollow\" target=\"_blank\">Ukraine</a><span>.</span></p><p class=\"\"><span>The election will test whether voters reward her international leadership and defence of Danish sovereignty or punish her government for what critics say has been an inattention to problems at home.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM1DD:0-denmark-to-hold-parliamentary-election-as-frederiksen-bets-on-greenland-crisis-boost/",
            "pub_date": "2026-02-26 19:53:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2935868:0",
            "title": "NOMD: 2025 saw revenue and margin declines but strong cash flow, with 2026 guidance projecting further declines",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Full year 2025 results aligned with guidance, with revenue and margins declining but cash flow strong, enabling significant share repurchases. 2026 guidance anticipates further declines in revenue and earnings, while maintaining high cash flow conversion.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2935868-46e1fbf62b90dfa3737c29a7742a4937\" target=\"_blank\">Nomad Foods Limited [NOMD] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2935868:0-nomd-2025-saw-revenue-and-margin-declines-but-strong-cash-flow-with-2026-guidance-projecting-further-declines/",
            "pub_date": "2026-02-26 19:53:55",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA4NLQX9:0",
            "title": "Warby Parker Projects $959-$976 Mln Revenue For 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Warby Parker Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER ANNOUNCES FOURTH QUARTER AND FULL YEAR 2025 RESULTS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 REVENUE USD 211.968 MILLION VS. IBES ESTIMATE USD 213.1 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 GROSS PROFIT USD 111.043 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 NET INCOME USD -5.953 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 GROSS MARGIN 52.4%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 ADJUSTED EBITDA USD 15.2 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER Q4 ADJUSTED EBITDA MARGIN 7.2%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER INC - PROJECTS $959-$976 MLN REVENUE FOR 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER INC - EXPECTS $117-$119 MLN ADJ EBITDA FOR 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER INC: IN FEB 2026, BOARD AUTHORIZED SHARE REPURCHASE PROGRAM TO PURCHASE UP TO $100 MLN OF CO'S CLASS A COMMON STOCK</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER INC: IN 2026 CO EXPECTS 50 NEW STORE OPENINGS</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WARBY PARKER INC </span><span> FY2026 REV VIEW $987.0 MLN — LSEG IBES DATA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA4NLQX9:0-warby-parker-projects-959-976-mln-revenue-for-2026/",
            "pub_date": "2026-02-26 19:53:57",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0KG:0",
            "title": "Krispy Kreme Q4 revenue beats on productivity initiatives",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Doughnut maker's Q4 revenue beat analyst expectations despite a 2.9% decline yr/yr</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Adjusted EPS for Q4 beat analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company's adjusted EBITDA rose 21% yr/yr, driven by productivity initiatives</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Krispy Kreme expects systemwide sales to grow 2% to 4% in constant currency in 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company plans to open at least 100 shops globally in 2026</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Krispy Kreme aims for net leverage ratio at or below 5.5x in 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>STRATEGIC CLOSURES - Organic revenue decreased due to closure of underperforming doors</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PRODUCTIVITY INITIATIVES - Adjusted EBITDA margin increased due to productivity initiatives and SG&amp;A savings</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>REFRANCHISING AGREEMENT - Strategic refranchising agreement in Japan contributed to financial flexibility</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$392.40 mln</span></p></td><td><p class=\"\"><span>$386.72 mln (4 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EPS</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$0.09</span></p></td><td><p class=\"\"><span>$0.03 (4 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>-$0.17</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted Net Income</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$15 mln</span></p></td><td><p class=\"\"><span>$5.27 mln (3 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-$29.10 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA</span></p></td><td><p class=\"\"><span>Beat</span></p></td><td><p class=\"\"><span>$55.60 mln</span></p></td><td><p class=\"\"><span>$46.02 mln (4 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>14.20%</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 1 \"strong buy\" or \"buy\", 5 \"hold\" and 2 \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the restaurants &amp; bars peer group is \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Krispy Kreme Inc is $4.48, about 49.7% above its February 25 closing price of $2.99</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0KG:0-krispy-kreme-q4-revenue-beats-on-productivity-initiatives/",
            "pub_date": "2026-02-26 19:54:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0K5:0",
            "title": "Gold ticks up on safe‑haven bids; markets eye US-Iran talks",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US, Iran to hold talks in Geneva later in the day</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US tariff rate for some countries will rise to 15%, says Greer</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US weekly jobless claims data due later in the day</span></li></ul></span></div><span><p class=\"\"><span>By Noel John</span></p><p class=\"\"><span>    Gold prices edged up on Thursday as uncertainty over U.S. tariff policy boosted the metal's safe-haven appeal, while investors awaited further details on U.S.-Iran talks later in the day.    </span></p><p class=\"\"><span>Spot gold </span><span> was up 0.1% at $5,174.07 per ounce, as of 1144 GMT. Bullion had hit a more-than-three-week high on Tuesday. </span></p><p class=\"\"><span>U.S. gold futures </span><span> for April delivery were down 0.7% at $5,190.30.</span></p><p class=\"\"><span>The U.S. dollar eased, making dollar-denominated commodities more affordable for holders of other currencies. </span></p><p class=\"\"><span>\"Iran-U.S. persisting tensions and the uncertainty surrounding the global economy with (President Donald) Trump's tariffs are a bullish catalyst,\" said Carlo Alberto De Casa, external analyst at banking group Swissquote.</span></p><p class=\"\"><span>U.S. envoy Steve Witkoff and Trump's son-in-law Jared Kushner are due to meet an Iranian delegation for a third round of nuclear talks later in the day in Geneva. </span></p><p class=\"\"><span>Trump briefly laid out his case for a possible attack on Iran in his State of the Union speech on Tuesday, saying he would not allow a country he described as the world's biggest sponsor of terrorism to have a nuclear weapon.</span></p><p class=\"\"><span>Non-yielding gold is seen as a safe store of value during times of geopolitical and economic uncertainty.</span></p><p class=\"\"><span>The U.S. tariff rate for some countries will rise to 15% or higher from the newly imposed 10%, U.S. Trade Representative Jamieson Greer said on Wednesday, without naming any specific trading partners or giving further details. </span></p><p class=\"\"><span>Gold prices scaled a record high of $5,594.82 on January 29 and were up 20% so far this year.</span></p><p class=\"\"><span>\"The global gold rush does not seem to be over... Overall the sentiment remains positive with strong buys coming from Asia and from central banks,\" De Casa said.     </span></p><p class=\"\"><span>On the data front, investors await the weekly U.S. jobless claims data, due later in the day.</span></p><p class=\"\"><span>Spot silver </span><span> fell 2.1% to $87.52 per ounce. Spot platinum </span><span> slid 0.5% to $2,275.65 per ounce, while palladium </span><span> also shed 0.5% to $1,785.79.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0K5:0-gold-ticks-up-on-safe-haven-bids-markets-eye-us-iran-talks/",
            "pub_date": "2026-02-26 19:54:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2935862:0",
            "title": "NAT: Q4 2025 saw record net income and EBITDA, with strong bookings and a positive tanker market outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 delivered the year's strongest results, with net income of $11.7M and adjusted EBITDA of $34.7M, driven by higher TCE rates and strong market demand. The fleet stands at 20 Suezmax tankers, with robust bookings and a positive outlook amid tightening supply.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2935862-5869b8ea957961d9f30bb0203932afe8\" target=\"_blank\">Nordic American Tankers Limited [NAT] SEC 6-K Current Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2935862:0-nat-q4-2025-saw-record-net-income-and-ebitda-with-strong-bookings-and-a-positive-tanker-market-outlook/",
            "pub_date": "2026-02-26 19:54:58",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2935867:0",
            "title": "Atresmedia Corporación de Medios de Comunicación: TV and digital leadership sustained, but profits and revenue declined amid higher costs",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Maintained leadership in TV and digital audiences, with net revenue down 1.5% and pro-forma EBITDA down 25% year-over-year. Outlook for 2026 is stable, with no organic revenue growth expected and continued focus on profitability and diversification.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2935867-67c169e24ee8094a0fea7836ca80b786\" target=\"_blank\">Atresmedia Corporacion de Medios de Comunicacion SA [A3M] Interim report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2935867:0-atresmedia-corporaci-n-de-medios-de-comunicaci-n-tv-and-digital-leadership-sustained-but-profits-and-revenue-declined-amid-higher-costs/",
            "pub_date": "2026-02-26 19:55:11",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0KB:0",
            "title": "Warby Parker Q4 revenue up 11.2%, slightly misses estimates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Vision lifestyle brand's Q4 revenue grew 11.2% but slightly missed analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company achieved first full year of positive net income of $1.6 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company authorized $100 mln share repurchase program</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Warby Parker expects 2026 revenue of $959 mln to $976 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company anticipates 2026 Adjusted EBITDA of $117 mln to $119 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Warby Parker plans to open 50 new stores in 2026</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GROSS MARGIN PRESSURE - Gross margin decreased due to tariff costs, increased doctor headcount, and higher shipping costs, partially offset by price increases and progressive lens sales</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SG&amp;A EFFICIENCIES - SG&amp;A expenses decreased as a percentage of revenue due to corporate expense leverage and operational efficiencies</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>STORE EXPANSION - Opened 47 net new stores during the year, contributing to revenue growth</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Slight Miss*</span></p></td><td><p class=\"\"><span>$211.97 mln</span></p></td><td><p class=\"\"><span>$213.06 mln (13 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>-$0.05</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>-$5.95 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA</span></p></td><td></td><td><p class=\"\"><span>$15.20 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Gross Margin</span></p></td><td></td><td><p class=\"\"><span>52.40%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Adjusted EBITDA Margin</span></p></td><td></td><td><p class=\"\"><span>7.20%</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Gross Profit</span></p></td><td></td><td><p class=\"\"><span>$111.04 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>*Applies to a deviation of less than 1%; not applicable for per-share numbers.</span></p><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 9 \"strong buy\" or \"buy\", 5 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the miscellaneous specialty retailers peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Warby Parker Inc is $28.50, about 30.9% above its February 25 closing price of $21.77</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 44 times the next 12-month earnings vs. a P/E of 42 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0KB:0-warby-parker-q4-revenue-up-11-2-slightly-misses-estimates/",
            "pub_date": "2026-02-26 19:55:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2935856:0",
            "title": "MDI: Revenue up 29% year-over-year, with strong liquidity and expanded South American operations",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue rose to $244.1M in FQ2 2026, driven by strong gold and copper prices, while net earnings declined to $13.9M. The company expanded its South American presence through the Explomin acquisition and maintains a robust liquidity position.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2935856-12cb70eb6d5367010e7824e8978ae226\" target=\"_blank\">Major Drilling Group International Inc. [MDI] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2935856:0-mdi-revenue-up-29-year-over-year-with-strong-liquidity-and-expanded-south-american-operations/",
            "pub_date": "2026-02-26 19:55:12",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM05E:0",
            "title": "T S Flour Mill Logs FY Profit 45.47 Bln Baht",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>T S Flour Mill PCL </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY PROFIT 45.47 BILLION BAHT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY REVENUE FROM SALES 1.605 TRLN BAHT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM05E:0-t-s-flour-mill-logs-fy-profit-45-47-bln-baht/",
            "pub_date": "2026-02-26 19:45:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0JS:0",
            "title": "Eos Energy's Q4 revenue rises but annual revenue misses estimates",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>U.S. energy storage firm's Q4 revenue rose significantly but full-year revenue missed expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company secured over $240 mln in new orders in Q4, highlighting diversified demand</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company strengthened cash position with $600 mln convertible notes issuance</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Eos expects 2026 revenue between $300 mln and $400 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company focuses on manufacturing efficiency and converting backlog into revenue</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Eos launches Indensity™ to enhance site flexibility and safety</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OPERATIONAL IMPROVEMENTS - Record quarterly revenue driven by efficiency and quality improvements and subassembly automation</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DIVERSIFIED DEMAND - Secured over $240 mln in new orders from eight customers across U.S. and international markets</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>BALANCE SHEET STRENGTH - Strengthened liquidity through $600 mln convertible notes issuance and stock offering</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>FY Revenue</span></p></td><td><p class=\"\"><span>Miss</span></p></td><td><p class=\"\"><span>$114.20 mln</span></p></td><td><p class=\"\"><span>$150.17 mln (8 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>FY EPS</span></p></td><td></td><td><p class=\"\"><span>-$0.84</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Net Income</span></p></td><td></td><td><p class=\"\"><span>-$969.65 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Operating Expenses</span></p></td><td></td><td><p class=\"\"><span>$115.43 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Operating Income</span></p></td><td></td><td><p class=\"\"><span>-$259.27 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Pretax Profit</span></p></td><td></td><td><p class=\"\"><span>-$969.62 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy\", 6 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the electrical components &amp; equipment peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Eos Energy Enterprises Inc is $15.00, about 34.8% above its February 25 closing price of $11.13</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0JS:0-eos-energy-s-q4-revenue-rises-but-annual-revenue-misses-estimates/",
            "pub_date": "2026-02-26 19:45:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_PLXB32929:0",
            "title": "BRIEF-Nomad Foods Q4 Adjusted EBITDA EUR 131 Million Vs. IBES Estimate EUR 132 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 26 (Reuters) - Nomad Foods Q4 revenue EUR 773.1 million vs. IBES estimate EUR 776.8 million.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Q4 pretax profit EUR -35.4 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 EBIT EUR 70.5 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 gross profit EUR 197.7 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 net income EUR -10.7 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted EPS EUR 0.43 vs. IBES estimate EUR 0.43</span></li><li class=\"listItem-bmN0_SHH\"><span>outlook FY adjusted EPS EUR 1.45-1.6</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_PLXB32929:0-brief-nomad-foods-q4-adjusted-ebitda-eur-131-million-vs-ibes-estimate-eur-132-million/",
            "pub_date": "2026-02-26 19:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_PLXA03AC9:0",
            "title": "BRIEF-Krispy Kreme Q4 Adjusted EPS USD 0.09 Vs. IBES Estimate USD 0.03",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Feb 26 (Reuters) - Krispy Kreme Q4 revenue USD 392.4 million vs. IBES estimate USD 386.7 million.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted net income USD 15 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 net income USD -29.1 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted EBITDA USD 55.6 million vs. IBES estimate USD 46 million</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 adjusted EBITDA margin 14.2%</span></li><li class=\"listItem-bmN0_SHH\"><span>Q4 EPS USD -0.17</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_PLXA03AC9:0-brief-krispy-kreme-q4-adjusted-eps-usd-0-09-vs-ibes-estimate-usd-0-03/",
            "pub_date": "2026-02-26 19:45:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}