{
    "data": [
        {
            "id": "DJN_SN20260226019563:0",
            "title": "Dell's stock soars, as record earnings signal the company is managing memory shortages well",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Emily Bary</span></p><p class=\"\"><span>The maker of servers and PCs is also boosting its dividend by 20%</span></p><p class=\"\"><span>Dell expects $50 billion in AI revenue this fiscal year.</span></p><p class=\"\"><span>Dell Technologies gave a blowout outlook on Thursday while signaling that the industrywide memory-chip crunch seems manageable.</span></p><p class=\"\"><span>The maker of servers and personal computers expects $138 billion to $142 billion in revenue for its new fiscal year, whereas analysts were expecting under $125 billion. The forecast includes a projection for $50 billion in artificial-intelligence revenue, double what Dell (DELL) posted for fiscal 2026.</span></p><p class=\"\"><span>\"AI server demand remains exceptional,\" CFO David Kennedy said on the company's earnings call.</span></p><p class=\"\"><span>Dell shares were up 10% in Thursday's extended session.</span></p><p class=\"\"><span>At a time when the market is jittery about the impact of component shortages and rising memory prices on consumer-electronics businesses, Dell posted a 20.5% gross-margin rate for the fiscal fourth quarter, slightly above its forecast. The company is also comfortable with the supply it has to fulfill its revenue guidance.</span></p><p class=\"\"><span>From an operating-margin standpoint, the company has been benefiting from a greater mix of storage products as well as more sales of its own intellectual property. Both of those things have favorable profit profiles.</span></p><p class=\"\"><span>Don't miss: Memory-chip stocks are still quite cheap - especially if you look overseas</span></p><p class=\"\"><span>In the fiscal fourth quarter, Dell posted a 14.8% operating margin for its infrastructure-solutions business, which includes servers and storage offerings. The company posted a 240-basis-point improvement there relative to its performance in the fiscal third quarter.</span></p><p class=\"\"><span>Dell COO Jeff Clarke also expressed confidence in the company's ability to meet its mid-single-digit operating-margin target for AI servers.</span></p><p class=\"\"><span>\"We clearly have a lot of backlog to clear, with $43 billion in backlog,\" he said on the earnings call. \"That backlog will ship at mid-single digits.\"</span></p><p class=\"\"><span>Management discussed how \"input costs are rapidly changing,\" forcing strategic decisions for the company. Dell raised prices on traditional servers in December, a move that helped stabilize margins. With its client-solutions group, which includes personal computers, Dell was more deliberate as it has also been focused on winning market share.</span></p><p class=\"\"><span>\"Our business grew 18% in a market that grew 10%,\" management said, indicating that the focus on market-share gains has yielded results. The company did raise prices in January and saw stabilization of margins as a result.</span></p><p class=\"\"><span>See also: Arista succeeds where Cisco came up short - to the benefit of its stock</span></p><p class=\"\"><span>For the fiscal fourth quarter, Dell posted adjusted earnings per share of $3.89 on revenue of $33.4 billion. Both of those figures were records. Analysts tracked by FactSet were modeling $3.53 and $31.7 billion, respectively.</span></p><p class=\"\"><span>Dell also boosted its quarterly dividend by 20% and increased its buyback authorization by $10 billion. The company previously announced a commitment to double-digit dividend increases, on a percentage basis, through fiscal 2030.</span></p><p class=\"\"><span>Read: Block plans to lay off nearly half its staff in 'deliberate and bold' embrace of AI</span></p><p class=\"\"><span>-Emily Bary</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226019563:0/",
            "pub_date": "2026-02-27 09:31:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "dpa_afx:97af795ad306f:0",
            "title": "CHINA SETS YUAN CENTRAL PARITY AT 6.9228 FRI VS 6.9228",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Copyright RTT News/dpa-AFX</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/dpa_afx:97af795ad306f:0-china-sets-yuan-central-parity-at-6-9228-fri-vs-6-9228/",
            "pub_date": "2026-02-27 09:31:25",
            "source": "dpa-AFX",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZM2RO:0",
            "title": "Australia, NZ dollars steady after see-saw week, bonds rally",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Wayne Cole</span></p><p class=\"\"><span>    The Australian and New Zealand dollars went flat on Friday as a pullback in global equities soured risk sentiment, continuing the see-saw pattern of the week, though that did give a safe-haven lift to local bonds.</span></p><p class=\"\"><span>The Aussie was idling at $0.7102 </span><span>, having eased from a top of $0.7135 overnight. That still left it a fraction firmer for the week, but the Aussie needs to clear the recent three-year peak of $0.71465 to keep the rally going.</span></p><p class=\"\"><span>The currency was also up 1.1% for the week on the Japanese yen and just off a 35-year high of 111.45 </span><span>.</span></p><p class=\"\"><span>The kiwi dollar had barely budged at $0.5981 </span><span>, and was flat on the week. It remains corralled between support around $0.5930 and resistance at $0.6092.</span></p><p class=\"\"><span>Bonds have fared better as a safety bid boosted Treasuries, helping Australian 10-year yields </span><span> drop 8 basis points for the week to 4.658%, the lowest since mid-January.</span></p><p class=\"\"><span>That was still a tempting 65 basis points above U.S. yields, providing a buffer for the Aussie.</span></p><p class=\"\"><span>A high reading on inflation this week has left markets implying an 80% chance the Reserve Bank of Australia will hike the 3.85% cash rate a quarter point in May. (0#AUDIRPR) </span></p><p class=\"\"><span>The next major data point is gross domestic product for the December quarter on March 4, where analysts look for a rise of 0.6%, up from 0.4% the previous quarter.</span></p><p class=\"\"><span>Annual growth is seen holding at 2.1%, underpinned by a pickup in consumer spending and business investment. </span></p><p class=\"\"><span>\"This is arguably too high for potential GDP, which we estimate is closer to 1.8%,\" said Josh Williamson, head of Australian economics at Citi.</span></p><p class=\"\"><span>\"We keep our central view for a +25bp May interest rate increase and point to the risk to a subsequent hike in Q3 if aggregate demand looks like maintaining an out-of-target band underlying inflation pulse.\"</span></p><p class=\"\"><span>RBA Governor Michele Bullock also gives a speech and takes questions on Tuesday, while RBA Deputy Governor Andrew Hauser is on a panel discussion in New York on Friday.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZM2RO:0-australia-nz-dollars-steady-after-see-saw-week-bonds-rally/",
            "pub_date": "2026-02-27 09:31:54",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226019621:0",
            "title": "Sweetgreen's disappointing sales offer a reality check for restaurants, after Cava's rally",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Bill Peters</span></p><p class=\"\"><span>Salad chain is currently testing new wrap sandwiches, offered at lower prices, as diners stay selective on spending</span></p><p class=\"\"><span>Fast-casual chains like Sweetgreen and Chipotle have been dealing with discounted competition from fast-food and sit-down dining chains.</span></p><p class=\"\"><span>A day after Cava's upbeat sales forecast raised hopes for the restaurant industry, rival fast-casual chain Sweetgreen is bringing them back to earth.</span></p><p class=\"\"><span>Sweetgreen (SG) on Thursday forecast another year of falling same-store sales and said it would accelerate plans to turn itself around, as it deals with budget-conscious consumers and aggressive competition and discounting.</span></p><p class=\"\"><span>The fast-casual salad chain, in a statement, said the results came up short of even its own expectations. Those results arrived just two days after Sweetgreen launched new wrap sandwiches, priced a bit lower than some of its bowls and salads, after more expensive fare kept some customers away last year.</span></p><p class=\"\"><span>Shares of Sweetgreen (SG) were down 4.9% after hours on Thursday.</span></p><p class=\"\"><span>The drop in Sweetgreen's stock price came after shares of rival Cava (CAVA) rocketed higher on Wednesday, following a forecast for a same-store sales gain this year. The Mediterranean fast-casual chain's CEO said customers could be getting tired of chasing discounts. However, other chains, like McDonald's (MCD) and Chipotle (CMG), have been more tempered in their expectations for the year.</span></p><p class=\"\"><span>Shares of Cava were down 0.6% after hours Thursday.</span></p><p class=\"\"><span>Sweetgreen's management on Thursday said it would move ahead with more urgency to strengthen service standards, introduce new menu items and speed up checkout times. It also plans to improve marketing around things like high-quality ingredients.</span></p><p class=\"\"><span>CEO Jonathan Neman said that the company was currently testing new wrap sandwiches, which it introduced on Tuesday in parts of New York, the Midwest and California. If those items do well, he said Sweetgreen plans to expand the offerings beyond that trial run in the middle of the year. The prices for those wraps start at $10.95.</span></p><p class=\"\"><span>Sweetgreen said fourth-quarter sales fell 3.5% to $155.2 million, with a per-share loss of 42 cents. Both figures were worse than analysts expected. Same-stores sales were down 11.5%, which weren't as bad as anticipated.</span></p><p class=\"\"><span>The chain said it expects same-store sales to fall 2% to 4% this year.</span></p><p class=\"\"><span>Over the past year, fast-casual restaurants - which try to offer the quality of a sit-down chain at the speed of fast food - have been squeezed by value offerings from rivals like Chili's and McDonald's. Against that backdrop, Sweetgreen's stock is down 73.5% over the past 12 months. Over recent months, consumers have showed signs of waning interest in often-pricey salad and bowl offerings.</span></p><p class=\"\"><span>Ahead of the results, UBS analysts said Sweetgreen faced concerns over spending among younger consumers, who make up about a third of the people who visit the chain. They also noted that the chain has struggled in cities like Los Angeles and areas in the Northeast. During an earnings call in November, Sweetgreen said New York was its \"most challenged market.\"</span></p><p class=\"\"><span>Many restaurants, after raising prices to cover for the past several years of supply shocks, are now trying to find ways to cut them after scaring customers away. But the discount war has weighed on margins and, in some cases, stock prices.</span></p><p class=\"\"><span>-Bill Peters</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226019621:0/",
            "pub_date": "2026-02-27 09:33:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226019650:0",
            "title": "Duolingo is making some changes to contend with the threat of AI. Its stock is sinking.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Hannah Pedone</span></p><p class=\"\"><span>Following a slowdown in user growth, the language-learning company is stepping up investments and changing how it thinks about its tiers of service</span></p><p class=\"\"><span>Duolingo plans to invest more in its free tier of service and acknowledged it previously introduced too much friction for users.</span></p><p class=\"\"><span>Artificial intelligence is making it easier than ever for people to translate languages and communicate with people who speak different tongues.</span></p><p class=\"\"><span>And, increasingly, investors have been worried about what that means for Duolingo (DUOL), which calls itself the world's largest language-learning app.</span></p><p class=\"\"><span>Heading into Thursday's close, Duolingo's stock had fallen 78% from its peak close achieved last May. Management now seems to be acknowledging that it needs to make changes in a rapidly evolving landscape.</span></p><p class=\"\"><span>Read: Block plans to lay off nearly half its staff in 'deliberate and bold' embrace of AI</span></p><p class=\"\"><span>The company announced some of those Thursday afternoon, alongside fiscal-fourth quarter earnings results. Duolingo's management disclosed that the transition could weigh on financials in the near term but expressed confidence in a long-term payoff.</span></p><p class=\"\"><span>Some investors may not be waiting to see how things play out, however, with Duolingo shares off more than 20% in Thursday's extended session.</span></p><p class=\"\"><span>Duolingo has been trying to integrate AI into its own product offerings, including by letting customers video-chat with an AI-powered animated character and engage in more voice-based AI experiences to test their progress.</span></p><p class=\"\"><span>The company announced it will move its core AI product, \"Video Call with Lily,\" to be part of the company's \"Super Duolingo tier\" subscription, down from its more exclusive \"Duolingo Max\" tier. It also announced new AI-powered lesson plans.</span></p><p class=\"\"><span>Further, Duolingo will try to respond to a growth slowdown in daily active users by increasing the value proposition of its free tier.</span></p><p class=\"\"><span>See also: Software stocks bounce as Nvidia shares falter. Is a new rotation trade in store?</span></p><p class=\"\"><span>\"Up until now, the main way we've increased bookings per user is by adding small amounts of friction to encourage more people to subscribe, for example by increasing ad load or subscription upsells,\" Duolingo said in a shareholder letter. \"Unfortunately, we believe that this extra friction is part of the reason our DAU growth has slowed, so we've decided to prioritize user growth over monetization.\"</span></p><p class=\"\"><span>The moves are expected to come with several financial tradeoffs. For one, the company said in the letter that it expects revenue growth will \"step down sequentially\" in the second and third quarters, before \"stabilizing\" in the fourth quarter.</span></p><p class=\"\"><span>Bookings, meanwhile, are expected to grow just 11% this fiscal year, versus an almost 20% growth rate the company said it expected it would see \"if we operated like we have in past years.\"</span></p><p class=\"\"><span>Profits will also come under pressure as the new moves require heavy investment. Duolingo expects a 25% margin of earnings before interest, taxes, depreciation and amortization for the current fiscal year, versus the 29.5% margin it posted for its just-completed fiscal year.</span></p><p class=\"\"><span>CEO Luis von Ahn said in a video message that \"this may seem a little strange if you just look at the next quarter.\"</span></p><p class=\"\"><span>\"But here we're trying to build a company for a very long time,\" he added, and that in the long term, the company's goal is to educate \"billions\" of people.</span></p><p class=\"\"><span>See more: Salesforce's record $50 billion stock-buyback plan is proving controversial on Wall Street</span></p><p class=\"\"><span>-Hannah Pedone</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226019650:0/",
            "pub_date": "2026-02-27 09:33:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2C3:0",
            "title": "ST Engineering Announces Special Dividend Of 5.0 SG Cents Per Ordinary Share",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Singapore Technologies Engineering Ltd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SPECIAL DIVIDEND OF 5.0 SG CENTS PER ORDINARY SHARE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY REPORTED PROFIT ATTRIBUTABLE S$462.8 MILLION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FINAL DIVIDEND 6.0 SG CENTS PER SHARE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY REVENUE SGD 12,346 MILLION</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2C3:0-st-engineering-announces-special-dividend-of-5-0-sg-cents-per-ordinary-share/",
            "pub_date": "2026-02-27 09:33:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZM2PW:0",
            "title": "Singapore's Olam Group skips final dividend even as profit jumps five-fold",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>First tranche sale of Olam Agri awaits approval</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Net 2025 dividend 2.0 Singapore cents</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>ofi earnings flat amid commodity volatility</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Shares down 4.6%</span></li></ul></span></div><span><p class=\"\"><span>Singapore's Olam Group </span><span> reported a more than five-fold jump in annual profit on Friday, driven by strong performance across its businesses including Olam Agri, but said it would not pay a final dividend to conserve cash for restructuring.</span></p><p class=\"\"><span>Shares of the Singapore-based food and agri-business conglomerate were trading 4.6% lower in early trading at S$0.945, compared with a 0.9% decline in the FTSE Straits Times index </span><span>.</span></p><p class=\"\"><span>Olam, one of the world's biggest agricultural commodities traders, posted profit attributable of S$444.1 million ($351.34 million) for the year ended December 31, compared with S$86.4 million in the prior year.</span></p><p class=\"\"><span>The profit includes earnings from Olam's 64.57% stake in Olam Agri, which is being sold to Saudi Arabia's SALIC in two stages. The first stage, involving a 44.58% stake sale, is still awaiting approval from one jurisdiction where the company operates.</span></p><p class=\"\"><span>Meanwhile, the \"Remaining Olam Group\" segment, which comprises assets the company aims to divest and monetise over time, logged operating earnings of S$197.7 million, compared to a loss of S$151.5 million in the prior year.</span></p><p class=\"\"><span>The segment includes its joint ventures with the Republic of Gabon, and Rusmolco, its Russian dairy business.</span></p><p class=\"\"><span>Olam's food ingredients business, ofi, saw flat growth amid volatility in commodity prices. </span></p><p class=\"\"><span>The company flagged a stabilisation in market conditions for cocoa and coffee, ofi's key input materials, and maintained its forecast of high-single-digit growth in adjusted operating earnings over the medium-term.</span></p><p class=\"\"><span>Olam said last April that it would sharpen its focus on ofi by selling its other businesses and assets. </span></p><p class=\"\"><span>\"The group is seeking to responsibly divest and monetise the 10 remaining assets and businesses of the Remaining Olam Group over time and progressively distribute the net proceeds to shareholders via special dividends,\" the company said.</span></p><p class=\"\"><span>The board, therefore, decided to withhold a final dividend in view of the ongoing restructuring and the pending sale of Olam Agri to SALIC, an agricultural and livestock investment firm.</span></p><p class=\"\"><span>Olam had declared a 2.0 Singapore cents per-share interim dividend in August, making fiscal 2025 payout its lowest annual  dividend in at least 12 years, according to its dividend history webpage.</span></p><p class=\"\"><span>($1 = 1.2640 Singapore dollars)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZM2PW:0-singapore-s-olam-group-skips-final-dividend-even-as-profit-jumps-five-fold/",
            "pub_date": "2026-02-27 09:34:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM2CG:0",
            "title": "Warrix Sport Says Chairman Resigns",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Warrix Sport PCL </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>PASU DECHARIN RESIGNS AS CHAIRMAN OF THE BOARD</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>POTITAT PIRIYAVIRUT APPOINTED AS CHAIRMAN OF THE BOARD</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM2CG:0-warrix-sport-says-chairman-resigns/",
            "pub_date": "2026-02-27 09:34:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1RV:0",
            "title": "Venezuela suspends 19 oil, gas production-sharing contracts signed under Maduro, sources say",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Contracts under review include projects in challenging areas, expansions at the Orinoco, and mature fields</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Oil output has not been halted but PDVSA took over trade</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Partners include Chinese, US, South American and Venezuelan companies</span></li></ul></span></div><span><p class=\"\"><span>By Marianna Parraga</span></p><p class=\"\"><span>Venezuela's oil ministry has suspended 19 oil production-sharing contracts with private companies signed under the administration of President Nicolas Maduro, four sources with knowledge of the move told Reuters on Thursday.</span></p><p class=\"\"><span>The suspension has had no impact on the country's oil and gas output so far, the sources said. State oil giant PDVSA is selling the crude produced under the contracts while they are suspended, they added.</span></p><p class=\"\"><span>    Caracas and Washington would review the contracts and may recommend revoking some of them, the sources said. The Venezuelan and U.S. governments are reviewing the credentials of the companies that signed them, the sources added. Some of the companies are little-known and the deals were signed while Venezuela was under U.S. sanctions.</span></p><p class=\"\"><span>The contracts under review include projects that recently began producing oil in challenging areas such as Lake Maracaibo, big ventures that aim to expand output in the Orinoco Belt, Venezuela's main oil region, and small mature oilfields.</span></p><p class=\"\"><span>Maduro's administration had little success securing investment through the production-sharing contract model as large oil players rejected a return to Venezuela after expropriations or avoided doing business with it due to U.S. sanctions.</span></p><p class=\"\"><span>    The players that took on production-sharing contracts included Chinese, U.S., South American and Venezuelan firms, as well as some companies registered in tax haven countries, and some obtained contracts in multiple areas, according to a list seen by Reuters.</span></p><p class=\"\"><span>    Some of the companies also outsourced the oilfields to contractors, two of the sources said.</span></p><p class=\"\"><span>The United States captured Maduro in January and took control of Venezuela's oil exports and sales. Since then, the U.S. Treasury Department has issued general licenses that allow companies to trade Venezuela's oil and to operate in the country's oil and gas sectors, but require specific clearance by the Treasury's Office of Foreign Assets Control.</span></p><p class=\"\"><span>Venezuela's National Assembly passed a reform to the country's hydrocarbon law in late January to facilitate foreign investment in the dilapidated oil industry. Under the reformed law, the government has six months to review existing contracts. </span></p><p class=\"\"><span>Venezuela's ministries of oil and communications and the White House did not immediately reply to a request for comment. </span></p><p class=\"\"><span>The ministry and PDVSA are separately in talks with many of Venezuela's traditional joint-venture partners, including Chevron </span><span>, Repsol </span><span> and Maurel &amp; Prom </span><span>, to allow them to expand the oilfields already assigned to their projects, which could contribute to increased crude and gas output.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1RV:0-venezuela-suspends-19-oil-gas-production-sharing-contracts-signed-under-maduro-sources-say/",
            "pub_date": "2026-02-27 09:35:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM24H:0",
            "title": "MeiG Smart Technology Announces Global Offering Of 35 Million H Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>MeiG Smart Technology Co:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>GLOBAL OFFERING</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NUMBER OF OFFER SHARES UNDER GLOBAL OFFERING 35 MILLION H SHARES</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MAXIMUM OFFER PRICE HK$28.86 PER H SHARE</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>NUMBER OF HONG KONG OFFER SHARES 3.5 MILLION H SHARES</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM24H:0-meig-smart-technology-announces-global-offering-of-35-million-h-shares/",
            "pub_date": "2026-02-27 09:35:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN05N:0",
            "title": "Zscaler posts wider quarterly loss on higher spending; shares down 9%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Zscaler's second-quarter revenue up 26% year-on-year</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Company's expenses rise sharply on sales and R&amp;D costs</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Zscaler forecast third-quarter revenue above estimates</span></li></ul></span></div><span><p class=\"\"><span>By Jaspreet Singh</span></p><p class=\"\"><span>    Zscaler </span><span> on Thursday posted a wider net loss in the second quarter, citing higher spending on sales, marketing, and research and development in a competitive market, sending shares of the cloud security firm down roughly 9% in extended trading.</span></p><p class=\"\"><span>The results come when IT budgets remain tight and clients spend cautiously on large deals amid economic uncertainty, even though cybersecurity budgets face less pressure than general capital outlays.</span></p><p class=\"\"><span>Zscaler provides cloud-based zero trust security, which is designed to eliminate the need for legacy firewalls and virtual private networks (VPNs) by authenticating each connection rather than granting broader network access.</span></p><p class=\"\"><span>Shares of cybersecurity companies, including CrowdStrike </span><span> and Zscaler, have fallen in recent days as investors assessed the potential impact of AI startup Anthropic's Claude Code Security tool on the industry.</span></p><p class=\"\"><span>Zscaler, which competes with Palo Alto Networks </span><span> and Cloudflare </span><span>, reported a net loss of $34.3 million in the quarter ended January 31, widening sharply from a net loss of $7.7 million a year earlier.</span></p><p class=\"\"><span>Total operating expenses rose to $676.3 million in the second quarter, compared with $539.5 million in the year-ago period, driven by sales, marketing and research and development expenses.</span></p><p class=\"\"><span>\"While CIOs (chief information officers) care about the budget, but they're doing two things: they do want to embrace AI and they want to do it securely. So, AI is driving demand for security,\" Zscaler CEO Jay Chaudhry said.</span></p><p class=\"\"><span>Businesses spend on tools offered by companies such as Zscaler amid a wave of high-profile cyberattacks that has hit companies, including F5 </span><span>.</span></p><p class=\"\"><span>Zscaler said its second-quarter revenue rose 26% to $815.8 million, beating analysts' average estimate of $798.8 million, according to LSEG-compiled data. Its adjusted profit per share of $1.01 exceeded estimate of 90 cents.</span></p><p class=\"\"><span>The company forecast third-quarter adjusted earnings per share of $1.00 to $1.01, above analysts' estimates of 95 cents, and revenue of $834 million to $836 million, topping expectations of $831.9 million.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN05N:0-zscaler-posts-wider-quarterly-loss-on-higher-spending-shares-down-9/",
            "pub_date": "2026-02-27 09:35:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019521_20260226019521:0",
            "title": "Shanghai Composite Index Opens 0.4% Lower at 4128.90",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019521_20260226019521:0/",
            "pub_date": "2026-02-27 09:26:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019521_20260226019525:0",
            "title": "Shenzhen Composite Index Opens 0.7% Lower at 2736.43",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019521_20260226019525:0/",
            "pub_date": "2026-02-27 09:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019427_20260226019523:0",
            "title": "Duos Technologies: Underwritten Public Offering of 8.7M Shares Priced for Total Gross Proceeds of Approximately $65M >DUOT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019427_20260226019523:0/",
            "pub_date": "2026-02-27 09:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019427_20260226019524:0",
            "title": "Duos Technologies: Granted Underwriters 30-Day Option to Purchase Up to an Additional 1.3M Shares to Cover Over-Allotments at Public Offering Price >DUOT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019427_20260226019524:0/",
            "pub_date": "2026-02-27 09:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019427_20260226019522:0",
            "title": "Duos Technologies Group, Inc. Announces Pricing of $65M Public Offering of Common Stock",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019427_20260226019522:0/",
            "pub_date": "2026-02-27 09:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019521_20260226019526:0",
            "title": "ChiNext Price Index Opens 1.2% Lower at 3303.98",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019521_20260226019526:0/",
            "pub_date": "2026-02-27 09:27:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN05W:0",
            "title": "Zscaler Inc reports results for the quarter ended January 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Zscaler Inc </span><span> reported quarterly adjusted earnings of $1.01​​ per share for the quarter ended January 31, higher than the same quarter last year, when the company reported EPS of 78 cents.  The mean expectation of forty two analysts for the quarter was for earnings of 90 cents per share. Wall Street expected results to range from 88 cents to 97 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 25.9% to $815.75 million from a year ago; analysts expected $798.82 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Zscaler Inc's reported EPS for the quarter was a loss of 21 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $34.31 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Zscaler Inc shares had fallen by 30.8% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, one analyst negatively revised an earnings estimate</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 41 \"strong buy\" or \"buy,\" 8 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the software peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Zscaler Inc is $300.00, about 44.2% above its last closing price of $167.36</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 01:28 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Jan. 31 2026 </span></p></td><td><p class=\"\"><span>0.90</span></p></td><td><p class=\"\"><span>1.01</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Oct. 31 2025 </span></p></td><td><p class=\"\"><span>0.86</span></p></td><td><p class=\"\"><span>0.96</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jul. 31 2025 </span></p></td><td><p class=\"\"><span>0.80</span></p></td><td><p class=\"\"><span>0.89</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Apr. 30 2025 </span></p></td><td><p class=\"\"><span>0.75</span></p></td><td><p class=\"\"><span>0.84</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN05W:0-zscaler-inc-reports-results-for-the-quarter-ended-january-31-earnings-summary/",
            "pub_date": "2026-02-27 09:28:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN02T:0",
            "title": "Drug developer Generate Biomedicines raises $400 million in US IPO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Generate Biomedicines said on Thursday that it raised $400 million in its U.S. initial public offering, pricing shares of the U.S.-based drug developer at $16 each.</span></p><p class=\"\"><span>The offering comes as the IPO market remains volatile, with swings in high-growth technology stocks driven by concerns that artificial intelligence could disrupt established businesses and industries.</span></p><p class=\"\"><span>Recent sell-offs have delayed IPO plans of several firms, with analysts noting that successful listings generally depend on strong investor sentiment.</span></p><p class=\"\"><span>Backed by venture firm Flagship Pioneering, Generate Biomedicines sold 25 million shares in the offering, within its target range of $15 to $17, with all shares offered by the company itself.</span></p><p class=\"\"><span>Founded by Flagship in 2018, Generate Biomedicines uses AI-driven technology to move beyond traditional trial-and-error drug discovery and develop new protein-based therapies, with its pipeline centered on immunology and oncology. </span></p><p class=\"\"><span>Generate's lead drug candidate for severe asthma, GB-0895, is currently in a late-stage trial, with full enrollment in the study expected by the first half of 2028.</span></p><p class=\"\"><span>The company will start trading on the Nasdaq under the ticker symbol \"GENB\" on Friday. </span></p><p class=\"\"><span>Goldman Sachs, Morgan Stanley, Piper Sandler, Guggenheim Securities and Cantor are the underwriters for the offering.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN02T:0-drug-developer-generate-biomedicines-raises-400-million-in-us-ipo/",
            "pub_date": "2026-02-27 09:28:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM29R:0",
            "title": "Aurora Design Posts FY Total Operating Revenue Of 39,914.7 Million Baht",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Aurora Design PCL </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY TOTAL OPERATING REVENUE OF 39,914.7 MILLION BAHT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FY NET PROFIT OF 1,460.7 MILLION BAHT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM29R:0-aurora-design-posts-fy-total-operating-revenue-of-39-914-7-million-baht/",
            "pub_date": "2026-02-27 09:28:34",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM27C:0",
            "title": "APA Group Says Welcome Final Determination On Basslink Revenue Proposal",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>APA Group </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WELCOMES FINAL DETERMINATION ON BASSLINK REVENUE PROPOSAL</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>FINAL DECISION PROVIDES TOTAL REVENUE OF A$459.5 MILLION FOR A FOUR-YEAR PERIOD FROM 1 JULY 2026 TO 30 JUNE 2030</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>OUTCOME NOW ENABLES APA TO TAKE STEPS TO CEASE TRADING BASSLINK AS MARKET SERVICES NETWORK PROVIDER ON 30 JUNE</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM27C:0-apa-group-says-welcome-final-determination-on-basslink-revenue-proposal/",
            "pub_date": "2026-02-27 09:28:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019533:0",
            "title": "Japan Offering Y2.8T Of 1.3% 2-Year Govt Bonds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TOKYO--Japan's Ministry of Finance said Friday it is auctioning Y2.8 trillion of two-year government bonds.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Issue                   2-year govt bond (No 482) </span><br/><span>Coupon                                       1.3% </span><br/><span>Settlement Date                       Mar 2, 2026 </span><br/><span>Maturity Date                         Mar 1, 2028 </span><br/><span>Offer Amount                        Y2.8 Trillion </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019533:0/",
            "pub_date": "2026-02-27 09:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0GE:0",
            "title": "Export prices stagnant on muted demand, robust supply",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Not much activity in the market, India trader says</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Data shows over 200,000 tons of rice loaded at South Vietnam ports</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Bangladesh's domestic prices high despite good harvests, comfortable reserves</span></li></ul></span></div><span><p class=\"\"><span>By Anjana Anil</span></p><p class=\"\"><span>Prices of rice exported from major hubs in Asia were largely stagnant this week, as demand lagged and ample supplies weighed on the market.</span></p><p class=\"\"><span>India's 5% broken parboiled variety (RI-INBKN5-P1) was quoted at $350 to $356 per metric ton, unchanged from last week. Indian 5% broken white rice was priced between $347 and $352 per ton this week.</span></p><p class=\"\"><span>\"There is not much activity in the market. Demand remains weak as buyers are placing orders cautiously,\" said a Kolkata-based rice dealer.</span></p><p class=\"\"><span>Vietnam's 5% broken rice (RI-VNBKN5-P1) was offered at $360 to $365 per ton, unchanged from two weeks ago, according to traders.</span></p><p class=\"\"><span>\"Trading activity is resuming after the holiday but we are seeing headwinds ahead, with strong global supplies and key buyer the Philippines is cutting its purchases,\" said a Ho Chi Minh City-based trader, noting that the Philippines will likely cut monthly imports to 150,000 tons starting March from 400,000 tons previously.  </span></p><p class=\"\"><span>Preliminary shipping data showed over 200,000 tons of rice loaded at ports in southern Vietnam from February 1 to 23, with most of it heading to the Philippines, Africa and South Korea.</span></p><p class=\"\"><span>Thailand's 5% broken rice (RI-THBKN5-P1) was quoted at $385 per ton, in similar range of $383 to $385 quoted last week.</span></p><p class=\"\"><span>Traders say demand remains subdued, with no major deals reported for Thai rice. A Bangkok-based trader said buyers from the Philippines have shifted to Vietnamese rice due to its competitive pricing.</span></p><p class=\"\"><span>The trader also said that the supply situation was largely unchanged, as the market waits to assess the outcome of the new crop. Many expect overall yields to be lower this year amid forecasts of dry conditions, the trader added.</span></p><p class=\"\"><span>In Bangladesh, domestic rice prices remained elevated despite good harvests and comfortable reserves, deepening the strain on inflation-hit consumers.</span></p><p class=\"\"><span>The government has also been importing rice and has allowed private traders to purchase the staple from global markets in an effort to stabilize prices and boost supply.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0GE:0-export-prices-stagnant-on-muted-demand-robust-supply/",
            "pub_date": "2026-02-27 09:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260226018435:0",
            "title": "CoreWeave's stock drops as losses swell and interest expenses climb",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Christine Ji</span></p><p class=\"\"><span>While AI demand remains high, CoreWeave's widening net loss in the fourth quarter is giving investors pause</span></p><p class=\"\"><span>CoreWeave's revenue backlog quadrupled from the beginning of 2025.</span></p><p class=\"\"><span>CoreWeave shares faced pressure in after-hours trading on Thursday after the company's fourth-quarter earnings report showed healthy demand and revenue growth but a widening net loss.</span></p><p class=\"\"><span>CoreWeave's stock (CRWV) fell as much as 11% after the closing bell. The company's fourth-quarter revenue reached $1.57 billion, growing 110% year over year and exceeding the $1.55 billion FactSet consensus. But the company posted a net loss of $452 million, far steeper than the $342 million anticipated by analysts.</span></p><p class=\"\"><span>\"2025 was a defining year for CoreWeave as we became the fastest cloud in history to reach $5 billion in annual revenue,\" chair and CEO Michael Intrator said in a statement.</span></p><p class=\"\"><span>Demand for CoreWeave's products is strong. The company's backlog grew to $66.8 billion in the fourth quarter - quadrupling from the beginning of 2025 - and CoreWeave is building aggressively to turn the backlog into revenue. The company added 260 megawatts of active power capacity in the fourth quarter alone, bringing its total to over 850 megawatts. More important for future scaling, CoreWeave has contracted for 3.1 gigawatts of total power, securing access to address a critical artificial-intelligence bottleneck. The company has resolved the data-center delays that impeded revenue growth in the the third quarter, Intrator said on the earnings call.</span></p><p class=\"\"><span>But the cost of building the massive data centers required to house Nvidia's (NVDA) high-end chips continues to weigh on the bottom line, especially as CoreWeave takes on debt to fund its expansion. While CoreWeave is growing revenues at a rapid clip, the company's interest expenses are increasing at a similar pace. Net interest expenses for the fourth quarter were $388 million, a 160% year-over-year increase.</span></p><p class=\"\"><span>Adjusted operating income was $88 million for the fourth quarter, \"lower than expected as a result of deploying infrastructure ahead of our expectations,\" CFO Nitin Agrawal said on the call. The adjusted operating margin was 6%.</span></p><p class=\"\"><span>One part of CoreWeave's solution to growing interest expenses appears to be expansion into higher-margin revenue streams. On the call, Intrator emphasized new avenues of monetization for CoreWeave such as CPU, storage, software and development tools. \"The opportunity to add additional value to these customers as their AI workloads mature is substantial and represents meaningful upside over time,\" Intrator said, adding that the revenue would be \"higher margin\" and is not currently factored into guidance estimates at this time.</span></p><p class=\"\"><span>Capital expenditures in 2026 are anticipated to be $30 billion to $35 billion, more than twice the levels in 2025 and higher than analysts' expectations of $26.9 billion. Management emphasized that the capex spending is tied to already signed customer contracts.</span></p><p class=\"\"><span>CoreWeave guided for current-quarter revenues between $1.9 billion and $2 billion, falling short of analysts' expectations of $2.3 billion. CoreWeave anticipates exiting 2026 with $17 billion to $19 billion of annual recurring revenue, and reaching $30 billion of ARR by 2027.</span></p><p class=\"\"><span>Analysts on the call were curious about how capex levels could drive revenue growth and improve margins going forward. While CoreWeave will incur upfront costs to bring capacity online, Agrawal signaled that the first quarter of 2026 will represent the \"trough\" for margins. He also highlighted high-margin \"accretive\" services like AI storage - which now boasts an 80% attach rate among large customers - as a force that could eventually drive long-term margins to the 25% to 30% range.</span></p><p class=\"\"><span>See more: CoreWeave's stock drops. Why a $4 billion Blue Owl funding snag has investors on edge.</span></p><p class=\"\"><span>-Christine Ji</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260226018435:0/",
            "pub_date": "2026-02-27 09:30:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019495_20260226019495:0",
            "title": "Malayan Banking Target Price Raised to MYR13.30 From MYR12.40 by TA Securities >1155.KU",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019495_20260226019495:0/",
            "pub_date": "2026-02-27 09:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2940881:0",
            "title": "MMI: Record profit and revenue growth achieved, with strong cash flow and share buy-back approved",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record bauxite shipments and a 23% revenue increase drove a $142.3 million net profit, reversing last year’s loss. Operational improvements, impairment reversal, and strong cash flow supported a positive outlook, with debt maturity extended and a share buy-back approved.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2940881-95469b385b5f02ba5d81afc89f47ff44\" target=\"_blank\">Metro Mining Limited [MMI] Annual Report — Feb. 27 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2940881:0-mmi-record-profit-and-revenue-growth-achieved-with-strong-cash-flow-and-share-buy-back-approved/",
            "pub_date": "2026-02-27 09:17:09",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN05M:0",
            "title": "Biodesix Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biodesix Inc </span><span> reported a quarterly adjusted loss of 49 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $-1.20.  The mean expectation of five analysts for the quarter was for a loss of 85 cents per share. Wall Street expected results to range from $-1.05 to -63 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 23.1% to $25.15 million from a year ago; analysts expected $25.73 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biodesix Inc's reported EPS for the quarter was a loss of 49 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $3.98 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Biodesix Inc shares had risen by 90.1% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 6.3% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 4 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Biodesix Inc is $35.00, about 59.4% above its last closing price of $14.22</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 01:17 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.85</span></p></td><td><p class=\"\"><span>-0.49</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-1.44</span></p></td><td><p class=\"\"><span>-1.16</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>-1.37</span></p></td><td><p class=\"\"><span>-1.60</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>-1.36</span></p></td><td><p class=\"\"><span>-1.60</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN05M:0-biodesix-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 09:17:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L4N3ZN025:0",
            "title": "Denver mayor orders protection of protesters, ban on ICE from city property",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Kanishka Singh</span></p><p class=\"\"><span>    Denver Mayor Mike Johnston signed an order on Thursday authorizing the Democratic-governed city's police to protect peaceful protesters against federal Immigration and Customs Enforcement operations and banning ICE from city property.</span></p><p class=\"\"><span>Republican President </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump's</a><span> administration has used ICE in an immigration crackdown that has been condemned by human rights advocates, especially after the January fatal shootings of two U.S. citizens by federal agents in Minnesota.</span></p><p class=\"\"><span>In the aftermath of those shootings, Democratic mayors and governors have sought ways to counter Trump's actions. </span></p><p class=\"\"><span>Minneapolis Mayor Jacob Frey signed an order prohibiting agencies from using any city-owned parking lots, ramps, garages, or vacant lots to stage immigration enforcement operations.</span></p><p class=\"\"><span>Johnston's order says that in the event of civil immigration enforcement operations, including a surge in ICE agents, the city's law enforcement agencies \"shall use their established de-escalation protocols to try to protect peaceful protestors\" and ensure public health, safety, and the preservation of free speech rights.</span></p><p class=\"\"><span>\"If we see any ICE officer using excessive force against a Denver resident, we will step in to detain that officer and remove them from the situation,\" Johnston said in a news conference about the order. </span></p><p class=\"\"><span>\"We hold our own officers to that standard, and we will hold any ICE agent to the same,\" he added.</span></p><p class=\"\"><span>The White House said local officials should work with ICE and not against it. \"Anyone doing otherwise is simply doing the bidding of criminal illegal aliens,\" White House spokeswoman Abigail Jackson said in a statement cited by Politico. </span></p><p class=\"\"><span>Trump has cast his crackdown as aiming to curb illegal immigration and improve domestic security. He has also threatened Democratic cities and states with federal funding freeze. </span></p><p class=\"\"><span>Rights groups say the crackdown has created a fearful environment for both citizens and immigrants, while violating due process and free speech rights.    </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3ZN025:0-denver-mayor-orders-protection-of-protesters-ban-on-ice-from-city-property/",
            "pub_date": "2026-02-27 09:17:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN01Y:0",
            "title": "Argentina's YPF posts $649 million quarterly loss; 42% jump in shale output",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    Argentine state energy firm YPF </span><span> posted a fourth-quarter net loss of $649 million, more than double the $284 million loss it reported a year earlier due to shifting prices in oil and petroleum derivatives and a slowdown in gas sales, the company said. </span></p><p class=\"\"><span>The company's revenues fell 4% year-on-year, landing at $4.56 billion.</span></p><p class=\"\"><span>Quarterly adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) - a key measure of industry profitability - hit $1.28 billion, up 53% from a year earlier and surpassing the $1.22 billion estimate of analysts polled by LSEG.</span></p><p class=\"\"><span>Revenues for the final three months of the year dropped 4% versus the same period last year to $4.56 billion, also beating analysts' $4.11 billion forecast.</span></p><p class=\"\"><span>The company said its total shale oil production surged 35% year-on-year to an average of 165,000 barrels per day, while fourth-quarter shale production jumped 42% year-on-year to 196,000 barrels per day. </span></p><p class=\"\"><span>YPF's performance is a critical indicator for Argentina's economy, which relies on the company's Vaca Muerta operations in its push to become a net energy exporter, bolster dollar reserves and maintain a stable currency.</span></p><p class=\"\"><span>Earlier this month, analysts predicted that Vaca Muerta would help lift Argentina's energy surplus to a new record this year, predicting a trade surplus of up to $10 billion that would depend largely on the South American nation's oil output.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN01Y:0-argentina-s-ypf-posts-649-million-quarterly-loss-42-jump-in-shale-output/",
            "pub_date": "2026-02-27 09:19:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226019508:0",
            "title": "Japan Offering Y4.7T Of TD-Bills (No 1365)",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>TOKYO--Japan's Ministry of Finance said Friday it is auctioning Y4.7 trillion of treasury discount bills.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>Issue                  TD-Bill (Number 1365) </span><br/><span>Settlement Date                  Mar 2, 2026 </span><br/><span>Maturity Date                    Jun 1, 2026 </span><br/><span>Offer Amount                   Y4.7 Trillion </span></pre><p class=\"\"><span>This content was automatically published based on data and/or text from the original source. For feedback, write to singaporeeditors@dowjones.com.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226019508:0/",
            "pub_date": "2026-02-27 09:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}