{
    "data": [
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0CW:0",
            "title": "Dutaland Says Unit Produced 365.37 Metric Tonnes Fresh Fruit Bunches In January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">DutaLand Bhd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DUTALAND BHD -  JANUARY FRESH FRUIT BUNCHES PRODUCTION FOR UNIT 365.37 METRIC TONNES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0CW:0-dutaland-says-unit-produced-365-37-metric-tonnes-fresh-fruit-bunches-in-january/",
            "pub_date": "2025-02-05 18:33:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463945:0",
            "title": "S&P PMI: Strong Order Backlog, Demand Prop Up UAE's Non-Oil Economy in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The non-oil economy of the United Arab Emirates was firmly in expansion mode in January but capacity pressures including a low rate of employment growth persisted and even worsened, S&amp;P Global data showed Wednesday. </p><p class=\"\">The closely watched seasonally adjusted S&amp;P Global UAE Purchasing Managers' Index was at 55 in January, coming down from the nine-month high of 55.4 seen a month ago. The pace of backlog accumulation is at its fastest in eight months and strong demand prompted non-oil companies to raise their selling prices for the first time in over a quarter. </p><p class=\"\">\"The UAE PMI signalled another good month for the non-oil private sector in January,\" S&amp;P Global Market Intelligence senior economist David Owens said. \"Robust expansions in activity and new business, as well as lower input cost inflation, suggest the economy is in a healthy position.\"</p><p class=\"\">On the other hand, S&amp;P noted that total business confidence is at an over two-year low. For the January survey, only 9% of businesses said they are expecting activity growth in the next 12 months. </p><p class=\"\">\"Strong competition and cash flow concerns arising from heavy backlogs have appeared to sow doubt among firms that they can continue to boost their revenues, underlining efforts to reduce the gap between output and input prices,\" Owens wrote. </p><p class=\"\">Zooming in the Emirates' second-largest city, the headline Dubai PMI fell to 55.3 from 55.5 in the period, with total activity up, thanks to new business inflows and easing cost pressures. The city's non-oil companies, however, are also weighed down by the country-wide issues in employment and outlook for future business activity.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463945:0/",
            "pub_date": "2025-02-05 18:33:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003091:0",
            "title": "These Stocks Are Moving the Most Today: Alphabet, AMD, Apple, Palantir, Novo Nordisk, PDD, Disney, and More — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joe Woelfel</p><p class=\"\">Stock futures were falling Wednesday after Google parent Alphabet reported quarterly revenue that missed Wall Street expectations and as investors awaited talks between President Donald Trump and Chinese President Xi Jinping as the countries levy tariffs on one another.</p><p class=\"\">These stocks were poised to make moves Wednesday</p><p class=\"\">Alphabet, the parent company of search giant Google, reported fourth-quarter earnings that beat analysts' estimates but the stock was falling 7.5% after revenue of $96.47 billion missed forecasts of $96.68 billion. Revenue at Alphabet's cloud business during the quarter of $11.96 billion, up 30% from a year earlier, also missed expectations of $12.19 billion. The company said it plans to invest $75 billion in capital expenditures in 2025 as it expands its generative artificial-intelligence initiatives.</p><p class=\"\">Advanced Micro Devices posted fourth-quarter adjusted earnings of $1.09 a share that edged past estimates of $1.08. Revenue was $7.7 billion, above analysts' expectations of $7.5 billion, but a jump in data-center revenue of 69% to $3.9 billion was shy of projections of $4.1 billion. The chip maker forecast first-quarter sales of $7.1 billion at the midpoint of its range versus estimates of $7 billion. AMD shares fell 8.6%.</p><p class=\"\">Apple declined 2.3% following a report from Bloomberg that said China's antitrust watchdog was considering launching a probe into the tech giant's policies and the fees it charges app developers. The State Administration for Market Regulation has been examining Apple's policies, which include taking a cut of as much as 30% on in-app spending, Bloomberg reported, citing people familiar with the matter.</p><p class=\"\">Palantir Technologies fell 1.4% in premarket trading after shares of the AI software company finished up 24% on Tuesday at a record closing high of $103.83. The stock also set an intraday record high Tuesday of $106.91 after Palantir topped Wall Street's quarterly earnings expectations.</p><p class=\"\">Snap jumped 3.9% after the parent company of Snapchat reported fourth-quarter adjusted earnings of 16 cents a share, beating Wall Street estimates by 2 cents. GAAP earnings in the quarter were 1 cent a share, a swing from a year-earlier loss of 15 cents. The company also reported better-than-expected revenue of $1.56 billion, and said global daily active users in the period were 453 million. Analysts expected of 451.1 million. Snap said it expects first-quarter revenue of $1.33 billion to $1.36 billion, up 12% from 2024 at the midpoint. Analysts were expecting $1.33 billion.</p><p class=\"\">U.S.-listed shares of Novo Nordisk rose 3.9% after the Danish drugmaker reported fourth-quarter earnings that beat analysts' expectations but forecast slower growth ahead. Novo Nordisk is the maker the widely popular weight-loss and diabetes drugs Ozempic and Wegovy.</p><p class=\"\">Amgen's fourth-quarter adjusted earnings of $5.31 a share topped expectations of $5.08 as revenue in the period rose 11% to $9.09 billion. The biotechnology company said 10 products delivered at least double-digit sales growth in the period. The stock was down 1.4%.</p><p class=\"\">Shares of Alibaba listed in the U.S. fell 2.4%, JD.com declined 3%, and PDD Holdings slumped 5.7% as the Chinese e-commerce stocks took a hit from plans by the U.S. Postal Service to stop accepting parcels from China and Hong Kong.</p><p class=\"\">Chipotle Mexican Grill was down 6.7% in premarket trading after the fast-casual restaurant chain posted solid fourth-quarter earnings but revenue of $2.8 billion missed analysts' expectations of $2.85 billion. Chipotle also reduced its fiscal year same-store sales outlook to an increase in the low to mid-single digits.</p><p class=\"\">Enphase Energy said it anticipates first-quarter sales of between $340 million and $380 million, compared with analysts' consensus of $338 million. Shares of the solar-power company rose 5.4%.</p><p class=\"\">Mattel surged 15% after the toy maker reported adjusted earnings of 35 cents a share in the fourth quarter on revenue of $1.65 billion, topping analysts' estimates on both metrics, and said it expects adjusted earnings of $1.66 to $1.72 a share in 2025, higher than estimates of $1.57.</p><p class=\"\">Earnings reports are expected Wednesday from Walt Disney, Qualcomm, Ford Motor, Uber Technologies, Arm Holdings, and MicroStrategy.</p><p class=\"\">Disney was down slightly in premarket trading. Wall Street expects the media and entertainment giant to report fourth-quarter earnings of $1.40 a share on total revenue of $23.9 billion, up 9% from a year earlier. Investors will be monitoring performance of Disney's experiences unit, which includes its struggling theme parks.</p><p class=\"\">Write to Joe Woelfel at  joseph.woelfel@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003091:0/",
            "pub_date": "2025-02-05 18:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0YU:0",
            "title": "Nasdaq futures lag as Alphabet, AMD slide after bleak forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Futures down: Dow 0.34%, S&amp;P 500 0.67%, Nasdaq 1.05%</li></ul></span></div><span><p class=\"\">    U.S. stock index futures dipped on Wednesday, with the Nasdaq particularly impacted as shares of Alphabet and AMD fell following subdued forecasts, while negative earnings reactions in other sectors compounded losses.</p><p class=\"\">Google-parent Alphabet  dropped 7.5% in premarket trading after posting a deceleration in cloud revenue growth, missing analysts' expectations.</p><p class=\"\">The company also said it would spend $75 billion on its AI buildout this year, 29% higher than Wall Street expected.</p><p class=\"\">Advanced Micro Devices  lost 8.2% after Chief Executive Lisa Su said the company's data center sales - a proxy for its AI revenue - in the current quarter would be down about 7% from the just-ended quarter. </p><p class=\"\">Meanwhile, Apple  shed 2.5% after Bloomberg News reported that China's antitrust regulator was preparing for a possible investigation of the iPhone maker.</p><p class=\"\">Entertainment giant Walt Disney , ride-hailing platform Uber  and global grains merchant Bunge  are among prominent companies scheduled to report earnings before markets open. </p><p class=\"\">At 04:49 a.m. ET, Dow E-minis  were down 153 points, or 0.34%, S&amp;P 500 E-minis  were down 40.5 points, or 0.67%, and Nasdaq 100 E-minis  were down 227.5 points, or 1.05%.</p><p class=\"\">All three major Wall Street indexes closed higher on Tuesday, with energy shares outperforming, while an earnings-driven move in Palantir  spurred gains in technology shares. </p><p class=\"\">A January private payrolls reading is due at 8:15 a.m. ET, while a survey on U.S. services activity for the month is due shortly after the open.</p><p class=\"\">The all-important January nonfarm payrolls report is expected to be released on Friday.</p><p class=\"\">Markets also looked for developments on the tariffs front. U.S. President Donald Trump said on Tuesday that he was in no hurry to speak to Chinese President Xi Jinping to try to defuse a new trade war between the countries, sparked by sweeping 10% U.S. tariffs on all Chinese imports.</p><p class=\"\">Many analysts have noted that Trump's tariffs could raise domestic inflation, with markets continuing to price in fewer interest-rate cuts by the U.S. Federal Reserve this year. </p><p class=\"\">However, markets appeared to shrug off Trump's controversial statement that the United States would take over war-ravaged Gaza and create a \"Riviera of the Middle East\" after resettling Palestinians elsewhere.</p><p class=\"\">Fed Vice Chair Philip Jefferson as well as San Francisco Fed President Mary Daly commented on Tuesday, reiterating the  central bank's message that policymakers needn't rush into their next rate cut.</p><p class=\"\">Comments from four Fed heads including Richmond Fed President Thomas Barkin will be on the radar through the day.</p><p class=\"\">In other moves, FMC Corp  plunged 20.7% after the agrichemicals producer forecast first-quarter revenue below estimates.</p><p class=\"\">Chipotle Mexican Grill  slid 6.8% after the burrito maker forecast tepid annual comparable sales growth and said that if Trump's proposed tariffs against Mexico went into full effect, the company would take a roughly 60-basis-point impact on its raw material costs this year.</p><p class=\"\">Tinder-parent Match Group  tumbled 8.9% after it forecast annual revenue below Wall Street estimates.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0YU:0-nasdaq-futures-lag-as-alphabet-amd-slide-after-bleak-forecasts/",
            "pub_date": "2025-02-05 18:34:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003248:0",
            "title": "European Midday Briefing: Investors Await Trump-Xi Talks as Geopolitical Uncertainties Linger",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET WRAPS</p><p class=\"\">Stocks:</p><p class=\"\">European stocks slipped on Wednesday as geopolitical uncertainty lingered, and investors awaited talks between Donald Trump and Xi Jinping as the countries levy tariffs on one another.</p><p class=\"\">\"On the equities front, sentiment is much less cheery this morning as Google and AMD results released after the bell didn't enchant investors, \" Swissquote Bank said.</p><p class=\"\">Meanwhile, safe havens remain in demand on growing global uncertainties under Trump's \"hectic lead,\" Swissquote added.</p><p class=\"\">Capital.com said the FTSE 100 could rise to a new all-time high if the Bank of England signals additional future interest-rate cuts during Thursday's rate decision.</p><p class=\"\">\"A BOE rate cut could renew investor interest in U.K. stocks.\"</p><p class=\"\">U.S. Markets:</p><p class=\"\">Stock futures were falling after Google parent Alphabet reported quarterly revenue that missed expectations.</p><p class=\"\">On the economic data front, the focus will be on U.S. ADP private payrolls at 1315 GMT and U.S. ISM services at 1500 GMT.</p><p class=\"\">Stocks to Watch</p><p class=\"\">Advanced Micro Devices posted a big jump in revenue in its data-center business, but the results undershot analysts' rosy forecasts. AMD shares fell 9% ahead of the opening bell.</p><p class=\"\">A slowdown in cloud-computing sales dragged down Google's revenue growth last quarter. Its stock slid more than 7% ahead of the open.</p><p class=\"\">Forex:</p><p class=\"\">The euro's gains will likely prove limited as it remains broadly unattractive given weak macroeconomic fundamentals and Trump's threats to impose tariffs on the EU, ING said.</p><p class=\"\">Wide eurozone-U.S. interest rate differentials in favor of the dollar reflect these factors, it said.</p><p class=\"\">Trade news will dominate euro price action, although it will be interesting to hear whether the unexpected acceleration in January eurozone inflation triggers some change in the narrative from European Central Bank members.</p><p class=\"\">The ECB's chief economist, Philip Lane, is due to speak at 1400 GMT in Washington, DC.</p><p class=\"\">The dollar continued to trade at softer levels after Tuesday's data showed U.S. job openings fell in December.</p><p class=\"\">The data hints at less pressure on wage growth and potentially more supportive Federal Reserve policy, Swissquote Bank said.</p><p class=\"\">Traders will now turn their focus to ADP data and the ISM services report.</p><p class=\"\">Bonds:</p><p class=\"\">German Bunds are running into resistance ahead of the yield lows of the year, but shaky risk sentiment and a sanguine ECB wage tracker should keep the momentum going, Commerzbank Research said.</p><p class=\"\">\"With the ongoing focus on trade wars and fragile risk sentiment we expect Bunds to stay bid.\"</p><p class=\"\">That said, the air is getting thinner for Bunds as yields are approaching the lows recorded in the initial sessions of the year. In addition, risk-off once again turns out to not be self-reinforcing, with equities stuck at the highs, Commerzbank said.</p><p class=\"\">The 10-year French-Spanish government bond yield spread is gradually nearing the 5 basis point threshold, signalling improving sentiment over France, Natixis said.</p><p class=\"\">The spread hasn't reached this level since last November, it said, describing it as \"a sign that investor perception of France is less pessimistic than before.\"</p><p class=\"\">Energy:</p><p class=\"\">Oil prices edged lower in early trade despite Trump ramping up pressure on Iran.</p><p class=\"\">Trump signed a directive restoring his \"maximum pressure\" campaign on Tehran with the aim to stop the country from obtaining a nuclear weapon. Stricter enforcement of sanctions could put as much as 1 million barrels a day of oil supply at risk, according to ING.</p><p class=\"\">\"However, reduced flows from Iran will not help in lowering oil prices, something that President Trump is very keen to achieve,\" it said.</p><p class=\"\">\"He would need to see OPEC increase oil output to offset any potential Iranian losses.\"</p><p class=\"\">Prices are pressured by fears that a trade war between the U.S. and China could hurt global growth and increase inflationary pressures, damping demand for crude.</p><p class=\"\">Metals:</p><p class=\"\">Gold futures rose to a fresh record for the fifth consecutive session on geopolitical uncertainty.</p><p class=\"\">Safe-haven assets continued to see increased demand on growing global uncertainties under Trump's hectic lead, with the prospects that the first weeks of the administration are just a foretaste of what is to come over the next four years, Swissquote Bank said.</p><p class=\"\">Gold is the best hedge for protecting a portfolio from Trump worries, Swissquote said.</p><p class=\"\">More international relations chaos means greater demand--especially from central banks looking to reduce U.S. exposure should Trump turn his focus on their countries, it said.</p><p class=\"\">\"At this pace, Trump makes $3,000 look like an easy target.\"</p><p class=\"\">Pepperstone said gold is mounting a notable bullish rally, fueled by market uncertainty.</p><p class=\"\">Although the USD index initially strengthened earlier in the week, posing a headwind for gold, its retracement helped revive buying interest in the precious metal.</p><p class=\"\">From a technical perspective, gold is testing resistance that could trigger some profit-taking but the broader trend remains supported by hedging activities amid an uncertainty, Pepperstone said.</p><p class=\"\">It sees scope for new record peaks if the risk landscape persists.</p><p class=\"\">EMEA HEADLINES</p><p class=\"\">Novo Nordisk Expects Slowing Sales Growth This Year</p><p class=\"\">Novo Nordisk expects sales growth to slow this year as capacity constraints, intensifying competition and pricing pressure drag on sales of its blockbuster weight-loss and diabetes drugs.</p><p class=\"\">The Danish pharmaceutical giant expects overall sales growth of between 16% and 24% in constant exchange rates this year, shy of the 26% it achieved in 2024.</p><p class=\"\">TotalEnergies Plans $2 Billion Quarterly Buyback After Earnings Jump Sequentially</p><p class=\"\">TotalEnergies set out a $2 billion quarterly share buyback target for 2025 after net profit jumped on higher gas prices and increased refining margins.</p><p class=\"\">The French oil and gas company reported a fourth-quarter net profit of $3.96 billion, up 72% on the prior quarter after strong earnings in its integrated LNG and integrated power divisions. Despite this, it missed the $4.21 billion analysts had expected according to a Visible Alpha consensus.</p><p class=\"\">Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</p><p class=\"\">Banco Santander said it plans to buy back 10 billion euros ($10.38 billion) of its own stock after it reported fourth-quarter results that exceeded expectations both at the top and bottom lines.</p><p class=\"\">Spain's biggest bank by assets became the latest in Europe to outline plans for bumper returns to shareholders. Lenders took steps to clean up their balance sheets and restore profitability amid high interest rates in recent years and have continued to hand money back to shareholders even as central banks moved to lower rates.</p><p class=\"\">GSK Issues $2.5 Billion Buyback, Raises Midterm Outlook After Beating Market Views</p><p class=\"\">GSK plans to buy back $2.50 billion in shares and raised its midterm sales target, citing promising pipeline developments.</p><p class=\"\">The British pharmaceutical giant said Wednesday that the 2.0 billion-pound share buyback will be implemented over the next 18 months.</p><p class=\"\">French Industry Ends 2024 in the Doldrums</p><p class=\"\">French factory production unexpectedly dropped at the end of the year, contributing to a backsliding in the eurozone's second-largest economy, with few signs of a rapid rebound at the start of 2025.</p><p class=\"\">Total output of goods was 0.7% lower on month in December, reversing a slight increase in November, statistics agency Insee said Wednesday. That was a worse result than the stagnation forecast by economists, according to a poll compiled by The Wall Street Journal, and means output decreased in seven out of 12 months last year.</p><p class=\"\">GLOBAL NEWS</p><p class=\"\">Morgan Stanley's finally given up on the idea the Fed will cut in March. What went wrong.</p><p class=\"\">Morgan Stanley has now given up on its contrarian stance the Federal Reserve will cut interest rates in March.</p><p class=\"\">It was an idea the firm held onto even after Fed Chair Jerome Powell's last press conference, when he made clear the central bank was in no hurry to cut interest rates.</p><p class=\"\">The bond market is signaling two things about Trump's second term</p><p class=\"\">President Trump's trade-war tactics have been tough for investors to parse, especially as stocks zigzagged to start the week amid mixed messages from the bond market.</p><p class=\"\">Shorter 2-year Treasurys yields BX:TMUBMUSD02Y on Tuesday were near 4.21%, only slightly below their 200-day moving average, according to FactSet data. Longer 10-year yields BX:TMUBMUSD10Ywere closer to 4.51%, far above their average for the same time frame.</p><p class=\"\">Mideast Power Saudi Arabia Rejects Trump Proposal to Take Over Gaza</p><p class=\"\">DUBAI-Saudi Arabia on Wednesday dismissed a proposal by President Trump for the U.S. to take control of Gaza and for Palestinians to permanently leave the strip, an idea likely to be also rejected by other Arab nations.</p><p class=\"\">The kingdom said its commitment to a Palestinian state in Gaza and the West Bank was \"firm and unwavering,\" and that Riyadh wouldn't establish diplomatic relations with Israel without that goal. \"Achieving lasting and just peace is impossible without the Palestinian people obtaining their legitimate rights,\" Saudi Arabia's Foreign Ministry said.</p><p class=\"\">Trump Campaigned on Ending Foreign Entanglements. Now He Wants to Own Gaza.</p><p class=\"\">WASHINGTON-President Trump campaigned on shrinking America's role abroad. But since taking office, he has articulated a worldview that is at times closer to expansionism than isolationism.</p><p class=\"\">Trump generated global shock waves Tuesday when he said the U.S. should take long-term control of Gaza, suggesting that Palestinians should be relocated while the enclave is rebuilt into the \"Riviera of the Middle East.\" Secretary of State Marco Rubio wrote on social media that Trump would \"Make Gaza Beautiful Again.\"</p><p class=\"\">Write to ina.kreutz@wsj.com</p><p class=\"\">Write to us at newsletters@dowjones.com</p><p class=\"\">We offer an enhanced version of this briefing that is optimized for viewing on mobile devices and sent directly to your email inbox. If you would like to sign up, please go to https://newsplus.wsj.com/subscriptions.</p><p class=\"\">This article is a text version of a Wall Street Journal newsletter published earlier today.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003248:0/",
            "pub_date": "2025-02-05 18:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463948:0",
            "title": "Daikin Industries' Nine-Month Profit Slides 4%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Daikin Industries  reported a 3.7% year-on-year decline in profit attributable to owners at 186.7 billion yen in the fiscal nine months ended Dec. 31, 2024, from 193.9 billion a year ago. </p><p class=\"\">The air conditioner manufacturer's earnings per share fell to 637.28 yen from 661.77 yen a year earlier, according to a Tokyo Stock Exchange filing on Wednesday. </p><p class=\"\">Net sales rose 10.1% to 3.593 trillion from 3.263 trillion a year earlier. </p><p class=\"\">For the fiscal year ending March 31, 2025, the company expects an attributable profit of 267 billion yen, or 912.01 yen per share, with net sales of 4.77 trillion yen. </p><p class=\"\">The company plans to pay a final dividend of 135 yen per share, bringing the total annual dividend to 320 yen per share.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463948:0/",
            "pub_date": "2025-02-05 18:34:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0EB:0",
            "title": "Santander Brasil's net profit surges 75% in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Santander Brasil  a subsidiary of Spain's Banco Santander , reported on Wednesday a 75% jump in its fourth-quarter net profit, surpassing market expectations on the back of better spreads and increased fees.</p><p class=\"\">    The lender said in a securities filing that net profit totaled 3.85 billion reais ($668.62 million) in the October-December quarter, above the 3.72 billion forecast by analysts polled by LSEG.</p><p class=\"\">\"The Q4 earnings reflect the delivery of our strategy, showing positive revenue performance and consistent growth in client net interest income (NII),\" Chief Executive Mario Leao said, highlighting the \"diversification of our portfolio.\"</p><p class=\"\">    Santander, typically the first major private lender in Brazil to publish quarterly results, sets the stage for its peers, including Itau Unibanco  and Bradesco .  </p><p class=\"\">    Latin America's largest country is a key market for the lender's     Spanish parent    , which earlier on Wednesday announced 10 billion euros ($10.42 billion) in share buybacks after notching record profits helped by its retail business in Brazil.  </p><p class=\"\">    Santander Brasil's NII - earnings on loans minus deposit costs - rose 16% in the fourth quarter to 15.98 billion reais, while its return on average equity (ROAE), a gauge of profitability, was up 5.3 percentage points to 17.6%.  </p><p class=\"\">    \"We are ready to move forward with our ROAE evolution with a disciplined approach to capital allocation,\" Leao said.  </p><p class=\"\">    The bank's allowance for loan losses dropped 13.2% on a yearly basis to 5.93 billion reais, which Leao said was \"within expected levels,\" while its expanded loan portfolio rose 6.2% to 682.7 billion reais.  </p><p class=\"\">($1 = 5.7581 reais)</p><p class=\"\">($1 = 0.9600 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0EB:0-santander-brasil-s-net-profit-surges-75-in-q4/",
            "pub_date": "2025-02-05 18:34:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463949:0",
            "title": "Deputy CEO Says Credit Agricole to Defend Interests, Continue to Grow in Italy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Deputy Chief Executive Officer Jérôme Grivet said Crédit Agricole  will \"defend [its] interests\" in Italy as the French bank continues to grow in the country. </p><p class=\"\">The executive also noted \"different options\" for Crédit Agricole, Bloomberg News reported Wednesday citing an interview with Grimet. </p><p class=\"\">In December 2024, the French group raised its stake in its Italian partner Banco BPM (BAMI.MI) to 15.1%, a month after UniCredit (UCG.MI) launched a surprise 10.1 billion-euro offer for BPM.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463949:0/",
            "pub_date": "2025-02-05 18:34:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1GI:0",
            "title": "JSW Steel Gets Tax Demand Order For 146.8 Mln Rupees, Penalty Of 146.8 Mln Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JSW Steel Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">GETS TAX DEMAND ORDER FOR 146.8 MILLION RUPEES, PENALTY OF 146.8 MILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1GI:0-jsw-steel-gets-tax-demand-order-for-146-8-mln-rupees-penalty-of-146-8-mln-rupees/",
            "pub_date": "2025-02-05 18:34:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003262:0",
            "title": "Bangkok Closing Stock Prices",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">Prices in baht <br/> <br/>                                 Close      Prior     Change   % Change <br/>  Advanced Info Service         281.00     279.00      +2.00      +0.72 <br/>  Bangkok Bank                  153.00     153.00       unch       unch <br/>  Bank of Ayudhya                23.40      23.50      -0.10      -0.43 <br/>  BEC World                       4.00       4.02      -0.02      -0.50 <br/>  CP Axtra                       25.50      26.00      -0.50      -1.92 <br/>  Delta Electronics             114.50     123.00      -8.50      -6.91 <br/>  Electricity Generating        103.50     104.00      -0.50      -0.48 <br/>  Hana Microelectronics          21.10      21.70      -0.60      -2.76 <br/>  Intouch Holdings               97.00      98.50      -1.50      -1.52 <br/>  Italian-Thai Development        0.43       0.43       unch       unch <br/>  Kasikornbank                  160.50     163.00      -2.50      -1.53 <br/>  Krung Thai Bank                23.40      23.30      +0.10      +0.43 <br/>  PTT Exploration               125.00     123.50      +1.50      +1.21 <br/>  SCB X                         126.50     127.00      -0.50      -0.39 <br/>  Siam Cement                   149.50     147.50      +2.00      +1.36 <br/>  Siam City Cement              160.00     160.50      -0.50      -0.31 <br/>  Thai Union Group               11.80      11.60      +0.20      +1.72 <br/>  Thanachart Capital             50.25      50.00      +0.25      +0.50 <br/>  True                           12.00      11.70      +0.30      +2.56 <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003262:0/",
            "pub_date": "2025-02-05 18:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309563:0",
            "title": "Truist Securities Adjusts Price Target on Alphabet to $220 From $225, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet  has an average rating of overweight and mean price target of $216.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309563:0/",
            "pub_date": "2025-02-05 18:35:28",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309564:0",
            "title": "JPMorgan Adjusts Price Target on Alphabet to $220 From $232, Maintains Overweight Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet  has an average rating of overweight and mean price target of $216.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309564:0/",
            "pub_date": "2025-02-05 18:35:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463955:0",
            "title": "International Housewares Retail Buys Back Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">International Housewares Retail  bought back 150,000 ordinary shares on Wednesday for HK$164,730 or at an average price of HK$1.0982 apiece, a same-day bourse filing said. </p><p class=\"\">The shares represent roughly 0.0207% of the housewares retail company's issued share capital. </p><p class=\"\">The company will cancel the repurchased shares.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463955:0/",
            "pub_date": "2025-02-05 18:35:44",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003184:0",
            "title": "Source Capital Responds to 180 Degree Capital Corp.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Source Capital Responds to 180 Degree Capital Corp.</p><p class=\"\">LOS ANGELES--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Source Capital , a closed-end fund (\"Source\"), is disappointed that the Board of Directors of 180 Degree Capital Corp.  (\"TURN\") quickly rejected Source's non-binding initial proposal in three business days without any dialogue with Source to reach an agreement that would maximize value for all TURN shareholders.</p><p class=\"\">The market reacted positively to Source's proposal, and at least one of TURN's large shareholders has publicly urged TURN to engage with Source.</p><p class=\"\">Source remains committed to a potential merger and hopes to work constructively with TURN's Board of Directors.</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">Certain statements contained in this letter are forward-looking and/or based on current expectations, projections, and information currently available. Future events or results may vary significantly from those expressed and are subject to change at any time in response to changing circumstances and industry developments. The information and data contained herein has been prepared from public sources believed reliable. We disclaim any obligation to update or alter any forward-looking statements, whether as a result of new information, future events, or otherwise.</p><p class=\"\">Important Information and Where to Find it</p><p class=\"\">If the proposed transaction is fully negotiated in a mutually acceptable form, Source intends to file with the SEC on Form N-14 and mail to TURN's shareholders a joint proxy statement/prospectus (the \"Joint Proxy Statement\"), which would serve as a proxy statement for TURN and a registration statement for Source. The Joint Proxy Statement would contain important information about Source, TURN, the merger and related matters. This letter does not constitute an offer to sell or the solicitation of an offer to buy any securities or a solicitation of any vote or approval. No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended. IF THE TRANSACTION PROCEEDS, SHAREHOLDERS OF TURN ARE URGED TO READ THE JOINT PROXY STATEMENT AND OTHER DOCUMENTS THAT MAY BE FILED WITH THE SEC AS WELL AS ANY AMENDMENTS OR SUPPLEMENTS TO THESE DOCUMENTS CAREFULLY AND IN THEIR ENTIRETY WHEN OR IF THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT SOURCE, TURN, THE MERGE AND RELATED MATTERS. Investors and security holders will be able to obtain the documentation filed with the SEC free of charge at the SEC's website, http://www.sec.gov or by directing a request to:</p><p class=\"\">C/O UMB FUND SERVICES, INC.</p><p class=\"\">235 WEST GALENA STREET</p><p class=\"\">MILWAUKEE, WISCONSIN 53212</p><p class=\"\">Participation in the Solicitation</p><p class=\"\">Source, its trustees, certain of its executive officers and certain employees and officers of FPA may be deemed to be participants in the solicitation of proxies in connection with the merger. Information about Source, its trustees, certain of its executive officers and certain employees and officers of FPA will, if an agreement is reached, be set forth in the Joint Proxy Statement. These documents may be obtained free of charge from the sources indicated above. None of Source, FPA, nor to FPA's knowledge, any of their respective officers, directors or trustees, owns any securities of TURN. Information regarding Source Capital's officers and trustees is available in the Section entitled \"Proposal 1--Election of the Board\" in Source's Definitive Proxy Statement on Schedule 14A, filed with the Securities and Exchange Commission on April 19, 2024. Information regarding FPA and its officers and directors is available in Schedule A to its Form ADV Part 1A.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204132571/en/</p><p class=\"\">CONTACT:</p><p class=\"\">Media: Tucker Hewes, Hewes Communications, Inc., 212-207-9451, tucker@hewescomm.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003184:0/",
            "pub_date": "2025-02-05 18:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003181:0",
            "title": "Credit Agricole's Largest Shareholder Intends to Increase Stake This Year",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Pierre Bertrand</p><p class=\"\">Credit Agricole's largest shareholder, SAS Rue La Boetie, said it intends to increase its stake in the French bank this year, but that it doesn't plan to increase its holding beyond 65%.</p><p class=\"\">The holding company said Wednesday that it was planning to buy Credit Agricole shares for a maximum of 500 million euros ($519 million) by the end of the third quarter.</p><p class=\"\">SAS Rue La Boetie is owned by Credit Agricole's regional banks. It currently holds 62.7% of the bank's share capital.</p><p class=\"\">Write to Pierre Bertrand at pierre.bertrand@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003181:0/",
            "pub_date": "2025-02-05 18:29:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463946:0",
            "title": "Singapore's Manufacturing Activity Contracts in January Due to COVID-19 Effect, S&P Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A private reading said Singapore's manufacturing activity contracted in January as the spread of COVID-19 left an adverse impact on the private sector. </p><p class=\"\">The headline seasonally adjusted S&amp;P Global Singapore Purchasing Manager's Index or PMI fell to 49.9 from 51.5 in December 2024. The current PMI is a few points short of the 50 reading, which marks that the sector is in expansion, S&amp;P Global said in a Wednesday press release. </p><p class=\"\">The spread of the virus, according to panelists' anecdotal evidence, ended the two-year expansion of both new business and business activity segments, according to the essential intelligence firm's report. </p><p class=\"\">Optimism also soured in January as firms raised concerns about the impact of COVID-19 on future business activity. Employment also declined amid the drop in new orders, S&amp;P Global said. </p><p class=\"\">\"These effects should hopefully prove temporary, however, and underlying demand should be resilient enough to see a swift bounce-back in the months ahead once the virus is brought back under control,\" S&amp;P Global Market Intelligence Economics Director Andrew Harker said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463946:0/",
            "pub_date": "2025-02-05 18:29:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0WF:0",
            "title": "Britain's FTSE 100 dips marginally ahead of BoE rate decision",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">FTSE 100 flat, FTSE 250 down 0.3%</li></ul></span></div><span><p class=\"\">    British stocks were set to fall for the third straight session on Wednesday, as a stronger pound put pressure on the export-heavy index, while caution prevailed ahead of the Bank of England's rate decision. </p><p class=\"\">The FTSE 100 <!-- -->CURRENCYCOM:UK100<!-- --> edged marginally lower at 8,565.73 by 10:05 GMT, while the domestically focussed mid-cap FTSE 250 (.FTMC) lost 0.3%. Both indexes were set to fall for a third straight session.</p><p class=\"\">A domestically stronger currency , which rose 0.3% to approach a near one-month high, weighed on the export-heavy FTSE 100 index.</p><p class=\"\">Keeping losses in check was the healthcare sector (.FTNMX201030) that rose 1.1%, boosted by a 5.5% gain in GSK  after the drugmaker posted a better-than-expected fourth-quarter result. </p><p class=\"\">Meanwhile, precious metal miners (.FTNMX551030) was the top sectoral gainer, rising 2.5%, as gold prices jumped 1% to a record high. </p><p class=\"\">Ferrexpo  extended losses from the prior session,  down 8.6%, as the miner on Tuesday said a civil claim worth 157 billion hryvnias ($3.77 billion) was filed against its Ukrainian unit.</p><p class=\"\">Grainger  on the other hand, gained 3.8% after the provider of private rental homes posted a 15% growth in total net rental income for the four-month period to January end. </p><p class=\"\">On the macro front, the Bank of England's monetary policy committee is set to convene on Thursday to take a call on interest rates, with markets having fully priced in a 25-basis-point cut.</p><p class=\"\">\"We expect the BoE to cut rates by 25bp and easing guidance will be strengthened relative to market expectations. At least one 25bp cut per quarter should be in play as growth risks remain heavily to the downside,\" said Geoff Yu, senior market strategist at BNY.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0WF:0-britain-s-ftse-100-dips-marginally-ahead-of-boe-rate-decision/",
            "pub_date": "2025-02-05 18:29:24",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463951:0",
            "title": "Cadeler Secures Two Contracts for Hanwha Ocean-Constructed Wind Mover Vessel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cadeler secured two contracts with undisclosed clients for Wind Mover, its under-construction wind installation vessel with Hanwha Ocean , the Denmark-based construction engineering company said Monday. </p><p class=\"\">The deals, valued at up to 75 million euros, will cover the vessel's operations from its European arrival post-delivery until its next scheduled project, the release said. </p><p class=\"\">Wind Mover, slated for completion in the fourth quarter at Hanwha Ocean's Korean shipyard, will support both offshore wind turbine installations and maintenance activities, it said. </p><p class=\"\">Shares of Hanwha Ocean fell more than 1% at market close on Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463951:0/",
            "pub_date": "2025-02-05 18:29:33",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463941:0",
            "title": "Syncona Portfolio Company Achilles Therapeutics to Pursue Voluntary Liquidation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Syncona  said Wednesday the board of its portfolio company Achilles Therapeutics decided to pursue a members' solvent voluntary liquidation and return capital to shareholders. </p><p class=\"\">Achilles shareholders are expected to receive between 1.20 pounds sterling and 1.32 pounds per share based on currently available information. The proposed voluntary liquidation and capital distribution are subject to the approval of shareholders at a March 20 general meeting. </p><p class=\"\">The life science investor owns 11,086,909 American depositary shares representing the same number of shares in Achilles. The holding value of the stake was 8.5 million pounds as of Sept. 30, 2024.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463941:0/",
            "pub_date": "2025-02-05 18:29:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003210:0",
            "title": "Vonovia's Earnings Should Grow Again, Berenberg Says — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vonovia's cash earnings are expected to start growing moderately again, Berenberg analyst Kai Klose says in a research note. The German property company has absorbed the high volume of property disposals since 2022 for financial deleveraging, Klose says. The analyst remains positive about the German residential property market, with Vonovia expected to benefit from the current trend in higher rents, Klose says. The company remains an attractive choice for investors due to its strong income resilience and current valuation levels, he says. Shares trade 2.1% higher at 29.79 euros. (nina.kienle@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003210:0/",
            "pub_date": "2025-02-05 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003187:0",
            "title": "Options Traders Bet the Rally in Big Tech Stocks Has More Room to Run — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Krystal Hur</p><p class=\"\">Wall Street's AI trade soured last week, but investors are still firmly clutching the playbooks that worked so well over the past two years.</p><p class=\"\">They are positioning for big technology shares to keep climbing by scooping up options contracts that would pay out if stocks such as Apple and Amazon.com race higher in the next few weeks.</p><p class=\"\">Tech stocks were throttled by the emergence of Chinese upstart DeepSeek, whose artificial-intelligence platform appears up to snuff with Silicon Valley models, despite being developed at a fraction of the cost. The shares took another hit Monday after President Trump brandished tariff threats against China, Canada and Mexico.</p><p class=\"\">Those incidents flustered traders, who for two years faithfully drove up big tech stocks, betting that cutting-edge U.S. chips put them at the forefront of the AI revolution. Shares of Nvidia, the graphics-chip maker at the heart of the frenzy, declined 17% in a single session last week, losing almost $600 billion in market value.</p><p class=\"\">Yet after both incidents, many of the big tech stocks stormed back. The Nasdaq Composite is off 2.6% from its Dec. 16 all-time high and clinging to a 1.8% advance for 2025.</p><p class=\"\">\"It seems like you can't escape this tech trade right now,\" said Brad Roth, chief investment officer of Pennsylvania-based Thor Financial Technologies.</p><p class=\"\">A slate of generally encouraging earnings results and commentary from executives reassured investors that the spending spigots are still wide open. Companies including Meta Platforms and Microsoft said the emergence of DeepSeek wouldn't deter them from ambitious investments.</p><p class=\"\">Four of the big tech stocks in the Magnificent Seven — Alphabet, Amazon, Apple and Meta — have climbed since Jan. 24, before DeepSeek spooked investors. Meta is the bright spot: Its shares have hit repeated all-time highs and are in the midst of a 12-session winning streak, their longest on record.</p><p class=\"\">Nvidia, on the other hand, has taken the hardest hit. The graphic-chip maker's stock is down 17% over the past seven sessions. Excluding Nvidia, the Magnificent Seven have gained more than $160 billion in market value over that period, according to Dow Jones Market Data. (Shares of Microsoft and Tesla have declined as well.)</p><p class=\"\">In coming days, investors will parse earnings reports from the likes of Amazon, Take-Two Interactive Software and ON Semiconductor for insights into how companies will weather sweeping policy changes under Trump. Friday's monthly jobs report will give investors their next chance to gauge the economy's strength.</p><p class=\"\">Traders have pounced on options tied to the highflying tech stocks. More than $40 billion in options contracts tied to the Magnificent Seven changed hands last week, the biggest weekly tally so far this year, according to Cboe Global Markets data. More than $26 billion was tied to call options that offer the right to buy a stock, at a set price, by a certain date.</p><p class=\"\">Call option activity tied to Meta Platforms reached its highest level since April 2024, according to Cboe, while activity tied to Microsoft hit levels not seen since July 2023.</p><p class=\"\">In recent days, some of the most actively traded Apple contracts have been calls tied to shares jumping to $245 and $250, Cboe data show. They closed Tuesday at $232.80. For Amazon, traders snapped up bets that the stock would climb to $255 and $260, up from Tuesday's close of $242.06.</p><p class=\"\">One factor behind the quick bounceback in tech stocks? Some investors are already skeptical about DeepSeek's capabilities and whether the company poses a threat to the AI trade. OpenAI said it is probing whether the company trained its chatbot using OpenAI's models, casting doubt on just how impressive DeepSeek's technology is.</p><p class=\"\">Others point out that some U.S. companies such as Meta and Apple could benefit from a cheaper large language model, or LLM, the technology underlying chatbots like ChatGPT. Some executives have cheered having broader access to AI models.</p><p class=\"\">Options activity was bullish ahead of Alphabet's earnings report Tuesday afternoon, but the company reported a slowdown in sales growth for its most recent quarter, disappointing investors.</p><p class=\"\">Rhett Zeid, a full-time trader in New Jersey, added to his pile of Tesla calls expiring in June during the tech rout last week. The 26-year-old has been a staunch Tesla bull since the pandemic, when a launch of Elon Musk-owned SpaceX's Falcon 9 rocket convinced him of the chief executive's business acumen.</p><p class=\"\">He plans to start gradually selling those calls when the stock reaches $455, a roughly 16% increase from Tuesday's close. Zeid says the emergence of DeepSeek hasn't changed his belief that the EV maker will eventually produce the fully driverless robotaxis that Musk has teased for years, making Tesla's stock the AI play \"of the century.\"</p><p class=\"\">\"I mean, it\"'s pretty much a sealed deal,\" said Zeid. \"2025 and beyond should be pretty awesome.\"</p><p class=\"\">Some analysts, though, say they expect more volatility ahead.</p><p class=\"\">One longstanding point of concern is the staggering valuations of some of the stocks. The S&amp;P 500's information-technology sector, which houses Nvidia and Apple, was recently trading at roughly 27 times its expected earnings over the next 12 months. The communication-services sector, which includes Meta and Alphabet, trades at 21 times. The broader S&amp;P 500's multiple is 22.</p><p class=\"\">Write to Krystal Hur at krystal.hur@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003187:0/",
            "pub_date": "2025-02-05 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003192:0",
            "title": "Crypto Industry Looks to New SEC Task Force for Quick Action in Its Favor — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Mengqi Sun</p><p class=\"\">Many in the cryptocurrency industry are optimistic that a new task force formed by the U.S. securities regulator will provide a road map for growth in the industry that contrasts with the regulation-by-enforcement approach under the Biden administration.</p><p class=\"\">The Securities and Exchange Commission, under acting Chairman Mark Uyeda, said on Jan. 21 it is launching a task force \"dedicated to developing a comprehensive and clear regulatory framework for crypto assets.\" Republican SEC Commissioner Hester Peirce, known among crypto enthusiasts as \"CryptoMom,\" is leading the task force. The regulator announced a few more adviser appointments to the task force on Tuesday.</p><p class=\"\">The formation of the task force, announced a day after President Trump's inauguration, was welcomed by the virtual currency industry, which has been eagerly awaiting moves by Trump to bring it greater legitimacy. Crypto policy advisers are already putting out proposals for what the SEC should first tackle under its existing jurisdiction and are hoping the regulator will act right away without waiting for Congress to pass legislation or confirm Trump's nominee for SEC chairman, Paul Atkins.</p><p class=\"\">The SEC has said the task force would set clear regulatory lines under its current jurisdiction provided by Congress, in addition to imposing enforcement actions. It would also provide paths for crypto companies to register with regulators and frameworks for what industry players would need to disclose to the government. The task force, consisting of agency staff, will also hold roundtables and solicit public input via an agency email address.</p><p class=\"\">\"There are a lot of tools that the SEC has and just hasn't been exercised in the past; this is a process that will start this conversation,\" said Kristin Smith, chief executive of crypto-advocacy group Blockchain Association.</p><p class=\"\">First steps</p><p class=\"\">Smith said the agency could do several things right away that could help companies better understand the rules of the road. These include issuing more interpretive guidance on various issues, such as when staking, a method by which some crypto networks process and validate a transaction, should be considered a security by regulators. In staking, crypto investors can essentially pledge their computing power and crypto holdings to a network for a specified period in exchange for a reward.</p><p class=\"\">The industry could also benefit from new rule-setting with comment periods allowing the public to weigh in, she said. Also, companies could be encouraged to request so-called no-action letters to the SEC in which they can ask the agency's staff to address whether a product or service would violate securities law.</p><p class=\"\">The crypto industry has criticized the approach taken by the SEC over the past four years under former Chair Gary Gensler, in which the regulator relied primarily on enforcement actions to regulate crypto retroactively and adopted legal interpretations along the way, rather than proposing rules.</p><p class=\"\">\"The result has been confusion about what is legal, which creates an environment hostile to innovation and conducive to fraud. The SEC can do better,\" the agency said in the statement announcing the task force.</p><p class=\"\">Industry response</p><p class=\"\">Some crypto companies are answering the agency's call for ideas.</p><p class=\"\">A16z Crypto, venture-capital firm Andreessen Horowitz's crypto arm, in a blog post proposed changes that the firm says the SEC can adopt \"immediately and easily\" to make crypto more accessible while providing investor protections. One thing the regulator could do, the firm suggests, is to enable traditional broker-dealers to transact in the crypto space. The firm's chief compliance officer, a co-author of the blog post, said current regulations restrict broker-dealers from engaging with crypto because they require brokers to obtain separate approvals and impose more rules on those looking to provide custody for crypto assets.</p><p class=\"\">A16z also said the SEC should develop tailored requirements for broker-dealers to register to deal in crypto assets and establish oversight mechanisms to ensure compliance with anti-money-laundering rules. The SEC can also work with industry groups, such as the Financial Industry Regulatory Authority, to issue joint guidance on the operational risks related to crypto, the firm said.</p><p class=\"\">J.W. Verret, a securities law and forensic accounting professor at George Mason University who has served on the SEC investor advisory committee, hopes the SEC can also issue guidance on defining what qualifies as a security.</p><p class=\"\">He added that the regulator could also adopt a private offering exemption, similar to an existing exemption used often by venture-capital firms investing in Silicon Valley startups. Verret said that could be a way to implement Peirce's \"safe harbor\" idea of giving a grace period from certain securities law requirements to decentralized network developers. He said the proposed exemption would allow investors to back decentralized crypto projects, or those without a central company running the project.</p><p class=\"\">Verret is optimistic that the SEC is listening to the crypto community, even as debate over how to regulate the industry continues.</p><p class=\"\">\"The ethos of crypto is to embrace debate — that is the strength of crypto, and having these open forums at the SEC would be a great thing. It would be helpful to the SEC and to the community,\" he said.</p><p class=\"\">Write to Mengqi Sun at mengqi.sun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003192:0/",
            "pub_date": "2025-02-05 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003189:0",
            "title": "A Hot New Label for Luxury Brands to Consider: Made in America — Heard on the Street — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Carol Ryan</p><p class=\"\">Would a Birkin handbag be less appealing if it was made in Paris, Texas, rather than the French capital?</p><p class=\"\">Most luxury brands have clung tightly to their European manufacturing base, but a move stateside will make more sense if a trade war erupts.</p><p class=\"\">President Trump has threatened to put higher import duties on European goods to close the U.S. trade deficit with the European Union. There is still no detail about how high any tariffs might be, or whether they would target only certain products such as German cars. But Europe's luxury-goods companies risk getting caught in the crosshairs, just as the American market becomes increasingly important for the industry.</p><p class=\"\">Designer brands could deal with tariffs in a couple of ways. One option is to charge their customers more. But this strategy would be tricky to pull off now, as the luxury industry has developed a reputation for price gouging. LVMH founder Bernard Arnault said on the company's latest earnings call that customers feel \"ripped off\" after luxury brands raised prices aggressively in recent years.</p><p class=\"\">It is also not a great time to ask American consumers for more money, as demand is fragile. After 10 consecutive quarters of shrinking, U.S. luxury spending showed signs of improvement at the end of last year, based on credit-card data from Bank of America. Brands hope that improving demand from U.S. shoppers will eventually offset weak sales to Chinese consumers, and won't want to do anything that might upset the recovery.</p><p class=\"\">Moving some manufacturing stateside would allow brands to avoid tariffs altogether. Luxury companies might even save money in the long term — energy is much cheaper in the U.S. than in Europe and subsidies are available in some states to build factories that provide local jobs.</p><p class=\"\">Luxury brands already do plenty of outsourcing, but it tends to happen nearby. According to consulting firm Bain, around 55% of global luxury goods are produced in Italy, mainly by independent factories that take on work for big brands.</p><p class=\"\">The \"Made in Italy\" or \"Made in France\" labels on expensive handbags and clothing do increase their appeal to some consumers. And certain luxury goods can't be manufactured elsewhere as they are tied to a specific region. Champagne production must happen in northeast France, Swiss watch manufacturing in Switzerland.</p><p class=\"\">But mass-market luxury brands such as Gucci or Prada are a bit more footloose. Moncler, the maker of $3,000 Puffer jackets, manufactures in low-cost Romania. This hasn't dented its appeal, says Bernstein luxury analyst Luca Solca. Once a luxury brand operates the factory itself and keeps standards high, its customers are less likely to react badly to production in a new country.</p><p class=\"\">Manufacturing outside Europe hasn't harmed LVMH-owned Louis Vuitton either. The brand already has three large factories in America that produce handbags for the local market. These purses carry a \"made in U.S.A. of imported materials\" label and shoppers don't seem to mind. Louis Vuitton ranked as Americans' favorite luxury brand in the latest UBS consumer survey.</p><p class=\"\">LVMH's Arnault said the company might move even more production to the U.S. in the future. Tax increases in France, coupled with the threat of tariffs, make producing in America more appealing. It is also good business considering LVMH makes a quarter of its sales in the U.S. these days.</p><p class=\"\">Certain labels are prized by consumers precisely because their goods are handmade in Europe — that means Hermès probably won't be relocating to Texas any time soon. But for brands a little lower in the luxury hierarchy, American factories could turn out to be a smart defense in a more protectionist global economy.</p><p class=\"\">Write to Carol Ryan at carol.ryan@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003189:0/",
            "pub_date": "2025-02-05 18:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obi1Xt6pa:0",
            "title": "NRC Group ASA - Invitation to presentation of Q4 and full year 2024 results",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NRC Group ASA will release its financial results for the fourth quarter 2024onWednesday, 12 February, at 07:00 a.m. (CET).</p><p class=\"\">CEO Anders Gustafsson and CFO Åsgeir Nord will present the results at 10:30 am(CET) at House of Oslo, Ruseløkkveien 34, Oslo.</p><p class=\"\">The presentation will also be webcast live on the following link:</p><p class=\"\">https://channel.royalcast.com/landingpage/hegnarmedia/20250212_10/</p><p class=\"\">The presentation will be followed by a live Q&amp;A-session. Investors, analystsandjournalists are welcome to participate at House of Oslo or follow thepresentation digitally, where questions can be submitted during the event.</p><p class=\"\">The financial report and presentation will be made available under thecompany'sticker \"NRC\" on www.newsweb.no and on the company's homepage:www.nrcgroup.com.</p><p class=\"\">This information is subject to the disclosure requirements pursuant to section5-12 of the Norwegian Securities Trading Act.</p><p class=\"\">https://newsweb.oslobors.no/message/637758</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obi1Xt6pa:0-nrc-group-asa-invitation-to-presentation-of-q4-and-full-year-2024-results/",
            "pub_date": "2025-02-05 18:30:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309567:0",
            "title": "China Considers Probe Into Apple Policies, Fees, Bloomberg Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309567:0/",
            "pub_date": "2025-02-05 18:30:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX5RLl1J:0",
            "title": "Aerospike 8 Delivers The First Real-Time Distributed ACID Transaction Database With High Performance at Scale",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MOUNTAIN VIEW, Calif., Feb.  05, 2025  (GLOBE NEWSWIRE) — Aerospike, Inc. (“Aerospike”), today unveiled Database 8, a major upgrade of its flagship multi-model distributed database. Version 8 adds distributed ACID transactions to support large-scale online transaction processing (OLTP) applications. Building on its enterprise-grade operations and best-in-class efficiency, Aerospike 8 is the first real-time distributed database to guarantee strict serializability of ACID transactions with industry-leading performance and efficiency at a fraction of the cost of other systems.</p><p class=\"\">For industries and applications like banking, e-commerce, inventory management, healthcare, order processing and telecom — or any digital business requiring mission-critical transactional workloads — reliable, consistent, and scalable distributed OLTP systems are non-negotiable. Yet, legacy databases have struggled to deliver.</p><p class=\"\">For nearly a decade, Aerospike has set the standard in strong consistency for single-record requests, achieving millions of transactions per second (TPS) with sub-millisecond latency, whether at gigabytes or petabytes of data. Aerospike Database 8 expands data consistency guarantees with strict serializability (the highest-level guarantee) to distributed multi-object transactions with low latency, even while serving massive concurrent connections.</p><p class=\"\">Now, businesses can achieve the most stringent level of guarantees, eliminating inconsistencies that can lead to costly errors while benefitting from real-time performance. Since Aerospike requires a fraction of the hardware resources of other databases, enterprises benefit from both substantial operational cost savings and the opportunity to embrace new environmental sustainability goals.</p><p class=\"\">“Aerospike has always been a transaction powerhouse, with customers scaling to hundreds of millions of TPS on massive amounts of data,” said Subbu Iyer, CEO of Aerospike. “With 8.0, Aerospike has solved one of the most challenging problems in distributed systems so that enterprises can break free from the decades-old trade-off between transactional consistency and high performance — and scale mission-critical applications without compromise.”</p><p class=\"\">Building Powerful, Scalable OLTP Applications Has Never Been Easier</p><p class=\"\">Aerospike’s distributed transaction support simplifies OLTP development by moving the burden of building and maintaining transaction management logic from the application to the database. Developers get Aerospike's intuitive transaction APIs to speed and simplify development. Spring developers can immediately write to the same Spring Data transaction APIs they are used to, and Java developers can code to the standard Spring Framework transaction management APIs without any knowledge of Aerospike internal processes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Aerospike Multi-model Database Advantage</strong></p><p class=\"\">Aerospike’s multi-model database engine (supporting document, key-value, graph, and vector data types) also significantly reduces development and operational complexity. Developers can choose the best data model for each specific use case, reducing overhead and enhancing agility.</p><p class=\"\">The Aerospike multi-model database can be deployed on premises and on all major public clouds, giving developers and operators the flexibility needed to deploy real-time applications wherever and however they like, including in hybrid environments.</p><p class=\"\">Try Aerospike Database 8. For a full technical overview and list of new and notable features, please visit our technical blog and register to attend our webinar on understanding high-throughput transactions at scale.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aerospike</strong></p><p class=\"\">Aerospike is the real-time database built for infinite scale, speed, and savings. Our customers are ready for what’s next with the lowest latency and the highest throughput data platform. Cloud- and AI-forward, we empower leading organizations like Adobe, Airtel, Criteo, DBS Bank, Experian, Flipkart, PayPal, Snap, and Sony Interactive Entertainment. Headquartered in Mountain View, California, our offices include London, Bangalore, and Tel Aviv.</p><p class=\"\">Aerospike® is a registered trademark of Aerospike, Inc.</p><p class=\"\">Contact:</p><p class=\"\">John Moran</p><p class=\"\">Look Left Marketing</p><p class=\"\">aerospike@lookleftmarketing.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX5RLl1J:0-aerospike-8-delivers-the-first-real-time-distributed-acid-transaction-database-with-high-performance-at-scale/",
            "pub_date": "2025-02-05 18:30:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463940:0",
            "title": "Veolia, Mistral AI Sign Deal for AI Technologies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Veolia Environnement  said Wednesday it will collaborate with Mistral AI for generative artificial intelligence technologies. </p><p class=\"\">Under the partnership deal, the French waste and water management company will integrate Mistral AI's Large Language Model with its data and knowledge base to monitor its industrial sites for water management.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463940:0/",
            "pub_date": "2025-02-05 18:21:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446727:0",
            "title": "South African Rand Strengthens Slightly",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The South African rand strengthened slightly to around 18.6 per USD, supported by a weaker dollar and anticipation of President Cyril Ramaphosa's upcoming \"State of the Nation Address.</p><p class=\"\">This will be his first address under the coalition government (GNU) and comes at a critical conjuncture, with investors eagerly awaiting insights on reforms and political discipline.</p><p class=\"\">While the country’s 2% growth forecast offers cautious optimism, progress remains fragile due to structural unemployment, resumed load-shedding, and weak governance.</p><p class=\"\">The new US administration and its unpredictable economic policies have further intensified global uncertainties, adding to the challenges.</p><p class=\"\">Meanwhile, South Africa’s central bank lowered its benchmark interest rate by 25 basis points to 7.5%, marking the third consecutive rate cut and signaling a cautious approach to monetary easing, balancing low inflation with external economic risks.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446727:0-south-african-rand-strengthens-slightly/",
            "pub_date": "2025-02-05 18:21:36",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003152:0",
            "title": "Stocks Have Weathered DeepSeek and Tariffs. Market Resilience Is Being Tested. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Brian Swint</p><p class=\"\">Stocks have been dealt two major shocks in the past two weeks — the DeepSeek threat and President Donald Trump's tariffs saga. And yet they've powered on, still trading close to record highs.</p><p class=\"\">Of course, none of the issues that have put markets on edge have gone away. But the quick recovery from what could be serious scares shows that traders are an optimistic bunch--and it's hopefully a good sign for the rally that is now into its third year.</p><p class=\"\">After a 0.7% rally Tuesday, the S&amp;P 500 closed just 1.3% off its record high set last month. The Nasdaq jumped 2.4% yesterday to finish within 3% of its high set in December. The market's resilience looks likely to be tested Wednesday, though, as stock futures fell ahead of the open after earnings from Alphabet and Advanced Micro Devices.</p><p class=\"\">Last week, the news that Chinese startup DeepSeek was able to develop artificial intelligence models — apparently at a fraction of the price of U.S. counterparts — sent a jolt through the technology sector, but it quickly recovered. This week, President Donald Trump's announcement of tariffs on Mexico, Canada, and China, sent shockwaves through the market, at least until some of them were delayed.</p><p class=\"\">There are plenty of other bad things to pay attention to, if you want to look more closely. Stocks, especially Big Tech, are trading on historically high multiples. The Federal Reserve, spooked by sticky inflation, may not be able to lower interest rates much more. And Trump continues to overwhelm anyone trying to keep up with a whirlwind of new initiatives, the latest being his proposal to take over Gaza.</p><p class=\"\">But it's also worth making a list of the good things. Tariffs still appear, on balance, to be more of a negotiating tactic than a serious threat--even tension with China may simmer down as leaders put phone calls in their diaries. Executives from the biggest tech companies have all shrugged off the threat from DeepSeek. Their comments range from Alphabet CEO Sundar Pichai welcoming the competition, to Microsoft's Satya Nadella saying it will stoke demand for AI, to Palantir arguing that a lower AI cost structure will help business.</p><p class=\"\">The bond market, often seen as the wiser older sibling to stocks, has remained calm these past two weeks. Yields are pushing further away from peaks seen last month--the 10-year yield was below 4.5% early Tuesday, down from as high as 4.8% in January. That could be seen as both a sign of composure and a positive indicator for shares, which are valued relative to bonds.</p><p class=\"\">Of course things may still go south. In the early 2000s, the dot com bubble took two slow, long years to burst before it could recover. And keep in mind that traders tend to overreact, both on the way up and the way down. But for now, the market looks like it's staying on its feet.</p><p class=\"\">Write to Brian Swint at brian.swint@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003152:0/",
            "pub_date": "2025-02-05 18:22:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE82lkTp:0",
            "title": "Yacht Club de Monaco debuts in the Admiral’s Cup 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:900px;aspect-ratio:1.5\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE82lkTp-0c866ce2f60dc7599ab284ca1558f199-resized.webp\" type=\"images/webp\"/><img alt=\"Yacht Club de Monaco\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNE82lkTp-0c866ce2f60dc7599ab284ca1558f199-resized.jpeg\" style=\"background-color:#748da6\"/></picture></div></figure></span></p><p class=\"\">MONACO, Feb.  05, 2025  (GLOBE NEWSWIRE) — The Yacht Club de Monaco (YCM) is set to compete for the first time in the Admiral’s Cup, one of the most prestigious offshore sailing competitions in the world. Organized by the Royal Ocean Racing Club (RORC), the regatta will take place from July 17 to August 1, 2025, in Cowes, on the Isle of Wight. Founded in 1957 and often referred to as the “Unofficial World Cup of Offshore Sailing”, the Admiral’s Cup is making its return after more than twenty years of absence, with the last edition held in 2003. The competition brings together the world’s top sailors for a series of coastal and offshore races, including the Rolex Fastnet Race.</p><p class=\"\">The initiative to participate in the Admiral’s Cup was spearheaded by Peter Harrison, a YCM member and owner of the Jolt boats, with the full support of Pierre Casiraghi, Vice President of the Club and founder of Team Malizia. \"Peter is a great sailor with an outstanding team,\" said Casiraghi. \"When he proposed that we take part in the Admiral’s Cup with the Jolt boats, I immediately accepted this incredible challenge.\" The Monegasque team will field two top-tier boats: the TP52 Jolt 3, skippered by Peter Harrison in the IRC Big Boat class, and the Carkeek 40 Jolt 6, helmed by Pierre Casiraghi. \"We have a solid training program, high-performance boats, and a determined team,\" Casiraghi added. \"Consistency will be key: two poor races can make everything more complicated. We must stay focused and approach each day as a new challenge.\"</p><p class=\"\">This initiative is part of the Yacht Club de Monaco’s broader sporting strategy, inspired by the vision of its President, HSH. Prince Albert II, with the goal of promoting high-level sailing and inspiring younger generations. \"We have followed Boris Herrmann’s journey in the Vendée Globe with pride, admiring his commitment and courage,\" declared the Sovereign Prince. \"This new project embodies our sporting vision. These challenges inspire us and ignite new passions.\"</p><p class=\"\">To take on this new challenge, the Monegasque crew will rely on the expertise of world-class sailors, including Boris Herrmann and Will Harris from Team Malizia, as well as Cole Brauer, the first American woman to complete a solo, non-stop circumnavigation in 130 days, and runner-up in the 2024 Global Solo Challenge. Peter Harrison shares this enthusiasm: \"The Yacht Club de Monaco is a major force in world sailing. Competing in the Admiral’s Cup is a unique opportunity to showcase our experience and passion.\"</p><p class=\"\">The Admiral’s Cup 2025 will bring together over 15 teams representing prestigious yacht clubs, including the Royal New Zealand Yacht Squadron, the Yacht Club Costa Smeralda, and the New York Yacht Club, a three-time winner of the event. Australia, represented by the Cruising Yacht Club of Australia, is the defending champion, having won the last edition in 2003. The competition will feature a mix of technical inshore races and demanding offshore challenges, where consistency and the overall performance of the crew will be decisive.</p><p class=\"\">By participating in this event, the Yacht Club de Monaco reaffirms its ambition to guide its members toward excellence and to strengthen its influence on the international stage. A great challenge that the Monegasque team is ready to take on with determination and passion.</p><p class=\"\"><em>For more information:</em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Press Office LaPresse </em></strong><em>- </em><em>ufficio.stampa@lapresse.it</em></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/8cf1b899-3c1d-4789-9c8d-c4219a22e967</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE82lkTp:0-yacht-club-de-monaco-debuts-in-the-admiral-s-cup-2025/",
            "pub_date": "2025-02-05 18:22:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}