{
    "data": [
        {
            "id": "tag:reuters.com,2026:newsml_L4N3YX006:0",
            "title": "Taiwan markets closed on Friday for a holiday",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Taiwan's financial markets are closed on Friday, February 27, for a holiday, and will resume trade on Monday, March 2.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L4N3YX006:0-taiwan-markets-closed-on-friday-for-a-holiday/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:24fcb9ad43eed:0",
            "title": "Ichor Holdings CEO Sells 21,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Philip Ryan Barros Sr., Chief Executive Officer and Director of Ichor Holdings, Ltd., sold 21,000 ordinary shares at a weighted average price of $46.63 per share, totaling $979,230. Following the transaction, Barros directly owns 153,936 ordinary shares of the company. The sale occurred on February 26, 2026.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Barros Philip Ryan Sr.</span></td></tr><tr><td><span>Relationship</span></td><td><span>Chief Executive Officer</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$979,230</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1691537/000169153726000014/xslF345X05/wk-form4_1772238534.xml\" rel=\"nofollow\" target=\"_blank\">ICHOR HOLDINGS, LTD. [ ICHR ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:24fcb9ad43eed:0-ichor-holdings-ceo-sells-21-000-shares/",
            "pub_date": "2026-02-28 08:30:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S0N3XL04M:0",
            "title": "HHS Secretary Kennedy Appoints Two Physicians To CDC's Advisory Committee On Immunization Practices",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KENNEDY APPOINTS TWO PHYSICIANS TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SEAN G. DOWNING AND ANGELINA FARELLA APPOINTED TO CDC’S ADVISORY COMMITTEE ON IMMUNIZATION PRACTICES- HHS</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S0N3XL04M:0-hhs-secretary-kennedy-appoints-two-physicians-to-cdc-s-advisory-committee-on-immunization-practices/",
            "pub_date": "2026-02-28 08:12:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011954:0",
            "title": "Unbowling For Dollars — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Connor Smith</span></p><p class=\"\"><span>Sweetgreen is trying to put a wrap on its salads — or at the very least, put its salads in a wrap. The fast-casual chain known for its high-end greens is rolling out wraps at some locations.</span></p><p class=\"\"><span>Handhelds are having a moment as consumers tire of so-called slop bowls, a term jokingly used to describe customizable grain-and-salad meals that have become staples of the corporate office lunch.</span></p><p class=\"\"><span>Sweetgreen needs a jolt. Its shares have tumbled 90% from their Nov. 19, 2021, closing high, according to Dow Jones Market Data. That was the day after the company's initial public offering. This past week, it reported its fourth consecutive quarterly decline in same-store sales.</span></p><p class=\"\"><span>Three wraps are now available in select markets: Classic Chicken Caesar, Chicken Jalapeño Ranch, and Chicken Salad Bacon Club. Barron's taste-testers found the Caesar wrap a solid lunch option. The Chicken Salad Bacon Club wrap had the right ratio of lettuce to avocado to chicken salad — although it leaned a bit on the salty side, likely a consequence of the bacon bits sprinkled inside. None of the taste-testers ordered the Jalapeño Ranch — estimated at 1,185 calories, it was deemed too hefty for the office lunch hour.</span></p><p class=\"\"><span>\"Substantial but not overwhelming,\" one Barron's staff taste-tester remarked about the Caesar wrap. Another tester appreciated how easy it was to eat. While salad bowls often feel endless, the wrap \"had a clear end in sight.\"</span></p><p class=\"\"><span>Write to Connor Smith at connor.smith@barrons.com</span></p><p class=\"\"><span>Last Week</span></p><p class=\"\"><span>Markets</span></p><p class=\"\"><span>Responding to the Supreme Court's tariff decision, President Donald Trump imposed global 10% tariffs for 150 days, then raised it to 15%, only to find implementation at 10% had already begun. Gold surged, the dollar and Bitcoin fell. Stocks, hit by another bout of artificial-intelligence jitters, were down but rallied on Tuesday. Trump defended his \"golden age\" economic policies at the State of the Union speech and warned Iran. Nvidia beat on earnings, but the stock slipped. Safe-haven Treasuries had their best month in a year, and January inflation rose. On the week, the Dow industrials fell 1.3%, the S&amp;P 500 0.4%, and the Nasdaq Composite 1%.</span></p><p class=\"\"><span>Companies</span></p><p class=\"\"><span>A Novo Nordisk experimental anti-obesity drug failed to outperform Eli Lilly's Zepbound. Denmark's Maersk and Switzerland's MSC took over two Panama ports. JPMorgan Chase CEO Jamie Dimon warned that some lenders were doing \"dumb things.\" A KKR-managed credit fund reported weak results. Payments company Block said it would cut head count by nearly half. Trump banned Anthropic from government use after the AI company refused to give in to the Pentagon over AI safety issues.</span></p><p class=\"\"><span>Deals</span></p><p class=\"\"><span>After Paramount Skydance raised its bid for Warner Bros. Discovery, Netflix walked away with a $2.8 billion breakup fee paid by Paramount... Citigroup agreed to sell $2.5 billion in shares, or 24%, of Mexican bank Banamax to investors, including General Atlantic, Blackstone, and the Qatar Investment Authority.</span></p><p class=\"\"><span>Next Week</span></p><p class=\"\"><span>Monday 3/2</span></p><p class=\"\"><span>The Institute for Supply Management releases both its Manufacturing and Services Purchasing Managers' Indexes for February. Consensus estimate for the Manufacturing PMI, released on Monday, is a 51.8 reading, about one point less than in January. The Services PMI, released on Wednesday, is expected to be 53.8, even with January's reading.</span></p><p class=\"\"><span>Tuesday 3/3</span></p><p class=\"\"><span>CrowdStrike Holdings and Target announce quarterly results on Tuesday, followed by Broadcom on Wednesday and Costco Wholesale on Thursday.</span></p><p class=\"\"><span>Friday 3/6</span></p><p class=\"\"><span>The Bureau of Labor Statistics releases the jobs report for February. Economists forecast a 60,000 increase in nonfarm payrolls, after a 130,000 gain in January. The unemployment rate is expected to remain unchanged at 4.3%. January's jobs growth was the largest since December of 2024, allaying fears about a weakening labor market. Federal Reserve governor Christopher Waller, who dissented in favor of an interest-rate cut at the Federal Open Market Committee's most recent meeting, pointed to strength in the latest jobs report in saying that a rate cut was \"close to a coin flip\" at the next FOMC meeting in mid-March.</span></p><p class=\"\"><span>The Numbers</span></p><p class=\"\"><span>58</span></p><p class=\"\"><span>Number of gigawatt hours of new energy storage added to the U.S. electric grid in 2025, a record.</span></p><p class=\"\"><span>1.25 M</span></p><p class=\"\"><span>Russian casualty estimates in the now five-year war in Ukraine, more than the U.S. casualties in World War II.</span></p><p class=\"\"><span>90%</span></p><p class=\"\"><span>The estimated percentage of high-end semiconductor chips that are manufactured in Taiwan.</span></p><p class=\"\"><span>1,800</span></p><p class=\"\"><span>The rough number of companies seeking refunds for tariffs since the Supreme Court decision.</span></p><p class=\"\"><span>Write to Robert Teitelman at bob.teitelman@dowjones.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011954:0/",
            "pub_date": "2026-02-28 08:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011956:0",
            "title": "Solar Stocks Crashed This Week. Why the Problems Could Last. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Avi Salzman</span></p><p class=\"\"><span>Three solar stocks plunged more than 30% after reporting earnings this week — and a fourth fell 14% — in a sign that the industry's growing headaches are starting to hit financial statements. Tariffs are pinching margins, federal energy policies are a drag, and demand looks weaker than expected. There are no easy or immediate answers for those problems.</span></p><p class=\"\"><span>On Friday, residential solar developer Sunrun  fell 35%. Its decline followed washouts in solar manufacturer First Solar, and equipment companies Array Technologies and Shoals Technologies, which dropped 14%, 34%, and 31%, respectively, after reporting earnings earlier in the week.</span></p><p class=\"\"><span>The Invesco Solar exchange-traded fund fell 8% this week, marking its worst five-day performance since June.</span></p><p class=\"\"><span>The bad news comes after a few months of relative calm, and even optimism. Solar stocks had a surprisingly good run in 2025, despite losing key tax credits in the large tax bill Republicans passed last year. President Donald Trump's policies have been negative for most renewable players, but not as negative as feared: the tax bill allowed projects that had already begun construction to receive access to the credits available under prior law, for instance. While homeowners can't get federal credits for putting panels on their roofs, those that lease the panels can still benefit from tax breaks.</span></p><p class=\"\"><span>But the solar industry now faces a reckoning from the loss of federal support, consumer reticence, and an increase in costs.</span></p><p class=\"\"><span>Residential solar has a particularly bad demand problem. Energy research firm Wood Mackenzie sees installations falling 18% this year across the U.S. The slowdown appears to have already started: Sunrun, which leases panels to homeowners, added 17% fewer subscribers in the fourth quarter of 2025 than it did in the fourth quarter of 2024. The company's leases pay off over time as its customers pay off their bills on a monthly basis. But it's costing Sunrun more to add each new customer — and the net value of each new customer was down 30% in the quarter.</span></p><p class=\"\"><span>The company's guidance for 2026 was also underwhelming. Sunrun's executives appear to be bracing for \"a more prolonged period of market contraction,\" wrote Jefferies analyst Julien Dumoulin-Smith, who downgraded his rating on the shares to Hold from Buy.</span></p><p class=\"\"><span>Trump's tariffs are also starting to catch up to the industry. First Solar, Array, and Shoals all said tariffs hurt their profit margins.</span></p><p class=\"\"><span>First Solar, an industry bellwether because of its size and status as the largest U.S. manufacturer, has been having demand problems, too. Its backlog was down to 50.1 gigawatts at the end of last year, after starting the year at 68.5 gigawatts. The company had more \"de-bookings\" — including terminated or canceled contracts — than new bookings.</span></p><p class=\"\"><span>First Solar's fourth quarter marked the seventh straight quarter where First Solar's backlog declined sequentially, according to Raymond James analyst Bobby Zolper. \"With respect to 2026 and 2027 guidance, shipment volumes, sales, and [earnings before interest, taxes, depreciation, and amortization], all missed prior views by about 15%, with the stock down by a similar amount,\" Zolper wrote, rating the stock at Market Perform. \"We would prefer to wait out the near-term negatives.\"</span></p><p class=\"\"><span>Write to Avi Salzman at avi.salzman@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011956:0/",
            "pub_date": "2026-02-28 08:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011837:0",
            "title": "Paramount Issuing $47 Billion of Equity at Big Premium to Stock Price for Warner Bros. Deal — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Andrew Bary</span></p><p class=\"\"><span>Paramount Skydance received a big vote of confidence from its controlling shareholders, including the Ellison family, when they agreed to fully back an equity offering to help fund the company's deal for Warner Bros. Discovery at a big premium above Paramount's stock price.</span></p><p class=\"\"><span>Late Friday, Paramount outlined some of the financial highlights of its $110 billion deal for Warner Bros at $31 a share in cash. The deal values Warner Bros. equity at $81 billion, plus about $29 billion in assumed net debt.</span></p><p class=\"\"><span>One unanswered question until now has been the terms of Paramount's equity raise to help fund the deal.</span></p><p class=\"\"><span>The company said that it would issue $47 billion of equity--above a prior estimate of about $41 billion--at an offering price of $16.02 a share. That's a 19% premium above Paramount's closing stock price of $13.51 on Friday. The company's shares surged 21% Friday as investors reacted favorably to Paramount's victory in the takeover battle on Thursday, when Netflix dropped out of the bidding.</span></p><p class=\"\"><span>Paramount said the $47 billion deal consisting of class B shares is being \"fully backed\" by the Ellison family and Redbird Capital Partners, the current controlling shareholders in Paramount who now own about 70% of the company's 1.1 billion outstanding shares. The Ellison family is led by Oracle chairman and billionaire Larry Ellison and his son David, the Paramount CEO.</span></p><p class=\"\"><span>There also is a $54 billion debt financing commitment from a group of lenders.</span></p><p class=\"\"><span>Paramount said the equity may include \"other strategic and financial partners.\" The breakdown of the equity buyers doesn't appear to have been set yet.</span></p><p class=\"\"><span>Investors reacted favorably, with Paramount stock up 3% in after-hours trading to nearly $14 a share.</span></p><p class=\"\"><span>Paramount is set to issue 2.9 billion shares in the equity raise, lifting its share count to about 4 billion, Barron's estimates.</span></p><p class=\"\"><span>Big equity offerings often are done at a discount to the market price. That's why the Paramount equity sale is so notable and bullish.</span></p><p class=\"\"><span>Paramount said that existing Paramount holders will be able to participate in a rights offering to buy up to $3.25 billion of new class B shares at $16.02 a share, the same price at which the equity offering is being priced.</span></p><p class=\"\"><span>There now isn't incentive for Paramount holders to participate in that rights deal — but if the stock rallies, it could become attractive.</span></p><p class=\"\"><span>Paramount now has a thin public float of about 300 million shares, with the Ellisons and RedBird controlling about 800 million shares.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011837:0/",
            "pub_date": "2026-02-28 08:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011514:0",
            "title": "Trump Bars Anthropic From Federal Agencies and Hegseth Labels It a Supply Chain Risk. Here's Why. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Evie Liu and Al Root</span></p><p class=\"\"><span>President Donald Trump said on Friday that he is directing all federal agencies to phase out the use of technology developed by the artificial-intelligence company Anthropic, including its Claude models.</span></p><p class=\"\"><span>The announcement came amid an escalating dispute between the company and the Department of Defense. Trump's directive was issued shortly before the Pentagon's deadline for Anthropic to agree to broader military access to its systems.</span></p><p class=\"\"><span>After that deadline passed, Defense Secretary Pete Hegseth said he was designating Anthropic a supply chain risk.</span></p><p class=\"\"><span>Anthropic CEO Dario Amodei has refused to accede to Pentagon demands that would allow its AI tools to be used without the company's restrictions, particularly in scenarios involving lethal force, surveillance, or other high-stakes applications.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Trump said in a social media post that most federal agencies must immediately cease using Anthropic's technology, and they would have a six-month window to remove the systems where they are already embedded.</span></p><p class=\"\"><span>Anthropic has reportedly won a contract last summer that's worth up to $200 million from the Defense Department, The Wall Street Journal reported last month.</span></p><p class=\"\"><span>Anthropic is a private company, so there is no publicly confirmed revenue figure for the firm. But Bloomberg has estimated that Anthropic's revenue run rate exceeded $9 billion at the end of 2025, which makes the loss of a $200 million contract trivial.</span></p><p class=\"\"><span>But the impact of Friday's moves by the U.S. leaders goes well beyond government contracts.</span></p><p class=\"\"><span>A \"supply-chain risk to national security,\" which Hegseth designated Anthropic, is typically applied to foreign companies. Rarely does the U.S. government label a major domestic company this way.</span></p><p class=\"\"><span>In the past, the Federal Communications Commission has named China's Huawei Technologies and ZTE Corporation as a national security risk to U.S. communications networks and supply chains.</span></p><p class=\"\"><span>Being designated a supply chain risk not only means no government contracts for Anthropic, defense contractors such as Lockheed Martin and Northrop Grumman also can't use Anthropic technology.</span></p><p class=\"\"><span>Neither company immediately responded to a request for comment about their relationship with Anthropic.</span></p><p class=\"\"><span>\"Effective immediately, no contractor, supplier, or partner that does business with the United States military may conduct any commercial activity with Anthropic,\" wrote Hegseth in the X post.</span></p><p class=\"\"><span>Traditional defense stocks might not react to the conflict. Investors should keep an eye on Palantir. It is responsible for implementing a lot of AI technology at the Pentagon and has collaborated with Anthropic recently.</span></p><p class=\"\"><span>Palantir didn't immediately respond to a request for comment.</span></p><p class=\"\"><span>Palantir stock was unfazed on Friday, rising 0.9% to $137.20, while the S&amp;P 500 and Dow Jones Industrial Average fell 0.4% and 1.1%, respectively. Palantir shares were down 0.2% in after-hours trading.</span></p><p class=\"\"><span>The Anthropic conflict could open the door for other AI labs — notably OpenAI, Google's Gemini, and Elon Musk's xAI — to gain additional business with the defense industry.</span></p><p class=\"\"><span>Last year, OpenAI was awarded a contract worth up to $200 million to \"develop prototype frontier AI\" tools for military and national security applications. xAI was recently acquired by SpaceX, which already does a lot of business with the U.S. military and NASA.</span></p><p class=\"\"><span>But they will face the same discussions over terms for classified use of their models. While other AI labs' relationship with the government have not yet escalated to a public dispute, employees at OpenAI and Google have already protested or signed petitions opposing unrestricted military use of their companies' AI tools.</span></p><p class=\"\"><span>Write to Evie Liu at evie.liu@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011514:0/",
            "pub_date": "2026-02-28 08:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e4fd58fc43986:0",
            "title": "Tesla Director Kathleen Wilson-Thompson Sells Over 25,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Tesla Director Kathleen Wilson-Thompson sold a total of 25,731 shares of common stock on February 25, 2026, under a Rule 10b5-1 trading plan. The transactions were executed at weighted average prices ranging from $412.46 to $418.888, resulting in a total sale amount of $10,692,813. Following these transactions, Wilson-Thompson directly owns 19,669 shares of Tesla. Each sale's price was a weighted average, indicating multiple transactions at varying prices within specified ranges.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Wilson-Thompson Kathleen</span></td></tr><tr><td><span>Relationship</span></td><td><span>Director</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$10,692,813</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1331680/000110465926021746/xslF345X05/tm267481-1_4seq1.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1331680/000110465926021746/xslF345X05/tm267481-1_4seq1.xml\" rel=\"nofollow\" target=\"_blank\">Tesla, Inc. [ TSLA ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:e4fd58fc43986:0-tesla-director-kathleen-wilson-thompson-sells-over-25-000-shares/",
            "pub_date": "2026-02-28 08:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:992297758ecea:0",
            "title": "Axsome Therapeutics Executives Sell Shares Worth Over $9.7 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Axsome Therapeutics has seen significant stock transactions by its executives, as reported in recent SEC Form 4 filings. Chief Operating Officer Mark L. Jacobson sold 35,378 shares of common stock on February 26, 2026, at a weighted average price of $161.88 per share, totaling $5,726,990. Following this transaction, Jacobson no longer directly owns any shares in the company. The sale was conducted under a pre-approved 10b5-1 plan following the exercise of stock options.</span></p><p class=\"\"><span>Director Mark Coleman also executed a sale of 25,000 shares of Common Stock on the same day, at a weighted average price of $161.11 per share, amounting to $4,027,750. After the sale, Coleman's direct ownership stands at 47,140 shares, with an additional 403,856 shares held indirectly through an entity with voting and dispositive power.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th><span>Reporter Name</span></th><th><span>Relationship</span></th><th><span>Type</span></th><th><span>Amount</span></th><th><span>SEC Filing</span></th></tr></thead><tbody><tr><td><span>Jacobson Mark L.</span></td><td><span>Chief Operating Officer</span></td><td><span>Sell</span></td><td><span>$5,726,990</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1805812/000119312526083586/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td><span>Coleman Mark</span></td><td><span>Director</span></td><td><span>Sell</span></td><td><span>$4,027,750</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1658379/000119312526083587/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:992297758ecea:0-axsome-therapeutics-executives-sell-shares-worth-over-9-7-million/",
            "pub_date": "2026-02-28 08:10:00",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:f269a0e18094b:0",
            "title": "Crypto VC Paradigm expands into AI, robotics with $1.5B fund: WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Crypto investment firm Paradigm is seeking to raise $1.5 billion for a new fund that will invest in companies in AI, robotics and other frontier technologies, according to the Wall Street Journal. </span></p><p class=\"\"><span>Paradigm will continue to invest in crypto companies, according to sources familiar with the situation, but it will use its existing technical investment team to look at deals in frontier tech companies, they said. </span></p><p class=\"\"><span>San Francisco–based Paradigm has $12.7 billion in assets under management, according to the latest regulatory filings. </span></p><p class=\"\"><span>It launched its flagship $2.5 billion fund in November 2021, which was the largest crypto fund in history at the time. It publicly announced its third fund in 2024 — an $850 million venture fund focused on early-stage crypto projects. </span></p><p class=\"\"><span>According to the WSJ’s sources, the firm’s managers decided they didn’t want to be restricted in ways that could cause them to miss out on attractive deals. </span></p><p class=\"\"><span>There is also overlap between crypto and AI, such as agentic payments, or transactions made by autonomous AI agents, the person said. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Paradigm exploring AI as early as 2023</span></strong></p><p class=\"\"><span>Paradigm acknowledged it had been “tinkering” with AI and its convergence with crypto as early as three years ago. </span></p><p class=\"\"><span>In 2023, Paradigm was seen removing Web3 and crypto-specific language from its website, prompting some speculators to suggest it was already pivoting from crypto to AI. </span></p><p class=\"\"><span>Matt Huang, the co-founder and managing partner of Paradigm, denied at the time that the website changes reflected a shift away from crypto, but acknowledged that the team had been exploring AI.  </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1083.977900552486px;aspect-ratio:1.8066298342541436\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:f269a0e18094b-e73a5f89056a622fd1f4271a9a74d47e-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:f269a0e18094b-e73a5f89056a622fd1f4271a9a74d47e-resized.webp\" style=\"background-color:#f0f1f1\"/></picture></div></button></figure><p class=\"\"><span>In a lengthier tweet weeks later, Huang said that while “we’ve never been more excited about crypto and continue to invest across all stages,” the “developments in AI are too interesting to ignore.” </span></p><p class=\"\"><span>“It seems trendy to frame crypto vs AI as a zero-sum competition. But we don’t buy it. Both are interesting and will have plenty of overlap. We’re excited to continue exploring,” he said. </span></p><p class=\"\"><span>Earlier this month, Paradigm and OpenAI released EVMbench, a new benchmark evaluating how different AI models can detect and patch security vulnerabilities found in smart contracts. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>AI made up more than half of all VC funding in 2025</span></strong></p><p class=\"\"><span>In 2025, venture capital investments in AI firms amounted to $258.7 billion, accounting for 61% of all VC investment and doubling its share from 2022, according to OECD. </span></p><p class=\"\"><span>VC funding for generative AI firms made up 14% of all AI venture capital investments, with firms in the United States attracting the largest share of VC funding. </span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>AI Eye: </span></strong></em><span>IronClaw rivals OpenClaw, Olas launches bots for Polymarket </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:f269a0e18094b:0-crypto-vc-paradigm-expands-into-ai-robotics-with-1-5b-fund-wsj/",
            "pub_date": "2026-02-28 08:02:10",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:04039556cc05b:0",
            "title": "Key facts: Ethereum Aims Above $2,000; $8.72B Options Expire; Taker Ratio at 0.99",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>In late February 2026, Ethereum (ETH) aims to stay above $2,000. After dipping to $1,980, it rebounded, previously rising 11% to a ten-day high of $2,148.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:909aba73e094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum options worth over $8.72 billion are expiring, with 478,992 contracts valued at about $975 million, highlighting a major share of the crypto market's open interest.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/beincrypto:c702f1151094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ethereum's Taker Buy Sell Ratio on Binance is now about 0.99, up from below 1. Daily spikes above 1.12 indicate rising buying activity, shifting market dynamics.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:3ef4aa9ac094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:04039556cc05b:0-key-facts-ethereum-aims-above-2-000-8-72b-options-expire-taker-ratio-at-0-99/",
            "pub_date": "2026-02-28 08:03:09",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:27406f7fcda3d:0",
            "title": "Key facts: XRP Leads Altcoin ETFs; XRP Ledger Flaw Fixed; Ripple Boosts XRPL Funding",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>XRP has attracted about 50% of new capital in altcoin ETFs, while Bitcoin and Ethereum have experienced notable outflows recently.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:be88048a2094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>The XRP Ledger Foundation fixed a serious flaw in the signature-validation logic of XRP Ledger, preventing potential unauthorized transactions from victim accounts. No funds were compromised.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:b3620a283094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Ripple plans to boost XRP Ledger (XRPL) funding, focusing on DeFi, asset tokenization, payments, and infrastructure to drive real-world adoption and improve XRP's utility.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/invezz:cbe0047c9094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:27406f7fcda3d:0-key-facts-xrp-leads-altcoin-etfs-xrp-ledger-flaw-fixed-ripple-boosts-xrpl-funding/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:0705ed0add1aa:0",
            "title": "Key facts: Long-term Bitcoin holders sell off; $30,000 drop warned; ETFs gain $1B",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Long-term Bitcoin holders have sold more in the past three months than since January 2024, contributing to the recent price drop attributed to significant selling activity.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:94e037652094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Analyst Willy Woo warned Bitcoin could drop to $30,000 amid worsening macro conditions, with $16,000 as key support. Current bearish sentiment may lead to sideways trading before a rebound.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:f8de2c6d7094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/u_today:c5f30e653094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">3</span></a></li><li class=\"listItem-bmN0_SHH\"><span>U.S. spot Bitcoin ETFs gained over $1 billion in net inflows this week, peaking at $506.51 million. The iShares Bitcoin Trust ETF led with $276 million, while others saw outflows.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/cointelegraph:2ed6b21dd094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">4</span></a><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/dpa_afx:d697a67b78b34:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">5</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:0705ed0add1aa:0-key-facts-long-term-bitcoin-holders-sell-off-30-000-drop-warned-etfs-gain-1b/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b33cd9b868e60:0",
            "title": "Key facts: Aave reaches $1 trillion in lending; Mantle deployment hits $800M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Aave has processed over $1 trillion in total lending, becoming the first DeFi protocol to achieve this. The platform currently secures over $27 billion in user funds.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/newsbtc:c5ff3c0f9094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">1</span></a></li><li class=\"listItem-bmN0_SHH\"><span>Aave and Mantle's mainnet deployment surpassed $800 million on February 27, 2026, just two days after hitting $575 million, driven by increased supply and borrowing in the Mantle Ecosystem.</span><a class=\"tag-ymhFiamt tag-zVPYJd3B xxsmall-zVPYJd3B square-zVPYJd3B interactive-zVPYJd3B apply-overflow-tooltip apply-overflow-tooltip--allow-text apply-overflow-tooltip--check-children\" data-exclude-from-news-link-analytics=\"true\" href=\"/news/chainwire:038e99079094b:0\" target=\"_blank\"><span class=\"text-ymhFiamt\">2</span></a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:b33cd9b868e60:0-key-facts-aave-reaches-1-trillion-in-lending-mantle-deployment-hits-800m/",
            "pub_date": "2026-02-28 08:03:34",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN1AY:0",
            "title": "Bolivian military plane crashes in El Alto near capital La Paz",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A Bolivian Air Force Hercules aircraft crashed on Friday evening onto a busy avenue amid inclement weather in the city of El Alto, near Bolivia's capital La Paz, according to television media reports.</span></p><p class=\"\"><span>The aircraft was transporting new banknotes to the interior of the country, local media station Unitel said, citing the Bolivian Ministry of Defense. </span></p><p class=\"\"><span>Social media footage showed chaotic scenes of people flocking to the scene of the crash, appearing to pick up money that lay strewn on the ground following the accident. Local authorities on the scene were warding off people using water hoses. Reuters was unable to identify the images. </span></p><p class=\"\"><span>Authorities have not yet confirmed injuries or fatalities. Bolivia's central bank was set to address reporters later on Friday evening. </span></p><p class=\"\"><span>The El Alto International Airport was temporarily closed following the crash, national airline Boliviana de Aviacion said in a statement, which said the aircraft involved in the accident did not belong to its fleet. </span></p><p class=\"\"><span>Video broadcast on local media showed that the aircraft was severely damaged, as were a number of vehicles along the avenue where the crash took place. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN1AY:0-bolivian-military-plane-crashes-in-el-alto-near-capital-la-paz/",
            "pub_date": "2026-02-28 08:03:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:39fc81281094b:0",
            "title": "Polestar Investors Contemplate New And Upcoming Vehicle Lineup’s Strength To Spur A Turnaround",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The Polestar 5 is currently expected to start deliveries in the summer of 2026, followed by a new variant of the Polestar 4. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>In 2025, Polestar recorded retail sales of 60,119 cars, a growth of 34% compared to 2024, marking its best year ever.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Earlier this month, the company also announced a $400 million equity investment by Feathertop Funding Limited.</span></li></ul></span></div><span><p class=\"\"><span>Polestar Automotive (PSNY) garnered retail attention on Friday as traders contemplated whether the company is on the cusp of a turnaround with its new and upcoming lineup.</span></p><p class=\"\"><span>Shares of the company closed up 20% at market close on Friday.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>A Stocktwits user expressed optimism for the carmaker’s upcoming offerings, noting that the company’s Polestar 4 is “a beauty.”</span></p><p class=\"\"><span>https://www.stocktwits.com/derrdavid/message/646170795</span></p><p class=\"\"><span>Another user dismissed the “random hype and no actual numbers” and announced a new short position.</span></p><p class=\"\"><span>https://www.stocktwits.com/IrenGlazer69/message/646164349</span></p><p class=\"\"><span>Overall, retail sentiment around PSNY jumped from ‘bearish’ to ‘extremely bullish’ over the past 24 hours, while message volume increased from ‘low’ to ‘extremely high’ levels.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Polestar’s Plans Ahead</span></strong></p><p class=\"\"><span>The EV maker said earlier this month that it has four new cars planned in the next three years, including the Polestar 5 four-door, grand tourer, and the Polestar 7 compact, premium SUV. The company also plans to launch a new variant of its current best-seller, the Polestar 4, and a next generation of its Polestar 2 sedan.</span></p><p class=\"\"><span>The Polestar 5 will be the first of the four to be rolled out, with deliveries expected to start from summer 2026. Polestar 4 will follow with deliveries, now slated in the fourth quarter of 2026.</span></p><p class=\"\"><span>Polestar 2 and Polestar 7 are slated for launch in 2027 and 2028, respectively.</span></p><p class=\"\"><span>“We are targeting the heart of the EV market, where customer demand and profit pools are high. Combined with our continued retail sales network expansion and a growing customer base, we are setting the foundations for profitable growth and operational improvement,” CEO Michael Lohscheller said. The company also said that it now expects low double-digit volume growth in 2026.</span></p><p class=\"\"><span>In 2025, Polestar </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/polestar-shares-edge-up-after-hours/cmU2tLlR43G\" rel=\"nofollow\" target=\"_blank\">recorded</a><span> retail sales of 60,119 cars, a growth of 34% compared to 2024, marking its best year ever.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Equity Investment</span></strong></p><p class=\"\"><span>Earlier this month, the company announced a $400 million equity investment by Feathertop Funding Limited, a special purpose vehicle consolidated to Sumitomo Mitsui Banking Corporation, and Standard Chartered Bank (Hong Kong) Limited. Polestar is majority-owned by China’s Zhejiang Geely Holding Group and its CEO, and also leverages its manufacturing.</span></p><p class=\"\"><span>While its vehicles are currently manufactured in North America and Asia, Polestar is looking to expand its manufacturing footprint to Europe as well. The company intends to make its Polestar 7 compact SUV at a Volvo Cars factory in Kosice, Slovakia.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/PSNY\" rel=\"nofollow\" target=\"_blank\">PSNY stock</a><span> has dropped 30% over the past 12 months.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:39fc81281094b:0/",
            "pub_date": "2026-02-28 08:06:21",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011912:0",
            "title": "Canada Says OpenAI's Safety Pledges Lack Details — 2nd Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Paul Vieira</span></p><p class=\"\"><span>OTTAWA--OpenAI's pledges to strengthen security protocols are missing key details including how they will be implemented, Canada's minister in charge of artificial intelligence said.</span></p><p class=\"\"><span>Minister for Artificial Intelligence Evan Solomon is also demanding greater clarity on OpenAI's operations, including how troubling interactions with the ChatGPT chatbot are escalated, and how privacy considerations are balanced with public safety.</span></p><p class=\"\"><span>Solomon issued a statement Friday, roughly 24 hours after OpenAI wrote to the minister and pledged to bolster safety protocols. OpenAI said that with the changes, it would have referred the account belonging to Jesse Van Rootselaar to police if it was discovered today. Police have identified Van Rootselaar as the suspect in a deadly school shooting in Tumbler Ridge, British Columbia that left eight dead and dozens injured.</span></p><p class=\"\"><span>The Wall Street Journal has reported that OpenAI considered alerting Canadian law-enforcement authorities about interactions between Van Rootselaar and ChatGPT. OpenAI shut down Van Rootselaar's ChatGPT account after detecting a violation of its policy but didn't notify police.</span></p><p class=\"\"><span>Solomon said he's also scheduled to speak to OpenAI Chief Executive Sam Altman next week. A spokesman for Solomon said the timing and location have yet to be determined.</span></p><p class=\"\"><span>A meeting with Solomon marks the second senior Canadian politician Altman has agreed to speak with. British Columbia Premier David Eby said he's also set to speak to Altman, and Eby added he wants the CEO to be cognizant of the pain that families in Tumbler Ridge are feeling.</span></p><p class=\"\"><span>A spokesperson for OpenAI confirmed that Altman has scheduled meeting with both Messrs. Solomon and Eby.</span></p><p class=\"\"><span>Online platforms have long debated how to balance questions of privacy with public safety in their decisions to alert law enforcement about certain users. That debate has now pulled in the AI companies that power the chatbots to which people are confiding the most intimate details of their private thoughts and lives.</span></p><p class=\"\"><span>In its letter to Solomon, OpenAI divulged that Van Rootselaar had a second ChatGPT account. Among OpenAI's pledges is a commitment to strengthen detection systems to prevent efforts to evade safeguards.</span></p><p class=\"\"><span>Taylor Owen, a public-policy professor at Montreal's McGill University with a specialty in media and ethics, said OpenAI has now publicly acknowledged its previous safety protocols were inadequate, and that Van Rootselaar's ability to create a second account discloses a previously unknown system error.</span></p><p class=\"\"><span>\"It means the threshold that governed the original decision, the one that resulted in Canadian police not being contacted about violent content flagged by the company's own systems, was one the company itself now considers inadequate,\" Owen said. OpenAI's pledges, he added, follows a pattern among social-media platforms \"where product safety changes come only after an incident forces them.\"</span></p><p class=\"\"><span>Solomon said he will press Altman about ensuring the pledges are fully implemented and enforced.</span></p><p class=\"\"><span>\"We will be seeking further clarity on how human review is conducted and whether Canadian context and best practices are appropriately embedded in those decisions,\" the minister said.</span></p><p class=\"\"><span>Solomon added that intends to meet other major digital platforms in the coming weeks to advocate for a consistent approach on protecting youths and the public.</span></p><p class=\"\"><span>Write to Paul Vieira at paul.vieira@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011912:0-canada-says-openai-s-safety-pledges-lack-details-2nd-update/",
            "pub_date": "2026-02-28 07:58:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_ACS7kWFQa:0",
            "title": "First Commerce Bancorp, Inc. Announces Conclusion of Tender Offer for its Common Stock",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LAKEWOOD, NJ / ACCESS Newswire / February 27, 2026 / First Commerce Bancorp, Inc., (OTCID:CMRB) (the \"Company\") today announced the conclusion of its previously initiated tender offer to repurchase up to 3,000,000 shares of the Company's common stock (\"Shares\") at a purchase price of $7.00 per Share (the \"Tender Offer\"). The conclusion of the Tender Offer has occurred with the close of business today, Friday, February 27, 2026, at 5:00 P.M. EST.</span></p><p class=\"\"><span>Performance Trust Capital Partners, LLC, served as Deal Manager for the Tender Offer. Computershare, Inc. served as the Depositary for the Tender Offer while Georgeson, LLC acted as the Company's Information Agent for the Tender Offer.</span></p><p class=\"\"><span>Based on a preliminary count by the Depository and Deal Manager for the Tender Offer, a total of 2,974,738 shares have been validly tendered and not properly withdrawn pursuant to the tender offer, representing approximately 14.9% of the outstanding Shares. All Shares validly tendered cannot be withdrawn and no additional tenders will be accepted.</span></p><p class=\"\"><span>This press release is for informational purposes only and is neither an offer to purchase nor a solicitation of an acceptance of securities. No offer, solicitation, purchase, or sale will be made in any jurisdiction in which such offer, solicitation, or sale would be unlawful. The Tender Offer is being made solely pursuant to the terms and conditions set forth in the Offer to Purchase dated January 28, 2026 (the \"Offer to Purchase\"), and accompanying materials. Shareholders should read such Offer to Purchase and related materials carefully and in their entirety because they contain important information, including the various terms and conditions of the tender offer.</span></p><p class=\"\"><span>This press release contains \"forward-looking statements\". Forward-looking statements contain words such as \"anticipate,\" \"believe,\" \"can,\" \"would,\" \"should,\" \"could,\" \"may,\" \"predict,\" \"seek,\" \"potential,\" \"will,\" \"estimate,\" \"target,\" \"plan,\" \"project,\" \"continuing,\" \"ongoing,\" \"expect,\" \"intend\" or similar expressions that relate to the Company's strategy, plans or intentions. Forward-looking statements involve certain important risks, uncertainties and other factors, any of which could cause actual results to differ materially from those in such statements. Such factors include, without limitation, the \"Risk Factors\" referenced in the Offer to Purchase and the following additional factors: ability to execute our business strategy; business and economic conditions; economic, market, operational, liquidity, credit and interest rate risks associated with the Company's business; effects of any changes in trade, monetary and fiscal policies and laws; effects of inflation as well as interest rate, securities market and monetary supply fluctuations; changes in consumer spending, borrowings and savings habits; the Company's ability to achieve organic loan and deposit growth and the composition of such growth; changes in sources and uses of funds; increased competition in the financial services industry; the effect of changes in accounting policies and practices; the share price of the Company's stock; ability to maintain or increase market share and control expenses; costs and effects of changes in laws and regulations and of other legal and regulatory developments; technological changes; the timely development and acceptance of new products and services; ability to implement or improve operational management and other internal risk controls and processes and reporting system and procedures; changes in estimates of future loan reserve requirements based upon the periodic review thereof under relevant regulatory and accounting requirements; widespread natural and other disasters, dislocations, political instability, acts of war or terrorist activities, cyberattacks or international hostilities; impact of reputational risk; and success at managing the risks involved in the foregoing items. The Company can give no assurance that any goal or plan or expectation set forth in forward-looking statements can be achieved and readers are cautioned not to place undue reliance on such statements. The forward-looking statements are made as of the date of this press release, and the Company does not intend, and assumes no obligation, to update any forward-looking statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events or circumstances, except as required by applicable law.</span></p><p class=\"\"><span>Press Contact:</span></p><p class=\"\"><span>Donald Mindiak</span></p><p class=\"\"><span>First Commerce Bancorp, Inc.</span></p><p class=\"\"><span>Lakewood, NJ 08701</span></p><p class=\"\"><span>(732) 364-0032</span></p><p class=\"\"><span>dmindiak@firstcommercebk.com</span></p><p class=\"\"><span>http://firstcommercebk.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> First Commerce Bancorp, Inc.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_ACS7kWFQa:0/",
            "pub_date": "2026-02-28 08:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:209b0cb5b884b:0",
            "title": "Tango Therapeutics Officer Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Crystal Adam, President of R&amp;D at Tango Therapeutics, sold 54,345 shares of common stock on February 25, 2026, at a weighted average price of $12.7741 per share, totaling $694,208. Following the transaction, Adam directly owns 132,873 shares of the company. The sale was conducted under a Rule 10b5-1 trading plan adopted on October 27, 2025.</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><span>Reporter Name</span></td><td><span>Crystal Adam</span></td></tr><tr><td><span>Relationship</span></td><td><span>President, R&amp;D</span></td></tr><tr><td><span>Type</span></td><td><span>Sell</span></td></tr><tr><td><span>Amount</span></td><td><span>$694,208</span></td></tr><tr><td><span>SEC Filing</span></td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1825445/000119312526083579/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1825445/000119312526083579/xslF345X05/ownership.xml\" rel=\"nofollow\" target=\"_blank\">Tango Therapeutics, Inc. [ TNGX ] - Form 4 - Feb. 27, 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-powered summary. It may contain inaccuracies. Consider verifying important information with the source. Please note this summary is solely based on documents filed with the SEC.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:209b0cb5b884b:0-tango-therapeutics-officer-sells-shares/",
            "pub_date": "2026-02-28 08:00:02",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM2CR:0",
            "title": "Who killed Swedish Prime Minister Olof Palme? Amateur sleuths ask AI for help",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Swedish Prime Minister Olof Palme was killed in 1986</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Identity of his murderer still a mystery</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>AI is now being used to look for evidence and clues</span></li></ul></span></div><span><p class=\"\"><span>By Simon Johnson</span></p><p class=\"\"><span>    Forty years after Prime Minister Olof Palme was shot dead on a Stockholm street, Swedes are still wondering whether the murder was the work of a lone gunman or a political assassination.</span></p><p class=\"\"><span>Decades later, the murder remains unsolved, and amateur detectives have turned to Artificial Intelligence in the hope of identifying new leads and persuading authorities to reopen an investigation that was shut down in 2020.</span></p><p class=\"\"><span>The team on a crime podcast called Spår (\"Track\") has started investigating leading theories about the murder with an AI engine developed for them by Swedish and Belgian software firms.</span></p><p class=\"\"><span>\"This is about the murder of our leader, a democratically elected prime minister. You can't just close the case,\" said Anton Berg, a co-presenter of the podcast, which intends to present the findings using AI gradually. </span></p><p class=\"\"><span>So far, Spår has announced no breakthrough in the case. But,  pointing to the ability of AI tools to learn and improve, Berg said: \"Our hope is that this tool will get so advanced that we can open up the investigation again.\"   </span></p><p class=\"\"><span>PARADIGM SHIFT</span></p><p class=\"\"><span>Palme was shot dead at close range on his way home from a visit to the cinema on February 28, 1986. </span></p><p class=\"\"><span>Over the years, the finger of blame has been pointed at South Africa's apartheid-era security services, Kurdish freedom fighters, right-wing extremists within the Swedish state and various lone gunmen. </span></p><p class=\"\"><span>One man was convicted, but later freed, and prosecutors closed the case in 2020. A review last year confirmed the case would remain shut despite the main suspect being absolved. </span></p><p class=\"\"><span>\"We don't know any more than we knew on the day of the murder, essentially,\" said Gunnar Wall, who has written several books on the Palme killing.</span></p><p class=\"\"><span>On Saturday, the 40th anniversary of Palme's death, protesters will hand in a petition to parliament urging authorities to reopen the case. Such calls could get a boost if amateur sleuths are right in believing AI can now do what decades of police work failed to achieve.</span></p><p class=\"\"><span>The AI engine developed for the Spår crime podcast mimics a team of human investigators to probe evidence, evaluate findings and identify gaps, but can do so much more rapidly. </span></p><p class=\"\"><span>It can analyse the case's around 30,000 publicly available digital documents in less than a second. Otherwise the entire case files - about 500,000 pages - would take a decade just to read, police say. </span></p><p class=\"\"><span>From fingerprinting to DNA profiling, forensic technology has reshaped criminal investigations. AI could be another game-changer, experts say.</span></p><p class=\"\"><span>In 2018, AI-assisted DNA analysis helped Los Angeles police  catch Joseph DeAngelo, known as the Golden State Killer, who had murdered 13 people and raped at least 50 people many years  earlier. </span></p><p class=\"\"><span>\"AI is a paradigm shift,\" said Lena Klasen, the former head of Sweden's National Forensic Centre and now Adjunct Professor in Digital Forensics at Linkoping University.</span></p><p class=\"\"><span>\"It is going to change how we work in the way that computers did. But this is bigger.\"</span></p><p class=\"\"><span>CAN AI PROVIDE ANSWERS?</span></p><p class=\"\"><span>Swedish police declined to say whether they had used AI in the Palme case, which will not be reopened unless there is good reason to believe that an investigation would lead to an arrest and conviction. </span></p><p class=\"\"><span>Even with its data-crunching power, AI may struggle to find Palme's killer. </span></p><p class=\"\"><span>Case files are often heavily redacted and vast quantities of material is still unpublished, said Simon Lundell, part of a separate group of amateur investigators using AI in the hope of catching Palme's killer.</span></p><p class=\"\"><span>Gaining access to police files takes time, with only around 1,000 pages per year released. At this rate, it would take hundreds of years to be able to review all the information.</span></p><p class=\"\"><span>Despite such problems, \"our goal is to solve the murder,\" Lundell said.  </span></p><p class=\"\"><span>There is also no guarantee that the evidence needed to solve the Palme case even exists. Three public commissions concluded that police bungled the early investigation. Documents were lost and leads were not followed up.</span></p><p class=\"\"><span>\"There is no technique that can help with information that isn't there, and that is a big part of the problem that there are gaps in the information,\" said Lennart Gune, Director of Prosecution at the Swedish Prosecution Authority.</span></p><p class=\"\"><span>The use of AI in investigations also comes with some concerns. The Golden State Killer case caused a fierce debate about privacy after millions of people had their DNA data scanned without their explicit consent.</span></p><p class=\"\"><span>In 2025, Sweden proposed a law that will allow police to use real-time, AI-powered face-recognition as a tool to fight gang crime, but its use will be limited over concerns about privacy and AI surveillance. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM2CR:0-who-killed-swedish-prime-minister-olof-palme-amateur-sleuths-ask-ai-for-help/",
            "pub_date": "2026-02-28 08:00:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Tnw41Rnvf:0",
            "title": "Vault Strategic Announces Company Attendance At Prospector & Developers Association Conference (PDAC) And Appointment Of Quinn Field-Dyte To CEO",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><p class=\"\"><span>Vancouver, British Columbia -February 27, 2026 – TheNewswire – VaultStrategic Mining Corp. </span><span> </span><span> (FSE:M85)</span><br/><span>(\"VAULT\" or the \"Company\") announces it has appointed Mr. Quinn Field-Dyte to the roleof Chief Executive Officer (\"CEO\") in addition to his ongoingresponsibility to the Board of Directors.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>“I am honored to step into therole of Chief Executive Officer of Vault Strategic Mining at a time ofunprecedented strength across global commodity markets and what Ibelieve is a pivotal moment in the Company’s evolution. The world israpidly repricing the strategic importance of critical minerals, andVault is uniquely positioned within that landscape. I look forward toembracing this new challenge as CEO while continuing to fulfill myresponsibilities to the Board of Directors. Said Mr. Field-Dyte, CEO &amp; Director ofVault Strategic Mining Corp. On behalf of the Company, I would also like to sincerely thank Mr.Horsley for his leadership and dedication. His contributions to VaultStrategic Mining have been invaluable, and we wish him continuedsuccess in his future endeavors. Together, we remain focused ondisciplined execution, strategic growth, and unlocking long-term valuefor our shareholders.”</span></p><p class=\"\"><span>Quinn Field-Dyte is a senior capital markets and miningexecutive with over two decades of experience in public companyoperations, mergers and acquisitions, corporate finance, and boardgovernance within the natural resources sector. His career has beencentered on supporting exploration and development stage miningcompanies through disciplined capital allocation, strategic growthinitiatives, and effective engagement with public markets.</span></p><p class=\"\"><span>Mr. Field-Dyte has extensive experience navigating thefull lifecycle of public mining companies, including corporatestructuring, financings, asset acquisitions and divestitures,regulatory compliance, and shareholder communications. He has played akey role in evaluating mineral assets, advancing explorationstrategies, and aligning corporate objectives with market conditionsand long-term value creation.</span></p><p class=\"\"><span>At Vault Strategic Mining Corp., Mr. Field-Dytecontributes his deep expertise in corporate strategy, financialoversight, and governance. He is actively involved in guiding theCompany’s focus on historically advanced mining assets across NorthAmerica, supporting disciplined exploration planning, capital marketsstrategy, and corporate development initiatives aligned with criticaland strategic mineral opportunities. Earlier in his career, Mr.Field-Dyte spent several years as an investment adviser, providing himwith a strong foundation in financial analysis, risk management, andinvestor relations. This background continues to inform his practical,market-aware approach to decision-making at the board level.</span></p><p class=\"\"><span>Mr. Field-Dyte studied at Capilano University andLangara College. He is recognized for his strong understanding ofpublic markets, his ability to execute complex transactions, and hiscommitment to building shareholder value through prudent managementand strategic focus within the mining sector.</span></p><p class=\"\"><span>The Company has accepted Mr. Robert “Nick” Horsleyresignation from the Board of Directors and CEO position effectiveimmediately. Vault wishes to thank him for his contributions to VaultStrategic Mining Corp. and wishes him all the best in his futureendeavors. </span></p><p class=\"\"><span>Furthermore, the Company announces that Vault’s Management will attend the upcomingProspectors and Developers Association of Canada (\"PDAC\")conference to be held March 1 – 4, 2026, at the Metro TorontoConvention Centre, Toronto, Canada.</span></p><p class=\"\"><span>Vault’s team members are happy to accept requests formeetings by current or potential investors. Please schedule a meetingby email (info@vaultstrategic.com) or phone (604.343.4338).</span></p><p class=\"\"><span>Restricted Stock Units(“RSUs”)</span></p><p class=\"\"><span>Furthermore, the Company announces that it has issued1,180,000 restricted RSUs to certain directors, officers andconsultants of the Company pursuant to its Omnibus Equity IncentivePlan. The RSUs will vest in twelve (12) months from the date ofissuance and will be settled in common shares of the Company. The RSUsare subject to the terms and conditions of the Omnibus EquityIncentive Plan.</span></p><p class=\"\"><span>About Vault Strategic MiningCorp.</span></p><p class=\"\"><span>Vault Strategic Mining Corp. is a North Americanresource company focused on the acquisition and advancement ofstrategic and critical mineral projects located in top-tier miningjurisdictions. The Company emphasizes historical and underexploredassets with potential for value creation through modern explorationand disciplined development.</span></p><p class=\"\"><span>Vault Strategic Mining Corp. trades on the TSX Venture</span><br/><span>Exchange </span><span>, OTC Markets </span><span>, and the Frankfurt</span><br/><span>Stock Exchange (FSE: M85).</span></p><p class=\"\"><span>On behalf of the Board:</span></p><p class=\"\"><span>Vault Strategic Mining Corp. </span></p><p class=\"\"><span>\"QuinnField-Dyte\"</span></p><p class=\"\"><span>Chief Executive Officer andDirector</span></p><p class=\"\"><span>Tel: 604.343.4338 | Email:info@vaultstrategic.com</span></p><p class=\"\"><span>ANY SECURITIES REFERRED TO HEREINWILL NOT BE REGISTERED UNDER THE U.S. SECURITIES ACT OF 1933 (THE\"1933 ACT\") AND MAY NOT BE OFFERED OR SOLD IN THE UNITEDSTATES OR TO A U.S. PERSON INTHE ABSENCE OF SUCH REGISTRATION OR AN EXEMPTION FROM THE REGISTRATIONREQUIREMENTS OF THE 1933 ACT.</span></p><p class=\"\"><span>NOT FOR DISTRIBUTION TO U.S. NEWSWIRESERVICES OR FOR DISSEMINATION IN THE UNITED STATES. ANY FAILURE TOCOMPLY WITH THIS RESTRICTION MAY CONSTITUTE A VIOLATION OF U.S.SECURITIES LAW.</span></p><p class=\"\"><span>Neither TSXVenture Exchange nor its Regulation Services Provider (as that term isdefined in policies of the TSX Venture Exchange) acceptsresponsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><span>Disclaimer forForward-Looking Information</span></p><p class=\"\"><span>This release includesforward-looking statements regarding DIA, and the Letain Project,which may include, but is not limited to, statements with respect tothe completion of the acquisition of the Letain Project, and theability to obtain regulatory approvals, and other factors. Often, butnot always, Forward-looking statements can be identified by the use ofwords such as \"plans\", \"is expected\",\"expects\", \"scheduled\", \"intends\",\"contemplates\", \"anticipates\",\"believes\", \"proposes\", \"estimates\" orvariations of such words and phrases, or state that certain actions,events or results \"may\", \"could\",\"would\", \"might\" or \"will\" be taken,occur or be achieved. Such statements are based on the currentexpectations of the management of each entity. The forward-lookingevents and circumstances discussed in this release, includingcompletion of the acquisition of the Letain Project, may not occur bycertain specified dates or at all and could differ materially as aresult of known and unknown risk factors and uncertainties affectingthe Company, including the risk that DIA may not obtain all requisiteapprovals for the acquisition, including the approval of the TSXV,risks of the resource industry, failure to obtain any other requiredregulatory approvals, economic factors, any estimated amounts, timingof the acquisition and requited payments, the equity markets generallyand risks associated with growth, exploration and development.Although DIA has attempted to identify important factors that couldcause actual actions, events or results to differ materially fromthose described in forward-looking statements, there may be otherfactors that cause actions, events or results to differ from thoseanticipated, estimated or intended. No forward-looking statement canbe guaranteed. Except as required by applicable securities laws,forward-looking statements speak only as of the date on which they aremade DIA undertaked no obligation to publicly update or revise anyforward-looking statement, whether as a result of new information,future events, or otherwise.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Tnw41Rnvf:0-vault-strategic-announces-company-attendance-at-prospector-developers-association-conference-pdac-and-appointment-of-quinn-field-dyte-to-ceo/",
            "pub_date": "2026-02-28 08:00:07",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:06436b138094b:0",
            "title": "Crypto Mixing Is Back — And Criminals Adapted Faster Than The Rules Did",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>When US crypto regulators cracked down on Tornado Cash in 2022, the assumption was simple: shut down the tool, shut down the problem. It didn’t work out that way.</span></p><p class=\"\"><span>New research from the Cambridge Centre for Alternative Finance (CCAF) shows that coin mixer usage has climbed back toward pre-ban levels — and that the people most effectively pushed out by the sanctions were not the criminals, but ordinary users seeking financial privacy.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Railgun Now Dominates A Recovering Market</span></strong></p><p class=\"\"><span>According to CCAF researchers Wenbin Wu and Keith Bear, total crypto mixer transactions reached approximately 32,000 in 2025 — a significant jump from roughly 21,000 in 2024 and 16,000 in 2023.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1101.9748653500899px;aspect-ratio:1.836624775583483\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-fffc00c4fc0d1462adb9886ab2c9288f-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-fffc00c4fc0d1462adb9886ab2c9288f-resized.webp\" style=\"background-color:#f6f5f7\"/></picture></div></button></figure><p class=\"\"><span>Usage has been climbing steadily since the US Treasury lifted its sanctions against Tornado Cash on March 21, 2025.</span></p><p class=\"\"><span>Railgun, a protocol that screens deposits against lists of flagged addresses, now handles 71% of all mixer transaction volume. Tornado Cash accounts for around 25% of 2025 transactions, while Privacy Pools holds the remaining 5%.</span></p><p class=\"\"><span>Both Railgun and Privacy Pools attempt to filter out known bad actors before crypto funds enter the system. But reports from CCAF note a meaningful gap — blacklists are updated only as new exploits are discovered, leaving a window where funds from freshly flagged addresses can still pass through.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1127.3394495412845px;aspect-ratio:1.8788990825688074\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-67fcdd7b83ee536156f8cc6a4a384752-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:06436b138094b-67fcdd7b83ee536156f8cc6a4a384752-resized.webp\" style=\"background-color:#cad6d5\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Sanctions Scared Off Legitimate Users More Than Criminals</span></strong></p><p class=\"\"><span>The 2022 crackdown caused immediate disruption. Tornado Cash’s daily transactions collapsed by 97% within days. Across the broader mixer market, volume fell 45%. But the disruption was uneven.</span></p><p class=\"\"><span>Wu told researchers that sanctions “primarily deterred compliant users while illicit actors adapted” — first by migrating to alternative platforms, then to cross-chain bridges and decentralized exchanges altogether.</span></p><p class=\"\"><span>Deposit patterns tell the same story. Before 2022, centralized exchanges — which require identity verification — contributed meaningfully to mixer funding. After the ban, those deposits essentially vanished. By 2025, 95% of all crypto mixer funding came from unlabeled wallet addresses with no recorded entity ties, up from 76% in 2020.Most Transactions Now Happen Within 24 Hours </span></p><p class=\"\"><span>Before the ban, most mixer activity occurred more than 24 hours after wallet creation. That pattern has flipped. Researchers say this faster behavior is “consistent with users seeking to avoid identification.”</span></p><p class=\"\"><span>Still, a 2023 Federal Reserve Bank of St. Louis paper found that only around 30% of Tornado Cash traffic could be linked to illegitimate sources — a reminder that privacy tools serve lawful purposes too. The demand, from both camps, never went away.</span></p><p class=\"\"><em><span>Featured image from Unsplash, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:06436b138094b:0-crypto-mixing-is-back-and-criminals-adapted-faster-than-the-rules-did/",
            "pub_date": "2026-02-28 08:00:08",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN10E:0",
            "title": "'Messy' singer Lola Young, Olivia Dean vie for prizes at BRIT Awards",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Marie-Louise Gumuchian</span></p><p class=\"\"><span>    Singers Lola Young and Olivia Dean top the table of contenders for Saturday's BRIT Awards, with five nominations apiece at Britain's pop music honours.</span></p><p class=\"\"><span>In the run-up to the event, another young star, 24-year-old PinkPantheress, was named as the first woman to get the producer of the year prize.</span></p><p class=\"\"><span>Young, 25, is listed for artist of the year, breakthrough artist, alt/rock act and pop act. Her chart-topping hit \"Messy\" is up for song of the year.</span></p><p class=\"\"><span>Dean, 26, is also a contender in that category with two tracks: \"Man I Need\" and \"Rein Me In\", a collaboration with rocker Sam Fender. She is also nominated for artist of the year, pop act and album of the year for \"The Art of Loving\".</span></p><p class=\"\"><span>PinkPantheress, who released her critically-acclaimed debut mixtape \"To Hell With It\" in 2021, is the youngest ever recipient of the producer prize. She is also nominated for artist of the year and best dance act.</span></p><p class=\"\"><span>“PinkPantheress is both an inventive and instinctive voice in British pop right now,\" Stacey Tang, chair of the 2026 BRIT Awards committee and co-president of RCA Records at Sony Music UK, said in a statement.</span></p><p class=\"\"><span>\"She’s quietly reshaping what modern pop can be, and in doing so, opening the door for a new wave of female producers to step forward.\"</span></p><p class=\"\"><span>Among other nominees are Fender, 31, who has three additional nods: artist of the year, alt/rock act and album of the year for \"People Watching\". Rappers Dave and Jim Legxacy, singer Lily Allen and producer Fred again have three nominations each.</span></p><p class=\"\"><span>Ozzy Osbourne, the late frontman of the heavy metal band Black Sabbath, will be honoured with a lifetime achievement award \"in recognition and celebration of his inimitable impact and influence on music worldwide\", organisers said.</span></p><p class=\"\"><span>Known to fans as \"The Prince of Darkness\", Osbourne died in July aged 76, around two weeks after Black Sabbath's emotional farewell gig.</span></p><p class=\"\"><span>Pulp, who found fame in the mid-1990s Britpop wave, are nominated for group of the year, their first nomination since 1996. The band topped the charts last year with \"More\", their first album since 2001.</span></p><p class=\"\"><span>Movies have also been recognised with actor Cynthia Erivo nominated for song of the year for her rendition of \"Wicked\" track \"Defying Gravity\", while \"Golden\", from Netflix phenomenon \"KPop Demon Hunters\", is up for international song of the year.</span></p><p class=\"\"><span>This year's BRIT Awards will be held in the northern English city of Manchester. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN10E:0-messy-singer-lola-young-olivia-dean-vie-for-prizes-at-brit-awards/",
            "pub_date": "2026-02-28 08:01:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011895:0",
            "title": "United and American Fight at Chicago's O'Hare Draws Federal Scrutiny — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Dean Seal</span></p><p class=\"\"><span>The Federal Aviation Administration is looking to cut flights this summer at Chicago's O'Hare International Airport, where United Airlines and American Airlines are currently duking it out for supremacy.</span></p><p class=\"\"><span>The agency said Friday it would hold a meeting next week to discuss flight restrictions that could ease potential overscheduling and flight delays at O'Hare, which ranks among the busiest airports in the U.S.</span></p><p class=\"\"><span>The prospect of cuts comes as United and American have been in a monthslong battle for gates and passengers.</span></p><p class=\"\"><span>United was allocated five additional gates at O'Hare last year and is planning to boost its daily departures there by more than 34% this summer. American added new destinations from O'Hare and is looking to increase its summer schedule by 10% from a year ago. The competition between carriers could result in lower fares for travelers, analysts have said.</span></p><p class=\"\"><span>But the FAA said the proposed flight plans during the coming summer season, which runs from March 29 to Oct. 25, could compromise the airport's operations.</span></p><p class=\"\"><span>O'Hare currently runs about 100 departures and 100 arrivals every hour, with about 2,800 total operations a day. The increases expected this summer would push that figure to nearly 3,100 on peak days, the agency said, citing data-provider Cirium.</span></p><p class=\"\"><span>\"The proposed increase is significant and would stress the runway, terminal and air traffic control systems at the airport,\" the FAA said in its federal register notice for the meeting.</span></p><p class=\"\"><span>American applauded the decision on Friday, saying in a statement that the FAA can now \"achieve an improved customer experience for passengers.\"</span></p><p class=\"\"><span>United said it appreciated the FAA and Transportation Department's leadership in convening the meeting and \"look[s] forward to a collaborative discussion.\"</span></p><p class=\"\"><span>The meeting is open to the Chicago Department of Aviation and all U.S. carriers, the FAA said.</span></p><p class=\"\"><span>Write to Dean Seal at dean.seal@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011895:0/",
            "pub_date": "2026-02-28 07:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:90fd26e72094b:0",
            "title": "Aardvark Therapeutics Becomes Next Pharma Player To Quit Prader-Willi Syndrome Drug Development Efforts",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Aardvark was studying the efficacy and safety of ARD-101 as a treatment for hyperphagia in patients with Prader-Willi Syndrome in the trial.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>In September, Acadia Pharmaceuticals scrapped development of intranasal Carbetocin after it failed to meet the key goals in a late-stage PWS trial.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Soleno Therapeutics’ VYKAT XR is the first approved treatment specifically for hyperphagia in PWS patients.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Aardvark Therapeutics (AARD) dived 53% after hours on Friday after the company announced that it is voluntarily pausing its late-stage trial in Prader-Willi Syndrome (PWS).</span></p><p class=\"\"><span>The company was studying the efficacy and safety of ARD-101 as a treatment for hyperphagia in patients with Prader-Willi Syndrome in the trial. Prader-Willi syndrome is a rare genetic neurodevelopmental disorder caused by an abnormality in the gene expression on chromosome 15, estimated to occur in one in every 15,000 live births. The disorder is defined by hyperphagia, an intense, persistent sensation of hunger, which could be life-threatening.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Is Aardvark Pausing Trial?</span></strong></p><p class=\"\"><span>The company said that the decision was based on certain cardiac observations made during routine safety monitoring in a healthy volunteer study. The company is reviewing the data to determine next steps, it said, while adding that it has also paused enrollment and dosing in the trial as it completes its evaluation.</span></p><p class=\"\"><span>The firm also added that it no longer expects data from the trail in the third quarter of 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Other Names To Quit PWS Drug Development</span></strong></p><p class=\"\"><span>In September, Acadia Pharmaceuticals </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/acadia-pharmaceuticals-investigational-drug-for-rare-genetic-disorder-fails-in-late-stage-study/chD1Gf0R33B\" rel=\"nofollow\" target=\"_blank\">scrapped</a><span> development of intranasal Carbetocin after it failed to meet the key goals in a late-stage PWS trial.</span></p><p class=\"\"><span>The company then said that intranasal Carbetocin did not demonstrate a statistically significant improvement over placebo to week 12 on the Hyperphagia Questionnaire for Clinical Trials and also announced its intent to stop investigating the drug further.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Soleno’s Approved Drug</span></strong></p><p class=\"\"><span>Soleno Therapeutics, meanwhile, received FDA approval of VYKAT XR in early 2025, making it the first approved treatment specifically for hyperphagia in PWS patients.</span></p><p class=\"\"><span>However, in August, Scorpion Capital revealed a short position against Soleno stock, alleging several risks associated with Vykat XR, including high risk of pre-diabetes/diabetes, pulmonary edema, and congestive heart failure. Scorpion Capital also stated that it intends to submit an emergency Citizen Petition shortly, requesting that the FDA urge Soleno to conduct a voluntary recall of Vykat XR from the market.</span></p><p class=\"\"><span>Weeks later, in September, the company </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/soleno-therapeutics-stock-tanks-after-patient-treated-with-drug-dies/chwklo0RdHG\" rel=\"nofollow\" target=\"_blank\">stated</a><span> in a filing with the Securities and Exchange Commission that it is aware of a serious adverse event reported in the U.S. Food and Drug Administration’s (FDA) Adverse Event Reporting System (FAERS) involving a deceased patient. However, the existence of a report in the data does not establish causation, the company said.</span></p><p class=\"\"><span>Soleno said that its assessment of the death is the same as the treating physician, who said that the death is not related to the treatment with Vykat XR.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around AARD rose from ‘bullish’ to ‘extremely bullish’ territory over the past 24 hours, while message volume increased from ‘low’ to ‘extremely high’ levels.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/AARD\" rel=\"nofollow\" target=\"_blank\">AARD stock</a><span> has dropped 7% over the past 12 months. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:90fd26e72094b:0/",
            "pub_date": "2026-02-28 07:52:27",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN311:0",
            "title": "Braemar Hotels & Resorts Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc </span><span> reported a quarterly adjusted loss of 63 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of -47 cents.  The lone analyst forecast for the quarter was for a loss of 51 cents per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 4.5% to $165.56 million from a year ago; analysts expected $159.25 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc's reported EPS for the quarter was a loss of 67 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $45.96 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc shares had risen by 7.0% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the specialized reits peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Braemar Hotels &amp; Resorts Inc is $4.00, about 27.2% above its last closing price of $2.91</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 11:53 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.02</span></p></td><td><p class=\"\"><span>-0.02</span></p></td><td><p class=\"\"><span>Met</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.15</span></p></td><td><p class=\"\"><span>-0.19</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>0.09</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.36</span></p></td><td><p class=\"\"><span>0.40</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN311:0-braemar-hotels-resorts-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 07:53:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:eab81abf5094b:0",
            "title": "Wilton Resources Inc. Announces Grant of Stock Options",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - </span><strong class=\"root-Tkn6WL2y\"><span>Wilton Resources Inc. </span><span> (the \"Corporation\") </span></strong><span>announces that on February 27, 2026, the board of directors of the Corporation granted 1,223,805 stock options (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Options</span></strong><span>\") to purchase common shares in the capital of the Corporation (\"</span><strong class=\"root-Tkn6WL2y\"><span>Shares</span></strong><span>\") to certain directors, officers and consultants of the Corporation. The Options vest on the date of issuance and are exercisable for a period of five years from the date of grant at an exercise price of $0.30 per Share. Each grant of Options is subject to the approval of the TSX Venture Exchange. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Wilton Resources Inc.</span></strong></p><p class=\"\"><span>Richard Anderson</span></p><p class=\"\"><span>Chief Executive Officer</span></p><p class=\"\"><span>(403) 619 6609</span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:eab81abf5094b:0-wilton-resources-inc-announces-grant-of-stock-options/",
            "pub_date": "2026-02-28 07:54:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227010093:0",
            "title": "Trump Ends Federal Use of Anthropic's AI as Pentagon Labels It Security Risk — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amrith Ramkumar</span></p><p class=\"\"><span>The federal government will stop working with the artificial intelligence company Anthropic, President Trump said, marking a dramatic escalation of the government's clash with the company over its AI models.</span></p><p class=\"\"><span>\"I am directing every federal agency in the United States government to immediately cease all use of Anthropic's technology. We don't need it, we don't want it and will not do business with them again!\" Trump said in a post on Truth Social.</span></p><p class=\"\"><span>The Department of Defense and other agencies using Anthropic's Claude models will have a six-month phaseout period, he said, adding that there would be civil and criminal consequences if the company isn't helpful during the transition.</span></p><p class=\"\"><span>The move comes shortly before a 5:01 p.m. deadline for Anthropic to let the military use its models in all lawful use cases, a concession the company has refused to make.</span></p><p class=\"\"><span>Trump and administration officials have attacked the company for being too \"woke,\" taking exception to its push for AI regulations and its links to organizations that are big Democratic donors.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment. The company said Thursday it wouldn't meet the Pentagon's conditions but was \"ready to continue our work to support the national security of the United States.\"</span></p><p class=\"\"><span>Trump's announcement appears to indicate that the administration is canceling Anthropic's contract with the Pentagon, which is worth up to $200 million. The company had sought to have protections written into the deal against the use of its models for autonomous weapons and mass domestic surveillance. The military has said it should have final authority to decide how the technology can be used within the law.</span></p><p class=\"\"><span>Pentagon officials had threatened to invoke the Defense Production Act to force Anthropic to comply and to label it a supply-chain risk, impairing its ability to work with other government contractors.</span></p><p class=\"\"><span>Broadening the clash to include all federal agencies takes the Anthropic fight to a much larger scale than its spat with the Pentagon. The company's Claude models are being used across the government to do everything from summarize documents to analyze data. Pausing those functions to swap in alternatives could set back the government's AI and modernization efforts, AI experts have said.</span></p><p class=\"\"><span>Pentagon officials have criticized Anthropic leaders including Chief Executive Dario Amodei for seeking control over the military's operations. After Claude was used in the Venezuela raid to capture former President Nicolás Maduro, an Anthropic employee asked a counterpart at data-mining firm Palantir, its partner, about how the technology was used. Defense Department officials learned about the exchange and viewed it as a challenge to the department's prerogative to have final say in operational matters.</span></p><p class=\"\"><span>\"The administration had legitimate principled concerns about the ability of private actors to project control over its use of technology,\" said Dean Ball, a former Trump administration AI adviser who is now a senior fellow at the Foundation for American Innovation think tank.</span></p><p class=\"\"><span>Anthropic has said the Palantir question was part of routine technical discussion between partners.</span></p><p class=\"\"><span>In a Tuesday meeting with Amodei at the Pentagon, Defense Secretary Pete Hegseth threatened to use emergency powers to get Anthropic to do what the military wants, an approach that some AI analysts said could have a chilling effect on other partnerships.</span></p><p class=\"\"><span>Ball said that if the military is only canceling the contract, the administration's approach strikes the right balance.</span></p><p class=\"\"><span>Trump's moves come as other AI companies grapple with their own red lines. OpenAI Chief Executive Sam Altman  told staff Thursday that the company was working with the Defense Department to see if its models could be used in classified settings while maintaining the same safety guardrails Anthropic has, The Wall Street Journal reported. Employees at Google and OpenAI signed an online petition urging their companies to maintain the same red lines.</span></p><p class=\"\"><span>Elon Musk's xAI is currently the only AI company besides Anthropic with approval to be used in classified settings, but government agencies have raised concerns about its reliability and how quickly it can be substituted after Claude was embedded in the Pentagon for many months.</span></p><p class=\"\"><span>The Trump administration and Anthropic have been feuding since the start of Trump's second term. The company hired several top Biden administration officials, proposed AI regulations and guardrails and criticized the president for exporting AI chips to China, actions that upset administration officials including David Sacks, the White House AI czar.</span></p><p class=\"\"><span>Last summer, the administration put out an executive order on \"woke AI,\" saying the government had an \"obligation not to procure models that sacrifice truthfulness and accuracy to ideological agendas.\" Anthropic was widely seen as a target of the order. The company has said it isn't woke or political and previously called such attacks baseless.</span></p><p class=\"\"><span>The Pentagon has said it didn't want to use Claude for autonomous weapons, mass surveillance or other illegal uses, but that it needs to have full control over the technology it deploys.</span></p><p class=\"\"><span>Write to Amrith Ramkumar at amrith.ramkumar@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227010093:0/",
            "pub_date": "2026-02-28 07:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw8DS7nS:0",
            "title": "Giant Mining Corp. Engages Big Sky Exploration for Up to 10,000 Feet of Multi-Phase 2026 Drilling at Majuba Hill, Nevada",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>VANCOUVER, BC — February 27, 2026– TheNewswire — Giant Mining Corp. (CSE: BFG | OTC:BFGFF | FWB: YW5 | CSE: BFG.WT.A | CSE: BFG.WT.B.) (“Giant Mining”or the “Company”) is pleased to announce ithas engaged Big Sky Exploration, LLC (“Big Sky”) forits 2026 Maiden Core diamond drilling program (the “Core Program”)at the Majuba Hill Copper Deposit (“Majuba Hill”), acopper, silver, and gold project in Pershing County, Nevada. </span></p><p class=\"\"><span>Big Sky, which operates throughout the western UnitedStates, provided high-quality core drilling services at Majuba Hill in2024 and 2025. The Company has made the requiredadvance payment to ensure a timely start for thePhase 1 Core Program.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure1: Big Sky Drilling</span><br/><span>Equipment on Site during 2025 drill campaign</span><br/></p><p class=\"\"><br/><span>“We are pleased to secure the</span><br/><span>services of Big Sky Exploration, whose experienced crews have</span><br/><span>demonstrated safe, efficient, and cost-effective drilling performance</span><br/><span>at Majuba Hill,” said David Greenway, President &amp; CEO of Giant</span><br/><span>Mining Corp. “With a refined geological model, secured funding, and</span><br/><span>a clearly defined drill strategy, we are positioned to advance</span><br/><span>systematic exploration at our Nevada copper project. Majuba Hill is a</span><br/><span>U.S.-based copper and critical metals project aligned with the White</span><br/><span>House’s focus on strengthening domestic critical mineral supply</span><br/><span>chains and enhancing U.S. resource security. Our team is focused on</span><br/><span>disciplined execution of the 2026 drill program as we continue to</span><br/><span>evaluate the broader potential of the system.”</span><br/></p><p class=\"\"><br/><span>As previously announced on January</span><br/><span>30th,</span><br/><span>2026, the Company has planned an upto 10,000 feet (3,048 meters) of drilling in a multi phased diamonddrill program.</span></p><p class=\"\"><span>The multi phased drilling and exploration Program isanticipated to include</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phase 1 – Up to 5,000 feet (1,524 meters) core drillprogram </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Underground mapping and sampling </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Additional Surface Sampling for additional follow updrill targeting </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phase 2 – Up to 5,000 feet (1,524 meters) core drillprogram </span></p></li></ul><p class=\"\"><span>The drilling and exploration program will be guided bymore than 100 previous drill holes totaling over 89,000 feet ofdrilling and will include input from RESPEC Engineering. Reviews ofthe 2024–2025 exploration results, including drilling, surfacegeological mapping, and geochemical sampling, have identified numerousmineralized breccia bodies (See NR dated January 16,</span><br/><span>2024). Drillintercepts returned elevated copper and silver values, as well asintervals of anomalous gold. Mineralization is commonly associatedwith hydrothermal-magmatic tourmaline matrix breccias and the marginsof breccia pipes. Further drilling is required to determine the extentand continuity of mineralization.</span></p><p class=\"\"><span>Alignment With U.S. Domestic SupplyObjectives</span></p><p class=\"\"><span>Majuba Hill is in the exploration stage, and theCompany believes that the discovery-driven, staged exploration, anddrilling programs provide a technically sound framework for advancingthe project which is aligned with U.S. critical-mineralpriorities.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure2: Majuba Hill Phase 1</span><br/><span>Drill Target Areas </span><br/></p><p class=\"\"><br/><span>Quality Assurance/Quality Control</span><br/><span>(“QA/QC”) </span><br/></p><p class=\"\"><br/><span>Historical drilling results referenced herein were</span><br/><span>previously disclosed by the Company in accordance with National</span><br/><span>Instrument 43-101 – Standards of Disclosure for Mineral Projects.</span><br/><span>Analytical work was performed by ALS USA Inc. (\"ALS\"), an</span><br/><span>ISO/IEC 17025 accredited prep laboratory located in Elko, Nevada.</span><br/><span>Industry standard quality assurance and quality control (QA/QC)</span><br/><span>procedures included the insertion of certified reference materials,</span><br/><span>blanks, and duplicates at regular intervals within the sample stream.</span><br/><span>The Qualified Person has reviewed and verified the data underlying the</span><br/><span>historical results referenced in this release.</span><br/></p><p class=\"\"><br/><span>Qualified Person</span><br/></p><p class=\"\"><br/><span>The scientific and technical information contained in</span><br/><span>this news release has been reviewed and approved by E.L. “Buster”</span><br/><span>Hunsaker III, CPG 8137, a non-independent consulting geologist who is</span><br/><span>a “Qualified Person” as such term is defined under National Instrument 43-101 – Standards</span><br/><span>of Disclosure for Mineral Projects (“NI</span><br/><span>43-101”).</span><br/></p><p class=\"\"><br/><span>Majuba Hill’s critically important</span><br/><span>characteristics are as follows:</span><br/></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Location:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Nevada, USA — a globally top-ranked miningjurisdiction, ranked #1 in the Fraser Institute’s 2022 Annual Surveyof Mining Companies.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Project Size:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>9,684 Acres</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Infrastructure:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The Majuba Hill property is located 113 road kilometers(70 miles) southwest of Winnemucca, Nevada, and 251 kilometers (156miles) northeast of Reno. It is accessible via well-maintained countyroads from the Imlay, Nevada exit on U.S. Interstate 80, followed by a23-mile drive west. People, roads, power, and water are fundamentalconsiderations for infrastructure, and Majuba Hill already benefitsfrom a strong foundation in all these areas. This existinginfrastructure provides a significant advantage, offering substantialcost savings compared to more remote projects.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>History:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Historical Producer</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Drilling:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Approximately 89,395 feet of drilling to date. Roughreplacement value of drilling USD $12.1 Million using currentcosts.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Mineralization:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The project shows indications of a potentially large Cu– Ag +/- Au mineralized body with many features in common with bothlarge porphyry copper, silver, and gold projects; however, furtherdrilling is required to determine the extent and grade ofmineralization.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Expandability:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The IP survey, deep drilling, and step-out drillingindicate significant expansion potential, with mineralization open inall directions.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Fully Financed:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The Company has secured funding for its next phase ofdrilling at Majuba Hill.</span></p></td></tr></tbody></table></div><p class=\"\"><br/><span>About Giant Mining Corp.</span><br/></p><p class=\"\"><br/><span>Giant Mining is focused on identifying, acquiring, and</span><br/><span>advancing late-stage copper and copper/silver/gold projects to meet</span><br/><span>the growing global demand for critical metals. This demand is driven</span><br/><span>by initiatives like the Green New Deal in the United States and</span><br/><span>similar climate-focused programs worldwide, which require substantial</span><br/><span>amounts of copper, silver, and gold for electric vehicles, renewable</span><br/><span>energy infrastructure, and the modernization of clean and affordable</span><br/><span>energy systems.</span><br/></p><p class=\"\"><br/><span>The Company’s flagship asset is the Majuba Hill</span><br/><span>Copper, Silver, and Gold District, located 156 miles (251 km) from</span><br/><span>Reno, Nevada. Majuba Hill benefits from a mining-friendly regulatory</span><br/><span>environment and strong local infrastructure. While still an</span><br/><span>exploration-stage asset, the geological footprint and scale of</span><br/><span>mineralization indicate that further work is clearly justified and</span><br/><span>that the system may host significant copper potential. </span><br/></p><p class=\"\"><br/><span>With a strengthened technical framework, supportive</span><br/><span>jurisdiction, and funded exploration program, Giant Mining is focused</span><br/><span>on advancing Majuba Hill through systematic drilling and technical</span><br/><span>evaluation. The Company remains committed to responsible exploration,</span><br/><span>technical transparency, and creating long-term shareholder value</span><br/><span>through discovery-focused exploration.</span><br/></p><p class=\"\"><br/><span>Neither the Canadian Securities</span><br/><span>Exchange nor its Market Regulator (as that term is defined in the</span><br/><span>policies of the Canadian Securities Exchange) accepts responsibility</span><br/><span>for the adequacy or accuracy of this release.</span><br/></p><p class=\"\"><span>Click Image To View Full Size </span></p><p class=\"\"><span>On Behalf of the Board of Giant Mining Corp.</span></p><p class=\"\"><span>“David Greenway”</span></p><p class=\"\"><span>David C. Greenway </span></p><p class=\"\"><span>President &amp; CEO</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>E: info@giantminingcorp.com</span></p><p class=\"\"><span>P: 1 (236) 788-0643</span></p><p class=\"\"><span>VISIT OUR WEBSITE FOR MORE DETAILS</span></p><p class=\"\"><span>www.giantminingcorp.com</span></p><p class=\"\"><span>LIKE AND FOLLOW</span></p><p class=\"\"><span>Instagram, Facebook, Twitter, LinkedIn</span></p><p class=\"\"><br/><span>DOWNLOAD INVESTOR INFORMATION</span><br/></p><p class=\"\"><br/><span>Click Here</span><br/></p><p class=\"\"><br/><span>Forward-Looking Statements</span><br/></p><p class=\"\"><br/><span>This news release contains</span><br/><span>forward-looking information, including but not limited to statements</span><br/><span>regarding planned exploration activities and anticipated</span><br/><span>outcomes.</span><br/></p><p class=\"\"><br/><span>This news release contains certain</span><br/><span>forward‐looking information. Such information</span><br/><span>involves known and unknown risks, uncertainties and other factors that</span><br/><span>may cause actual results, performance or achievements to be materially</span><br/><span>different from those implied by statements herein, and therefore these</span><br/><span>statements should not be read as guarantees of future performance or</span><br/><span>results. All forward‐looking statements are</span><br/><span>based on the Company’s current beliefs as well as assumptions made</span><br/><span>by and information currently available to it as well as other factors.</span><br/><span>Readers are cautioned not to place undue reliance on these</span><br/><span>forward‐looking statements, which speak only as of</span><br/><span>the date of this press release. Due to risks and uncertainties,</span><br/><span>including the risks and uncertainties identified by the Company in its</span><br/><span>public securities filings, actual events may differ materially from</span><br/><span>current expectations. These statements involve known and unknown</span><br/><span>risks, including exploration, metallurgical, permitting,</span><br/><span>environmental, commodity price, and market risks. The Company</span><br/><span>disclaims any intention or obligation to update or revise any</span><br/><span>forward‐looking statements, whether as a result of</span><br/><span>new information, future events or otherwise.</span><br/></p><p class=\"\"><br/><span>###</span><br/></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw8DS7nS:0-giant-mining-corp-engages-big-sky-exploration-for-up-to-10-000-feet-of-multi-phase-2026-drilling-at-majuba-hill-nevada/",
            "pub_date": "2026-02-28 07:55:03",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:a79701387094b:0",
            "title": "Delivra Health and Its Brands LivRelief (TM) and Dream Water (TM) Report Results for Second Quarter of Fiscal 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><em><span>Year to date sales growth of Dream Water® E-commerce of 26% offset by a decline of Dream Water® Retail of 4% compared to same period last year</span></em></p><p class=\"\"><em><span>Year to date sales growth of LivRelief™ E-commerce of 28 % offset by a decline in LivRelief™ Retail of 29% compared to same period last year</span></em></p><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Delivra Health Brands Inc. </span><span> (OTCQB: DHBUF) (\"</span><strong class=\"root-Tkn6WL2y\"><span>Delivra Health</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\"), a consumer packaged goods company uniquely positioned in the health and wellness sector, is pleased to announce its financial and operating results for the three and six months ended December 31, 2025 (\"</span><strong class=\"root-Tkn6WL2y\"><span>Q2 2026</span></strong><span>\"). The Delivra Health portfolio features innovative brands Dream Water® and LivRelief™, which deliver relief from common health issues such as sleeplessness, chronic pain and anxiety.</span></p><p class=\"\"><span>During the first half of fiscal 2026, the Company has seen encouraging momentum in its targeted e-commerce strategy and continued growth within the Dream Water® brand. Year-to-date e-commerce sales increased 26% for Dream Water® and 28% for LivRelief™, reflecting strong consumer engagement and repeat purchasing behavior. At the same time, overall revenue has been impacted by temporary shifts in customer ordering patterns across certain retail markets, along with the transition of our licensed LivRelief™ Infused distribution channel. While these factors have created near-term variability in reported results, underlying consumer demand for the Company's core brands remains solid, and management is actively addressing fluctuations in distribution timing and engaging in channel optimization to stabilize and accelerate growth in the second half of fiscal 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Management Commentary</span></strong></p><p class=\"\"><span>\"While our results this quarter reflect temporary timing variability in certain retail markets, we are encouraged by the strength of our core business fundamentals. Our targeted e-commerce strategy continues to deliver measurable growth, our U.S. expansion remains a key driver, and consumer demand for both Dream Water® and LivRelief™ continues to develop,\" said Gord Davey, President and Chief Executive Officer of Delivra Health Brands Inc. \"We are focused on disciplined execution — strengthening distribution, optimizing customer mix, advancing innovation, and investing in scalable revenue channels. As we move through the second half of fiscal 2026, our priority remains clear: stabilize retail ordering patterns, reignite growth in licensed markets, and continue expanding high-margin direct-to-consumer and U.S. retail opportunities. We believe these initiatives position us well to return to consistent revenue growth while maintaining financial responsibility.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights for the Three Months Ended December 31, 2025</span></strong></p><p class=\"\"><em><span>(</span><strong class=\"root-Tkn6WL2y\"><span>Expressed in thousands of Canadian dollars, except share and per share amounts)</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net revenue:</span></strong><span> In the three months ended December 31, 2025, the Company reported total net revenue of $2,433 as compared to $2,754 in same period last year, representing approximately a $321 or 12% decrease. This net decrease was primarily due to lower sales of Dream Water® in the U.S. and Canada by $183, lower sales of LivRelief™ OTC by $93 impacted by the timing of customer ordering patterns and partially, offset by growing ecommerce LivRelief™ OTC sales, and finally lower sales of LivRelief™ Infused topical creams by $45 due to the transition to a new licensed distribution partner. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross profit and gross profit margin:</span></strong><span> In the three months ended December 31, 2025, the Company reported gross profit of $972 and a gross profit margin of 40% as compared to $1,294 and 47% in the same period last year. The decrease in gross profit is driven by lower revenue and higher product cost due to price increases by certain vendors and the reduction in gross profit margin was the result of a different product and customer mix in this quarter compared to same quarter last year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</span></strong><span>: In the three months ended December 31, 2025, the Company reported expenses of $1,391 as compared to $1,544 in the same period last year, representing a $153 or 10% decrease. The decrease was mainly driven by lower investments in marketing campaigns and digital marketing programs of $182 or 32%, offset by a slight increase in general and administrative costs of $29 or 3% mainly driven by increased investments in investor relation programs. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> In the three months ended December 31, 2025, the Company reported Adjusted EBITDA of $(369) as compared to $(194) in the same period last year. This reduction in Adjusted EBITDA is the result of lower sales volume and gross profit as explained above. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights for the Six Months Ended December 31, 2025</span></strong></p><p class=\"\"><em><span>(</span><strong class=\"root-Tkn6WL2y\"><span>Expressed in thousands of Canadian dollars, except share and per share amounts)</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net revenue:</span></strong><span> In the six months ended December 31, 2025, the Company reported total net revenue of $5,640 compared to $5,917 in same period last year, representing a $277 or 5% decrease. This decrease was due to higher sales of Dream Water® in the U.S and Canada by $29 offset by lower sales of LivRelief™ OTC of $61 impacted by the timing of customer ordering patterns and finally lower sales of $245 of LivRelief™ Infused topical creams due to the transition to a new distribution channel in Canada. These declines were partially offset by increased e-commerce sales of LivRelief™ OTC by 28% and Dream Water® products in Canada and USA by 26% driven by strong consumer demand and online marketing. The Company is currently reviewing its market distribution strategy for licensed LivRelief™ Infused products and intends to resume its growth strategy in the second half of fiscal 2026 and fiscal 2027.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross profit and gross profit margin:</span></strong><span> In the six months ended December 31, 2025, the Company reported year-to-date gross profit of $2,473 and a gross profit margin of 44% as compared to $2,891 and 49% in same period last year. The reduction in gross profit and gross profit margin was the result of a change in customer mix and product cost and mix. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</span></strong><span>: In the six months ended December 31, 2025, the Company reported expenses of $2,838 compared to $3,149 in the same period last year, representing a 10% decrease. Prior year fiscal 2025 first half sales and marketing expenses were higher than the first half of fiscal 2026 sales and marketing expenses by $426 or 34% given that the Company released in November 2024 two major marketing campaigns, 'Shush Your Mind' for Dream Water® and 'Quiets Chronic Pain' for LivRelief™. General and administrative costs were higher in the first half of fiscal 2026 compared with same period last year by $115 or 6% mainly as a result of higher investor relation programs and higher professional and consulting services offset by lower salaries costs. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> In the six months ended December 31, 2025, the Company reported Adjusted EBITDA of $(313) compared to $(176) in the same period last year, representing a $(137) year-over-year reduction. This reduction in Adjusted EBITDA was mainly driven by lower sales volume and lower gross profit as discussed above. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Summary of Key Financial Results </span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>Continued operations:</span></td><td><strong class=\"root-Tkn6WL2y\"><span>$</span></strong></td><td><span>$</span></td><td><strong class=\"root-Tkn6WL2y\"><span>$</span></strong></td><td><span>$</span></td></tr><tr><td><span>Net revenue</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,433 </span></strong></td><td><span> 2,754 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 5,640 </span></strong></td><td><span> 5,917 </span></td></tr><tr><td><span>Cost of sales</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 1,411 </span></strong></td><td><span> 1,404 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 3,115 </span></strong></td><td><span> 2,944 </span></td></tr><tr><td><span>Inventory write-down</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 50 </span></strong></td><td><span> 56 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 52 </span></strong></td><td><span> 82 </span></td></tr><tr><td><span>Gross profit</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 972 </span></strong></td><td><span> 1,294 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,473 </span></strong></td><td><span> 2,891 </span></td></tr><tr><td><span>Expenses excluding non-cash expenses</span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,391</span></strong></td><td><span>1,544</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,838</span></strong></td><td><span>3,149</span></td></tr><tr><td><span>Depreciation and amortization and share based compensation</span></td><td><strong class=\"root-Tkn6WL2y\"><span>31</span></strong></td><td><span>397</span></td><td><strong class=\"root-Tkn6WL2y\"><span>107</span></strong></td><td><span>794</span></td></tr><tr><td><span>Total expenses</span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,422 </span></strong></td><td><span>1,941 </span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,945</span></strong></td><td><span>3,943 </span></td></tr><tr><td><span>Loss from operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (450)</span></strong></td><td><span> (647)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (472)</span></strong></td><td><span> (1,052)</span></td></tr><tr><td><span>Other (expense) income</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 39</span></strong></td><td><span> (165)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (30) </span></strong></td><td><span> (236) </span></td></tr><tr><td><span>Net gain (loss) from continued operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (411)</span></strong></td><td><span> (812)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (502)</span></strong></td><td><span> (1,288)</span></td></tr><tr><td><span>Net gain (loss) per share - basic </span></td><td><strong class=\"root-Tkn6WL2y\"><span>(0.01)</span></strong></td><td><span>(0.03)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>(0.02)</span></strong></td><td><span>(0.04)</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span> (non-IFRS measure) </span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>Loss from operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (450)</span></strong></td><td><span> (647)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (472)</span></strong></td><td><span> (1,052)</span></td></tr><tr><td><span>Inventory write-down</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 50 </span></strong></td><td><span> 56 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 52 </span></strong></td><td><span> 82 </span></td></tr><tr><td><span>Depreciation and amortization</span></td><td><span> - </span></td><td><span> 326 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 27 </span></strong></td><td><span> 652 </span></td></tr><tr><td><span>Share-based compensation</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 31 </span></strong></td><td><span> 71 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 80 </span></strong></td><td><span> 142 </span></td></tr><tr><td><span>Adjusted EBITDA(1)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (369)</span></strong></td><td><span> (194)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (313)</span></strong></td><td><span> (176)</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses excluding non-cash items</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>General and administration</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 998 </span></strong></td><td><span> 969 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,026 </span></strong></td><td><span> 1,911 </span></td></tr><tr><td><span>Sales and marketing</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 393 </span></strong></td><td><span> 575 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 812 </span></strong></td><td><span> 1,238 </span></td></tr><tr><td><span>Total </span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,391</span></strong></td><td><span>1,544</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,838</span></strong></td><td><span>3,149</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Delivra Health Brands Inc.</span></strong></p><p class=\"\"><span>Helping people take control of their health with alternative wellness solutions is what energizes the Delivra Health team! The Delivra Health portfolio features innovative brands like Dream Water® and LivRelief™, which deliver relief from common everyday issues like chronic pain, anxiety, and sleeplessness. Delivra Health products have allowed millions of customers to reclaim their mobility, energy, and in turn, quality of life. The websites of the Company's two subsidiaries are </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/MqygRTqvYB\" rel=\"nofollow\" target=\"_blank\">Dream Water®</a><span> and </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/bg1L0c1gwy\" rel=\"nofollow\" target=\"_blank\">LivRelief</a><span>TM. For more information, please visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/3KkALce4M0\" rel=\"nofollow\" target=\"_blank\">www.delivrahealthbrands.com</a><span>. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Non-IFRS Measures, Reconciliation and Discussion</span></strong></p><p class=\"\"><span>This press release contains references to \"Adjusted EBITDA\" which is a non-International Financial Reporting Standards (\"</span><strong class=\"root-Tkn6WL2y\"><span>IFRS</span></strong><span>\") financial measure. Adjusted EBITDA is a measure of the Company's loss from operations before interest, taxes, depreciation, and amortization and adjusted for share-based compensation, common shares issued for services, fair value effects of accounting for biological assets and inventories, asset impairment and write-downs, and other non-cash items, and is a non-IFRS measure.</span></p><p class=\"\"><span>This measure can be used to analyze and compare profitability among companies and industries, as it eliminates the effects of financing and capital expenditures. It is often used in valuation ratios and can be compared to enterprise value and revenue. This measure does not have any standardized meaning according to IFRS and, therefore, may not be comparable to similar measures presented by other companies.</span></p><p class=\"\"><span>There are no comparable IFRS financial measures presented in Delivra Health's financial statements. Reconciliations of the supplemental non-IFRS measure are presented in the Company's management discussion and analysis for the three and six months ended December 31, 2025 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Q2 2026 MD&amp;A</span></strong><span>\"). This non-IFRS financial measure is presented because management has evaluated the financial results both including and excluding the adjusted items and believes that the non-IFRS financial measure presented provides additional perspective and insights when analyzing the core operating performance of the business. The Company believes that the supplemental measure provides information which is useful to shareholders and investors in understanding the Company's performance and may assist in the evaluation of the Company's business relative to that of its peers.</span></p><p class=\"\"><span>The non-IFRS financial measure should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with the IFRS financial measures presented in the Company's financial statements. For more information, please see \"Adjusted EBITDA (non-IFRS measure)\" and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A, which is available under the Company's SEDAR+ profile on www.sedarplus.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Notes:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>This is a non-IFRS reporting measure. For a reconciliation of this measure to the nearest IFRS measure, see \"Adjusted EBITDA (non-IFRS measure)\" and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cautionary Note Regarding Forward-Looking Statements</span></strong></p><p class=\"\"><span>This news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates, and projections as at the date of this news release. Any statement that involves discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. In this news release, forward-looking statements include, among other things, statements with respect to the Company's products offering relief from chronic pain, anxiety, and sleeplessness, impacts of the Company's latest marketing campaigns, expectations regarding expansion opportunities including the Company's U.S. expansion, ongoing consumer demand for the Company's products, stabilization of retail ordering patterns, expectations regarding increases in the Company's revenues and profitability, increases in consumer demand, the Company's ability to expand high-margin direct-to-consumer and U.S. retail opportunities, and the Company's growth objectives and strategy, growth in new markets, and new distribution channels.</span></p><p class=\"\"><span>These forward-looking statements are based on reasonable assumptions and estimates of management of the Company at the time such statements were made. Actual future results may differ materially as forward-looking statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of the Company to materially differ from any future results, performance, or achievements expressed or implied by such forward-looking statements. Such factors, among other things, include: fluctuations in general macroeconomic conditions; fluctuations in securities markets; expectations regarding the size of the cannabis markets where the Company operates; changing consumer habits; the ability of the Company to successfully achieve its business objectives; plans for expansion; political and social uncertainties; inability to obtain adequate insurance to cover risks and hazards; employee relations and the presence of laws and regulations that may impose restrictions on cultivation, production, distribution, and sale of cannabis and cannabis-related products in the markets where the Company operates. Although the forward-looking statements contained in this news release are based upon what management of the Company believes, or believed at the time, to be reasonable assumptions, the Company cannot assure shareholders that actual results will be consistent with such forward-looking statements, as there may be other factors that cause results not to be as anticipated, estimated or intended. Readers should not place undue reliance on the forward-looking statements and information contained in this news release. The Company assumes no obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by law.</span></p><p class=\"\"><span>Additional information regarding this and other risks and uncertainties relating to the Company's business are contained under the heading \"Risk Factors\" in the Company's annual information form dated March 2, 2021, and under the heading \"Risks and Uncertainties\" in the Q2 2026 MD&amp;A filed under the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><em><span>Neither TSX-V nor its Regulation Services Provider (as that term is defined in the policies of the TSX-V) accept responsibility for the adequacy or accuracy of this release.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Relations:</span></strong></p><p class=\"\"><span>Jack Tasse</span></p><p class=\"\"><span>Chief Financial Officer</span></p><p class=\"\"><span>IR@delivrahealth.com</span></p><p class=\"\"><span>1-877-915-7934</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:a79701387094b:0-delivra-health-and-its-brands-livrelief-tm-and-dream-water-tm-report-results-for-second-quarter-of-fiscal-2026/",
            "pub_date": "2026-02-28 07:45:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        }
    ]
}