{
    "data": [
        {
            "id": "DJN_DN20260226008870:0",
            "title": "Delcath Systems Reports Fourth Quarter and Full Year 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(13:00 GMT) </span></strong><span>*Delcath Systems 4Q Loss/Shr 5c &gt;DCTH</span><br/><strong class=\"root-Tkn6WL2y\"><span>(13:00 GMT) </span></strong><span>Press Release: Delcath Systems Reports Fourth Quarter and Full Year 2025 Results</span></p><p class=\"\"><span>Conference Call Today at 8:30 a.m. Eastern Time</span></p><p class=\"\"><span>QUEENSBURY, N.Y.--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>Delcath Systems, Inc. </span><span> (\"Delcath\" or the \"Company\"), an interventional oncology company focused on the treatment of primary and metastatic cancers of the liver, today reported financial results and business highlights for the fourth quarter and full year-ended December 31, 2025.</span></p><p class=\"\"><span>Fourth Quarter and Full Year 2025 Financial Results</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total fourth quarter and full year revenue of $20.7 million and $85.2   million, respectively   </span><br/><span> -- HEPZATO KIT(TM) fourth quarter and full year revenue of $19.0 </span><br/><span> million and $78.8 million, respectively   </span><br/><span> -- CHEMOSAT(R) fourth quarter and full year revenue of $1.7 million </span><br/><span> and $6.4 million, respectively       </span></li><li class=\"listItem-bmN0_SHH\"><span>Gross margins of 85% for the fourth quarter and 86% for the full year     </span></li><li class=\"listItem-bmN0_SHH\"><span>Fourth quarter net loss of $1.9 million and full year net income of   $2.7 million   </span></li><li class=\"listItem-bmN0_SHH\"><span>Non-GAAP positive adjusted EBITDA for the fourth quarter and full year   of $2.4 million and $25.1 million, respectively   </span></li><li class=\"listItem-bmN0_SHH\"><span>Repurchased 628,572 common shares for $6.0 million through December 31,   2025 under the approved $25 million Share Buyback Program   </span></li><li class=\"listItem-bmN0_SHH\"><span>As of December 31, 2025, the Company had approximately $91.0 million of   cash and short-term investments and no debt </span></li></ul><p class=\"\"><span>Business Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Currently 28 active centers   </span></li><li class=\"listItem-bmN0_SHH\"><span>Approximately 140% growth in HEPZATO procedure volume in 2025 compared   to 2024   </span></li><li class=\"listItem-bmN0_SHH\"><span>Announced the publication of additional results from the FOCUS study,   \"Subgroup Analyses of the Phase 3 FOCUS Study of Melphalan/Hepatic   Delivery System in Patients with Unresectable Metastatic Uveal Melanoma\"   in Journal of Cancer Research and Clinical Oncology   </span></li><li class=\"listItem-bmN0_SHH\"><span>Announced the publication of results from multiple studies by   independent investigators, including:   </span><br/><span> -- Results from the Phase 2 CHOPIN trial sponsored by Leiden </span><br/><span> University Medical Center evaluating CHEMOSAT with ipilimumab and   nivolumab in metastatic uveal melanoma at the 2025 European   Society of Medical Oncology Annual Congress showing a significant   improvement in one-year progression-free survival versus CHEMOSAT   alone   </span><br/><span> -- A long-term retrospective study conducted by researchers at the </span><br/><span> University Hospital Tübingen, Germany, \"Characterization of   long-term survivors with liver metastases from uveal melanoma   diagnosed between 2005 and 2021\", in International Journal of   Cancer   </span><br/><span> -- A long-term retrospective study conducted by researchers at the </span><br/><span> Asklepios Hospital Barmbek, Germany, \"Survival Outcome After   Percutaneous Hepatic Perfusion with High-Dose Melphalan for   Liver-Dominant Metastatic Uveal Melanoma: A 10-Year Single-Center   Experience\" in Cancers     </span></li></ul><p class=\"\"><span>\"2025 was a pivotal year in which we delivered robust procedure-volume growth, positive operating cashflow and successfully navigated temporary headwinds to stabilize the HEPZATO revenue base in the fourth quarter,\" said Gerard Michel, President and Chief Executive Officer of Delcath \"With 28 active treatment centers now delivering therapy and compelling CHOPIN data demonstrating clear clinical benefit when PHP is sequenced with checkpoint inhibitors, we enter 2026 with strong momentum. Through continued site activations, commercial expansion, and heightened physician awareness of the CHOPIN results, we expect accelerated adoption and utilization that will drive long-term value for patients and shareholders alike.\"</span></p><p class=\"\"><span>2026 Full Year Financial Guidance</span></p><p class=\"\"><span>The Company's financial outlook for fiscal year 2026:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total CHEMOSAT and HEPZATO KIT revenue to be at least $100 million,   reflecting an increase in HEPZATO KIT volume of at least 20% over 2025,   and   </span></li><li class=\"listItem-bmN0_SHH\"><span>Gross margins in the range of 84% to 87%. </span></li></ul><p class=\"\"><span>Fourth Quarter and Full Year 2025 Results</span></p><p class=\"\"><span>Total revenue for the quarter ended December 31, 2025 was $20.7 million compared to $15.1 million for the same period in the prior year. Revenue in the quarter includes sales of $19.0 million of HEPZATO in the U.S. and $1.7 million of CHEMOSAT in Europe.</span></p><p class=\"\"><span>Total revenue for the year-ended December 31, 2025 was $85.2 million compared to $37.2 million for the same period in the prior year. Revenue in 2025 includes sales of $78.8 million of HEPZATO in the U.S. and $6.4 million of CHEMOSAT in Europe.</span></p><p class=\"\"><span>Research and development expenses for the quarter and year-ended December 31, 2025, were $9.4 million and $29.2 million, respectively compared to $2.9 million and $13.9 million for the same periods in the prior year. The increase is primarily due to costs associated with expanding the clinical team including share-based compensation expense related to an increase in headcount and initiation of the Phase 2 clinical trial evaluating HEPZATO in combination with standard of care for mCRC and mBC. In 2024, these costs are primarily related to medical affairs and regulatory costs associated with the approved products.</span></p><p class=\"\"><span>Selling, general and administrative expenses for the quarter and year-ended December 31, 2025, were $10.5 million and $43.5 million, respectively compared to $7.0 million and $29.6 million for the same periods in the prior year. The increase is primarily due to continued commercial expansion activities including marketing-related expenses and additional personnel on the commercial team. In addition, the increase in personnel along with higher grant date exercise prices has increased the share-based compensation expense.</span></p><p class=\"\"><span>Net loss for the quarter ended December 31, 2025 was $1.9 million and net income for the full year was $2.7 million, compared to net loss of $3.4 million and $26.4 million for the same periods in the prior year.</span></p><p class=\"\"><span>Non-GAAP positive adjusted EBITDA for the quarter and year-ended December 31, 2025 was $2.4 million and $25.1 million compared to adjusted EBITDA gain of $4.6 million and loss of $2.5 million for the same periods in the prior year. A table reconciling non-GAAP measures is included in this press release for reference.</span></p><p class=\"\"><span>As of December 31, 2025, the Company had $91.0 million in cash and investments, and no debt.</span></p><p class=\"\"><span>Conference Call Information</span></p><p class=\"\"><span>To participate in this event, dial in approximately 5 to 10 minutes before the beginning of the call.</span></p><p class=\"\"><span>Event Date: Thursday, February 26, 2026</span></p><p class=\"\"><span>Time: 8:30 AM Eastern Time</span></p><p class=\"\"><span>Participant Numbers:</span></p><p class=\"\"><span>Toll Free: 1-877-407-3982</span></p><p class=\"\"><span>International: 1-201-493-6780</span></p><p class=\"\"><span>Webcast: https://viavid.webcasts.com/starthere.jsp?ei=1747469&amp;tp_key=15ec7bd15c</span></p><p class=\"\"><span>A replay of the webinar will be available shortly after the conclusion of the call and will be archived on the company's website https://investors.delcath.com/news-events/events-and-presentations.</span></p><p class=\"\"><span>GAAP v. Non-GAAP Measures</span></p><p class=\"\"><span>Delcath's reported earnings are prepared in accordance with generally accepted accounting principles in the United States, or GAAP, and represent earnings as reported to the Securities and Exchange Commission. Delcath has provided in this release certain financial information that has not been prepared in accordance with GAAP. Delcath's management believes that the non-GAAP adjusted EBITDA described in this release, which includes adjustments for specific items that are generally not indicative of our core operations, provides additional information that is useful to investors in understanding Delcath's underlying performance, business and performance trends, and helps facilitate period-to-period comparisons and comparisons of its financial measures with other companies in Delcath's industry. However, the non-GAAP financial measures that Delcath uses may differ from measures that other companies may use. Non-GAAP financial measures are not required to be uniformly applied, are not audited and should not be considered in isolation or as substitutes for results prepared in accordance with GAAP.</span></p><p class=\"\"><span>About Delcath Systems, Inc., HEPZATO KIT and CHEMOSAT</span></p><p class=\"\"><span>Delcath Systems, Inc. is an interventional oncology company focused on the treatment of primary and metastatic liver cancers. The company's proprietary products, HEPZATO KIT (HEPZATO (melphalan) for Injection/Hepatic Delivery System) and CHEMOSAT Hepatic Delivery System (HDS) for Melphalan percutaneous hepatic perfusion (PHP), are designed to administer high-dose chemotherapy to the liver while controlling systemic exposure and associated side effects during a PHP procedure.</span></p><p class=\"\"><span>In the United States, HEPZATO KIT is considered a combination drug and device product and is regulated and approved for sale as a drug by the FDA. HEPZATO KIT is comprised of the chemotherapeutic drug melphalan and Delcath's proprietary HDS. The HDS is used to isolate the hepatic venous blood from the systemic circulation while simultaneously filtrating hepatic venous blood during melphalan infusion and washout. The use of the HDS results in loco-regional delivery of a relatively high melphalan dose, which can potentially induce a clinically meaningful tumor response with minimal hepatotoxicity and reduce systemic exposure. HEPZATO KIT is approved in the United States as a liver-directed treatment for adult patients with metastatic uveal melanoma (mUM) with unresectable hepatic metastases affecting less than 50% of the liver and no extrahepatic disease, or extrahepatic disease limited to the bone, lymph nodes, subcutaneous tissues, or lung that is amenable to resection or radiation. Please see the full Prescribing Information, including BOXED WARNING for the HEPZATO KIT.</span></p><p class=\"\"><span>In Europe, the device-only configuration of the HDS is regulated as a Class III medical device and is approved for sale under the trade name CHEMOSAT Hepatic Delivery System for Melphalan, or CHEMOSAT, where it has been used in the conduct of percutaneous hepatic perfusion procedures at major medical centers to treat a wide range of cancers of the liver.</span></p><p class=\"\"><span>Safe Harbor / Forward-Looking Statements</span></p><p class=\"\"><span>The Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements made by the Company or on its behalf. This press release contains forward-looking statements, including the Company's statements regarding the possible synergy seen in the successful Phase 2 CHOPIN Trial being transferable to clinical practice; Company's 2026 financial outlook, which are subject to certain risks and uncertainties, that can cause actual results to differ materially from those described. The words \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"target,\" \"will,\" \"would\" and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Factors that may cause such differences include, but are not limited to, uncertainties relating to: the Company's commercialization plans and its ability to successfully commercialize the HEPZATO KIT; contributions to adjusted EBITDA; the Company's successful management of the HEPZATO KIT supply chain, including securing adequate supply of critical components necessary to manufacture and assemble the HEPZATO KIT; successful FDA inspections of the facilities of the Company and those of its third-party suppliers/manufacturers; the Company's successful implementation and management of the HEPZATO KIT Risk Evaluation and Mitigation Strategy; the potential benefits of the HEPZATO KIT as a treatment for patients with primary and metastatic disease in the liver; the Company's ability to obtain reimbursement for the HEPZATO KIT; and the Company's ability to successfully enter into any necessary purchase and sale agreements with users of the HEPZATO KIT. For additional information about these factors, and others that may impact the Company, please see the Company's filings with the Securities and Exchange Commission, including those on Forms 10-K, 10-Q, and 8-K. However, new risk factors and uncertainties may emerge from time to time, and it is not possible to predict all risk factors and uncertainties. Accordingly, you should not place undue reliance on these forward-looking statements, which speak only as of the date they are made. We undertake no obligation to publicly update or revise these forward-looking statements to reflect events or circumstances after the date they are made.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span> </span><br/><span>                          DELCATH SYSTEMS, INC. </span><br/><span>                   Condensed Consolidated Balance Sheets </span><br/><span>                                (Unaudited) </span><br/><span>              (in thousands, except share and per share data) </span><br/><span> </span><br/><span> </span><br/><span>                                         December 31,      December 31, </span><br/><span>                                              2025              2024 </span><br/><span>                                        ---------------  ----------------- </span><br/><span>Assets </span><br/><span>Current assets </span><br/><span>   Cash and cash equivalents             $      43,454    $      32,412 </span><br/><span>   Short-term investments                       47,582           20,821 </span><br/><span>   Accounts receivable                          11,744           10,890 </span><br/><span>   Inventories                                  10,252            6,933 </span><br/><span>   Prepaid expenses and other current </span><br/><span>    assets                                       6,498            2,704 </span><br/><span>                                            ----------       ---------- </span><br/><span>      Total current assets                     119,530           73,760 </span><br/><span>   Property, plant and equipment, net            3,166            1,790 </span><br/><span>   Right-of-use assets                             936            1,039 </span><br/><span>                                            ----------       ---------- </span><br/><span>         Total assets                    $     123,632    $      76,589 </span><br/><span>                                            ==========       ========== </span><br/><span>Liabilities and Stockholders' Equity </span><br/><span>Current liabilities </span><br/><span>   Accounts payable                      $       2,658    $         961 </span><br/><span>   Accrued expenses                              8,191            5,078 </span><br/><span>   Lease liabilities, current                      101              105 </span><br/><span>                                            ----------       ---------- </span><br/><span>      Total current liabilities                 10,950            6,144 </span><br/><span>   Lease liabilities, non-current                  835              933 </span><br/><span>   Other liabilities, non-current                  628              766 </span><br/><span>                                            ----------       ---------- </span><br/><span>         Total liabilities                      12,413            7,843 </span><br/><span>                                            ----------       ---------- </span><br/><span>Commitments and contingencies </span><br/><span>Stockholders' equity </span><br/><span>   Preferred stock, $.01 par value; </span><br/><span>   10,000,000 shares authorized; </span><br/><span>   24,819 and 11,357 shares issued and </span><br/><span>   outstanding at December 31, 2023 </span><br/><span>   and 2022, respectively                           --               -- </span><br/><span>   Common stock, $.01 par value; </span><br/><span>    80,000,000 shares authorized; </span><br/><span>    22,761,554 shares and 10,046,571 </span><br/><span>    shares issued and outstanding at </span><br/><span>    December 31, 2023 and 2022, </span><br/><span>    respectively                                   347              331 </span><br/><span>   Additional paid-in capital                  639,145          599,881 </span><br/><span>   Accumulated deficit                        (528,848)        (531,548) </span><br/><span>   Accumulated other comprehensive </span><br/><span>    income                                         575               82 </span><br/><span>                                            ----------       ---------- </span><br/><span>      Total stockholders' equity               111,219           68,746 </span><br/><span>                                            ----------       ---------- </span><br/><span>         Total liabilities and </span><br/><span>          stockholders' equity           $     123,632    $      76,589 </span><br/><span>                                            ==========       ========== </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span> DELCATH SYSTEMS, INC. Condensed Consolidated Statements of Operations and </span><br/><span>Comprehensive Income (Loss) (Unaudited) (in thousands, except share and per </span><br/><span>                                share data) </span><br/><span> </span><br/><span> </span><br/><span>                        Three months ended               Year ended </span><br/><span>                           December 31,                 December 31, </span><br/><span>                    --------------------------  ---------------------------- </span><br/><span>                        2025          2024          2025          2024 </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>Product revenue          20,728        15,100   $    85,231   $    37,205 </span><br/><span>Cost of goods sold       (3,010)       (2,126)      (11,797)       (6,188) </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>   Gross profit          17,718        12,974        73,434        31,017 </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>Operating </span><br/><span>expenses: </span><br/><span>   Research and </span><br/><span>    development </span><br/><span>    expenses              9,371         2,914        29,246        13,874 </span><br/><span>   Selling, </span><br/><span>    general and </span><br/><span>    administrative </span><br/><span>    expenses             10,531         7,021        43,528        29,553 </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>      Total </span><br/><span>       operating </span><br/><span>       expenses          19,902         9,935        72,774        43,427 </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>      Operating </span><br/><span>       income </span><br/><span>       (loss)            (2,184)        3,039           660       (12,410) </span><br/><span>Change in fair </span><br/><span> value of warrant </span><br/><span> liability                   --        (6,679)           --       (14,071) </span><br/><span>Interest income, </span><br/><span> net                        857           295         2,920           125 </span><br/><span>Other expense                (7)          (53)          (70)          (30) </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>      Income </span><br/><span>       (loss) </span><br/><span>       before </span><br/><span>       income </span><br/><span>       taxes             (1,334)       (3,398)        3,510       (26,386) </span><br/><span>Income tax expense          562            --           810            -- </span><br/><span>      Net income </span><br/><span>       (loss)            (1,896)       (3,398)        2,700       (26,386) </span><br/><span>Other </span><br/><span>comprehensive </span><br/><span>income (loss): </span><br/><span>Unrealized gain on </span><br/><span> investments </span><br/><span> adjustments               (198)          125           394           (22) </span><br/><span>Foreign currency </span><br/><span> translation </span><br/><span> adjustments               (102)          (54)           99           (31) </span><br/><span>                     ----------    ----------    ----------    ---------- </span><br/><span>Total </span><br/><span> comprehensive </span><br/><span> income (loss)      $    (2,196)  $    (3,327)  $     3,193   $   (26,439) </span><br/><span>                     ==========    ==========    ==========    ========== </span><br/><span>Common share data: </span><br/><span>   Basic income </span><br/><span>    (loss) per </span><br/><span>    common share    $     (0.05)  $     (0.11)  $      0.08   $     (0.93) </span><br/><span>                     ==========    ==========    ==========    ========== </span><br/><span>   Weighted </span><br/><span>    average number </span><br/><span>    of basic </span><br/><span>    shares </span><br/><span>    outstanding      36,445,905    32,014,365    35,821,157    28,511,393 </span><br/><span>                     ==========    ==========    ==========    ========== </span><br/><span>   Diluted income </span><br/><span>    (loss) per </span><br/><span>    common share    $     (0.05)  $     (0.11)  $      0.07   $     (0.93) </span><br/><span>                     ==========    ==========    ==========    ========== </span><br/><span>   Weighted </span><br/><span>    average number </span><br/><span>    of diluted </span><br/><span>    shares </span><br/><span>    outstanding      36,445,905    32,014,365    39,919,557    28,511,393 </span><br/><span>                     ==========    ==========    ==========    ========== </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>DELCATH SYSTEMS, INC. Reconciliation of Reported Net Income </span><br/><span>    (Loss) (GAAP) to Adjusted EBITDA (NON-GAAP Measure) </span><br/><span>                        (Unaudited) </span><br/><span> </span><br/><span> </span><br/><span>                  Three months ended   Twelve months ended </span><br/><span>(in thousands)       December 31,          December 31, </span><br/><span>                  ------------------  --------------------- </span><br/><span>                    2025      2024      2025      2024 </span><br/><span>                   ------    ------    ------    ------- </span><br/><span>Net income </span><br/><span> (loss)           $(1,896)  $(3,398)  $ 2,700   $(26,386) </span><br/><span>   Stock-based </span><br/><span>    compensation </span><br/><span>    expense         4,512     1,612    24,232      9,767 </span><br/><span>   Depreciation        80        38       238        134 </span><br/><span>   Net interest </span><br/><span>    (income) </span><br/><span>    expense          (857)     (295)   (2,920)      (125) </span><br/><span>   Fair value </span><br/><span>    warrant </span><br/><span>    adjustment         --     6,679        --     14,071 </span><br/><span>   Income tax </span><br/><span>    expense           562        --       810         -- </span><br/><span>                   ------    ------    ------    ------- </span><br/><span>Adjusted EBITDA </span><br/><span> (Non-GAAP)       $ 2,401   $ 4,636   $25,060   $ (2,539) </span><br/><span>                   ======    ======    ======    ======= </span><br/><span> </span></pre><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260226305802/en/</span></p><p class=\"\"><span>CONTACT:    Investor Relations Contact:</span></p><p class=\"\"><span>ICR Healthcare</span></p><p class=\"\"><span>investorrelations@delcath.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008870:0/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008870_20260226008870:0",
            "title": "Delcath Systems 4Q Loss/Shr 5c >DCTH",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008870_20260226008870:0/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:263eb6d271b70:0",
            "title": "DOVRE GROUP’S FINANCIAL STATEMENT RELEASE 1.1.–31.12.2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Dovre Group Plc | Stock Exchange Release | February 26, 2026, at 3:00 PM</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The information presented in the report has not been audited.</span></strong></p><p class=\"\"><span>Suvic Oy, the Group’s largest subsidiary in terms of revenue, was declared bankrupt by a decision of the Oulu District Court on January 7, 2026. As a result of the bankruptcy of Suvic Oy, the Dovre Group lost control over the Suvic sub-group, which has been transferred to the administration of the bankruptcy estate. At the date of signing of the Financial Statements Release, the assets and liabilities of the Suvic sub-group are under the control of the respective bankruptcy estates.</span></p><p class=\"\"><span>The situation of Suvic had an immediate impact on the entire Dovre Group, and Dovre Group Plc filed for debt restructuring proceedings on January 19, 2026. On January 28, 2026, the Western Uusimaa District Court ordered the commencement of standard debt restructuring proceedings.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Measurement principles</span></strong></p><p class=\"\"><span>With respect to the Dovre Group, the financial statements have not been prepared on a going concern basis. The declaration of Suvic’s bankruptcy has resulted in the loss of control after the reporting date, and the going concern assumption is no longer applicable. Assets have been measured at no more than the amount of the entities’ total liabilities, taking into account the impairment effects arising from the expected loss of receivables to be realised in bankruptcy.</span></p><p class=\"\"><span>The measurement of the remaining Group assets is based on an estimate of their recoverable amounts.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Estimation of distribution</span></strong></p><p class=\"\"><span>In bankruptcy proceedings, the assets of the bankruptcy estate are first used to settle administrative expenses (estate liabilities), such as the remuneration of the bankruptcy administrator and other realisation and administration costs. Thereafter, claims, such as taxes, social security contributions and wage claims, are settled. Only after these liabilities have been satisfied may distributions be made to unsecured creditors.</span></p><p class=\"\"><span>The proceeds from the realisation of assets are expected to be fully absorbed by estate liabilities and secured claims. Accordingly, no distribution is expected to be available for unsecured creditors, including the parent company.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Recognition of impairment losses</span></strong></p><p class=\"\"><span>In the parent company, Dovre Group Plc, a full impairment loss has been recognised on intra-group receivables, as the recoverable amount has been assessed as nil due to the absence of an expected distribution. A full impairment loss has also been recognised on investments in subsidiaries within the Suvic sub-group, as no recoveries are expected to be received by the parent company from the bankruptcy proceedings.</span></p><p class=\"\"><span>In determining the carrying amounts of assets, factors inherent in bankruptcy proceedings have been taken into consideration. Realisation values in bankruptcy are systematically lower than market-based values, as sales occur under distressed conditions, the pool of potential buyers is limited, realisation is subject to time constraints, and the assets are often entity-specific without an active secondary market.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Uncertainties</span></strong></p><p class=\"\"><span>The measurements involve significant uncertainty. The final distribution will be determined upon completion of the bankruptcy proceedings and depends on several factors that will be confirmed during the process.</span></p><p class=\"\"><span>The realisable value of assets depends on prevailing market conditions, the number of potential buyers and the method of realisation selected. The assets of the bankruptcy estate may increase as a result of successful recovery actions, while the final amount of creditors’ claims will be determined in the claims verification process. Administrative and realisation costs of the estate depend on the duration and complexity of the proceedings.</span></p><p class=\"\"><span>Estimates will be revised in future periods if circumstances change materially or if new relevant information becomes available. Any changes to impairment losses will be recognised in profit or loss in the period in which the change becomes known. The final distribution, if any, will be recognised in profit or loss when it has been confirmed or when the bankruptcy proceedings have been concluded.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CEO MARKKU TASKINEN:</span></strong></p><p class=\"\"><span>In the financial year 2025, Dovre Group’s operations were clearly loss-making.</span></p><p class=\"\"><span>During the year, Dovre Group’s strategic focus was clarified and the Group’s operations became increasingly concentrated on renewable energy construction and enabling the green transition. At the beginning of 2025, the sale of the Project Personnel and Norwegian Consulting businesses to NYAB AB was completed. Following the transaction, Dovre’s continuing operations have been almost entirely focused on renewable energy, with its core formed by the subsidiary Suvic Oy.</span></p><p class=\"\"><span>During 2025, Dovre Group announced on several occasions losses in projects of its subsidiary Suvic Oy and their financial impact. In connection with the negative profit warning published on March 12, 2025, the company reported significant cost overruns in two wind power projects initiated in Sweden during 2024 and estimated total losses of EUR 8.7 million and EUR 10 million from these projects, which were recognised in 2024 as the projects continued into spring 2025. Subsequently, in connection with the negative profit warning issued on July 8, 2025, the company announced that the previously reported losses were estimated to be approximately EUR 5 million higher than earlier estimated, totalling approximately EUR 23.7 million. In the negative profit warning published on October 9, 2025, the company estimated, based on an updated assessment, that an additional EUR 4.0 million in losses would be recognised from the Swedish wind farm projects, bringing the total estimated losses from the Swedish project portfolio to EUR 27.7 million, of which EUR 18.7 million was recognised in 2024 and EUR 9.0 million in 2025.</span></p><p class=\"\"><span>Despite the challenging situation, Dovre continued to identify significant long-term opportunities in the renewable energy value chain. The strategic focus was based on market outlook, but its implementation coincided with a period marked by exceptional operational challenges.</span></p><p class=\"\"><span>Measures to address the situation were accelerated during the spring, as the Board of Directors together with executive management launched an action programme to improve Suvic Oy’s competitiveness, operational efficiency and governance processes. During the second quarter, Markku Taskinen was appointed CEO of Suvic (commencing on August 4, 2025), and Olli-Pekka Vanhanen was appointed CFO of Suvic while also serving as CFO of the Group. In September, experienced transformation executive Timo Saarinen was appointed Interim CFO of both Dovre Group and Suvic. The company assessed at that time that, through strengthened leadership, improved transparency of financial administration processes and enhanced financial reporting of projects, it had achieved an accurate view of Suvic’s business situation during the third quarter. Corrective actions continued towards the end of the year to improve profitability, organisational structure and operating models.</span></p><p class=\"\"><span>In October, Dovre announced a Group-wide structural review aimed at focusing resources on operations in line with the strategy within renewable energy projects. The company estimated that, as a result of the programme, unprofitable or non-strategic operations would be divested or discontinued. With regard to the Consulting segment’s Proha and eSite businesses, it was stated in the release published on October 29, 2025, that these would no longer represent Dovre’s strategic core business.</span></p><p class=\"\"><span>The significant difficulties encountered in projects of Suvic Oy, Dovre’s subsidiary responsible for renewable energy construction, materially weakened the Group’s financial position. The main underlying factors behind the losses were identified as errors in project cost estimation, deficiencies in project management capabilities and shortcomings in forward-looking reporting. The challenges accumulated across several simultaneous projects and had severe effects on the company’s liquidity. As a result, Suvic Oy filed for bankruptcy on January 2, 2026, and was declared bankrupt on January 7, 2026.</span></p><p class=\"\"><span>The year 2026 began with Dovre Group Plc being unable to meet its obligations as they fall due and therefore being insolvent. This was due to the financial situation of Suvic Oy and, in this context, the parent company guarantees issued by Dovre Group Plc in respect of Suvic Oy’s and its sub-group’s projects, as announced on January 2, 2026. Dovre Group Plc filed for the commencement of debt restructuring proceedings on January 19, 2026. On January 28, 2026, the Western Uusimaa District Court ordered the commencement of standard debt restructuring proceedings. A successful restructuring process would enable Dovre Group Plc to avoid bankruptcy and would allow the Group and/or the parent company to remain a going concern.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>October–December 2025</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Net sales grew by 23.6 % to EUR 33.3 (27.0) million. The growth was driven by Renewable Energy segment.</span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Renewable Energy: net sales totalled EUR 32.8 (26.5) million – increase of 23.9 %.</span></li><li class=\"listItem-bmN0_SHH\"><span>Consulting: Net sales totalled EUR 0.5 (0.5) million – increase of 11.3%.</span></li></ul></li><li class=\"listItem-bmN0_SHH\"><span>EBITDA was EUR –37.7 (-17.9) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Operating profit was EUR –43.9 (-18.3) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Profit before tax was EUR -43.0 (-18.6) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Earnings for the shareholders of the parent company EUR –48.5 (-8.2) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Earnings per share were EUR -0.458 (0.077).</span></li><li class=\"listItem-bmN0_SHH\"><span>Net cash flow from operating activities totalled EUR -2.7 (-2.0) million.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>January–December 2025</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Net sales declined by 7,5% to EUR 91.9 (99.3) million.</span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Renewable Energy: net sales totalled EUR 90.1 (97.4) million – decrease of 7.5 %</span></li><li class=\"listItem-bmN0_SHH\"><span>Consulting: Net sales totalled EUR 1.8 (1.9) million – increase of 8.1 %</span></li></ul></li><li class=\"listItem-bmN0_SHH\"><span>EBITDA was EUR –59.3(-21.1) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Operating profit was EUR -66.3 (-21.8) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Profit before tax was EUR –67.0 (-22.8) million including EUR -0.7 (-1.0) million of finance items.</span></li><li class=\"listItem-bmN0_SHH\"><span>Earnings for the shareholders of the parent company were EUR –58.2 (-8.3) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>Earnings per share totalled EUR -0.496(-0.078).</span></li><li class=\"listItem-bmN0_SHH\"><span>Net cash flow from operating activities was EUR -2.6 (-4.4) million.</span></li><li class=\"listItem-bmN0_SHH\"><span>The Board of Directors proposes that no dividend is paid for the financial year 2025 based on the annual general meeting on April 15th, 2026.</span></li></ul><p class=\"\"><em><span>Last year’s corresponding period is shown in parentheses.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>OUTLOOK FOR 2026</span></strong></p><p class=\"\"><span>Dovre Group does not provide financial outlook guidance for 2026 in connection with the publication of the Financial Statements Release, as announced in a stock exchange release on February 18, 2026. The reason for this is the company’s ongoing debt restructuring proceedings.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>GROUP’S KEY FIGURES</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>EUR million</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>10–12 2025</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>10–12 2024</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Change %</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>1–12 2025</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>1–12 2024</span></strong></td><td colspan=\"1\" rowspan=\"1\"><strong class=\"root-Tkn6WL2y\"><span>Change %</span></strong></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Net sales</span></td><td colspan=\"1\" rowspan=\"1\"><span>33,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>27,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>23,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>91,9</span></td><td colspan=\"1\" rowspan=\"1\"><span>99,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-7,5</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>EBITDA</span></td><td colspan=\"1\" rowspan=\"1\"><span>-37,7</span></td><td colspan=\"1\" rowspan=\"1\"><span>-17,9</span></td><td colspan=\"1\" rowspan=\"1\"><span>-110,4</span></td><td colspan=\"1\" rowspan=\"1\"><span>-59,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-21,1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-180,9</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>% of net sales</span></td><td colspan=\"1\" rowspan=\"1\"><span>-113,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>-66,5</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>-64,5</span></td><td colspan=\"1\" rowspan=\"1\"><span>-21,3</span></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Operating profit (EBIT)</span></td><td colspan=\"1\" rowspan=\"1\"><span>-43,9</span></td><td colspan=\"1\" rowspan=\"1\"><span>-18,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-140,1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-66,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-21,8</span></td><td colspan=\"1\" rowspan=\"1\"><span>-204,2</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>% of net sales</span></td><td colspan=\"1\" rowspan=\"1\"><span>-131,8</span></td><td colspan=\"1\" rowspan=\"1\"><span>-67,7</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>-72,2</span></td><td colspan=\"1\" rowspan=\"1\"><span>-22,0</span></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Profit before taxes</span></td><td colspan=\"1\" rowspan=\"1\"><span>-43,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>-18,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>-131,4</span></td><td colspan=\"1\" rowspan=\"1\"><span>-67,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>-22,8</span></td><td colspan=\"1\" rowspan=\"1\"><span>193,9</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>% of net sales</span></td><td colspan=\"1\" rowspan=\"1\"><span>-129,1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-68,8</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>-72,9</span></td><td colspan=\"1\" rowspan=\"1\"><span>-22,9</span></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Earnings for the shareholders of the parent company</span></td><td colspan=\"1\" rowspan=\"1\"><span>-48,5</span></td><td colspan=\"1\" rowspan=\"1\"><span>-8,2</span></td><td colspan=\"1\" rowspan=\"1\"><span>-491,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-53,5</span></td><td colspan=\"1\" rowspan=\"1\"><span>-8,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-544,1</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>% of the net sales</span></td><td colspan=\"1\" rowspan=\"1\"><span>-145,4</span></td><td colspan=\"1\" rowspan=\"1\"><span>-30,3</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"><span>-58,2</span></td><td colspan=\"1\" rowspan=\"1\"><span>-8,3</span></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Net cash flow from operating activities</span></td><td colspan=\"1\" rowspan=\"1\"><span>-2,7</span></td><td colspan=\"1\" rowspan=\"1\"><span>-2,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>35,0</span></td><td colspan=\"1\" rowspan=\"1\"><span>-2,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>-4,4</span></td><td colspan=\"1\" rowspan=\"1\"><span>-40,9</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Net debt</span></td><td colspan=\"1\" rowspan=\"1\"><span>-6,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>8,1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-181,5</span></td><td colspan=\"1\" rowspan=\"1\"><span>-6,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>8,1</span></td><td colspan=\"1\" rowspan=\"1\"><span>-181,5</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Debt-equity ratio % (Gearing)</span></td><td colspan=\"1\" rowspan=\"1\"><span>13,7</span></td><td colspan=\"1\" rowspan=\"1\"><span>48,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>-71,8</span></td><td colspan=\"1\" rowspan=\"1\"><span>13,7</span></td><td colspan=\"1\" rowspan=\"1\"><span>48,6</span></td><td colspan=\"1\" rowspan=\"1\"><span>-71,8</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Earnings per share, EUR</span></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td><td colspan=\"1\" rowspan=\"1\"></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Undiluted</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,458</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,077</span></td><td colspan=\"1\" rowspan=\"1\"><span>494,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,496</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,078</span></td><td colspan=\"1\" rowspan=\"1\"><span>536,1</span></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><span>Diluted</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,458</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,077</span></td><td colspan=\"1\" rowspan=\"1\"><span>494,3</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,496</span></td><td colspan=\"1\" rowspan=\"1\"><span>-0,078</span></td><td colspan=\"1\" rowspan=\"1\"><span>536,1</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>BOARD OF DIRECTORS’ PROPOSAL FOR DISTRIBUTION OF A DIVIDEND</span></strong></p><p class=\"\"><span>On December 31, 2025, the parent company’s Dovre Group Plc’s distributable funds were EUR</span></p><p class=\"\"><span>–650 409,03.</span></p><p class=\"\"><span>The Board of Directors proposes to the General Meeting that no dividend be distributed.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FINANCIAL REPORTING IN 2026</span></strong></p><p class=\"\"><span>Dovre Group releases its financial reports in 2026 as follows:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Financial Statements review 2025: Thursday, 26 February 2026</span></li><li class=\"listItem-bmN0_SHH\"><span>Half-year financial report January–June 2026: Thursday, 20 August 2026</span></li></ul><p class=\"\"><span>Dovre Group’s Financial Statements 2025 and Annual Report 2025 will be published online at the latest during the week beginning March 23, 2026.</span></p><p class=\"\"><span>The company’s Annual General Meeting is planned to be held on Wednesday, April 15, 2026. Dovre Group’s Board of Directors will summon the meeting later.</span></p><p class=\"\"><span>Espoo, February 26, 2026</span></p><p class=\"\"><span>DOVRE GROUP PLC</span></p><p class=\"\"><span>BOARD OF DIRECTORS</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>Dovre Group Plc</span></p><p class=\"\"><span>Markku Taskinen, CEO</span></p><p class=\"\"><span>Tel. +358 50 343 1482</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:markku.taskinen@dovregroup.com\" rel=\"nofollow\" target=\"_blank\">markku.taskinen@dovregroup.com</a></p><p class=\"\"><span>Timo Saarinen, CFO</span></p><p class=\"\"><span>Tel. +358 50 452 4215</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:timo.saarinen@dovregroup.com\" rel=\"nofollow\" target=\"_blank\">timo.saarinen@dovregroup.com</a></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Distribution</span></strong></p><p class=\"\"><span>Nasdaq Helsinki</span></p><p class=\"\"><span>Main media</span></p><p class=\"\"><span>www.dovregroup.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/edf209b7-213c-43dc-b27e-e11498baa332/dovre-fsr-2025-en-january-december.pdf\" rel=\"nofollow\" target=\"_blank\">Dovre FSR 2025 EN January December</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:263eb6d271b70:0-dovre-group-s-financial-statement-release-1-1-31-12-2025/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSt1CNMa:0",
            "title": "Cytta Corp Transfers CyttaCOMMS IP into IGAN Corp Following Minimum Marketable Product Milestone",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Multiple National Sales and Marketing Partners Commence CyttaCOMMS IGAN™ Training</span></p><p class=\"\"><span>LAS VEGAS, NV / ACCESS Newswire / February 26, 2026 / Cytta Corp. (OTCQB:CYCA) today announced plans to transfer the CyttaCOMMS intellectual property into IGAN™ Corp , its wholly owned Special Purpose Vehicle (SPV). IGAN™ Corp is a technology company formed to commercialize and scale the IGAN™ SaaS platform for real-time streaming, communication, collaboration, and monitoring across connected environments. Multiple national sales and marketing partners have now commenced the CyttaCOMMS IGAN™ cloud-based training and familiarization process.</span></p><p class=\"\"><span>The announcement follows the recent completion of the fully SaaS Minimum Marketable Product (MMP) milestone for the CyttaCOMMS platform. The milestone validated core communications functionality and establishes a foundation for continued development and market deployment.</span></p><p class=\"\"><span>CyttaCOMMS is a communications and field-operations platform built on Cytta's proprietary IGAN™ engine, integrating real-time video, voice, data, and location intelligence into a unified operational environment designed for mission-critical applications.</span></p><p class=\"\"><span>\"The CyttaCOMMS MMP milestone confirms the performance and scalability of the IGAN engine,\" said Gary Campbell, Chairman of Cytta Corp. \"The transfer provides structural clarity as we continue advancing the platform and expanding commercial engagement.\"</span></p><p class=\"\"><span>This milestone aligns with Cytta Corp.'s recently published thought-leadership article and accompanying video, \"</span><span>The Real Value of Drones Isn't in the Air - It's in the Data,\" which highlights the growing importance of unified real-time data platforms in public safety, defense, and operational intelligence environments. The article and video are available at: https://www.linkedin.com/pulse/real-value-drones-isnt-air-its-data-natalia-sokolova-fr2bc/</span></p><p class=\"\"><em><span>Ongoing Development</span></em></p><p class=\"\"><span>Engineering development will continue with a focus on feature enhancements, integration expansion, and operational readiness across targeted vertical markets.</span></p><p class=\"\"><em><span>Strategic Capital Evaluation</span></em></p><p class=\"\"><span>IGAN™ Corp will evaluate direct strategic capital formation and partnership opportunities to support continued engineering, productization, integration expansion, and market readiness. Any such initiatives would be subject to market conditions, board approvals, and applicable regulatory requirements.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Cytta Corp</span></strong></p><p class=\"\"><span>Cytta Corp. is a technology company focused on secure, real-time communications and operational intelligence platforms across public safety, defense, drone/UAS, and enterprise markets. The Company develops and acquires technologies that integrate video, voice, data, and location intelligence to enable faster decision-making, enhanced situational awareness, and coordinated response in mission-critical environments.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Media Contact</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cytta Corp</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Direct: +1 415-301-6644</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Website:</span></strong><span> </span><strong class=\"root-Tkn6WL2y\"><span>www.cytta.com</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> </span><strong class=\"root-Tkn6WL2y\"><span>info@cytta.com</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Cytta Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSt1CNMa:0/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM05V:0",
            "title": "China is shifting crude oil buying in response to price rally: Russell",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Clyde Russell</span></p><p class=\"\"><span>    One of the least talked about dynamics of the global crude oil market is the role China plays in setting a floor and a ceiling for prices.</span></p><p class=\"\"><span>The world's largest crude importer has quietly built a track record of buying excess oil to build inventories when its refiners and government deem prices to be cheap, and conversely pull back on imports when prices rise too high, or too rapidly.</span></p><p class=\"\"><span>Because the shifts in imports happen with a lag of several months, given the time between when a cargo is arranged and delivered, it is not immediately obvious to analysts and reporters covering the crude market.</span></p><p class=\"\"><span>However, there are some early signs that China is shifting its imports to favour more competitively priced crudes, while also trimming imports from April onwards.</span></p><p class=\"\"><span>This is likely being done as crude oil prices have risen sharply in recent weeks amid the uncertainty created by tensions between the United States and Iran, with concern that a U.S. military strike may result in Iranian retaliation against oil installations and tankers in the vital Persian Gulf area.</span></p><p class=\"\"><span>Global benchmark Brent futures </span><span> hit the highest in nearly seven months on February 23, reaching $72.50 a barrel, and have rallied 23% since the seven-month low of $58.72 on December 16.</span></p><p class=\"\"><span>The rise in Brent has made crudes that are priced against it more expensive on a relative basis, such as those from West African producers Nigeria and Angola.</span></p><p class=\"\"><span>In turn this has led to producers offering bigger discounts in order to clear cargoes, with traders reporting that some West African grades are being sold at discounts of up to $5 a barrel over the Dated Brent benchmark, up from around $3 earlier this month.</span></p><p class=\"\"><span>China is often seen as a buyer of last resort for West African crudes, and the high discounts on offer show that there is limited appetite for extra cargoes. </span></p><p class=\"\"><span>Higher freight rates are also making it more expensive to land West African crudes in China, especially since Middle East producers have been lowering their prices in recent months.</span></p><p class=\"\"><span>Saudi Arabia, the world's largest oil exporter, cut its official selling price (OSP) for its main Arab Light grade for Asian refiners for a fourth month for March-loading cargoes.</span></p><p class=\"\"><span>The March OSP for Arab Light crude was set at parity with the Oman/Dubai average, down from a premium of $0.30 a barrel in February, the lowest since December 2020, according to Reuters' data.</span></p><p class=\"\"><span>China has responded by buying more Saudi crude as well as other similar grades from Gulf producers.</span></p><p class=\"\"><span>AFRICA DIP</span></p><p class=\"\"><span>Data from commodity analysts Kpler also show China is paring back on cargoes from Africa, with arrivals in February and March below the level of the fourth quarter of last year.</span></p><p class=\"\"><span>China's imports from Africa are forecast at 1.04 million barrels per day expected in March and 978,000 bpd in February, down from 1.25 million bpd in the fourth quarter of 2025, according to Kpler data.</span></p><p class=\"\"><span>There is a large degree of fungibility between grades such as Arab Light and Nigeria's Bonny Light and Angola's Cabinda, given similar API gravity and sulphur contents.</span></p><p class=\"\"><span>Another grade that is similar is Russia's Urals, and China looks to be snapping up cargoes at heavy discounts after the other major Russian buyer India agreed with the United States as part of a trade deal to buy less of the sanctioned crude.</span></p><p class=\"\"><span>China's imports of Russian crude from Europe, which is where Urals loads, are expected to be 824,000 bpd in February, up from 741,000 bpd in January and 444,000 bpd in December.</span></p><p class=\"\"><span>Overall, what appears to be happening is that China is buying up heavily discounted Russian crude, and cutting back on more expensive Brent-priced grades.</span></p><p class=\"\"><span>But it also may be trimming the overall volume it imports given the recent rally in prices, just as it did during the 12-day conflict in June last year between Israel, supported by the United States, and Iran.</span></p><p class=\"\"><span>Enjoying this column? Check out </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/commentary/reuters-open-interest/\" rel=\"nofollow\" target=\"_blank\">Reuters Open Interest (ROI)</a><span>, your essential new source for global financial commentary. ROI delivers thought-provoking, data-driven analysis of everything from swap rates to soybeans. Markets are moving faster than ever. ROI can help you keep up. Follow ROI on LinkedIn and X.</span></p><p class=\"\"><span>The views expressed here are those of the author, a columnist for Reuters.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM05V:0-china-is-shifting-crude-oil-buying-in-response-to-price-rally-russell/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008979:0",
            "title": "Burford Reports 4Q25 and FY25 Financial Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>NEW YORK, Feb. 26, 2026 /PRNewswire/ — Burford Capital Limited (\"Burford\"), the leading global finance and asset management firm focused on law, today announces its financial results for the three months ended December 31, 2025 (\"4Q25\") and the year ended December 31, 2025 (\"FY25\"). The full detailed presentation of Burford's 4Q25 and FY25 financial results, as well as a shareholder letter and detailed portfolio data table, can be viewed at http://investors.burfordcapital.com.</span></p><p class=\"\"><span>On February 25, 2026, Burford's board of directors declared a final dividend for the year ended December 31, 2025 of $0.0625 per ordinary share to be paid, subject to shareholder approval at the 2026 annual general meeting, on June 12, 2026 to shareholders of record on May 22, 2026.</span></p><p class=\"\"><span>Christopher Bogart, Burford Capital's Chief Executive Officer, commented:</span></p><p class=\"\"><span>\"We had a terrific 2025 for new business, with new definitive commitments up 39%. Portfolio modeled realizations(1) increased $700 million to $5.2 billion at year end. In the part of our business where we have less influence — case progress and realizations — we brought in a substantial amount of cash, but our results were impacted by extended case durations and other unrealized fair value adjustments. The quality of the portfolio remains high, and we believe the future is bright in terms of growing the business and the potential for asymmetric upside value for shareholders.\"</span></p><p class=\"\"><span>Burford will hold a conference call for investors and analysts at 9.00am EST / 2.00pm GMT on Thursday, February 26, 2026. For swift access to the conference call at the time of the event, pre-registration is encouraged at https://registrations.events/direct/Q4I740130. The dial-in numbers for the conference call are +1 (646) 307-1951 (USA) or +1 (888) 500-3691 (USA &amp; Canada toll free) / +44 (0)20 8610 3526 (UK) or +44 800 524 4258 (UK toll free), and the access code is 74013. To minimize the risk of delayed access, participants are urged to dial into the conference call by 8.40am EST / 1.40pm GMT.</span></p><p class=\"\"><span>A live audio webcast and replay will also be available at https://events.q4inc.com/attendee/657000184, and pre-registration at that link is encouraged.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(1) Modeled realizations reflect expected future realizations from capital </span><br/><span>provision assets (excluding YPF-related assets) based on probabilistic </span><br/><span>modeling of portfolio and adjusted by an experience factor based on historical </span><br/><span>modeling accuracy rates. Modeled realizations calculation is derived from </span><br/><span>Burford's internal modeling of individual matters and of Burford's portfolio </span><br/><span>as a whole. These data are not a forecast of future results. See </span><br/><span>\"Forward-looking statements\", \"Estimates and assumptions\" and \"Key performance </span><br/><span>indicators\" for more information. See the full detailed presentation of </span><br/><span>Burford's 4Q25 and FY25 financial results for information on how modeled </span><br/><span>realizations are calculated. </span><br/><span> </span><br/><span> </span><br/><span>For further information, please contact: </span><br/><span> </span><br/><span>Burford Capital Limited </span><br/><span>For investor and analyst inquiries: </span><br/><span>Americas: Josh Wood, Head of Investor Relations - email  +1 212 516 5824 </span><br/><span>EMEA &amp; Asia: Rob Bailhache, Head of EMEA &amp; Asia </span><br/><span> Investor Relations - email                              +44 (0)20 3530 2023 </span><br/><span>For press inquiries: </span><br/><span>David Helfenbein, Senior Vice President, Public </span><br/><span> Relations - email                                       +1 646 504 7074 </span><br/><span> </span><br/><span>Deutsche Numis - NOMAD and Joint Broker                  +44 (0)20 7545 8000 </span><br/><span>Duncan Monteith </span><br/><span>Charlie Farquhar </span><br/><span> </span><br/><span>BofA Securities -- Joint Broker                          +44 (0)20 7628 1000 </span><br/><span>Peter Luck </span><br/><span>David Lloyd </span><br/><span> </span><br/><span>Jefferies International Limited - Joint Broker           +44 (0)20 7029 8000 </span><br/><span>Graham Davidson </span><br/><span>James Umbers </span><br/><span> </span><br/><span>Berenberg -- Joint Broker                                +44 (0)20 3207 7800 </span><br/><span>Toby Flaux </span><br/><span>James Thompson </span><br/><span> </span><br/><span> </span></pre><p class=\"\"><span>About Burford Capital</span></p><p class=\"\"><span>Burford Capital is the leading global finance and asset management firm focused on law. Its businesses include litigation finance and risk management, asset recovery and a wide range of legal finance and advisory activities. Burford is publicly traded on the New York Stock Exchange </span><span> and the London Stock Exchange </span><span> and works with companies and law firms around the world from its global network of offices.</span></p><p class=\"\"><span>For more information, please visit www.burfordcapital.com.</span></p><p class=\"\"><span>This press release does not constitute an offer to sell or the solicitation of an offer to buy any ordinary shares or other securities of Burford.</span></p><p class=\"\"><span>This press release does not constitute an offer of any Burford private fund. Burford Capital Investment Management LLC, which acts as the fund manager of all Burford private funds, is registered as an investment adviser with the US Securities and Exchange Commission. The information provided in this press release is for informational purposes only. Past performance is not indicative of future results. The information contained in this press release is not, and should not be construed as, an offer to sell or the solicitation of an offer to buy any securities (including interests or shares in any of Burford private funds). Any such offer or solicitation may be made only by means of a final confidential private placement memorandum and other offering documents.</span></p><p class=\"\"><span>Forward-looking statements</span></p><p class=\"\"><span>This press release contains \"forward-looking statements\" within the meaning of Section 27A of the US Securities Act of 1933, as amended, and Section 21E of the US Securities Exchange Act of 1934, as amended, including Burford's target metrics and projections, such as modeled realizations, that are intended to be covered by the safe harbor provided for under these sections. In some cases, words such as \"aim\", \"anticipate\", \"believe\", \"continue\", \"could\", \"estimate\", \"expect\", \"forecast\", \"guidance\", \"intend\", \"may\", \"plan\", \"potential\", \"predict\", \"projected\", \"should\" or \"will\", or the negative of such terms or other comparable terminology, are intended to identify forward-looking statements. Although Burford believes that the assumptions, expectations, projections, intentions and beliefs about future results and events reflected in forward-looking statements have a reasonable basis and are expressed in good faith, forward-looking statements involve known and unknown risks, uncertainties and other factors, which could cause Burford's actual results and events to differ materially from (and be more negative than) future results and events expressed, projected or implied by these forward-looking statements. Factors that might cause future results and events to differ include, among others, those discussed in the \"Risk Factors\" section of Burford's Annual Report on Form 10-K for the year ended December 31, 2025 filed with the US Securities and Exchange Commission on February 26, 2026. These factors should not be construed as exhaustive and should be read in conjunction with the other cautionary statements contained in the periodic and current reports that Burford files with or furnishes to the US Securities and Exchange Commission. Many of these factors are beyond Burford's ability to control or predict, and new factors emerge from time to time. Furthermore, Burford cannot assess the impact of each such factor on its business or the extent to which any factor or combination of factors may cause actual results and events to be materially different from those contained in any forward-looking statement. Given these uncertainties, readers are cautioned not to place undue reliance on Burford's forward-looking statements.</span></p><p class=\"\"><span>All subsequent written and oral forward-looking statements attributable to Burford or to persons acting on its behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements speak only as of the date of this press release and, except as required by applicable law, Burford undertakes no obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.</span></p><p class=\"\"><span>In addition to forward-looking statements, this press release includes certain data, such as modeled realizations, based on calculations derived from Burford's probabilistic modeling of individual matters and its portfolio as a whole. This data is not a forecast of future results, and past performance is not a guide to future performance. The inherent volatility and unpredictability of legal finance assets precludes forecasting and limits the predictive nature of Burford's probabilistic model. Furthermore, the inherent nature of the probabilistic model is that actual results will differ from the modeled results, and such differences could be material. The data based on calculations derived from Burford's probabilistic model contained in this press release is for informational purposes only and is not intended to be a profit forecast or be relied upon as a guide to future performance.</span></p><p class=\"\"><span>Estimates and assumptions</span></p><p class=\"\"><span>This press release includes certain unaudited financial and business projections, targets and goals with respect to Burford's future outlook (collectively, the \"Estimates\"). The Estimates reflect subjective judgment in many respects and thus are susceptible to multiple interpretations and periodic revisions based on actual experience and business developments. As such, the Estimates constitute forward-looking information and are subject to many risks and uncertainties that could cause actual results to differ materially from the results forecasted in these projections, targets or goals. There can be no assurance that the Estimates will be realized or that actual results will not be materially higher or lower than forecast. The Estimates cannot, therefore, be considered a guarantee of future results of operations, and this information should not be relied upon as such. The inclusion of the Estimates in this press release should not be regarded as an indication that Burford or any of its affiliates, officers, directors, employees or representatives considered or considers the Estimates to be necessarily predictive of actual future events, and the Estimates should not be relied upon as such. The inclusion of the Estimates herein should not be deemed an admission or representation by Burford that its management views the Estimates as material information. Neither Burford nor any of its affiliates, officers, directors, employees or representatives has made or makes any representation to any of Burford's shareholders or any other person regarding the ultimate performance of Burford compared to the information contained in the Estimates or can give any assurance that actual results will not differ materially from the Estimates. BURFORD DOES NOT UNDERTAKE ANY OBLIGATION TO UPDATE OR OTHERWISE REVISE OR RECONCILE THE ESTIMATES TO REFLECT CIRCUMSTANCES EXISTING AFTER THE DATE THE ESTIMATES WERE GENERATED OR TO REFLECT THE OCCURRENCE OF FUTURE EVENTS, EVEN IN THE EVENT THAT ANY OR ALL OF THE ASSUMPTIONS UNDERLYING THE ESTIMATES ARE NO LONGER APPROPRIATE OR ARE SHOWN TO BE IN ERROR, EXCEPT AS MAY BE REQUIRED BY APPLICABLE LAW.</span></p><p class=\"\"><span>Key performance indicators</span></p><p class=\"\"><span>Burford uses certain unaudited key performance indicators (\"KPIs\"). The KPIs are presented because Burford uses them to monitor its financial condition and results of operations and/or Burford believes they are useful to investors, securities analysts and other interested parties. The presentation of the KPIs is for informational purposes only and does not purport to present what Burford's actual financial condition or results of operations would have been, nor does it project its financial condition at any future date or its results of operations for any future period. The presentation of the KPIs is based on information available as of the date of this press release and certain assumptions and estimates that Burford believes are reasonable.</span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/burford-reports-4q25-and-fy25-financial-results-302698189.html</span></p><p class=\"\"><span>SOURCE Burford Capital Limited</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008979:0/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008844:0",
            "title": "Big Oil Is Urging Trump to Stop Battle on Offshore Wind — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Benoît Morenne</span></p><p class=\"\"><span>Big Oil has an unusual ask for President Trump: Please stop your battle against offshore wind.</span></p><p class=\"\"><span>Oil lobbyists have made the case to Trump officials in recent weeks that his attacks on wind farms off the U.S. coast risk derailing congressional efforts to speed up permits for energy projects, according to people familiar with the matter. The oil-and-gas industry fears missing out on a huge opportunity to ship more of its products to markets via new pipelines.</span></p><p class=\"\"><span>Since coming into office, Trump has repeatedly targeted wind farms he has described as ugly, expensive and destructive for wildlife. His Interior Department suspended all offshore wind projects in the works from Massachusetts to Virginia, prompting energy companies to sue the government. But even as judges have sided with developers against the administration and allowed projects to move forward, Trump has persisted.</span></p><p class=\"\"><span>\"My goal is to not let any windmill be built,\" Trump said last month at a White House meeting with oil executives. \"They are the worst form of energy, the most expensive form of energy.\"</span></p><p class=\"\"><span>Trump's actions have plunged the wind industry into turmoil. Now, they risk backfiring against his oil allies and putting their own projects on shaky ground.</span></p><p class=\"\"><span>The oil-and-gas industry has for months told the administration that its moves to expedite fossil-fuel projects should be enshrined in law — lest a Democratic president reverse them in the future. But Trump's continued blitz against wind is throwing a monkey wrench into a crucial legislative push to do just that.</span></p><p class=\"\"><span>Senate Democrats have said they would refuse to negotiate a bipartisan law to reform energy permits as long as Trump keeps stalling wind farms. Oil lobbyists see a narrowing window to break the logjam before the midterm elections, when they expect Democrats to regain control of the House.</span></p><p class=\"\"><span>\"This administration has done everything that they could do at the administrative level,\" Mike Sommers, the president of the American Petroleum Institute, the U.S. industry's largest trade group, said last week at an energy conference in Houston. \"If you think that permanent reform is hard to get done now, just wait until the Democrats control the United States House of Representatives.\"</span></p><p class=\"\"><span>Trump's escalating feud with wind is forcing the fossil-fuel industry into odd contortions. It was incensed at former President Joe Biden's decisions to cancel the controversial Keystone XL crude pipeline and pause new exports of natural gas. Now, it has become a de facto, albeit begrudging, mediator between wind developers experiencing their own setbacks and the Trump administration.</span></p><p class=\"\"><span>Lobbyists have told staff at the National Energy Dominance Council, a body Trump set up to boost energy projects, that the administration's stance against wind makes it much more difficult to get a bipartisan deal in Congress, one of the people familiar with the matter said.</span></p><p class=\"\"><span>API has made it clear to the administration that permitting is its No. 1 legislative priority, and it supports ensuring that all projects that have received a federal nod can be completed — including wind projects, according to people familiar with the matter.</span></p><p class=\"\"><span>Dustin Meyer, senior vice president of policy, economics and regulatory affairs at API, said the group has been crystal clear about its priorities with lawmakers and the administration, which include amending a law that imposes federal reviews of the environmental impact of projects.</span></p><p class=\"\"><span>A spokeswoman for the White House reaffirmed Trump's position that \"wind farms are a liability that jeopardizes the safety of the American people.\" She said the administration is working closely with its partners in Congress to drive reforms to the permitting process.</span></p><p class=\"\"><span>The stalemate in Congress could hurt Trump's goals to reshore critical industries and win the AI race. The U.S. faces a daunting challenge to meet new electricity demand from data centers, factories and electric vehicles that it won't sate without a major energy build-out. Cutting the U.S.'s reliance on imports for critical minerals such as lithium and copper requires new mines. For all these reasons, streamlining the complex web of laws and regulations that govern energy projects has become a bipartisan priority on Capitol Hill.</span></p><p class=\"\"><span>The oil-and-gas industry sees a huge opportunity to build new pipelines. Environmental groups have become proficient at blocking new conduits by stalling projects in the courts. Delays that companies have incurred fighting regulatory and court challenges have spurred many to scrap multibillion-dollar ventures in recent years.</span></p><p class=\"\"><span>\"Pipelines have been a bottleneck. Infrastructure has been a bottleneck, \" said Toby Rice, chief executive of natural gas producer EQT. \"It's been harder for us to get our gas to market.\"</span></p><p class=\"\"><span>Trump has successfully used his power to block wind farms as leverage to benefit his oil-and-gas allies. After Trump reversed a stop-work order on a major wind project off New York's coast last May, the state approved a natural gas pipeline project that energy company Williams had previously abandoned.</span></p><p class=\"\"><span>But the fossil-fuel industry is adamant that it needs a law to make sure it can build pipelines and not see its permits yanked by a future administration. In December, it praised the House for passing bipartisan legislation to narrow environmental review timelines and litigation windows for energy projects.</span></p><p class=\"\"><span>Four days later, the administration paused the federal leases for five offshore wind projects under construction \"due to national security risks identified by the Department of War in recently completed classified reports.\" In protest, Democrats said they were freezing negotiations to pass a Senate version of the House bill as long as Trump didn't reverse his attacks.</span></p><p class=\"\"><span>Some oil lobbyists say privately that Trump's deep aversion to wind farms makes no sense to them. Many in the industry say they have been frustrated with the situation.</span></p><p class=\"\"><span>\"We've been heavily focused on permitting reform as kind of like the cork in the bottle,\" said Sam Sledge, board chair of the Energy Workforce and Technology Council, an industry trade group. \"I think that's been caught in the crosswinds of some other priorities with Trump's administration.\"</span></p><p class=\"\"><span>Write to Benoît Morenne at benoit.morenne@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008844:0/",
            "pub_date": "2026-02-26 21:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSrkmTJa:0",
            "title": "Star Copper Congratulates Doubleview Gold's Mineral Resource Estimate Boosting Interest Across Entire Region",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>--Company Advances Plans for Mineral Resource Estimate at Star Property in 2026</span></p><p class=\"\"><span>VANCOUVER, BC / ACCESS Newswire / February 26, 2026 / Star Copper Corp.</span><span>(OTCQX:STCUF)</span><span> (\"Star Copper\" or the \"Company\"), a critical mineral exploration and development company, is pleased to congratulate Doubleview Gold Corp. </span><span> on the announcement of its updated Mineral Resource Estimate for the Hat polymetallic porphyry project in northwestern British Columbia.</span></p><p class=\"\"><span>Doubleview's recently announced updated estimate outlines 609 million tonnes of Measured and Indicated Mineral Resources grading 0.43% copper equivalent, containing approximately 5.82 billion pounds of copper equivalent, along with a further 503 million tonnes of Inferred Mineral Resources grading 0.41% copper equivalent containing approximately 4.57 billion pounds copper equivalent.</span></p><p class=\"\"><span>Star Copper's CEO, Darryl Jones states \"This is a huge update for our neighbour, and we are very excited to be a part of this emerging district, as Star is accelerating drilling at the Star Property to expand and better define mineralized zones, strengthening the geological model and advancing the project toward future resource-stage evaluation. With an aggressive 2026 drill program already planned and a number of 2025 drill results still pending, the company is positioned to take advantage of the recent surge in metals sector prices to fill the growing need for resource development.</span></p><p class=\"\"><span>Star recognizes the significance of advancing large-scale porphyry systems in British Columbia and commends Doubleview's technical team for their disciplined and targeted drilling efforts that have steadily expanded the Hat deposit footprint. The recently announced Hat Project MRE is positioned approximately 5km to the southeast of the Star Property (See Figure 1).</span></p><p class=\"\"><span>Hat Project Updated Mineral Resource Estimate - Doubleview Gold Corp - News Release Feb 25, 2026</span></p><p class=\"\"><span>Table 1: Hat MRE at a 0.2% CuEq Cut‑Off Effective February 4, 2026,</span></p><p class=\"\"><span>(Base‑Case Scenario to be Presented in the Technical Report)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th rowspan=\"2\"><p class=\"\"><span>Mineral</span></p><p class=\"\"><span>Resource</span></p><p class=\"\"><span>Classification</span></p></th><th rowspan=\"2\"><p class=\"\"><span>Tonnage</span></p><p class=\"\"><span>(Mt)</span></p></th><th colspan=\"5\"><p class=\"\"><span>Average Grade</span></p></th><th colspan=\"5\"><p class=\"\"><span>Metal Content</span></p></th></tr><tr><th><p class=\"\"><span>CuEq</span></p><p class=\"\"><span>(%)</span></p></th><th><p class=\"\"><span>Cu</span></p><p class=\"\"><span>(%)</span></p></th><th><p class=\"\"><span>Au</span></p><p class=\"\"><span>(g/t)</span></p></th><th><p class=\"\"><span>Co</span></p><p class=\"\"><span>(%)</span></p></th><th><p class=\"\"><span>Ag</span></p><p class=\"\"><span>(g/t)</span></p></th><th><p class=\"\"><span>CuEq</span></p><p class=\"\"><span>(Blb)</span></p></th><th><p class=\"\"><span>Cu</span></p><p class=\"\"><span>(Blb)</span></p></th><th><p class=\"\"><span>Au</span></p><p class=\"\"><span>(Moz)</span></p></th><th><p class=\"\"><span>Co</span></p><p class=\"\"><span>(Mlb)</span></p></th><th><p class=\"\"><span>Ag</span></p><p class=\"\"><span>(Moz)</span></p></th></tr></thead><tbody><tr><td><p class=\"\"><span>Measured</span></p></td><td><p class=\"\"><span>272</span></p></td><td><p class=\"\"><span>0.44</span></p></td><td><p class=\"\"><span>0.22</span></p></td><td><p class=\"\"><span>0.18</span></p></td><td><p class=\"\"><span>0.008</span></p></td><td><p class=\"\"><span>0.37</span></p></td><td><p class=\"\"><span>2.61</span></p></td><td><p class=\"\"><span>1.11</span></p></td><td><p class=\"\"><span>1.41</span></p></td><td><p class=\"\"><span>35.6</span></p></td><td><p class=\"\"><span>2.17</span></p></td></tr><tr><td><p class=\"\"><span>Indicated</span></p></td><td><p class=\"\"><span>337</span></p></td><td><p class=\"\"><span>0.43</span></p></td><td><p class=\"\"><span>0.21</span></p></td><td><p class=\"\"><span>0.19</span></p></td><td><p class=\"\"><span>0.008</span></p></td><td><p class=\"\"><span>0.39</span></p></td><td><p class=\"\"><span>3.21</span></p></td><td><p class=\"\"><span>1.31</span></p></td><td><p class=\"\"><span>1.81</span></p></td><td><p class=\"\"><span>44.5</span></p></td><td><p class=\"\"><span>2.88</span></p></td></tr><tr><td><p class=\"\"><span>Total M+I</span></p></td><td><p class=\"\"><span>609</span></p></td><td><p class=\"\"><span>0.43</span></p></td><td><p class=\"\"><span>0.21</span></p></td><td><p class=\"\"><span>0.18</span></p></td><td><p class=\"\"><span>0.008</span></p></td><td><p class=\"\"><span>0.38</span></p></td><td><p class=\"\"><span>5.82</span></p></td><td><p class=\"\"><span>2.42</span></p></td><td><p class=\"\"><span>3.22</span></p></td><td><p class=\"\"><span>80.1</span></p></td><td><p class=\"\"><span>5.05</span></p></td></tr><tr><td><p class=\"\"><span>Inferred</span></p></td><td><p class=\"\"><span>503</span></p></td><td><p class=\"\"><span>0.41</span></p></td><td><p class=\"\"><span>0.18</span></p></td><td><p class=\"\"><span>0.19</span></p></td><td><p class=\"\"><span>0.008</span></p></td><td><p class=\"\"><span>0.38</span></p></td><td><p class=\"\"><span>4.57</span></p></td><td><p class=\"\"><span>1.72</span></p></td><td><p class=\"\"><span>2.77</span></p></td><td><p class=\"\"><span>66.2</span></p></td><td><p class=\"\"><span>4.19</span></p></td></tr></tbody></table></div><p class=\"\"><span>Table 2: Hat MRE at a 0.2% CuEq Cut-Off as of February 4, 2026, Scandium Oxide Resources</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Mineral</span></p><p class=\"\"><span>Resource</span></p><p class=\"\"><span>Classification</span></p></td><td><p class=\"\"><span>Tonnage</span></p><p class=\"\"><span>(Mt)</span></p></td><td><p class=\"\"><span>Sc Tonnage1</span></p><p class=\"\"><span>(Mt)</span></p></td><td><p class=\"\"><span>Average Grade</span></p><p class=\"\"><span>Sc (g/t)</span></p></td><td><p class=\"\"><span>Metal Content</span></p><p class=\"\"><span>Sc2O3 2 (t)</span></p></td></tr><tr><td><p class=\"\"><span>Measured</span></p></td><td><p class=\"\"><span>272</span></p></td><td><p class=\"\"><span>34</span></p></td><td><p class=\"\"><span>28.79</span></p></td><td><p class=\"\"><span>1,081</span></p></td></tr><tr><td><p class=\"\"><span>Indicated</span></p></td><td><p class=\"\"><span>337</span></p></td><td><p class=\"\"><span>42</span></p></td><td><p class=\"\"><span>28.76</span></p></td><td><p class=\"\"><span>1,334</span></p></td></tr><tr><td><p class=\"\"><span>Total M+I</span></p></td><td><p class=\"\"><span>609</span></p></td><td><p class=\"\"><span>76</span></p></td><td><p class=\"\"><span>28.77</span></p></td><td><p class=\"\"><span>2,415</span></p></td></tr><tr><td><p class=\"\"><span>Inferred</span></p></td><td><p class=\"\"><span>503</span></p></td><td><p class=\"\"><span>63</span></p></td><td><p class=\"\"><span>28.69</span></p></td><td><p class=\"\"><span>1,996</span></p></td></tr></tbody></table></div><p class=\"\"><span>Notes:</span></p><p class=\"\"><span>1 Scandium tonnages represent 12.5% of the mineralized material by category, reflecting the proportion of tailings expected to be processed through a dedicated scandium leach circuit under current metallurgical design constraints.</span></p><p class=\"\"><span>2 Scandium oxide metal content have been calculated using the metallurgical recovery of 72% and conversion factor from Sc to Sc2O3 of 1.534.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mineit's Qualified Person, Tomasz Wawruch, FAusIMM, completed the MRE, and has reviewed and approved the technical disclosure related to the MRE contained in this news release. Mr. Wawruch is a senior geology and mineral resource consultant independent of Doubleview. Gilles Arseneau, PhD., P.Geo., of ARSENEAU Consulting Services Inc., provided an independent review of this MRE.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mineral Resources that are not Mineral Reserves do not have demonstrated economic viability.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The estimate of Mineral Resources may be materially affected by environmental, permitting, legal, title, taxation, socio-political, marketing, or other relevant issues.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Inferred Mineral Resources are considered too speculative geologically to have economic considerations applied to them that would enable them to be categorized as Mineral Reserves.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The Mineral Resource Estimate was prepared in accordance with the Canadian Institute of Mining, Metallurgy and Petroleum (\"CIM\") Definition Standards for Mineral Resources and Mineral Reserves (2014), and CIM MRMR Best Practice Guidelines (2019).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The effective date of the MRE is February 4, 2026.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Metal contents have been calculated using the following metallurgical recovery factors: Cu = 85%, Au = 89%, Co = 78%, and Ag = 68%.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Economic assumptions used include US$4.80/lb Cu, US$20.00/lb Co, US$3,200/oz Au, US$46/oz Ag, and a 2% NSR royalty.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mineral Resources are reported within optimized open pit constraints and 0.2% CuEq cut-off grade, based on a C$7.93/t milled processing cost and C$2.90/t milled general and administrative cost, with a mining cost of C$3.01/t plus incremental mining cost increasing by C$0.015/t for every bench below the reference level of 1,125 mRL.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>CuEq calculations do not include scandium. The formula used to calculate CuEq is: CuEq = [(((Ag × 46.0 × 0.68)/31.1035) + ((Au × 3200 × 0.89)/31.1035) + 0.0001 × (Co × 20.0 × 0.78 × 22.0462) + 0.0001 × (Cu × 4.8 × 22.0462 × 0.85))/(4.8 × 22.0462 × 0.85)], where all input variables are expressed in (ppm) and CuEq is expressed in percent (%).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Rounding may result in minor variations between individual values and totals; such differences are not considered material to the MRE.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Mineral Resource classification reflects the level of geological confidence and satisfies the uncertainty criteria appropriate for exploration and resource development. Additional drilling will be required to reduce uncertainty to the level expected for production planning.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The MRE reflects the geological interpretation, drill-hole spacing, and estimation parameters available at the time of modelling. Any additional drilling is expected to influence the current outcome by improving confidence in the estimates and refining the geometry of the mineralized domains.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The Mineral Resource results are presented in situ within the optimized pit. Mineralized material outside the pit has not been considered as a part of the current MRE tabulation. Calculations used metric units (metres, tonnes, g/t).</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>A total of 97 diamond drill holes, comprising 49,548 m of core, were incorporated into the Mineral Resource Estimate. All drilling data used in the MRE were subject to standard QA/QC validation prior to inclusion.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The block model is defined relative to a model origin at UTM Zone 9N 346,750 E / 6,453,000 N / 0 (NAD 83). Parent blocks measure 15 × 15 × 15 m, totalling 136 × 150 × 75 blocks across extents of 2,040 m (X), 2,250 m (Y), and 1,125 m (Z). All volumes and estimates are constrained by these discretization parameters.</span></p></li></ul><p class=\"\"><span>The scientific and technical information relating to Doubleview Gold Corp.'s Hat Project mineral resource estimate has been derived from publicly available disclosure by Doubleview Gold Corp. Star Copper Corp. has not independently verified the technical information contained in such disclosure, and a Qualified Person on behalf of Star Copper has not reviewed or validated the underlying data or methodology supporting the Hat Project mineral resource estimate. Accordingly, Star Copper makes no representation as to the accuracy or completeness of this information. The mineralization hosted on the Hat Project is not necessarily indicative of mineralization on the Company's Star Property.</span></p><span>Figure 1- Regional activity proximal to Star Property. Star Copper 2026.</span><p class=\"\"><span>The golden triangle of British Columbia continues to demonstrate its strength as an outstanding globally competitive jurisdiction for copper-gold development, and projects such as Hat highlight the long-term opportunity for regional critical minerals opportunities including copper, gold, cobalt and scandium within the province.</span></p><p class=\"\"><span>Star remains focused on advancing its copper-gold assets and believes that continued technical success across the region strengthens investor awareness of the scale and potential of British Columbia's porphyry districts.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Qualified Person</span></strong></p><p class=\"\"><span>Jeremy Hanson, P. Geo., a Qualified Person as that term is defined under NI 43-101, is a non-independent contractor of the Company and has reviewed and approved the technical aspects of this news release.</span></p><p class=\"\"><span>On Behalf of the Board of Directors</span></p><p class=\"\"><span>~Darryl Jones~</span></p><p class=\"\"><span>Darryl Jones</span></p><p class=\"\"><span>CEO, President &amp; Director</span></p><p class=\"\"><span>Star Copper Corp.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Star Copper Corp.</span></strong><span> </span><span>(OTCQX:STCUF)(FWB:SOP / WKN A416ME)</span></p><p class=\"\"><span>Star Copper Corp. is a Canadian mineral exploration company focused on the discovery and advancement of large-scale copper-gold systems in British Columbia. The Company's flagship Star Project is located in British Columbia's prolific Golden Triangle and hosts multiple high-priority targets and exhibits geological characteristics consistent with significant porphyry copper deposits (watch our videos: https://starcopper.com/media/). The project hosts multiple copper-gold porphyry-style targets, including Star Main, Star North, East &amp; West, Copper Creek and Copperline. Significant exploration including historical drilling has confirmed open mineralization at depth and in all directions. Star Copper's strategic plans include geological mapping and geophysical surveys to refine existing targets, diamond drilling programs to test high-priority zones, environmental baseline studies and permitting groundwork alongside data analysis and resource modeling to support a future resource estimate prepared in accordance with NI 43-101. The Company further plans to advance its </span><strong class=\"root-Tkn6WL2y\"><span>Indata Project</span></strong><span> with follow-up drilling to expand on previous high-grade copper and gold intercepts, trenching and surface sampling to delineate mineralized zones, and infrastructure improvements for site accessibility and operations. With a commitment to sustainable development and value creation, Star Copper aims to position itself to support surging industrial demand to meet growing global electrification needs.</span></p><p class=\"\"><span>For more information visit: www.starcopper.com, watch our videos at https://starcopper.com/media/, and while you are there, sign up for free news alerts at https://starcopper.com/news/news-alerts/, or follow us on X (formerly Twitter),Facebook or LinkedIn. More information in respect of the project, including historical drilling, is available under the Company's profile at www.sedarplus.ca and/or in the Company's February 26, 2025 technical report.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Relations</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Star Copper Corp.</span></strong></p><p class=\"\"><span>Email: info@starcopper.com</span></p><p class=\"\"><span>Web: https://starcopper.com/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Quality Control and Quality Assurance</span></strong></p><p class=\"\"><span>Mr. Mike Ostenson, P.Geo., is the qualified person for the purposes of National Instrument 43-101, and he has reviewed and approved the technical disclosure contained in this news release. Mr. Ostenson is a Geologist at Stillwater and is not independent of the Company.</span></p><p class=\"\"><span>Cautionary Note Regarding Forward-Looking Statements</span></p><p class=\"\"><span>This news release contains forward-looking statements and other statements that are not historical facts. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact, included in this news release are forward-looking statements that involve risks and uncertainties. Forward-looking statements in this press release include, but are not limited to, statements regarding exploration of the Company's flagship Star Project and the potential thereof, as well as the anticipated mineral resource estimate planned in respect of the Star Project. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include, but are not limited to, the early-stage nature of the Star Project, the inherently unpredictable nature of resource exploration, market conditions and the risks detailed from time to time in the filings made by the Company with securities regulators. The reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect, and actual results may differ materially from those anticipated. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will update or revise publicly any of the included forward-looking statements as expressly required by applicable law. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Star Copper Corp.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSrkmTJa:0/",
            "pub_date": "2026-02-26 21:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSxWHWwa:0",
            "title": "SDCG Delivers RM27.85 Million Revenue for FY2025 with PAT Surging 40.9% to RM6.04 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>KUALA LUMPUR, MY / ACCESS Newswire / February 26, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>Solar District Cooling Group Berhad</span></strong><span> (\"SDCG\") is pleased to announce its financial results for the fourth quarter ended 31 December 2025 (\"Q4 FY2025\"), concluding the financial year on a resilient footing with strengthened operational execution and improved full-year profitability.</span></p><em><span>Solar District Cooling Group Berhad</span></em><p class=\"\"><span>For Q4 FY2025, SDCG recorded revenue of RM9.64 million, representing a 4.2% increase compared to RM9.25 million in the corresponding quarter last year. The growth was primarily driven by stronger contributions from the Building Management Systems (\"BMS\") segment.</span></p><p class=\"\"><span>Gross profit for the quarter stood at RM4.28 million, with a gross profit margin of 44.4%, compared to 48.5% in Q4 FY2024. The moderation in margin was mainly attributable to lower contribution from chilled water system maintenance projects associated with a lower gross profit margin from the installation of a variable refrigerant flow system project. </span><span>Profit before tax for the quarter was RM2.70 million, while profit after tax (\"PAT\") stood at RM2.13 million.</span></p><p class=\"\"><span>For the full financial year ended 31 December 2025 (\"FY2025\"), </span><span>the Group achieved cumulative revenue of RM27.85 million, marking a 9.9% increase from RM25.33 million in financial year ended 31 December 2024 (\"FY2024\"). The improvement was largely supported by a significant increase in the BMS segment revenue, which rose to RM23.61 million, reflecting robust project execution momentum during the year. Particularly from the an airline project and government-related projects in Putrajaya, alongside progress recognition from ongoing projects scheduled for completion in the coming financial year</span></p><p class=\"\"><span>Notably, </span><span>PAT for FY2025 rose 40.9% to RM6.04 million compared to RM4.29 million in the preceding year. The stronger bottom line performance was underpinned by higher operational contributions and the absence of one-off IPO listing expenses of RM2.30 million incurred in FY2024 upon the Group's listing on the ACE Market of Bursa Malaysia Securities Berhad on 19 September 2024.</span></p><p class=\"\"><span>In recognition of shareholders' continued support, the Board had declared a first single-tier interim dividend of 1.5 sen per ordinary share for FY2025, amounting to approximately RM6.36 million, which was paid on 30 December 2025. The dividend reflects the Group's commitment to delivering sustainable shareholder returns alongside its long-term reinvestment strategy.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Managing Director of SDCG, Mr. Edison Kong</span></strong><span> commented, \"FY2025 marks a year of consolidation and strategic execution for SDCG following our listing. The strong growth in our BMS segment demonstrates our technical capabilities and growing market acceptance. At the same time, we have laid important groundwork in expanding into solar photovoltaic systems under the power purchase agreement model, positioning the Group for recurring income streams.\"</span></p><p class=\"\"><span>Looking ahead, SDCG remains focused on executing its expansion strategies from 2024 to 2027, including the expansion of its headquarters in Kajang, enhancement of tools and equipment to improve productivity, upgrading its Information and Communications Technology (\"ICT\") capabilities to strengthen its command and control centre functions, and scaling up its solar photovoltaic (\"PV\") business under the Power Purchase Agreement (\"PPA\") model. </span><span>The Group has already entered into a Power Purchase Agreement (\"PPA\") in Melaka and increased the number of PPA customers during the financial year.</span></p><p class=\"\"><span>With a strengthened balance sheet, disciplined cost management, and a growing portfolio of renewable energy and energy efficiency solutions, SDCG is well-positioned to capitalise on increasing demand for sustainable infrastructure solutions in Malaysia and the region.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>###</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT SOLAR DISTRICT COOLING GROUP BERHAD</span></strong></p><p class=\"\"><span>Solar District Cooling Group Berhad (SDCG) and its subsidiaries (the \"Group\") are established provider of building management systems (BMS) and solar thermal systems in Malaysia. The Group specialises in the design, installation, and maintenance of BMS and solar thermal systems, serving diverse sectors including commercial, institutional, and industrial properties. With a commitment to sustainability, SDCG has earned a reputation for excellence in BMS and solar thermal systems.</span></p><p class=\"\"><span>For more information, visit www.sdc.my</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Issued By:</span></strong><span> Swan Consultancy Sdn. Bhd. on behalf of Solar District Cooling Group Berhad</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jazzmin Wan</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> j.wan@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>William Yeo</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email:</span></strong><span> w.yeo@swanconsultancy.biz</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE</span></strong><span>: Solar District Cooling Group Berhad</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSxWHWwa:0/",
            "pub_date": "2026-02-26 21:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACS6XwBDa:0",
            "title": "Evolve Announces Engagement Of Integral Wealth Securities Limited For Market-Making Services",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>VANCOUVER, BC / ACCESS Newswire / February 26, 2026 / Evolve Royalties Ltd. (\"</span><strong class=\"root-Tkn6WL2y\"><span>Evolve</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") </span><span> is pleased to announce that it has entered into a market-making services agreement dated February 25, 2026 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Agreement</span></strong><span>\") with Integral Wealth Securities Limited (\"</span><strong class=\"root-Tkn6WL2y\"><span>Integral</span></strong><span>\"), to assist in maintaining an orderly trading market and contributing to the liquidity for the Company's common shares in compliance with applicable Canadian Securities Exchange (\"</span><strong class=\"root-Tkn6WL2y\"><span>CSE</span></strong><span>\") policies and applicable securities laws. Market-making activities are expected to commence on February 26, 2026. Under the Agreement, the Company will pay a monthly fee of C$7,000, exclusive of applicable taxes, for an initial three-month term. Following the initial term, the engagement will continue on a month-to-month basis and may be terminated by Evolve with 30-day prior written notice. The Agreement does not include performance-based factors, and Integral will not receive common shares, options or other securities of the Company as compensation.</span></p><p class=\"\"><span>The Company and Integral are dealing at arm's length. They are unrelated and unaffiliated entities, and neither Integral nor its principals have an interest, directly or indirectly, in the Company or in the securities of the Company.</span></p><p class=\"\"><span>Integral is a member of the Canadian Investment Regulatory Organization (\"</span><strong class=\"root-Tkn6WL2y\"><span>CIRO</span></strong><span>\") and can access all Canadian Stock Exchanges and Alternative Trading Systems. The capital and securities required for any trade undertaken by Integral as principal will be provided by Integral.</span></p><p class=\"\"><span>The engagement of Integral remains subject to acceptance by the CSE.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>CONTACT INFORMATION</span></strong></p><p class=\"\"><span>For more information about Evolve, please visit www.evolveroyalties.com or contact us:</span></p><p class=\"\"><span>Joseph de la Plante, President &amp; CEO</span></p><p class=\"\"><span>jdelaplante@evolveroyalties.com</span></p><p class=\"\"><span>+1 514 546 1070</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT INTEGRAL</span></strong></p><p class=\"\"><span>Integral Wealth Securities Limited is an independent CIRO-licensed investment dealer engaged in market making, investment banking and wealth management. Headquartered in Toronto, the firm operates from nine offices across Canada. The firm's FINRA-licensed US broker dealer affiliate, Integral Wealth Securities LLC, is based in Malvern, PA and provides investment banking as well as private placement services.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Integral Wealth Securities Limited</span></strong></p><p class=\"\"><span>181 University Avenue, Suite 1600</span></p><p class=\"\"><span>Toronto, Ontario M5H 3M7</span></p><p class=\"\"><span>Telephone: 416.203.2000</span></p><p class=\"\"><span>Email: taylor.howie@integralwealth.com</span></p><p class=\"\"><span>www.integralwealth.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>ABOUT EVOLVE</span></strong></p><p class=\"\"><span>Evolve Royalties Ltd. is a royalty and streaming company focused on acquiring high-quality royalties in base and critical metals that support electrification and the global energy transition. The Company's strategy is to build a diversified portfolio of long-life cash-flowing royalties while maintaining exposure to long-term commodity upside. The Company's common shares are listed and posted for trading on the Canadian Securities Exchange under the symbol \"CSE: EVR\". For more information please visit: www.evolveroyalties.com or the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><span>Evolve Royalties Ltd.</span></p><p class=\"\"><span>550 Burrard Street, Suite 2900</span></p><p class=\"\"><span>Vancouver, British Columbia V6C 0A3</span></p><p class=\"\"><span>www.evolveroyalties.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>FORWARD-LOOKING STATEMENTS</span></strong></p><p class=\"\"><span>This news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking statements\") within the meaning of applicable securities laws, which may include, but are not limited to, statements regarding the expected impact of the Agreement and market-making activities of Integral on the trading of the Company's common shares, and the acceptance of the market-making engagement of Integral by the Canadian Securities Exchange. All statements in this news release, other than statements of historical fact, that address events or developments that Evolve expects to occur, are forward-looking statements. Forward-looking statements are generally, but not always, identified by the words \"expects\", \"plans\", \"anticipates\", \"believes\", \"intends\", \"estimates\", \"projects\", \"potential\", \"scheduled\" and similar expressions, or that events or conditions \"will\", \"would\", \"may\", \"could\" or \"should\" occur.</span></p><p class=\"\"><span>Forward-looking statements are based on management's current expectations, assumptions, and beliefs, including assumptions regarding market conditions, regulatory approvals, and the Company's ability to execute its business strategy. Actual results may differ materially from those expressed or implied by such forward-looking statements due to various risks and uncertainties, including regulatory risks, market volatility, changes in economic conditions, and other risks discussed in the section entitled \"Risk Factors\" of the Company's listing statement dated December 11, 2025 and other materials available on the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><span>Forward-looking statements in this news release are qualified by the foregoing cautionary statements and are made only as of the date hereof. Evolve expressly disclaims any obligation to update or revise any forward-looking statements or the assumptions or factors underlying them, whether as a result of new information, future events or otherwise, other than as required by applicable law. Readers are cautioned not to place undue reliance on forward-looking statements.</span></p><p class=\"\"><span>The Canadian Securities Exchange has not reviewed and does not accept responsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Evolve Royalties Ltd.</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACS6XwBDa:0/",
            "pub_date": "2026-02-26 21:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_ACSzsyNLa:0",
            "title": "Cardiff Lexington Subsidiary Nova Ortho and Spine Announces New Healthcare Hires to Support Growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>LEXINGTON, KY / ACCESS Newswire / February 26, 2026 / </span><strong class=\"root-Tkn6WL2y\"><span>Cardiff Lexington Corporation</span></strong><span> (OTCQB:</span><strong class=\"root-Tkn6WL2y\"><span>CDIX</span></strong><span>), a healthcare holding company with deep leadership and operational expertise in Orthopedics, Spine Care, and Pain Management, today announced that the Company's subsidiary, Nova Ortho and Spine, LLC, has expanded its Florida team with the hiring of two highly qualified procedurally trained and certified nurse practitioners to support increased patient volume and demand throughout the region. These hires demonstrate Cardiff Lexington's ongoing commitment to providing best-in-class healthcare to patient populations throughout Florida, and the continued execution of the Company's growth strategy for Nova Ortho and Spine.</span></p><p class=\"\"><span>Catherine Amanda Kelly, MSN, APRN, FNP-BC, brings 20 years of clinical experience across procedural, emergency and hospital medicine that should contribute to the growth of Nova Ortho and Spine in Orlando and the Southeastern regions of Florida.</span></p><p class=\"\"><span>Ashley Logan, APRN- BC, has an extensive background in neurosurgery, orthopedic surgery and pain management. Her experience with procedure medicine, imaging and symptomology evaluations makes her a valuable addition to Nova Ortho and Spine, and her operational expertise will help to significantly improve efficiency, safety and overall patient satisfaction.</span></p><p class=\"\"><span>Alex Cunningham, Chief Executive Officer of Cardiff Lexington, commented, \"We're very pleased to enhance our team at Nova Ortho and Spine with two highly qualified nurse practitioners with deep experience in the surgical and pain management fields. These new hires support the ongoing growth of Nova Ortho and Spine and the increasing patient volumes that we continue to see throughout Florida. We remain committed to expanding our healthcare footprint with the goal of providing best-in-class healthcare to patient populations throughout the state.\"</span></p><p class=\"\"><span>Dr. Kevin Fitzgerald, Chief Medical Officer of Nova Ortho and Spine, commented, \"We're excited to officially welcome Catherine and Ashley to the Nova Ortho and Spine team. Their medical and operational expertise have played an integral role in supporting the increasing patient volume that we're seeing across our network of locations as demand for our services continues to grow.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Cardiff Lexington Corporation</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cardiff Lexington Corporation</span></strong><span> (OTCQB:CDIX) is a targeted healthcare holding company dedicated to acquiring and building middle-market niche health care clinics, primarily in Orthopedics, Spine Care, and Pain Management. The Company's partnership-driven culture emphasizes </span><span>service excellence, teamwork, accountability, and performance.</span></p><p class=\"\"><span>All current revenue is derived from </span><strong class=\"root-Tkn6WL2y\"><span>Nova Ortho and Spine, LLC</span></strong><span>, which operates a network of regional specialty and ancillary orthopedic care centers across Florida and Georgia. These facilities provide traumatic injury patients with comprehensive diagnostic and surgical services, primary care evaluations, interventional pain management, and specialty consultations.</span></p><p class=\"\"><span>For more information on Cardiff Lexington Corporation, you may access the company's website at https://cardifflexington.com/</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward-Looking Statements</span></strong></p><p class=\"\"><span>This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements are based on current expectations, estimates, and projections and involve risks and uncertainties that could cause actual results to differ materially. Cardiff Lexington Corporation undertakes no obligation to update or revise forward-looking statements except as required by law.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Contact</span></strong></p><p class=\"\"><span>Cardiff Lexington Investor Relations</span></p><p class=\"\"><span>investorsrelations@cardifflexington.com</span></p><p class=\"\"><span>(800) 628-2100 ext. 705</span></p><p class=\"\"><span>or</span></p><p class=\"\"><span>IMS Investor Relations</span></p><p class=\"\"><span>cardifflexington@imsinvestorrelations.com</span></p><p class=\"\"><span>(203) 972-9200</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> Cardiff Lexington Corporation</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_ACSzsyNLa:0/",
            "pub_date": "2026-02-26 21:00:01",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_Tnw18dC9c:0",
            "title": "Cascade Copper Provides Update on the Bendor Gold-Tungsten Project",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>3D MagneticInversion Reveals Significant Interconnected Body Beneath MineralizedZones</span></p><p class=\"\"><span>Vancouver, BritishColumbia – TheNewswire- February 26, 2025. Cascade Copper Corp.(CSE: “CASC”) (“Cascade” or the “Corporation”) ispleased to announce that it has completed a 3D magnetic inversion ofthe recently flown airborne magnetic-radiometric survey on its BendorGold-Tungsten Project (the “Project”), located ~15 kilometres northeastof the operating high grade underground  Bralorne Gold Mine near GoldBridge, British Columbia, Canada.</span></p><p class=\"\"><span>Summary:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>3D Magnetic Inversion delineates alarge interconnected intrusive body with numerous cupolas stretchingtoward surface located beneath the known gold-bearing mineralizedzones and gold-in-soil anomalies </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Cupolas likely represent multiple“blind” intrusions of the Bendor Intrusive Suite mapped on theProject and known in the area as being closely linked in timing andspace to gold-bearing systems  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Project located proximal to TaliskerResources’ operating Bralorne Mine and Endurance Gold’s RelianceProject </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Historical samples from undergroundworkings at Bristol assayed up to 30.86 g/t Au and 6.5 % WO </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Widespread untested gold-in-soilanomalies across the Project </span></p></li></ul><p class=\"\"><span>Next Steps:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Integration of the magnetic inversion into a cohesive3D geological model of the mineralizing environment including historicmine workings and underground drilling to aid future exploration anddrill targeting  </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Plans to submit a diamond drilling and geophysicspermit applications in the near-future following completion of theProject-wide 3D compilation and geological data modelling </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Expanded Project-wide soil sampling with modernmulti-element analysis for pathfinder target generation </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Detailed mapping and sampling of known mineralizedzones and gold-in-soil anomalies </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>These efforts will potentially lead to diamond drillingtargets in 2026 </span></p></li></ul><p class=\"\"><span>After completion of the 3D magnetic inversion, theCorporation believes that the gold and tungsten mineralizationreported from the historic Bristol Mine workings and adjacentmineralized vein systems could be linked to the magnetic cupolas andtheir related hydrothermal systems and may continue along strike andto depth. Historical samples from underground workings at Bristol arereported to have assayed up to 30.86 g/t gold and 6.5 % tungstentrioxide (WO3) and a 23kgsample taken from a winze reportedly assayed 48 g/t Au, 20.6 g/t Ag,and 0.16 % WO3.</span></p><p class=\"\"><span>Shannon Baird, VP Exploration for Cascade Copperremarks “The previousexploration work at Bendor has shown some impressive values of gold,tungsten, and silver throughout the Bristol and Benboe workings andvein systems. We are extremely excited that the 3D magnetic inversionmodelling has verified the potential interconnected nature of allthese showings and we are excited to get on the ground and follow upon these newly generated targets. By all indications, there existssignificant potential to expand on the mineralized gold system atBendor.”  </span></p><p class=\"\"><span>The Bendor Project has only had minimal surfaceexploration work in the past and has only been shallowly drilledwithin a narrow region surrounding the historic mine workings atBristol.  For a detailed breakdown, the previous news release datedNovember 20, 2025 details the historical results at Bendor. </span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 1: Bendor Project Location in</span><br/><span>Relation to Bralorne Mine, Reliance Project and Major Centres</span><br/></p><p class=\"\"><br/><span>Airborne Magnetic Surveys</span><br/></p><p class=\"\"><br/><span>Cascade Copper commissioned an airborne</span><br/><span>magnetics-radiometrics survey that shows a strong correlation with</span><br/><span>geology and mineralization with high magnetic intensity in the south</span><br/><span>and central portion of the Project where the various Bendor intrusives</span><br/><span>likely created a hornfelsing of the local lithologies. There also</span><br/><span>exists a strong correlation of lower or disrupted magnetic intensity</span><br/><span>to structural complexity and offsets where hydrothermal fluids tend to</span><br/><span>focus. The highly magnetic central portion of the project is</span><br/><span>interpreted to be a zone of hornfelsing and hydrothermal alteration</span><br/><span>with potential magnetite, gold, tungsten, silver, and copper</span><br/><span>enrichment. The majority of the historic gold-in-soils and surface</span><br/><span>sampling with high gold values have been associated with this highly</span><br/><span>underexplored magnetic halo zone.</span><br/></p><p class=\"\"><br/><span>In partially glaciated terrains like Bendor with thin</span><br/><span>till scree coverage and very minimal outcrop exposures on the valley</span><br/><span>slopes and walls, geophysics such as EM and magnetics play a crucial</span><br/><span>role in discovery. Inversion of the magnetics data allows us to model</span><br/><span>and project subsurface magnetism and see large scale and localized</span><br/><span>zones of magnetic anomalism that could be caused by hydrothermal</span><br/><span>alteration and potentially mineralizing fluids. The Bendor Project has</span><br/><span>several “clustered” target zones of intense magnetics probably</span><br/><span>outlining the presence of cupolas stemming from an underlying Bendor</span><br/><span>intrusive. When the surrounding country rock is infiltrated by</span><br/><span>intrusions carrying hot mineralizing fluids it creates a very</span><br/><span>distinctive magnetic signal and/or halo that can help zero in on the</span><br/><span>most prospective target zones to follow up on. This inversion exercise</span><br/><span>has done just that. Besides clearly identifying the known outcropping</span><br/><span>Bendor intrusive and related hydrothermal alteration and</span><br/><span>mineralization, it has outlined several other large analogous zones of</span><br/><span>high interest clustered within an ~10km2 zone on either</span><br/><span>side of the Tommy Creek Fault and historical Bristol Mine</span><br/><span>workings.</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 2: Bendor Project</span><br/><span>with prospect locations, soil results, and areas of High Magnetic</span><br/><span>Intensity.  Magnetic anomalies are associated with “at or near</span><br/><span>surface” intrusives related to the Central Bendor Pluton and Gold</span><br/><span>Mineralization</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 3: Bendor CHG</span><br/><span>Magnetics Draped on Topography with Historic Au-in-Soils and</span><br/><span>Prospects</span><br/></p><p class=\"\"><br/><span>Magnetic Inversion Results and</span><br/><span>Implications</span><br/></p><p class=\"\"><br/><span>More detailed surficial 2D gridding and a subsurface 3D</span><br/><span>magnetic inversion model has been completed on the airborne</span><br/><span>magnetic-radiometric data flown over the entirety of the Project. This</span><br/><span>was done to test the theory that the clustered circular magnetic</span><br/><span>features observed in the surficial data are actually connected to a</span><br/><span>larger subsurface body of the Bendor Intrusive Suite known to be</span><br/><span>associated with gold mineralization in the region. The Corporation</span><br/><span>felt this was a necessary exercise to perform since magnetics appears</span><br/><span>to correlate well with known geology and mineralization, and we feel</span><br/><span>this will significantly assist in subsurface structural and the</span><br/><span>on-going geological modelling and delineate potential zones of</span><br/><span>alteration and mineralization to target in future drilling</span><br/><span>campaigns.</span><br/></p><p class=\"\"><br/><span>Magnetic Bodies Interpreted as Bendor</span><br/><span>Intrusive</span><br/></p><p class=\"\"><br/><span>Initial review of the inversion model has verified the</span><br/><span>theory of a potential mineralizing intrusive interconnected at depth</span><br/><span>and related to the known surficial gold mineralization. Interestingly,</span><br/><span>there is only one larger known outcropping of the Bendor pluton which</span><br/><span>correlated exactly with the larger circular magnetics feature in the</span><br/><span>centre of the Project. The other magnetic cupola target zones are</span><br/><span>buried under thin cover and don’t outcrop at surface but their</span><br/><span>magnetic influence is definitely seen in the surface data.</span><br/></p><p class=\"\"><br/><span>Of note as well is that the large central 2-D magnetics</span><br/><span>feature is actually a mag-low surrounded by a ring of high magnetics</span><br/><span>which the Corporation interprets to be a hornfelsing and alteration of</span><br/><span>country rock by the intrusive and its hydrothermal fluids. However,</span><br/><span>when looking at the other magnetic anomalies are near solid magnetic</span><br/><span>high features. This could be explained by depths of the intrusion</span><br/><span>emplacement and erosional levels.</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 4: Looking SSW up Tommy Creek</span><br/><span>with the Magnetic Inversion interpreted Bendor Intrusive, the white</span><br/><span>outlines as the intersection of the intrusive at surface and the</span><br/><span>anomalous soil samples as coloured dots</span><br/></p><p class=\"\"><br/><span>Structural and Alteration Corridors</span><br/><br/></p><p class=\"\"><br/><span>The Tommy Creek Fault and Shear Zone which hosts the</span><br/><span>Bristol Mine workings and the Benboe vein emerges from the inversion</span><br/><span>modelling as an area of magnetic erosion. In other words, the magnetic</span><br/><span>response in this area has been diminished. It is interpreted that the</span><br/><span>structures along the trend have carried fluid that have destroyed the</span><br/><span>magnetic component of the Bendor Intrusive. It is possible that the</span><br/><span>Tommy Creek Fault and Shear has succumbed to multiple episodes of</span><br/><span>deformation and fluid flow which has resulted in the gold and tungsten</span><br/><span>bearing veins found at the Bristol Mine. (See Figures 4 and 5)</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 5: The Tommy Creek Fault and</span><br/><span>Shear hosts the Bristol Mine and the Benboe Vein (looking NNE) Note</span><br/><span>the magnetic erosion of the Bendor Intrusive along this trend.</span><br/></p><p class=\"\"><br/><span>The very distinctive weathered slope located south of</span><br/><span>the Bristol 11 Prospect hints at strong sericite clay alteration. (see</span><br/><span>Figure 6)  The alteration zone is adjacent to the large gold in soil</span><br/><span>anomaly at the Bristol 11 prospect and is within a magnetic low area</span><br/><span>between two magnetic intrusive bodies.  It is noted that soil</span><br/><span>sampling has not covered this distinctive alteration zone and will be</span><br/><span>a top priority in the next field program.  The alteration zone fits</span><br/><span>with the theory of a hornfelsing and mineralization event associated</span><br/><span>with the contacts of the intrusives.  It is also noted that there may</span><br/><span>be a structure  associated with the alteration trend that mimics the</span><br/><span>directions of the neighbouring Bralorne- Pioneer mine and Reliance</span><br/><span>inferred resource.</span><br/></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure 6: Orthophoto</span><br/><span>showing The Oxide Ridge Prospect with copper grab sample results and</span><br/><span>the Bristol 11 Prospect  with gold-in-soil anomalies.  Note the area</span><br/><span>of  Intense Clay-Sericite Alteration has not been completely</span><br/><span>sampled.</span><br/></p><p class=\"\"><br/><span>Oxide Ridge</span><br/></p><p class=\"\"><br/><span>The Oxide Ridge Prospect is a newly discovered area</span><br/><span>with only a few traverses across the eastern flank of the ridge done</span><br/><span>by Cascade’s team during acquisition due diligence.  The presence</span><br/><span>of sulphide veining and copper oxide staining as well as highly</span><br/><span>anomalous grab samples indicates an intriguing area for future follow</span><br/><span>up work. (See Figure 6)</span><br/></p><p class=\"\"><br/><span>Near-Term Targets</span><br/></p><p class=\"\"><br/><span>Completion of the 3D magnetic inversion along with an</span><br/><span>overview compilation and review of all historical mining, sampling,</span><br/><span>and drilling data in combination with the recent airborne magnetics</span><br/><span>and LiDAR survey data have revealed several targets worthy of</span><br/><span>“near-term” follow-up in the field. Subsurface geological</span><br/><span>modelling is expected to generate additional high-priority targets in</span><br/><span>preparation for drill permitting and diamond drilling.</span><br/></p><p class=\"\"><br/><span>Next Steps</span><br/></p><p class=\"\"><br/><span>The recently completed</span><br/><span>detailed magnetic inversion modelling exercise indicates a strong</span><br/><span>correlation of anomalous to high grade gold, silver, tungsten, and</span><br/><span>copper to high magnetics with mineralizing intrusive contacts and low</span><br/><span>magnetic disruptions associated with structural features focusing</span><br/><span>hydrothermal fluids that carry the gold. Taking this into account, the</span><br/><span>Corporation believes that performing additional detailed and refined</span><br/><span>3D geological modelling of all historical maps and data along with</span><br/><span>mining and assay data will significantly help further delineate</span><br/><span>priority drill targets. The Corporation also plans to submit a diamond</span><br/><span>drilling and geophysics permit application shortly following</span><br/><span>completion of the Project-wide compilation of historic data and</span><br/><span>geological 3D modelling. Additionally, newly verified surface magnetic</span><br/><span>and gold-in-soil anomalies will be ground-truthed early in the next</span><br/><span>field season.</span><br/></p><p class=\"\"><br/><span>The technical information in this news release was</span><br/><span>prepared and reviewed by Shannon Baird, P.Geo., a Qualified Person as</span><br/><span>defined in National Instrument 43-101. Mr. Baird is Vice President of</span><br/><span>Exploration of Cascade Copper Corp. and registered as a Professional</span><br/><span>Geoscientist with the Professional Geoscientists of Ontario as well as</span><br/><span>the Engineers and Geoscientists of British Columbia.</span><br/></p><p class=\"\"><br/><span>Management cautions that historical results are</span><br/><span>unverified and that grab samples are selective in nature, and the</span><br/><span>assay results may not necessarily represent true underlying</span><br/><span>mineralization.</span><br/></p><p class=\"\"><br/><span>References for Historical Data </span><br/></p><p class=\"\"><br/><span>*Please note that all assay values</span><br/><span>contained within this release are from previous operators, considered</span><br/><span>to be “historical” in nature, and have not been independently</span><br/><span>verified by Cascade Copper. The values have been extracted from</span><br/><span>publicly available government resources including Assessment Reports</span><br/><span>and MinFile inventory details and it is unknown what type of quality-control</span><br/><span>programs were performed at the time.</span><br/></p><p class=\"\"><br/><span>About Cascade Copper</span><br/></p><p class=\"\"><br/><span>Cascade Copper is an exploration stage natural resource</span><br/><span>company engaged in the evaluation, acquisition, and exploration of</span><br/><span>copper based mineral resource properties. Cascade is focused on copper</span><br/><span>and gold, porphyry and mesothermal gold deposits in British Columbia</span><br/><span>and VMS and BIF copper, gold and silver style deposits in Ontario.</span><br/><span>Cascade’s priority is to conduct exploration using modern technology</span><br/><span>that includes 3D inversion modelling of geophysics, LiDAR derived</span><br/><span>elevation models and AI enhanced predictive modelling from all</span><br/><span>historic and modern data inputs.  Drilling is planned on several of</span><br/><span>its copper projects this year. Cascade has five projects, including</span><br/><span>the Copper Plateau Copper-Moly Project, the Centrefire Copper Project,</span><br/><span>the Rogers Creek Copper-Gold Project, Fire Mountain Copper-Gold</span><br/><span>Project and the Bendor Gold Project where it is earning a 100%</span><br/><span>ownership over 4 years through staged exploration expenditures</span><br/><span>totalling $275,000 and issuing shares and stock to the vendor.</span><br/></p><p class=\"\"><br/><span>FOR FURTHER INFORMATION, PLEASE</span><br/><span>CONTACT:</span><br/></p><p class=\"\"><br/><span>CASCADE COPPER CORP.</span><br/></p><p class=\"\"><br/><span>Jeffrey S. Ackert, President and CEO</span><br/></p><p class=\"\"><br/><span>820-1130 West Pender</span><br/><span>St.</span><br/></p><p class=\"\"><br/><span>Vancouver, BC V6E 4A4</span><br/></p><p class=\"\"><br/><span>Telephone: 1 613 851 7699</span><br/></p><p class=\"\"><br/><span>E-Mail: info@cascadecopper.com</span></p><p class=\"\"><span>Web:    www.cascadecopper.com</span></p><p class=\"\"><span>Neither the CSE nor its Regulation Services Provider(as that term is defined in the policies of the CSE) acceptsresponsibility for the adequacy or accuracy of this release.</span></p><p class=\"\"><span>DISCLAIMER &amp; FORWARD-LOOKINGSTATEMENTS</span></p><p class=\"\"><span>This news release includes certain “forward-lookingstatements” which are not comprised of historical facts.Forward-looking statements are based on assumptions and address futureevents and conditions, and by their very nature involve inherent risksand uncertainties. Although these statements are based on currentlyavailable information, Cascade Copper Corp. provides no assurance thatactual results will meet management’s expectations. Factors whichcause results to differ materially are set out in the Corporation’sdocuments filed on SEDAR. Undue reliance should not be placed on“forward looking statements.”</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_Tnw18dC9c:0-cascade-copper-provides-update-on-the-bendor-gold-tungsten-project/",
            "pub_date": "2026-02-26 21:00:04",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_Obiph7mXa:0",
            "title": "Handelsbanken publishes its Annual Report, as well as other annual reports for 2025",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Handelsbanken's Annual Report, as well as other annual reports for 2025, havenow been published and are available at handelsbanken.com/ir.</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>Peter Grabe, Head of Investor Relations, +46 8 22 92 20</span></p><p class=\"\"><span>Mårten Bjurman, Chief Financial Officer, +46 8 22 92 20</span></p><p class=\"\"><span>Mats Olsson, Head of Press &amp; Media, +46 8701 80 18</span></p><p class=\"\"><span>This information is of the type that Svenska Handelsbanken AB is obliged tomakepublic pursuant to the Swedish Securities Market Act. The information wassubmitted for publication at 14:00 CET on 26 February 2026.For more information about Handelsbanken, see:www.handelsbanken.com</span></p><p class=\"\"><span>https://newsweb.oslobors.no/message/666984</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_Obiph7mXa:0-handelsbanken-publishes-its-annual-report-as-well-as-other-annual-reports-for-2025/",
            "pub_date": "2026-02-26 21:00:18",
            "source": "Oslo Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:3be7a9052094b:0",
            "title": "Salesforce Forecasts $46 Billion Revenue, Shares Fall 5% After Hours",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Salesforce </span><span> outlined a fiscal 2027 revenue target of about $46 billion, a figure that landed roughly in line with Wall Street expectations but may not be enough to quiet investor concerns that artificial intelligence could pressure legacy software models. The guidance arrives at a delicate moment, with shares down about 37% over the past 12 months as investors debate whether AI could erode pricing leverage or make it easier to build competing tools. The stock fell roughly 5% in extended trading after closing at $191.75 in New York. Still, Chief Executive Marc Benioff reiterated that the company is well on our way to $63 billion in annual revenue in fiscal 2030, ahead of the $60.3 billion analysts are currently projecting, and said management expects organic growth re-acceleration in the second half.</span></p><p class=\"\"><span>Fourth-quarter results offered some evidence of resilience, even if certain segments came in just shy of expectations. Revenue increased 12% to $11.2 billion in the period ended Jan. 31, marking the company's most rapid expansion in years, though $399 million of that total came from the recently completed Informatica acquisition. In constant currency terms, revenue in the core sales and service clouds rose 8% and 7%, respectively, both slightly below Wall Street estimates. Adjusted earnings of $3.81 per share topped projections. Against that backdrop, Salesforce pointed to traction in Agentforce, its AI tool capable of completing tasks such as sales development and customer service without human supervision, with annual recurring revenue surpassing $800 million in the fiscal fourth quarter, up from $500 million in the preceding period.</span></p><p class=\"\"><span>Management also underscored forward visibility and capital allocation as signals of confidence. Remaining performance obligations reached $72.4 billion in the fiscal fourth quarter, a record level that executives cited as evidence that customer commitments remain intact despite broader debate about the durability of software-as-a-service growth. Benioff said newer offerings in IT service management and life sciences are winning major customers from competitors including ServiceNow and Veeva Systems. The company also authorized a new $50 billion share repurchase program and raised its quarterly dividend to 44 cents per share, steps that could reinforce its commitment to shareholder returns as investors weigh how AI may reshape the competitive landscape.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/gurufocus:3be7a9052094b:0-salesforce-forecasts-46-billion-revenue-shares-fall-5-after-hours/",
            "pub_date": "2026-02-26 20:47:54",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM1FC:0",
            "title": "Businessman Gupta refused permission to appeal in Trafigura nickel fraud lawsuit",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    Indian businessman Prateek Gupta was refused permission by London's High Court on Thursday to appeal against a ruling that he defrauded commodities trader Trafigura over fake nickel cargoes.</span></p><p class=\"\"><span>Geneva-based Trafigura alleged Gupta was the mastermind of a fraudulent \"Ponzi scheme\" in which he and his companies agreed to provide high-quality 99.8% pure nickel but delivered low-value or even worthless materials instead.</span></p><p class=\"\"><span>Gupta accepted he did not deliver high-grade nickel cargoes but says Trafigura staff devised the scheme, something Trafigura's former head nickel trader Sokratis Oikonomou denied.</span></p><p class=\"\"><span>Judge Pushpinder Saini ruled last month that Trafigura was induced to enter into contracts \"by false and fraudulent representations\" made by Gupta and his companies.</span></p><p class=\"\"><span>The judge also said Trafigura's former employees, including Oikonomou, were \"wholly innocent of any wrongdoing\".</span></p><p class=\"\"><span>Gupta sought permission to appeal that ruling and was refused, but can still apply directly to the Court of Appeal.</span></p><p class=\"\"><span>Trafigura's lawyer Nathan Pillow said at Thursday's brief hearing that Trafigura was owed around $640 million in total, including $140 million in interest.</span></p><p class=\"\"><span>Gupta is subject to a worldwide freezing order over his assets and agreed to limit his living expenses under that order to 5,000 pounds ($6,763.50) a month, from 20,000 pounds a month.</span></p><p class=\"\"><span>Last year's trial, which concluded in December, was the culmination of events that began in November 2022, when Trafigura first received complaints about cargoes it had sold.</span></p><p class=\"\"><span>The discovery prompted Trafigura to carry out further inspections, book a $590 million charge and then sue Gupta and his companies in February 2023 for what it then described as \"systematic fraud\".</span></p><p class=\"\"><span>($1 = 0.7393 pounds)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM1FC:0-businessman-gupta-refused-permission-to-appeal-in-trafigura-nickel-fraud-lawsuit/",
            "pub_date": "2026-02-26 20:48:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2936367:0",
            "title": "WWW: FY25 delivered robust revenue and EPS growth, with FY26 guidance signaling further gains",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>FY25 saw strong growth with adjusted revenue up 7.1% and EPS up 53% year-over-year, driven by the Active Group and margin expansion. FY26 guidance projects continued revenue and EPS growth, with ongoing focus on debt reduction and global brand expansion.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2936367-abab4a967467f77091e292489d0932ca\" target=\"_blank\">Wolverine World Wide, Inc. [WWW] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2936367:0-www-fy25-delivered-robust-revenue-and-eps-growth-with-fy26-guidance-signaling-further-gains/",
            "pub_date": "2026-02-26 20:48:34",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2936374:0",
            "title": "FSZ: Q4 2025 delivered higher Adjusted EBITDA and margins, with Private Markets AUM up 11% year-over-year",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Q4 2025 saw strong core business momentum, with higher Adjusted EBITDA and margins, despite a year-over-year revenue decline. AUM decreased due to net outflows and FX, but Private Markets AUM grew 11%. Net debt and SG&amp;A expenses declined, supporting improved profitability.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2936374-ea5c21cf58d9971da47bc3358e261ac3\" target=\"_blank\">Fiera Capital Corporation Class A [FSZ] Earnings Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2936374:0-fsz-q4-2025-delivered-higher-adjusted-ebitda-and-margins-with-private-markets-aum-up-11-year-over-year/",
            "pub_date": "2026-02-26 20:48:40",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008653:0",
            "title": "Royal Bank Logs Earnings Beat, Though Gross Impaired Loans Pick Up — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Royal Bank of Canada landed another solid quarter, driven yet again by strength in its capital-markets segment, Stephen Boland of Raymond James says. First-quarter adjusted EPS of C$4.08 was ahead of the C$3.83 Boland expected and the C$3.85 consensus view. Credit-loss provisions were broadly in line with what was anticipated. Boland says that while it isn't overly concerning, an uptick in gross impaired loans was notable after trending down in recent quarters. He notes gross impaired loans were up about C$485 million on-quarter, with formations increasing in personal banking, wealth management and commercial banking. (robb.stewart@wsj.com)</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008653:0/",
            "pub_date": "2026-02-26 20:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008658:0",
            "title": "Matador Resources Files 8K - Other Events >MTDR",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Matador Resources Co. (MTDR) filed a Form 8K - Other Events - with the U.S Securities and Exchange Commission on February 26, 2026.</span></p><p class=\"\"><span>On February 26, 2026, Matador Resources Company (the \"Company\") issued a press release announcing its proposed offering (the \"Notes Offering\") of $750 million in aggregate principal amount of senior notes due 2034 (the \"New Notes\"). A copy of the press release announcing the Notes Offering is attached hereto as Exhibit 99.1 and incorporated by reference herein.</span></p><p class=\"\"><span>Also on February 26, 2026, the Company issued a press release announcing the commencement of its cash tender offer (the \"Tender Offer\") to purchase any and all of the $500 million outstanding aggregate principal amount of its 6.875% Senior Notes due 2028 (the \"2028 Notes\"), subject to certain conditions, including the consummation of the Notes Offering. A copy of the press release announcing the Tender Offer is attached hereto as Exhibit 99.2 and incorporated by reference herein.</span></p><p class=\"\"><span>This Current Report on Form 8-K is neither an offer to sell nor a solicitation of an offer to buy any security, including the New Notes, nor a solicitation for an offer to purchase any security, including the New Notes or the 2028 Notes, nor shall there be an offer, solicitation or sale in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.</span></p><p class=\"\"><span>The full text of this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1520006/000110465926020093/tm267312d1_8k.htm</span></p><p class=\"\"><span>Any exhibits and associated documents for this SEC filing can be retrieved at: https://www.sec.gov/Archives/edgar/data/1520006/000110465926020093/0001104659-26-020093-index.htm</span></p><p class=\"\"><span>Public companies must file a Form 8-K, or current report, with the SEC generally within four days of any event that could materially affect a company's financial position or the value of its shares.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008658:0/",
            "pub_date": "2026-02-26 20:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZJ0PT:0",
            "title": "Uncrustables maker J.M. Smucker appoints new directors after agreement with Elliott ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>J.M. Smucker </span><span> said on Thursday it had appointed Woo-Sung Chung and David Singer to its board, after reaching a \"constructive engagement\" with investor Elliott Investment Management.</span></p><p class=\"\"><span>Shares of the company, which also posted better-than-expected quarterly results, rose nearly 7% premarket. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZJ0PT:0-uncrustables-maker-j-m-smucker-appoints-new-directors-after-agreement-with-elliott/",
            "pub_date": "2026-02-26 20:50:20",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM13V:0",
            "title": "7-Eleven Malaysia Logs Qtrly Loss Attributable 726,000 RGT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>7-Eleven Malaysia Holdings Bhd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY LOSS ATTRIBUTABLE 726,000 RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY REVENUE 821.2 MILLION RGT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM13V:0-7-eleven-malaysia-logs-qtrly-loss-attributable-726-000-rgt/",
            "pub_date": "2026-02-26 20:50:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM11G:0",
            "title": "Focus Point Logs Qtrly Profit Attributable 12.4 Mln RGT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Focus Point Holdings Bhd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY PROFIT ATTRIBUTABLE 12.4 MILLION RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY REVENUE 91.2 MILLION RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>THIRD SINGLE-TIER INTERIM DIVIDEND OF 0.75 SEN PER ORDINARY SHARE DECLARED</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM11G:0-focus-point-logs-qtrly-profit-attributable-12-4-mln-rgt/",
            "pub_date": "2026-02-26 20:50:44",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_slides:quartr.com:2936381:0",
            "title": "CARS: Record revenue, stable margins, and strong capital returns, with modest growth outlook for 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Record Q4 and full-year 2025 revenue were achieved, with stable dealer growth and strong capital returns. Adjusted EBITDA margin remained robust, though net income declined year-over-year. 2026 guidance projects flat to modest revenue growth and continued share repurchases.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Aslides%3Aquartr.com%3A2936381-570831b8a2a8128e82532853bb5d713c\" target=\"_blank\">Cars.com Inc. [CARS] Slides Release — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_slides:quartr.com:2936381:0-cars-record-revenue-stable-margins-and-strong-capital-returns-with-modest-growth-outlook-for-2026/",
            "pub_date": "2026-02-26 20:50:58",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM0U2:0",
            "title": "Drb-Hicom Logs Qtrly Profit Attributable 337.4 Mln RGT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Drb-Hicom Bhd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY PROFIT ATTRIBUTABLE 337.4 MILLION RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY REVENUE 4.57 BILLION RGT</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM0U2:0-drb-hicom-logs-qtrly-profit-attributable-337-4-mln-rgt/",
            "pub_date": "2026-02-26 20:51:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_RSEfB47:0",
            "title": "Listing of additional IPAS “Indexo” shares on Baltic Main List",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Nasdaq RigaAnnouncement from the exchange</span></p><p class=\"\"><span>Listing of additional IPAS “Indexo” shares on Baltic Main List</span></p><p class=\"\"><span>Nasdaq Riga Management Board decided on February 26, 2026, to list additionalIPAS “Indexo” shares on Baltic Main list, next to the already listed shares, asof February 27, 2026.</span></p><p class=\"\"><span>Additional information:</span></p><p class=\"\"><span>Issuer's full name                                                 IPAS \"Indexo\"Issuer's short name                                                IDX          Securities ISIN code                                               LV0000101863 Nominal value of one share                                         1.00 EUR     Number of additional shares to be listed                           73 892       Total number of listed shares after additional shares will be      10 321 753    listed                                                                         Orderbook short name                                               IDX1R</span></p><p class=\"\"><span>Additional shares are listed after the increase of IPAS “Indexo” share capitalas a result of a private placement.</span></p><p class=\"\"><span>Nasdaq BalticIssuer Services+371 67212431www.nasdaqbaltic.com</span></p><p class=\"\"><span>Nasdaq Baltic is a common name for exchanges, regulated markets, alternativemarkets First North operated by Nasdaq companies in the Baltic states, i.e.Nasdaq Tallinn AS, Nasdaq Riga, AS and AB Nasdaq Vilnius.https://view.news.eu.nasdaq.com/view?id=bb89a40d67e25b259d5601ad900f95cab&amp;lang=en&amp;src=omxlink</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_RSEfB47:0-listing-of-additional-ipas-indexo-shares-on-baltic-main-list/",
            "pub_date": "2026-02-26 20:51:07",
            "source": "Riga Stock Exchange",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_FWN3ZM18G:0",
            "title": "Genting Malaysia Logs Qtrly Profit Attributable 145.9 Mln RGT",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Genting Malaysia Bhd </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY PROFIT ATTRIBUTABLE 145.9 MILLION RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>QTRLY REVENUE 3.01 BILLION RGT</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>DECLARED A FINAL SINGLE-TIER DIVIDEND OF 7.0 SEN PER ORDINARY SHARE FOR FY2025</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_FWN3ZM18G:0-genting-malaysia-logs-qtrly-profit-attributable-145-9-mln-rgt/",
            "pub_date": "2026-02-26 20:51:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM0NN:0",
            "title": "Payoneer Q4 revenue misses expectations, net income up 5%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Financial technology firm's Q4 revenue missed analyst expectations</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net income for Q4 increased 5% year-over-year</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company repurchased $175 mln in shares, 8% of shares outstanding</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payoneer expects 2026 revenue ex. interest between $900 mln and $940 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Company projects 2026 adjusted EBITDA ex. interest at $85 mln to $95 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Payoneer estimates 2026 transaction costs at ~15% of revenue</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>B2B SMB GROWTH - B2B SMBs revenue increased 17% year-over-year, contributing significantly to revenue ex. interest</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>ARPU INCREASE - ARPU grew 15% year-over-year, driven by larger customers and strategic pricing</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>INTEREST INCOME DECLINE - Interest income fell 8% in Q4 due to lower interest rates, affecting overall revenue</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>Q4 Revenue</span></p></td><td><p class=\"\"><span>Miss</span></p></td><td><p class=\"\"><span>$274.70 mln</span></p></td><td><p class=\"\"><span>$282.35 mln (10 Analysts)</span></p></td></tr><tr><td><p class=\"\"><span>Q4 EPS</span></p></td><td></td><td><p class=\"\"><span>$0.05</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Net Income</span></p></td><td></td><td><p class=\"\"><span>$19 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating Expenses</span></p></td><td></td><td><p class=\"\"><span>$245.77 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>Q4 Operating income</span></p></td><td></td><td><p class=\"\"><span>$28.92 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 10 \"strong buy\" or \"buy\", 1 \"hold\" and no \"sell\" or \"strong sell\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The average consensus recommendation for the business support services peer group is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Payoneer Global Inc is $9.23, about 76.1% above its February 25 closing price of $5.24</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 19 times the next 12-month earnings vs. a P/E of 21 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM0NN:0-payoneer-q4-revenue-misses-expectations-net-income-up-5/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008615:0",
            "title": "Papa John's Posts Lower 4Q Profit, Revenue as North American Business Struggles",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Connor Hart</span></p><p class=\"\"><span>Papa John's International said profit and revenue fell in the fourth quarter, hurt by a weak consumer backdrop and higher promotions across its North American business.</span></p><p class=\"\"><span>The pizza chain on Thursday posted a profit of $8.63 million, or 21 cents a share, down from $15 million, or 44 cents a share, a year earlier.</span></p><p class=\"\"><span>Stripping out one-time costs, earnings were 34 cents a share. Analysts polled by FactSet expected adjusted earnings of 33 cents a share.</span></p><p class=\"\"><span>Revenue fell 6.1% to $498.2 million and missed the $517.3 million that Wall Street modeled.</span></p><p class=\"\"><span>Chief Executive Todd Penegor said strength across international markets carried the company during the recent quarter, while its North American results reflect a weak consumer backdrop and elevated promotional environment.</span></p><p class=\"\"><span>Papa John's is making progress on its turnaround strategy as it works to reinforce its brand health, sharpen its value proposition, build its innovation pipeline and enhance customer experience, he added.</span></p><p class=\"\"><span>Looking forward, Papa John's guided for systemwide restaurant sales to be flat to down low single digits this year. Comparable sales, which account for store openings and closings, are projected to be down 2% to 4% in North America, offset by an estimated 2%-to-4% gain across international markets.</span></p><p class=\"\"><span>Shares fell 3.5% to $32.64 in premarket trading.</span></p><p class=\"\"><span>Write to Connor Hart at connor.hart@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008615:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601:0",
            "title": "Marcus Corporation Reports Fourth Quarter and Full Year Fiscal 2025 Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q EPS 19c &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q Net $5.96M &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>*Marcus Corp 4Q Rev $193.5M &gt;MCS</span><br/><strong class=\"root-Tkn6WL2y\"><span>(12:45 GMT) </span></strong><span>Press Release: Marcus Corporation Reports Fourth Quarter and Full Year Fiscal 2025 Results</span></p><p class=\"\"><span>Marcus Theatres leads the industry in fourth quarter box office growth; Marcus Hotels &amp; Resorts reports record revenue and Adjusted EBITDA for fiscal 2025</span></p><p class=\"\"><span>MILWAUKEE--(BUSINESS WIRE)--February 26, 2026--</span></p><p class=\"\"><span>The Marcus Corporation </span><span> today reported results for the fourth quarter and fiscal year 2025 ended December 31, 2025.</span></p><p class=\"\"><span>\"Both of our divisions outperformed their industries in the fourth quarter, with Marcus Theatres leading the industry in box office growth thanks to price optimization strategies and a favorable film slate, and Marcus Hotels &amp; Resorts delivering strong fourth quarter results to cap a record year for the division,\" said Gregory S. Marcus, chief executive officer of Marcus Corporation. \"During the fourth quarter, our theatre division benefitted from strong performances from family films and several blockbusters across genres that performed well in our markets. Consumers continued to show demand for out-of-home entertainment experiences, with a wide variety of great movies bringing audiences to the big screen at Marcus Theatres during the holiday season. We are excited for a 2026 film slate that includes several family films and some of the biggest movie franchises. In our hotel division, stable leisure demand and strong group bookings contributed to a year of record revenue and Adjusted EBITDA, with our newly renovated properties driving our outperformance in both the fourth quarter and full-year fiscal 2025. The positive impact of the strategic reinvestments made over the past few years will continue to position Marcus Hotels &amp; Resorts well for both the near- and long-term, as our renovated assets continue to win in their markets. As we look ahead to fiscal 2026 and beyond, we expect the building momentum in both businesses to be sustained by our long-standing commitment to operational excellence, the resiliency of our balance sheet, and the unwavering dedication of our valued associates.\"</span></p><p class=\"\"><span>Fourth Quarter Fiscal 2025 Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total revenues for the fourth quarter of fiscal 2025 were $193.5   million, a 2.8% increase from total revenues of $188.3 million for the   fourth quarter of fiscal 2024. Revenues were favorably impacted by a   shift in operating days due to the previously announced change in the   Company's fiscal calendar as described further below.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Operating income was $1.7 million for the fourth quarter of fiscal   2025, compared to operating loss of $2.2 million for the prior year   quarter. Operating income for the fourth quarter of fiscal 2025 was   negatively impacted by $5.2 million, or $0.12 per diluted common share   net of tax, of noncash impairment charges. Operating loss for the fourth   quarter of fiscal 2024 was negatively impacted by $6.4 million, or $0.15   per share net of tax, of noncash impairment charges.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings was $6.0 million for the fourth quarter of fiscal 2025,   compared to net earnings of $1.0 million for the same period in fiscal   2024. Net earnings for the fourth quarter of fiscal 2025 was favorably   impacted by $7.6 million, or $0.25 per diluted common share, of income   tax benefit from a historic rehabilitation tax credit (net of valuation   allowance) from the Hilton Milwaukee renovation. Net earnings for the   fourth quarter of fiscal 2024 was favorably impacted by $6.0 million, or   $0.19 per diluted common share, of income tax benefit due to decreases in   valuation allowances for deferred state income taxes.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings per diluted common share was $0.19 for the fourth quarter   of fiscal 2025, compared to net earnings per diluted common share of   $0.03 for the fourth quarter of fiscal 2024.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Adjusted EBITDA was $26.8 million for the fourth quarter of fiscal   2025, a 3.6% increase from Adjusted EBITDA of $25.9 million for the prior   year quarter. </span></li></ul><p class=\"\"><span>Full Year Fiscal 2025 Highlights</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Total revenues for fiscal 2025 were $758.5 million, a 3.1% increase   from total revenues of $735.6 million for fiscal 2024.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Operating income was $17.1 million for fiscal 2025, a 5.5% increase   from operating income of $16.2 million for fiscal 2024. Operating income   for fiscal 2025 was negatively impacted by $5.2 million, or $0.12 per   diluted common share net of tax, of noncash impairment charges. Operating   income for fiscal 2024 was negatively impacted by $6.8 million, or $0.16   per share net of tax, of noncash impairment charges.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings was $12.7 million for fiscal 2025, compared to net loss of   $7.8 million for fiscal 2024. Net earnings for fiscal 2025 was favorably   impacted by $7.6 million, or $0.24 per diluted common share, of income   tax benefit from a historic rehabilitation tax credit (net of valuation   allowance) from the Hilton Milwaukee renovation, and was favorably   impacted by a $3.4 million, or $0.11 per share, gain from a property   insurance settlement, net of tax. Net loss for fiscal 2024 was favorably   impacted by $6.1 million, or $0.19 per diluted common share, of income   tax benefit due to decreases in valuation allowances for deferred state   income taxes, and was negatively impacted by $16.7 million, or $0.52 per   diluted common share, of debt conversion expense and related tax impacts   of convertible senior notes repurchases.   </span></li><li class=\"listItem-bmN0_SHH\"><span>Net earnings per diluted common share was $0.41 for fiscal 2025,   compared to net loss per diluted common share of $0.25 for fiscal 2024.     </span></li><li class=\"listItem-bmN0_SHH\"><span>Adjusted EBITDA was $99.3 million for the full year fiscal 2025, a 3.1%   decrease from Adjusted EBITDA of $102.4 million for fiscal 2024. </span></li></ul><p class=\"\"><span>Marcus Theatres(R)</span></p><p class=\"\"><span>For the fourth quarter of fiscal 2025, Marcus Theatres reported total revenues of $123.8 million, a 2.2% increase over the same period last year. Revenues were favorably impacted by a shift in the fiscal calendar resulting in five additional days between Christmas and New Year's in exchange for four less days at the end of September. Operating income in the fourth quarter of fiscal 2025 was $7.7 million compared to operating income of $3.3 million for the same period of fiscal 2024 and was negatively impacted by $5.2 million of noncash impairment charges. Adjusted EBITDA in the fourth quarter of fiscal 2025 was $24.1 million, a 1.9% increase compared to $23.7 million in the fourth quarter of fiscal 2024.</span></p><p class=\"\"><span>Marcus Theatres outperformed the industry by 7.6 percentage points during the fourth quarter of fiscal 2025 compared to the fourth quarter of fiscal 2024, according to data from Comscore. Same store admission revenues for the fourth quarter of fiscal 2025 increased 6.1% compared to the fourth quarter of fiscal 2024. Same store attendance decreased 5.7% in the fourth quarter of fiscal 2025, with average ticket price increasing 12.7% compared to the prior year period due to strategic price changes designed to optimize pricing during peak demand periods, as well as a higher percentage of sales coming from premium large format and 3D showings. During the fourth quarter of fiscal 2025, Marcus Theatres' top five highest-performing films were Wicked: For Good, Zootopia 2, Avatar: Fire and Ash, Five Nights at Freddy's 2, and Black Phone 2.</span></p><p class=\"\"><span>For the full year fiscal 2025, Marcus Theatres reported total revenues of $462.7 million compared to $447.7 million in fiscal 2024, a 3.4% increase from the prior year period. Operating income was $29.4 million in fiscal 2025 compared to $22.1 million in fiscal 2024, a 32.9% increase that was negatively impacted by impairment charges of $5.2 million in fiscal 2025. Adjusted EBITDA for the year decreased to $76.5 million in fiscal 2025 compared to $78.1 million in fiscal 2024, primarily due to increased labor and other costs, with labor efficiency sequentially improving during the year. Average ticket price increased 3.7% during fiscal 2025 compared to fiscal 2024, while average concession revenue per person grew 4.1% over the prior year. The highest grossing films for the year included A Minecraft Movie, Wicked: For Good, Lilo &amp; Stitch, Zootopia 2 and Superman.</span></p><p class=\"\"><span>\"Marcus Theatres benefitted from a favorable mix of films in the fourth quarter, with blockbuster hits like Zootopia 2, Wicked: For Good, and Avatar: Fire and Ash and exciting originals like The Housemaid and Marty Supreme giving moviegoers of all ages and demographics a reason to enjoy incredible entertainment experiences at the movies,\" said Mark A. Gramz, president of Marcus Theatres. \"Looking to fiscal 2026, holdover fourth quarter fiscal 2025 films, including the long run of Avatar: Fire and Ash, and several new films released in the first quarter of fiscal 2026 has kicked off what is expected to be a robust slate of must-see movies in the year ahead. The franchise heavy slate includes the newest installments of several family favorites that tend to play well in our markets, including Toy Story 5, Minions &amp; Monsters, The Super Mario Galaxy Movie, and the live action adaptation of Moana, along with popular action adventures like Star Wars: The Mandalorian and Grogu, Spider-Man: Brand New Day, Dune: Part Three, and Avengers: Doomsday. Moreover, the highly anticipated release of Christopher Nolan's The Odyssey, nostalgic revivals like Scream 7 and The Devil Wears Prada 2, and a large slate of other appealing wide release films means fiscal 2026 has more than something for everyone. And with the highest concentration of luxury recliner seating and PLF screens among the top theatre circuits, incredible food and beverage offerings, consumer-friendly technology, and the outstanding contributions of our associates, Marcus Theatres is well positioned to capitalize on what is expected to be a memorable year of moviegoing.\" Several films have contributed to early fiscal 2026 first quarter results, including the carry over impact of late 2025 releases including Avatar: Fire and Ash, Zootopia 2, The Housemaid, Song Sung Blue, Anaconda, Marty Supreme, and The Spongebob Movie: Search for Square Pants, and new releases during the first quarter of fiscal 2026 such as 28 Years Later, The Bone Temple, Send Help, GOAT, Wuthering Heights and I Can Only Imagine 2. The film slate for fiscal 2026 features many well-known franchises and highly anticipated films including: Scream 7, Hoppers, Project Hail Mary, The Super Mario Galaxy Movie, Michael, The Devil Wears Prada 2, Star Wars: The Mandalorian and Grogu, Masters of the Universe, Toy Story 5, Supergirl: Woman of Tomorrow, Minions &amp; Monsters, Moana, The Odyssey, Spider-Man: Brand New Day, The Cat in the Hat, The Hunger Games: Sunrise on the Reaping, Hexed, Jumanji 3, Dune: Part Three, and Avengers: Doomsday.</span></p><p class=\"\"><span>Marcus(R) Hotels &amp; Resorts</span></p><p class=\"\"><span>During the fourth quarter of fiscal 2025, total revenues before cost reimbursements were $60.4 million, a 5.0% increase over the same period in fiscal 2024. Operating loss in the fourth quarter of fiscal 2025 was $0.1 million and was impacted by a $0.9 million increase in depreciation expense from hotel renovations. Adjusted EBITDA was $7.3 million in the fourth quarter of fiscal 2025, an increase of 3.4% compared to the fourth quarter of fiscal 2024.</span></p><p class=\"\"><span>Revenue per available room, or RevPAR, increased 3.5% at comparable company-owned hotels during the fourth quarter of fiscal 2025 compared to the prior year period. As a result, Marcus Hotels &amp; Resorts outperformed the industry by 2.7 percentage points during the fourth quarter of fiscal 2025, according to data from STR.</span></p><p class=\"\"><span>For the full year fiscal 2025, Marcus Hotels &amp; Resorts again reported record total revenues and record Adjusted EBITDA. Total revenues before cost reimbursements in fiscal 2025 were $257.6 million, a 3.7% increase compared to fiscal 2024. Operating income in fiscal 2025 was $14.4 million, a decrease of 22.0% from the prior year period primarily due to a $5.0 million increase in depreciation expense from hotel renovations completed in fiscal 2024 and 2025. Adjusted EBITDA was $42.7 million in fiscal 2025, a 2.7% increase compared to the prior year. RevPAR decreased 0.7% in fiscal 2025 compared to fiscal 2024 and was unfavorably impacted by room displacement during the Hilton Milwaukee renovation in the first half of the year.</span></p><p class=\"\"><span>\"We are proud to deliver another year of record revenues and Adjusted EBITDA, made even more impressive considering the number of rooms out of service during the Hilton Milwaukee renovation in the first half of the year and the difficult comparison to fiscal year 2024, which included the one-time positive impact of the Republican National Convention in Milwaukee,\" said Michael R. Evans, president of Marcus Hotels &amp; Resorts. \"Our newly renovated assets contributed meaningfully to our outperformance in both the fourth quarter and full year fiscal 2025 thanks to stable leisure demand and continued strong group bookings. As we look ahead, operational excellence across the portfolio will continue to drive our results as we settle into a less intensive capital reinvestment cycle.\"</span></p><p class=\"\"><span>Group booking pace for fiscal 2026 is running slightly ahead compared to the same period in fiscal 2025. Banquet and catering revenue for fiscal 2026 is running similarly ahead of the same time last year.</span></p><p class=\"\"><span>In December 2025, Marcus Hotels &amp; Resorts announced it completed the Hilton Milwaukee renovation, the most extensive renovation in the company's history. The project revitalized the hotel's lobby and bar, transformed its meeting and event spaces, and restyled its 554 guest rooms.</span></p><p class=\"\"><span>In January 2026, the division announced the opening of The Marc Hotel, an independent 175-room hotel in downtown Milwaukee, in the former west wing of the Hilton Milwaukee. Centrally located in the heart of the city, The Marc Hotel is connected to the Baird Center via a climate-controlled skywalk and located just steps from the city's premier corporate offices, sports and entertainment venues, several dining destinations, and nearby Marquette University.</span></p><p class=\"\"><span>Looking ahead, Grand Geneva Resort &amp; Spa will open its new short-course golf course, Wee Nip, in spring 2026. The new course is designed to cater to golfers of all skill levels, joining two championship courses and a new practice facility, as part of the acclaimed resort's ongoing multi-year renovation.</span></p><p class=\"\"><span>Return of Capital to Shareholders</span></p><p class=\"\"><span>During the fourth quarter of fiscal 2025, the Company repurchased 0.1 million shares of common stock for $1.8 million in cash, and during the full year fiscal 2025, the Company repurchased 1.1 million shares of common stock for $18.0 million in cash. In total, the Company returned $27.1 million in capital to shareholders through share repurchases and dividends paid during fiscal 2025.</span></p><p class=\"\"><span>Since resuming share repurchases in the third quarter of fiscal 2024, the Company has repurchased 1.8 million shares of common stock, or 5.7% of the shares outstanding, for $27.6 million in cash. In total, over the last two years the Company returned $45.6 million in capital to shareholders through share repurchases and dividends paid during fiscal 2024 and 2025.</span></p><p class=\"\"><span>As of December 31, 2025, there were 4.5 million shares remaining available for repurchase under Board of Directors repurchase authorizations. As of December 31, 2025, the Company had 23.7 million shares of common stock outstanding and 7.0 million shares of Class B common stock outstanding.</span></p><p class=\"\"><span>Fiscal Year Change</span></p><p class=\"\"><span>Beginning in fiscal 2025, the Company's fiscal year changed from a 52-53 week fiscal year ending on the last Thursday of each year to a fiscal year ending on December 31 of each year. Accordingly, fiscal 2025 was a 370 operating day fiscal year that began on December 27, 2024 and ended on December 31, 2025, with quarterly results for the three month periods ending March 31, June 30, September 30 and December 31. The fourth quarter of fiscal 2025 was favorably impacted by one additional operating day and by a shift in the fiscal calendar that included five additional days between the Christmas and New Year's holidays and four fewer days at the end of September, compared to the fourth quarter of fiscal 2024. Fiscal 2026 will be a 365 operating day fiscal year that began on January 1, 2026 and will end on December 31, 2026, with quarterly results for the three month periods ending March 31, June 30, September 30 and December 31.</span></p><p class=\"\"><span>Conference Call and Webcast</span></p><p class=\"\"><span>Marcus Corporation management will hold a conference call today, Thursday, February 26, 2026, at 10:00 a.m. Central/11:00 a.m. Eastern time. Interested parties may listen to the call live on the internet through the investor relations section of the company's website: investors.marcuscorp.com, or by dialing 1-646-844-6383 and entering the passcode 467741. Listeners should dial in to the call at least 5-10 minutes prior to the start of the call or should go to the website at least 15 minutes prior to the call to download and install any necessary audio software.</span></p><p class=\"\"><span>A telephone replay of the conference call will be available through Thursday, March 5, 2026, by dialing 1-866-813-9403 and entering passcode 631850. The webcast will be archived on the company's website until its next earnings release.</span></p><p class=\"\"><span>Non-GAAP Financial Measure</span></p><p class=\"\"><span>Adjusted EBITDA has been presented in this press release as a supplemental measure of financial performance that is not required by, or presented in accordance with, GAAP. The company defines Adjusted EBITDA as net earnings (loss) attributable to Marcus Corporation before investment income or loss, interest expense, other expense, gain or loss on disposition of property, equipment and other assets, equity earnings or losses from unconsolidated joint ventures, net earnings or losses attributable to noncontrolling interests, income taxes, depreciation and amortization and non-cash share-based compensation expense, adjusted to eliminate the impact of certain items that the company does not consider indicative of its core operating performance. A reconciliation of this measure to the equivalent measure under GAAP, along with reconciliations of this measure for each of our operating segments, are set forth in the attached table.</span></p><p class=\"\"><span>Adjusted EBITDA is a key measure used by management and the company's board of directors to assess the company's financial performance and enterprise value. The company believes that Adjusted EBITDA is a useful measure, as it eliminates certain expenses and gains that are not indicative of the company's core operating performance and facilitates a comparison of the company's core operating performance on a consistent basis from period to period. The company also uses Adjusted EBITDA as a basis to determine certain annual cash bonuses and long-term incentive awards, to supplement GAAP measures of performance to evaluate the effectiveness of its business strategies, to make budgeting decisions, and to compare its performance against that of other peer companies using similar measures. Adjusted EBITDA is also used by analysts, investors and other interested parties as a performance measure to evaluate industry competitors.</span></p><p class=\"\"><span>Adjusted EBITDA is a non-GAAP measure of the company's financial performance and should not be considered as an alternative to net earnings (loss) as a measure of financial performance, or any other performance measure derived in accordance with GAAP and it should not be construed as an inference that the company's future results will be unaffected by unusual or non-recurring items. Additionally, Adjusted EBITDA is not intended to be a measure of liquidity or free cash flow for management's discretionary use. In addition, this non-GAAP measure excludes certain non-recurring and other charges and has its limitations as an analytical tool. You should not consider Adjusted EBITDA in isolation or as a substitute for analysis of the company's results as reported under GAAP. In evaluating Adjusted EBITDA, you should be aware that in the future the company will incur expenses that are the same as or similar to some of the items eliminated in the adjustments made to determine Adjusted EBITDA, such as acquisition expenses, preopening expenses, accelerated depreciation, impairment charges and other adjustments. The company's presentation of Adjusted EBITDA should not be construed to imply that the company's future results will be unaffected by any such adjustments. Definitions and calculations of Adjusted EBITDA differ among companies in our industries, and therefore Adjusted EBITDA disclosed by the company may not be comparable to the measures disclosed by other companies.</span></p><p class=\"\"><span>About Marcus Corporation</span></p><p class=\"\"><span>Headquartered in Milwaukee, Marcus Corporation is a leader in the entertainment and hospitality industries, with significant company-owned real estate assets. Marcus Corporation's theatre division, Marcus Theatres(R) , is the fourth largest theatre circuit in the U.S. and currently owns or operates 985 screens at 78 locations in 17 states under the Marcus Theatres, Movie Tavern(R) by Marcus and BistroPlex(R) brands. The company's hospitality division, Marcus(R) Hotels &amp; Resorts, owns and/or manages 17 hotels, resorts and other properties in eight states. For more information, please visit the company's website at www.marcuscorp.com.</span></p><p class=\"\"><span>Certain matters discussed in this press release are \"forward-looking statements\" intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements may generally be identified as such because the context of such statements include words such as we \"believe, \" \"anticipate,\" \"expect\" or words of similar import. Similarly, statements that describe our future plans, objectives or goals are also forward-looking statements. Such forward-looking statements are subject to certain risks and uncertainties which may cause results to differ materially from those expected, including, but not limited to, the following: (1) the adverse effects future pandemics or epidemics may have on our theatre and hotels and resorts businesses, results of operations, liquidity, cash flows, financial condition, access to credit markets and ability to service our existing and future indebtedness; (2) the availability, in terms of both quantity and audience appeal, of motion pictures for our theatre division (including disruptions in the production of films due to events such as a strike by actors, writers or directors or future pandemics); (3) the effects of theatre industry dynamics such as the maintenance of a suitable window between the date such motion pictures are released in theatres and the date they are released to other distribution channels; (4) the effects of adverse economic conditions in our markets; (5) the effects of adverse economic conditions on our ability to obtain financing on reasonable and acceptable terms, if at all; (6) the effects on our occupancy and room rates caused by the relative industry supply of available rooms at comparable lodging facilities in our markets; (7) the effects of competitive conditions in our markets; (8) our ability to achieve expected benefits and performance from our strategic initiatives and acquisitions; (9) the effects of increasing depreciation expenses, reduced operating profits during major property renovations, impairment losses, and preopening and start-up costs due to the capital intensive nature of our business; (10) the effects of changes in the availability of and cost of labor and other supplies essential to the operation of our business; (11) the effects of tariffs that are implemented or merely threatened on our costs; (12) the effects of weather conditions, particularly during the winter in the Midwest and in our other markets; (13) our ability to identify properties to acquire, develop and/or manage and the continuing availability of funds for such development; (14) the adverse impact on business and consumer spending on travel, leisure and entertainment resulting from terrorist attacks in the United States or other incidents of violence in public venues such as hotels and movie theatres; and (15) a disruption in our business and reputational and economic risks associated with civil securities claims brought by shareholders. These statements are not guarantees of future performance and are subject to risks, uncertainties and other factors, some of which are beyond our control and difficult to predict and could cause actual results to differ materially from those expressed or forecasted in the forward-looking statements. Our forward-looking statements are based upon our assumptions, which are based upon currently available information. Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are made only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span> </span><br/><span>                     THE MARCUS CORPORATION </span><br/><span> </span><br/><span>             Consolidated Statements of Operations </span><br/><span>                          (Unaudited) </span><br/><span>             (in thousands, except per share data) </span><br/><span> </span><br/><span>                     Three Months Ended    Twelve Months Ended </span><br/><span>                    --------------------  ---------------------- </span><br/><span>                    December   December   December    December </span><br/><span>                    31, 2025   26, 2024   31, 2025    26, 2024 </span><br/><span>                    ---------  ---------  ---------  ----------- </span><br/><span>Revenues: </span><br/><span>   Theatre </span><br/><span>    admissions      $ 59,392   $ 56,265   $220,385   $214,421 </span><br/><span>   Rooms              25,762     24,616    114,544    113,344 </span><br/><span>   Theatre </span><br/><span>    concessions       51,001     50,759    197,856    191,989 </span><br/><span>   Food and </span><br/><span>    beverage          21,153     20,384     84,410     78,102 </span><br/><span>   Other revenues     26,353     26,118    100,563     97,230 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>                     183,661    178,142    717,758    695,086 </span><br/><span>   Cost </span><br/><span>    reimbursements     9,837     10,171     40,700     40,474 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Total revenues       193,498    188,313    758,458    735,560 </span><br/><span> </span><br/><span>Costs and </span><br/><span>expenses: </span><br/><span>   Theatre </span><br/><span>    operations        61,511     59,909    234,680    225,472 </span><br/><span>   Rooms              10,530     10,550     43,624     43,425 </span><br/><span>   Theatre </span><br/><span>    concessions       20,419     20,943     82,169     78,406 </span><br/><span>   Food and </span><br/><span>    beverage          16,335     15,392     63,900     60,419 </span><br/><span>   Advertising and </span><br/><span>    marketing          7,012      6,111     26,077     24,559 </span><br/><span>   Administrative     21,977     21,724     92,578     88,958 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization      17,915     17,970     70,191     67,958 </span><br/><span>   Rent                6,368      6,437     25,243     25,911 </span><br/><span>   Property taxes      3,597      2,655     16,222     14,716 </span><br/><span>   Other operating </span><br/><span>    expenses          11,087     12,284     40,838     42,269 </span><br/><span>   Impairment </span><br/><span>    charges            5,172      6,351      5,172      6,823 </span><br/><span>   Reimbursed </span><br/><span>    costs              9,837     10,171     40,700     40,474 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Total costs and </span><br/><span> expenses            191,760    190,497    741,394    719,390 </span><br/><span>                     -------    -------    -------    ------- </span><br/><span> </span><br/><span>Operating income </span><br/><span> (loss)                1,738     (2,184)    17,064     16,170 </span><br/><span> </span><br/><span>Other income </span><br/><span>(expense): </span><br/><span>   Investment </span><br/><span>    income               414        557        878      2,231 </span><br/><span>   Interest </span><br/><span>    expense           (2,903)    (2,812)   (11,472)   (10,972) </span><br/><span>   Other income </span><br/><span>    (expense)           (452)      (392)     2,848     (1,513) </span><br/><span>   Debt conversion </span><br/><span>    expense               --       (203)        --    (15,521) </span><br/><span>   Equity losses </span><br/><span>    from </span><br/><span>    unconsolidated </span><br/><span>    joint </span><br/><span>    ventures            (173)      (158)      (611)      (604) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>                      (3,114)    (3,008)    (8,357)   (26,379) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span> </span><br/><span>Earnings (loss) </span><br/><span> before income </span><br/><span> taxes                (1,376)    (5,192)     8,707    (10,209) </span><br/><span>Income tax benefit    (7,332)    (6,178)    (3,984)    (2,422) </span><br/><span>                     -------    -------    -------    ------- </span><br/><span>Net earnings </span><br/><span> (loss)             $  5,956   $    986   $ 12,691   $ (7,787) </span><br/><span>                     =======    =======    =======    ======= </span><br/><span> </span><br/><span>Net earnings </span><br/><span> (loss) per common </span><br/><span> share - diluted    $   0.19   $   0.03   $   0.41   $  (0.25) </span><br/><span> </span><br/><span>Weighted average </span><br/><span> shares </span><br/><span> outstanding - </span><br/><span> diluted              30,768     31,766     31,279     31,887 </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                           THE MARCUS CORPORATION </span><br/><span> </span><br/><span>                   Condensed Consolidated Balance Sheets </span><br/><span>                                (Unaudited) </span><br/><span>                               (In thousands) </span><br/><span> </span><br/><span>                                             December 31,     December 26, </span><br/><span>                                                  2025             2024 </span><br/><span>                                            ---------------  --------------- </span><br/><span> </span><br/><span>Assets: </span><br/><span> </span><br/><span>   Cash and cash equivalents                 $       23,448   $       40,841 </span><br/><span>   Restricted cash                                    3,134            3,738 </span><br/><span>   Accounts receivable                               19,082           21,457 </span><br/><span>   Assets held for sale                                  --            1,199 </span><br/><span>   Other current assets                              18,912           24,915 </span><br/><span>   Property and equipment, net                      697,712          685,734 </span><br/><span>   Operating lease right-of-use assets              142,115          159,194 </span><br/><span>   Other assets                                     110,129          107,450 </span><br/><span>                                                -----------      ----------- </span><br/><span> </span><br/><span>Total Assets                                 $    1,014,532   $    1,044,528 </span><br/><span>                                                ===========      =========== </span><br/><span> </span><br/><span>Liabilities and Shareholders' Equity: </span><br/><span> </span><br/><span>   Accounts payable                          $       44,523   $       50,690 </span><br/><span>   Taxes other than income taxes                     18,482           18,696 </span><br/><span>   Other current liabilities                         81,390           78,806 </span><br/><span>   Current portion of finance lease </span><br/><span>    obligations                                       2,827            2,591 </span><br/><span>   Current portion of operating lease </span><br/><span>    obligations                                      16,219           15,765 </span><br/><span>   Current maturities of long-term debt                  --           10,133 </span><br/><span>   Finance lease obligations                          8,452           10,360 </span><br/><span>   Operating lease obligations                      148,977          164,776 </span><br/><span>   Long-term debt                                   159,007          149,007 </span><br/><span>   Deferred income taxes                             30,905           32,619 </span><br/><span>   Other long-term obligations                       46,372           46,219 </span><br/><span>   Equity                                           457,378          464,866 </span><br/><span>                                                -----------      ----------- </span><br/><span> </span><br/><span>Total Liabilities and Shareholders' Equity   $    1,014,532   $    1,044,528 </span><br/><span>                                                ===========      =========== </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                    THE MARCUS CORPORATION </span><br/><span> </span><br/><span>                 Business Segment Information </span><br/><span>                         (Unaudited) </span><br/><span>                        (In thousands) </span><br/><span> </span><br/><span>                            Hotels/     Corporate </span><br/><span>               Theatres      Resorts      Items       Total </span><br/><span>               ---------  ------------  ---------  ----------- </span><br/><span>Three Months </span><br/><span>Ended </span><br/><span>December 31, </span><br/><span>2025 </span><br/><span>Revenues       $ 123,793   $   69,536   $    169   $193,498 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)            7,687          (90)    (5,859)     1,738 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     10,439        7,106        370     17,915 </span><br/><span>Adjusted </span><br/><span> EBITDA           24,112        7,338     (4,636)    26,814 </span><br/><span> </span><br/><span>Three Months </span><br/><span>Ended </span><br/><span>December 26, </span><br/><span>2024 </span><br/><span>Revenues       $ 121,158   $   67,074   $     81   $188,313 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)            3,344          481     (6,009)    (2,184) </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     11,452        6,216        302     17,970 </span><br/><span>Adjusted </span><br/><span> EBITDA           23,658        7,095     (4,872)    25,881 </span><br/><span> </span><br/><span>Twelve Months </span><br/><span>Ended </span><br/><span>December 31, </span><br/><span>2025 </span><br/><span>Revenues       $ 462,741   $  295,269   $    448   $758,458 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)           29,437       14,416    (26,789)    17,064 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     41,755       26,873      1,563     70,191 </span><br/><span>Adjusted </span><br/><span> EBITDA           76,458       42,719    (19,909)    99,268 </span><br/><span> </span><br/><span>Twelve Months </span><br/><span>Ended </span><br/><span>December 26, </span><br/><span>2024 </span><br/><span>Revenues       $ 447,723   $  287,506   $    331   $735,560 </span><br/><span>Operating </span><br/><span> income </span><br/><span> (loss)           22,147       18,477    (24,454)    16,170 </span><br/><span>Depreciation </span><br/><span> and </span><br/><span> amortization     45,352       21,917        689     67,958 </span><br/><span>Adjusted </span><br/><span> EBITDA           78,070       41,584    (17,247)   102,407 </span><br/><span> </span><br/><span>Corporate items include amounts not allocable to the business </span><br/><span>segments. Corporate revenues consist principally of rent and </span><br/><span>the corporate operating loss includes general corporate </span><br/><span>expenses. Corporate information technology costs and </span><br/><span>accounting shared services costs are allocated to the business </span><br/><span>segments based upon several factors, including actual usage </span><br/><span>and segment revenues. </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                     Supplemental Data </span><br/><span>                        (Unaudited) </span><br/><span>                       (In thousands) </span><br/><span> </span><br/><span>                 Three Months Ended    Twelve Months Ended </span><br/><span>                --------------------  ---------------------- </span><br/><span>                December   December   December    December </span><br/><span>Consolidated    31, 2025   26, 2024   31, 2025    26, 2024 </span><br/><span>-------------   ---------  ---------  ---------  ----------- </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> operating </span><br/><span> activities     $ 48,800   $ 52,566   $ 84,200   $103,940 </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> investing </span><br/><span> activities      (24,767)   (23,501)   (71,373)   (81,898) </span><br/><span>Net cash flow </span><br/><span> provided by </span><br/><span> (used in) </span><br/><span> financing </span><br/><span> activities       (7,932)   (17,531)   (30,824)   (37,301) </span><br/><span>Capital </span><br/><span> expenditures    (22,402)   (25,440)   (83,211)   (79,210) </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>                    THE MARCUS CORPORATION </span><br/><span> </span><br/><span>   Reconciliation of Net earnings (loss) to Adjusted EBITDA </span><br/><span>                         (Unaudited) </span><br/><span>                        (In thousands) </span><br/><span> </span><br/><span>                     Three Months Ended   Twelve Months Ended </span><br/><span>                     ------------------  --------------------- </span><br/><span>                     December  December  December </span><br/><span>                       31,       26,       31,      December </span><br/><span>                       2025      2024      2025     26, 2024 </span><br/><span>                     --------  --------  --------  ----------- </span><br/><span>Net earnings (loss)  $ 5,956   $   986   $12,691   $ (7,787) </span><br/><span>Add (deduct): </span><br/><span>    Investment </span><br/><span>     (income) loss      (414)     (557)     (878)    (2,231) </span><br/><span>    Interest </span><br/><span>     expense           2,903     2,812    11,472     10,972 </span><br/><span>    Other expense </span><br/><span>     (income) (a)        452       392    (2,848)     1,513 </span><br/><span>    (Gain) loss on </span><br/><span>     disposition of </span><br/><span>     property, </span><br/><span>     equipment and </span><br/><span>     other assets        703       291      (553)       386 </span><br/><span>    Equity losses </span><br/><span>     from </span><br/><span>     unconsolidated </span><br/><span>     joint </span><br/><span>     ventures            173       158       611        604 </span><br/><span>    Income tax </span><br/><span>     expense </span><br/><span>     (benefit)        (7,332)   (6,178)   (3,984)    (2,422) </span><br/><span>    Depreciation </span><br/><span>     and </span><br/><span>     amortization     17,915    17,970    70,191     67,958 </span><br/><span>    Share-based </span><br/><span>     compensation </span><br/><span>     (b)               1,286     1,049     7,502      8,206 </span><br/><span>    Impairment </span><br/><span>     charges (c)       5,172     6,351     5,172      6,823 </span><br/><span>    Theatre exit </span><br/><span>     costs (d)            --        --       135        136 </span><br/><span>    Insured losses </span><br/><span>     (recoveries) </span><br/><span>     (e)                  --         4      (243)       243 </span><br/><span>    Debt conversion </span><br/><span>     expense (f)          --       203        --     15,521 </span><br/><span>    Other </span><br/><span>     non-recurring </span><br/><span>     (g)                  --     2,400        --      2,485 </span><br/><span>                      ------    ------    ------    ------- </span><br/><span>   Adjusted EBITDA   $26,814   $25,881   $99,268   $102,407 </span><br/><span>                      ======    ======    ======    ======= </span><br/><span> </span><br/><span> </span><br/><span> </span><br/><span>         Reconciliation of Operating income (loss) to Adjusted EBITDA by Reportable Segment </span><br/><span>                                             (Unaudited) </span><br/><span>                                           (In thousands) </span><br/><span> </span><br/><span>                   Three Months Ended December 31, 2025      Twelve Months Ended December 31, 2025 </span><br/><span>                  --------------------------------------  ------------------------------------------- </span><br/><span>                             Hotels                                    Hotels </span><br/><span>                                &amp;      Corp.                              &amp;       Corp. </span><br/><span>                  Theatres   Resorts    Items    Total     Theatres    Resorts    Items      Total </span><br/><span>                  ---------  -------  --------  --------  -----------  -------  ---------  ---------- </span><br/><span>Operating income </span><br/><span> (loss)           $   7,687  $  (90)  $(5,859)  $  1,738  $29,437      $14,416  $(26,789)  $17,064 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization     10,439   7,106       370     17,915   41,755       26,873     1,563    70,191 </span><br/><span>   Loss (gain) </span><br/><span>    on </span><br/><span>    disposition </span><br/><span>    of property, </span><br/><span>    equipment </span><br/><span>    and other </span><br/><span>    assets              660      43        --        703     (813)         277       (17)     (553) </span><br/><span>   Share-based </span><br/><span>    compensation </span><br/><span>    (b)                 154     279       853      1,286    1,015        1,153     5,334     7,502 </span><br/><span>   Impairment </span><br/><span>    charges (c)       5,172      --        --      5,172    5,172           --        --     5,172 </span><br/><span>   Theatre exit </span><br/><span>    costs (d)            --      --        --         --      135           --        --       135 </span><br/><span>   Insured </span><br/><span>    losses </span><br/><span>    (recoveries) </span><br/><span>    (e)                  --      --        --         --     (243)          --        --      (243) </span><br/><span>                   --------   -----    ------    -------   ------       ------   -------    ------ </span><br/><span>   Adjusted </span><br/><span>    EBITDA        $  24,112  $7,338   $(4,636)  $ 26,814  $76,458      $42,719  $(19,909)  $99,268 </span><br/><span> </span><br/><span> </span><br/><span>                    Three Months Ended December 26, 2024    Twelve Months Ended December 26, 2024 </span><br/><span>                   --------------------------------------  --------------------------------------- </span><br/><span>                              Hotels                                 Hotels </span><br/><span>                                 &amp;      Corp.                           &amp;       Corp. </span><br/><span>                   Theatres   Resorts    Items    Total    Theatres  Resorts    Items      Total </span><br/><span>                   ---------  -------  --------  --------  --------  -------  ---------  --------- </span><br/><span>Operating income </span><br/><span> (loss)            $   3,344  $   481  $(6,009)  $(2,184)  $ 22,147  $18,477  $(24,454)  $  16,170 </span><br/><span>   Depreciation </span><br/><span>    and </span><br/><span>    amortization      11,452    6,216      302    17,970     45,352   21,917       689      67,958 </span><br/><span>   Loss (gain) on </span><br/><span>    disposition </span><br/><span>    of property, </span><br/><span>    equipment and </span><br/><span>    other assets         155      141       (5)      291        254      137        (5)        386 </span><br/><span>   Share-based </span><br/><span>    compensation </span><br/><span>    (b)                  169      257      623     1,049        932    1,053     6,221       8,206 </span><br/><span>   Impairment </span><br/><span>    charges (c)        6,351       --       --     6,351      6,823       --        --       6,823 </span><br/><span>   Theatre exit </span><br/><span>    costs (d)             --       --       --        --        136       --        --         136 </span><br/><span>   Insured losses </span><br/><span>    (recoveries) </span><br/><span>    (e)                    4       --       --         4        243       --        --         243 </span><br/><span>   Other </span><br/><span>    non-recurring </span><br/><span>    (g)                2,183       --      217     2,400      2,183       --       302       2,485 </span><br/><span>                    --------   ------   ------    ------    -------   ------   -------    -------- </span><br/><span>   Adjusted </span><br/><span>    EBITDA         $  23,658  $ 7,095  $(4,872)  $25,881   $ 78,070  $41,584  $(17,247)  $ 102,407 </span><br/><span> </span><br/><span> </span><br/><span>(a)    Includes a gain from an insurance settlement of $4.5M related to </span><br/><span>       insured property damage at one theatre location in fiscal 2025. </span><br/><span>(b)    Non-cash expense related to share-based compensation programs. </span><br/><span>(c)    Non-cash impairment charges in fiscal 2025 related to eight operating </span><br/><span>       theatres and one vacant parcel of land. Non-cash impairment charges in </span><br/><span>       fiscal 2024 related to three operating theatres, one operating theatre </span><br/><span>       that closed in early fiscal 2025, and one permanently closed theatre. </span><br/><span>       Non-cash impairment charges in fiscal 2023 related to one permanently </span><br/><span>       closed theatre. </span><br/><span>(d)    Non-recurring costs related to the closure and exit of one theatre </span><br/><span>       location in fiscal 2024. </span><br/><span>(e)    Repair costs and insurance recoveries that are non-operating in nature </span><br/><span>       related to insured property damage at one theatre location. </span><br/><span>(f)    Debt conversion expense for repurchases of $100.1 million aggregate </span><br/><span>       principal amount of Convertible Notes. See Convertible Senior Notes in </span><br/><span>       the \"Liquidity and Capital Resources\" section of MD&amp;A included in the </span><br/><span>       fiscal 2025 Form 10-K for further discussion. </span><br/><span>(g)    Other non-recurring in fiscal 2024 includes settlement and legal </span><br/><span>       expenses related to an equipment lease agreement impacted by the </span><br/><span>       COVID-19 pandemic in Theatres, and professional fees related to </span><br/><span>       convertible debt repurchase transactions and corporate office </span><br/><span>       relocation expenses in Corporate Items. </span><br/><span> </span></pre><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260225045975/en/</span></p><p class=\"\"><span>CONTACT:    For additional information, contact:</span></p><p class=\"\"><span>Chad Paris</span></p><p class=\"\"><span>(414) 905-1100</span></p><p class=\"\"><span>investors@marcuscorp.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226008601_20260226008603:0",
            "title": "Marcus Corp 4Q Rev $193.5M >MCS",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226008601_20260226008603:0/",
            "pub_date": "2026-02-26 20:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}