{
    "data": [
        {
            "id": "DJN_DN20250204009713:0",
            "title": "Why Lower-Cost E-Commerce Items Might Get a Price Hike — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chao Deng</p><p class=\"\">The flurry of executive decisions by President Trump includes a less-noticed move to begin charging tariffs on billions of dollars worth of Chinese clothing and other inexpensive Chinese goods delivered directly to U.S. shoppers.</p><p class=\"\">In recent years, Chinese e-commerce firms like Shein and Temu, as well as many sellers on Amazon, have taken advantage of a U.S. trade provision called the de minimis exemption that allows individual packages valued at or below $800 to enter the U.S. duty-free. An explosion in the number of packages and heightened scrutiny on U.S. trade with China has led to a bipartisan push to restrict its use.</p><p class=\"\">Some critics say the de minimis loophole allows Chinese drugs and precursors to easily enter the U.S. When Trump suspended China's use of de minimis on Saturday, he did so via an executive order \"to address the synthetic opioid supply chain\" in China.</p><p class=\"\">Trump could suspend the use of de minimis for more countries.</p><p class=\"\">On Saturday, he announced de minimis suspensions for Mexico and Canada as well, pointing again to drug trafficking as the rationale. Trade experts say that the de minimis exemption is likely back on for Mexico and Canada, after the two countries struck agreements with Trump to push back 25% tariffs on most of their exports to the U.S.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009713:0/",
            "pub_date": "2025-02-05 03:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:ff0b697bd2f6f:0",
            "title": "Loop Media, Inc. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Loop Media, Inc., a leading provider of streaming media and digital out-of-home advertising solutions, has released its Form 10-Q report for the first quarter of fiscal year 2025. The report highlights the company's financial performance and key business activities during a challenging period marked by significant revenue declines and strategic operational adjustments.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue</strong>: $3.73 million, reflecting a significant decrease from the previous year's $10.17 million, indicating a challenging quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit</strong>: $1.43 million, down from $3.62 million in the prior year, highlighting reduced profitability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Loss from Operations</strong>: $(3.48) million, compared to $(4.26) million in the previous year, showing a slight improvement in operational efficiency.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Loss</strong>: $(4.54) million, an improvement from the $(5.29) million loss in the prior year, suggesting some cost management efforts.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Basic and diluted net loss per common share</strong>: $(0.05), compared to $(0.09) in the previous year, indicating a reduction in loss per share.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The company reported that advertising revenue accounted for 91% of total revenue for the three months ended December 31, 2024. This includes revenue from direct programmatic and local advertising, as well as sponsorships. Legacy and other business revenue, which includes streaming services, subscription content services, and hardware delivery, accounted for the remaining 9% of total revenue.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong>: As of December 31, 2024, the company had approximately 83,000 active Loop Players and Partner Screens across the Loop Platform. This included 23,225 quarterly active Loop Players on the owned and operated platform, representing a decrease of 4,586 from the previous quarter. The number of Partner Screens increased by approximately 11,000 to 60,000.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong>: In the first quarter of fiscal year 2025, the company expanded its subscription offerings to include a two-tier music video service. This includes a 'primary tier' with fewer than 10 music video channels provided under a free ad-based service, and a 'premium tier' offering a full library of curated music video channels under a subscription service. Additionally, a non-music subscription offering was introduced, featuring live channels ranging from sports events to news and culture.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company anticipates further losses in the foreseeable future and is focused on generating sufficient revenue and raising additional funds through debt and equity financing efforts. The company is also exploring potential strategic alternatives to maximize shareholder value and evaluate potential financing opportunities.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1643988/000149315225004826/form10-q.htm\" rel=\"nofollow\" target=\"_blank\">Loop Media, Inc. [ LPTV ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:ff0b697bd2f6f:0-loop-media-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 03:43:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009714:0",
            "title": "JOLTS Won't Jolt the Fed to Cut — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The news in the Job Openings and Labor Turnover Survey wasn't stellar, but it probably won't be enough to get the Fed leaning toward an interest-rate cut in March, economists at Barclays writes in a note. Hiring and job-quit rates both fell throughout 2024, but leveled off somewhat in the final few months of the year. For now, there is \"little in today's data to alter the course of Fed policy,\" the Barclays team says. But they add that with a lower ratio of job openings to unemployed workers, it's becoming more likely that any further decline in labor demand would push up the unemployment rate in the months ahead. (matt.grossman@wsj.com; @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009714:0/",
            "pub_date": "2025-02-05 03:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009726:0",
            "title": "Front Month Nymex ULSD Fell 1.35% to Settle at $2.4298 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex ULSD for March delivery lost 3.33 cents per gallon, or 1.35% to $2.4298 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage decline since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive sessions</li><li class=\"listItem-bmN0_SHH\">Down 5.47 cents or 2.20% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two day dollar and percentage decline since Tuesday, Jan. 28, 2025</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the seventh lowest this year</li><li class=\"listItem-bmN0_SHH\">Lowest settlement value since Thursday, Jan. 9, 2025</li><li class=\"listItem-bmN0_SHH\">Off 18.03% from its 52-week high of $2.9642 hit Friday, Feb. 9, 2024</li><li class=\"listItem-bmN0_SHH\">Up 18.07% from its 52-week low of $2.058 hit Tuesday, Sept. 10, 2024</li><li class=\"listItem-bmN0_SHH\">Down 11.41% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 7.29% from its 2025 settlement high of $2.621 hit Friday, Jan. 17, 2025</li><li class=\"listItem-bmN0_SHH\">Up 3.49% from its 2025 settlement low of $2.3478 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Off 52.69% from its record high of $5.1354 hit Thursday, April 28, 2022</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 10.92 cents or 4.71%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009726:0/",
            "pub_date": "2025-02-05 03:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009727:0",
            "title": "Front Month Nymex RBOB Gasoline Fell 0.88% to Settle at $2.0990 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex RBOB Gasoline for March delivery lost 1.87 cents per gallon, or 0.88% to $2.0990 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage decline since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Down two of the past three sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the seventh highest this year</li><li class=\"listItem-bmN0_SHH\">Off 25.63% from its 52-week high of $2.8223 hit Tuesday, April 16, 2024</li><li class=\"listItem-bmN0_SHH\">Up 12.25% from its 52-week low of $1.87 hit Tuesday, Sept. 10, 2024</li><li class=\"listItem-bmN0_SHH\">Down 5.34% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 2.77% from its 2025 settlement high of $2.1589 hit Wednesday, Jan. 15, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.42% from its 2025 settlement low of $2.0102 hit Wednesday, Jan. 8, 2025</li><li class=\"listItem-bmN0_SHH\">Off 50.91% from its record high of $4.2762 hit Thursday, June 9, 2022</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 9.75 cents or 4.87%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009727:0/",
            "pub_date": "2025-02-05 03:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009724:0",
            "title": "Front Month Nymex Natural Gas Fell 2.95% to Settle at $3.2530 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex Natural Gas for March delivery lost 9.90 cents per million British thermal units, or 2.95% to $3.2530 per million British thermal units today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Down five of the past seven sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the third lowest this year</li><li class=\"listItem-bmN0_SHH\">Off 23.60% from its 52-week high of $4.258 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 106.54% from its 52-week low of $1.575 hit Tuesday, March 26, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 61.92% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 23.60% from its 2025 settlement high of $4.258 hit Thursday, Jan. 16, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.87% from its 2025 settlement low of $3.044 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Off 78.85% from its record high of $15.378 hit Tuesday, Dec. 13, 2005</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is down 38.00 cents or 10.46%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009724:0/",
            "pub_date": "2025-02-05 03:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009725:0",
            "title": "Front Month Nymex Crude Fell 0.63% to Settle at $72.70 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Front Month Nymex Crude for March delivery lost 46 cents per barrel, or 0.63% to $72.70 today</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Largest one day dollar and percentage decline since Wednesday, Jan. 29, 2025</li><li class=\"listItem-bmN0_SHH\">Down two of the past three sessions</li><li class=\"listItem-bmN0_SHH\">Today's settlement value is the third lowest this year</li><li class=\"listItem-bmN0_SHH\">Off 16.35% from its 52-week high of $86.91 hit Friday, April 5, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.57% from its 52-week low of $65.75 hit Tuesday, Sept. 10, 2024</li><li class=\"listItem-bmN0_SHH\">Down 0.83% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 9.17% from its 2025 settlement high of $80.04 hit Wednesday, Jan. 15, 2025</li><li class=\"listItem-bmN0_SHH\">Up 0.23% from its 2025 settlement low of $72.53 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Off 49.96% from its record high of $145.29 hit Thursday, July 3, 2008</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 98.00 cents or 1.37%</li></ul><p class=\"\">All prices are calculated based on the settlement price of the current front month contract.</p><p class=\"\">Source: Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009725:0/",
            "pub_date": "2025-02-05 03:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309185:0",
            "title": "SharkNinja to Deliver Sustained Momentum, Tariff Remain Headwind in Near Term, Oppenheimer Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SharkNinja  is likely to deliver sustained growth following a better-than-expected Q4 due to a strong US holiday season, Oppenheimer said Tuesday in a note. </p><p class=\"\">However, the company may initiate a \"conservative\" full-year 2025 guidance initially, potentially taking into account transitory Chinese tariff headwinds, the firm said in an earnings preview. SharkNinja is scheduled to release Q4 results on Feb. 13. </p><p class=\"\">While SharkNinja remains a \"top pick\" for Oppenheimer, the brokerage said financial projections for the company are subject to near-term adjustments amid tariff-related challenges. </p><p class=\"\">\"We are building in some conservatism given the unexpected early start to tariffs,\" it said. </p><p class=\"\">Oppenheimer has an outperform rating on the stock and a $120 price target.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309185:0/",
            "pub_date": "2025-02-05 03:45:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1PH513:0",
            "title": "Good360 and JCPenney Partner to Provide Essential Clothing and Support for Southern California Disaster Recovery",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alexandria, VA, Feb.  04, 2025  (GLOBE NEWSWIRE) — Good360, the global leader in product philanthropy and purposeful giving, and JCPenney have partnered to provide critical support for families impacted by recent disasters in Southern California. JCPenney is donating 500,000 units of clothing, footwear, homewares, and beauty essentials to fulfill immediate needs and support long-term recovery efforts in the Los Angeles area. Through its extensive nonprofit network, Good360 will assess the specific needs of impacted communities to ensure timely and effective distribution. In addition to contributing inventory to the LA Wildfires, JCPenney is donating $25,000 to support Good360’s disaster relief logistics, now entering its third week. </p><p class=\"\">“JCPenney has been an incredible partner in helping us deliver essential resources to those impacted,” said Cinira Baldi, CEO of Good360. “Their generous financial and product donations allow us to respond swiftly and strategically, ensuring that clothing, footwear, hygiene products, and home essentials are distributed at the right place, at the right time, to the right people, in a way that’s socially responsible and sustainable.”</p><p class=\"\">Good360 and JCPenney remain committed to supporting disaster recovery efforts and will continue working together to provide aid and resources to communities recovering from crisis.</p><p class=\"\">“At JCPenney, we believe in the power of community and the importance of giving back,” said Michelle Wlazlo, Brand CEO, JCPenney. “By partnering with Good360, we can help provide relief and comfort to families during this difficult time and ensure that resources are deployed where they are most needed.”</p><p class=\"\">To date, Good360 has distributed more than $11 million worth of immediately requested products, such as diapers, hygiene items, and PPE items, in addition to raising more than $400,000 to support current relief efforts in Southern California.</p><p class=\"\">“Our donor network is the lynchpin of our ability to give communities hope and a prosperous future,” said Peyton Kliewer, director of disaster recovery for Good360. “What Good360 does is only possible thanks to Good360’s unique position between nonprofits/agencies active on the ground and corporate partners like JCPenney.” </p><p class=\"\">According to Good360, cash donations remain the most useful for Southern California relief right now as they allow the organization to secure warehouses, resources, and the data needed for a multi-year recovery effort. Donations can be made at https://good360.org/corporate-funds/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Good360</strong></p><p class=\"\">Good360’s mission is to close the need gap by partnering with socially responsible companies to source highly needed donated goods and distribute them through its diverse network of up to 100,000 vetted nonprofits. In doing so, Good360 opens opportunity for those in need, for the nonprofits that support them, and for companies that donate the goods, all while keeping usable items out of landfills. Good360 has distributed more than $21 billion in donated goods thanks to corporate donors such as Advance Auto Parts, Amazon, American Eagle Outfitters, CVS Health, Gap Inc., JCPenney, Levi Strauss &amp; Company, Mattel, Tempur Sealy International, and UPS. Good360 is a registered 501(c)(3) organization. Learn more at https://www.good360.org.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About JCPenney</strong></p><p class=\"\">JCPenney, part of Catalyst Brands, is the shopping destination for America’s diverse, working families. With inclusivity at its core, the Company’s product assortment meets customers’ everyday needs and helps them commemorate every special occasion with style, quality and value. JCPenney offers a broad portfolio of fashion, apparel, home, beauty and jewelry from national and private brands and provides personal services including salon, portrait and optical. The Company and its 50,000 associates worldwide serve customers where, when and how they want to shop – from jcp.com to more than 650 stores in the U.S. and Puerto Rico.</p><p class=\"\">In 2022, JCPenney celebrated 120 years as an iconic American brand by continuing its legacy of connecting with customers through shopping and community engagement. Please visit JCPenney’s Newsroom to learn more and follow JCPenney on Facebook, Instagram, and Twitter.</p><p class=\"\">Melissa Skabich</p><p class=\"\">Good360</p><p class=\"\">973-760-9926</p><p class=\"\">mskabich@pcecommunications.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1PH513:0-good360-and-jcpenney-partner-to-provide-essential-clothing-and-support-for-southern-california-disaster-recovery/",
            "pub_date": "2025-02-05 03:37:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1UG:0",
            "title": "Wall Street gains on US-China trade optimism, energy boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">PepsiCo, Estee lauder fall after weak earnings forecasts</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Palantir jumps on upbeat revenue outlook</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Indexes up: Dow 0.19%, S&amp;P 500 0.6%, Nasdaq 1.16%</li></ul></span></div><span><p class=\"\">    The three major stock indexes climbed on Tuesday, aided by energy stocks, while investors saw reason for optimism for a trade breakthrough between the U.S. and China after President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> delayed tariffs for Canada and Mexico. </p><p class=\"\">New 10% U.S. tariffs on Chinese imports took effect on Tuesday, which China countered with levies on U.S. goods. It was unclear when the country's leaders would talk.</p><p class=\"\">Six of the 11 S&amp;P 500 sectors traded higher, with energy stocks  leading the gains with a 1.9% rise, paring earlier losses.</p><p class=\"\">Trump had said over the weekend he would impose a 25% tariff on goods from Mexico and Canada, but agreed to a 30-day pause on Monday, in return for border and crime concessions from both countries.</p><p class=\"\">\"The president was so quick to offer a 30-day stay of execution to Mexico and Canada, so you get the idea that maybe what he's really trying to do is embrace a quick declaration of victory which doesn’t change much from a trade perspective,\" said Sam Stovall, chief investment strategist at CFRA Research.</p><p class=\"\">\"Investors have been breathing a sigh of relief today and we’ll see if a month from now they can continue to breathe that sigh of relief.\"  </p><p class=\"\">Alphabet  was up 1.8% ahead of its quarterly results, which are due after markets close, while Nvidia  advanced 2.6%. </p><p class=\"\">Palantir  jumped 23.2% after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates.</p><p class=\"\">At 2:05 p.m. EST (1905 GMT) the Dow Jones Industrial Average  rose 84.79 points, or 0.19%, to 44,506.70, the S&amp;P 500  gained 36.26 points, or 0.60%, to 6,030.83 and the Nasdaq Composite  gained 224.93 points, or 1.16%, to 19,616.88. </p><p class=\"\">Biotechnology firm Illumina  dropped 6%, while PVH Corp , the holding company for brands including Calvin Klein, slipped 0.7% after China placed the companies on its \"unreliable entity list\". </p><p class=\"\">Trump's delayed tariffs for Canada and Mexico helped the three major U.S. stock indexes pare some of the heavy losses suffered earlier on Monday and close trading well off session lows.</p><p class=\"\">Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise.</p><p class=\"\">A Labor Department report showed U.S. job openings stood at 7.6 million in December, compared to an estimated 8 million, according to economists polled by Reuters.</p><p class=\"\">In earnings-driven moves, PepsiCo  fell 4.5% after it forecast annual profit below expectations and missed quarterly revenue estimates. </p><p class=\"\">Estee Lauder  plummeted 14.8% after the cosmetics company posted another weak quarter amid demand weakness and announced job cuts. </p><p class=\"\">Merck  dropped 10% after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenues.</p><p class=\"\">PayPal  fell 11.9% after the digital payments giant's operating margin shrank in the fourth quarter.</p><p class=\"\">   Advancing issues outnumbered decliners by a 2.44-to-1 ratio on the New York Stock Exchange, and by a 2.06-to-1 ratio on the Nasdaq. </p><p class=\"\">The S&amp;P 500 posted 26 new 52-week highs and 15 new lows while the Nasdaq Composite recorded 61 new highs and 109 new lows.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1UG:0-wall-street-gains-on-us-china-trade-optimism-energy-boost/",
            "pub_date": "2025-02-05 03:37:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309186:0",
            "title": "Update: WTI Falls as U.S. Delays Tariffs on Mexico, Canada While China Retaliates to Trump's Levy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">West Texas Intermediate (WTI) crude oil weakened on Tuesday as China retaliated for a 10% tariff imposed on its imports into the United States, a day after Donald Trump's threats to impose levies on Canada and Mexico's exports to the country were postponed for 30 days. </p><p class=\"\">WTI crude oil for March delivery closed down US$0.46 to settle at US$72.70 per barrel, while April Brent crude was last seen up US$0.27 to US$76.23. </p><p class=\"\">Prices initially jumped on Monday as the Trump Administration promised to impose 25% tariffs on imports from Canada and Mexico beginning on Tuesday, with a 10% levy on energy imports from Canada, which supplies 20% of U.S. oil demand. Trump on Monday agreed to postpone the measures on both countries for 30 days in exchange for heightened border security measures. </p><p class=\"\">\"Crude oil initially surged on concerns over Canadian supply but quickly reversed lower after a one-month tariff delay and escalating trade tensions between the US and China - both major energy consumers. This underscores the market's sensitivity to policy shifts and demand uncertainty,\" Saxo Bank wrote. </p><p class=\"\">Still, the U.S. administration went ahead with 10% tariffs for imports from China, with China retaliating with targeted tariffs of up to 15% and export controls on strategic materials, including tungsten and tellurium. </p><p class=\"\">\"While we expect the market to continue reacting positively to the North American developments, it will be interesting to gauge sentiment as the market parses potential impacts from Asia (as well as any negotiations that may occur over the coming days),\" Tudor, Pickering, Holt analyst Jake Roberts noted. </p><p class=\"\">OPEC+ on Monday held a ministerial meeting that ended with an agreement to stick with its plans to begin returning 2.2-million barrels per day of voluntary production cuts by increasing supply by 122,000 bpd monthly beginning in April, while keeping other quota cuts in place through next year despite Donald Trump's demands the group raise output to lower oil prices. </p><p class=\"\">\"OPEC decided to stick to its guns and keep the output quotas in place until the end of 2026 and gradually unwind the 2.2 mbpd of voluntary constraints from April, this year. Don't hold your breath until Donald Trump is content with the OPEC+ strategy but should the export tariffs on Canadian and Mexican oil be re-introduced further down the line and prices strengthen again, the tapering might just take place. In case of a price drop and another delay in easing output restrictions, Mr Trump's patience will be severely tested,\" PVM Oil Associates noted.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309186:0/",
            "pub_date": "2025-02-05 03:37:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009704:0",
            "title": "U.S. Stocks Rise Despite Tariff Concerns — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Caitlin McCabe and Krystal Hur</p><p class=\"\">U.S. stocks staged a small recovery Tuesday, despite China's retaliation against the new U.S. tariffs.</p><p class=\"\">The moves were milder than Monday's big swings, and some signs of investor anxiety remained.</p><p class=\"\">Among the notable moves:</p><p class=\"\">Stocks indexes rose. The Dow industrials added 0.1%, and the S&amp;P 500 climbed 0.5%. The tech-heavy Nasdaq Composite led gains, up 1.1%.</p><p class=\"\">The Cboe Volatility Index, or VIX, fell below 17, after surging Monday. The \"fear gauge\" is higher than the average of about 16 over the past year, but far from panic territory.</p><p class=\"\">Yields on benchmark Treasury notes fell. The 10-year yield traded around 4.53%, compared with 4.542% Monday.</p><p class=\"\">The WSJ Dollar Index edged down. The Canadian dollar, Chinese yuan, euro and British pound slipped against the dollar.</p><p class=\"\">Oil prices were volatile. U.S. crude futures slid below $71 a barrel, before rebounding back above $73.</p><p class=\"\">Bitcoin prices traded around $99,000.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009704:0/",
            "pub_date": "2025-02-05 03:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309178:0",
            "title": "Getty Images Sees Q4 Revenue In Line With Expectations, Narrows FY24 Revenue Outlook",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Getty Images  said Tuesday that it expects Q4 revenue in the range of $244 million to $250 million, compared with $225.9 million a year earlier. </p><p class=\"\">Analysts polled by FactSet expect $245.5 million. </p><p class=\"\">The company projects its preliminary revenue for the year ended Dec. 31 to be between $936 million and $942 million, narrowed from a prior outlook of $934 million to $943 million. </p><p class=\"\">Analysts surveyed by FactSet expect $937.5 million. </p><p class=\"\">The supplier of stock images also said it expects fiscal year 2024 adjusted EBITDA to be at or above the high-end of a previously provided guidance range. The company previously said it expected adjusted EBITDA of $292 million to $294 million. </p><p class=\"\">Shares of the company were up 1.4% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309178:0/",
            "pub_date": "2025-02-05 03:38:47",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009707:0",
            "title": "Mexico Posts Record Remittances in 2024 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Worker remittances to Mexico rose 2.3% in 2024 to a record $64.75 billion, while showing signs of a slowdown, according to data released by the Bank of Mexico. Remittances in December fell 4.9% from the year-earlier month to $5.23 billion. The outlook is patchy for 2025, even without considering possible impact of an anti-immigrant policy under the Trump administration, BBVA's Juan José Li Ng says in a note. BBVA's base case is that remittances will grow 3% this year, \"but with a downward bias given signs of less absorption of Mexican labor in the U.S. over the past year,\" he says. (anthony.harrup@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009707:0/",
            "pub_date": "2025-02-05 03:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309187:0",
            "title": "Deutsche Bank Raises Price Target on Regency Centers to $76 From $75",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Regency Centers  has an average rating of overweight and mean price target of $79.22, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309187:0/",
            "pub_date": "2025-02-05 03:39:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV15M:0",
            "title": "CBOT soybeans jump as concerns over trade disputes ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Chicago Board of Trade soybean futures rose to their highest level since July on Tuesday as concerns eased that trade disputes will disrupt U.S. agricultural exports, analysts said.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CBOT March soybeans (SH25) settled up 16-3/4 cents to $10.75 a bushel.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">CBOT March soymeal (SMH25) ended $10.30 higher to $314 per short ton and March soyoil (BOH25) fell 0.75 cent to 45.76 cents per pound. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Traders had focused recently on the risk for anticipated tariffs against Canada, Mexico and China to hurt demand for U.S. farm goods as the nations are all major importers.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">China, the world's biggest soybean importer, imposed limited tariffs on U.S. goods that did not include the oilseed.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Word that U.S. President Donald Trump planned to speak with Chinese President Xi Jinping also suggested to traders that there was scope for China to receive a temporary reprieve, as Trump granted to Mexico and Canada on Monday.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The soy market was capped by a slide in by-product soyoil (BOv1), as the delay of U.S. tariffs against Canada allowed for continued competition from imports of Canadian canola.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Traders were monitoring rains in Argentina that may ease concerns about corn and soy crop prospects due to stressful dry weather.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Brazil's 2024/25 soybean crop is expected to reach a record 174 million metric tons, agribusiness consultancy Celeres said on Monday, bumping up its forecast from a prior 170.8 million tons.</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV15M:0-cbot-soybeans-jump-as-concerns-over-trade-disputes-ease/",
            "pub_date": "2025-02-05 03:40:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1CF:0",
            "title": "NZX Ltd Says Jan Cash Market Total Value Traded NZ$2,222 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NZX Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAN CASH MARKET TOTAL VALUE TRADED NZ$2,222 M</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAN TOTAL MARKET CAPITALISATION NZ$242,082 M</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAN TOTAL DERIVATIVES LOTS TRADED 42,371</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">JAN CASH MARKET DAILY AVERAGE VALUE TRADED NZ$106 M</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1CF:0-nzx-ltd-says-jan-cash-market-total-value-traded-nz-2-222-mln/",
            "pub_date": "2025-02-05 03:40:48",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009680_20250204009680:0",
            "title": "Revium Rx (RVRC) Completes Acquisition Of LipoVation Ltd. >RVRC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009680_20250204009680:0/",
            "pub_date": "2025-02-05 03:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX6z5vxw:0",
            "title": "Revium Rx (RVRC) Completes Acquisition of LipoVation Ltd.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Israel, Feb.  04, 2025  (GLOBE NEWSWIRE) — February 4, 2025 – Revium Rx (formerly Revium Recovery Inc., OTC: RVRC) has completed the strategic acquisition of LipoVation Ltd., an Israeli development-stage company specializing in lipid-based nano/micro particle medicines. This acquisition marks a significant shift in Revium Rx’s focus toward nanoparticle-based therapeutics, positioning the company at the forefront of advanced drug delivery technologies for hard-to-treat diseases.</p><p class=\"\">LipoVation’s core technology was conceptualized by Prof. Yehezkel Barenholz, a world-renowned scientist and the inventor of Doxil, the first FDA-approved liposomal chemotherapy drug, widely used in the treatment of ovarian cancer, multiple myeloma, and AIDS-related Kaposi’s sarcoma. With this acquisition, LipoVation becomes a wholly owned subsidiary of Revium Rx, aligning with the company’s renewed commitment to drug delivery innovation.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pipeline &amp; Technology Focus</strong></p><p class=\"\">Revium Rx is developing a portfolio of advanced therapeutics, currently in the development stage, aimed at expanding the potential of existing treatments. Key programs include:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A novel systemic formulation of a highly potent antibiotic, previously limited to topical use, designed to combat antibiotic-resistant bacterial infections.</li><li class=\"listItem-bmN0_SHH\">A cutting-edge adjuvant to enhance immune checkpoint inhibitors, improving the efficacy of cancer immunotherapies.</li><li class=\"listItem-bmN0_SHH\">An innovative approach to immunization, leveraging novel peptides and lipid-based technology for emerging infectious diseases.</li></ul><p class=\"\">These next-generation encapsulated therapeutics are built on three core proprietary technologies:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Clinically validated nanoparticles for targeted drug delivery.</li><li class=\"listItem-bmN0_SHH\">Advanced drug-loading and release systems to optimize bioavailability.</li><li class=\"listItem-bmN0_SHH\">Specialized lipid-based carriers for enhanced stability and controlled release.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Leadership &amp; Strategic Direction</strong></p><p class=\"\">Following the acquisition, David Akunis has been appointed as Chief Executive Officer (CEO) of Revium Rx, bringing extensive managerial experience and financial expertise to drive the company’s new direction. With a strong background in fundraising and leadership, he is dedicated to advancing Revium Rx’s mission of developing innovative nanoparticle-based therapeutics and expanding the company’s impact in the pharmaceutical industry.</p><p class=\"\">Inna Martin, who has served as CEO since December 2020, has transitioned to Chief Operating Officer (COO) and President, focusing on product development and clinical trial preparation. This strategic shift ensures that Revium Rx progresses rapidly toward clinical-stage development while expanding strategic partnerships and accelerating growth.</p><p class=\"\">“As the demand for safer and more effective treatments continues to grow, our mission is to expand and enhance the therapeutic potential of existing treatments by utilizing proven drug delivery technologies to improve efficacy, safety, and clinical outcomes,” said David Akunis, CEO of Revium Rx. “Revium Rx's encapsulated therapeutics platform represents a transformative step forward in the fight against resistant infections, cancer, and emerging infectious diseases.”</p><p class=\"\">With this new strategic direction, Revium Rx continues to expand its research and development efforts, forging key partnerships and advancing its pipeline of highly potent therapeutics<strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\">For more information, visit <strong class=\"root-Tkn6WL2y\">www.reviumrx.com</strong> or contact:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Forward Looking Statements</em></strong></p><p class=\"\">This press release contains forward-looking statements as that term is defined in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Statements in this press release that are not purely historical are forward-looking statements. Such forward-looking statements include, among other things, references to novel technologies and methods; our business and product development plans; or market information. Actual results could differ from those projected in any forward-looking statements due to numerous factors. Such factors include, among others, our ability to raise the additional funding we will need to continue to pursue our business plan and product development plans; the inherent uncertainties associated with developing new products and operating as a development stage company; our ability to develop, complete clinical trials for, obtain approvals for and commercialize any of our product candidates; competition in the industry in which we operate and market conditions. These forward-looking statements are made as of the date of this press release, and we assume no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those projected in the forward-looking statements, except as required by law.  The Company does not undertake any obligation to publicly update any forward looking statement. Neither Revium Rx nor LipoVation are subject to the reporting requirements of the Securities and Exchange Commission under the Securities and Exchange Act of 1934 as amended.</p><p class=\"\">Company Contact:</p><p class=\"\">Inna Martin</p><p class=\"\">1-800-5191687</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX6z5vxw:0-revium-rx-rvrc-completes-acquisition-of-lipovation-ltd/",
            "pub_date": "2025-02-05 03:31:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009682:0",
            "title": "UBS Shares Slump on Stock Buyback Uncertainty — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Andrew Welsch</p><p class=\"\">Shares of UBS dropped after the Swiss bank cautioned investors that its $3 billion stock buyback plan could be curtailed depending on how Swiss regulators reform capital requirements.</p><p class=\"\">The warning overshadowed other good news in UBS' fourth-quarter earnings report and the bank's plans to improve profitability in its Americas wealth management business, which oversees approximately $2.1 trillion in assets.</p><p class=\"\">On Tuesday, UBS reported fourth-quarter net profit of $770 million, blowing past analyst estimates of $457 million thanks to a surge in investment banking revenue. Diluted earnings per share came in at 23 cents, seven cents below Wall Street estimates, according to FactSet. UBS shares were down 7.1% in New York trading Tuesday afternoon. The S&amp;P 500 was up 0.73%.</p><p class=\"\">UBS said it plans to repurchase $1 billion of shares in the first half of the year and an additional $2 billion in the second half. But the Zurich-based company said those plans are subject to certain conditions and assumes no material changes to the current capital regime requirements in Switzerland. CEO Sergio Ermotti, speaking during a call with analysts, cautioned regulators against \"disproportionate\" changes.</p><p class=\"\">\"Offsetting the consequences of higher requirements would make us uncompetitive domestically and abroad, hamper our ability to help clients grow and, importantly, make banking services more expensive for Swiss families and enterprises in the long run,\" he said. \"It will also damage the nation's standing as an attractive global financial center and ultimately hurt our position as the third largest private employer in Switzerland. Of course, this would have an impact on our returns on capital. But even more importantly, it would impede our ability to compete for capital in the global marketplace, particularly in a moment of financial stress.\"</p><p class=\"\">Given the slump in the stock price, investors clearly took note. \"We expect investors will remain cautious about the shares until there is clarity regarding UBS's minimum capital requirements,\" Morningstar analyst Johann Scholtz wrote Tuesday. \"UBS expects the Swiss government to present its proposals in first-half 2025.\"</p><p class=\"\">Wealth. While a jump in investment banking revenue lifted UBS this quarter, the company placed emphasis on improving profitability and asset-gathering in its wealth management business, which along with asset management generates a majority of the company's revenue.</p><p class=\"\">UBS said it aims to increase returns in wealth management and haul in $100 billion in net new assets in 2025. UBS expects that annual figure to increase to approximately $200 billion by 2028 after overcoming some short-term headwinds, including potential financial advisor attrition related to recent changes it made to advisor pay for 2025. UBS trimmed payouts for some advisors with smaller amounts of assets under management as a growth incentive. (Advisor compensation is one of the largest expenses for wealth management companies.) UBS reported $18 billion in net new assets in Global Wealth Management for the fourth quarter and $97 billion in for the full year.</p><p class=\"\">By comparison, rival Morgan Stanley  reported net new assets of $252 billion for all of 2024. Charles Schwab  reported $367 billion for the year.</p><p class=\"\">To achieve its growth goals, UBS said it aims to improve profitability across its Americas wealth business and hit a profit margin of 15% in 2027, up from its current level of approximately 10%. The company says it will work to bring expenses down, efforts that include streamlining organizational structure and adjusting advisor pay.</p><p class=\"\">CFO Todd Tucker told analysts, responding to analysts, said the advisor pay changes were intended to better align compensation with the company's strategy and practices at competitors.</p><p class=\"\">\"It's important to keep in mind that the changes we're making are really not intended to reduce compensation but to increase it as long as it's being done in ways that are very aligned with our strategy, and I think that's the most important point,\" Tucker said.</p><p class=\"\">UBS also wants to win more business with ultrahigh-net-worth and high-net-worth clients and drum up new business with mass-affluent customers. In particular, the company is eyeing how to expand its banking capabilities in the U.S. Lending to wealth management clients can be a lucrative way to win wallet share with existing customers, for instance.</p><p class=\"\">Tucker said UBS is investing in its digital-focused Wealth Advice Center, which serves mass-affluent clients. UBS hopes to \"to make it a more meaningful contributor to organic growth and to lower our cost to serve, \" he said. The company will double its staffing in the Wealth Advice Center to better serve clients.</p><p class=\"\">Tucker described this and other efforts to win more affluent clients was not a change in strategy at UBS, which is \"overweight\" ultrawealthy clients.</p><p class=\"\">\"What we're trying to do is rebalance,\" he said. \"So obviously, stay very penetrated in ultra[wealthy], but increase our penetration in high-net-worth and affluent to create a better balance more in line with the market.\"</p><p class=\"\">He also said UBS is moving ahead with plans to obtain a national bank charter, which would enable it to offer more banking products and services to its clients, but he cautioned that this is a multiyear process.</p><p class=\"\">Write to Andrew Welsch at andrew.welsch@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009682:0/",
            "pub_date": "2025-02-05 03:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV17I:0",
            "title": "Tower Ltd Says It Expects FY Underlying NPAT Between NZ$60-NZ$70 Mln",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tower Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">SEES FULL YEAR UNDERLYING NPAT BETWEEN NZ$60M AND NZ$70M</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY GUIDANCE FOR GROSS WRITTEN PREMIUMS REVISED TO BETWEEN 7% AND 12%</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV17I:0-tower-ltd-says-it-expects-fy-underlying-npat-between-nz-60-nz-70-mln/",
            "pub_date": "2025-02-05 03:32:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309180:0",
            "title": "Market Chatter: Morgan Stanley Raises Debt Sale Tied to X Amid Strong Investor Demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A group of banks led by Morgan Stanley  is prepared to greatly increase a sale of loans tied to the social media platform X after receiving stronger-than-expected demand from investors, Bloomberg reported Tuesday, citing people familiar with the matter. </p><p class=\"\">The banks initially planed to sell around $3 billion worth of loans, but are now aiming to sell as much as $5.5 billion of the debt sitting on their books, according to the report. </p><p class=\"\">Morgan Stanley did not immediately reply to a request for comment from MT Newswires. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309180:0/",
            "pub_date": "2025-02-05 03:32:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1WO:0",
            "title": "Citi raises PT, estimates for Australia's Ingenia Communities on earnings outlook hike",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Citi raises price target for Ingenia Communities Group  to A$6.30 from A$6.15, reiterates \"buy\" rating</p><p class=\"\">** Brokerage raises EPS estimate for co by ~12% for FY25, and ~4% for FY26-FY27</p><p class=\"\">** \"We raise our EPS estimates to reflect higher earnings following the earnings guidance upgrade announced in mid-Jan 2025\" - Citi</p><p class=\"\">** The property developer said in mid-Jan it sees FY25 EBIT in the range of A$162 mln to A$165 mln ($101.35 mln to $103.22 mln), up from earlier forecast of A$148 mln to A$155 mln</p><p class=\"\">** The earnings increase primarily reflects lower overheads as a result of cost savings measures, and driven by lower-than-expected tax rate for FY25 and for future, says Citi </p><p class=\"\">** Six of seven analysts rate the stock \"buy\" or higher, and one \"hold\"; their median PT is A$5.66 – LSEG data</p><p class=\"\">** Stock up 21.8%, YTD</p><p class=\"\">($1 = 1.5985 Australian dollars)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1WO:0-citi-raises-pt-estimates-for-australia-s-ingenia-communities-on-earnings-outlook-hike/",
            "pub_date": "2025-02-05 03:32:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309182:0",
            "title": "March WTI Crude Oil Contract Closes Down US$0.46; Settles at US$72.70 per Barrel",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309182:0/",
            "pub_date": "2025-02-05 03:33:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV15A:0",
            "title": "CBOT corn ticks up as trade war fears ease",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Chicago Board of Trade corn futures closed higher on Tuesday on relief over the suspension of planned U.S. tariffs against Mexico, the biggest importer of U.S. corn, as well as technical buying and a weaker dollar, traders said.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">CBOT March corn (CH25) settled up 5-3/4 cents to $4.94-1/2 a bushel.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Traders had focused recently on the risk for anticipated tariffs against Canada, Mexico and China to hurt demand for U.S. farm goods as the nations are all major importers.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Word that U.S. President Donald Trump planned to speak with Chinese President Xi Jinping suggested to traders that there was scope for China to receive a temporary reprieve, as Trump granted to Mexico and Canada on Monday.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Market sentiment that a trade dispute between China and the U.S. may end quickly has helped boost Chicago grain futures. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The U.S. Department of Agriculture confirmed private sales of 132,000 metric tons of U.S. corn to South Korea for delivery in the 2024-25 marketing year that began Sept. 1, 2024. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Beneficial rains were falling in crop areas of Argentina, easing concerns about corn and soy crop prospects due to stressful dry weather.</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV15A:0-cbot-corn-ticks-up-as-trade-war-fears-ease/",
            "pub_date": "2025-02-05 03:33:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204007976:0",
            "title": "RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kristina Peterson and Liz Essley Whyte</p><p class=\"\">WASHINGTON — The nomination of Robert F. Kennedy Jr. to lead the Health and Human Services Department advanced Tuesday after a key swing Republican voted for the nominee in the Senate Finance Committee, likely clearing his path to confirmation.</p><p class=\"\">Sen. Bill Cassidy (R., La.), a medical doctor, voted with all of the committee's Republicans to support Kennedy's confirmation.</p><p class=\"\">His vote followed an unusually intense pressure campaign from Kennedy, his supporters and the Trump administration over the weekend and up to the committee's vote.</p><p class=\"\">To secure Kennedy's support, the nominee and administration agreed to a number of concessions, Cassidy said, including promises to maintain current federal vaccine recommendations and keep intact Centers for Disease Control and Prevention website pages that say there isn't a link between vaccines and autism.</p><p class=\"\">Kennedy and the Trump administration committed to establish \"an unprecedentedly close, collaborative working relationship,\" Cassidy said, and set up safeguards to ensure the public's continued access to vaccines.</p><p class=\"\">\"I will use my authority as chairman of the Senate committee with oversight of HHS to rebuff any attempt to remove the public access to lifesaving vaccines without iron-clad causational scientific evidence,\" Cassidy said on the Senate floor after Tuesday's vote.</p><p class=\"\">The committee vote signaled that Kennedy's path to becoming the top U.S. health official was becoming smoother. The final tally was 14 to 13.</p><p class=\"\">In the full Senate vote, Kennedy can afford to lose as many as three Republican votes if all Democrats oppose him. In the event of a tie, Vice President JD Vance can cast the deciding vote.</p><p class=\"\">Potential GOP defectors include Sens. Mitch McConnell of Kentucky, a polio survivor; Lisa Murkowski of Alaska; and Susan Collins of Maine. No Republicans have said they plan to oppose Kennedy.</p><p class=\"\">The full Senate vote to confirm Kennedy hasn't been scheduled but could come as soon as next week.</p><p class=\"\">If confirmed, Kennedy would lead a powerful department with a $1.7 trillion budget regulating things as diverse as prescription medicines and food dyes and overseeing Medicare health insurance for the elderly and health services for Native Americans.</p><p class=\"\">Shares of vaccine makers Pfizer and Moderna fell after the Kennedy vote.</p><p class=\"\">Pfizer Chief Executive Albert Bourla told analysts during an earnings call Tuesday he expects Kennedy to have a \"more tempered view\" of vaccines as HHS secretary based on what he has seen from comments from Kennedy and the Trump administration.</p><p class=\"\">Bourla also said he doesn't expect the government to change vaccine manufacturers' liability protections because doing so requires congressional approval. The Trump administration doesn't want to see another health crisis. \"I feel cautiously optimistic that they will be very, very prudent,\" Bourla said.</p><p class=\"\">A scion of the famous Democratic family, Kennedy ran for president last year and then suspended his campaign last summer and endorsed Donald Trump, saying they had a joint mission to \"Make America Healthy Again.\"</p><p class=\"\">The phrase became a rallying cry picked up by many Republicans. Yet many Democrats and health authorities expressed concern over some of its tenets, because Kennedy has questioned the safety of vaccines and suggested unproven links between the shots and a range of chronic diseases, including autism.</p><p class=\"\">More than 20 large-scale studies involving hundreds of thousands of children in several countries have discredited any association between the measles, mumps and rubella vaccines and autism. Additional large studies strongly suggest that no vaccine causes autism.</p><p class=\"\">Democrats on the committee said Kennedy could undermine public health if he were confirmed. He had also struggled to answer questions about Medicare and Medicaid over two days of hearings last week.</p><p class=\"\">Sen. Ron Wyden of Oregon, the committee's top Democrat, said Kennedy was \"singularly unfit\" for the post of Health secretary and would pose \"a grave threat to the health of the American people.\"</p><p class=\"\">But Republicans hold a majority on the Finance committee, and most of the GOP committee members had coalesced around Kennedy, even though the nominee had in the past voiced support for abortion rights.</p><p class=\"\">Sen. Thom Tillis (R., N.C.) said the American Farm Bureau Federation, the National Rifle Association and groups that oppose abortion rights didn't actively oppose Kennedy.</p><p class=\"\">The partisan divide left Cassidy with the swing vote. His position was fraught. He had voted to convict Trump in his second impeachment trial. Now, Cassidy faces a primary challenger in his coming election in 2026.</p><p class=\"\">Yet Cassidy had said last week that he had been \"struggling\" over Kennedy's past comments about vaccines and the role they have played in making some parents hesitant to vaccinate their children.</p><p class=\"\">The Louisiana Republican had urged Kennedy during hearings on the nomination to make clear that he didn't believe vaccines caused autism, but Kennedy had sidestepped such an endorsement, saying he would review the data.</p><p class=\"\">Cassidy became the target of an intense persuasion campaign from Kennedy, his supporters and the Trump administration.</p><p class=\"\">\"MAHA moms packed the halls of the Senate and made thousands of calls,\" said Kennedy adviser Calley Means. \"Their voice was heard.\"</p><p class=\"\">As the committee vote neared, President Trump urged lawmakers to support Kennedy in a social-media post. \"20 years ago, Autism in children was 1 in 10,000. NOW IT'S 1 in 34. WOW! Something's really wrong. We need BOBBY!!!\" Trump wrote.</p><p class=\"\">Cassidy said he held a series of phone calls with Kennedy over the weekend and Tuesday morning before the committee's vote. During the calls, the senator said, Kennedy promised an unusually close working relationship.</p><p class=\"\">Cassidy said Kennedy, in addition to keeping federal vaccine recommendations and CDC web pages on vaccines and autism, committed to not set up alternate safety monitoring or approval systems for vaccines.</p><p class=\"\">Kennedy pledged that HHS would provide 30-day notice before any changes to vaccine-safety monitoring systems and would generally speak to Cassidy several times a month, the senator said.</p><p class=\"\">The nominee also offered Cassidy input on hiring decisions at HHS and promised Cassidy that the Senate health committee could choose a representative \"on any board or commission formed to review vaccine safety,\" Cassidy said.</p><p class=\"\">\"My support is built on assurances that this will not have to be a concern,\" Cassidy said of vaccines. \"He will be the secretary, but I believe he will also be a partner.\"</p><p class=\"\">Cassidy arrived late to the committee vote, walking into the room with Senate Majority Leader John Thune (R., S.D.).</p><p class=\"\">\"I've had very intense conversations with Bobby and the White House over the weekend and even this morning,\" Cassidy said in a social-media post shortly before the vote. \"I want to thank VP JD specifically for his honest counsel.\"</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Jared S. Hopkins contributed to this article.</li></ul><p class=\"\">Write to Kristina Peterson at kristina.peterson@wsj.com and Liz Essley Whyte at liz.whyte@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204007976:0/",
            "pub_date": "2025-02-05 03:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002699:0",
            "title": "China Retaliates Against U.S. Tariffs. Trump-Xi Phone Call Expected. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Brian Swint and Callum Keown</p><p class=\"\">President Donald Trump's decision to impose additional 10% tariffs on goods from China provoked an immediate response from the world's second-largest economy.</p><p class=\"\">The new levies took effect overnight, prompting China to announce import taxes of 15% on U.S. crude oil, machinery, and some cars, as well as a 10% increase of tariffs on coal and liquified natural gas. In a move that wasn't explicitly tied to Trump's tariffs, China also said it was starting an antitrust probe into Alphabet's Google, the internet search engine.</p><p class=\"\">Beijing added two U.S. companies to its unreliable entity list — Calvin Klein owner PVH, and biotechnology company Illumina.</p><p class=\"\">\"The two entities have violated normal market-trading principles, terminated regular trade with Chinese companies, and adopted discriminatory measures against Chinese companies,\" state-owned news agency Xinhua reported, citing a statement from the Commerce Ministry.</p><p class=\"\">The ministry said the list only targets the very few foreign entities that undermine China's national security. It means measures could be taken against the companies.</p><p class=\"\">PVH told Barron's the company is \"surprised and deeply disappointed\" by the decision.</p><p class=\"\">China also announced export controls on scarce elements that are critical for making electronics, including tungsten, tellurium, bismuth, molybdenum, and indium. China is a big miner of these materials.</p><p class=\"\">The moves follow a last minute delay to Trump's plans to raise taxes on imports from Mexico and Canada. That sparked a relief rally in stocks, which had fallen sharply on concern that the new tariffs would fan inflation and hamper economic growth. The question now is whether Trump and China can work out a similar deal to prevent the trade war from escalating further.</p><p class=\"\">Trump is expected to speak with China's President Xi Jinping by phone. White House press secretary Karoline Leavitt told reporters earlier that the call will happen \"soon,\" and top trade adviser Peter Navarro told Politico in an interview that it would be today. An official told The Wall Street Journal that the call would not be today, however.</p><p class=\"\">Julian Evans-Pritchard, the head of China economics at Capital Economics, said the tariffs could be postponed or cancelled before they come into effect on Feb. 10. \"For the most part, these moves are warnings that China intends to harm U.S. interests if need be but still give China the option to back down.\"</p><p class=\"\">Evans-Pritchard also noted that the Chinese retaliation only targets about $20 billion worth of imports, compared to the $450 billion in Chinese wares that Trump has targeted. What's more, China didn't raise tariffs on strategic goods such as semiconductors and pharmaceuticals.</p><p class=\"\">Write to Brian Swint at brian.swint@barrons.com and Callum Keown at callum.keown@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002699:0/",
            "pub_date": "2025-02-05 03:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0KM:0",
            "title": "Trump taps veteran NLRB lawyer as acting GC after removing Biden appointee",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    U.S. President Donald Trump has named a longtime National Labor Relations Board lawyer and one-time board member as the agency's acting general counsel, temporarily filling a vacancy he created by firing a Biden-era appointee.</p><p class=\"\">Trump late Monday tapped William Cowen, the regional director of the NLRB's Los Angeles office, to lead the agency's prosecutorial arm until a nominee is named and confirmed by the U.S. Senate. </p><p class=\"\">Cowen in a statement said that \"the men and women of this agency represent the finest in public service and I thank the President for the confidence that he has shown in me by this appointment.”</p><p class=\"\">The White House did not respond to a request for comment. </p><p class=\"\">Trump last week fired Jennifer Abruzzo, who served as general counsel during the Biden administration, deputy general counsel Jessica Rutter, and, in an unprecedented move, Democratic NLRB Member Gwynne Wilcox. He also named Marvin Kaplan, the board's lone Republican member, as its acting chair.</p><p class=\"\">He told Abruzzo and Wilcox in a letter that they had not \"been operating in a manner consistent with the objectives of my administration,\" citing a series of union-friendly decisions criticized by business groups.</p><p class=\"\">Wilcox's firing left the five-member board without a quorum to issue even routine decisions, bringing hundreds of cases to a standstill, and will test the scope of a provision in federal labor law allowing the president to remove NLRB members only for \"neglect of duty or malfeasance in office.\" Wilcox has said she is considering her legal options.</p><p class=\"\">More than two dozen companies have filed lawsuits challenging the board members' protections from removal and other aspects of the board's structure and in-house enforcement proceedings.</p><p class=\"\">Elon Musk's SpaceX was among the first companies to challenge the board's structure, and has filed two separate lawsuits seeking to block NLRB administrative cases accusing it of illegal labor practices. Musk is a top adviser to Trump and is leading an aggressive campaign to shrink the federal workforce and slash government spending. </p><p class=\"\">The New Orleans-based 5th U.S. Circuit Court of Appeals is set to hear arguments on Wednesday in the NLRB's appeal of a ruling that blocked the board from pursing a case accusing SpaceX of forcing workers to sign illegal severance agreements. </p><p class=\"\">In a filing on Monday, the board told the 5th Circuit that in light of Trump's removals it will not present arguments on whether removal protections for board members are valid, but that it would proceed with other arguments raised in its appeal. </p><p class=\"\">The NLRB general counsel's office investigates complaints against employers and unions, known as charges, and decides whether to issue formal complaints that are heard by administrative judges and then the five-member board. The general counsel plays an important policymaking role by deciding what issues to bring before the board.</p><p class=\"\">Cowen was appointed to a vacancy on the NLRB in 2002 through a recess appointment by Republican former President George W. Bush, and served for 10 months.</p><p class=\"\">He had worked as a staff attorney for the board from 1979 to 1985, when he went into private practice representing employers and later co-founded a labor consulting and lobbying firm. Law firm Venable acquired the consulting firm in 2003, when Cowen was serving as chief of staff to then-NLRB Chairman Robert Battista, a Bush appointee. Cowen was NLRB solicitor, the agency's chief legal adviser, from 2006 to 2016.</p><p class=\"\">Read more:</p><p class=\"\">Trump paralyzes US labor board by firing Democratic member</p><p class=\"\">Trump makes Musk, the world's richest man, a 'special government employee'</p><p class=\"\">SpaceX wins block on US labor board case over severance agreements</p><p class=\"\">US Supreme Court won't block NLRB case pending challenge to its structure</p><p class=\"\">In Amazon, SpaceX cases, US labor board's power is on the line</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0KM:0-trump-taps-veteran-nlrb-lawyer-as-acting-gc-after-removing-biden-appointee/",
            "pub_date": "2025-02-05 03:34:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009692:0",
            "title": "Raises Grew Likelier Amid Postpandemic Inflation — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New research by economists at the St. Louis Fed suggest that wages become more flexible during times of elevated inflation. Studying data over the pandemic and postpandemic period, Maximiliano Dvorkin and Cassie Marks find that during the stretch of high inflation and low unemployment during 2022, wage increases became more likely and larger in scale. Then, they cooled again as the labor market started to normalize in 2023. In 2022, for example, they find that workers had a 55% probability of a positive wage increase, up from 43% in the years before the pandemic. Wage increases fell in likelihood to 53% in 2023, they find. Economists closely study the interconnection between inflation and wages in part to better understand how likely inflation is to become self perpetuating. (matt.grossman@wsj.com, @mattgrossman)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009692:0/",
            "pub_date": "2025-02-05 03:35:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309164:0",
            "title": "Equities Rise Intraday; Tariffs in Focus as China Retaliates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">US benchmark equity indexes were higher intraday, shrugging off trade concerns after China announced a series of retaliatory tariffs against the US. </p><p class=\"\">The Nasdaq Composite was up 1.2% at 19,623.9 after midday Tuesday, while the S&amp;P 500 rose 0.6% to 6,029.8. The Dow Jones Industrial Average added 0.1% to 44,467.8. Among sectors, energy paced the gainers, while utilities saw the biggest drop. </p><p class=\"\">China will impose additional tariffs of 15% on coal and liquefied natural gas imports from the US and 10% higher duties on items including American crude oil and agricultural machinery, effective Feb. 10, CNBC reported, citing China's finance ministry. </p><p class=\"\">Previously, the Trump administration announced 25% tariffs on goods from both Canada and Mexico, along with a 10% levy on imports from China. However, Trump on Monday paused the announced tariffs on Mexico and Canada for a month. </p><p class=\"\">In company news, Palantir Technologies  shares were up nearly 23%, the top gainer on the S&amp;P 500 and the Nasdaq. The software maker late Monday logged fourth-quarter results that topped analysts' estimates amid rising demand for artificial intelligence capabilities. </p><p class=\"\">Spotify Technology's  US-listed shares were up 11% intraday Tuesday as the audio streaming company issued an upbeat revenue outlook for the first quarter after reporting stronger-than-projected fourth-quarter sales. </p><p class=\"\">PayPal  offered a strong bottom-line outlook as fourth-quarter earnings unexpectedly rose, though its first-quarter revenue guidance implied a sequential deceleration. The payments processor's shares were down 12%, the worst Nasdaq performer and the second-steepest decline on the S&amp;P 500. </p><p class=\"\">PepsiCo's  fourth-quarter earnings came in ahead of Wall Street's estimates, while revenue posted a surprise decline amid weakness in the beverage and snacks company's North American businesses. Its shares fell 4.7%, the second-biggest drop on the Nasdaq. </p><p class=\"\">Google parent Alphabet  is scheduled to report results after Tuesday's closing bell, along with other companies including Advanced Micro Devices , Amgen  and Chipotle Mexican Grill . </p><p class=\"\">The US two-year yield was down 5.3 basis points at 4.21% intraday, while the 10-year rate dropped 2.6 basis points to 4.52%. </p><p class=\"\">West Texas Intermediate crude oil was down 0.2% at $73 a barrel intraday. </p><p class=\"\">Gold was up 0.6% at $2,874.10 per troy ounce, while silver added 1.5% to $33.03 per ounce.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309164:0/",
            "pub_date": "2025-02-05 03:35:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}