{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463295:0",
            "title": "Mutakamela Insurance's FY24 Net Profit Slips; Insurance Revenue Up",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mutakamela Insurance (SASE:8040) said Tuesday that its net profit for full-year 2024 dropped, while insurance revenue rose year over year. </p><p class=\"\">Net profit after zakat attributable to shareholders for the 12 months ended Dec. 31, 2024, was 15.2 million Saudi riyals, compared with 37 million riyals a year ago. EPS moved to 0.26 riyal from 0.62 riyal. </p><p class=\"\">The Saudi Arabia-listed insurer's insurance revenue was 873.9 million riyals, compared with 862.6 million riyals earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463295:0/",
            "pub_date": "2025-02-04 15:41:07",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463292:0",
            "title": "Assura Delivers First Net Zero Carbon Properties in UK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Healthcare property company Assura  completed its first two net zero carbon development projects. </p><p class=\"\">The projects, located in Fareham and Winchester in the UK, were developed for a combined 13.6 million pounds sterling and have been handed over to tenants, according to a Tuesday filing. </p><p class=\"\">The Fareham project comprised the refurbishment of an existing high street building into a children and family healthcare center and the Winchester project was a new-build development for a medical practice.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463292:0/",
            "pub_date": "2025-02-04 15:41:29",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001435:0",
            "title": "Vodafone Launches $496.5 Million Buyback After Revenue Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:01 GMT) </strong>*Vodafone Group 3Q Germany Service Revenue Down 6.4%<br/><strong class=\"root-Tkn6WL2y\">(07:03 GMT) </strong>*Vodafone Group 3Q Rev EUR9.8B<br/><strong class=\"root-Tkn6WL2y\">(07:03 GMT) </strong>*Vodafone Group 3Q Group Service Revenue EUR7.9B<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*Vodafone Group Sees FY25 Adjusted Free Cash Flow at Least EUR2.4B<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*Vodafone Group Sees FY25 Adjusted EBITDAaL of Around EUR11.0B<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*Vodafone Group Backs FY25 View<br/><strong class=\"root-Tkn6WL2y\">(07:42 GMT) </strong>Vodafone Launches $496.5 Million Buyback After Revenue Rises</p><p class=\"\">By Najat Kantouar</p><p class=\"\">Vodafone Group launched a share buyback of up to 480 million euros ($496.5 million) and reported higher revenue for the third quarter of its fiscal year.</p><p class=\"\">The London-listed telecommunications company said revenue rose to 9.81 billion euros from 9.35 million euros for the period ended Dec. 31.</p><p class=\"\">Adjusted earnings before interest, taxes, depreciation and amortization and after lease expenses increased 2.2% on an organic basis to 2.83 billion euros. This was driven by service revenue growth in most markets and lower energy costs in Europe that offset the impact of a TV law change in Germany.</p><p class=\"\">Service revenue--a closely watched metric in the telecom sector--increased to 7.93 billion euros from 7.505 billion euros. Within this, Germany service revenue--which represents 34% of group service revenue--fell 6.4% to 2.89 billion euros due partly to the law change and a lower broadband customer base. Meanwhile, U.K. service revenue climbed 3.3% on organic basis to 1.51 billion euros, boosted by significant investments in customer experience.</p><p class=\"\">Vodafone reiterated its fiscal 2025 guidance, which includes adjusted EbitdaaL of around 11.0 billion euros and adjusted free cash flow to be at least 2.4 billion euros.</p><p class=\"\">Write to Najat Kantouar at najat.kantouar@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001435:0/",
            "pub_date": "2025-02-04 15:42:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001859_20250204001894:0",
            "title": "Diageo CFO Believes the Group Could Mitigate the Impact in the Long Term",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001859_20250204001894:0/",
            "pub_date": "2025-02-04 15:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463293:0",
            "title": "Three of 10 SMEs in Hong Kong Perceive Difficulties in Obtaining Credit Approval, HKMA Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Three out of 10, or 30% of small and medium-sized local enterprises in Hong Kong found it \"more difficult\" to obtain credit approval in the fourth quarter, according to a survey by the Hong Kong Monetary Authority released Monday. </p><p class=\"\">The perceived difficulty in credit approval is not necessarily an actual difficulty faced by SMEs during the process, but could be affected by factors such as news reports, business conditions, and personal opinions, the central bank said. </p><p class=\"\">The number was higher compared with 24% in the year-ago period, according to the HKMA. </p><p class=\"\">Seventy percent found it easier to obtain credit during the period, the central bank said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463293:0/",
            "pub_date": "2025-02-04 15:44:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446494:0",
            "title": "Indian Rupee Struggles as Trade Tensions Rise, RBI Meeting in Focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Indian rupee struggled to hold gains on Tuesday after China launched tariffs on US goods in retaliation to President Trump's levies.</p><p class=\"\">The local currency stood at 87.07, down from 87.18 in the prior session, as broader sentiment turned cautious amid escalating trade tensions.</p><p class=\"\">While the immediate reaction to China’s countermeasures was subdued, concerns over global trade disruptions weighed on emerging market currencies, including the rupee.</p><p class=\"\">Foreign investors remained wary, with continued outflows from Indian equities and bonds, adding to volatility.</p><p class=\"\">Meanwhile, crude oil prices hovered near multi-week highs, intensifying concerns over India’s trade deficit and further pressuring the rupee.</p><p class=\"\">Traders awaited key data releases, including industrial output and inflation figures.</p><p class=\"\">Additionally, all eyes were on the Reserve Bank of India’s upcoming monetary policy meeting, where policymakers are expected to address inflation risks and consider measures to stabilize the rupee.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446494:0-indian-rupee-struggles-as-trade-tensions-rise-rbi-meeting-in-focus/",
            "pub_date": "2025-02-04 15:44:33",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001897:0",
            "title": "U.S. Tariffs on Chinese Goods Likely to Impact Consumer Sectors — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest U.S. tariffs on Chinese goods are likely to impact Chinese consumer sectors in short term, but the situation may improve in the longer term, according to Jefferies analysts in a commentary. \"While we think such tariff on goods sourced from China will impact brands, retailers and consumers in the short term, over time, companies should be able to digest its impact with some faring better,\" the analysts say. However, it remains uncertain whether this is the start of a trade war or if it will lead to a deal, the analysts note. Depending on a company's demand profile and gross profit margin, companies under Jefferies' coverage, such as Miniso and Anta Sports Products, should be better positioned to manage a 10% tariff increase this time around, the analysts say. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001897:0/",
            "pub_date": "2025-02-04 15:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001902:0",
            "title": "Nordic Stocks Tipped to Open Slightly Higher — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nordic markets are seen opening slightly higher, with IG calling the OMXS30 up 0.2% at around 2638. The market reactions after the weekend's tariff news were largely as expected, SEB analysts say in a note. The U.S. dollar strengthened, while trade-dependent currencies such as the euro and smaller currencies such as the Swedish krona initially took a beating. Stock markets in Europe closed about 1% lower after a late recovery. The 10% tariffs on China come into force Tuesday, but are interpreted as milder than previously feared, SEB says. China has this morning responded with its own tariffs on imports of energy raw materials, agricultural equipment and some cars from the U.S. OMXS30 closed at 2632.64, OMXN40 at 2541.08 and OBX at 1411.20. (dominic.chopping@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001902:0/",
            "pub_date": "2025-02-04 15:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "moneycontrol:8f3293b69094b:0",
            "title": "Accumulat Ujjivan Small Finance Bank; target of Rs 41: Geojit Financial Services",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Geojit Financial Services research report on Ujjivan Small Finance Bank</p><p class=\"\">Ujjivan Small Finance Bank Ltd. (USFL), serves over 93 lakh customers through 24,290+ employees. USFL is the 3rd largest SFB with a loan book size of Rs.30,466cr and a deposit base of Rs.34,494cr. Gross Advances grew modestly at 10% YoY, driven by a 45% YoY increase in Affordable Housing and a 57% YoY increase in Financial Institutional Group lending. Deposit growth advanced by 16% YoY, with CASA accounts growing by 15% YoY. The CASA ratio stood at 25%. The bank is diversifying its product suite to reduce reliance on the microfinance segment, which has faced challenges. By increasing the proportion of secured assets, such as affordable housing loans, MSME loans, vehicle loans, and gold loans, the bank aims to lower its overall risk profile. This shift is evident as group loans experienced a 12% YoY decline. Net Interest Income grew by 3.1% YoY in Q3FY25, impacted by falling yields on advances and slower advance growth. Additionally, NIM contracted by 60 bps sequentially to 8.6%. The microfinance segment has faced significant challenges, leading to increased stress. The PAR for the group loan portfolio rose to 6.6% in December 2024 from 4.1% in June 2024. GNPA and NNPA have deteriorated to 2.7% and 0.6%, respectively, from 2.1% and 0.2% in Q3FY24. Due to increased stress in the microfinance segment, provisions have risen by 254% YoY to Rs. 223cr, weighing on the PAT, which has decreased by 64% YoY to Rs. 109cr.</p><p class=\"\">Outlook</p><p class=\"\">The ongoing stress in the microfinance segment is expected to keep credit costs elevated throughout FY25. The bank's strategic measures, including enhanced collections, a focus on secured lending, and a prudent approach in microfinance, are positive steps towards managing and reducing credit costs in the long term. The shift in portfolio mix is expected to impact NIM negatively. With asset quality stress in group loans stabilizing, the ROA is expected to improve from FY26 onwards. Therefore, we reiterate ACCUMULATE rating on the stock with a revised target price of Rs. 41 based on 0.95x FY27E BVPS.</p><p class=\"\">For all recommendations report, click here</p><p class=\"\">Disclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.</p><p class=\"\">Ujjivan Small Finance Bank - 04022025 - geo</p></span></div>",
            "link": "https://www.tradingview.com/news/moneycontrol:8f3293b69094b:0-accumulat-ujjivan-small-finance-bank-target-of-rs-41-geojit-financial-services/",
            "pub_date": "2025-02-04 15:34:07",
            "source": "Moneycontrol",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001859_20250204001871:0",
            "title": "Diageo CEO: There Is an Opportunity to Do More, Even With the Impact of US Tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001859_20250204001871:0/",
            "pub_date": "2025-02-04 15:37:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463288:0",
            "title": "TSH Resources Repurchases More Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TSH Resources  bought back 370,000 shares for 438,856 ringgit on Monday, according to a same-day disclosure on the Singapore bourse. </p><p class=\"\">The shares were repurchased at between 1.1 7ringgit and 1.18 ringgit apiece, the dual-listed oil palm cultivation and wood products company said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463288:0/",
            "pub_date": "2025-02-04 15:37:16",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463289:0",
            "title": "Team Internet Group Grants Verdane Extension to Finalize Potential Buyout Bid",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Team Internet Group  said Tuesday the UK Panel on Takeovers and Mergers approved its request to extend until March 4 the deadline for Verdane Fund Manager to finalize its intentions for the company. </p><p class=\"\">The internet company said discussions with the potential suitor \"have made material progress\" and are continuing. Prior to the extension, Verdane had until Tuesday to make a decision.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463289:0/",
            "pub_date": "2025-02-04 15:37:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001457:0",
            "title": "Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(07:02 GMT) </strong>*Diageo PLC 1H Sales $10.90B<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*Diageo PLC 1H Oper Pft $3.15B<br/><strong class=\"root-Tkn6WL2y\">(07:04 GMT) </strong>*Diageo PLC 1H Net Pft $1.935B<br/><strong class=\"root-Tkn6WL2y\">(07:05 GMT) </strong>*Diageo PLC 1H EPS 87.1c<br/><strong class=\"root-Tkn6WL2y\">(07:07 GMT) </strong>*Diageo PLC 1H Sales Declined 0.6% in Reported Terms<br/><strong class=\"root-Tkn6WL2y\">(07:08 GMT) </strong>*Diageo PLC 1H Sales Rose 1% Organically<br/><strong class=\"root-Tkn6WL2y\">(07:39 GMT) </strong>Smirnoff Vodka Maker Diageo Scraps Midterm Guidance on Uncertainty in Key Markets</p><p class=\"\">By Andrea Figueras</p><p class=\"\">U.K. spirits maker Diageo scrapped its midterm outlook, citing macroeconomic and geopolitical uncertainty in key markets affecting the pace of recovery.</p><p class=\"\">The owner of Johnnie Walker, Guinness and Smirnoff said Tuesday that it has withdrawn its target of organic net sales growth between 5% and 7%.</p><p class=\"\">\"We remain confident in both the favorable long-term industry fundamentals and our ability to outperform the market,\" it said.</p><p class=\"\">For the second half of fiscal 2025, the company had expected to build on the momentum during the first six months and deliver a sequential improvement in organic net sales growth. However, the implementation of tariffs in the U.S. could affect this goal.</p><p class=\"\">As for organic operating profit growth, the group said it will assess the effect of levies and update as appropriate.</p><p class=\"\">For the first half of its fiscal year, the group booked net sales of $10.90 billion in the six months to Dec. 31, beating analysts' estimates of $10.72 billion, according to consensus estimates provided by the company. Sales grew 1% organically on year.</p><p class=\"\">Operating profit stood at $3.155 billion, 5% lower compared with the prior-year period and below analysts' projections of $3.31 billion.</p><p class=\"\">Write to Andrea Figueras at andrea.figueras@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001457:0/",
            "pub_date": "2025-02-04 15:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463285:0",
            "title": "Mitsui Sumitomo Insurance Buys Back Nearly 8 Million Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mitsui Sumitomo Insurance  bought back 7,979,500 shares in the open market for an aggregate amount of 25.8 billion yen from Jan. 1 till Jan. 31, according to a filing with the Singapore Exchange on Monday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463285:0/",
            "pub_date": "2025-02-04 15:39:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001876:0",
            "title": "China's Trade Retaliation Shows Not All Tariffs Are Bargaining Chip — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's trade retaliation shows that not all tariffs are purely a negotiation tool, says Vishnu Varathan, head of macro research, Asia ex-Japan, at Mizuho Securities. \"The tariff tool may be the same. But the game is different, and the stakes higher,\" Varathan says, referring to the different tariff outcomes for China versus Mexico and Canada. China's tit-for-tat trade escalation \"ups the ante\" and Trump may further raise tariffs in response to retaliation, Varathan adds. \"Not all tariffs are created equal,\" and given the intertwined trade and investment linkages between China and the rest of emerging market Asia, collateral damage will be unavoidable in the region, Varathan adds. (kimberley.kao@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001876:0/",
            "pub_date": "2025-02-04 15:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463298:0",
            "title": "Aica Kogyo Company's Net Income Rises Nearly 13% in 9M 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aica Kogyo Company's  net income was up nearly 13% year over year to 14.3 billion for nine months ended Dec. 31, 2024 from 12.7 billion a year earlier, a filing with the Tokyo Exchange said on Monday. </p><p class=\"\">Earnings per share rose to 225.25 yen from 198.97 in the comparable period. </p><p class=\"\">Net sales were up 5.7% to 184.8 billion yen from 174.9 billion yen in the year-ago period. </p><p class=\"\">The chemicals company forecasted net income of 16.2 billion yen for fiscal 2024, earnings per share of 258.09 and net sales of 250 billion yen.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463298:0/",
            "pub_date": "2025-02-04 15:40:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463261:0",
            "title": "Nomura Adjusts Sun Pharmaceutical Industries' Price Target to INR1,970 From INR1,850, Keeps at Neutral",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Sun Pharmaceutical Industries  has an average rating of outperform and price targets ranging from 1,625 Indian rupees to 2,450 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463261:0/",
            "pub_date": "2025-02-04 15:31:27",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463267:0",
            "title": "Nomura Adjusts Bank Negara Indonesia's Price Target to 6,250 Rupiah From 6,600 Rupiah, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Bank Negara Indonesia (IDX:BBNI) has an average rating of buy and price targets ranging from 4,300 rupiah to 7,018 rupiah, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463267:0/",
            "pub_date": "2025-02-04 15:31:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463283:0",
            "title": "Thomas Cook (India)'s Consolidated Profit Declines in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Thomas Cook (India)  recorded a decline in attributable consolidated profit to 495.8 million Indian rupees in the fiscal third quarter from 823.9 million rupees a year ago, according to an Indian bourse filing on Monday by the travel services company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, fell to 1.06 rupees from 1.77 rupees a year earlier. </p><p class=\"\">Net income from operations increased year on year to 20.6 billion rupees from 18.9 billion rupees, according to the filing.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463283:0/",
            "pub_date": "2025-02-04 15:31:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001799:0",
            "title": "UK Market Talk Roundup: Brokers Comments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Broker comments in the UK today. Compiled by Dow Jones Newswires Markets Desk, markets.eu@dowjones.com</p><p class=\"\">The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p><p class=\"\">Contact us in London. +44-20-7842-9288 <br/>Markettalk.eu@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001799:0/",
            "pub_date": "2025-02-04 15:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001798:0",
            "title": "FTSE 100 Seen Opening Lower as China Retaliates Against Trump Tariffs — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 is expected to open 14 points lower, or 0.2%, according to IG. The index closed down 90 points, or 1%, to 8583 points on Monday. U.S. President Trump on Monday agreed to postpone his threatened 25% tariffs on Canada and Mexico following talks with the leaders of the two countries. However, a new 10% tariff on China took effect Tuesday. China has retaliated with new tariffs on select U.S. imports and said it was opening an antitrust probe into Google. \"Coming days are likely to be dominated with headlines around negotiations with China,\" Jefferies economist Mohit Kumar says in a note. \"Our view remains that eventually tariffs will end up not as bad as feared.\" (renae.dyer@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001798:0/",
            "pub_date": "2025-02-04 15:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463279:0",
            "title": "Jefferies Adjusts Gland Pharma's Price Target to INR1,350 From INR1,630, Keeps at Underperform",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gland Pharma  has an average rating of hold and price targets ranging from 1,162 Indian rupees to 3,120 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463279:0/",
            "pub_date": "2025-02-04 15:32:05",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463280:0",
            "title": "Jefferies Adjusts Aditya Birla Capital's Price Target to INR248 From INR265, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Aditya Birla Capital  has an average rating of buy and price targets ranging from 235 Indian rupees to 270 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463280:0/",
            "pub_date": "2025-02-04 15:32:22",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446492:0",
            "title": "Romania Producer Prices Drop for 4th Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The producer prices in Romania fell by 0.71% year-on-year in December 2024, following a 0.37% drop in the previous month.</p><p class=\"\">This marked the fourth consecutive month of declining producer prices, as prices decreased for both mining and quarrying (-6.82%) and electricity, gas, steam, and air-conditioning supply (-7.48%).</p><p class=\"\">Meanwhile, prices accelerated for manufacturing (2.25%) and water supply, sewerage, waste management, and remediation activities (12.03%).On a monthly basis, producer prices declined by 0.86%, slipping from a 3.26% gain in the preceding period.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446492:0-romania-producer-prices-drop-for-4th-month/",
            "pub_date": "2025-02-04 15:32:28",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463284:0",
            "title": "Market Chatter: Hanwha Ocean, HD Hyundai Heavy Compete for Navy Warship Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">South Korea's Hanwha Ocean  and HD Hyundai Heavy Industries  were shortlisted to lead the country's 7.8 trillion won Korea Destroyer Next Generation project, Yonhap News reported Monday, citing the Ministry of Trade, Industry and Energy. </p><p class=\"\">The initiative aims to develop six 6,000-ton Aegis destroyers with domestic technologies, comparable to the Navy's 7,100-ton King Sejong the Great. The defense acquisition program administration will select the final contractor, the report said. </p><p class=\"\">Shares of Hanwha Ocean jumped nearly 7% at market close on Tuesday while those of HD Hyundai Heavy Industries rose nearly 3%. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463284:0/",
            "pub_date": "2025-02-04 15:32:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001859_20250204001860:0",
            "title": "Diageo CEO: Company Will Continue to Engage With US Administration",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001859_20250204001860:0/",
            "pub_date": "2025-02-04 15:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446493:0",
            "title": "Copper Gains Amid US-China Trade Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Copper futures climbed above $4.32 per pound on Tuesday, reaching a one-week high as investors assessed the impact of the escalating trade war between the U.S. and China.</p><p class=\"\">The 10% U.S. tariffs on Chinese goods came into effect earlier today, prompting Beijing to retaliate with its own tariffs on select U.S. exports, including oil, gas, coal, cars, and farm equipment, effective February 10.</p><p class=\"\">Meanwhile, President Trump agreed late on Monday to \"immediately pause\" planned tariffs on Mexico and Canada for a month, following successful negotiations with their respective leaders.</p><p class=\"\">In China, the world’s largest copper consumer, a private survey revealed that manufacturing activity expanded less than expected in January, with foreign orders shrinking due to ongoing global trade uncertainties.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446493:0-copper-gains-amid-us-china-trade-concerns/",
            "pub_date": "2025-02-04 15:33:55",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463286:0",
            "title": "Indivior Wraps Up $100 Million Share Buyback Program",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Indivior  completed its $100 million share buyback program approved by the board in July 2024, according to a Tuesday release. </p><p class=\"\">Morgan Stanley, on behalf of the British pharmaceutical company, repurchased a total of 9,415,726 shares at an average price of 8.2486 pounds sterling apiece.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463286:0/",
            "pub_date": "2025-02-04 15:33:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463255:0",
            "title": "Nomura Adjusts LIC Housing Finance's Price Target to INR735 From INR700, Keeps at Buy",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LIC Housing Finance  has an average rating of outperform and price targets ranging from 470 Indian rupees to 940 rupees, according to analysts polled by Capital IQ.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463255:0/",
            "pub_date": "2025-02-04 15:25:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001754:0",
            "title": "Asia Markets Give Up Earlier Gains — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">Markets across Asia began the day with a relief rally after the U.S. struck last-minute deals with Mexico and Canada to delay tariffs, but the mood took a turn when China hit back with new levies on the U.S.</p><p class=\"\">The news poured cold water on hopes that there would be talks between Washington and Beijing that would also postpone the 10% tariffs on all Chinese goods entering the U.S.</p><p class=\"\">The offshore yuan weakened against the dollar, while benchmark indexes in Hong Kong, Japan and South Korea pared gains.</p><p class=\"\">Oil futures extended losses, with front-month WTI crude oil futures down 1.8% to $71.83 per barrel, and Brent down 1.2% to $75.07 per barrel.</p><p class=\"\">Bitcoin tumbled, falling below $100,000. Spot gold was broadly steady, sitting 0.1% lower at $2,811.23 per ounce.</p><p class=\"\">The \"overarching geo-economic dimensions to U.S.-China trade means that resolution will be far more fraught than is the case with Mexico and Canada,\" Vishnu Varathan of Mizuho Securities said in a note.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001754:0/",
            "pub_date": "2025-02-04 15:26:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}