{
    "data": [
        {
            "id": "DJN_DN20250204009114:0",
            "title": "With Energy Tariffs on U.S., China Fires a Blank — Commodities Roundup",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MARKET MOVEMENTS:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Brent crude oil is down 0.1% to $76.02 a barrel</li><li class=\"listItem-bmN0_SHH\">European benchmark gas is down 0.6% to 52.35 euros a megawatt-hour</li><li class=\"listItem-bmN0_SHH\">Gold futures are up 0.6% at $2,873.00 a troy ounce</li><li class=\"listItem-bmN0_SHH\">LME three-month copper futures are up 0.4% at $9,148.00 a metric ton</li></ul><p class=\"\">TOP STORY:</p><p class=\"\">With Energy Tariffs on U.S., China Fires a Blank</p><p class=\"\">China's tariffs on oil, gas and coal appear calibrated to avoid serious disturbance to global energy markets.</p><p class=\"\">Beijing said it would impose 15% tariffs on supercooled natural gas and coal from the U.S. as part of its response to President Trump's new levies on Chinese imports. Oil imports will face a 10% tariff from Feb. 10.</p><p class=\"\">International natural-gas benchmarks were little changed in morning trading Tuesday. Meanwhile, U.S. crude prices unwound Monday's gains. Those had been spurred by the prospect of charges on Canadian oil supplies to the U.S., before Prime Minister Justin Trudeau and President Trump agreed a tariff pause.</p><p class=\"\">OTHER STORIES:</p><p class=\"\">Tariffs Give U.S. Steelmakers a Green Light to Lift Prices</p><p class=\"\">Steel prices started rising for some U.S. companies even before President Trump announced tariffs on Canada and Mexico. Executives said they are bracing for more to come.</p><p class=\"\">Trump on Saturday announced 25% tariffs on all imports from Mexico and Canada starting Tuesday. On Monday, he said he would hold off for a month as talks got under way between the U.S. and its neighbors.</p><p class=\"\">--</p><p class=\"\">OMV's Net Profit Rises Despite Weak Refining Margins</p><p class=\"\">OMV's fourth-quarter net profit jumped despite weak refining margins dragging on its financial results.</p><p class=\"\">The Austrian oil-and-gas company said Tuesday that its quarterly net profit was 301 million euros ($311.4 million) compared with 236 million euros for the same quarter a year prior.</p><p class=\"\">--</p><p class=\"\">Tullow Oil Names Richard Miller as Interim CEO</p><p class=\"\">Tullow Oil named Richard Miller as interim chief executive officer ahead of Rahul Dhir stepping down in mid-February.</p><p class=\"\">The oil-and-gas producer said Tuesday that Miller would take on the role temporarily from Feb. 14 while it continues to search for a permanent replacement.</p><p class=\"\">--</p><p class=\"\">Archer Daniels Midland Posts Fall in 4Q Revenue, Outlines Cost-Cutting Plan</p><p class=\"\">Archer Daniels Midland posted a rise in profit but lower revenue in the fourth quarter, and outlined up to $750 million in cost-saving measures amid softer market conditions.</p><p class=\"\">The food-production and ethanol company on Monday posted a net profit of $567 million, or $1.17 a share, compared with $565 million, or $1.06 a share, for the same period a year earlier.</p><p class=\"\">--</p><p class=\"\">PepsiCo 4Q Revenue Slips on Volume Drop for Frito-Lay, Quaker</p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\">The Purchase, N.Y., snacks and soda maker posted fourth-quarter net income of $1.52 billion, or $1.11 a share, for the quarter ended Dec. 28. That is up from $1.3 billion, or 94 cents a share, in the same quarter a year before.</p><p class=\"\">MARKET TALKS:</p><p class=\"\">Russian Wheat Prices on the Rise — Market Talk</p><p class=\"\">1219 ET - Higher prices for Russian wheat are Providing support for CBOT wheat futures. Agricultural research firm SovEcon says that the average domestic price for Russian wheat has risen to 15,526 rubles, or $158 per metric ton. In U.S. dollars, that's up 9% since the start of the year, according to SovEcon. The firm says that exporters have been increasingly buying up Russian wheat in recent months, supporting the higher price. However, exports fell back in January, SovEcon says — and Russia's ability to supply wheat to the world may prove to be weaker in 2025 due to troubled weather this winter. CBOT wheat is up 1.1%. (kirk.maltais@wsj.com)</p><p class=\"\">--</p><p class=\"\">U.S. Natural Gas Futures Give Back Gains — Market Talk</p><p class=\"\">0936 ET - U.S. natural gas futures hand back some of the previous day's gains as weather forecasts continue to vary over how cold February is likely to be. China announced a 15% tariff to be placed on imports of U.S. LNG as of Feb. 10, in response to U.S. tariffs on Chinese goods. \"In the immediate term, Chinese offtakers may shy away from U.S.-sourced spot LNG purchases--but U.S. LNG may simply backfill other Asian supply that China lifts instead,\" Eli Rubin of EBW Analytics says in a note. The tariffs could affect longer-term contracting, however, he adds. The Nymex front month is down 5.2% at $3.177/mmBtu. (anthony.harrup@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Rise to Fresh Record as Uncertainty Around Trump Policies Lingers — Market Talk</p><p class=\"\">1641 GMT - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Grain Futures Show Restrained Reaction to China Tariffs — Market Talk</p><p class=\"\">0928 ET - New U.S. tariffs on Chinese goods were met with retaliation from China, resulting in selling in CBOT soybean futures overnight. But that selling has moderated, with the most-active soybean contract now down only 0.3% pre-market. Traders who have spoken to WSJ say that a lot of market activity has become reactive to new headlines, but is showing restraint in light of trade uncertainty. \"I think the trade is well braced for this,\" says Terry Reilly of Marex. Reilly adds that many traders likely \"learned their lesson\" after handling the fallout of the trade war with China in Trump's first term. (kirk.maltais@wsj.com)</p><p class=\"\">--</p><p class=\"\">Oil Plunges on Trade War Fears — Market Talk</p><p class=\"\">1425 GMT - Crude prices extend losses in midday trade amid heightened fears of a trade war between the U.S. and China that could hurt global growth and increase inflationary pressures. Brent crude is down 2.3% to $74.22 a barrel, while WTI falls 3.3% to $70.75 a barrel. Both benchmarks erased all the previous session's gains, also due to easing concerns over immediate disruption of Canadian and Mexican oil flows after U.S. President Trump agreed to hold off imposing tariffs on the two neighboring countries. \"The next key support levels to watch are $69.50 and $66,\" says Razan Hilal, market analyst at Forex. \"A deeper decline could signal the start of a more extended bearish trend.\" (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">ADM Cuts Jobs Due to Tough Ag Market — Market Talk</p><p class=\"\">0814 ET - Grain trader ADM says it is cutting 600 to 750 jobs globally in 2025 and plans to cut between $500 million and $750 million in costs over the next three to five years. The Chicago-based company that ships grain and processes crops into food ingredients, oil and biofuels says the cost cutting moves come during a challenging period for the agriculture industry, including low crop prices and \"global legislative and regulatory policy uncertainty.\" The company reported adjusted EPS of $1.14, on par with analyst estimates. (patrick.thomas@wsj.com)</p><p class=\"\">--</p><p class=\"\">Base Metal Prices Mixed; Threat of Tariffs Weighs on Sector — Market Talk</p><p class=\"\">1329 GMT - Base metal prices are mixed, with LME three-month copper up 0.1% at $9,116 a metric ton and LME three-month aluminum flat at $2,620 a ton in muted trading. Base metals reacted to the threat of U.S. tariffs in Monday's session with losses, compounded by the disappointing slip in the Chinese Caixin index for private companies, Commerzbank analysts say in a note. The main burden is the concern that this round of tariffs could just be the beginning, Commerzbank says. The initial reaction to postponed Mexico and Canada tariffs was a small relief rally, especially as U.S. economic data also surprised to the upside, analysts write. That said, some of these gains were reversed early Tuesday on China's countermeasures, and the prevailing hope is that it will stick with just these tariffs, Commerzbank adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">China's Counter Tariffs to Have Limited Impact on Oil Market, Commerzbank Says — Market Talk</p><p class=\"\">1245 GMT - China's counter tariffs on U.S. imports aren't expected to have a significant impact on the oil market, according to Commerzbank Research. Beijing said it would impose a 15% tariff on U.S. coal and liquefied natural gas products as well as a 10% tariff on crude oil and other products such as agricultural machinery, effective on Feb. 10. \"As China only sourced 1.8% of its crude oil imports from the U.S. last year, the impact on the oil market should be limited,\" commodity analyst Carsten Fritsch says in a note. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Fall But Keep Near Record High on Safe-haven Demand — Market Talk</p><p class=\"\">1131 GMT - Gold futures slip, though they remain close to all-time highs reached in Monday's session. Futures are down 0.55% at $2,841.40 a troy ounce, after hitting a record $2,872 in the prior session. Gold spot prices are flat on $2,814.43 an ounce. The precious metal is holding close to highs as the U.S. dollar weakens, ActivTrades' Ricardo Evangelista says in a note. The greenback gave up gains after the Trump administration delayed higher tariffs on Canada and Mexico for a month. That said, Washington hasn't backed down on tariffs for Chinese imports. As Beijing retaliates, the threat of an all-out trade war escalates, Evangelista says. This scenario casts a dark shadow over global economic growth prospects, naturally driving increased safe-haven demand and creating scope for further gold gains, Evangelista writes. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Palm Oil Ends Lower After Trump Pauses Tariff on Mexico, Canada — Market Talk 1009 GMT - Palm oil ended lower after President Trump paused the proposed 25% tariffs on imports from Mexico and Canada. Palm oil prices have risen in recent sessions amid concerns over tariffs on Canadian canola oil as well as an urgent need for alternative vegetable oils, Kenanga Futures says in a research note. Trump's delay of tariff implementations likely triggered profit-taking activities following recent rallies, they say. Meanwhile, ongoing worries about India's declining demand, which is at an 11-year low, could further dampen market sentiment. The Bursa Malaysia Derivatives contract for April delivery ended 63 ringgit lower at 4,304 ringgit a ton. (sherry.qin@wsj.com)</p><p class=\"\">--</p><p class=\"\">Europe's Gas Price Eases But Remains Near 15-Month High — Market Talk</p><p class=\"\">0950 GMT - European natural-gas prices ease but continue to hover around their 15-month high, with the benchmark Dutch TTF down 0.9% to 53.32 euros a megawatt hour. \"The gas prices in Europe have continued to grow, and TTF is currently on par with the levels we saw at the end of 2023,\" DNB Markets analysts say. However, \"we still see that the market expects significant LNG volumes to reach the market in 2026, pushing the price down.\" The EU needs more LNG to meet its storage-filling target of 90% by Nov. 1., but inventories have been depleting fast and the bloc barely reached the Feb. 1 target of 50%. As of Sunday, EU gas storage was 52.6% full, with particularly high daily net withdrawals in Germany due to low wind-power generation. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Metal Prices Mixed in Uncertain Trading After Tariff Agreement — Market Talk</p><p class=\"\">0944 GMT - Base metal prices are mixed, with LME three-month copper up 0.2% at $9,129.50 a metric ton and LME three-month aluminum down 0.1% at $2,618 a ton amid relatively thin trading. President Trump delayed 25% tariffs on Canadian and Mexican imports for one month after the countries reached an agreement, though an additional 10% China tariff has proceeded. The broader end point around further U.S. tariff developments remain uncertain, Macquarie analysts say in a note. From the perspective of industrial metals, the implementation of the tariffs for any period of time will be a net bearish development, Macquarie says. The tariffs would drag on global goods demand and industrial production growth, by extension hurting commodities demand. At the same time, they would introduce further headwinds by boosting the U.S. dollar and reducing rate cut prospects, Macquarie adds. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Gold Futures Slip on Last-Minute Tariff Deal But Stay Close to High — Market Talk</p><p class=\"\">0926 GMT - Gold futures slide as Canada and Mexico came to a last-minute deal with the U.S. Futures are down 0.5% at $2,842.30 a troy ounce, but remain elevated, having hit a record high of $2,872 an ounce in the prior session. Gold prices are correcting after the countries made a deal that will postpone U.S. tariffs by at least a month, ING analysts say in a note. However, the uncertainty over trade and tariffs continue to keep the price relatively well supported, they say. Tariffs on China are proceeding. Investors sought out safe havens in Monday's session though the stronger dollar provided significant headwinds, likely capping an even stronger rally, ING says. Total known gold ETF holdings have risen more than 590,000 ounces to 83.4 million ounces in the year to date in the flight to safety, ING says. (joseph.hoppe@wsj.com)</p><p class=\"\">--</p><p class=\"\">Oil Falls Amid Tariff Turmoil — Market Talk</p><p class=\"\">0859 GMT - Oil prices fall more than 1% as immediate concerns over supply disruptions ease after U.S. President Trump paused tariffs on Mexico and Canada, the country's biggest foreign suppliers of crude. Brent is down 1.3% at $74.95 a barrel, while WTI falls 2% to $71.70 a barrel. Meanwhile, as a 10% U.S. tariff on Chinese imports came into effect Tuesday, Beijing announced its decision to retaliate with a 15% tariff on U.S. coal and liquefied natural gas imports and a 10% levy on American crude oil and agricultural machinery, starting Monday. The move raised fears of a trade war that could ultimately hurt global growth and dampen demand, putting further pressure on prices. (giulia.petroni@wsj.com)</p><p class=\"\">--</p><p class=\"\">Comex Gold Futures' Bullish Technical Setup Has Strengthened, Chart Shows — Market Talk</p><p class=\"\">0810 GMT - Comex gold futures' bullish technical setup has strengthened, based on the daily chart, RHB Retail Research's Joseph Chai says in a research report. Despite selling pressure overnight, the latest price movements show the commodity found strong support at the $2,800/oz level, leaving its bullish bias intact, Chai says. The relative strength index is trending upward, signaling a resumption of the bullish path toward the $2,900/oz level, Chai says. The 20- and 50-day simple moving averages are also curving upward, reinforcing the bullish technical setup, the analyst adds. Spot gold is 0.1% lower at $2,812.28/oz. (ronnie.harui@wsj.com)</p><p class=\"\">--</p><p class=\"\">Mondelez, Kellogg Among Companies to Be Hit By Tariff Hikes — Market Talk</p><p class=\"\">1853 ET - If President Donald Trumps ends up implementing 25% tariff hikes to Canada and Mexico goods, the consumption-related companies that would be impacted the most would be in the produce goods and alcohol spaces, BofA Securities analyst Bryan Spillane tells WSJ. \"This would drive produce prices higher, especially for fruits,\" Spillane says, adding that 40% of the U.S. produce comes from Mexico. Other companies in the grocery space that would get hit by tariffs and higher prices are Mondelez International and WK Kellogg, given that they don't produce essential food and would see their volumes go down, Spillane says. Mondelez makes about half of its Oreos in Mexico, and Kellogg recently closed two U.S. plants and expanded an existing facility in Ontario. (sabela.ojea@wsj.com; @sabelaojeaguix)</p><p class=\"\">Write to Barcelona Editors at barcelonaeditors@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009114:0/",
            "pub_date": "2025-02-05 01:36:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309116:0",
            "title": "Tempur Sealy Expects to Close Mattress Firm Group Acquisition on Wednesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tempur Sealy International  said it anticipates completing the acquisition of Mattress Firm Group on Wednesday after the US District Court for the Southern District of Texas denied the Federal Trade Commission's motion to halt the closing. </p><p class=\"\">The FTC signaled it won't take other steps to prevent the closing of the transaction, Tempur Sealy said Tuesday in a statement.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309116:0/",
            "pub_date": "2025-02-05 01:36:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:5963570da094b:0",
            "title": "Disney's Q1 Earnings in Focus: Streaming Growth vs. Theme Park Challenges",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Walt Disney  is set to report first-quarter earnings on Wednesday before markets open, with analysts closely watching the company's profitability, streaming growth, and theme park performance.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Q1 Earnings Expectations</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">EPS forecast:</strong> $1.43 (+17% YoY)</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue forecast:</strong> $24.55 billion (+5% YoY)</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Buyback target:</strong> $3 billion for FY2025</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Key Business Highlights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Streaming Growth &amp; Box Office Success: Hits like <em>Moana 2</em> and <em>Mufasa: The Lion King</em> have bolstered Disney's earnings outlook.</li><li class=\"listItem-bmN0_SHH\">Experiences Segment Challenges: Analysts are monitoring theme park attendance, with hurricanes Helene and Milton and cruise ship pre-opening costs weighing on results.</li><li class=\"listItem-bmN0_SHH\">Future Profit Growth: Disney reaffirmed its FY2025 profit forecast for high single-digit growth, rising to double-digit EPS growth in FY2026 and FY2027, even as it increases investments in theme parks and cruise lines.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Analyst Insights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">BofA analyst Jessica Reif Ehrlich called Q1 the trough quarter of the fiscal year but noted that Los Angeles wildfires have not significantly impacted Disneyland attendance so far.</li><li class=\"listItem-bmN0_SHH\">Guggenheim analyst Michael Morris projected a 5% decline in Q1 experiences revenue, recovering to +4% in Q2 and 7% full-year growth.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Historical Performance</strong></strong></p><p class=\"\">Over the last two years, Disney has beaten EPS estimates 88% of the time and revenue estimates 50% of the time.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:5963570da094b:0-disney-s-q1-earnings-in-focus-streaming-growth-vs-theme-park-challenges/",
            "pub_date": "2025-02-05 01:37:24",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009125:0",
            "title": "STOXX Europe 600 Index Ends 0.22% Higher at 536.04 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 600 Index is up 1.19 points or 0.22% today to 536.04</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Third highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its record close of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 52-week high of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 11.02% from its 52-week low of 482.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 10.12% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 2025 closing high of 539.53 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.48% from its 2025 closing low of 508.19 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 28.42 points or 5.60%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009125:0/",
            "pub_date": "2025-02-05 01:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009127:0",
            "title": "FTSE 100 Index Ends 0.15% Lower at 8570.77 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 Index is down 12.79 points or 0.15% today to 8570.77</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 103.19 points or 1.19% over the last two trading days</li><li class=\"listItem-bmN0_SHH\">Largest two day point and percentage decline since Friday, Dec. 20, 2024</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its record close of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 35.23% since the pre-Brexit vote level of 6338.10 hit Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 52-week high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 14.09% from its 52-week low of 7512.28 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 11.58% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 2025 closing high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.50% from its 2025 closing low of 8201.54 hit Tuesday, Jan. 14, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 397.75 points or 4.87%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009127:0/",
            "pub_date": "2025-02-05 01:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:092aef0ad094b:0",
            "title": "Sugar Prices Climb on Reduced Indian Sugar Output",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">March NY world sugar #11 (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/SB*0/overview\" rel=\"nofollow\" target=\"_blank\">SBH25</a>) today is up +0.31 (+1.61%), and March London ICE white sugar #5 (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/futures/quotes/SW*0/overview\" rel=\"nofollow\" target=\"_blank\">SWH25</a>) is up +9.80 (+1.91%).</p><p class=\"\">Sugar prices today are climbing, with NY sugar posting a 4-week high and London sugar posting a 7-week high. Reduced sugar output in India is boosting prices after Centrum reported today that India's 2024/25 sugar production from October 1 to January 31 was down -12.2% y/y to 16.5 MMT.</p><p class=\"\">Strength in the Brazilian real (<a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/forex/quotes/%5EUSDBRL/overview\" rel=\"nofollow\" target=\"_blank\">^USDBRL</a>) is also lifting sugar prices as the real climbed to a 2-1/2 month high against the dollar today. The stronger real discourages export selling from Brazil's sugar producers. </p><p class=\"\">Sugar prices have been in a 4-month-long downtrend. On January 21, NY sugar posted a 5-1/2 month nearest-futures low, and London sugar posted a 3-1/2 year low. An improving global sugar supply outlook is weighing on sugar prices. On January 20, India said it would allow its sugar mills to export 1 MMT of sugar this season, easing its restrictions placed on sugar exports in 2023. India has restricted sugar exports since October 2023 to maintain adequate domestic supplies. India allowed mills to export only 6.1 MMT of sugar during the 2022/23 season to September 30 after allowing exports of a record 11.1 MMT in the previous season. </p><p class=\"\">On November 21, the International Sugar Organization (ISO) reduced its 2024/25 global sugar deficit forecast to -2.51 MMT, compared to an August forecast of -3.58 MMT. ISO also raised its 2023/24 global sugar surplus estimate to 1.31 MMT from an August projection of 200,000 MT. </p><p class=\"\">The outlook for higher sugar production in Thailand is bearish for sugar prices. On October 29, Thailand's Office of the Cane and Sugar Board projected that Thailand's 2024/25 sugar production would jump by +18% y/y to 10.35 MMT. Thailand produced 8.77 MMT of sugar in the 2023/24 season that ended in April. Thailand is the world's third-largest sugar producer and the second-largest sugar exporter.</p><p class=\"\">Sugar found support last Wednesday after Czarnikow cut its Thailand 2024/25 sugar production estimate to 10.8 MMT from a previous forecast of 11.6 MMT.</p><p class=\"\">Drought and excessive heat last year caused fires in Brazil that damaged sugar crops in Brazil's top sugar-producing state of Sao Paulo. Sugar cane industry group Orplana said that as many as 2,000 fire outbreaks affected up to 80,000 hectares of planted sugarcane in Sao Paulo. Green Pool Commodity Specialists noted that as much as 5 MMT of sugar cane may have been lost due to the fires. Conab, Brazil's government crop forecasting agency, cut its 2024/25 Brazil sugar production estimate from November 21 to 44 MMT from a previous forecast of 46 MMT, citing lower sugarcane yields due to drought and excessive heat. Unica reported today that cumulative 2024/25 Center-South sugar output through mid-January is down -5.5% y/y to 39.794 MMT. </p><p class=\"\">Sugar has support from signs of smaller sugar production in India, the world's second-largest producer. The ISM projects India's 2024/25 sugar production to fall -15% y/y to a 5-year low of 27.27 MMT.</p><p class=\"\">As a supportive factor for sugar prices, the ISO on August 30 forecasted 2024/25 global sugar production of 179.3 MMT, down -1.1% y/y from 181.3 MMT in 2023/24. </p><p class=\"\">The USDA, in its bi-annual report released November 21, projected that global 2024/25 sugar production would climb +1.5% y/y to a record 186.619 MMT and that global 2024/25 human sugar consumption would increase +1.2% y/y to a record 179.63 MMT. The USDA also forecasted that 2024/25 global sugar ending stocks would decline -6.1% y/y to 45.427 MMT. </p><p class=\"\"><em>On the date of publication, Rich Asplund did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Did Markets See Follow-Through Activity Overnight?</li><li class=\"listItem-bmN0_SHH\">Commodity Market Roundup- January’s Top Performers and Underperformers</li><li class=\"listItem-bmN0_SHH\">What Were Long-Term Monthly Charts Showing at the End of January?</li><li class=\"listItem-bmN0_SHH\">Is Coffee Moving to Even Higher Highs?</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:092aef0ad094b:0-sugar-prices-climb-on-reduced-indian-sugar-output/",
            "pub_date": "2025-02-05 01:38:11",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309121:0",
            "title": "Scotiabank Previews This Week's Policy Meeting at India's Central Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Reserve Bank of India is expected to cut its repo rate by 25bps to 6.25% on Thursday with a minority expecting a hold, said Scotiabank. </p><p class=\"\">Food price drivers of inflation have ebbed sharply, noted the bank. It may wish to evaluate the contents of this weekend's Indian budget. </p><p class=\"\">One question concerns whether the RBI provides a stimulus boost to the economy and whether the government remains on the same broad fiscal path. The finance minister said at her last 2024 budget that they wish to \"keep fiscal deficit each year such that the central government debt would be on a declining path as a percentage of GDP,\" .</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309121:0/",
            "pub_date": "2025-02-05 01:38:19",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009130:0",
            "title": "STOXX Europe 50 Index Ends 0.11% Higher at 4577.55 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 50 Index is up 5.12 points or 0.11% today to 4577.55</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 13 of the past 15 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.69% from its record close of 5183.24 hit Tuesday, May 2, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 52-week high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 9.02% from its 52-week low of 4198.67 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 7.86% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 2025 closing high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.06% from its 2025 closing low of 4316.04 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 268.92 points or 6.24%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009130:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009131:0",
            "title": "EURO STOXX 50 Index Ends 0.89% Higher at 5264.59 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The EURO STOXX 50 Index is up 46.68 points or 0.89% today to 5264.59</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 14 of the past 16 trading days</li><li class=\"listItem-bmN0_SHH\">Off 3.66% from its record close of 5464.43 hit Monday, March 6, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 52-week high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 15.16% from its 52-week low of 4571.60 hit Monday, Aug. 5, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 12.23% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 2025 closing high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.07% from its 2025 closing low of 4871.45 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 368.61 points or 7.53%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009131:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009128:0",
            "title": "DAX Ends 0.36% Higher at 21505.70 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX is up 77.46 points or 0.36% today to 21505.70</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its record close of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 52-week high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 27.40% from its 52-week low of 16880.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 26.26% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 2025 closing high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.04% from its 2025 closing low of 19906.08 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 1596.56 points or 8.02%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009128:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009129:0",
            "title": "CAC 40 Index Ends 0.66% Higher at 7906.40 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 Index is up 51.48 points or 0.66% today to 7906.40</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up three of the past four trading days</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its record close of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fifth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its 52-week high of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.89% from its 52-week low of 7130.04 hit Tuesday, Aug. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 3.50% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.55% from its 2025 closing high of 7950.17 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.57% from its 2025 closing low of 7282.22 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 525.66 points or 7.12%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009129:0/",
            "pub_date": "2025-02-05 01:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009135:0",
            "title": "U.S. Stocks Stage Small Recovery — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Caitlin McCabe and Krystal Hur</p><p class=\"\">U.S. stocks staged a small recovery Tuesday, despite China's retaliation against the new U.S. tariffs.</p><p class=\"\">The moves were milder than Monday's big swings, and some signs of investor anxiety remained.</p><p class=\"\">Among the notable moves:</p><p class=\"\">Stocks indexes largely rose. The Dow industrials was little changed, while the S&amp;P 500 rose 0.6%. The tech-heavy Nasdaq Composite led gains, up over 1.2%.</p><p class=\"\">The Cboe Volatility Index, or VIX, fell below 18, after surging Monday. The \"fear gauge\" is higher than the average of about 16 over the past year, but far from panic territory.</p><p class=\"\">Yields on benchmark Treasury notes were little changed. The 10-year yield traded around 4.54%, compared with 4.542% Monday.</p><p class=\"\">The WSJ Dollar Index edged down. The Canadian dollar advanced against the dollar, as did the Chinese yuan, while the euro and British pound slipped.</p><p class=\"\">Oil prices were volatile. U.S. crude futures slid below $71 a barrel, before rebounding back above $72.</p><p class=\"\">Bitcoin prices traded around $99,000.</p><p class=\"\">Write to Caitlin McCabe at caitlin.mccabe@wsj.com and Krystal Hur at krystal.hur@wsj.com</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009135:0/",
            "pub_date": "2025-02-05 01:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009136:0",
            "title": "Russia's Threat to Undersea Internet Cables Can't Be Ignored — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Justin Sherman</p><p class=\"\">Justin Sherman is the founder and CEO of Global Cyber Strategies , a research and advisory firm, and a nonresident senior fellow at the Atlantic Council.</p><p class=\"\">Headed into 2025, a ship did something that Finland, and many in the West, saw as a new level of Russian provocation: It dragged its anchor and severed undersea cables in the Baltic Sea.</p><p class=\"\">Finnish forces seized the ship, \"Eagle S,\" and immediately launched an investigation. They initially suspected a Kremlin-directed plot to disrupt Baltic internet communications and sow chaos in Europe. Some European and U.S. officials say the episode may have been accidental, but the incident should remind the West that both unintentional and intentional damage to undersea cables remain potent geopolitical and national security issues. Russian threats to global undersea cables demand a robust, multilaterally coordinated response that takes in cable repairs, cybersecurity, and defensive planning.</p><p class=\"\">Submarine cables carry 99% of internet traffic between continents. These 500-plus cables, about as thick as a garden hose, are critical for worldwide information flows, commerce, scientific research, and even military communications; today's internet wouldn't exist without them. U.S. and European companies have long played leading roles in building and maintaining the network, and combinations of private- and public-sector entities around the globe, from Brazil to China to Kenya, collaborate to connect these expensive, logistically intensive projects from city to city, country to country, and continent to continent.</p><p class=\"\">This vital infrastructure is damaged hundreds of times a year. It's almost always an accident. A boat moves close to a shoreline, doesn't properly check its maps for cables in the area, and then accidentally rips up or damages a cable with a dragging anchor.</p><p class=\"\">Damaging one cable won't collapse the global internet. But it isn't harmless, either. Damaging or destroying cables in certain regions can disrupt some data flows, have the effect of encouraging traffic to flow via other routes, force repair ships to be sent out, and much more. And many companies often underappreciate the nature of global military and intelligence threats to subsea cables. They are primed to think more about risks of resilience than spying and sabotage.</p><p class=\"\">But the continuing investigation in the Baltic Sea captures the real-time uncertainty that unfolds when a poorly timed cable cut, heightened geopolitical tensions, and questions of nation-state sabotage collide. The Eagle S is an oil tanker flying under the Cook Islands flag, formally making it a private vessel unconnected to the Kremlin's halls.</p><p class=\"\">It is plausible that the Eagle S, like many ships, genuinely made an accidental cut by dragging its anchor. That would hardly be an outlier. Cable repair ships are deployed regularly to Band-Aid together the result of a boat captain's negligence. Just because the ship may be Russia-linked doesn't inherently make it a sinister agent.</p><p class=\"\">Nonetheless, there is reason for suspicion about Russia's plans. Russia's General Staff Main Directorate for Deep Sea Research, or GUGI, is expanding its fleet of ships, subs, and naval drones that could spy on or damage cables. Doing so would fit into the Kremlin's view of the internet as a vital part of modern competition and conflict — a vulnerability for the Kremlin and a weapon to be used against its enemies. Such an operation would also fit into the purposes of Moscow's so-called shadow fleet, a covert collection of oil tankers and ships that register in lax jurisdictions beyond Russia (such as the Cook Islands), move freely around the world, and help Russia circumvent oil sanctions and execute operations.</p><p class=\"\">European and U.S. investigators may uncover what really happened, but the public may not get that information.</p><p class=\"\">The ability to repair cables quickly should be a focus for Western governments, along with their allies and partners in South Korea, Japan, Australia, and elsewhere. Repair has long fallen to the private sector, which has generally handled it well. Governments should ensure that the private sector's repair capabilities remain robust and that considerable Chinese involvement in cable repairs isn't a vector for adversarial espionage. The U.S. Cable Ship Security Program, which puts private ships on standby for national security-relevant repairs, may be a model for Finland and others.</p><p class=\"\">Cybersecurity needs more attention, too. Poorly secured, remote cable management systems give attackers another way to disrupt or degrade data flows. Governments have influence through the cable licenses they issue. They could build heightened cybersecurity requirements into their license requirements.</p><p class=\"\">Finally, the U.S., the U.K., Finland, and others should incorporate undersea infrastructure into defensive planning. If the Russian President Vladimir Putin's regime genuinely sees itself at war with NATO, countries cannot rule out what the Kremlin might do in the near future, including potentially expanding the Ukraine conflict. U.S. officials have voiced similar concerns about China, asking whether Taiwan-area cable cuts would escalate in a full-scale invasion.</p><p class=\"\">Repair ships must take notice, too. Pulling a cable up from the seabed and fixing it, even in stormy waters, is a different animal entirely when bullets and missiles fly overhead. Governments should help companies plan for those kinds of difficult scenarios. Multilateral exercises, threat intelligence-sharing, and security capacity-building partnerships could all help mitigate these risks.</p><p class=\"\">We may not ever know if what happened in the Baltic was sabotage or something more benign. Regardless, the cuts should make clearer than ever to the West that cable security is best when first designed during planning — not a panicked response.</p><p class=\"\">Guest commentaries like this one are written by authors outside the Barron's newsroom. They reflect the perspective and opinions of the authors. Submit feedback and commentary pitches to  ideas@barrons.com .</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009136:0/",
            "pub_date": "2025-02-05 01:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009089:0",
            "title": "Meta on Track for Record Winning Streak — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Meta Platforms Inc Class A (META) is currently at $704.08, up $6.62 or 0.95%</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Would be new all-time high (Based on available data back to May 18, 2012)</li><li class=\"listItem-bmN0_SHH\">Currently up 12 consecutive days; up 15.18% over this period</li><li class=\"listItem-bmN0_SHH\">Longest winning streak on record (Based on available data back to May 18, 2012)</li><li class=\"listItem-bmN0_SHH\">Best 12 day stretch since the 12 days ending Aug. 15, 2024, when it rose 16.01%</li><li class=\"listItem-bmN0_SHH\">Up 20.25% year-to-date</li><li class=\"listItem-bmN0_SHH\">Up 54.84% from 52 weeks ago (Feb. 6, 2024), when it closed at $454.72</li><li class=\"listItem-bmN0_SHH\">Would be a new 52-week closing high</li><li class=\"listItem-bmN0_SHH\">Up 63.67% from its 52-week closing low of $430.17 on April 30, 2024</li><li class=\"listItem-bmN0_SHH\">Traded as high as $706.97</li><li class=\"listItem-bmN0_SHH\">Up 1.36% at today's intraday high</li></ul><p class=\"\">All data as of 12:09:01 PM ET</p><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009089:0-meta-on-track-for-record-winning-streak-data-talk/",
            "pub_date": "2025-02-05 01:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009088:0",
            "title": "Canada Net Change Percentage Gainers & Losers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              GAINERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>NXT Energy Solutions         SFD      0.28     0.08     36.59        24,042 <br/>Silver Elephant Mining      ELEF       0.2     0.04     25.00       133,291 <br/>RTG Mining                   RTG     0.025     0.01     25.00        20,000 <br/>Northcliff Resources         NCF      0.03     0.01     20.00        44,000 <br/>Willow Biosciences          WLLW      0.03     0.01     20.00       325,000 <br/>Western Resources            WRX      0.04     0.01     14.29         5,318 <br/>Dorel Industries Cl B      DII.B      4.93     0.49     11.04         3,510 <br/>Bri-Chem                     BRY     0.355     0.04     10.94         6,500 <br/>RF Capital Group             RCG     10.88     0.88      8.80        22,861 <br/>Hammond Manufacturing A    HMM.A      9.71     0.76      8.49        44,306 <br/> <br/>                              LOSERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Ascendant Resources         ASND     0.045    -0.01    -18.18       195,500 <br/>BriaCell Therapeutics        BCT      6.25    -1.05    -14.38        23,960 <br/>Star Diamond                DIAM     0.035    -0.01    -12.50       207,505 <br/>Karnalyte Resources          KRN      0.09    -0.01    -10.00         6,250 <br/>Meridian Mining UK           MNO     0.395    -0.03     -7.06       144,652 <br/>Wallbridge Mining             WM      0.07    -0.01     -6.67       441,861 <br/>Pieridae Energy              PEA     0.245    -0.02     -5.77        50,000 <br/>Excellon Resources           EXN     0.085    -0.01     -5.56       121,881 <br/>Greenlane Renewables         GRN      0.09    -0.01     -5.26         1,850 <br/>Colabor Group                GCL      0.83    -0.04     -4.60        18,500 <br/> <br/> <br/>Only includes stocks with at least 1,000 shares traded today. <br/> <br/>Data are delayed at least 15 minutes. <br/> <br/>Source: Dow Jones Market Data <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009088:0/",
            "pub_date": "2025-02-05 01:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV2DO:0",
            "title": "PayPal Holdings Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc  reported quarterly adjusted earnings of $1.19​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of $1.48.  The mean expectation of thirty four analysts for the quarter was for earnings of $1.12 per share. Wall Street expected results to range from $1.09  to $1.22 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 4.2% to $8.37 billion from a year ago; analysts expected $8.26 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc's reported EPS for the quarter was $1.11​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $1.12 billion.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">PayPal Holdings Inc shares had risen by 4.9% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 0.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, two analysts negatively revised earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 22 \"strong buy\" or \"buy,\" 23 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the business support services peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for PayPal Holdings Inc is $94.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 05:30 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.12</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.07</p></td><td><p class=\"\">1.20</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.99</p></td><td><p class=\"\">1.19</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.22</p></td><td><p class=\"\">1.40</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV2DO:0-paypal-holdings-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 01:31:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009095:0",
            "title": "Why Some Firms Are Turning Operations and Support Staff Into Financial Advisors — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Anne Field</p><p class=\"\">In 2023, the partners at Frisch Financial decided it was time to hire another financial advisor. The Melville, N.Y., firm, with about $800 million in assets under management, had grown a lot over the preceding 10 years and quite simply needed a fifth person with previous experience who could work with existing clients, bring on board new ones, and become a full-fledged wealth manager.</p><p class=\"\">So the partners were surprised when an unexpected job candidate stepped up: Denise Jackson, who had been with the firm about 20 years, working in a variety of operational, administrative, and customer service jobs. But after the initial surprise, the partners decided the move seemed like a good idea, despite the expected learning curve. \"She knew all the clients. She knew the relationship management software. She knew the operational and service side of things,\" says Shawn Gallagher, a principal at the firm. \"It made sense.\"</p><p class=\"\">There aren't exact numbers for how many support people are becoming advisors, but Jackson appears to represent a trend. \"It's very prevalent right now,\" says Andrew Blake, associate director of wealth management at Cerulli Associates, a financial-services research firm. As the number of advisors set to retire increases and firms struggle to find replacements, tapping support professionals who understand a firm's backbone and inner workings or how things are done at similar enterprises seems like a logical move. If the person is familiar with the company's clients, it can be another plus. \"It's a clear advantage over someone else,\" Blake says.</p><p class=\"\">Of course, moving from operations and support to the financial advisory part of the business isn't a slam dunk. It requires learning a new set of capabilities. \"The job of an advisor is very different from what they were doing before,\" says Gallagher.</p><p class=\"\">Skipping ahead. Previous support experience can help an individual move through the development process faster than they might without that background. Take Jackson. Around the time she expressed interest in filling the new advisor role, the firm had also introduced a four-phase career path for advisors.</p><p class=\"\">The career path starts with financial-planning analysts, who have to learn the firm's software and other basic tasks, and ends with wealth advisors, who are lead advisors, part of the investment committee, and responsible for bringing in business, among other responsibilities. Because of her familiarity with the firm's administrative and other processes, Jackson was able to skip the first phase and go right to the second, associate financial planner. In that role, she sits in on client meetings with a lead advisor, contributing to the discussion when they address such areas as financial planning, as well as doing premeeting prep work, and necessary follow-up. The next step for Jackson, who is currently enrolled in classes to prepare for the Certified Financial Plan exam, is financial planner, which would allow her to assume a role almost like that of a lead advisor.</p><p class=\"\">The power of operational knowledge. For many firms, experience working in operations and other support roles is a definite plus, especially if the individuals already work for the organization. In some cases, practices opt for operations people even when the candidate comes from a different enterprise.</p><p class=\"\">About a year ago, Donald LaGrange and his colleagues at Dallas-based Murphy &amp; Sylvest Wealth Management, wanted to add another advisor to the 10-year-old firm's Elmhurst, Ill., office. \"We generally look for someone who's more proven\" than someone in operations, he says. But then they were introduced through a mutual friend to Scott Long, who was working for an Oakbrook, Ill., retail branch of Fidelity Investments in an operations role. LaGrange figured it would be helpful to have someone who knew the inner workings of a large custodian, \"how to meet all the paper requirements, and was comfortable with that part of the business,\" he says. Long wasn't looking to make a change, but he clicked with the firm's owners, had his Series 7 and 66, and decided to give the advisor role a try.</p><p class=\"\">The Murphy &amp; Sylvest Wealth Management team understood that hiring Long would require a different learning process — one that would combine tried-and-true methods with efforts tailored to his situation. \"We knew we had to commit to Scott's technical development,\" says LaGrange. For starters, that involved Long sitting in on meetings with existing clients in both Elmhurst and Dallas. He still regularly attends meetings with Paul Nolte, senior wealth advisor in the Elmhurst office, and Nolte's clients, doing a postmortem afterward.</p><p class=\"\">Long also turns to different team members for help with their areas of expertise when working with clients. LaGrange, a retired army officer, for example, has met with Long and a few military veteran clients. Long has called on an estate-planning expert when he needed that knowledge. In addition, LaGrange and another advisor usually create the financial plans for Long's clients.</p><p class=\"\">Long works in a hybrid capacity, handling projects like making sure account forms are filled out correctly, for his clients, as well as for Nolte's. His experience is typical of operations professionals transitioning to an advisor role at other enterprises. About one-third of advisors in their first three years at a firm continue to have client service support and operations duties, according to Cerulli's Blake.</p><p class=\"\">Business development options. For some support people, the biggest hurdle to making the transition to advisor tends to be business development. For individuals who just don't succeed or enjoy looking for new clients, the best solution, if available, may be to avoid rainmaker duties, and focus on being a \"service advisor,\" suggests Alex Stickelman, chief compliance officer at Rossby Financial. \"In some firms, they leave lead generation up to the financial advisor,\" she says. \"But at others, there's a servicing advisor who is fully licensed but not responsible for generating business.\"</p><p class=\"\">Ultimately, operations people turned advisors say their previous experience creates an understanding of clients they couldn't have developed otherwise. \"Clients want to know what to expect, what happens next,\" says Long. \"If you've done it all firsthand, you can provide insights into the whole process.\"</p><p class=\"\">Write to advisor.editors@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009095:0/",
            "pub_date": "2025-02-05 01:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009091:0",
            "title": "PayPal Investors Worry About Shifts at Braintree — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009091:0/",
            "pub_date": "2025-02-05 01:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV08E:0",
            "title": "Elon Musk and OpenAI head to court to spar over nonprofit conversion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Musk sues to block OpenAI's conversion to a for-profit structure</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Musk cofounded OpenAI with Altman in 2015</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">OpenAI argues for-profit move needed for capital</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nonprofit to for-profit conversion rare, expert says</li></ul></span></div><span><p class=\"\">    Lawyers for Elon Musk and ChatGPT maker OpenAI are set to butt heads in the courtroom on Tuesday as a judge will hear arguments on Musk’s lawsuit to halt OpenAI’s conversion to a for-profit entity.</p><p class=\"\">Musk’s request to block OpenAI’s conversion is the latest move in a grudge match between the world's richest person and OpenAI CEO Sam Altman that is playing out publicly in court. </p><p class=\"\">The hearing will take place at a U.S. federal court in the Northern District of California.</p><p class=\"\">Musk cofounded OpenAI with Altman in 2015, but left before the company took off and subsequently founded the competing AI startup xAI in 2023.</p><p class=\"\">OpenAI is now trying to transition from a nonprofit into a for-profit entity, which it says it needs to do to secure the capital required to develop the best artificial intelligence models.</p><p class=\"\">Last year, Musk filed a lawsuit against OpenAI and Altman, saying that OpenAI’s founders originally approached him to fund a nonprofit focused on developing AI to benefit humanity, but that it is now focused on making money. </p><p class=\"\">He later expanded the lawsuit to add federal antitrust and other claims, and in December asked the judge presiding over the case to stop OpenAI from transitioning to a for-profit.</p><p class=\"\">In response to Musk’s lawsuit, OpenAI has said it will move to dismiss Musk’s claims and that Musk “should be competing in the marketplace rather than the courtroom.”</p><p class=\"\">The stakes on OpenAI's corporate transition have now escalated, as OpenAI’s last fundraising roundof $6.6 billion and a new round of up to $25 billion under discussion with SoftBank  are conditioned on the company restructuring to remove the nonprofit’s control.</p><p class=\"\">Such a restructuring would be highly unusual, said Rose Chan Loui, executive director of the UCLA Law Center for Philanthropy and Nonprofits. Nonprofit conversions to for-profits have historically been for health care organizations like hospitals, not venture capital-backed companies, she said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV08E:0-elon-musk-and-openai-head-to-court-to-spar-over-nonprofit-conversion/",
            "pub_date": "2025-02-05 01:32:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1S0:0",
            "title": "Robinhood receives US CFTC request to roll back Super Bowl prediction contracts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Robinhood said on Tuesday it had received a formal request from the U.S. Commodity Futures Trading Commission to roll back its Super Bowl betting contracts product.  </p><p class=\"\">The trading platform had launched the event contracts on Monday to let U.S. customers wager on the outcome of the Super Bowl clash.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1S0:0-robinhood-receives-us-cftc-request-to-roll-back-super-bowl-prediction-contracts/",
            "pub_date": "2025-02-05 01:32:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309114:0",
            "title": "General Motors' Cruise Unit to Cut Half of Workforce, TechCrunch Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309114:0/",
            "pub_date": "2025-02-05 01:32:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:9c82f88782326:0",
            "title": "BELLRING BRANDS, INC. SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BELLRING BRANDS, INC., a leading player in the nutritional products industry, has released its Form 10-Q report for the third quarter of fiscal 2024. The report highlights significant growth in both financial and operational metrics, underscoring the company's robust performance and strategic initiatives.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Sales</strong>: $532.9 million, marking a 24% increase compared to the prior year period, driven by higher volumes and targeted price increases.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gross Profit</strong>: $199.6 million, reflecting improved margins due to higher net sales and lower net product costs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operating Profit</strong>: $115.3 million, a 58% increase from the prior year period, primarily due to higher net sales and lower amortization expenses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Net Earnings</strong>: $76.9 million, a 75% increase from the prior year period, supported by higher operating profit and stable interest expenses.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Basic Earnings per Common Share</strong>: $0.60, reflecting the increase in net earnings.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Diluted Earnings per Common Share</strong>: $0.59, consistent with the increase in net earnings and reflecting the effect of dilutive securities.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The company reported a 24% increase in net sales, driven by a 26% increase in Premier Protein product sales and a 13% increase in Dymatize product sales. Premier Protein's growth was attributed to a 21% increase in volumes due to distribution gains and promotional activities, while Dymatize saw a 12% increase in volumes, primarily from international markets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Sales Units</strong>: Premier Protein experienced a significant volume increase of 21%, largely due to distribution gains and promotional activities. Dymatize also saw a 12% increase in volumes, driven by higher international sales.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Market Trends</strong>: Inflationary pressures on protein costs eased during fiscal 2024, but other costs such as packaging and manufacturing faced inflationary pressures. The company anticipates continued inflationary pressures on input costs, including raw materials, packaging, and manufacturing, during fiscal 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Operational Efficiency</strong>: The company achieved a 58% increase in operating profit, primarily due to higher net sales, reduced amortization expenses from the discontinuance of the PowerBar business, and lower net product costs. These gains were partially offset by increased advertising, employee-related expenses, and warehousing and distribution costs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company expects to generate positive cash flows from operations and believes its cash on hand, cash flows from operations, and potential future credit facilities will be sufficient to meet its future working capital requirements, purchase commitments, and other financing needs. The company is not aware of any trends or uncertainties that could materially impact its liquidity in the foreseeable future.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1772016/000177201625000028/brbr-20241231.htm\" rel=\"nofollow\" target=\"_blank\">BELLRING BRANDS, INC. [ BRBR ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:9c82f88782326:0-bellring-brands-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 01:33:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_SSNdRnp:0",
            "title": "CORRECTION: Derivatives - New Strikes Stock Products 24/25",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NASDAQ NordicDerivative market information</p><p class=\"\">CORRECTION: Derivatives - New Strikes Stock Products 24/25</p><p class=\"\">CORRECTION: Due to wrong new strikes in the attached files.</p><p class=\"\">NASDAQ Derivatives Markets introduces new strikes from 2025-02-05.</p><p class=\"\">For further information concerning this exchange notice please contact ProductManagement, +46 8 405 69 70, or listingoperations@nasdaq.comhttps://view.news.eu.nasdaq.com/view?id=b10847d3f64320ba1b2535a40fc5fe1f8&amp;lang=en&amp;src=omxlink</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_SSNdRnp:0-correction-derivatives-new-strikes-stock-products-24-25/",
            "pub_date": "2025-02-05 01:33:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309097:0",
            "title": "Onto Innovation Poised to Report 'Solid' Q4 Results, Oppenheimer Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Onto Innovation  Q4 results, set for release Thursday, \"should be solid\" with consensus revenue at the midpoint of the company's 5% target range, Oppenheimer said in an earnings preview Tuesday. </p><p class=\"\">\"Onto is well-positioned with AI-focused Dragonfly, leading-edge Atlas, and rich R&amp;D pipeline,\" Oppenheimer said. </p><p class=\"\">The firm said that despite tariffs, \"chip wars\" and the Chinese startup DeepSeek that disrupted the US technology sector last week, \"Onto outperforms by over-indexing AI,\" with derisked exposure to China, a \"strong\" management and $900 million cash with no debt. </p><p class=\"\">Oppenheimer also said that Onto is \"structurally well-positioned for long-term growth,\" despite the tariff concerns this week that \"highlight persistent volatility.\"</p><p class=\"\">Oppenheimer has an outperform rating for the company with a $275 price target.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309097:0/",
            "pub_date": "2025-02-05 01:33:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309115:0",
            "title": "Update: Market Chatter: Grab Mulls Takeover of GoTo at $7 Billion Valuation; Shares Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(Updates to include stock price movement in the headline and the last paragraph and Grab's response to a request for comment in the third paragraph.)</p><p class=\"\">Grab Holdings  is considering a takeover of rival GoTo Group at a valuation of over $7 billion, Bloomberg News reported, citing people familiar with the matter. </p><p class=\"\">Grab is discussing an all-stock purchase valuing shares of GoTo at more than 100 Indonesian rupiah each, representing a roughly 20% premium over its current stock price, the people reportedly told Bloomberg. </p><p class=\"\">Grab declined to comment to MT Newswires. </p><p class=\"\">Shares of Grab Holdings were up more than 12% in recent trading. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309115:0/",
            "pub_date": "2025-02-05 01:33:52",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446602:0",
            "title": "Wheat Hits 12-week High",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Wheat increased to a 12-week high of 574.00 USd/Bu.</p><p class=\"\">Over the past 4 weeks, Wheat gained 6.05%, and in the last 12 months, it decreased 4.3%.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446602:0-wheat-hits-12-week-high/",
            "pub_date": "2025-02-05 01:35:04",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0XX:0",
            "title": "US Democrats push legislation to 'fight back' against Trump policies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Democratic U.S. congressional leaders will push legislation this week to \"prevent unlawful meddling\" by the newly created Department of Government Efficiency in the Treasury Department payroll system, Senate Democratic leader Chuck Schumer said on Tuesday.</p><p class=\"\">Billionaire <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/elon-musk/\" rel=\"nofollow\" target=\"_blank\">Elon Musk</a> chairs the DOGE group, which was tasked by President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> to identify fraud and waste in the government. Last week, the team gained access to the most sensitive payment systems at Treasury and, as Reuters reported, locked some employees out of their agency's computers.</p><p class=\"\">\"Whatever DOGE is doing, it is certainly not what democracy looks like, or has ever looked like in the grand history of this country, because democracy does not work in the shadows, democracy does not skirt the rule of law,\" Schumer said in a speech on the Senate floor. </p><p class=\"\">Schumer and House Democratic leader Hakeem Jeffries were set to hold a press conference on Tuesday afternoon on legislative proposals \"to fight back\" against the actions of the Trump administration. </p><p class=\"\">Schumer said the legislation would \"prevent everyone's records from being made available to a small group of people who can look at them at will, when this has always been kept secret and always been protected.\" </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0XX:0-us-democrats-push-legislation-to-fight-back-against-trump-policies/",
            "pub_date": "2025-02-05 01:27:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309111:0",
            "title": "SuperBuzz Extends Closing Of $750,000 Private Placement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SuperBuzz  on Tuesday said it received approval from the TSX Venture Exchange (TSXV) to extend its previously announced non-brokered private placement financing. </p><p class=\"\">The company said the private placement financing of special warrants, at $0.16 per special warrant for gross proceeds of up to $750,000, must now close by Feb. 17, for SPZ to be able to collect subscription agreements and funds from subscribers.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309111:0/",
            "pub_date": "2025-02-05 01:27:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV22K:0",
            "title": "EU wheat holds at three-week high on tariff relief",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Euronext wheat futures held around a three-week peak on Tuesday as the suspension of U.S. tariffs against Canada and Mexico along with a limited riposte by Beijing to U.S. levies on Chinese imports eased concerns about disruption to grain trade.</p><p class=\"\">Signs of reduced wheat availability in Russia and strength in corn prices also underpinned Euronext, though lagging French exports remained a curb.</p><p class=\"\">March wheat (BL2H5) on Paris-based Euronext was up 0.1% at 234.75 euros ($243.51) per metric ton by 1713 GMT. It earlier reached its highest since Jan. 13 at 235.50 euros, slightly above a previous three-week top from Monday.</p><p class=\"\">After news during Monday's session that U.S. President Donald Trump had agreed to postpone planned U.S. tariffs against <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/mexico/\" rel=\"nofollow\" target=\"_blank\">Mexico</a>, a similar delay agreed with Canada further removed the immediate risk of upheaval in trade flows.</p><p class=\"\">Washington did proceed on Tuesday with a new 10% tariff on all Chinese goods, but retaliatory tariffs unveiled by Beijing were seen as limited and crops were not among products targeted.</p><p class=\"\">\"Trade disputes and tariff wars are a great threat to commodities but at least the first Chinese response to U.S. tariffs is not focused on grains and soybeans,\" one German trader said.</p><p class=\"\">Uncertainty over U.S. tariff policy has taken attention from a backdrop of rising corn prices amid weather setbacks in South America, which could shift some feed demand towards wheat, Argus analyst Maxence Devillers said.</p><p class=\"\">Rising Russian prices, as exports from the world's biggest wheat supplier were slowing amid ebbing supply, were also lending support to Euronext.</p><p class=\"\">But at about $240 per ton free on board (FOB) for March shipment of 12.5% protein wheat, Russian prices early this week were nonetheless about $10 cheaper than west EU and Baltic origins, the German trader said.</p><p class=\"\">Russian and Argentine 11.5% wheat, meanwhile, were similarly priced at around $233-$236 a ton, he added.</p><p class=\"\">European Union soft wheat exports so far this season have reached 12.51 million tons, down 37% from a year earlier, European Commission data showed on Tuesday.</p><p class=\"\">EU exports have been curbed by low French shipments.</p><p class=\"\">\"As long as French exports are so far behind, Matif (Euronext) prices may stay below 240 euros,\" Devillers said.</p><p class=\"\">($1 = 0.9640 euros)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV22K:0-eu-wheat-holds-at-three-week-high-on-tariff-relief/",
            "pub_date": "2025-02-05 01:27:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009070:0",
            "title": "Canada's Export Stocks are Climbing Back — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Ryan Dezember</p><p class=\"\">Some of the hardest hit Canadian stocks are bouncing back from Monday's selloff following the country's 30-day tariff-truce with President Trump.</p><p class=\"\">Trump's proposal for 25% tariffs threatened to slam demand for Canadian exports, such as oil, lumber and potash, or at least make them more expensive across the U.S. border. With tariffs averted for now, traders are buying back into the companies that supply U.S. refineries, home builders and farmers, which are out-gaining the country's broader S&amp;P/TSX Composite Index today.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009070:0/",
            "pub_date": "2025-02-05 01:28:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}