{
    "data": [
        {
            "id": "DJN_DN20250204009176:0",
            "title": "Juniper Networks 4Q Revenue Set to Rise — Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Juniper Networks is scheduled to report earnings for the fourth quarter after the market closes on Tuesday. Here's what you need to know:</p><p class=\"\">PROFIT: The routers and switches equipment company is expected to post a net profit of $113.4 million, or 28 cents a share. This compares with a reported profit of $124.3 million, or 38 cents a share, for the year-ago period.</p><p class=\"\">ADJUSTED EARNINGS: Stripping out one-time items, the company's earnings per share are expected to come in at 57 cents, according to FactSet.</p><p class=\"\">REVENUE: Revenue is expected to rise to $1.39 billion, according to FactSet. This compares with reported revenue of $1.36 billion for the same period last year.</p><p class=\"\">The stock has fallen 10% over the past three months.</p><p class=\"\">WHAT TO WATCH:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Look for comments around the pending $14 billion deal with Hewlett Packard Enterprise for the company to acquire Juniper. Last week, the Justice Department sued to block the deal, which would create a combined company to potentially rival Cisco Systems, the current leader in wireless networking for large companies. Regulators said the tie-up would significantly reduce competition.</li><li class=\"listItem-bmN0_SHH\">Investors will want to know how HPE and Juniper will challenge the DoJ's lawsuit. The companies say the DoJ's claim that the WLAN market is composed of three primary players is \"disconnected from market realities.\" The company said it \"will vigorously defend against the Department of Justice's overreaching interpretation of antitrust laws and will demonstrate how this transaction will provide customers with greater innovation and choice, positively change the dynamics in the networking market by enhancing competition, and strengthen the backbone of U.S. networking infrastructure.\"</li><li class=\"listItem-bmN0_SHH\">See what the companies have to say about demand and where product orders stood in the fourth quarter. In the third quarter, Chief Executive Rami Rahim said Juniper saw particularly robust orders from its cloud customers in support of front-end and back-end AI networking initiatives.</li></ul><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009176:0/",
            "pub_date": "2025-02-05 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204002886:0",
            "title": "Amazon, King of Online Retail, Can't Seem to Make Its Physical Stores Work — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kate King</p><p class=\"\">Amazon.com, the largest e-commerce retailer in the U.S., is stumbling in its efforts to compete in the bricks-and-mortar world.</p><p class=\"\">The company in 2018 launched the Amazon Go convenience store, where customers can grab a latte, bagel or turkey sandwich and walk out without waiting in line to pay. Amazon charges them electronically.</p><p class=\"\">But with the Amazon Go store in Woodland Hills, Calif., closing this month, the retailer has shrunk its Go portfolio by about half since early 2023, to 16 stores in four states. Instead, Amazon is focusing on licensing its \"Just Walk Out\" technology to other retailers, while it focuses its bricks-and-mortar ambitions on grocery stores.</p><p class=\"\">This is hardly Amazon's only misfire in the physical-store universe. It has closed dozens of its other branded retail stores in recent years, including bookstores, fashion outlets and its \"4-star\" locations stocked with bestselling items from its website.</p><p class=\"\">After a decadelong experiment with bricks-and-mortar stores, Amazon's dominance online has yet to translate into a successful strategy for connecting with shoppers in the real world, retail brokers and landlords said.</p><p class=\"\">\"They keep testing these concepts thinking one of them is going to connect with the consumer in a big way,\" said Jeff Edison, chief executive of Phillips Edison &amp; Co., a real-estate investor that owns grocery-anchored shopping centers. \"But can you think of any examples where they've actually done the bricks-and-mortar retail well? I can't.\"</p><p class=\"\">Amazon Go stores were launched to develop technology that speeds up the buying process while saving on labor costs. They use cameras and sensors to track customer purchases instead of a traditional checkout counter.</p><p class=\"\">But reducing the number of employees available to help customers and giving priority to credit-card payments over cash limits sales and makes the shopping experience more cumbersome, said Nick Egelanian, president of retail-advisory firm SiteWorks Retail.</p><p class=\"\">\"I don't think they really understand retail,\" Egelanian said. \"Running warehouses and shipping stuff efficiently is not the same as greeting a customer and saying, 'May I help you?'\"</p><p class=\"\">An Amazon spokeswoman said Go store employees greet customers at the door, restock shelves and are available to answer questions.</p><p class=\"\">While certain locations work better than others, the company continues to invest in its Go stores, including a recent redesign of its suburban store in Mill Creek, Wash., where it added more items such as made-to-order pizza. Amazon also opened a new Go store in Bellevue, Wash., last summer.</p><p class=\"\">\"Amazon aims to provide customers outstanding selection, value, and convenience when shopping for groceries and everyday essentials both online and in physical stores,\" Amazon spokeswoman Jessica Martin said.</p><p class=\"\">And while Amazon is tops for online revenue, its sales at bricks-and-mortar stores, including Whole Foods Market, have grown annually since 2021 as well as in the first nine months of 2024, according to the company's financial filings. Net sales in the third quarter of 2024 topped $5.2 billion, compared with about $61.4 billion at Amazon's online store.</p><p class=\"\">But Amazon Go competes in a crowded field. There are more than 152,000 convenience stores in the U.S., according to industry group NACS, many of which also sell coffee, alcohol and freshly prepared food.</p><p class=\"\">Amazon seemed to hedge its bets on Go from the start, making sure it wasn't locked into locations long term.</p><p class=\"\">The company negotiated hard for short-term leases or those with early-exit provisions, said Ed Coury, senior managing director at retail-advisory firm RCS Real Estate Advisors, who worked on a deal to open a 4-Star location at the Westfield Topanga mall in California. He calls that a \"risk averse\" approach to real estate.</p><p class=\"\">Developing and testing its Just Walk Out technology capabilities was a driving reason behind Amazon's rollout of its Go concept, Coury said, and as the technology improved the stores were less necessary.</p><p class=\"\">Amazon now licenses its Just Walk Out technology to more than 200 retailers, including colleges and universities, sports arenas, hospitals and airports. This allows it to profit by marketing the technology without the cost burden of operating a store.</p><p class=\"\">\"It was an investment well spent in developing technology,\" Coury said. \"But the growth plans that they had for that brand are over.\"</p><p class=\"\">Amazon's bricks-and-mortar retail strategy now seems to be focused on its grocery portfolio.</p><p class=\"\">The company acquired Whole Foods Market for roughly $13.5 billion in 2017 and last week announced that the grocer's chief executive, Jason Buechel, is now in charge of all grocery operations for Amazon, including its Fresh and Go stores.</p><p class=\"\">Amazon is moving forward with plans to open more locations for Amazon Fresh, which offers a more mass-market selection with often cheaper prices than upscale Whole Foods, after pausing expansion to overhaul the in-store experience. The stores have replaced its Just Walk Out technology with \"dash carts,\" where shoppers scan items before placing them in the cart.</p><p class=\"\">Amazon's changes to its Fresh stores have improved the shopping experience there, Egelanian said, though he feels the banner is still searching for a niche in the crowded grocery landscape.</p><p class=\"\">Martin said that \"providing customers with groceries and everyday essentials online and in store is a top priority for Amazon, and we plan to continue investing and innovating for customers in this area.\"</p><p class=\"\">Write to Kate King at kate.king@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204002886:0/",
            "pub_date": "2025-02-05 01:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009185:0",
            "title": "Gold Keeps Hitting Record Highs As Tariffs Create More Market Drama — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Paul R. La Monica</p><p class=\"\">Worries about tariffs are spooking many investors. But not gold bulls. Fans of the yellow metal are probably relishing all the uncertainty that President Donald Trump's tariff threats are creating.</p><p class=\"\">Gold prices are up nearly 9% already this year At just under $2,900 an ounce, the yellow metal is at a record high. And that follows a nearly 30% gain for gold in 2024.</p><p class=\"\">Investors in mining stocks are doing even better. The VanEck Gold Miners exchange-traded fund, which has big stakes in Newmont Corp., Agnico Eagle Mines and Barrick Gold, has soared 18% so far in 2025.</p><p class=\"\">Should investors be a little wary after such a big run this year on top of 2024's massive gains? Of course. That would be prudent. But it's worth noting that the mining stocks could have more room to run if gold prices keep climbing. And that seems very plausible.</p><p class=\"\">It appears that both foreign central banks and retail investors are fueling the rally. Poland, Turkey, India, and China have been big buyers, according to data from late last year from the World Gold Council.</p><p class=\"\">\"Emerging market banks are very committed to gold and well positioned to purchase more. Strategically, they will continue to be buyers,\" said Joe Cavatoni, senior markets strategist with the World Gold Council, in an interview with Barron's.</p><p class=\"\">It's all about the Trump trade war. The continued surge in gold is a bit unusual since it's happening at a time when the U.S. dollar is also strengthening.</p><p class=\"\">Frank Watson, a markets analyst for Kinesis Money, pointed out that a surging greenback is \"normally a bearish element for dollar-denominated gold prices,\" but he added that \"gold's safe haven appeal remains undiminished amid uncertainty over the economic and inflationary effects of expected US trade tariffs.\" In other words, Trump trade policies may trump the usual impact a strong dollar has on gold.</p><p class=\"\">Silver prices have been climbing too, rising about 13% so far this year. Alex Ebkarian, chief operating officer of physical precious metals dealer Allegiance Gold, said in an email to Barron's that the prices of both metals should keep climbing due to the market uncertainty.</p><p class=\"\">\"In a high-risk environment, the appeal of physical gold and silver becomes even more pronounced, as they eliminate counterparty risk and provide a reliable store of value,\" he said, adding that the recent move by JPMorgan Chase to deliver about $4 billion worth in gold futures is \"an apparent hedge against potential trade disruptions.\"</p><p class=\"\">So how much higher could gold go? Michael Arone, chief investment strategist for State Street's SPDR Business, thinks gold could top $3,000 an ounce sometime this year due to all that's happening on the worldwide landscape.</p><p class=\"\">\"Geopolitical risks and structural transitions in monetary and fiscal policies should also boost the prospects for gold,\" Arone wrote. \"Central bank purchases throughout the year will likely continue to support gold's price. All that could finally unleash some pent up investment demand from investors chasing last year's record gold prices.\"</p><p class=\"\">That should be good news as well for the mining stocks, which despite their big run already this year, remain reasonably valued. The VanEck Gold Miners ETF is trading for just 12 times 2025 earnings estimates, lower than its 5-year average of 15. It's also trading at about a price-to-earnings ratio that is 45% below the S&amp;P 500, much steeper than its usual 20% discount to the broader market.</p><p class=\"\">Write to Paul R. La Monica at paul.lamonica@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009185:0/",
            "pub_date": "2025-02-05 01:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009180:0",
            "title": "Ball Prepares for Tariffs, Which CEO Says Would Hurt Demand — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009180:0/",
            "pub_date": "2025-02-05 01:52:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009186:0",
            "title": "STOXX Europe 600 Index Ends 0.22% Higher at 536.04 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 600 Index is up 1.19 points or 0.22% today to 536.04</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Third highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its record close of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 52-week high of 539.53 hit Friday, Jan 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 11.02% from its 52-week low of 482.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 10.12% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.65% from its 2025 closing high of 539.53 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 5.48% from its 2025 closing low of 508.19 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 28.42 points or 5.60%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009186:0-stoxx-europe-600-index-ends-0-22-higher-at-536-04-data-talk/",
            "pub_date": "2025-02-05 01:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009188:0",
            "title": "FTSE 100 Index Ends 0.15% Lower at 8570.77 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The FTSE 100 Index is down 12.79 points or 0.15% today to 8570.77</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Down for two consecutive trading days</li><li class=\"listItem-bmN0_SHH\">Down 103.19 points or 1.19% over the last two trading days</li><li class=\"listItem-bmN0_SHH\">Largest two day point and percentage decline since Friday, Dec. 20, 2024</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its record close of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 35.23% since the pre-Brexit vote level of 6338.10 hit Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 52-week high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 14.09% from its 52-week low of 7512.28 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 11.58% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.19% from its 2025 closing high of 8673.96 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 4.50% from its 2025 closing low of 8201.54 hit Tuesday, Jan. 14, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 397.75 points or 4.87%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009188:0-ftse-100-index-ends-0-15-lower-at-8570-77-data-talk/",
            "pub_date": "2025-02-05 01:53:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:38f07d3d2865a:0",
            "title": "ESTEE LAUDER COMPANIES INC SEC 10-Q Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Estée Lauder Companies Inc., a global leader in prestige beauty, has released its Form 10-Q report for the second quarter of fiscal year 2024. The report highlights the company's financial performance and operational activities during the three months ended December 31, 2024. Despite facing challenges in key markets, the company is actively implementing strategic initiatives to drive future growth and operational efficiency.</p> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Sales</strong>: $4,004 million for the three months ended December 31, 2024, reflecting a decrease from $4,279 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Gross Profit</strong>: $3,047 million for the three months ended December 31, 2024, compared to $3,125 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operating Income (Loss)</strong>: $(580) million for the three months ended December 31, 2024, a significant decline from $574 million in the same period of 2023, primarily due to impairment charges.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc.</strong>: $(590) million for the three months ended December 31, 2024, compared to $313 million in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc. per Common Share - Basic</strong>: $(1.64) for the three months ended December 31, 2024, compared to $0.87 in the same period of 2023.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Net Earnings (Loss) Attributable to The Estée Lauder Companies Inc. per Common Share - Diluted</strong>: $(1.64) for the three months ended December 31, 2024, compared to $0.87 in the same period of 2023.</li></ul> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Business Highlights</strong></p> <ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Revenue Segments</strong>: The Estée Lauder Companies Inc. reported revenue across various product categories, including skin care, makeup, fragrance, and hair care. The company experienced a decline in revenue in certain segments due to lower-than-expected growth in key geographic regions.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Geographical Performance</strong>: The company faced challenges in key geographic regions, particularly in mainland China, Asia travel retail, and Hong Kong SAR, which impacted the performance of brands like TOM FORD and Too Faced.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">New Product Launches</strong>: During the reporting period, the company focused on launching new products under its existing brands to drive growth and capture market share in competitive segments.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Future Outlook</strong>: The company is implementing the Profit Recovery and Growth Plan (PRGP) to rebuild profit margins and enhance operational efficiency. This plan includes restructuring efforts aimed at reducing costs and improving gross margins.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Restructuring Initiatives</strong>: The company announced a restructuring program as part of the PRGP, which involves reorganization and rightsizing efforts, with an estimated reduction of 5,800 to 7,000 positions globally. This initiative is expected to be completed by the end of fiscal 2027.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Operational Efficiency</strong>: The company is focusing on optimizing its supply chain and procurement processes to enhance efficiency and reduce waste, aiming for a zero-waste approach to minimize excess inventory.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Digital Transformation</strong>: Efforts are underway to reorganize and right-size the company's technology functions to create a more agile and effective digital organization, supporting both internal and commercial capabilities.</li></ul><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1001250/000100125025000011/el-20241231.htm\" rel=\"nofollow\" target=\"_blank\">ESTEE LAUDER COMPANIES INC [ EL ] - 10-Q - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:38f07d3d2865a:0-estee-lauder-companies-inc-sec-10-q-report/",
            "pub_date": "2025-02-05 01:53:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009191:0",
            "title": "STOXX Europe 50 Index Ends 0.11% Higher at 4577.55 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The STOXX Europe 50 Index is up 5.12 points or 0.11% today to 4577.55</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 13 of the past 15 trading days</li><li class=\"listItem-bmN0_SHH\">Off 11.69% from its record close of 5183.24 hit Tuesday, May 2, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 52-week high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 9.02% from its 52-week low of 4198.67 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 7.86% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.66% from its 2025 closing high of 4607.74 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 6.06% from its 2025 closing low of 4316.04 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 268.92 points or 6.24%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009191:0-stoxx-europe-50-index-ends-0-11-higher-at-4577-55-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009192:0",
            "title": "EURO STOXX 50 Index Ends 0.89% Higher at 5264.59 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The EURO STOXX 50 Index is up 46.68 points or 0.89% today to 5264.59</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up 14 of the past 16 trading days</li><li class=\"listItem-bmN0_SHH\">Off 3.66% from its record close of 5464.43 hit Monday, March 6, 2000</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the third highest this year</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 52-week high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 15.16% from its 52-week low of 4571.60 hit Monday, Aug. 5, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 12.23% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.42% from its 2025 closing high of 5286.87 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.07% from its 2025 closing low of 4871.45 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 368.61 points or 7.53%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009192:0-euro-stoxx-50-index-ends-0-89-higher-at-5264-59-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009189:0",
            "title": "DAX Ends 0.36% Higher at 21505.70 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The DAX is up 77.46 points or 0.36% today to 21505.70</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth highest close in history</li><li class=\"listItem-bmN0_SHH\">Up five of the past six trading days</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its record close of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fourth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 52-week high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 27.40% from its 52-week low of 16880.83 hit Tuesday, Feb. 13, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 26.26% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 1.04% from its 2025 closing high of 21732.05 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.04% from its 2025 closing low of 19906.08 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 1596.56 points or 8.02%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009189:0-dax-ends-0-36-higher-at-21505-70-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009190:0",
            "title": "CAC 40 Index Ends 0.66% Higher at 7906.40 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The CAC 40 Index is up 51.48 points or 0.66% today to 7906.40</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Up three of the past four trading days</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its record close of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Today's closing value is the fifth highest this year</li><li class=\"listItem-bmN0_SHH\">Off 4.05% from its 52-week high of 8239.99 hit Wednesday, May 15, 2024</li><li class=\"listItem-bmN0_SHH\">Up 10.89% from its 52-week low of 7130.04 hit Tuesday, Aug. 6, 2024</li><li class=\"listItem-bmN0_SHH\">Rose 3.50% from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Off 0.55% from its 2025 closing high of 7950.17 hit Friday, Jan. 31, 2025</li><li class=\"listItem-bmN0_SHH\">Up 8.57% from its 2025 closing low of 7282.22 hit Friday, Jan. 3, 2025</li><li class=\"listItem-bmN0_SHH\">Year-to-date it is up 525.66 points or 7.12%</li></ul><p class=\"\">Source: Dow Jones Market Data, FactSet</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009190:0-cac-40-index-ends-0-66-higher-at-7906-40-data-talk/",
            "pub_date": "2025-02-05 01:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NL:0",
            "title": "Coinbase urges US regulators to clear path for banks to offer crypto services",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Coinbase Global  on Tuesday renewed its call for U.S. banking regulators to clarify or revise their position on banks offering cryptocurrency services as well as potentially doing tie-ups with companies in the digital assets sector. </p><p class=\"\">The crypto exchange's move comes amid a broader industry push to lobby lawmakers for a regulatory framework to support the sector's growth. Most traditional U.S. banks have steered clear of digital asset firms, citing lack of regulatory clarity. </p><p class=\"\">\"For the last several years, U.S. bank regulators have unilaterally and undemocratically barred banks from offering crypto services,\" Coinbase Chief Policy Officer Faryar Shirzad said on social media platform X.</p><p class=\"\">The industry had donated millions of dollars to back Donald Trump's return to the White House, as it sought making cryptocurrency regulation a top priority for the new administration after years of enforcement actions that companies have criticized as overreach. </p><p class=\"\">Shirzad also sent a letter to top U.S. banking regulators, including, the Office of the Comptroller of the Currency (OCC), the Federal Reserve and the Federal Deposit Insurance Corporation (FDIC), urging them to permit banks to offer services tied to the crypto sector. </p><p class=\"\">The OCC declined to comment, and the Fed and FDIC did not immediately respond to Reuters' requests for comments. </p><p class=\"\">While crypto companies have alleged that U.S. bank supervisors have made a concerted effort to choke them off the traditional financial system, regulators have denied the claim. </p><p class=\"\">Last month, the U.S. Securities and Exchange Commission's new leadership created a task force to develop a regulatory framework for crypto assets.</p><p class=\"\">Trump, who has promised to be a \"crypto president\", has also named former PayPal  executive David Sacks as his \"White House A.I. &amp; Crypto Czar\". </p><p class=\"\">The administration is expected to reshape U.S. policy on digital currency, but U.S. bankers have so far remained cautious on cryptocurrencies.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NL:0-coinbase-urges-us-regulators-to-clear-path-for-banks-to-offer-crypto-services/",
            "pub_date": "2025-02-05 01:55:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309124:0",
            "title": "CRTC Decision on Whether Big 3 Will be Able to Resell Each Other's Networks Delayed, Says National Bank",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The final CRTC Decision on Big 3 telecoms access to Third Party Internet Access has been pushed to the summer, notes National Bank. </p><p class=\"\">Analyst Adam Shine writes that, \"Less than a week before the Super Bowl, the CRTC opted on Monday to punt its decision by several months on whether to allow the Big 3 to resell each other's networks.\"</p><p class=\"\">Shine also notes that despite many TPIA disclosures by the CRTC over the past 15 months, critical elements remain outstanding - what will final rates look like and who exactly will be able to participate in the new TPIA regime.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309124:0/",
            "pub_date": "2025-02-05 01:46:35",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250204007381:0",
            "title": "Spotify's cites 'innovative' culture, video podcast success in user boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Steve Gelsi</p><p class=\"\">User growth of 12% powers revenue past estimates</p><p class=\"\">Spotify Technology S.A. reported a fourth-quarter profit as the music streaming service's monthly active users climbed by double-digits over the year-ago period, sending shares of the company up sharply higher in premarket trading.</p><p class=\"\">Spotify stock (SPOT) was up 9.6% in early trading.</p><p class=\"\">Spotify said it expects to add 3 million net new monthly active users (MAUs) to 678 million by the end of the first quarter. That's a little bit above the FactSet consensus estimate of 677 million.</p><p class=\"\">Spotify ended the fourth quarter with about 675 million monthly active users, up 12% from the year-ago period and ahead of the previous  quarter by 5%.</p><p class=\"\">Spotify's monthly active user figure of 675 million also beat the Wall Street analyst consensus estimate of 664 million.</p><p class=\"\">Spotify also swung to a profit of  EUR1.76 a share from a loss of EUR0.36 in the year-ago quarter. The company was expected to earn  EUR1.99 a share.</p><p class=\"\">The company said its fourth-quarter revenue rose to EUR4.24 billion, ahead of the FactSet consensus estimate of  EUR 4.15 billion.</p><p class=\"\">Looking ahead, Spotify projected first-quarter revenue of EUR4.2 billion, slightly below the analyst estimate of just under EUR4.3 billion.</p><p class=\"\">-Steve Gelsi</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250204007381:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009163:0",
            "title": "PepsiCo Sees More Sluggishness in North American Trends — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PepsiCo turned in mixed results for 4Q as strong international growth was offset by softer-than-expected results in North America, Edward Jones analyst Brittany Quatrochi says in a research note. Trends in North America are still sluggish as consumers continue to seek out value, which has been cutting into salty snack sales, the analyst says. The company is also still recovering from a product recall at Quaker, she says. Given its challenges with the U.S. consumer, PepsiCo is guiding for 2025 earnings growth to be weaker than its long-term outlook, the analyst says. Shares fall 4.4% to $143.71. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009163:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009165:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1247 ET - PepsiCo turned in mixed results for 4Q as strong international growth was offset by softer-than-expected results in North America, Edward Jones analyst Brittany Quatrochi says in a research note. Trends in North America are still sluggish as consumers continue to seek out value, which has been cutting into salty snack sales, the analyst says. The company is also still recovering from a product recall at Quaker, she says. Given its challenges with the U.S. consumer, PepsiCo is guiding for 2025 earnings growth to be weaker than its long-term outlook, the analyst says. Shares fall 4.4% to $143.71. (dean.seal@wsj.com)</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p><p class=\"\">1216 ET - The automotive industry should pursue partnerships over traditional mergers and acquisitions, Bain &amp; Company says in a report. Companies have largely held off on M&amp;A in 2024 amid uncertainty and mounting cost pressures, with deal volumes falling about 60% during the first three quarters of the year, the management-consultancy firm says. But alliances could offer a solution, it notes. \"Activity is likely to pick up as companies acknowledge that they can't go it alone much longer,\" Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1216 ET - PayPal is renegotiating deals with large merchants of its Braintree subsidiary and expects to see a resulting 5 percentage point headwind to revenue growth in 2025, CFO Jamie Miller says on a call with analysts. The company is shifting away from some of the volume from the unbranded payment processing unit, which should prove to be accretive to transaction margin dollars, a measure of profitability, according to Miller. \"Over the next few quarters, we will continue to work through renegotiations, at which point we should reach a new baseline to drive faster volume and revenue growth,\" the CFO says. (dean.seal@wsj.com)</p><p class=\"\">1132 ET - JBS, the world's largest meatpacker, says it's investing $200 million in two of its largest U.S. beef plants at a time when meatpackers are broadly struggling to make a profit because of a lack of cattle, driving up costs. The company said $150 million will go to its Cactus, Texas, plant to improve the part of the facility where carcasses are processed into primal cuts and expand its ground beef room. JBS says it will put $50 million toward its Greeley, Colo., plant to build a new distribution center. JBS said the investments will improve efficiencies and could increase production capacity at the two plants that both have the capability to slaughter about 6,000 cattle a day. \"We believe now is the time to invest in the United States,\" said Wesley Batista Filho, JBS' U.S. CEO. (patrick.thomas@wsj.com)</p><p class=\"\">1130 ET - PayPal saw total payments volumes for purchases through its Buy Now, Pay Later option jump 21% in 2024 to $33 billion, CEO Alex Chriss says on a call with analysts. Customers that use the deferred payment option spend 30% more on average, and merchants have seen their sales go up after adding messaging around the option to their websites, the CEO says. The company sees Buy Now, Pay Later as a means to expand wallet share and plans to do a lot more with the option over the next year, Chriss says. (dean.seal@wsj.com)</p><p class=\"\">1108 ET - PayPal's branded checkout button saw a 6% jump in global volumes on a constant-currency basis in fiscal 4Q, CFO Jamie Miller says on a call with analysts. That's an acceleration of 50 basis points from the prior quarter and driven by a healthy spending environment and exposure in specific verticals, Miller says. PayPal made branded checkout its number one priority in 2024, with a big focus on improving the customer experience, according to CEO Alex Chriss. So far, the company feels good about the desktop experience for branded checkout, but sees \"gaps\" in the mobile experience, Chriss tells analysts. (dean.seal@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1050 ET - Generative artificial intelligence is here to stay, and set to have a profound impact on the mergers and acquisitions market, Bain &amp; Company says in a report. \"We expect that companies that master the use of generative AI in M&amp;A over the next five years will identify targets faster than their competitors,\" the management-consulting firm says. About one in five surveyed companies currently uses generative AI in M&amp;A processes, and more than half expect to integrate it into their dealmaking by 2027, according to the report. Late followers to adopt AI will be outbid for good deals and find themselves staying too long in the process for bad deals, Bain &amp; Company says. (nina.kienle@wsj.com)</p><p class=\"\">1044 ET - Publicis' guidance for 2025 and the company's track record of being conservative in its initial outlook leave room for upgrades, CFRA's Danny Yeo Sze Wai says in a research note. The French advertising group ended the year with strong momentum in the fourth quarter, when organic net revenue growth of 6.3% beat expectations. \"[Publicis] is targeting 4%-5% of organic growth in net revenue for 2025, similar to its guidance for 2024. However, we still anticipate upside potential given its history of being conservative in terms of providing future projections,\" the analyst says. Shares in Publicis rise 1.6%. (adria.calatayud@wsj.com)</p><p class=\"\">1042 ET - Grain merchant ADM says as part of its plan to cut costs it could shutter or divest facilities that are in need of repair, have a history of poor performance or are located in areas with excess capacity. CEO Juan Luciano said on a call with investors that the company has identified about $2 billion worth of opportunities. The company is facing pressure from low crop prices and falling profit margins in its oilseed processing business. \"We will execute on this over time,\" Luciano said. (patrick.thomas@wsj.com)</p><p class=\"\">1041 ET - Light-vehicle sales in January indicate Canadian consumers are unperturbed about the economic uncertainty circling over President Trump's trade policy. Research firm DesRosiers Automotive Consultants says its data indicate vehicle sales in January rose 3.1% from the same year-ago month, and in terms of volumes matching the best January ever recorded, back in 2018. On a seasonally-adjusted basis, light-vehicle sales came at a \"strapping\" 2.15 million, DesRosiers says. The firm adds it's difficult to put January's performance in context, given Trump's tariff threat. As a result, DesRosiers says it's hard to discern whether strong sales were the result of fears over sharply higher car prices, or a sign of solid domestic demand. (paul.vieira@wsj.com; @paulvieira)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009165:0/",
            "pub_date": "2025-02-05 01:47:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309119:0",
            "title": "GlucoTrack Prices $3 Million Public Offering; Shares Fall",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">GlucoTrack  said Tuesday it has priced a \"best efforts\" public offering of about 2.6 million shares at $1.15 a share to raise some $3.0 million. </p><p class=\"\">The offering, with Dawson James Securities as the placement agent, is expected to close Wednesday, the medical technology company said. </p><p class=\"\">The shares were down over 7% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309119:0/",
            "pub_date": "2025-02-05 01:47:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309106:0",
            "title": "Royal Caribbean's Forward Bookings, Yield Growth to Support Improved Cash Flow, Credit Measures, S&P Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Royal Caribbean Group's  strong forward bookings, higher pricing, and moderate yield growth for 2025 are expected to support cash flow growth and enhance the company's credit measures, S&amp;P Global Ratings said in a Tuesday note. </p><p class=\"\">\"We believe Royal has sold more than two-thirds of its capacity for 2025, which provides good forward revenue and cash flow visibility,\" S&amp;P said. </p><p class=\"\">The firm noted that the company's current booked position is in line with prior years but at higher average prices per day, with the premium over last year widening since its Q3 earnings call. </p><p class=\"\">Investments in new ships and private destinations are also driving stronger bookings, according to the note. </p><p class=\"\">While moderate yield growth in 2025 is expected to support continued revenue gains, S&amp;P pointed out that a potential economic downturn could weigh on future bookings. </p><p class=\"\">However, the company has \"sufficient cushion\" to withstand a moderate to severe recession. With a strong cash flow base and a moderate ship delivery schedule, Royal is positioned to continue reducing leverage, the ratings agency added. </p><p class=\"\">S&amp;P upgraded Royal Caribbean Group's rating to BBB- from BB+, with a stable outlook.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309106:0/",
            "pub_date": "2025-02-05 01:47:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1qPLFR:0",
            "title": "Georgia Access Reaches Historic Enrollment Milestone in First Year as a State-Based Exchange",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">MOUNTAIN VIEW, Calif., Feb.  04, 2025  (GLOBE NEWSWIRE) — GetInsured, a leading provider of health insurance technology and consumer assistance solutions, is pleased to announce the resounding success of Georgia Access following the 2025 Open Enrollment Period. This state-based exchange (SBE), launched in partnership with the Georgia Office of Insurance and Safety Fire Commissioner, has exceeded expectations, setting new benchmarks for enrollment and innovation. As the 2025 Open Enrollment Period concludes, Georgia Access’s performance highlights the value of SBEs in expanding health coverage and improving consumer experiences.</p><p class=\"\">During its first Open Enrollment Period, Georgia Access successfully provided health coverage to over 1.5 million Georgians, representing an impressive nearly 15.5% increase from the state's previous enrollment under the Federally Facilitated Marketplace (FFM) on Healthcare.gov. This remarkable growth highlights the impact of transitioning to a fully autonomous state-based exchange, demonstrating both the strength of a state-led approach and the effectiveness of the GetInsured platform in expanding access to affordable health coverage. At the end of its inaugural year, Georgia Access is now the second-largest SBE in the country.</p><p class=\"\">Georgia Access exceeded expectations and made history with its innovative launch, becoming the first state-based exchange to fully leverage Enhanced Direct Enrollment (EDE) technology and advanced AI tools. Approximately 70% of all Georgia Access consumers or their agents used an EDE partner to enroll in coverage. Additionally, over the course of Open Enrollment, more than 17,300 licensed and certified agents participated in the Exchange; with nearly 80% of Georgia consumers received assistance from an agent. This achievement highlights the value of local expertise, proving that Georgians are uniquely equipped to serve their own communities. The platform’s success underscores its strength and commitment to delivering a truly consumer-first experience.</p><p class=\"\">“Georgia Access exemplifies the transformative power of technology combined with an unwavering dedication to uplifting and serving the community,” said Chini Krishnan, CEO of GetInsured. “Through close collaboration with the state of Georgia and our partners, we’ve delivered a platform that not only meets the immediate needs of Georgians but also sets a new standard for SBEs nationwide.”</p><p class=\"\">Georgia Access is the first SBE to fully leverage Enhanced Direct Enrollment (EDE) technology, streamlining the enrollment process for consumers and enabling them to seamlessly compare and select plans. The platform’s robust performance is further enhanced by the Interactive Virtual Agent (IVA), which provides 24/7 assistance for routine inquiries. Georgia is one of the first states to integrate AI tools like IVA into their enrollment platform and ensure consumers receive timely and efficient support while maintaining high standards of security and privacy. </p><p class=\"\">For more complex needs, an integrated contact center staffed with trained agents offers comprehensive support, ensuring every Georgian has access to the help they need. This open enrollment period, the contact center fielded more than 300,00 calls with nearly 95% of all consumer issues being resolved during the first call to the contact center. </p><p class=\"\">“The transition to Georgia’s unique SBE model was an ambitious undertaking, but GetInsured’s people, technology, and operational expertise have proven critical to its success,” said Cheryl Gardner, Executive Director of Georgia Access. “The successful completion of Open Enrollment underscores our mission to provide simple and accessible pathways to health coverage. With GetInsured’s support, we have made significant strides toward ensuring that more Georgians can secure affordable health insurance, setting a new standard for SBEs.”</p><p class=\"\">The success of Georgia Access is a testament to the collaborative partnership between GetInsured, the Georgia Office of Insurance and Safety Fire Commissioner, and other key partners, including insurance carriers and EDE partners. Not only have their combined efforts created a consumer-centric platform that simplifies the path to health coverage, but they also have established a model for other states to follow, positioning Georgia Access as a leader in SBE innovation. </p><p class=\"\">With its innovative tools and reliable service, Georgia Access serves as a model for other states seeking to take their exchanges to the next level.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GetInsured: </strong>GetInsured is a leading technology provider for state-based health insurance exchanges, offering an ACA-compliant cloud-based SaaS technology platform and integrated consumer assistance center operations. Our platform empowers states to efficiently run their exchanges, achieve cost savings, and have greater autonomy over their insurance markets, contributing to broader health reform goals. With a trusted track record, GetInsured serves as a technology partner for Georgia, Pennsylvania, New Jersey, Nevada, Virginia, Minnesota, Idaho, and Washington, delivering exceptional service and seamless interactions for agents, brokers, assisters, and consumers alike. Looking ahead, GetInsured is proud to partner with New Mexico and Illinois to launch their state-based exchanges for plan year 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Georgia Access: </strong>Georgia Access, the new State-based Exchange in Georgia, is a division of the Office of Commissioner of Insurance and Safety Fire. The mission of the Office of Commissioner of Insurance and Safety Fire is to protect Georgia families by providing access to vital insurance products and safe buildings through fair regulation that creates economic opportunities for all Georgians.</p><p class=\"\">Marissa Schwartz</p><p class=\"\">GetInsured</p><p class=\"\">9255958363</p><p class=\"\">marissa.schwartz@getinsured.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1qPLFR:0-georgia-access-reaches-historic-enrollment-milestone-in-first-year-as-a-state-based-exchange/",
            "pub_date": "2025-02-05 01:48:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009167:0",
            "title": "Grab Holdings Raised to Buy From Hold by HSBC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009167:0/",
            "pub_date": "2025-02-05 01:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1RR:0",
            "title": "JPMorgan hires rival Goldman executive for its business services unit, memo says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JPMorgan Chase &amp; Co  has hired Goldman Sachs  executive Jonathan Slaughter to join its business services unit within its investment bank, according to a memo seen by Reuters on Tuesday.</p><p class=\"\">Slaughter will be tasked with bolstering the bank's offerings to business services clients across Europe, the Middle East and Africa, and will be based in London when he arrives at JP Morgan later this spring, per the memo.</p><p class=\"\">He has been at Goldman since 2021, and most recently led the bank's business services unit covering the North America region. </p><p class=\"\">Prior to that, Slaughter spent 15 years at Rothschild &amp; Co in various roles in London and New York. While in London, he was seconded for a time to the UK panel on takeovers and mergers, the memo added.</p><p class=\"\">At JP Morgan, Slaughter will report to Dana Weinstein, the global head of business services.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1RR:0-jpmorgan-hires-rival-goldman-executive-for-its-business-services-unit-memo-says/",
            "pub_date": "2025-02-05 01:49:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309117:0",
            "title": "McDonald's 2025 Outlook Likely Modest Amid Limited Earnings Growth, FX Headwinds, Oppenheimer Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">McDonald's  outlook for 2025 is likely to be modest, with limited earnings growth potential and foreign exchange headwinds, Oppenheimer said in a note Tuesday. </p><p class=\"\">Ahead of McDonald's Q4 earnings release on Feb. 10, Oppenheimer analysts said they re-evaluated their Perform rating, seeking reasons for a more optimistic 2025 outlook. It concluded that current market expectations for 2025, including a projected 2.7% increase in US same-store sales, are reasonable and that it does not foresee \"a new path for earnings upside,\" the report said. </p><p class=\"\">Oppenheimer projects the fast-food giant's 2025 earnings per share at $12.12, below the consensus of $12.40, mainly due to foreign exchange impacts. While global same-store sales and Earnings Before Interest and Taxes, or EBIT margins are in line, \"we struggle to identify the [same-store sales] and margin upside required to take a more bullish stance on shares,\" Oppenheimer said. </p><p class=\"\">McDonald's launched the \"McValue\" platform with a focus on its $5 meal deal, but the firm suggests its impact on sales growth may be limited, especially in the second half of 2025, Oppenheimer said, adding that it sees more attractive growth opportunities in the restaurant sector with Yum Brands. </p><p class=\"\">Oppenheimer forecasts Q4 EPS of $2.81, slightly below the Wall Street's $2.84, with global same-store sales estimated at -0.4%, and revised 2025 and 2026 EPS estimates to $12.12 and $13.09, both below the Street's forecasts of $12.40 and $13.43, the report said. </p><p class=\"\">Oppenheimer reiterated its perform rating on McDonald's.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309117:0/",
            "pub_date": "2025-02-05 01:41:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1R4:0",
            "title": "US energy firms rise as Trump set to reimpose 'maximum pressure' on Iran",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** S&amp;P 500 Energy index  rises 2.1% as oil prices pare earlier losses </p><p class=\"\">** Brent crude futures  up 0.4% at $76.29 per barrel</p><p class=\"\">** U.S. West Texas Intermediate crude futures  down 0.4% at $72.81 a barrel. It fell more than 3% earlier in the session to its lowest since late December, amid trade war fears between United States and China</p><p class=\"\">** Oil rose after an official said U.S. President Donald Trump plans to restore his \"maximum pressure\" campaign on Iran in bid to drive down Iranian oil exports to zero, which offset some weakness from tariff drama between Washington and Beijing</p><p class=\"\">** Shares of oil and gas majors Exxon Mobil  up 2.8% and Chevron  up 2.6%</p><p class=\"\">** Phillips 66 , Valero Energy , APA Corp  and Marathon Petroleum  up between 4.2% and 7%; among top pct. gainers on energy index</p><p class=\"\">** Oilfield services firms Halliburton  and SLB  up 3% and 2.8%, respectively</p><p class=\"\">** Refiners PBF Energy  and HF Sinclair  up 7.8% and 5.9%, respectively</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1R4:0-us-energy-firms-rise-as-trump-set-to-reimpose-maximum-pressure-on-iran/",
            "pub_date": "2025-02-05 01:42:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1NT:0",
            "title": "S&P 500 gains on energy boost; Trump-Xi talks in focus",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">PepsiCo down after forecasting annual profit below estimates</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Merck falls on dour 2025 forecast</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Indexes up: Dow 0.08%, S&amp;P 500 0.59%, Nasdaq 1.16%</li></ul></span></div><span><p class=\"\">        The S&amp;P 500 climbed on Tuesday, aided by energy stocks, while investors focused on upcoming talks between U.S. President Donald Trump and his Chinese counterpart Xi Jinping after Beijing imposed retaliatory tariffs.  </p><p class=\"\">    Seven of the 11 S&amp;P 500 sectors traded higher, with energy stocks  leading the gains with a 2% rise, paring earlier losses.  </p><p class=\"\">    Trump and Xi were set to talk later in the day, White House trade adviser Peter Navarro said at a Politico Live event, as new 10% tariffs on Chinese imports took effect, which China countered with levies on U.S. goods.  </p><p class=\"\">Trump had said over the weekend that he would impose a 25% tariff on goods from Mexico and Canada, but agreed to a 30-day pause on Monday, in return for border and crime concessions from both countries.</p><p class=\"\">    Megacaps also rose, aiding a recovery in indexes from a tepid start to the session. Alphabet  was up 1.6% ahead of its quarterly results, which are due after markets close, while Nvidia  advanced 2.5%.   </p><p class=\"\">        Palantir  jumped 23.7% after the data analytics company forecast first-quarter and annual revenue above Wall Street estimates.</p><p class=\"\">    \"The fundamentals of the market are still solid and earnings growth is great, but every time the President (Trump) speaks and says he's going to do something, the market reacts drastically,\" said Paul Stanley, chief investment officer, Granite Bay Wealth Management.  </p><p class=\"\">    \"Palantir just had a great earnings report, and everybody reacts to those big public companies right now and thinks that it's going to have the same impact on all other companies.\"  </p><p class=\"\">        At 11:55 a.m. ET, the Dow Jones Industrial Average  rose 36.97 points, or 0.08%, to 44,458.88, the S&amp;P 500  gained 35.15 points, or 0.59%, to 6,029.72, and the Nasdaq Composite  gained 225.54 points, or 1.16%, to 19,617.84.</p><p class=\"\">        Biotechnology firm Illumina  dropped 5.9%, while PVH Corp , the holding company for brands including Calvin Klein, shed 0.9% after China placed the companies in its \"unreliable entity list\". </p><p class=\"\">The last-minute change helped the three major U.S. stock indexes pare some of the heavy losses suffered earlier on Monday and closed trading well off session lows.</p><p class=\"\">Three Federal Reserve officials warned on Monday that trade tariffs carried inflation risks, with one arguing that uncertainty over the outlook for prices called for slower interest-rate cuts than otherwise.</p><p class=\"\">    A Labor Department report showed U.S. job openings stood at 7.6 million in December, compared to an estimated 8 million, according to economists polled by Reuters.  </p><p class=\"\">    In earnings-driven moves, PepsiCo  fell 4.2% after it forecast annual profit below expectations and missed quarterly revenue estimates.</p><p class=\"\">Merck  dropped 10.7% after the drugmaker said it would pause shipments of Gardasil to China through at least mid-year, as continued weak demand for the HPV vaccine there is expected to hurt the company's 2025 revenues.</p><p class=\"\">    PayPal  fell 10.1% after the digital payments giant's operating margin     shrank     in the fourth quarter.  </p><p class=\"\">    Advancing issues outnumbered decliners by a 2.74-to-1 ratio on the NYSE, and by a 2.16-to-1 ratio on the Nasdaq.  </p><p class=\"\">    The S&amp;P 500 posted 21 new 52-week highs and 15 new lows, while the Nasdaq Composite recorded 45 new highs and 88 new lows.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1NT:0-s-p-500-gains-on-energy-boost-trump-xi-talks-in-focus/",
            "pub_date": "2025-02-05 01:42:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0RK:0",
            "title": "Venezuela oil exports rise on Chevron's cargoes, more supply to China",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Venezuela's oil exports rose 15% to some 867,000 barrels per day in January, driven by an increase in shipments by U.S. major Chevron Corp  from its joint ventures with state firm PDVSA, and more cargoes to China, data based on vessel movements showed.</p><p class=\"\">The administration of former U.S. President Joe Biden last year did not renew a broad authorization for sanctioned Venezuela to freely export its oil, but granted individual licenses to some PDVSA partners and customers, allowing exports to flow to markets such as the U.S., Europe and India.</p><p class=\"\">President Donald Trump has said the U.S. does not need Venezuela's oil, but has not taken any action to amend or revoke licenses as his government makes initial contacts with Venezuelan President Nicolas Maduro, whose re-election last year was not recognized by Washington.</p><p class=\"\">In January, Chevron increased exports of Venezuelan oil to 294,000 bpd, the highest since the U.S. producer began shipments under its license in early 2023, and above a previous high of 280,000 bpd in October, according to LSEG data and PDVSA's internal exports records. </p><p class=\"\">All Chevron's cargoes went to the U.S. for processing at its own refineries and sales to others. </p><p class=\"\">China remained the largest market for Venezuela's oil last month with 442,000 bpd, 21% above the 364,000 bpd shipped to that destination in December. </p><p class=\"\">Venezuela's exports to Europe doubled to 63,000 bpd from 30,500 bpd in December, while shipments to India averaged 60,100 bpd, in line with previous months. Exports to Maduro's political ally Cuba declined to less than 10,000 bpd of fuel, from 29,000 bpd the previous month.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:925.5813953488372px;aspect-ratio:1.5426356589147285\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0RK-04e328578a6300e4432f013c81be2c1f-resized.webp\" type=\"images/webp\"/><img alt=\"Shipments of crude and fuel from Venezuela increased 15% in January as some partners of state company PDVSA exported more to the United States and Europe under U.S. licenses\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0RK-04e328578a6300e4432f013c81be2c1f-resized.jpeg\" style=\"background-color:#f5ebe0\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Venezuelan oil exports rise as PDVSA's partners ship more</span></figcaption></figure></span></p><p class=\"\">Stable crude processing operations in Venezuela's largest oil producing region, the Orinoco Belt, contributed to higher exports, according to one of the internal documents.</p><p class=\"\">However, inventories of heavy crude there, which are essential for exports, fell to 6.2 million barrels from 7.5 million barrels at the end of December, which could lead to lower exports this month. </p><p class=\"\">Venezuela also exported 360,000 metric tons of oil byproducts and petrochemicals in January, above the 209,000 tons of the previous month.</p><p class=\"\">PDVSA and its joint ventures imported 111,000 bpd of heavy naphtha and other fuels last month, below the 130,000 bpd of December, according to the data.   </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0RK:0-venezuela-oil-exports-rise-on-chevron-s-cargoes-more-supply-to-china/",
            "pub_date": "2025-02-05 01:43:47",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009156:0",
            "title": "Tempur Sealy Cleared to Close Purchase of Mattress Firm",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Tempur Sealy International said that it expects to close its previously announced acquisition of mattress specialty retailer Mattress Firm Group on Wednesday.</p><p class=\"\">The company said the closing follows the ruling from the U.S. District Court for the Southern District of Texas denying the motion by the Federal Trade Commission for a preliminary injunction to halt the closing of the proposed acquisition.</p><p class=\"\">The FTC has indicated that it will not seek emergency relief from the Fifth Circuit, and won't prevent the transaction from closing.</p><p class=\"\">Last July, the FTC voted to block Tempur Sealy's proposed $4 billion acquisition of Mattress Firm due to competition and pricing concerns. The regulator said the acquisition of Mattress Firm would give the world's largest mattress supplier and manufacturer the ability and incentive to suppress competition and raise prices for mattresses for millions of consumers.</p><p class=\"\">Tempur Sealy said last September that it expected to close the deal in late 2024 or early 2025, after the anticipated completion of the litigation process.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009156:0/",
            "pub_date": "2025-02-05 01:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0XY:0",
            "title": "Corn basis mixed; soy bids mostly flat",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Spot basis bids for corn were mixed at processing sites and grain elevators in the U.S. Midwest on Tuesday, firming in a few locations where demand outstripped farmer offerings and softening in others.</p><p class=\"\">* Farmer sales of corn and soybeans increased last month as Chicago Board of Trade corn futures climbed to multi-month highs, but demand from some end-users has eased in the wake of the influx of grain. </p><p class=\"\">* The corn basis fell by 2 cents at Decatur, Illinois, a key processing site, and at an ethanol plant in Linden, Indiana. But the basis improved at a Cedar Rapids, Iowa, processor and at elevators in Lincoln, Nebraska, and Toledo, Ohio.</p><p class=\"\">* Soybean basis bids were mostly flat, although the spot basis fell by a nickel a bushel at a Morristown, Indiana, crushing facility.</p><p class=\"\">* Falling profit margins for crushers may limit their demand for soybeans following an aggressive crushing pace in recent months. The U.S. Department of Agriculture reported on Monday that U.S. processors crushed a record-high 217.7 million bushels of soybeans in December, near an average of analyst expectations.  </p><p class=\"\">* Chicago Board of Trade corn and soy futures turned higher by mid-session on Tuesday, buoyed by a setback in the dollar  and optimism about grain demand after U.S. President <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/us/donald-trump/\" rel=\"nofollow\" target=\"_blank\">Donald Trump</a> on Monday suspended his threat of steep tariffs on <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/mexico/\" rel=\"nofollow\" target=\"_blank\">Mexico</a> and <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/canada/\" rel=\"nofollow\" target=\"_blank\">Canada</a>. </p><p class=\"\">* As of 11:24 a.m. CST (1724 GMT), CBOT March corn (CH25) was up 6-1/2 cents at $4.95-1/4 a bushel and March soybeans (SH25) were up 11-1/2 cents at $10.69-3/4 a bushel. </p><p class=\"\">  Basis values are quoted against CBOT futures in cts/bu:    </p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">ELEVATORS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">CINCINNATI OH</p></td><td><p class=\"\">+5</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 1</p></td><td><p class=\"\">-2</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">BURNS HARBOR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DES MOINES IA</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">LINCOLN NE</p></td><td><p class=\"\">-35</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 5</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">PROCESSORS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DECATUR IL</p></td><td><p class=\"\">-4</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 2</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">+0</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">MORRISTOWN IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-10</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 5</p></td></tr><tr><td><p class=\"\">LAFAYETTE IN</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-12</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">CEDAR RAPIDS IA</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 3</p></td><td><p class=\"\">-35</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">COUNCIL BLUFFS IA</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">LINCOLN NE</p></td><td></td><td></td><td></td><td></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">BLAIR NE</p></td><td><p class=\"\">-18</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">RIVER TERMINALS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\">CORN</p></td><td></td><td></td><td></td><td><p class=\"\">SOYBEANS</p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">TOLEDO OH</p></td><td><p class=\"\">-10</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UP 3</p></td><td><p class=\"\">-15</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">SENECA IL</p></td><td><p class=\"\">-14</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 1</p></td><td><p class=\"\">-27</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">SAVANNA IL</p></td><td><p class=\"\">-36</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td><p class=\"\">-41</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">DAVENPORT IA</p></td><td><p class=\"\">-28</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td><p class=\"\">-32</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td></tr><tr><td><p class=\"\">ETHANOL PLANTS</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">LINDEN IN</p></td><td><p class=\"\">-12</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">DN 2</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">UNION CITY IN</p></td><td><p class=\"\">+6</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">ANNAWAN IL</p></td><td><p class=\"\">-20</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">COUNCIL BLUFFS IA</p></td><td><p class=\"\">-22</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">SRW WHEAT</p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">TOLEDO OH</p></td><td><p class=\"\">-30</p></td><td><p class=\"\">+</p></td><td><p class=\"\">H</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">CINCINNATI OH</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">DECATUR IN</p></td><td><p class=\"\">-40</p></td><td><p class=\"\">+</p></td><td><p class=\"\">N</p></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">BURNS HARBOR IN</p></td><td><p class=\"\">UNQ</p></td><td></td><td></td><td><p class=\"\">UNC</p></td><td></td><td></td><td></td><td></td></tr></tbody></table></div><p class=\"\">NOTE: 0 = Option price, UNC = Unchanged, UNQ = Unquoted</p><p class=\"\">NC = Not comparable, DP = Delayed price, N/A = Not available,</p><p class=\"\"> F = January, H = March, K = May, N = July</p><p class=\"\">Q = August, U = September, X = November, Z = December</p><p class=\"\">--------------------------------------------------------</p><p class=\"\">LINKS: (0#USCSHGRN-PM)</p><p class=\"\">For U.S. forward basis spreadsheets, please click:</p><p class=\"\">     (CORN/BASIS), (SOYA/BASIS), (WHEAT/BASIS), (MILO/BASIS)</p><p class=\"\">- CBOT corn report </p><p class=\"\">- CBOT soybean report </p><p class=\"\">- CBOT wheat report </p><p class=\"\">- U.S. grain barge freight values </p><p class=\"\">- U.S. Midwest cash grain PM </p><p class=\"\">- U.S. CIF/FOB Gulf Grain  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0XY:0-corn-basis-mixed-soy-bids-mostly-flat/",
            "pub_date": "2025-02-05 01:44:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX3CtTry:0",
            "title": "Savouring February: A Month of Festivals and Celebrations in The Bahamas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Nassau, The Bahamas, Feb.  04, 2025  (GLOBE NEWSWIRE) — As the last vestiges of winter’s chill linger across the Northern Hemisphere, The Bahamas continues to stand as a beacon of warmth, beckoning travelers to its sun-kissed shores. February in The Bahamas is not just about escaping the cold; it’s an invitation to dive deep into a vibrant culture, indulge in a calendar brimming with festivals, and revel in the natural splendour of the islands. Whether you’re looking for romance, adventure, or cultural immersion, February offers something special for everyone amidst the serene beauty and hospitable spirit of The Bahamas.</p><p class=\"\">Check out what’s new and upcoming for those travelling to The Bahamas in February:</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">New Routes </strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Delta Airlines – </strong>Winter travelers rejoice! Delta has restarted its weekly nonstop service from Detroit Metropolitan Wayne County Airport (DTW) to Lynden Pindling International Airport (NAS) in The Bahamas. As the sole direct flight between these two destinations, it’s the perfect getaway for those in the metro Detroit and upper Midwest regions looking for a direct escape to The Bahamas’ beautiful islands.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong><strong class=\"root-Tkn6WL2y\">Events</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bahamas Romance Week</strong><strong class=\"root-Tkn6WL2y\"> (30 Jan. – 6 Feb.):</strong> The Bahamas Ministry of Tourism, Investments &amp; Aviation teams up with The Bahamas Bridal Association for the debut of “Bahamas Romance Week.” This unique event promises a week of love-filled escapades and special offers for couples across 16 of the Out Islands, creating magical moments for all romantics seeking a Bahamian adventure.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Eleuthera’s Junkanoo Festival</strong><strong class=\"root-Tkn6WL2y\"> (1 Feb.):</strong> Celebrate Bahamian culture with this vibrant festival, showcasing colourful costumes, rhythmic music and dynamic dance performances. This sought-after event in Eleuthera epitomises the spirit of Junkanoo, inviting visitors to immerse themselves in Bahamian traditions and culture.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Eleuthera Food and Craft Festival</strong><strong class=\"root-Tkn6WL2y\"> (1 Feb.):</strong> Held annually in Eleuthera, this event features local craftsmen and artisans as well as food vendors offering delectable local dishes such as conch salad and guava duff. This event brings locals and visitors together to enjoy a grand cultural celebration.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Farmer’s Cay Festival</strong><strong class=\"root-Tkn6WL2y\"> (7-8 Feb.:</strong> In The Exumas, this festival is a local gem, offering a day of community, music, and celebration. It’s an opportunity to experience the Exuma way of life, with sailing races, local foods and a chance to mingle with welcoming residents.</li></ul><p class=\"\"><em>Looking ahead…</em></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Hope Town Songwriters Festival</strong><strong class=\"root-Tkn6WL2y\"> (11-16 Feb.):</strong> Located in The Abacos, this event brings together songwriters from around the globe, offering intimate acoustic performances in the picturesque setting of Hope Town, a picturesque island getaway located on Abaco’s Elbow Cay. It’s a celebration of music, storytelling and the serene beauty of the island.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Nicholls Town Music, Arts, and Crafts Festival</strong><strong class=\"root-Tkn6WL2y\"> (7 March):</strong> Held every second Saturday of March annually, this festival on the island of Andros brings together local talent for a celebration of music, art and traditional Bahamian crafts made from wood, straw and shells, offering an enriching cultural experience.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">2nd Annual Nassau Paradise Island Wine and Food Festival <strong class=\"root-Tkn6WL2y\">(12-16 March):</strong> A culinary highlight of the season, this event features world-renowned chefs, wine tastings and culinary workshops, showcasing the gourmet side of The Bahamas. </li><li class=\"listItem-bmN0_SHH\">Cruisers Heritage and Cultural Festival (14-15 March): This event is a celebration of the island’s rich cultural heritage for visiting cruisers to Cat Island. Visitors can enjoy a weekend of activities that include a bonfire on the beach, storytelling, music, dance and healthy competition among boaters. The event is supported by local vendors selling native dishes and local artisans with their handcrafted products for display and sale.</li></ul><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">19th Annual Bahamian Music &amp; Heritage Festival</strong><strong class=\"root-Tkn6WL2y\"> (14-15 March): </strong>Taking place in George Town, Exuma, this annual festival features a line-up of The Bahamas’ most popular and talented musicians on the big stage. You can expect wood and conch shell carvings, sand jewellery, straw craft and blown glass jewellery all on display and available for purchase from local artisans. The kids will be entertained with storytelling while you shop. Bahamian dancing and cooking demonstrations will also be taking place during this unique festival. </li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Harvest Festival in Andros</strong><strong class=\"root-Tkn6WL2y\"> (29 March): </strong>Celebrate the agricultural abundance of Andros with this festival highlighting local farming practices, fresh produce and community spirit. The festival includes traditional Bahamian foods, beverages and confectionaries, as well as Androsia textile, arts and crafts. Family activities and entertainment which include: singing, music, dance, fashion shows and lively Junkanoo performances will also be features of the festival.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Promotions and Offers</strong></p><p class=\"\">For a complete list of deals and discounted packages in The Bahamas, visit <strong class=\"root-Tkn6WL2y\">www.bahamas.com/deals-packages</strong>.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Bahamas Romance Week Specials:</strong> Dive into a world of romance with over 13 exclusive packages and offers tailored for lovebirds. Throughout the Bahamas Romance Week, from 30 January to 6 February 2025, couples can enjoy a variety of romantic experiences, including special room rates, sunset dinners, spa treatments and more. For a complete list of deals and to find the perfect romantic escape, visit the Bahamas Romance Week landing page.</li></ul><p class=\"\"><em> </em><strong class=\"root-Tkn6WL2y\">Recent Awards and Upcoming Openings</strong></p><p class=\"\">The Bahamas is once again being celebrated for its natural beauty with the Tropic of Cancer Beach in Little Exuma securing the top spot in the 2025 Best Caribbean Beaches list. This acknowledgement underscores the archipelago’s status as a premier beach destination. For the full list, including three other Bahamian recognitions, see Caribbean Journal’s Best Caribbean Beaches for 2025.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Island Focus: </strong><strong class=\"root-Tkn6WL2y\">San</strong> <strong class=\"root-Tkn6WL2y\">Salvador</strong></p><p class=\"\">San Salvador, famed for being Christopher Columbus’s first reported landfall in the New World, offers a blend of historical intrigue and natural beauty. The island’s serene beaches, like the expansive Bonefish Bay, provide a tranquil retreat, while its diving sites, such as Riding Rock Wall, are renowned for their crystal-clear waters and vibrant marine life.</p><p class=\"\">San Salvador’s small-town charm allows visitors to connect with the local community, experiencing their warm hospitality and rich cultural heritage. From exploring ancient Lucayan Indian caves to enjoying the quiet luxury of secluded resorts, San Salvador encapsulates the true essence of Bahamian tranquility. Whether you want to delve into history, engage in water sports, or simply bask in the peace of island life, San Salvador offers an authentic escape from the everyday hustle and bustle.</p><p class=\"\">Don’t miss out on the unforgettable experiences and unbeatable deals that The Bahamas has to offer, this February. For more information on these exciting events and offerings, visit <strong class=\"root-Tkn6WL2y\">www.Bahamas.com</strong>. </p><p class=\"\"> ###</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong><strong class=\"root-Tkn6WL2y\">About The Bahamas:</strong></p><p class=\"\">The Bahamas has over 700 islands and cays, as well as 16 unique island destinations. Located only 50 miles off the coast of Florida, it offers a quick and easy way for travelers to escape their everyday. The island nation also boasts world-class fishing, diving, boating and thousands of miles of the Earth's most spectacular beaches for families, couples and adventurers to explore. See why It's Better in The Bahamas at www.bahamas.com or on Facebook, YouTube or Instagram.</p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachments</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">San Salvador      </li><li class=\"listItem-bmN0_SHH\">San Salvador      </li></ul><p class=\"\">Anita Johnson Patty</p><p class=\"\">The Bahamas Ministry of Tourism</p><p class=\"\">ajohnson@bahamas.com</p><p class=\"\">Bahamas USA</p><p class=\"\">FINN Bahamas</p><p class=\"\">Bahamasusa@finnpartners.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX3CtTry:0-savouring-february-a-month-of-festivals-and-celebrations-in-the-bahamas/",
            "pub_date": "2025-02-05 01:44:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009159_20250204009159:0",
            "title": "S&P 500 Rises 29.53 Points (0.49%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009159_20250204009159:0/",
            "pub_date": "2025-02-05 01:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204009160_20250204009160:0",
            "title": "Nasdaq Composite Rises 190.50 Points (0.98%)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204009160_20250204009160:0/",
            "pub_date": "2025-02-05 01:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}