{
    "data": [
        {
            "id": "DJN_DN20250203012186:0",
            "title": "Hong Kong Shares Rise 2.0% at Midday, Led by Tech Stocks — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hong Kong's benchmark Hang Seng Index is up 2.0% to 20622.1 at the midday break. The Hang Seng Tech Index is 3.9% higher at 4922.58. Investor sentiment was boosted after President Trump agreed to delay tariffs for Mexico and Canada. The markets may look through the economic data to focus on China's responses to U.S. tariffs and the coming National People's Congress session in early March, Citi analysts say. Tech stocks are leading the gains with Meituan up 4.2%, Lenovo adding 6.5% and Alibaba gaining 2.45%. Decliners include Greentown China Holdings, which is down 1.8%, and Sihuan Pharmaceutical Holdings Group 3.45% lower. (tracy.qu@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012186:0/",
            "pub_date": "2025-02-04 12:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012187:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0421 GMT - Hong Kong's benchmark Hang Seng Index is up 2.0% to 20622.1 at the midday break. The Hang Seng Tech Index is 3.9% higher at 4922.58. Investor sentiment was boosted after President Trump agreed to delay tariffs for Mexico and Canada. The markets may look through the economic data to focus on China's responses to U.S. tariffs and the coming National People's Congress session in early March, Citi analysts say. Tech stocks are leading the gains with Meituan up 4.2%, Lenovo adding 6.5% and Alibaba gaining 2.45%. Decliners include Greentown China Holdings, which is down 1.8%, and Sihuan Pharmaceutical Holdings Group 3.45% lower. (tracy.qu@wsj.com)</p><p class=\"\">0415 GMT - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">0410 GMT - New Zealand's NZX-50 index ended 0.7% higher at 12905.04 after U.S. President Trump agreed to delay tariffs on imports from the country's closest neighbors by a month. Still, the index didn't recapture all of Monday's fall in a sign that investors remain skittish. Trump has also signaled unhappiness with the U.S.'s trade relationship with the EU. Fisher &amp; Paykel Healthcare, Monday's biggest loser, advanced 2.3% as analysts said any effort to expand manufacturing in New Zealand to shield itself from tariffs on products made in Mexico would take time. Skellerup rose 0.2% as Forsyth Barr said the additional 10% tariff on China wouldn't put a big dent in its earnings. Energy stocks were mostly lower, however, with Genesis Energy down 1.8% and Meridian Energy declining 0.6%. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">0344 GMT - LG Chem is set to post weaker-than-expected 2025 earnings partly due to sales declines at its electric-vehicle battery and advanced-material businesses, Nomura analyst Cindy Park writes in a note. Park cuts her operating-profit forecast for the South Korean company by 37% for 2025, lowering the valuations of its battery and advanced-material units. Still, she says the stock could gain on a possible earnings improvement for chemicals and a potential cathode restocking at its EV battery affiliate later in the year. Nomura cuts its target price for the stock by 33% to KRW280,000 but keeps a buy rating. Shares are 3.2% lower at KRW215,000. (kwanwoo.jun@wsj.com)</p><p class=\"\">0327 GMT - Centurion Corp. looks well-placed to generate higher rental rates in Singapore given the dormitory supply shortage situation, RHB Research's Alfie Yeo says in a research report. Its purpose-built workers' accommodation bed rates in Singapore continue to be robust, and thanks to the demand-supply situation, RHB sees ongoing upward rental adjustments boosting its average bed rates. RHB lifts its 2025-2026 earnings estimates for the Singapore-listed manager of workers and student accommodations by 9% each year. RHB maintains the stock's buy rating and raises the stock's target price to S$1.16 from S$1.06. Shares are 0.5% higher at S$0.995. (ronnie.harui@wsj.com)</p><p class=\"\">0256 GMT - MC Group retains its buy call from Thanachart Securities as the stock is a high-yield play, the brokerage's Phannarai Tiyapittayarut says in a research report. The stock looks inexpensive at a 10.1X 2025 price-to-earnings multiple and a 9.9% dividend yield, the analyst says. Also, the Thai company's sales from online channels are still growing, with contribution to its total sales expected to increase to 19.2% in 2027 from 10.4% in 2024. However, the manufacturer and marketer of 'Mc Jeans' is slowing store openings, which prompts the brokerage to cut its earnings estimates by 6% for 2025, 8% for 2026, and 11% for 2027. Thanachart Securities lowers its target price to THB12.00 from THB15.00. Shares closed 1% higher at THB10.00 on Monday. (ronnie.harui@wsj.com)</p><p class=\"\">0233 GMT - Yangzijiang Shipbuilding's record-high order backlog boosts earnings visibility through 2027, DBS Group Research's Pei Hwa Ho says in a research report. The shipbuilder's yards are full through 2027 with an order book of roughly US$24 billion, which is expected to lead to earnings CAGR of around 14% over the next two years, the analyst says. Revenue growth and margin expansion are drivers, as about 65% of the company's order book consists of containership orders that command higher value and margins, the analyst adds. DBS raises its 2024-2026 earnings forecasts for Yangzijiang Shipbuilding by 5%-11%. It raises the target price to S$3.80 from S$2.88 with an unchanged buy rating. Shares are 1% lower at S$3.00. (ronnie.harui@wsj.com)</p><p class=\"\">0219 GMT - SD Guthrie's Marvesa 48% stake acquisition looks set to help strengthen its downstream business expansion, diversify into other soft oils and boost trading between Europe and Asia-Pacific, MIDF Research says in a note. The 250 million ringgit acquisition comes as a surprise, particularly as many of the company's peers have adopted a cautious stance toward the region due to the impending European Union deforestation regulation policy, it notes. However, considering the plantation giant's strong supply-chain credentials, SD Guthrie views Europe as a key growth driver, MIDF says. SD Guthrie's balance sheet remains healthy and is well-positioned for expansion, it adds. MIDF maintains a buy rating on SD Guthrie and keeps its target price at MYR5.43. Shares are 0.6% higher at MYR4.88. (yingxian.wong@wsj.com)</p><p class=\"\">0203 GMT - Hong Kong shares open higher, with the Hang Seng Index rising 1.6% to 20546.6. The Hang Seng Tech Index adds 2.9% to 4875.99. Market sentiment is boosted after Canada and Mexico reached a deal to delay U.S. President Donald Trump's tariffs. Among major stocks, technology stocks are leading the gains, with Bilibili adding 4.7% and JD.com rising 3.0%. Tencent is 1.0% higher. The few decliners include C&amp;D International Investment Group, which drops 1.3% and LVGEM (China) Real Estate Investment, which is 1.4% lower. (tracy.qu@wsj.com)</p><p class=\"\">0144 GMT - Sunway REIT could post 11.6% earnings growth in 2025, driven by the record MYR899 million in asset acquisitions completed in 2024, rental reversion and higher occupancy rates, CIMB Securities analysts Lim Yue Jia and Ivy Ng Lee Fang say in a note. Upgrades at Sunway Pyramid Mall and Sunway Carnival Mall may also support earnings, they add. They raise Sunway REIT's 2025-2026 earnings forecasts by 0.9%-1.8% following the completion of the Sunway Kluang Mall acquisition. CIMB Securities raises Sunway REIT's target price to MYR2.11 from MYR2.09, while maintaining a buy rating on the stock. Shares are 2.1% higher at MYR1.91. (yingxian.wong@wsj.com)</p><p class=\"\">0114 GMT - AMMB Holdings' canceling the sale of its life insurance unit to Great Eastern comes as no surprise, given the prolonged delay, Maybank IB analyst Desmond Ch'ng says in a note. He notes that there has been no progress on the deal since it was first proposed in October 2023. The impact on AMMB's capital is minimal, with its Common Equity Tier 1 ratio at a solid 15.3%, he reckons. While a sale may still be considered, there is no urgency, he adds. Ch'ng expects AMMB to see 11.7% earnings growth in FY 2025, supported by better net interest margins and lower credit costs. Maybank maintains a buy rating on AMMB and keeps the target price at MYR6.30. Shares are 0.2% higher at MYR5.65. (yingxian.wong@wsj.com)</p><p class=\"\">0108 GMT - Singapore's FTSE Straits Times Index rises 0.7% to 3853.13 in early trade. Market sentiment is rosier after President Trump and leaders of Canada and Mexico reached a deal to put tariffs on hold for a month. \"Tariff headlines are still likely to dominate,\" UOB's Global Economics &amp; Markets Research team says in a note. Among advancers, Seatrium climbs 0.9%, DBS adds 1.3% and Yangzijiang Shipbuilding is up 1.0%. Meanwhile, Venture Corp. falls 0.4% and Keppel Ltd. loses 0.3%. (amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012187:0/",
            "pub_date": "2025-02-04 12:21:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463150:0",
            "title": "Market Chatter: EU to Strengthen Checks on Low-Value Products from Temu, Shein",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">In an effort to ensure fair competition and product safety, the European Union is planning to strengthen customs checks on goods shipped directly by non-EU ecommerce retailers, Reuters reported Monday. </p><p class=\"\">The directive, set for release on Wednesday, targets the rapid growth of platforms like Temu and Shein, which have gained an edge with ultra-low prices on Chinese-made products, according to the report. </p><p class=\"\">The above retailers benefited from an EU rule exempting parcels under 150 euros from duties, a policy critics argued creates unfair advantages, Reuters wrote. </p><p class=\"\">The new measures will focus on online purchases posing safety risks or non-compliance with EU laws, with the European Commission urging member states to collaborate on identifying high-risk products, according to the report. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463150:0/",
            "pub_date": "2025-02-04 12:21:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0AL:0",
            "title": "India's Tata Chemicals slides on posting quarterly loss",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Tata Chemicals  down 4% to 909.6 rupees</p><p class=\"\">** The chemicals firm posts Q3 net loss of 530 million rupees ($6.1 mln) vs profit of 1.58 billion rupees a year ago</p><p class=\"\">** Co registers one-time charge of 700 million rupees in its UK operations, along with lower soda ash prices amid soft demand</p><p class=\"\">** More than 2.1 million shares traded, about twice its 30-day moving avg</p><p class=\"\">** Stock trading below its 50-, 100- and 200-day simple moving avgs since late Dec, indicating bearish sentiment</p><p class=\"\">** Avg rating of seven analysts is a \"sell\" and median PT is 879 rupees, about 3% lower than current price - LSEG</p><p class=\"\">** Stock fell 4.7% in 2024</p><p class=\"\">($1 = 87.0300 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0AL:0-india-s-tata-chemicals-slides-on-posting-quarterly-loss/",
            "pub_date": "2025-02-04 12:22:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463154:0",
            "title": "Saudi's Riyad Bank Plans H2 2024 Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Riyad Bank (SASE:1010) will distribute a cash dividend to shareholders for the second half ended Dec. 31, 2024. </p><p class=\"\">The Saudi Arabia-listed lender said Monday that it will pay 0.90 Saudi riyal per share. It paid 0.75 riyal per unit a year ago.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463154:0/",
            "pub_date": "2025-02-04 12:22:24",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463153:0",
            "title": "Rimfire Pacific Mining Finds High-Grade Scandium at New South Wales Project",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Rimfire Pacific Mining  found multiple scandium intercepts in its Currajong project in New South Wales including a high-grade eight-meter section with 404 parts per million scandium, the company said in a Tuesday Australian bourse filing. </p><p class=\"\">The company also found a three-meter high-grade section of 362 parts per million scandium and a five-meter section with 368 parts per million scandium, among other lower-grade deposits, per the filing. </p><p class=\"\">Infill air core drilling is planned for late February in the scandium zone of Currajong Ultramafic Belt's southern end, subject to receipt of regulatory drill approvals, the filing added.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463153:0/",
            "pub_date": "2025-02-04 12:22:57",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463152:0",
            "title": "Hyundai Motor's Global Sales Down 2.3% in January; Shares Rise 3%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hyundai Motor's  global sales fell 2.3% to 310,399 units in January from 317,823 vehicles sold in the same month the year before, the automaker said Monday. </p><p class=\"\">Sales at home declined 7.5% to 46,054 units in the month from 49,810 units in January 2024, while sales abroad also fell 1.4% to 264,345 from 268,013 during the period. </p><p class=\"\">Shares of Hyundai Motor rose nearly 3% in recent trade on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463152:0/",
            "pub_date": "2025-02-04 12:24:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0AO:0",
            "title": "India's Gland Pharma falls on as French unit \"continued to bleed\"",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Gland Pharma  fall ~3.3% to 1462.8 rupees </p><p class=\"\">** Co's Q3 revenue falls 10.4% on production setbacks at French unit Cenexi's site near Paris</p><p class=\"\">** Cenexi sales down due to regulatory inspections, breakeven now pushed back by a year vs Q3 target</p><p class=\"\">** Jefferies says Cenexi \"continued to bleed\" and India and US saw the biggest sales disappointment in Q3</p><p class=\"\">** InCred Equities cuts to 'sell' from 'hold' on \"repeated delays in Cenexi's turnaround\"</p><p class=\"\">** Citi retains 'sell' on GLAD's inablity to optimize its 'world class' injectables manufacturing set-up</p><p class=\"\">** 10 analysts avg rating is 'hold', avg PT is 1671 rupees, implying ~13.5% upside to current price -LSEG data</p><p class=\"\">** Including session's decline, stock down 27% in last 12 months</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0AO:0-india-s-gland-pharma-falls-on-as-french-unit-continued-to-bleed/",
            "pub_date": "2025-02-04 12:24:52",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV09Q:0",
            "title": "KKR to raise Fuji Soft bid to 9,850 yen a share, above Bain's offer -source",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">U.S. private equity firm KKR  will raise its tender offer price for Japanese IT company Fuji Soft  to 9,850 yen a share from 9,451 yen, above Bain Capital's rival offer of 9,600 yen, a person familiar with the deal said on Tuesday.</p><p class=\"\">The person declined to be identified because the information is not yet public.</p><p class=\"\">KKR and Bain are trying to buy Fuji Soft in competing tender offer bids worth as much as $2 billion.</p><p class=\"\">KKR now has a 34% stake in Fuji Soft after the first stage of a two-part bid, but has failed so far to amass a majority due to Bain's higher offer. It has repeatedly extended the tender offer period, with the latest due to end on Friday.</p><p class=\"\">Fuji Soft's shares were up 1.53% at 9,950 yen in early afternoon trade.</p><p class=\"\">Bain, which is supported by Fuji Soft's founding family, has not launched its tender offer bid yet, having said that it would wait for KKR's bid to fail or be withdrawn. </p><p class=\"\">KKR had initially offered 8,800 yen a share for Fuji Soft last August. Bain announced its rival offer the following month, at 9,450 yen, prompting KKR to raise its offer to 9,451 yen. It had kept its offer price there despite Bain's re-raising its offer to 9,600 yen.</p><p class=\"\">KKR will announce the latest change as early as on Tuesday afternoon, the Nikkei business daily reported earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV09Q:0-kkr-to-raise-fuji-soft-bid-to-9-850-yen-a-share-above-bain-s-offer-source/",
            "pub_date": "2025-02-04 12:25:49",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012174:0",
            "title": "China Could Work Towards Delaying Additional Tariff With Trump — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012174:0/",
            "pub_date": "2025-02-04 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012180_20250203012180:0",
            "title": "FTSE Straits Times Index Erases Gains; Last 0.2% Lower at 3802.31",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012180_20250203012180:0/",
            "pub_date": "2025-02-04 12:16:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU190:0",
            "title": "Omani Packagin FY Dividend 10 Baizas Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">OMANI PACKAGIN (OPCI.OM):</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">OMANI PACKAGIN FY DIVIDEND 10 BAIZAS PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU190:0-omani-packagin-fy-dividend-10-baizas-per-share/",
            "pub_date": "2025-02-04 12:16:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1BS:0",
            "title": "Borouge Qtrly Profit Rises",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOROUGE PLC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY ATTRIBUTABLE NET PROFIT $1.23 BILLION VERSUS $1 BILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">FY REVENUE $6.03 BILLION VERSUS $5.79 BILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">QTRLY NET PROFIT $331 MILLION VERSUS $288 MILLION YEAR AGO</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">QTRLY REVENUE $1.62 BILLION VERSUS $1.50 BILLION YEAR AGO</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1BS:0-borouge-qtrly-profit-rises/",
            "pub_date": "2025-02-04 12:17:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463147:0",
            "title": "EQT Closes $177 Million Sale of Kodiak Gas Services Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EQT  said Monday it completed the divestment of 3.7 million shares in US-based natural gas contract compression services company Kodiak Gas Services for $177 million. </p><p class=\"\">The Swedish private equity company sold the shares through an affiliate of its EQT Infrastructure III and EQT Infrastructure IV funds. It noted that the transaction was carried out on Jan. 30.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463147:0/",
            "pub_date": "2025-02-04 12:19:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012184:0",
            "title": "Asia Markets Rebound After U.S. Pauses Tariffs on Mexico, Canada",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kimberley Kao</p><p class=\"\">Markets across Asia staged a relief rally after U.S. President Trump agreed to postpone the start of tariffs on Mexico and Canada by a month, suggesting that a reversal is possible.</p><p class=\"\">Japan's Nikkei Stock Average was recently 1.1% higher on Tuesday, led by gains in auto and electronic stocks. Hong Kong's benchmark index rose 2.0% and South Korea's Kospi gained 1.5%.</p><p class=\"\">The rebound came after the U.S. struck last-minute deals with Mexico and Canada to delay new tariffs, after separate calls with the leaders of both nations. China, another tariff target, is also preparing to talk trade with Trump.</p><p class=\"\">Trump's aggressive move to place tariffs on hundreds of billions of dollars in imports rattled investors, economists and some lawmakers.</p><p class=\"\">In a social media post, Trump said that his administration will see in the next 30 days if an \"economic deal\" with Canada can be structured. He made similar comments about Mexico earlier Monday.</p><p class=\"\">\"A headlines-driven market seems synonymous with Trump 2.0, much like in 2016,\" Yeap Jun Rong, market strategist at IG, said in a note.</p><p class=\"\">The extended timeline for Mexico and Canada can provide immediate relief for risk sentiment, Yeap said. \"More importantly, it underscores President Trump's willingness to negotiate, potentially with tariff moves as bargaining chips rather than firm policy decisions.\"</p><p class=\"\">Oliver Blackbourn, multiasset portfolio manager at Janus Henderson, said that the quick reappraisal on tariffs suggests that there might be a way out. It \"gave markets hope that this could be a short-lived episode, although perhaps this is only the case with Mexico and Canada,\" he said in a commentary.</p><p class=\"\">Other Asian stock markets were broadly higher. Taiwan's Taiex index gained 0.7% and Malaysia's benchmark Kuala Lumpur Composite Index rose 0.5%.</p><p class=\"\">Currency markets, which have whipsawed during the barrage of tariff news, breathed a small sigh of relief over the delays.</p><p class=\"\">The yen weakened against most other G-10 and Asian currencies as sentiment toward risk assets rebounded. The Canadian dollar and the Mexican peso clawed back ground lost after the initial jolt. Asian currencies broadly rose against the U.S. dollar.</p><p class=\"\">The offshore yuan strengthened in a possible reflection of expectations that China too will get a tariff reprieve, Vishnu Varathan, Mizuho Securities' head of macro research for Asia, excluding Japan, said in a note. But the \"overarching geo-economic dimensions to U.S.-China trade means that resolution will be far more fraught than is the case with Mexico and Canada,\" he cautioned.</p><p class=\"\">Relief isn't resolution, as Trump has warned that tariff plans are intact, Varathan said. U.S.-driven trade antagonism threats remain at large, and \"it promises to be a bumpy ride for markets in the weeks ahead,\" with currency markets set up to be the most sensitive to U.S. tariff threats, he said.</p><p class=\"\">The euro, Korean won, Thai baht, Malaysian ringgit, Australian dollar and offshore yuan remain on the line, Varathan said.</p><p class=\"\">Until recently, many on Wall Street viewed threats of the U.S. imposing the highest tariffs in decades as a negotiating tactic in border disputes over drug trafficking and migration and unlikely to materialize.</p><p class=\"\">\"We still think that permanent tariffs on the U.S.'s allies (Canada, Mexico) will not be a thing,\" said Thierry Wizman, global foreign-exchange and rates strategist at Macquarie. \"Tariffs [are] likely to be reversed before they do serious damage.\"</p><p class=\"\">\"That's because concessions are an 'easier' way to deal with Trump's 'problems'...and Trump likes to make 'deals,'\" Wizman said in a note.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fabiana Negrin Ochoa, Ronnie Harui and Farah Elias contributed to this article.</li></ul><p class=\"\">Write to Kimberley Kao at kimberley.kao@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012184:0-asia-markets-rebound-after-u-s-pauses-tariffs-on-mexico-canada/",
            "pub_date": "2025-02-04 12:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0A6:0",
            "title": "ASX shares of News Corp at record high; UBS upgrades to 'buy'",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** ASX-listed shares of media giant News Corp  rise 1.8% to a record high of A$51.72</p><p class=\"\">** Analysts at UBS raise PT on NWS to A$64.5 from A$51 and upgrade stock rating to \"buy\" from \"neutral\"</p><p class=\"\">** Lifts earnings estimates for FY25 and FY26 on co, largely reflecting reduced net interest expense post sale of its Australian pay TV business Foxtel</p><p class=\"\">** Says market will be keenly looking for an update on the strategic review post the ale of Foxtel and management expectations for interest expense line post Foxtel debt removal</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0A6:0-asx-shares-of-news-corp-at-record-high-ubs-upgrades-to-buy/",
            "pub_date": "2025-02-04 12:11:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012168_20250203012168:0",
            "title": "LIC Housing Finance Target Price Raised to INR735 From INR700 by Nomura >500253.BY",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012168_20250203012168:0/",
            "pub_date": "2025-02-04 12:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0A4:0",
            "title": "India's Premier Energies gains on Q3 profit jump",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of solar modules make Premier Energies  up 3% at 1,098.80 rupees</p><p class=\"\">** Co posts about sixfold jump in Q3 profit on strong demand for modules</p><p class=\"\">** PEME up 11% since listing in Sept.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0A4:0-india-s-premier-energies-gains-on-q3-profit-jump/",
            "pub_date": "2025-02-04 12:13:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV002:0",
            "title": "Borouge H2 Cash Dividend 7.9 Fils Per Share",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOROUGE :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOROUGE H2 CASH DIVIDEND 7.9 FILS PER SHARE</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV002:0-borouge-h2-cash-dividend-7-9-fils-per-share/",
            "pub_date": "2025-02-04 12:13:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463149:0",
            "title": "Argenica Therapeutics Reports Positive Results From Preclinical Study for Traumatic Brain Injury",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Argenica Therapeutics  said that its ARG-007 neuroprotective peptide drug candidate \"significantly\" reduced damage to brain cells caused by moderate traumatic brain injury in a preclinical rat study, according to a Tuesday Australian bourse filing. </p><p class=\"\">The study assessed ARG-007 regarding the reduction of axonal injury and neuroinflammation seen following moderate traumatic brain injury and resulting behavioral outcomes. </p><p class=\"\">It was found to protect brain cells in the injured brain by reducing axonal injury following injury, as measured by key axonal injury biomarkers neurofilament heavy protein and amyloid precursor protein. </p><p class=\"\">The animals treated with the candidate also showed signs of improvement in a motor function test as well as a significant reduction in weight loss. </p><p class=\"\">The data verifies data received from previous studies. </p><p class=\"\">The firm's shares rose past 1% in recent trading on Tuesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463149:0/",
            "pub_date": "2025-02-04 12:14:37",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463151:0",
            "title": "S&P Upgrades Euronext Rating on Reduced Leverage, Higher Cash Flow Generation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">S&amp;P Global Ratings upgraded its long-term issuer credit rating on Euronext (, ENXP.LS) to A- from BBB+ with a stable outlook on Monday. </p><p class=\"\">The rating agency noted that the bourse operator materially lowered its leverage and increased cash flow generation from operations. It also noted that the integration of Borsa Italiana and the expansion of Euronext Clearing to all of its markets resulted in greater synergies than initially expected. </p><p class=\"\">S&amp;P Global said the stable outlook reflects its expectation that Euronext will sustain its lower leverage level and execute its growth strategy targeting more than 5% compound annual revenue growth between 2024 and 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463151:0/",
            "pub_date": "2025-02-04 12:14:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012172:0",
            "title": "News Highlights: Top Global Markets News of the Day - Monday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Tariffs Caused a Market Meltdown, but Investors Shook It Off</strong></p><p class=\"\">Stocks pared declines after the U.S. and Mexico struck a deal to delay new levies.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Pauses Tariffs on Mexico, Canada. China Levies Are Still Happening-for Now.</strong></p><p class=\"\">Tariffs on Canada and China are still going ahead for now.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Treasury Cuts Quarterly Borrowing Estimate to $815 Billion</strong></p><p class=\"\">The department said it began the year with more cash on hand than planned.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Futures Set New Record on Safe-Haven Demand</strong></p><p class=\"\">Gold futures set a fresh record in volatile trading as traders digested U.S. President Trump's tariff plans.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bessent Takes Helm of Consumer Finance Watchdog, Orders Halt to Work</strong></p><p class=\"\">Treasury Secretary Scott Bessent is ordering a freeze to work at the Consumer Financial Protection Bureau, after being named its acting director by President Trump</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bitcoin rebounds after Trump pauses Mexico, Canada tariffs. Here's why the crypto reacts to tariffs.</strong></p><p class=\"\">Bitcoin rebounded to above $100,000 Monday evening, after President Donald Trump said he would pause imposing tariffs on Mexico and Canada, respectively.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed interest-rate cuts might not come anytime soon, two top officials say</strong></p><p class=\"\">Two senior Federal Reserve officials said Monday that they are in no rush to cut interest rates further given the uncertainty surrounding the U.S. economic outlook and the White House's new policies, including tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Will Be Especially Bad for Europe. What They Mean for European Stocks.</strong></p><p class=\"\">The continent's economies are weaker than those in North America.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012172:0-news-highlights-top-global-markets-news-of-the-day-monday-at-11-pm-et/",
            "pub_date": "2025-02-04 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012173:0",
            "title": "News Highlights: Top Company News of the Day - Monday at 11 PM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Apple escaped tariffs last time. This time, it may have to raise prices.</strong></p><p class=\"\">Apple was one of the luckier consumer-electronics companies when it got exemptions on the tariffs imposed by the first Trump administration on many goods made in China. But this time, it might not be quite as fortunate.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nvidia's stock falls as these two questions dog investors</strong></p><p class=\"\">Wall Street is trying to assess how tariffs would impact the chip sector. Plus, the DeepSeek fallout lingers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Palantir Earnings Demolish Expectations on AI Growth. The Stock Is Zooming.</strong></p><p class=\"\">Earnings per share were up annually by 75% to 14 cents.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China's Tech Still Constrained by Export Controls, ASML's CEO Says</strong></p><p class=\"\">DeepSeek's success shows companies are making the most of limited resources in a hot artificial-intelligence market, but that doesn't mean controls targeting China's chip sector have failed, the chief of a leading semiconductor equipment maker said.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Match Group's Fate Hinges on Tinder</strong></p><p class=\"\">When Match Group reports results on Tuesday, investors will consider the health of Tinder, as well as the company's leadership, financial health and its viability as an acquisition target.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Is Delivering Its Biggest Fee Cut Ever. New CEO Salim Ramji Explains Why.</strong></p><p class=\"\">The asset manager says the move at 87 funds will save investors $350 million this year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Baxter International Chairman, President, CEO Jose Almeida Retires</strong></p><p class=\"\">The provider of healthcare equipment and supplies said long-time leader, Jose Almeida, has abruptly retired as chairman, president and chief executive.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Is About to Report Its Earnings. The Stock Has Been Floundering.</strong></p><p class=\"\">The CEO said last month that the drugmaker had cut costs, revamped its sales operation, and made other big fixes.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pepsi Has Lost Some Fizz. Watch for Snack Sales in Earnings.</strong></p><p class=\"\">The rising popularity of weight-loss drugs could further dampen appetite for snacks and sugary drinks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012173:0-news-highlights-top-company-news-of-the-day-monday-at-11-pm-et/",
            "pub_date": "2025-02-04 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012177:0",
            "title": "Global Forex and Fixed Income Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering FX and Fixed Income. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0415 GMT - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">0410 GMT - Indonesia's economy is expected to have grown 4.89% in 4Q 2024, slightly easing from 3Q's 4.95%, according to the median estimate of six economists polled by The Wall Street Journal. Growth was likely supported by a modest uptick in demand, despite slower investment growth amid the transition to a new head of state, DBS economists Taimur Baig and Nathan Chow say in a note. The 4Q outcome would peg 2024 growth at an average of 5%, maintaining a steady pace from 2023, they add. Indonesia's 2023 GDP growth was 5.05%. The data is due Wednesday. (yingxian.wong@wsj.com)</p><p class=\"\">0404 GMT - The Singapore dollar strengthens slightly against its U.S. counterpart in the Asian session as traders await President Trump's decision on tariffs for China. The U.S. tariffs on Mexico and Canada have been delayed for a month, so market participants are anticipating that Trump will do the same for China, Maybank analysts say in an FX Research &amp; Strategy report. \"Markets are now awaiting verdict on the last outstanding tariffs for China that could come into effect within hours,\" the analysts say. However, given recent choppy movements, the USD Index remains at the \"whims of tariff headlines,\" the analysts add. USD/SGD is 0.1% lower at 1.3591. (ronnie.harui@wsj.com)</p><p class=\"\">0349 GMT - The yuan is steady against the dollar in offshore markets, supported by hopes for potential China-U.S. talks on tariffs. President Trump mentioned overnight that the U.S. might speak with China, likely within the next 24 hours, regarding tariffs, notes Mizuho Securities Asia's Ken Cheung in an email. Trump's comments revived hopes for a pause in U.S. tariffs on China, similar to the situation with Canada and Mexico, according to the director of FX Strategy. However, with mainland China still closed for holiday today, the USD/CNY fixing guidance on Wednesday will be closely monitored, Cheung adds. USD/CNH is little changed at 7.3114. (ronnie.harui@wsj.com)</p><p class=\"\">0339 GMT - Australia's core inflation remains high and the economy is fully employed, but global risks should make the Reserve Bank of Australia more dovish, say economists at HSBC Global Research. The escalation of trade tensions creates downside risk for the global economy and the scale and breadth of tariffs on products and countries suggest the impact is likely to be significant, say Paul Bloxham and Jamie Culling in a note. They reckon this is enough to tip the RBA's view to start supporting the economy a little earlier than expected. HSBC now sees the RBA cutting its cash rate by 25 bps this month, with another cut expected in 3Q and a final cut in the current cycle in 1Q 2026. (monica.gupta@wsj.com)</p><p class=\"\">0312 GMT - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">0250 GMT - Thailand's consumer-price index in January likely rose 1.3% on year, according to the median estimate of seven economists surveyed by The Wall Street Journal. That would compare with December's 1.23% increase. Inflation may have been driven by several factors, including a low base effect and rising energy prices, says DBS's economics team. Consumer inflation is expected to align with the Bank of Thailand's projections for headline inflation to stabilize around the lower bound of its 1%-3% target range, DBS adds. The data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0241 GMT - The likelihood of U.S. tariffs on Mexico and Canada is higher despite the delay in the implementation, Nomura analysts say in a research note. Canada and Mexico could \"reach a deal with the U.S. to either avert tariffs or soften the blow by securing conditional exemptions,\" they say. However, the analysts note that Trump previously said there was nothing that targeted countries could do to avoid higher tariffs. \"If these tariffs fully take effect, their size will dwarf the entirety of the tariffs Trump imposed during his first term in office,\" they write, adding, \"higher tariffs are likely to push up core inflation meaningfully, which reinforces our Fed call of no rate cuts this year.\" (sherry.qin@wsj.com)</p><p class=\"\">0234 GMT - Indonesia's inflation may rise post-February as electricity discounts phase out and consumption recovers, CGS International economists Wisnu Trihatmojo and Nazmi Idrus say in a note. However, they anticipate that volatile inflation could stay under control due to a stronger harvest this year, supported by improved weather conditions and increased fertilizer availability. Given the revised VAT hike to only include luxury goods and a softer consumption environment, they lower the year-end inflation forecast to 2.7% from 3.2%. The overall inflation outlook may remain conducive to Bank Indonesia's monetary easing, with expectations for a 5% BI rate by end-2025, down from the current 5.75%, they add. (yingxian.wong@wsj.com)</p><p class=\"\">0227 GMT - Consumer prices in the Philippines likely rose 2.7% on year in January, according to the median forecast of seven economists polled by The Wall Street Journal. That would compare with a 2.9% increase in December. Headline inflation likely cooled due to falling retail prices for rice and easing electricity prices, HSBC's global economics team says in a report. Looking ahead, HSBC expects government efforts to manage rice supply to bring overall inflation down in the next few months. In December, the BSP cut its rates for the third time in 2024 amid low inflation and slowing economic growth. The CPI data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0215 GMT - The U.S. dollar is likely to maintain its safe-haven status in 1H 2025, DBS Group Research's Philip Wee says in a commentary. Trade uncertainties loom despite the U.S. delaying tariffs on Canada and Mexico, the senior FX strategist says, adding there's potential volatility in markets from President Trump's unpredictability. Meanwhile, Trump has given notice that the European Union was next in line for U.S. tariffs, Wee notes. Also, there was no 30-day reprieve for additional 10% tariff on Chinese imports, with markets awaiting responses from Chinese President Xi, Wee says. The USD Index is 0.3% lower at 108.64. (ronnie.harui@wsj.com)</p><p class=\"\">0155 GMT - The drop in Indonesia's inflation below the central bank's target to the lowest since 2000 is likely to be short-lived, Maybank analysts say. A temporary discount in electricity tariffs was the main factor behind the outsized fall and volatile food inflation may strengthen in the coming months amid rising demand during the Ramadan season, Brian Lee Shun Rong and Chua Hak Bin say. They stick to their call for 2025 headline inflation at 2.6% and 50 bps of rate cuts but note significant uncertainty over whether Bank Indonesia will be able to cut in February, given the need to support the rupiah. The rupiah has weakened 0.8% since BI's January meeting, and U.S. tariff news is buoying the dollar and affecting emerging market currencies, they add. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012177:0/",
            "pub_date": "2025-02-04 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250203012175:0",
            "title": "China Could Work Towards Delaying Additional Tariff With Trump — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">0415 GMT - There are high hopes that China may strike a deal with President Trump to delay the additional 10% tariff, after Mexico and Canada managed to delay the U.S. tariffs, says IG. However, there is \"still room for surprises and Trump could still come down hard\", market strategist Yeap Jun Rong writes in a note. China is seen as a prominent threat to U.S. national security and economic competition, Yeap notes. The tech rivalry between the two countries has become even more pronounced recently with Chinese AI startup DeepSeek, he adds. \"But if China can pull it off, risk sentiments may find further recovery momentum, at least in the near term,\" Yeap says.(amanda.lee@wsj.com)</p><p class=\"\">0410 GMT - Indonesia's economy is expected to have grown 4.89% in 4Q 2024, slightly easing from 3Q's 4.95%, according to the median estimate of six economists polled by The Wall Street Journal. Growth was likely supported by a modest uptick in demand, despite slower investment growth amid the transition to a new head of state, DBS economists Taimur Baig and Nathan Chow say in a note. The 4Q outcome would peg 2024 growth at an average of 5%, maintaining a steady pace from 2023, they add. Indonesia's 2023 GDP growth was 5.05%. The data is due Wednesday. (yingxian.wong@wsj.com)</p><p class=\"\">0404 GMT - The Singapore dollar strengthens slightly against its U.S. counterpart in the Asian session as traders await President Trump's decision on tariffs for China. The U.S. tariffs on Mexico and Canada have been delayed for a month, so market participants are anticipating that Trump will do the same for China, Maybank analysts say in an FX Research &amp; Strategy report. \"Markets are now awaiting verdict on the last outstanding tariffs for China that could come into effect within hours,\" the analysts say. However, given recent choppy movements, the USD Index remains at the \"whims of tariff headlines,\" the analysts add. USD/SGD is 0.1% lower at 1.3591. (ronnie.harui@wsj.com)</p><p class=\"\">0349 GMT - The yuan is steady against the dollar in offshore markets, supported by hopes for potential China-U.S. talks on tariffs. President Trump mentioned overnight that the U.S. might speak with China, likely within the next 24 hours, regarding tariffs, notes Mizuho Securities Asia's Ken Cheung in an email. Trump's comments revived hopes for a pause in U.S. tariffs on China, similar to the situation with Canada and Mexico, according to the director of FX Strategy. However, with mainland China still closed for holiday today, the USD/CNY fixing guidance on Wednesday will be closely monitored, Cheung adds. USD/CNH is little changed at 7.3114. (ronnie.harui@wsj.com)</p><p class=\"\">0339 GMT - Australia's core inflation remains high and the economy is fully employed, but global risks should make the Reserve Bank of Australia more dovish, say economists at HSBC Global Research. The escalation of trade tensions creates downside risk for the global economy and the scale and breadth of tariffs on products and countries suggest the impact is likely to be significant, say Paul Bloxham and Jamie Culling in a note. They reckon this is enough to tip the RBA's view to start supporting the economy a little earlier than expected. HSBC now sees the RBA cutting its cash rate by 25 bps this month, with another cut expected in 3Q and a final cut in the current cycle in 1Q 2026. (monica.gupta@wsj.com)</p><p class=\"\">0312 GMT - The rise of Chinese AI is denting investor risk sentiment, particularly in the tech sector, Nomura analyst Naka Matsuzawa says in a research note. This has triggered a flight to quality, driving flows into government bonds, though investor jitters have yet to cause a financial shock or credit contraction, the analyst notes. Meanwhile, U.S. tech earnings have been well-received by the market, helping to ease concerns. Even though this AI-driven shock could erode U.S. economic and market strength over time, the impact of Trump's tariffs is likely offsetting what would have otherwise been a weaker USD, the analyst adds. (tracy.qu@wsj.com)</p><p class=\"\">0250 GMT - Thailand's consumer-price index in January likely rose 1.3% on year, according to the median estimate of seven economists surveyed by The Wall Street Journal. That would compare with December's 1.23% increase. Inflation may have been driven by several factors, including a low base effect and rising energy prices, says DBS's economics team. Consumer inflation is expected to align with the Bank of Thailand's projections for headline inflation to stabilize around the lower bound of its 1%-3% target range, DBS adds. The data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0241 GMT - The likelihood of U.S. tariffs on Mexico and Canada is higher despite the delay in the implementation, Nomura analysts say in a research note. Canada and Mexico could \"reach a deal with the U.S. to either avert tariffs or soften the blow by securing conditional exemptions,\" they say. However, the analysts note that Trump previously said there was nothing that targeted countries could do to avoid higher tariffs. \"If these tariffs fully take effect, their size will dwarf the entirety of the tariffs Trump imposed during his first term in office,\" they write, adding, \"higher tariffs are likely to push up core inflation meaningfully, which reinforces our Fed call of no rate cuts this year.\" (sherry.qin@wsj.com)</p><p class=\"\">0234 GMT - Indonesia's inflation may rise post-February as electricity discounts phase out and consumption recovers, CGS International economists Wisnu Trihatmojo and Nazmi Idrus say in a note. However, they anticipate that volatile inflation could stay under control due to a stronger harvest this year, supported by improved weather conditions and increased fertilizer availability. Given the revised VAT hike to only include luxury goods and a softer consumption environment, they lower the year-end inflation forecast to 2.7% from 3.2%. The overall inflation outlook may remain conducive to Bank Indonesia's monetary easing, with expectations for a 5% BI rate by end-2025, down from the current 5.75%, they add. (yingxian.wong@wsj.com)</p><p class=\"\">0227 GMT - Consumer prices in the Philippines likely rose 2.7% on year in January, according to the median forecast of seven economists polled by The Wall Street Journal. That would compare with a 2.9% increase in December. Headline inflation likely cooled due to falling retail prices for rice and easing electricity prices, HSBC's global economics team says in a report. Looking ahead, HSBC expects government efforts to manage rice supply to bring overall inflation down in the next few months. In December, the BSP cut its rates for the third time in 2024 amid low inflation and slowing economic growth. The CPI data are due Wednesday. (amanda.lee@wsj.com)</p><p class=\"\">0215 GMT - The U.S. dollar is likely to maintain its safe-haven status in 1H 2025, DBS Group Research's Philip Wee says in a commentary. Trade uncertainties loom despite the U.S. delaying tariffs on Canada and Mexico, the senior FX strategist says, adding there's potential volatility in markets from President Trump's unpredictability. Meanwhile, Trump has given notice that the European Union was next in line for U.S. tariffs, Wee notes. Also, there was no 30-day reprieve for additional 10% tariff on Chinese imports, with markets awaiting responses from Chinese President Xi, Wee says. The USD Index is 0.3% lower at 108.64. (ronnie.harui@wsj.com)</p><p class=\"\">0155 GMT - The drop in Indonesia's inflation below the central bank's target to the lowest since 2000 is likely to be short-lived, Maybank analysts say. A temporary discount in electricity tariffs was the main factor behind the outsized fall and volatile food inflation may strengthen in the coming months amid rising demand during the Ramadan season, Brian Lee Shun Rong and Chua Hak Bin say. They stick to their call for 2025 headline inflation at 2.6% and 50 bps of rate cuts but note significant uncertainty over whether Bank Indonesia will be able to cut in February, given the need to support the rupiah. The rupiah has weakened 0.8% since BI's January meeting, and U.S. tariff news is buoying the dollar and affecting emerging market currencies, they add. (fabiana.negrinochoa@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250203012175:0/",
            "pub_date": "2025-02-04 12:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OU1BT:0",
            "title": "Borouge Management Intends To Pay $1.3 Billion Dividend In 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BOROUGE :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">BOROUGE - MANAGEMENT INTENDS TO PAY $1.3 BILLION DIVIDEND IN 2025</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OU1BT:0-borouge-management-intends-to-pay-1-3-billion-dividend-in-2025/",
            "pub_date": "2025-02-04 12:15:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_ZUN00BM81:0",
            "title": "Saudi Arabia's non-oil private sector grows at decade-high pace in Jan, PMI shows",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Saudi Arabia's non-oil business sector expanded at its strongest pace in just over a decade in January, driven by a surge in new orders and robust business activity, a survey showed on Tuesday.</p><p class=\"\">The seasonally adjusted Riyad Bank Saudi Arabia Purchasing Managers' Index (PMI) rose to 60.5 last month from 58.4 in December, marking its highest level since September 2014. Readings above 50 denote growth.</p><p class=\"\">The rapid growth was largely attributed to the fastest rise in new orders since June 2011, with the New Orders Index accelerating to a reading of 71.1 in January from 65.5 the previous month. </p><p class=\"\">This surge in demand was supported by favourable economic conditions and new infrastructure projects, boosting customer orders and export sales, the survey said.</p><p class=\"\">\"The rise in export orders further complemented domestic demand, particularly from GCC (Gulf Cooperation Council) countries, reflecting effective marketing and competitive pricing strategies,\" Naif Al Ghaith, Riyad Bank's chief economist said.</p><p class=\"\">\"This expansion highlights the country’s continued economic diversification efforts.\"</p><p class=\"\">Non-oil growth surged to 4.6% in the fourth quarter of 2024, government estimates showed, outperforming overall GDP growth during the period as the government presses on with investments and initiatives to meet Vision 2030 economic objectives.</p><p class=\"\">Employment levels continued to rise in January, but cost pressures remained a concern, with rising input price inflation contributing to firms increasing output prices at the fastest pace in about a year.</p><p class=\"\">However, business expectations for the year ahead improved to the strongest since March 2024 with firms still optimistic about future output. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_ZUN00BM81:0-saudi-arabia-s-non-oil-private-sector-grows-at-decade-high-pace-in-jan-pmi-shows/",
            "pub_date": "2025-02-04 12:15:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV0A0:0",
            "title": "Trump tariff delays boost Asian currencies and stock markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Malaysian ringgit adds 0.5%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Thai baht slips 0.1%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Philippine stocks add 0.4%</li></ul></span></div><span><p class=\"\">    Major Asian currencies and stock markets recouped losses on Tuesday, as investor sentiment improved after U.S. President Donald Trump postponed tariffs on Canada and Mexico for a month and said he would hold further talks with China. </p><p class=\"\">The Malaysian ringgit  and Indonesian rupiah  climbed 0.5% and 0.4% respectively while the Taiwan dollar  and South Korean won  added 0.1% and 0.2% each.</p><p class=\"\">The reversal in market sentiment comes as Trump delayed 25% tariffs against Mexico and Canada after the two countries' leaders said they would bolster border enforcement efforts. </p><p class=\"\">    Trump's press secretary     said     the president would speak with Chinese President Xi Jinping in the next couple of days.     Tariffs on China     are due to come into effect at 0501 GMT on Tuesday.  </p><p class=\"\">Asian currencies had slumped on Monday amid fears of a trade war as Trump threatened tariffs on imports from the United States' three biggest trade partners. </p><p class=\"\">The Singapore dollar  and the Thai baht  were little changed on Tuesday against the dollar, which held steady.</p><p class=\"\">\"Tariffs against Canada and Mexico are likely just negotiation tools and should not be viewed as how Trump intends to wield tariffs to handle trade with the U.S. more broadly,\" said Eugene Leow, senior rates strategist at DBS.</p><p class=\"\">\"We suspect that a more systematic tariff policy would be mooted in March/April.\"</p><p class=\"\">Asian shares climbed, with stocks in Manila  rising the most - and set for a second consecutive day of gains - after the central bank governor hinted last week at a further cut in interest rates when officials meet later this month. </p><p class=\"\">Philippine stocks had fallen for five straight days, reflecting rising concern about the global economy and a growth slowdown at home.</p><p class=\"\">The benchmark slipped 4% last Friday to its lowest close since October 2022.</p><p class=\"\">Analysts at Citi expect the Philippine central bank to cut rates by 25 basis points on Feb. 13. </p><p class=\"\">Citi expects the Bangko Sentral ng Pilipinas (BSP) to hold steady in April before cutting again in June and August, partly due to the potential increase in U.S. tariffs and its impact on global trade and USD/PHP, coupled with the Federal Reserve's rate cut decisions and mid-term election campaigning at home.  </p><p class=\"\">Other stock markets including Indonesia , Malaysia  and Taiwan <!-- -->TWSE:TAIEX<!-- --> climbed between 0.5% and 1.1%. </p><p class=\"\">HIGHLIGHTS:    </p><p class=\"\">** Philippines declares 'food security emergency' to tame retail rice prices</p><p class=\"\">** Thai EV output set to jump</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Asian currencies and stocks as 0301 GMT</p></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\">COUNTRY</p></td><td><p class=\"\">FX RIC</p></td><td><p class=\"\">FX DAILY %</p></td><td><p class=\"\">FX YTD %</p></td><td><p class=\"\">INDEX</p></td><td><p class=\"\">STOCKS DAILY %</p></td><td><p class=\"\">STOCKS YTD %</p></td></tr><tr><td><p class=\"\">Japan</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.24</p></td><td><p class=\"\">+1.32</p></td><td><p class=\"\"></p></td><td><p class=\"\">1.61</p></td><td><p class=\"\">-0.42</p></td></tr><tr><td><p class=\"\">China</p></td><td><p class=\"\"></p></td><td><p class=\"\">-</p></td><td><p class=\"\">-</p></td><td><p class=\"\"></p></td><td><p class=\"\">-</p></td><td><p class=\"\">-</p></td></tr><tr><td><p class=\"\">India</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.00</p></td><td><p class=\"\">-1.80</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.00</p></td><td><p class=\"\">-1.20</p></td></tr><tr><td><p class=\"\">Indonesia</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.43</p></td><td><p class=\"\">-1.65</p></td><td><p class=\"\"></p></td><td><p class=\"\">1.12</p></td><td><p class=\"\">0.41</p></td></tr><tr><td><p class=\"\">Malaysia</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.45</p></td><td><p class=\"\">+0.40</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.52</p></td><td><p class=\"\">-4.91</p></td></tr><tr><td><p class=\"\">Philippines</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.23</p></td><td><p class=\"\">-0.47</p></td><td><p class=\"\"></p></td><td><p class=\"\">2.46</p></td><td><p class=\"\">-7.67</p></td></tr><tr><td><p class=\"\">S.Korea</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.16</p></td><td><p class=\"\">+0.86</p></td><td><p class=\"\"></p></td><td><p class=\"\">1.62</p></td><td><p class=\"\">3.93</p></td></tr><tr><td><p class=\"\">Singapore</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.02</p></td><td><p class=\"\">+0.48</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.14</p></td><td><p class=\"\">1.17</p></td></tr><tr><td><p class=\"\">Taiwan</p></td><td><p class=\"\"></p></td><td><p class=\"\">+0.05</p></td><td><p class=\"\">-0.51</p></td><td><p class=\"\">TWSE:TAIEX</p></td><td><p class=\"\">0.85</p></td><td><p class=\"\">-0.64</p></td></tr><tr><td><p class=\"\">Thailand</p></td><td><p class=\"\"></p></td><td><p class=\"\">-0.02</p></td><td><p class=\"\">+1.43</p></td><td><p class=\"\"></p></td><td><p class=\"\">0.51</p></td><td><p class=\"\">-6.37</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV0A0:0-trump-tariff-delays-boost-asian-currencies-and-stock-markets/",
            "pub_date": "2025-02-04 12:06:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250203:G2463145:0",
            "title": "Ntegrator Provides Details on Singapore High Court's Winding Up Order",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ntegrator Holdings  disclosed further details of the winding up order by the High Court of Singapore and appointment of liquidator, according to a filing with the Singapore Exchange on Monday. </p><p class=\"\">The court said the company had failed to respond to the statutory demand issued by former financial controller Sw Chan Kit to demonstrate its solvency, with a proposed scheme of arrangement deemed unacceptable to creditors. </p><p class=\"\">Moreover, the company had not filed any audited accounts since 2022 and did not call for an annual general meeting by the end of October 2024. </p><p class=\"\">Therefore, the court ordered the company to be wound up and Baker Tilly Consultancy was appointed as the liquidator. </p><p class=\"\">The company added that it is still in the process of reviewing the court's grounds of decision and will decide whether to appeal the decision by Feb. 7. </p><p class=\"\">Separately, David Dong-Won Kim and Cameron Lindsay Duncan of KordaMentha have been appointed as the interim judicial managers of Ntegrator Pte Ltd., a unit of Ntegrator Holdings, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250203:G2463145:0/",
            "pub_date": "2025-02-04 12:07:06",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "cointelegraph:e354175dc094b:0",
            "title": "Ethereum tops $2.9K while Eric Trump says ‘it’s a great time to add ETH’",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ether rebounded to above $2,900 after US President Donald Trump placed a halt on tariffs aimed at Canada and Mexico, while his son, Eric Trump, told his 5.4 million X followers that “it’s a great time to add ETH.” </p><p class=\"\">“In my opinion, it’s a great time to add $ETH. You can thank me later,” Trump wrote in a Feb. 3 X post. However, he has since edited the post to remove those last five words.</p><p class=\"\">Eric Trump’s remarks came after a crypto market bloodbath across Feb. 2 and 3 — triggered largely by President Trump’s proposed tariffs — which included Ether  plummeting 16% in a single hour to a local low of $2,368. </p><p class=\"\">Ether had already recovered to around $2,700 before Trump’s post after his father agreed to put a temporary hold on proposed tariffs on Canada and Mexico as negotiations with the countries continue. </p><p class=\"\">ETH continued to rise to reach $2,913 before falling back to its current price of $2,806.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">World Liberty Financial makes crypto moves</strong></p><p class=\"\">All this comes as the Trump family’s World Liberty Financial crypto platform recently transferred $307.41 million worth of assets to Coinbase’s custody platform on Feb. 3, according to blockchain analytics firm Spot On Chain.</p><p class=\"\">WFL then unstaked nearly 20,000 Lido Staked Ether (stETH) into Ether and spent another $5 million worth of USD Coin (USDC) to purchase 1,826 Ether at $2,738, Spot On Chain said.</p><p class=\"\">In a note to Cointelegraph, Spot On Chain suggested the funds could be used to support WLF’s “Earn and Borrow” lending protocol, which isn’t fully operational yet.</p><p class=\"\">In January, the Ethereum Foundation announced a series of organizational changes to more actively support developers in Ethereum’s decentralized finance ecosystem. The foundation set aside 50,000 Ether, which could be used to expand the foundation’s treasury through staking rewards.</p><p class=\"\">Ethereum core developer Eric Conner said the foundation’s staking rewards could cover most, if not all, of its internal budget while easing some of the selling pressure that has upset the community, and arguably contributed to its lackluster price performance this bull cycle.</p><p class=\"\">Meanwhile, institution-focused Ethereum marketing firm Etherealize launched on Jan. 22 to help pitch Ethereum’s bull case to Wall Street<strong class=\"root-Tkn6WL2y\">.</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:e354175dc094b:0-ethereum-tops-2-9k-while-eric-trump-says-it-s-a-great-time-to-add-eth/",
            "pub_date": "2025-02-04 12:07:52",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        }
    ]
}