{
    "data": [
        {
            "id": "cointelegraph:11e9c1599094b:0",
            "title": "Bloomberg extends financial data to $25B tokenized markets via Kaiko",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Bloomberg is collaborating with Kaiko, a Paris-based digital asset market data provider, to make Bloomberg’s licensed financial data accessible directly within blockchain environments rather than through traditional offchain databases.</span></p><p class=\"\"><span>The companies said Thursday that the initiative is designed to address the challenge of inconsistent data across tokenized markets. </span></p><p class=\"\"><span>In many tokenized asset ecosystems, companies may rely on different versions of pricing data, security identifiers or reference information, increasing the risk of discrepancies and operational inefficiencies.</span></p><p class=\"\"><span>By enabling a common, licensed data source to be embedded onchain, the collaboration aims to ensure that market participants reference the same dataset, potentially reducing reconciliation disputes and improving data integrity.</span></p><p class=\"\"><span>The first use case focuses on tokenized US Treasurys and repo markets operating on the Canton Network, a permissioned blockchain network designed for institutional financial applications. Kaiko launched that data on-ramp service in August.</span></p><p class=\"\"><span>The integration targets banks, asset managers and other regulated financial institutions experimenting with blockchain-based versions of traditional financial instruments, rather than retail crypto traders.</span></p><p class=\"\"><span>Questions around data reliability and market size in tokenized real-world assets (RWAs) have surfaced before.</span></p><p class=\"\"><span>In May, Cointelegraph interviewed Chris Yin, co-founder of RWA platform Plume, who said that the tokenized asset market may be significantly smaller than figures cited by some industry aggregators. At the time, Yin said the sector’s actual size was likely closer to half of what major data sources were reporting. </span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:789.8617511520737px;aspect-ratio:1.316436251920123\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/cointelegraph:11e9c1599094b-dd070abd8f18e3e818282c45dbcda7e8-resized.webp\" type=\"image/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/cointelegraph:11e9c1599094b-dd070abd8f18e3e818282c45dbcda7e8-resized.webp\" style=\"background-color:#f1f2f4\"/></picture></div></button></figure><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><span>Hong Kong to link new digital bond platform with regional tokenization hubs</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why data integrity matters for tokenized markets</span></strong></p><p class=\"\"><span>Kaiko CEO Ambre Soubiran said institutional-grade data is essential for well-functioning financial markets, stating that the collaboration with Bloomberg “will extend the availability of market data used in traditional markets to now support the next generation of tokenized securities infrastructure.”</span></p><p class=\"\"><span>Kaiko expanded its footprint in the digital asset data sector with its 2024 acquisition of European crypto index provider Vinter, strengthening its presence in regulated benchmark and index services across Europe.</span></p><p class=\"\"><span>Reliable data has long been a priority in the digital asset industry, where market participants have relied not only on price feeds but also on onchain analytics and sentiment indicators to improve transparency. </span></p><p class=\"\"><span>In tokenized markets, particularly those linked to real-world assets like Treasurys, consistent pricing data and reference information help ensure that onchain assets accurately mirror the underlying financial instruments.</span></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Related: </span></strong></em><span>Aster’s quiet relisting on DefiLlama leaves ‘big gaps’ in data: Exec</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/cointelegraph:11e9c1599094b:0-bloomberg-extends-financial-data-to-25b-tokenized-markets-via-kaiko/",
            "pub_date": "2026-02-27 03:52:38",
            "source": "Cointelegraph",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:bc2e88f23da3d:0",
            "title": "Installed Building Products, Inc. SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Installed Building Products, Inc. (IBP), a leading installer of insulation and complementary building products, has released its 2025 Form 10-K report. The report highlights the company's financial performance, business operations, strategic initiatives, and the challenges it faces in the highly competitive building products installation industry.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><span>IBP reported strong financial performance for 2025, with key metrics reflecting growth and profitability:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Revenue:</span></strong><span> $2,970.8 million, a 1.0% increase from the previous year, driven by higher sales in the commercial end market and contributions from recent acquisitions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Gross Profit:</span></strong><span> $1,009.3 million, up 1.5% from the previous year, attributed to improvements in selling price, product mix, and material cost management.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Income:</span></strong><span> $386.4 million, reflecting a strategic focus on profitability over sales volume.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $265.4 million, an increase supported by higher net revenue and effective cost management.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Basic Earnings Per Share:</span></strong><span> $9.76, indicating strong financial performance and efficient cost management.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Diluted Earnings Per Share:</span></strong><span> $9.71, showcasing a solid financial position and profitability.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><span>IBP's business operations in 2025 demonstrated resilience and strategic growth:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments:</span></strong><span> The Installation segment, including insulation and other building products, formed the majority of net revenue. Insulation installation alone comprised 58% of net revenue in 2025.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> The company operates a national network of approximately 250 branch locations across all 48 continental states and the District of Columbia, with regional distribution operations serving the Midwest, Mountain West, Northeast, and Mid-Atlantic regions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units:</span></strong><span> Same branch sales in the residential end market declined by 4.4% in 2025 due to lower job volume. However, the commercial end market grew by 11.2%, supported by strong same branch sales growth and improvements in selling price and product mix.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Production Launches:</span></strong><span> The acquisition of Carolina Precision Fibers in 2025 expanded IBP's manufacturing operations in Ronda, North Carolina, primarily producing cellulose insulation and specialty industrial fibers.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The residential homebuilding market is expected to remain stable in 2026, with forecasted housing starts anticipated to be consistent with 2025 levels. The company plans to continue its acquisition strategy, targeting at least $100 million in annual aggregate revenue from acquisitions in 2026.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><span>IBP continued to execute its strategic initiatives and capital management activities in 2025:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Acquisition Strategy:</span></strong><span> The company invested $51.5 million in 2025, acquiring seven businesses expected to contribute approximately $53.3 million in annual revenues. Additionally, four bolt-on acquisitions were completed to enhance existing operations. IBP aims to acquire at least $100 million in annual aggregate revenue in 2026.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Debt Management:</span></strong><span> In January 2026, IBP issued $500 million of 5.625% Senior Notes due 2034, using part of the proceeds to redeem the 2028 Senior Notes, thereby extending debt maturity and improving liquidity.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> The company repurchased $172.6 million of its common stock in 2025, up from $145.3 million in 2024, and increased its regular quarterly dividends and annual variable dividend by 6%. Total dividends paid amounted to $87.6 million. IBP maintained a strong liquidity position with $321.9 million in cash and cash equivalents as of December 31, 2025, and access to $250 million under its asset-based lending credit facility. The company also amended its ABL Revolver in January 2026 to increase the commitment amount and extend its maturity to January 2031.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> IBP plans to continue its disciplined acquisition strategy with a goal of acquiring at least $100 million in annual aggregate revenue in 2026. It anticipates discretionary spending for capital improvements and dividends to approximate 2025 levels. The company expects to use cash and cash equivalents to fund acquisitions and maintain its stock repurchase program. Additionally, IBP plans to manage its debt obligations effectively, with known obligations extending through 2031, and aims to leverage its strong liquidity position to support ongoing operations and strategic initiatives.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><span>IBP faces several challenges and risks in its operations:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Competition:</span></strong><span> The company operates in a highly fragmented and competitive industry, facing competition from national, regional, and local companies that may offer superior services or lower prices.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Economic Sensitivity:</span></strong><span> IBP's business is highly sensitive to economic and housing market conditions, including interest rates, inflation, employment levels, and housing demand, which can significantly impact operations.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The company relies on suppliers for building products, and any disruption in supply or increase in material costs could adversely affect its business. Additionally, attracting and retaining qualified employees is challenging in a competitive labor market.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> Changes in federal and state laws affecting labor, immigration, and environmental regulations can increase operational costs and impact the company's financial condition. IBP is also subject to risks related to sustainability practices and disclosure.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Emerging Risks:</span></strong><span> Cybersecurity threats could disrupt operations and lead to financial losses. The company relies on information technology systems for its operations, and any breach could have a material adverse effect on its business.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Integration Risks:</span></strong><span> The integration of acquired businesses presents risks, including potential adverse effects on operating results and the diversion of management's attention.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Interest Rate Risks:</span></strong><span> IBP is exposed to interest rate risks due to its variable-rate debt. Increases in interest rates could lead to higher debt service obligations and impact the company's financial performance. The company uses interest rate derivatives to hedge against these risks, but there are inherent risks associated with these financial instruments.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1580905/000158090526000004/ibp-20251231.htm\" rel=\"nofollow\" target=\"_blank\">Installed Building Products, Inc. [ IBP ] - 10-K - Feb. 26, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:bc2e88f23da3d:0-installed-building-products-inc-sec-10-k-report/",
            "pub_date": "2026-02-27 03:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:b378746c19f9e:0",
            "title": "Encompass Health Corp SEC 10-K Report",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Encompass Health Corp, the largest owner and operator of inpatient rehabilitation hospitals in the United States, has released its 2025 10-K report. The report highlights the company's robust financial performance, significant operational achievements, strategic initiatives, and the challenges it faces in the healthcare industry. Encompass Health continues to expand its footprint and enhance its service offerings, driven by favorable demographic trends and a commitment to operational excellence.</span></p><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights</span></strong></p><span> </span><p class=\"\"><span>Encompass Health Corp reported strong financial performance for 2025, marked by significant growth across key metrics:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Operating Revenues:</span></strong><span> $5,935.2 million, a 10.5% increase from 2024, primarily due to increased volumes and favorable pricing.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operating Expenses:</span></strong><span> $4,882.1 million, representing 82.3% of Net Operating Revenues, decreased as a percentage of revenues compared to 2024.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Income from Continuing Operations Before Income Tax Expense:</span></strong><span> $953.0 million, a 27.1% increase from 2024.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income:</span></strong><span> $759.1 million, a 27.2% increase from 2024, reflecting strong revenue growth and operational efficiency.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Net Income Attributable to Encompass Health:</span></strong><span> $566.2 million, a 24.2% increase from 2024.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Basic Earnings Per Share Attributable to Encompass Health Common Shareholders:</span></strong><span> $5.62, up from $4.53 in 2024.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Diluted Earnings Per Share Attributable to Encompass Health Common Shareholders:</span></strong><span> $5.54, up from $4.46 in 2024.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Business Highlights</span></strong></p><span> </span><p class=\"\"><span>Encompass Health Corp's operational performance in 2025 was marked by significant achievements and growth:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Revenue Segments:</span></strong><span> Approximately 65% of net operating revenues were derived from fee-for-service Medicare, 16% from Medicare Advantage, with the remaining revenue coming from managed care, Medicaid, and other sources.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Geographical Performance:</span></strong><span> The company operates hospitals in 39 states and Puerto Rico, with significant concentrations in Florida and Texas, supporting its position as the largest owner and operator of inpatient rehabilitation hospitals in the nation.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Sales Units:</span></strong><span> The company reported 263,299 discharges in 2025, an increase from 248,498 in 2024, reflecting growth in patient volume.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>New Production Launches:</span></strong><span> In 2025, the company expanded its capacity by adding 177 new beds to existing hospitals and opened several new inpatient rehabilitation hospitals, including locations in Athens, Georgia; Fort Myers, Florida; Daytona Beach, Florida; Danbury, Connecticut; St. Petersburg, Florida; Amarillo, Texas; and Lake Worth, Florida.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company remains optimistic about its growth prospects, driven by demographic trends such as an aging population, which is expected to increase demand for inpatient rehabilitation services. The company plans to continue expanding its network of hospitals and adding capacity to existing facilities.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Strategic Initiatives</span></strong></p><span> </span><p class=\"\"><span>Encompass Health Corp has undertaken several strategic initiatives to support its long-term growth and financial stability:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Development and Expansion:</span></strong><span> The company continued its development and expansion efforts by opening several new inpatient rehabilitation hospitals in 2025, including joint ventures in Georgia, Florida, Connecticut, and Texas. It also announced plans for additional hospitals expected to open in 2026 and beyond, with a focus on increasing capacity and expanding its geographic footprint.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Capital Management:</span></strong><span> In 2025, the company redeemed the remaining $100 million of its 5.75% Senior Notes due 2025, using cash on hand and capacity under its revolving credit facility. The company maintained a strong balance sheet with no significant debt maturities until 2028. It also repurchased 1.5 million shares of its common stock for $158 million and increased its quarterly dividend to $0.19 per share. The company has significant availability under its revolving credit facility and plans to continue shareholder distributions through stock repurchases and dividends.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Future Outlook:</span></strong><span> The company remains optimistic about its long-term prospects, driven by demographic trends such as an aging population, which is expected to increase demand for its services. It plans to invest in growth opportunities, including new hospital openings and capacity expansions, while maintaining a flexible capital structure. The company anticipates continued strong cash flows from operations to support these initiatives and expects to pay approximately $150 million to $180 million in cash income taxes in 2026.</span></li></ul><span> </span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Challenges and Risks</span></strong></p><span> </span><p class=\"\"><span>Encompass Health Corp faces several challenges and risks that could impact its operations and financial performance:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Reimbursement Risks:</span></strong><span> The company faces significant reimbursement risks due to potential reductions or changes in reimbursement from government and third-party payors, particularly Medicare and Medicaid. Legislative changes, such as the ACA and the Budget Control Act, have historically impacted reimbursement rates, and future initiatives could further affect revenues. The introduction of the One Big Beautiful Bill Act (OBBBA) and potential changes under the Statutory Pay-As-You-Go Act could also lead to reimbursement reductions.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Operational Risks:</span></strong><span> The potential for audits and payment denials from Medicare and other payors could negatively impact cash flows and financial results. The company is subject to various audit programs, including those conducted by Recovery Audit Contractors (RACs) and Uniform Program Integrity Contractors (UPICs), which may result in significant overpayment determinations and require substantial resources to address.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Regulatory Risks:</span></strong><span> The evolving healthcare delivery system, including alternative payment models and value-based purchasing initiatives, poses regulatory risks. The implementation of models like the Transforming Episode Accountability Model (TEAM) and the Comprehensive Care for Joint Replacement (CJR) model could impact reimbursement and operational strategies. Additionally, the Review Choice Demonstration (RCD) program poses challenges in terms of compliance and potential revenue impacts.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Compliance Risks:</span></strong><span> The company faces risks related to compliance with extensive healthcare laws and regulations, including the 60% Rule for inpatient rehabilitation facilities, anti-kickback laws, and privacy regulations under HIPAA and the HITECH Act. Non-compliance could result in significant penalties, including exclusion from Medicare and Medicaid programs.</span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Market Risks:</span></strong><span> The company is exposed to market risks, including pressures from managed care and third-party payors to control healthcare costs, which could affect reimbursement rates and profitability. Additionally, the company must navigate the complexities of billing and collection processes, which are subject to regulatory constraints and could impact liquidity and financial performance.</span></li></ul><p class=\"\"><span>SEC Filing: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/785161/000078516126000081/ehc-20251231.htm\" rel=\"nofollow\" target=\"_blank\">Encompass Health Corp [ EHC ] - 10-K - Feb. 26, 2026</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tradingview:b378746c19f9e:0-encompass-health-corp-sec-10-k-report/",
            "pub_date": "2026-02-27 03:55:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938968:0",
            "title": "CGEN: COM701 and novel assets advance in key trials, with strong partnerships fueling future innovation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>COM701 is advancing in a randomized trial for platinum-sensitive ovarian cancer, aiming to extend progression-free survival, with interim data expected in Q1 2027. Partnerships with AstraZeneca and Gilead provide financial stability and support a robust early pipeline focused on novel immuno-oncology targets.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938968:0-cgen-com701-and-novel-assets-advance-in-key-trials-with-strong-partnerships-fueling-future-innovation/",
            "pub_date": "2026-02-27 03:55:37",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM32P:0",
            "title": "TopBuild Corp reports results for the quarter ended September 30 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TopBuild Corp </span><span> reported quarterly adjusted earnings of $4.50​​ per share for the quarter ended September 30, lower than the same quarter last year, when the company reported EPS of $5.68.  The mean expectation of fifteen analysts for the quarter was for earnings of $4.54 per share. Wall Street expected results to range from $4.99  to $5.02 per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 1.4% to $1.49 billion from a year ago; analysts expected $1.49 billion. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TopBuild Corp's reported EPS for the quarter was $5.04​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $104.52 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TopBuild Corp shares had risen by 16.3% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had fallen by about 0.7% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 12 \"strong buy\" or \"buy,\" 4 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the construction &amp; engineering peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for TopBuild Corp is $510.00, about 4.8% above its last closing price of $485.32</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 07:57 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>4.54</span></p></td><td><p class=\"\"><span>4.50</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>5.30</span></p></td><td><p class=\"\"><span>5.36</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>5.09</span></p></td><td><p class=\"\"><span>4.63</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>4.42</span></p></td><td><p class=\"\"><span>4.63</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM32P:0-topbuild-corp-reports-results-for-the-quarter-ended-september-30-earnings-summary/",
            "pub_date": "2026-02-27 03:57:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938971:0",
            "title": "IBIO: Advancing next-gen obesity therapies with strong financials and key data readouts ahead",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The discussion highlighted a robust pipeline targeting obesity and related diseases, with multiple assets advancing toward clinical trials and a focus on muscle preservation, weight maintenance, and improved safety profiles. Strong financials support development through 2028, with key data readouts and filings expected over the next 12–24 months.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938971:0-ibio-advancing-next-gen-obesity-therapies-with-strong-financials-and-key-data-readouts-ahead/",
            "pub_date": "2026-02-27 03:57:17",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "modular_finance:b104700bf0be5:0",
            "title": "Communique from extraordinary shareholders’ meeting in Mentice AB",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>An extraordinary shareholders’ meeting was held in Mentice AB (“the Company”) on February 26, 2026. Below follows a summary of the resolutions made at the meeting.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Resolution on the number of board members</span></strong></p><p class=\"\"><span>The shareholders’ meeting resolved that the board of directors shall consist of four ordinary members elected by the shareholders’ meeting, without deputies.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Election of board members</span></strong></p><p class=\"\"><span>The shareholders’ meeting resolved that board members Johann Koss, Lawrence D. Howell and Denis Gestin be re-elected as board members. Göran Malmberg, previously CEO of the Company, was elected, for the period until the next annual shareholders’ meeting, as a new board member in the Company. Former board members David J. Ballard, Eola Änggård Runsten and Magnus Nilsson stepped down from the board.</span></p><p class=\"\"><span>Johann Koss has been a member of the board since 2015, Lawrence D. Howell has been involved with the Company as an owner and board member since 2005 and Denis Gestin has been a member of the board since 2019. Göran Malmberg served as a board member in 2007 before assuming the role of CEO in January 2008, a position he held until December 31, 2024, when Frans Venker assumed the role as new CEO. Since 2025, Göran Malmberg serves as an advisor to the Company and its owners, and following the recent change of ownership, he now in addition assumes the role of board member. Göran Malmberg holds 782,837 shares in the Company.</span></p><p class=\"\"><span>“</span><em><span>I would like to thank Magnus Nilsson, Eola Änggård Runsten and David J. Ballard for their valuable contributions to the board over the past years</span></em><span>”, says Frans Venker, CEO of Mentice AB. “</span><em><span>At the same time, I warmly welcome the newly composed board as we continue executing our strategy and taking Mentice to the next level.</span></em><span>”</span></p><p class=\"\"><span>“</span><em><span>I am excited about the opportunity to work with Frans and the board to support Mentice’s continued growth</span></em><span>”, says Göran Malmberg. “</span><em><span>It is inspiring to see the positive development over the past quarters, and I look forward to working with this focused and experienced board and management team in a company I am deeply passionate about.</span></em><span>”</span></p><p class=\"\"><span>More information regarding the members of the board of directors is presented on the Company website,investor.mentice.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Election of chairman of the board</span></strong></p><p class=\"\"><span>The shareholders’ meeting resolved that Göran Malmberg be appointed as chairman of the board.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The resolutions in their entirety</span></strong></p><p class=\"\"><span>The resolutions in their entirety are available at the Company’s webpage,investor.mentice.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information, please contact:</span></strong></p><p class=\"\"><span>Frans Venker, CEO, Mentice</span></p><p class=\"\"><span>Email:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:frans.venker@mentice.com\" rel=\"nofollow\" target=\"_blank\">frans.venker@mentice.com</a></p><p class=\"\"><span>Mobile +46 (0) 735 25 30 81</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Mentice</span></strong></p><p class=\"\"><span>Mentice (STO: MNTC) is the world leader in proficiency based simulation solutions for image guided therapies. Our solutions help healthcare professionals acquire, retain, and enhance their procedural skills driving improved productivity and outcomes. Mentice solutions are scientifically validated and have been specifically developed for healthcare providers and the medical device industry. Neurovascular, cardiovascular, and peripheral interventions are just some of the clinical areas covered by our solutions. Learn more about the features and benefits of Mentice solutions at:www.mentice.com</span></p><p class=\"\"><span>Marketplace| Nasdaq First North Premium Growth Market, Stockholm | Ticker symbol MNTC</span></p><p class=\"\"><span>Certified Adviser| FNCA Sweden AB</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Attachments</span></strong></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://storage.mfn.se/49aeadd5-05f8-4907-8381-460a56994fc8/communique-from-extraordinary-shareholders-meeting-in-mentice-ab.pdf\" rel=\"nofollow\" target=\"_blank\">Communique from extraordinary shareholders’ meeting in Mentice AB</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/modular_finance:b104700bf0be5:0-communique-from-extraordinary-shareholders-meeting-in-mentice-ab/",
            "pub_date": "2026-02-27 04:00:00",
            "source": "MFN by Modular Finance",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-26:newsml_TnwpnJw1:0",
            "title": "Uniserve Announces Grant of Incentive Stock Options",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>Vancouver, BC: February 26, 2026  -TheNewswire – Uniserve</span><br/><span>Communications Corporation (the “Company” or “Uniserve”)</span><br/><span>, a Canadian provider of managed IT, ISP, cloud, anddata centre services, wishes to announce that it has granted,effective today, an aggregate of 525,000 stock options (each an“Option) to certain consultants of the Company in accordance withthe Company’s Rolling Stock Option Plan. Each Option is exercisableinto one common share in the capital of the Company (each a“Share”) at a price of $0.62 per Share, being the price of theCompany’s shares on the last closing price on the TSX VentureExchange on February 25, 2026. The options granted are exercisable fora two year term expiring February 26, 2028, and vests immediately, andis subject to a four month hold period to June 27, 2026. </span></p><p class=\"\"><span>About Uniserve </span></p><p class=\"\"><span>Uniserve delivers secure, reliable, and customized ITsolutions that power your business forward. With offices in Vancouver,Calgary, and Waterloo, Uniserve provides a full suite of servicesacross three core verticals: Data Centre Solutions, Managed ITServices, and Business Internet. Our data centre infrastructureensures maximum uptime, security, and scalability - so when your ITruns right, your people and your business thrive.</span></p><p class=\"\"><span>This news release was prepared on behalf of the Boardof Directors, which accepts full responsibility for itscontents.</span></p><p class=\"\"><span>Learn more at www.uniserve.com or at www.sedarplus.ca.</span></p><p class=\"\"><span>Kwin Grauer</span></p><p class=\"\"><span>Interim CEO</span></p><p class=\"\"><span>For more information please call 604-395-3961 or emailcorporate.relations@uniserveteam.com.</span></p><p class=\"\"><span>Neither TSX Venture Exchange nor its RegulationsServices Provider (as the term is defined in the policies of the TSXVenture Exchange) accepts responsibility for the adequacy or accuracyof this release. Management has prepared this release and noregulatory authority has approved or disapproved the informationcontained herein. The statements contained in this news release thatare not historical facts are forward looking statements. Suchstatements are based on management’s estimates, assumptions andprojections using available information. Uniserve cautions that actualfinancial results could differ materially from the currentexpectations due to a number of factors.</span></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-26:newsml_TnwpnJw1:0-uniserve-announces-grant-of-incentive-stock-options/",
            "pub_date": "2026-02-27 04:00:03",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013424:0",
            "title": "Cytokinetics Is Maintained at Outperform by Leerink Partners",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013424:0/",
            "pub_date": "2026-02-27 03:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1BN:0",
            "title": "Corn, soybean futures steady in quiet trade",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Spot basis bids for corn and soybeans were flat in the U.S. Midwest on Thursday in quiet trade while corn and soybean futures traded on both sides of unchanged, spot checks showed.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The wheat basis fell at an Ohio port.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>U.S. soybean futures rallied on Thursday to their highest level since mid-2024 on hopes for more U.S. biofuel demand and Chinese imports before the market eased in a profit-taking retreat.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Corn futures also declined on profit-taking and technical selling, and as weekly corn export sales fell below trade expectations, while wheat firmed following three sessions of losses.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The U.S. Department of Agriculture reported weekly net soybean export sales at 407,100 tons, on the low end of a range of analyst expectations.</span></p></li></ul><p class=\"\"><span>      Basis values are quoted against CBOT futures in cents/bu:</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\"><span>Current</span></p></td><td></td><td></td><td><p class=\"\"><span>Previous</span></p></td><td></td><td></td><td></td></tr><tr><td></td><td><p class=\"\"><span>Bid</span></p></td><td></td><td></td><td><p class=\"\"><span>Bid</span></p></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Chicago, Illinois</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Corn processors </span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Corn elevators</span></p></td><td><p class=\"\"><span>-3</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-3</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Soybean elevators</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Wheat elevators</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Wheat processors</span></p></td><td><p class=\"\"><span>-35</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-35</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Decatur IL corn</span></p></td><td><p class=\"\"><span>+2</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+2</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Decatur IL soybeans</span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Burns Harbor IN corn</span></p></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Burns Harbor IN soy</span></p></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Lafayette IN soy</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Toledo OH (port)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Corn</span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>K</span></p></td><td><p class=\"\"><span>+10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>NC</span></p></td></tr><tr><td><p class=\"\"><span>Soy</span></p></td><td><p class=\"\"><span>-10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>K</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>NC</span></p></td></tr><tr><td><p class=\"\"><span>SRW wheat</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-2</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>DN 3</span></p></td></tr><tr><td><p class=\"\"><span>Davenport IA (river)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Corn</span></p></td><td><p class=\"\"><span>-13</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-13</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Soy</span></p></td><td><p class=\"\"><span>-16</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-16</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Evansville IN (rail)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>15-car CSX corn</span></p></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Cincinnati OH (rail)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>3-car corn</span></p></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNQ</span></p></td><td></td><td></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Hereford TX corn</span></p></td><td><p class=\"\"><span>+95</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+95</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Columbus OH (rail)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>3-car corn</span></p></td><td><p class=\"\"><span>+29</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+29</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Morris IL (river)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Corn</span></p></td><td><p class=\"\"><span>-8</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-8</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Soybeans</span></p></td><td><p class=\"\"><span>-10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-10</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Fort Worth TX corn</span></p></td><td><p class=\"\"><span>+95</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>+95</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Blair NE corn</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-5</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Council Bluffs, IA (elevator)</span></p></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td></tr><tr><td><p class=\"\"><span>Corn</span></p></td><td><p class=\"\"><span>-17</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-17</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Soy</span></p></td><td><p class=\"\"><span>-68</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-68</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Des Moines IA soy</span></p></td><td><p class=\"\"><span>-50</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-50</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr><tr><td><p class=\"\"><span>Sioux City IA soy</span></p></td><td><p class=\"\"><span>-55</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>-55</span></p></td><td><p class=\"\"><span>+</span></p></td><td><p class=\"\"><span>H</span></p></td><td><p class=\"\"><span>UNC</span></p></td></tr></tbody></table></div><p class=\"\"><span>      NOTE: 0 = Option Price, UNC = Unchanged, UNQ = Unquoted, NC = Not Comparable, DP = Delayed Price, N/A = Not Available, F = January, H = March, K = May, N = July, Q = August, U = September, X = November, Z = December</span></p><p class=\"\"><span>---------------------------------------------------------</span></p><p class=\"\"><span>     LINKS: (0#USCSHGRN-AM)</span></p><p class=\"\"><span>      For U.S. forward basis spreadsheets, please click on:</span></p><p class=\"\"><span>     (CORN/BASIS), (SOYA/BASIS), (WHEAT/BASIS), (MILO/BASIS)</span></p><p class=\"\"><span>- CBOT corn report </span></p><p class=\"\"><span>- CBOT soybean report </span></p><p class=\"\"><span>- CBOT wheat report </span></p><p class=\"\"><span>- U.S. grain barge freight values </span></p><p class=\"\"><span>- U.S. Midwest cash grain AM </span></p><p class=\"\"><span>- U.S. CIF/FOB Gulf Grain </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1BN:0-corn-soybean-futures-steady-in-quiet-trade/",
            "pub_date": "2026-02-27 03:46:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013430:0",
            "title": "Mirum Pharmaceuticals Is Maintained at Outperform by Leerink Partners",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>(19:48 GMT) </span></strong><span>Mirum Pharmaceuticals Price Target Cut to $118.00/Share From $120.00 by Leerink Partners</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013430:0/",
            "pub_date": "2026-02-27 03:48:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013432:0",
            "title": "Time for Investors to Get Defensive. Sell Staples and Buy Healthcare. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Jacob Sonenshine</span></p><p class=\"\"><span>Investors have plenty of reason to move into defensive stocks. The best way to do it: Sell consumer staples and buy healthcare.</span></p><p class=\"\"><span>For starters, the broader market is looking a little shaky. The S&amp;P 500 has gone nowhere for about four months.</span></p><p class=\"\"><span>Software stocks have fallen off a cliff on the back of competitive threats from the major artificial-intelligence innovators. The market will sort thought which software vendors can stand strong and which will fall, leaving the sector somewhat of a land mine.</span></p><p class=\"\"><span>Meanwhile, semiconductor stocks have rallied, but they are giving back a bit of the gain Thursday, even after Nvidia's stellar guidance, indicating that chip stocks have already priced in much of their expected growth. All in all, there are plenty of potential pressure points on the S&amp;P 500.</span></p><p class=\"\"><span>That's why adding less-volatile stocks to one's portfolio makes sense. The consumer staples, healthcare, and utilities sectors have consistent sales and earnings because aggregate demand for items such as toiletries, groceries, drugs, medical devices, health insurance, and electricity tends to remain relatively stable, no matter what's happening in the economy.</span></p><p class=\"\"><span>Buying exposure to those sectors today is less straightforward. The best strategy is to sell staples and use the proceeds to rotate into healthcare.</span></p><p class=\"\"><span>The Vanguard Consumer Staples Index exchange-traded fund has ripped higher — and looks unattractive. It is up 16% from a multi-month low in early January after having badly underperformed the S&amp;P for years. It was time for staples to enjoy a catch-up trade, so in the past few weeks many market strategists have noted that the group looks overbought. The chart of the past few weeks traces a straight line upward, which means that many investors who wanted more exposure to the sector have already bought in. Going forward, demand for these shares should fade.</span></p><p class=\"\"><span>Fading these hot stocks now makes sense because they're more expensive in the face of weakening fundamentals. Only about 29% of analysts' revisions of 2026 earnings estimates for staples have been upward, according to FactSet, while a little more than half of 2026 revisions for all S&amp;P 500 companies have been upward. Many staples face the possibility of declining business in the long term. Companies such as PepsiCo, Kraft-Heinz, Utz Brands, Mondelez, Hershey, General Mills, Campbell's, Conagra Brands, and J.M. Smucker are facing headwinds from healthier food options. Staples just might not deserve their current valuations.</span></p><p class=\"\"><span>Healthcare is a better bet. Companies in the sector don't appear vulnerable to AI or any other kind of disruption. The analyst community seems calm. About 63% of all 2026 earnings revisions for the sector have been upward.</span></p><p class=\"\"><span>Analysts expect growth. Medical-device makers are expected to grow sales for the long term, as demand for certain types of surgeries rises. Drugmakers are seeing a growth tailwind from GLP-1 weight-loss drugs. Health insurance recently endured a disappointing announcement from the Centers for Medicare &amp; Medicaid Services on funding for insurers, but the stocks look like they have already reflected that setback. Already, UnitedHealth Group, which bottomed this year at $268, has stabilized and is now at $287.</span></p><p class=\"\"><span>UnitedHealth is an important stock in the healthcare sector, with its $261 billion market capitalization representing almost 5% of the S&amp;P 500 Health Care Sector index's total market cap. Further gains in UnitedHealth, which plans to replace certain costs with AI to increase its profit margins and earnings, would support gains in the State Street Health Care Select Sector SPDR ETF.</span></p><p class=\"\"><span>Analysts expect about 6% aggregate annual sales growth for the fund, according to FactSet. That, combined with higher margins, should drive 10% earnings growth annually.</span></p><p class=\"\"><span>That prospect for growth makes its valuation look tolerable. The fund trades at 20.5 times expected earnings for the coming 12 months, just under the S&amp;P 500's 21.9 times. That's not the cheapest it's ever been, but it's normal. It often trades somewhere between a few points below the index and a few points above it. As long as earnings grow close to expectations, the stocks can rise over the next few years.</span></p><p class=\"\"><span>This little tweak — selling staples and buying healthcare — could do wonders for one's portfolio if the market heads south.</span></p><p class=\"\"><span>Write to Jacob Sonenshine at jacob.sonenshine@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013432:0/",
            "pub_date": "2026-02-27 03:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013433:0",
            "title": "Bank of Mexico Raises Forecast for 2026 Economic Growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Anthony Harrup</span></p><p class=\"\"><span>MEXICO CITY--The Bank of Mexico increased its forecast for economic growth this year following a better-than-expected performance in the fourth quarter of 2025.</span></p><p class=\"\"><span>In its quarterly economic report Thursday, the central bank said it expects gross domestic product to expand 1.6% in 2026, up from its previous estimate of 1.1%. The bank left its GDP forecast at 2.0% for 2027.</span></p><p class=\"\"><span>The central bank said it still sees moderately faster growth, although from a higher base than previously estimated.</span></p><p class=\"\"><span>In the fourth quarter, Mexico's GDP grew 0.9% seasonally adjusted from the previous quarter, while third-quarter GDP was revised up to a 0.1% expansion from a previously estimated 0.3% contraction. The economy grew 0.6% in 2025.</span></p><p class=\"\"><span>Private consumption growth is expected to accelerate gradually in 2026, while investment is likely to remain weak, at least until the second half of the year given uncertainty about the trade relationship with the U.S. and the coming review of the U.S.-Mexico Canada Agreement, the Bank of Mexico said. Exports are expected to continue with moderate growth.</span></p><p class=\"\"><span>The balance of risks for growth remains tilted to the downside, the central bank said. Downside risks include greater trade uncertainty with the U.S., geopolitical conflicts that may hurt global growth and trade, and Mexico's higher tariffs on countries with which it doesn't have a trade agreement.</span></p><p class=\"\"><span>Upside risks to its forecast include a successful USMCA review, and the 2026 soccer World Cup which Mexico is co-hosting with the U.S. and Canada, and higher-than-expected U.S. economic growth, the central bank said.</span></p><p class=\"\"><span>Write to Anthony Harrup at anthony.harrup@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013433:0-bank-of-mexico-raises-forecast-for-2026-economic-growth/",
            "pub_date": "2026-02-27 03:49:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938958:0",
            "title": "UMAC: Scaling U.S. drone component production to meet defense demand amid regulatory-driven growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>U.S. drone component manufacturing is rapidly scaling to meet surging defense demand, driven by regulatory shifts and large federal programs. Strong financials, expanded capacity, and a focus on domestic supply position the company for significant growth and future expansion into commercial markets.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938958:0-umac-scaling-u-s-drone-component-production-to-meet-defense-demand-amid-regulatory-driven-growth/",
            "pub_date": "2026-02-27 03:50:09",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013446:0",
            "title": "PROCEPT BioRobotics Is Maintained at Outperform by Leerink Partners",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013446:0/",
            "pub_date": "2026-02-27 03:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZM326:0",
            "title": "Nordic American Tankers Ltd reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nordic American Tankers Ltd </span><span> reported quarterly adjusted earnings of 6 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 1 cents.  The mean expectation of three analysts for the quarter was for earnings of 2 cents per share. Wall Street expected results to range from 9 cents to 18 cents per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 12.2% to $58.76 million from a year ago; analysts expected $72.17 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nordic American Tankers Ltd's reported EPS for the quarter was 6 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $2.78 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Nordic American Tankers Ltd shares had risen by 46.5% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 13% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no negative revisions of earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the oil &amp; gas transportation services peer group is also \"buy\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Nordic American Tankers Ltd is $5.00, about 0.8% below its last closing price of $5.04</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 26 at 07:50 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.14</span></p></td><td><p class=\"\"><span>0.06</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>0.02</span></p></td><td><p class=\"\"><span>-0.01</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.05</span></p></td><td><p class=\"\"><span>-0.04</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2024 </span></p></td><td><p class=\"\"><span>0.04</span></p></td><td><p class=\"\"><span>-0.02</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZM326:0-nordic-american-tankers-ltd-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-27 03:51:02",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938962:0",
            "title": "KYMR: IMiD degrader pipeline advances with strong STAT6 data, IRF5 progress, and solid financial runway",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Focused on IMiD degraders, the pipeline now includes six clinical programs and a robust STAT6 initiative showing strong efficacy and safety in AD and asthma. IRF5 and partnered programs are advancing, with significant cash reserves supporting expansion and multiple Phase 3 campaigns ahead.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938962:0-kymr-imid-degrader-pipeline-advances-with-strong-stat6-data-irf5-progress-and-solid-financial-runway/",
            "pub_date": "2026-02-27 03:51:46",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938963:0",
            "title": "CEMEX: Transformation targets $3.7B EBITDA by 2027 and 40%-50% free cash flow returns to shareholders",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>A comprehensive transformation plan emphasizes operational excellence, disciplined capital allocation, and 3-year sprints with new metrics. The company targets $3.7B EBITDA by 2027, 40%-50% free cash flow returns by 2030, and growth in U.S. aggregates and adjacent businesses, while maintaining a leading role in European decarbonization.</span></p><p class=\"\"><span>Based on CEMEX Investor Day 2026 Audio Transcript — Feb. 26 2026</span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938963:0-cemex-transformation-targets-3-7b-ebitda-by-2027-and-40-50-free-cash-flow-returns-to-shareholders/",
            "pub_date": "2026-02-27 03:51:56",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_report:quartr.com:2938967:0",
            "title": "IBP: 2025 saw higher profits, strong cash flow, and increased capital returns amid mixed end-market trends",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Net revenue grew 1.0% to $2.97 billion in 2025, with gross profit margin up to 34.0% and net income at $265.4 million. Capital returns increased, with $87.6 million in dividends and $172.6 million in share repurchases, while commercial sales offset residential declines. Liquidity remains strong and 2026 guidance anticipates stable but pressured housing demand.</span></p><p class=\"\"><span>Original document: </span><a class=\"link-zw5jRdec\" href=\"https://www.tradingview.com/accounts/signin?next=https%3A%2F%2Fnews-mediator.tradingview.com%2Fdoc-screener%2Fv1%2Ffiles%2Furn%3Areport%3Aquartr.com%3A2938967-49c96aa7886e642236544baaf6abe502\" target=\"_blank\">Installed Building Products, Inc. [IBP] SEC 10-K Annual Report — Feb. 26 2026</a></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_report:quartr.com:2938967:0-ibp-2025-saw-higher-profits-strong-cash-flow-and-increased-capital-returns-amid-mixed-end-market-trends/",
            "pub_date": "2026-02-27 03:53:13",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013482:0",
            "title": "Teladoc Health Is Maintained at Market Perform by Leerink Partners",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013482:0/",
            "pub_date": "2026-02-27 03:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZM0VA:0",
            "title": "Odds of early Warsh-led Fed rate cuts slide with bullish outlook",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>IMF sees limited scope for US rate cuts amid strong economic growth</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>CEO survey shows optimism, ongoing tariff pass-through</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Fed sentiment could tilt more hawkish if jobs data strengthens</span></li></ul></span></div><span><p class=\"\"><span>By Howard Schneider and Ann Saphir</span></p><p class=\"\"><span>    Federal Reserve chair nominee Kevin Warsh's path to out-of-the-gate interest rate cuts in alignment with President Donald Trump's expectations could be narrowing amid emerging bullishness about the U.S. economy, growing CEO confidence in the outlook, and investors keying off a hawkish shift among the central bank's policymakers.</span></p><p class=\"\"><span>The International Monetary Fund said on Wednesday that with expected U.S. growth rising to 2.4% this year from 2.2% last year, the unemployment rate likely hovering near 4%, and inflation falling gradually, the Fed would have \"only modest scope to lower the policy rate over the coming year\" through a single quarter-percentage-point cut.</span></p><p class=\"\"><span>A new Conference Board CEO survey, meanwhile, saw a sharp jump in the outlook for both the wider economy and within each leader's industry, with little sense that large rounds of layoffs were in the offing and firms passing through price increases from the Trump administration's import </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/business/tariffs/\" rel=\"nofollow\" target=\"_blank\">tariffs</a><span> - a combination that could make it harder to justify rate cuts.</span></p><p class=\"\"><span>Investors, meanwhile, have pushed back their bets on the timing of an initial Warsh-led rate cut, to the Fed's July 28-29 meeting from the June 16-17 gathering. Though his nomination has not been formally submitted to the Senate, Warsh is expected to be confirmed in time for the June meeting, with current Fed Chair Jerome Powell's leadership term ending in May.</span></p><p class=\"\"><span>The improved outlook may be good for the economy, but it could leave Warsh in the same bind as Powell, with data and his colleagues pulling in one direction and the White House pulling in another.</span></p><p class=\"\"><span>\"The Fed's reaction function has shifted slightly more hawkish,\" Natixis CIB economists Christopher Hodge and Selin Aker wrote in a note, concluding the central bank could only make two quarter-percentage-point rate cuts this year, rather than the three they previously expected.</span></p><p class=\"\"><span>MIRAN SAYS BIG DROP IN RATES STILL POSSIBLE IN 2026</span></p><p class=\"\"><span>The U.S. central bank's next meeting is scheduled for March 17-18, when its policy-setting Federal Open Market Committee is expected to hold the benchmark interest rate in the 3.50%-3.75% range. New quarterly economic and rate projections also will be released at the end of that meeting.</span></p><p class=\"\"><span>In December, the only central bank official with a rate outlook close to the steep cuts Trump wants was Fed Governor Stephen Miran, the former head of the Trump White House's Council of Economic Advisers. Miran saw the Fed's policy rate falling to as low as the 2.00%-2.25% range in 2026. The median expectation among Miran's colleagues, by contrast, saw just one quarter-percentage-point cut as likely appropriate.</span></p><p class=\"\"><span>Nearly three months later, and after a strong January employment report, Miran on Thursday told the \"Mornings with Maria\" program on Fox Business that he still feels rates could fall a full percentage point this year through four 25-basis-point cuts, ideally sooner than later.</span></p><p class=\"\"><span>His outlook is partly based on his expectation for a \"profoundly disinflationary\" artificial intelligence boost to productivity, a \"supply shock\" that Warsh has also said should allow for lower rates.</span></p><p class=\"\"><span>\"I really do not think that we have an inflation problem,\" despite recent inflation readings a point above the central bank's 2% target, said Miran, whose term as a Fed governor has technically expired, but who can continue to fill the job until a replacement is named. Absent some other departure from the Fed's seven-member Board of Governors, Miran's seat would be needed for Warsh to eventually come aboard.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:675.1188589540412px;aspect-ratio:1.1251980982567353\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM0VA-0fe4eca33767294ce6e632797cf1ee7e-resized.webp\" type=\"image/webp\"/><img alt=\"Line graph showing various measures of inflation and the Federal Reserve's policy rate of interest.\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM0VA-0fe4eca33767294ce6e632797cf1ee7e-resized.webp\" style=\"background-color:#f6f6f6\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Rates and inflation</span></figcaption></figure><p class=\"\"><span>WARSH FACES POSSIBLE DILEMMA</span></p><p class=\"\"><span>The minutes of the Fed's January 27-28 meeting showed little support yet for relying on AI-optimism to recast monetary policy. Staff presentations suggested a small boost in the economy's potential may be developing - the \"supply shock\" Miran has mentioned, but only in a measured dose - though with demand still strong enough to sustain pressure on prices.</span></p><p class=\"\"><span>The minutes also cited unexpected comments that several policymakers were open to the possibility that the next rate move could be a hike. In addition, Fed Governor Christopher Waller, who joined Miran in dissenting in favor of a cut at the meeting in January, said this week that if recent strong job growth is repeated, \"it may be appropriate to hold the FOMC's policy rate at current levels.\"</span></p><p class=\"\"><span>The U.S. employment report for February is due to be released on March 6.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1032.6693227091635px;aspect-ratio:1.7211155378486056\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM0VA-6e8c9505de25e366ce62d7360a03f5d9-resized.webp\" type=\"image/webp\"/><img alt=\"Line graph showing monthly and three month average job gains.\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZM0VA-6e8c9505de25e366ce62d7360a03f5d9-resized.webp\" style=\"background-color:#f8f5f4\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Hiring slows</span></figcaption></figure><p class=\"\"><span>A combination of sticky inflation, a steady unemployment rate, and continued economic growth would in many ways be a comforting outcome for the Fed. Policymakers generally agree that inflation will decline and anticipate the combination of slow job growth and low rates of layoffs will yield a roughly steady unemployment rate. As long as that outlook continues, and absent any sense that public expectations about inflation are starting to shift higher, there would be little motivation to do anything other than wait.</span></p><p class=\"\"><span>     Such an outcome could present a dilemma for Warsh, who has laid out arguments for why rates should fall and now will have to contend with a strong-willed and publicly demonstrative president who has taken the Fed chief nominee at his word. Trump said earlier this month that he had not asked Warsh to lower rates, but felt it was clear what his nominee would do.</span></p><p class=\"\"><span>Trump has clashed with Powell repeatedly over the president's demands for deep rate cuts, but said of Warsh last month: \"I don't want to ask him that question. I think it's inappropriate ... I want to keep it nice and pure. But he certainly wants to cut rates.\"</span></p><p class=\"\"><span>The president also told NBC News he had \"not much\" doubt rates would fall. \"We're way high,\" he said. Trump, who has linked his call for lower rates to hopes of financing federal government debt more cheaply and lowering costs for home mortgages, has voiced little concern about inflation that he feels has disappeared.</span></p><p class=\"\"><span>However, with the economy currently growing beyond estimates of its potential and inflation showing little recent progress toward the Fed's target, there's no sense of urgency at the central bank to cut rates, particularly not as steeply as Trump or Miran have suggested.</span></p><p class=\"\"><span>Trump's State of the Union speech to Congress earlier this week highlighted that paradox, as he trumpeted the good things that he believes have happened and those that are still to come. Many analysts agree a combination of fiscal stimulus in the form of tax cuts, ongoing deregulation, and the loose credit conditions supported by Fed rate cuts last year could spell upside for the economy - and make further reductions in borrowing costs all the less likely.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZM0VA:0-odds-of-early-warsh-led-fed-rate-cuts-slide-with-bullish-outlook/",
            "pub_date": "2026-02-27 03:55:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938942:0",
            "title": "GRF: 2025 saw robust growth, margin focus, and strategic progress, with 2026 targeting higher cash flow",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Revenue and adjusted EBITDA grew strongly in 2025, with free cash flow and leverage targets exceeded. Strategic projects in Egypt and Canada advanced, and 2026 guidance focuses on margin expansion and cash flow, with continued deleveraging and disciplined growth.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938942:0-grf-2025-saw-robust-growth-margin-focus-and-strategic-progress-with-2026-targeting-higher-cash-flow/",
            "pub_date": "2026-02-27 03:41:08",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938943:0",
            "title": "COL: Strong rental growth, disposals, and capital returns drive robust 2025 performance",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>2025 results showed robust rental and earnings growth, outperforming peers in prime CBD markets. €300 million in disposals supported deleveraging, while a €0.32 dividend and €50 million buyback enhance shareholder returns.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938943:0-col-strong-rental-growth-disposals-and-capital-returns-drive-robust-2025-performance/",
            "pub_date": "2026-02-27 03:41:09",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:830d24f9e094b:0",
            "title": "Jane Street Faces New Lawsuit: Trump Media Calls For Federal Investigation",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Jane Street, one of the world’s largest market-making firms, has come under growing scrutiny as a series of allegations have surfaced linking the company to major disruptions in the crypto market. </span></p><p class=\"\"><span>The firm is already facing a federal lawsuit tied to the collapse of Terraform Labs, and now new claims circulating on social media suggest that Trump Media has accused Jane Street and other trading firms of “naked short selling” in a letter to Congress.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jane Street Rejects Terra Allegations</span></strong></p><p class=\"\"><span>The legal troubles began earlier this week. On February 23, a lawsuit was filed in the US District Court for the Southern District of New York accusing Jane Street of using confidential information obtained from Terraform Labs to shield itself from heavy losses before the Terra/Luna ecosystem unraveled in May 2022. </span></p><p class=\"\"><span>According to the complaint, Jane Street allegedly leveraged insider knowledge to avoid more than $200 million in potential losses ahead of the implosion. The firm has strongly denied the accusations, characterizing the lawsuit as “desperate” and describing it as a “transparent attempt to extract money.”</span></p><p class=\"\"><span>Beyond the courtroom, additional claims have gained traction online. Some market participants have alleged that Jane Street manipulated Bitcoin (BTC) prices by operating an algorithm that allegedly triggered consistent sell-offs at 10 a.m. each day for months. </span></p><p class=\"\"><span>According to these claims, the strategy involved pushing prices lower, triggering liquidations among retail traders, and then repurchasing Bitcoin at reduced levels in a repeated cycle. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Naked Short Selling Inquiry</span></strong></p><p class=\"\"><span>Adding another layer to the controversy, market commentator MartyParty stated on Thursday that Trump Media had sent a letter to members of Congress calling for a full investigation into Jane Street, Citadel and other firms over alleged naked short selling. </span></p><p class=\"\"><span>Naked short selling refers to the practice of selling shares without first borrowing them, a tactic that is restricted under US securities law. </span></p><p class=\"\"><span>As of Thursday afternoon Eastern Time, there had been no official confirmation of such a letter, nor any public statement from Trump Media, Jane Street, or Citadel verifying the claim.</span></p><p class=\"\"><span>Featured image from OpenArt, chart from TradingView.com </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:830d24f9e094b:0-jane-street-faces-new-lawsuit-trump-media-calls-for-federal-investigation/",
            "pub_date": "2026-02-27 03:41:12",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013407:0",
            "title": "AdaptHealth Is Maintained at Outperform by Leerink Partners",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013407:0/",
            "pub_date": "2026-02-27 03:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM15Z:0",
            "title": "Melania Trump to chair a meeting of the UN Security Council, White House says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>UN session to focus on children</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>First leader's spouse to chair the Security Council</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>US has $4 billion arrears on dues to UN</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Melania Trump advocated for return of Ukrainian children taken to Russia</span></li></ul></span></div><span><p class=\"\"><span>    First lady Melania Trump will chair a meeting of the United Nations Security Council on Monday as the U.S. takes over the monthly rotating presidency, the White House said.</span></p><p class=\"\"><span>Her office said in a statement on Wednesday she will emphasize education as a way to advance tolerance and world peace in her remarks at the meeting, titled \"Children, Technology, and Education in Conflict.\"</span></p><p class=\"\"><span>    A U.N. spokesperson said it would be the first time a spouse of any serving world leader has chaired a meeting of the 15-member Security Council.   </span></p><p class=\"\"><span>U.S. President Donald Trump has been a vocal critic of the United Nations since his first White House term, saying the 193-member world body was ineffective and needed reforms. The United States is billions of dollars behind in its contributions to the U.N. budget. </span></p><p class=\"\"><span>    Asked at a regular briefing if Melania Trump's appearance  was a positive sign for U.N.-U.S. relations, U.N. spokesperson Stephane Dujarric said it showed \"the importance that the United States feels towards the Security Council and the subject at hand,\" referring to the meeting's agenda.  </span></p><p class=\"\"><span>    The first lady has stayed out of the public eye for much of Trump's presidencies but has been an advocate for children's causes in the past, including by writing a letter to Russian President Vladimir Putin in 2025     calling for the return     of Ukrainian children taken to Russia during the war.   </span></p><p class=\"\"><span>    She was the subject and executive producer of a big-budget     documentary film released in January    .   </span></p><p class=\"\"><span>The president struck a more conciliatory tone toward the U.N. last week at the first meeting of his Board of Peace, an initiative he said aims to resolve conflicts globally but one that many world leaders worry was designed to replace the United Nations.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>\"The Board of Peace is going to almost be looking over the United Nations and making sure it runs properly,\" Trump said on February 19. \"We're going to strengthen up the United Nations. We're going to make sure its facilities are good</span></li><li class=\"listItem-bmN0_SHH\"><span>We're going to help them money-wise.\"</span></li></ul><p class=\"\"><span>    The United Nations last week said it received about $160 million this month of the more than $4 billion in U.S. dues arrears to the United Nations. That amount appears to have grown substantially during Trump's presidency.  </span></p><p class=\"\"><span>    Historically, the U.S. has been the biggest contributor to the U.N. budget. But under Trump, it has refused to make mandatory payments to regular and peacekeeping budgets and slashed voluntary funding to U.N. agencies.  </span></p><p class=\"\"><span>    The Security Council is the U.N. body charged with maintaining international peace and security and has the power to make legally binding decisions.  </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM15Z:0-melania-trump-to-chair-a-meeting-of-the-un-security-council-white-house-says/",
            "pub_date": "2026-02-27 03:44:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938944:0",
            "title": "ENGN: Detalimogene shows 62% six-month CR rate in NMIBC, with launch targeted for 2027",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Detalimogene voraplasmid is advancing as a non-viral gene therapy for NMIBC, showing strong efficacy and tolerability in pivotal trials, with a six-month CR rate of 62%. The product offers significant advantages in ease of use, manufacturing, and cost, with a BLA filing planned for late 2024 and potential launch in 2027.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938944:0-engn-detalimogene-shows-62-six-month-cr-rate-in-nmibc-with-launch-targeted-for-2027/",
            "pub_date": "2026-02-27 03:44:43",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2938945:0",
            "title": "VPT: Strategic focus shifts to commercialization, with revenue growth targeted for Q2 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The meeting highlighted a strategic pivot to commercial adoption, with strong progress in partnerships, regulatory milestones, and market expansion. Revenue growth is expected to begin in Q2 2026, supported by new hires and operational improvements. </span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2938945:0-vpt-strategic-focus-shifts-to-commercialization-with-revenue-growth-targeted-for-q2-2026/",
            "pub_date": "2026-02-27 03:44:45",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZM1A5:0",
            "title": "London cocoa prices slip back towards recent lows",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>    London cocoa futures fell on Thursday, slipping back towards a near three-year low they had touched earlier this week, while coffee prices also declined.</span></p><p class=\"\"><span>COCOA</span></p><p class=\"\"><span>* London cocoa </span><span> ​​settled down 16 pounds, or 0.7%, at 2,156 pounds per metric ton. The market had set a near three-year low of 2,075 pounds on Tuesday.</span></p><p class=\"\"><span>* Dealers said a pick-up in selling out of Ivory Coast and Ghana, the world's top two producers, had contributed to recent weakness.</span></p><p class=\"\"><span>* Ivory Coast plans to bring forward the start of its cocoa mid-crop season for the first time, allowing the regulator to sharply reduce its set price paid to farmers in the hope of boosting sales, two government sources and two regulator sources told Reuters.</span></p><p class=\"\"><span>* New York cocoa </span><span> rose 0.4% to $3,063 a ton.</span></p><p class=\"\"><span>* Brazil's cocoa industry group AIPC said on Thursday the government ban on Ivory Coast cocoa imports could hurt the sector, even leading to plant closures, as the country is not self-sufficient in the crop.</span></p><p class=\"\"><span>COFFEE</span></p><p class=\"\"><span>    * Robusta coffee </span><span> settled down $64, or 1.7%, at $3,639 a ton. The market slumped to a six-month low of $3,517 on Monday.  </span></p><p class=\"\"><span>     * Dealers said farmers in top robusta producer Vietnam remained reluctant to sell at current depressed prices.</span></p><p class=\"\"><span>* \"Activities picked up after the (Lunar New Year) holiday, but farmers are still not selling in bulk as they are still betting on higher prices,\" said one trader in Vietnam.</span></p><p class=\"\"><span>* Arabica coffee </span><span> fell 0.9% to $2.823 per pound.</span></p><p class=\"\"><span>* Brazilian coffee exports in the 2026/27 season could hit a record high of close to 47 million 60kg bags, driven by greater supply of arabica beans owing to a bumper crop, Hedgepoint Global Markets said in a report on Wednesday.</span></p><p class=\"\"><span>SUGAR</span></p><p class=\"\"><span>* Raw sugar </span><span> ​settled down 0.18 cent, or 1.2%, at 14.41 cents per pound. The spot contract will expire on Friday. </span></p><p class=\"\"><span>* Dealers said despite the fall, the market was finding some support from factors including a declining outlook for production in India and the prospect of a smaller beet area in the European Union this year.</span></p><p class=\"\"><span>* White sugar </span><span> rose 0.2% to $407.90 a ton.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZM1A5:0-london-cocoa-prices-slip-back-towards-recent-lows/",
            "pub_date": "2026-02-27 03:44:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260226013417:0",
            "title": "This HVAC and Plumbing Stock Has Crushed Nvidia. Insiders Are Taking Profits. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Mackenzie Tatananni</span></p><p class=\"\"><span>Comfort Systems USA, a supplier of construction services to data centers, has become one of Wall Street's favorite ways to play the artificial-intelligence boom. Now, company insiders are taking profits on the heels of strong quarterly results.</span></p><p class=\"\"><span>Shares of the HVAC and plumbing company have jumped more than 2,000% over the past five years, outperforming the S&amp;P 500 and AI darling Nvidia.</span></p><p class=\"\"><span>The company's latest quarterly earnings, posted on Feb. 19, gave the stock another boost. Since that report, four insiders at the firm have sold shares, and another four have signaled their intent to sell.</span></p><p class=\"\"><span>Chief Financial Officer George William III sold 9,000 shares for a total of $13.3 million on Monday. A Form 4 filed with the Securities and Exchange Commission shows William exercised his right to buy the shares for $42.50 apiece on the same day before selling them for roughly $1,434.97 each.</span></p><p class=\"\"><span>Following the transaction, William directly owned 37,824 shares or $54.9 million worth of company stock based on Wednesday's closing price of $1,450.60.</span></p><p class=\"\"><span>Also on Monday, company director Pablo Mercado sold 500 shares for $1,405 apiece, according to a separate filing. The sale brought Mercado's direct holdings to 3,500 shares, valued at roughly $5.1 million.</span></p><p class=\"\"><span>Ellen Skidmore, another director, sold 1,000 shares at $1,425 each on Tuesday, another filing shows. Skidmore directly owned 12,627 shares after the sale, worth $18.3 million.</span></p><p class=\"\"><span>The most recent sale occurred on Thursday when director William Sandbrook sold 2,500 shares for around $1,443.32 apiece. At last check, Sandbrook held 8,996 shares directly and 170 shares indirectly, according to an SEC filing.</span></p><p class=\"\"><span>Other forms filed Tuesday and Wednesday with the agency indicate that four additional insiders are gearing up to sell shares. Among them is Reed Terrence, the company's senior vice president and chief human resources officer.</span></p><p class=\"\"><span>Barron's reached out to Comfort Systems for comment on the transactions.</span></p><p class=\"\"><span>Comfort Systems provides mechanical, electrical, and plumbing services through a network of contracting businesses across the U.S.</span></p><p class=\"\"><span>Inside Scoop is a regular Barron's feature covering stock transactions by corporate executives and board members — so-called insiders — as well as large shareholders, politicians, and other prominent figures. Due to their insider status, these investors are required to disclose stock trades with the Securities and Exchange Commission or other regulatory groups.</span></p><p class=\"\"><span>Write to Mackenzie Tatananni at mackenzie.tatananni@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260226013417:0/",
            "pub_date": "2026-02-27 03:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}