{
    "data": [
        {
            "id": "DJN_DN20250204013369:0",
            "title": "Nasdaq Composite Market Diary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                       Today   Previous <br/>                       -----   -------- <br/>  Advanced             3,039      1,304 <br/>  Declined             1,320      3,095 <br/>  Unchanged              136        124 <br/>  Total Issues         4,495      4,523 <br/>  New Highs               98         62 <br/>  New Lows               119        233 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013369:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013372:0",
            "title": "NYSE Composite Market Diary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                       Today   Previous <br/>                       -----   -------- <br/>  Advanced             1,936        885 <br/>  Declined               810      1,901 <br/>  Unchanged               91         65 <br/>  Total Issues         2,837      2,851 <br/>  New Highs               67         38 <br/>  New Lows                45         98 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013372:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013371:0",
            "title": "NYSE American Composite Market Diary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                       Today   Previous <br/>                       -----   -------- <br/>  Advanced               182        116 <br/>  Declined               110        169 <br/>  Unchanged                8         10 <br/>  Total Issues           300        295 <br/>  New Highs                2          3 <br/>  New Lows                 5         11 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013371:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013353:0",
            "title": "NOV Reports Fourth Quarter and Full-Year 2024 Earnings",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(22:45 GMT) </strong>*NOV 4Q Net $438M &gt;NOV<br/><strong class=\"root-Tkn6WL2y\">(22:45 GMT) </strong>*NOV 4Q Rev $2.31B &gt;NOV<br/><strong class=\"root-Tkn6WL2y\">(22:45 GMT) </strong>*NOV 4Q EPS 41c &gt;NOV<br/><strong class=\"root-Tkn6WL2y\">(22:45 GMT) </strong>Press Release: NOV Reports Fourth Quarter and Full-Year 2024 Earnings</p><p class=\"\">NOV Reports Fourth Quarter and Full-Year 2024 Earnings</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Fourth quarter net income of $160 million, or $0.41 per diluted share     </li><li class=\"listItem-bmN0_SHH\">Fourth quarter Adjusted EBITDA* of $302 million     </li><li class=\"listItem-bmN0_SHH\">Fourth quarter cash flows from operations of $591 million and Free Cash   Flow* of $473 million     </li><li class=\"listItem-bmN0_SHH\">Fourth quarter capital equipment orders of $757 million, representing a   book-to-bill of 121%     </li><li class=\"listItem-bmN0_SHH\">Returned $141 million to shareholders during the fourth quarter   </li><li class=\"listItem-bmN0_SHH\">Full-year net income of $635 million, or $1.60 per diluted share     </li><li class=\"listItem-bmN0_SHH\">Full-year Adjusted EBITDA* of $1.11 billion     </li><li class=\"listItem-bmN0_SHH\">Full-year cash flows from operations of $1.30 billion and Free Cash   Flow* of $953 million     </li><li class=\"listItem-bmN0_SHH\">Full-year capital equipment orders of $2.75 billion, representing a   book-to-bill of 122%     </li><li class=\"listItem-bmN0_SHH\">Returned $337 million to shareholders during the year   </li></ul><p class=\"\">* Free Cash Flow, Excess Free Cash Flow and Adjusted EBITDA are non-GAAP measures, see \"Non-GAAP Financial Measures,\" \"Reconciliation of Cash Flows from Operating Activities to Free Cash Flow and Excess Free Cash Flow,\" and \"Reconciliation of Net Income to Adjusted EBITDA\" below.</p><p class=\"\">HOUSTON--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">NOV Inc.  today reported fourth quarter 2024 revenues of $2.31 billion, a decrease of one percent compared to the fourth quarter of 2023. Net income decreased $438 million, or $1.10 per diluted share, year-over-year from $598 million, which included the release of valuation allowances on deferred tax assets of $485 million. Operating profit increased 29 percent to $207 million, or 9.0 percent of sales. The Company recorded $7 million in pre-tax charges within Other Items (see Corporate Information for additional details). Adjusted EBITDA increased three percent year-over-year to $302 million, or 13.1 percent of sales.</p><p class=\"\">Revenues for the full-year 2024 were $8.87 billion, an increase of $287 million from 2023. Net income for the full-year 2024 was $635 million, a decrease of $358 million from $993 million in 2023, which included the release of valuation allowances on deferred tax assets of $485 million. Operating profit increased 35 percent to $876 million, or 9.9 percent of sales for the full-year 2024. Adjusted EBITDA increased 11 percent to $1.11 billion or 12.5 percent of sales for the full-year 2024.</p><p class=\"\">\"NOV's fourth quarter rounded out a solid year during which we grew backlog and revenue, improved profitability, and generated substantial amounts of cash flow,\" stated Clay Williams, Chairman, President and CEO. \"Full-year revenues improved three percent with 38 percent Adjusted EBITDA flow through, and fully-diluted earnings were $1.60 per share. Our longer-cycle capital equipment businesses increased backlog by seven percent, driven by strong offshore production related demand, while market share gains from new, higher margin technologies and services continue to drive growth and improve profitability.</p><p class=\"\">\"Higher levels of profitability combined with normalization of the global supply chain and working capital enabled us to convert 86 percent of our Adjusted EBITDA into Free Cash Flow, and allowed us to increase our cash balance by $414 million and return $337 million in cash to our shareholders, or 41 percent of our Excess Free Cash Flow*. We remain committed to returning at least 50 percent of our Excess Free Cash Flow on an annual basis and expect to achieve that threshold for 2024 via a supplemental dividend in the first half of 2025.</p><p class=\"\">\"For 2025, we expect a more challenging macro environment and geopolitical uncertainties to result in flat-to-lower global industry activity. However, we expect that NOV's growing backlog of higher margin offshore production-related capital equipment, along with continued market adoption of its new technologies, will enable NOV to continue to improve profitability and generate healthy levels of cash flow through the year.\"</p><p class=\"\">Energy Products and Services</p><p class=\"\">Energy Products and Services generated revenues of $1.06 billion in the fourth quarter of 2024, a decrease of one percent from the fourth quarter of 2023. Operating profit increased $18 million from the prior year to $112 million, or 10.6 percent of sales, and included $3 million in Other Items. Adjusted EBITDA decreased $20 million from the prior year to $173 million, or 16.3 percent of sales. The decrease in revenue and Adjusted EBITDA was primarily due to lower levels of global drilling activity, but this was partially offset by growing adoption of the Company's new technologically advanced product offerings.</p><p class=\"\">Energy Equipment</p><p class=\"\">Energy Equipment generated revenues of $1.29 billion in the fourth quarter of 2024, a decrease of one percent from the fourth quarter of 2023. The decline in revenue was due primarily to the divestiture of the Company's Pole Products business in early 2024 and lower revenue from aftermarket support; however, this was mostly offset by higher revenue from the segment's growing backlog. Operating profit increased $31 million from the prior year to $152 million, or 11.8 percent of sales, and included $4 million in Other Items. Adjusted EBITDA increased $38 million from the prior year to $185 million, or 14.4 percent of sales. Profitability improved due to strong execution on higher margin projects from the segment's backlog.</p><p class=\"\">New orders booked during the quarter totaled $757 million, representing a book-to-bill of 121 percent when compared to the $628 million shipped from backlog. As of December 31, 2024, backlog for capital equipment orders for Energy Equipment was $4.43 billion, an increase of $279 million from the fourth quarter of 2023.</p><p class=\"\">First Quarter 2025 Outlook</p><p class=\"\">The Company is providing financial guidance for the first quarter of 2025. Guidance is based on current outlook and plans and is subject to a number of known and unknown uncertainties and risks and constitutes \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934 as further described under the Cautionary Statement below. Actual results may differ materially from the guidance set forth below.</p><p class=\"\">For the first quarter of 2025 management expects year-over-year consolidated revenues to be down one to three percent with Adjusted EBITDA between $235 million and $265 million.</p><p class=\"\">Corporate Information</p><p class=\"\">NOV repurchased 7.5 million shares of common stock for $112 million during the fourth quarter. For the full year, the Company repurchased 14.2 million shares of common stock for an aggregate amount of $229 million. Including dividends, NOV returned $337 million in capital to shareholders during 2024. The Company expects to return at least 50 percent of Excess Free Cash Flow (defined as cash flows from operations less capital expenditures and other investments, including acquisitions and divestitures) through a combination of steady, quarterly base dividends, opportunistic stock buybacks, and a supplemental dividend to true-up returns to shareholders on an annual basis.</p><p class=\"\">During the fourth quarter of 2024, NOV recorded $7 million in Other Items, primarily related to severance and facility closure costs (see Reconciliation of Net Income to Adjusted EBITDA).</p><p class=\"\">As of December 31, 2024, the Company had total debt of $1.74 billion, with $1.50 billion available on its primary revolving credit facility, and $1.23 billion in cash and cash equivalents.</p><p class=\"\">Significant Achievements</p><p class=\"\">NOV secured multiple orders for advanced gas processing and water treatment equipment packages on three newbuild floating production storage and offloading (FPSO) units destined for operations in Brazil and West Africa. The scope of work includes technologies and modules for natural gas dehydration, CO2 handling, and produced water treatment. NOV was also awarded a contract to deliver newbuild gas processing modules for the redeployment of an FPSO that will be operated in Turkey. The orders reflect NOV's strong reputation and position in the offshore production equipment market.</p><p class=\"\">NOV secured a contract to supply a drilling equipment package for a new jack-up rig to be built in Saudi Arabia. The package includes complete topside equipment, structures, drilling machinery, pipe handling, mud processing, and drilling controls, as well as the blowout preventer (BOP) and BOP control system. This award highlights NOV's extensive experience in delivering complex drilling equipment packages, having successfully delivered more than 220 newbuild jack-up packages to the market over the last 15 years.</p><p class=\"\">NOV was awarded a contract to supply an offshore mooring and injection system for a pioneering Carbon Capture and Storage project offshore Denmark. This project aims to safely and permanently store CO2 in depleted Danish North Sea reservoirs. Leveraging NOV's extensive expertise in gas and fluid transfer, the offshore injection system will enable direct injection of CO2 from transport vessels to the reservoir. This project represents the first application of NOV technology to offshore CO2 injection and exemplifies the Company's ability to serve as a critical supplier for advanced carbon capture projects.</p><p class=\"\">NOV secured a contract to deliver Monoethylene Glycol (MEG) recovery and solids separation systems for a large-scale gas treatment facility in the Middle East. The MEG system will enable efficient recovery of hydrate inhibitors used to support production flowline integrity while the proprietary solids separation technology will remove production-related contaminants, thereby enhancing field productivity and operational efficiency. This award highlights NOV's leadership in delivering innovative production solutions for use in demanding environments.</p><p class=\"\">NOV secured contracts to supply its Bondstrand(TM) 2400-10C-ECP01 glass-reinforced epoxy (GRE) piping for the critical ballast piping systems across a major energy company's Liquified Natural Gas (LNG) fleet expansion program. This includes 12 vessels, all of which will use the same innovative design. The order reflects NOV's expertise in providing advanced composite solutions that enhance the performance and reliability of vessels, positioning the brand as a preferred partner among global LNG carriers.</p><p class=\"\">NOV's Max(TM) digital solutions continued to gain traction, with its Max Completions(TM) monitoring solution supporting frac operations for major operators in the Williston, Eagleford, and Haynesville Basins during the quarter, utilizing Remote Frac Monitoring (RFM) and frac valve positioning sensors to provide real-time well state information and operational visibility. Additionally, NOV secured initial deployments of its new Max Production(TM) optimization platform, which will leverage predictive analytics to optimize well performance and boost production efficiency. These milestones demonstrate NOV's ability to deliver value with advanced digital technologies across completion and production operations.</p><p class=\"\">NOV signed a tri-party Memorandum of Understanding (MoU) with the leading operator and a leading drilling contractor in Malaysia to accelerate the implementation of energy-efficient rig technologies, automation, and robotics solutions. The collaboration focuses on deploying NOV's NOVOS(TM) automation system and robotics technology on the contractor's rigs in Malaysia. The operator will provide strategic guidance and scalable opportunities, while the contractor will oversee system deployment and integration, and NOV will deliver the technology, technical support, and training for its advanced robotics and automation technologies that drive operational efficiencies and improve safety.</p><p class=\"\">NOV has been awarded a contract to supply its proprietary static mixer heat transfer technology for a global chemical company's polyethylene production project. This advanced technology significantly enhances heat exchanger efficiency across a range of applications. This award marks a continuation of a 20-year partnership, during which NOV has delivered a cumulative total of 50 miles of heat transfer inserts to support the customer's polyethylene production projects.</p><p class=\"\">NOV secured orders for three bespoke Arctic Mast coiled tubing units which will be deployed on the North Slope of Alaska. These orders were the result of months of detailed engineering and collaboration between the service company and NOV. Additionally, NOV delivered five coiled tubing spreads to a multinational well service company. These projects reflect NOV's leadership in high-specification coiled tubing equipment.</p><p class=\"\">NOV's Fiber Glass Systems business unit secured multiple project awards from a major engineering, procurement, and construction company for the expansion of a large semiconductor fabrication site. This facility already uses a wide range of NOV's composite pipes, fittings, and custom fiber-reinforced plastic equipment, including 40 dual laminate composite tanks and vessels NOV manufactured for the project in 2024. The additional awards signify NOV's position as a trusted supplier of composite solutions for critical applications in the semiconductor industry.</p><p class=\"\">NOV's 3-1/8\" TerraPULSE(TM) Agitator(TM) tool was successfully deployed for the first time in Saudi Arabia, marking a significant milestone in the global application of NOV's unconventional resource and extended lateral-focused technologies. The TerraPULSE tool was run on 2-3/8\" coiled tubing in conjunction with a milling bottom hole assembly (BHA) to efficiently mill out 67 composite frac plugs in a 10,000-foot horizontal lateral. Initially developed for the North American unconventional market, this deployment highlights NOV's ability to deliver enhanced performance in international unconventional developments, further expanding the global reach of its advanced technology solutions.</p><p class=\"\">NOV secured significant awards for Managed Pressure Drilling (MPD) equipment from two major independent offshore drilling contractors. These awards include the delivery of two RGH(TM) (Riser Gas Handling) systems, designed to safely divert wellbore flow away from the rig floor, enhancing safety and operational efficiency. The initial systems will operate in the Gulf of Mexico. Additionally, NOV was awarded a contract for its advanced offshore MPD system, featuring an integrated riser joint, spare umbilical, and umbilical termination head. This system will support the client's first MPD well.</p><p class=\"\">Fourth Quarter Earnings Conference Call</p><p class=\"\">NOV will hold a conference call to discuss its fourth quarter 2024 results on February 5, 2025 at 10:00 AM Central Time (11:00 AM Eastern Time). The call will be broadcast simultaneously at www.nov.com/investors. A replay will be available on the website for 30 days.</p><p class=\"\">About NOV</p><p class=\"\">NOV  delivers technology-driven solutions to empower the global energy industry. For more than 150 years, NOV has pioneered innovations that enable its customers to safely produce abundant energy while minimizing environmental impact. The energy industry depends on NOV's deep expertise and technology to continually improve oilfield operations and assist in efforts to advance the energy transition towards a more sustainable future. NOV powers the industry that powers the world.</p><p class=\"\">Visit www.nov.com for more information.</p><p class=\"\">Non-GAAP Financial Measures</p><p class=\"\">This press release contains certain non-GAAP financial measures that management believes are useful tools for internal use and the investment community in evaluating NOV's overall financial performance. These non-GAAP financial measures are broadly used to value and compare companies in the oilfield services and equipment industry. Not all companies define these measures in the same way. In addition, these non-GAAP financial measures are not a substitute for financial measures prepared in accordance with GAAP and should therefore be considered only as supplemental to such GAAP financial measures. Additionally, Free Cash Flow and Excess Free Cash Flow do not represent the Company's residual cash flow available for discretionary expenditures, as the calculation of these measures does not account for certain debt service requirements or other non-discretionary expenditures. Please see the attached schedules for reconciliations of the differences between the non-GAAP financial measures used in this press release and the most directly comparable GAAP financial measures.</p><p class=\"\">This press release contains certain forward-looking non-GAAP financial measures, including Adjusted EBITDA. The Company has not provided a reconciliation of projected Adjusted EBITDA. Management cannot predict with a reasonable degree of accuracy certain of the necessary components of net income, such as other income (expense), which includes fluctuations in foreign currencies. As such, a reconciliation of projected net income to projected Adjusted EBITDA is not available without unreasonable effort. The actual amount of other income (expense), provision (benefit) for income taxes, equity income (loss) in unconsolidated affiliates, depreciation and amortization, and other amounts excluded from Adjusted EBITDA could have a significant impact on net income.</p><p class=\"\">Cautionary Statement for the Purpose of the \"Safe Harbor\" Provisions of the Private Securities Litigation Reform Act of 1995</p><p class=\"\">Statements made in this press release that are forward-looking in nature are intended to be \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 and may involve risks and uncertainties. Statements that are not historical facts, including statements about our beliefs and expectations, are forward-looking statements. Forward-looking statements typically are identified by use of terms such as \"may,\" \"believe,\" \"plan,\" \"will,\" \"expect,\" \"anticipate,\" \"estimate,\" \"should,\" \"forecast,\" and similar words, although some forward-looking statements are expressed differently. These statements may differ materially from the actual future events or results. Readers are referred to documents filed by NOV with the Securities and Exchange Commission, including the Annual Report on Form 10-K, which identify significant risk factors which could cause actual results to differ from those contained in the forward-looking statements. These statements speak only as of the date of this document, and we undertake no obligation to update or revise the statements, except as may be required by law.</p><p class=\"\">Certain prior period amounts have been reclassified in this press release to be consistent with current period presentation.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/> <br/>                                   NOV INC. <br/>                CONSOLIDATED STATEMENTS OF INCOME (Unaudited) <br/>                     (In millions, except per share data) <br/>                           Three Months Ended                 Year Ended <br/>                   ----------------------------------- <br/>                                            September <br/>                        December 31,           30,           December 31, <br/>                   ----------------------               ---------------------- <br/>                    2024        2023        2024         2024        2023 <br/>                    -----       -----       -----  ---   -----       ----- <br/>Revenue: <br/>   Energy <br/>    Products and <br/>    Services       $1,060      $1,073      $1,003       $4,130      $4,077 <br/>   Energy <br/>    Equipment       1,287       1,305       1,219        4,888       4,669 <br/>   Eliminations       (39)        (35)        (31)        (148)       (163) <br/>                    -----       -----       -----        -----       ----- <br/>      Total <br/>       revenue      2,308       2,343       2,191        8,870       8,583 <br/>Gross profit          493         497         469        2,010       1,833 <br/>Gross profit %       21.4%       21.2%       21.4%        22.7%       21.4% <br/> <br/>Selling, general, <br/> and <br/> administrative       286         336         275        1,134       1,182 <br/>                    -----       -----       -----  ---   -----       ----- <br/>   Operating <br/>    profit            207         161         194          876         651 <br/>Interest Expense, <br/> net                  (13)        (16)        (10)         (53)        (60) <br/>Equity income <br/> (loss) in <br/> unconsolidated <br/> affiliates            (1)         18          --           36         119 <br/>Other income <br/> (expense), net         6         (28)        (10)         (28)        (98) <br/>                    -----       -----       -----        -----       ----- <br/>   Income before <br/>    income taxes      199         135         174          831         612 <br/>Provision <br/> (benefit) for <br/> income taxes          38        (460)         44          196        (373) <br/>                    -----       -----       -----  ---   -----       ----- <br/>   Net income         161         595         130          635         985 <br/>Net income (loss) <br/> attributable to <br/> noncontrolling <br/> interests              1          (3)         --           --          (8) <br/>                    -----       -----       -----  ---   -----       ----- <br/>   Net income <br/>    attributable <br/>    to Company     $  160      $  598      $  130       $  635      $  993 <br/>                    =====       =====       =====  ===   =====       ===== <br/>Per share data: <br/>   Basic           $ 0.41      $ 1.52      $ 0.33       $ 1.62      $ 2.53 <br/>                    =====       =====       =====  ===   =====       ===== <br/>   Diluted         $ 0.41      $ 1.51      $ 0.33       $ 1.60      $ 2.50 <br/>                    =====       =====       =====  ===   =====       ===== <br/>Weighted average <br/>shares <br/>outstanding: <br/>   Basic              388         393         392          392         393 <br/>                    =====       =====       =====  ===   =====       ===== <br/>   Diluted            390         397         395          396         397 <br/>                    =====       =====       =====  ===   =====       ===== <br/> <br/> <br/> <br/>                              NOV INC. <br/>              CONSOLIDATED BALANCE SHEETS (Unaudited) <br/>                            (In millions) <br/>                                                     December 31, <br/>                                                  ------------------ <br/>                                                    2024     2023 <br/>                                                   ------   ------ <br/>ASSETS <br/>Current assets: <br/>   Cash and cash equivalents                      $ 1,230  $   816 <br/>   Receivables, net                                 1,819    1,905 <br/>   Inventories, net                                 1,932    2,151 <br/>   Contract assets                                    577      739 <br/>   Other current assets                               212      229 <br/>                                                   ------   ------ <br/>      Total current assets                          5,770    5,840 <br/> <br/>Property, plant and equipment, net                  1,922    1,865 <br/>Lease right-of-use assets                             549      544 <br/>Goodwill and intangibles, net                       2,138    2,012 <br/>Other assets                                          982    1,033 <br/>                                                   ------   ------ <br/>      Total assets                                $11,361  $11,294 <br/>                                                   ======   ====== <br/> <br/>LIABILITIES AND STOCKHOLDERS' EQUITY <br/>Current liabilities: <br/>Accounts payable                                  $   837  $   904 <br/>   Accrued liabilities                                861      870 <br/>   Contract liabilities                               492      532 <br/>   Current portion of lease liabilities               102       94 <br/>   Current portion of long-term debt                   37       13 <br/>   Accrued income taxes                                18       22 <br/>                                                   ------   ------ <br/>      Total current liabilities                     2,347    2,435 <br/> <br/>Long-term debt                                      1,703    1,712 <br/>Lease liabilities                                     544      558 <br/>Other liabilities                                     339      347 <br/>                                                   ------   ------ <br/>      Total liabilities                             4,933    5,052 <br/> <br/>      Total stockholders' equity                    6,428    6,242 <br/>                                                   ------   ------ <br/>      Total liabilities and stockholders' equity  $11,361  $11,294 <br/>                                                   ======   ====== <br/> <br/> <br/> <br/>                             NOV INC. <br/>        CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) <br/>                           (In millions) <br/>                          Three Months Ended       Years Ended <br/>                             December 31,          December 31, <br/>                                                ------------------ <br/>                                 2024            2024     2023 <br/>                        ---  -------------       -----    ----- <br/>Cash flows from <br/>operating <br/>activities: <br/> Net income               $            161      $  635   $  985 <br/> Adjustments to <br/> reconcile net income <br/> to net cash provided <br/> by operating <br/> activities: <br/>   Depreciation and <br/>    amortization                        88         343      302 <br/>   Deferred income <br/>    taxes                               (4)         49     (489) <br/>   Working capital, <br/>    net                                304         215     (584) <br/>   Other operating <br/>    items, net                          42          62      (71) <br/>                        ---  -------------       -----    ----- <br/>      Net cash <br/>       provided by <br/>       operating <br/>       activities                      591       1,304      143 <br/>                        ---  -------------       -----    ----- <br/> <br/>Cash flows from <br/>investing <br/>activities: <br/>   Purchases of <br/>    property, plant <br/>    and equipment                     (118)       (351)    (283) <br/>   Business <br/>    acquisitions, net <br/>    of cash acquired                   (46)       (298)     (22) <br/>   Business <br/>   divestitures, net <br/>   of cash disposed                     --         176       -- <br/>   Other                                 1           2       12 <br/>                        ---  -------------       -----    ----- <br/>      Net cash used in <br/>       investing <br/>       activities                     (163)       (471)    (293) <br/>                        ---  -------------       -----    ----- <br/> <br/>Cash flows from <br/>financing <br/>activities: <br/>   Borrowings against <br/>    lines of credit <br/>    and other debt                       1         420      184 <br/>   Payments against <br/>    lines of credit <br/>    and other debt                      (9)       (431)    (192) <br/>   Cash dividends paid                 (29)       (108)     (79) <br/>   Share repurchases                  (112)       (229)      -- <br/>   Other                               (22)        (58)     (16) <br/>                        ---  -------------       -----    ----- <br/>      Net cash used in <br/>       financing <br/>       activities                     (171)       (406)    (103) <br/>Effect of exchange <br/> rates on cash                         (12)        (13)      -- <br/>                        ---  -------------       -----    ----- <br/>Increase (decrease) in <br/> cash and cash <br/> equivalents                           245         414     (253) <br/>Cash and cash <br/> equivalents, <br/> beginning of period                   985         816    1,069 <br/>                        ---  -------------       -----    ----- <br/>Cash and cash <br/> equivalents, end of <br/> period                   $          1,230      $1,230   $  816 <br/>                        ===  =============       =====    ===== <br/> <br/> <br/> NOV INC. RECONCILIATION OF CASH FLOWS FROM OPERATING ACTIVITIES TO FREE CASH <br/>           FLOW AND EXCESS FREE CASH FLOW (Unaudited) (In millions) <br/>Presented below is a reconciliation of cash flows from operating activities to <br/>\"Free Cash Flow\" and \"Excess Free Cash Flow\". The Company defines Free Cash <br/>Flow as cash flows from operating activities less purchases of property, plant <br/>and equipment, or \"capital expenditures\" and Excess Free Cash Flow as cash <br/>flows from operations less capital expenditures and other investments, <br/>including acquisitions and divestitures. Management believes this is important <br/>information to provide because it is used by management to evaluate the <br/>Company's operational performance and trends between periods and manage the <br/>business. Management also believes this information may be useful to investors <br/>and analysts to gain a better understanding of the Company's results of <br/>ongoing operations. Free Cash Flow and Excess Free Cash Flow are not intended <br/>to replace GAAP financial measures. <br/> <br/> <br/>                           Three Months Ended       Years Ended <br/>                              December 31,         December 31, <br/>                                                 ----------------- <br/>                                  2024            2024     2023 <br/>                         ---  ------------  ---   -----    ---- <br/> <br/>Total cash flows <br/> provided by operating <br/> activities                $           591       $1,304   $ 143 <br/>Capital expenditures                  (118)        (351)   (283) <br/>                         ---  ------------        -----    ---- <br/>   Free Cash Flow          $           473       $  953   $(140) <br/>                         ===  ============  ===   =====    ==== <br/>Business acquisitions, <br/> net of cash acquired                  (46)        (298)    (22) <br/>Business divestitures, <br/>net of cash disposed                    --          176      -- <br/>                         ---  ------------  ---   -----    ---- <br/>   Excess Free Cash <br/>    Flow                   $           427       $  831   $(162) <br/>                         ===  ============  ===   =====    ==== <br/> <br/> <br/> <br/>                                   NOV INC. <br/>         RECONCILIATION OF NET INCOME TO ADJUSTED EBITDA (Unaudited) <br/>                                 (In millions) <br/>Presented below is a reconciliation of Net Income to Adjusted EBITDA. The <br/>Company defines Adjusted EBITDA as Operating Profit excluding Depreciation, <br/>Amortization, Gains and Losses on Sales of Fixed Assets, and, when applicable, <br/>Other Items. Adjusted EBITDA % is a ratio showing Adjusted EBITDA as a <br/>percentage of sales. Management believes this is important information to <br/>provide because it is used by management to evaluate the Company's operational <br/>performance and trends between periods and manage the business. Management <br/>also believes this information may be useful to investors and analysts to gain <br/>a better understanding of the Company's results of ongoing operations. <br/>Adjusted EBITDA and Adjusted EBITDA % are not intended to replace GAAP <br/>financial measures, such as Net Income and Operating Profit %. Other Items <br/>include gain on business divestiture, impairment, restructure, severance, <br/>facility closure costs and inventory charges and credits. <br/> <br/> <br/>                             Three Months Ended                 Year Ended <br/>                     ----------------------------------- <br/>                         December 31,      September 30,       December 31, <br/>                     --------------------                 ---------------------- <br/>                      2024       2023          2024        2024        2023 <br/>                      ----       ----          ----  ---   -----       ----- <br/>Operating profit: <br/>   Energy Products <br/>    and Services     $ 112      $  94       $   114       $  475      $  507 <br/>   Energy Equipment    152        121           129          608         371 <br/>   Eliminations and <br/>    corporate <br/>    costs              (57)       (54)          (49)        (207)       (227) <br/>                      ----       ----          ----        -----       ----- <br/>Total operating <br/> profit              $ 207      $ 161       $   194       $  876      $  651 <br/>                      ====       ====          ====  ===   =====       ===== <br/> <br/>Operating profit <br/>%: <br/>   Energy Products <br/>    and Services      10.6%       8.8%         11.4%        11.5%       12.4% <br/>   Energy Equipment   11.8%       9.3%         10.6%        12.4%        7.9% <br/>   Eliminations <br/>   and corporate <br/>   costs                --         --            --           --          -- <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total operating <br/> profit %              9.0%       6.9%          8.9%         9.9%        7.6% <br/>                      ====       ====          ====        =====       ===== <br/> <br/>Other Items, net: <br/>   Energy Products <br/>    and Services     $   3      $  50       $     3       $    7      $   53 <br/>   Energy Equipment      4         (1)            1         (118)        (14) <br/>   Corporate            --          6             1            2          12 <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total other items    $   7      $  55       $     5       $ (109)     $   51 <br/>                      ====       ====          ====  ===   =====       ===== <br/> <br/>(Gain)/loss on <br/>sales of fixed <br/>assets <br/>   Energy Products <br/>    and Services     $  --      $   1       $     1       $   --      $   (1) <br/>   Energy Equipment     --         (1)           --           --          (4) <br/>   Corporate            --          1            --           --           2 <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total (gain)/loss <br/> on sales of fixed <br/> assets              $  --      $   1       $     1       $   --      $   (3) <br/>                      ====       ====          ====  ===   =====       ===== <br/> <br/>Depreciation &amp; <br/>amortization: <br/>   Energy Products <br/>    and Services     $  58      $  48       $    54       $  221      $  183 <br/>   Energy Equipment     29         28            29          115         111 <br/>   Corporate             1          1             3            7           8 <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total depreciation <br/> &amp; amortization      $  88      $  77       $    86       $  343      $  302 <br/>                      ====       ====          ====  ===   =====       ===== <br/> <br/>Adjusted EBITDA: <br/>   Energy Products <br/>    and Services     $ 173      $ 193       $   172       $  703      $  742 <br/>   Energy Equipment    185        147           159          605         464 <br/>   Eliminations and <br/>    corporate <br/>    costs              (56)       (46)          (45)        (198)       (205) <br/>                      ----       ----          ----        -----       ----- <br/>Total Adjusted <br/> EBITDA              $ 302      $ 294       $   286       $1,110      $1,001 <br/>                      ====       ====          ====  ===   =====       ===== <br/> <br/>Adjusted EBITDA %: <br/>   Energy Products <br/>    and Services      16.3%      18.0%         17.1%        17.0%       18.2% <br/>   Energy Equipment   14.4%      11.3%         13.0%        12.4%        9.9% <br/>   Eliminations <br/>   and corporate <br/>   costs                --         --            --           --          -- <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total Adjusted <br/> EBITDA %             13.1%      12.5%         13.1%        12.5%       11.7% <br/>                      ====       ====          ====        =====       ===== <br/> <br/>Reconciliation of <br/>Adjusted EBITDA: <br/>   GAAP net income <br/>    attributable to <br/>    Company          $ 160      $ 598       $   130       $  635      $  993 <br/>   Noncontrolling <br/>    interests            1         (3)           --           --          (8) <br/>   Provision <br/>    (benefit) for <br/>    income taxes        38       (460)           44          196        (373) <br/>   Interest expense     24         23            21           91          88 <br/>   Interest income     (11)        (7)          (11)         (38)        (28) <br/>   Equity (income) <br/>    loss in <br/>    unconsolidated <br/>    affiliates           1        (18)           --          (36)       (119) <br/>   Other (income) <br/>    expense, net        (6)        28            10           28          98 <br/>   (Gain)/loss on <br/>    sales of fixed <br/>    assets              --          1             1           --          (3) <br/>   Depreciation and <br/>    amortization        88         77            86          343         302 <br/>   Other Items, <br/>    net:                 7         55             5         (109)         51 <br/>                      ----       ----          ----  ---   -----       ----- <br/>Total Adjusted <br/> EBITDA              $ 302      $ 294       $   286       $1,110      $1,001 <br/>                      ====       ====          ====  ===   =====       ===== <br/> </pre><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204269888/en/</p><p class=\"\">CONTACT:    Amie D'Ambrosio</p><p class=\"\">Director, Investor Relations</p><p class=\"\">(713) 375-3826</p><p class=\"\">Amie.DAmbrosio@nov.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013353:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013353_20250204013354:0",
            "title": "NOV 4Q Rev $2.31B >NOV",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013353_20250204013354:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013353_20250204013353:0",
            "title": "NOV 4Q Net $438M >NOV",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013353_20250204013353:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013353_20250204013355:0",
            "title": "NOV 4Q EPS 41c >NOV",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013353_20250204013355:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013373:0",
            "title": "Final Market Diaries: NYSE, Nasdaq, NYSE American, Arca 4:00 p.m. ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                                Tue       Day Ago     Week Ago <br/>     NYSE Market Diary <br/>     Composite Values: <br/>Issues Traded                2,837        2,851        2,842 <br/>Advances                     1,936          885        1,230 <br/>Declines                       810        1,901        1,545 <br/>Unchanged                       91           65           67 <br/>New highs                       67           38          119 <br/>New lows                        45           98           25 <br/>Adv vol (000)            3,008,069    1,527,998    2,161,415 <br/>Decl vol (000)           1,276,481    3,229,204    2,214,407 <br/>Total vol (000)          4,410,170    4,797,212    4,473,643 <br/>Closing Arms (TRIN)           1.01          .98          .82 <br/>     Primary Market Values: <br/>Adv vol (000)              648,321      337,132      418,706 <br/>Decl vol (000)             332,322      747,243      526,133 <br/>Total vol (000)          1,007,907    1,092,292      962,939 <br/>Block trades                 5,020        5,225        4,622 <br/> <br/>     Nasdaq Market Diary <br/>     Composite Values: <br/>Issues Traded                4,495        4,523        4,531 <br/>Advances                     3,039        1,304        2,157 <br/>Declines                     1,320        3,095        2,193 <br/>Unchanged                      136          124          181 <br/>New highs                       98           62          117 <br/>New lows                       119          233          160 <br/>Adv vol (000)            4,638,653    3,853,872    4,513,042 <br/>Decl vol (000)           1,789,242    4,323,273    2,468,108 <br/>Total vol (000)          6,477,060    8,272,464    7,121,743 <br/>Closing Arms (TRIN)            .89          .47          .54 <br/>Block trades                38,758       61,584       49,869 <br/> <br/>     American Market Diary <br/>     Composite Values: <br/>Issues Traded                  300          295          303 <br/>Advances                       182          116          143 <br/>Declines                       110          169          140 <br/>Unchanged                        8           10           20 <br/>New highs                        2            3            2 <br/>New lows                         5           11            7 <br/>Total vol (000)            528,481      352,053      267,660 <br/>Closing Arms (TRIN)             .1         1.77          .45 <br/>     Primary Market Values: <br/>Adv vol (000)               13,719        5,456        8,114 <br/>Decl vol (000)               1,964       11,960        4,548 <br/>Total vol (000)             16,303       17,558       13,306 <br/>Block trades                   193          162          167 <br/> <br/>     Arca Market Diary <br/>     Composite Values: <br/>Issues Traded                2,105        2,133        2,085 <br/>Advances                     1,785          548        1,193 <br/>Declines                       293        1,573          832 <br/>Unchanged                       27           12           60 <br/>New highs                       34           20           38 <br/>New lows                         7           33           23 <br/>Total vol (000)          1,532,678    2,176,958    1,462,260 <br/>Closing Arms (TRIN)           2.04           .5         1.35 <br/>     Primary Market Values: <br/>Adv vol (000)              205,077      146,156      144,855 <br/>Decl vol (000)              67,366      269,372      122,675 <br/>Total vol (000)            275,667      416,350      270,239 <br/>Block trades                 1,461        1,825        1,287 <br/>n.a.-not available <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013373:0/",
            "pub_date": "2025-02-05 06:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_EM6kGLjQa:0",
            "title": "CARLSON - CARLSON INVESTMENTS SE - Powołanie członków Rady Nadzorczej | Appointment of Supervisory Board members",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Additional attachments can be found below:</p><p class=\"\">20250204_234505_0000157611_0000165527.pdf</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20250204:nEM38QFVCa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\">20250204_234505_0000157611_0000165528.pdf</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20250204:nEM4fxHx2a\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\">20250204_234505_0000157611_0000165529.pdf</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20250204:nEM8jXMzva\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_EM6kGLjQa:0-carlson-carlson-investments-se-powo-anie-cz-onk-w-rady-nadzorczej-appointment-of-supervisory-board-members/",
            "pub_date": "2025-02-05 06:45:10",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463565:0",
            "title": "ASX Preview: Australian Shares Set for Higher Open as Wall Street Gains",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australian equities are poised to open higher on Wednesday as Wall Street gained after China's response to the Trump administration's tariffs. </p><p class=\"\">China is imposing a 15% tariff on coal and liquefied natural gas products and a 10% tariff on crude oil, agricultural machinery, and large-displacement cars as a retaliation to US President Donald Trump's new tariffs announced last week. </p><p class=\"\">Wall Street somewhat recovered on Tuesday, with the Nasdaq Composite up 1.4%, the S&amp;P 500 gaining 0.7%, and the Dow Jones Industrial Average rising 0.3%. </p><p class=\"\">On the local economic front, the seasonally adjusted S&amp;P Global Australia Services PMI Business Activity Index rose to 51.2 in January from 50.8 in December 2024. </p><p class=\"\">The selected living cost indexes report for December 2024 is due for release at 11:30 am Sydney time. </p><p class=\"\">In corporate news, Pinnacle Investment Management Group  reported Tuesday fiscal half-year earnings of AU$0.367 per diluted share, up from AU$0.153 per diluted share a year earlier. </p><p class=\"\">SKY Network Television  Chief Financial Officer Ciara McGuigan has resigned, effective immediately, according to a Wednesday filing with the Australian and New Zealand bourses. </p><p class=\"\">Australia's benchmark index lost 0.06%, or 5.40 points, Tuesday to close at 8,374.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463565:0-asx-preview-australian-shares-set-for-higher-open-as-wall-street-gains/",
            "pub_date": "2025-02-05 06:45:40",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_PLX7BE1A0:0",
            "title": "BRIEF-NOV Q4 Revenue USD 2,308 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 04 (Reuters) - NOV Q4 operating profit USD 207 million.</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Q4 net income USD 161 million</li><li class=\"listItem-bmN0_SHH\">Q4 pretax profit USD 199 million</li><li class=\"listItem-bmN0_SHH\">Q4 gross profit USD 493 million</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_PLX7BE1A0:0-brief-nov-q4-revenue-usd-2-308-million/",
            "pub_date": "2025-02-05 06:45:45",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309479:0",
            "title": "Phibro Animal Health Keeps Quarterly Dividend at $0.12 a Share, Payable March 26 to Holders March 5",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309479:0/",
            "pub_date": "2025-02-05 06:45:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309478:0",
            "title": "Hut 8 Hashrate Under Management, Bitcoin Production Fell in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hut 8  said Tuesday its total hashrate under management dropped to 12.7 exahashes per second in January from 13.2 EH/s in December. </p><p class=\"\">The company said it produced 65 bitcoins in January down from 89 bitcoins a month earlier. </p><p class=\"\">Total deployed miners under management fell to 115,300 from 121,400. </p><p class=\"\">Total energy capacity under management remained unchanged at 665 megawatts.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309478:0/",
            "pub_date": "2025-02-05 06:45:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309444:0",
            "title": "Hanover Insurance Q4 Operating Income, Revenue Rise",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hanover Insurance Group  reported Q4 operating income late Tuesday of $5.32 per diluted share, up from $3.13 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $3.36. </p><p class=\"\">Revenue for the quarter ended Dec. 31 rose to $1.58 billion from $1.53 billion a year earlier. </p><p class=\"\">Two analysts surveyed by FactSet expected $1.61 billion.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309444:0/",
            "pub_date": "2025-02-05 06:37:30",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309470:0",
            "title": "Simulations Plus Insider Sold Shares Worth $678,243, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Walter S Woltosz, 10% Owner, Director, on February 03, 2025, sold 20,000 shares in Simulations Plus  for $678,243. Following the Form 4 filing with the SEC, Woltosz has control over a total of 3,402,584 common shares of the company, with 3,402,584 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1023459/000102345925000014/xslF345X05/wk-form4_1738708430.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/1023459/000102345925000014/xslF345X05/wk-form4_1738708430.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309470:0/",
            "pub_date": "2025-02-05 06:37:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013263:0",
            "title": "Mattel Relying on Supply Chain, Potential Price Increases to Offset Tariff Impacts — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Connor Hart</p><p class=\"\">Mattel is taking steps to limit the effects of President Trump's proposed tariffs, including relying on its global supply chain and potentially raising prices.</p><p class=\"\">The maker of Hot Wheels cars and Barbie dolls expects such measures to contribute to higher profits and revenue this year.</p><p class=\"\">Chief Executive Ynon Kreiz said that the company has spent years building out a supply chain that isn't overly reliant upon any one country, a structure that will play a critical role in navigating the looming trade war sparked by Trump's proposed tariffs on goods from Canada, Mexico and China.</p><p class=\"\">\"We source product today from a mix of our own factories and third-party suppliers in seven different countries,\" he said Tuesday. \"This model is about having a diverse, flexible supply chain that is agile and can respond to different market conditions from different geographies.\"</p><p class=\"\">Mattel has said it plans to have no singular country account for more than a quarter of its total productions by 2027. Mexico accounts for less than 10% of the company's global production, and it produces less than 40% of its toys in China, whereas the industry average is around 80%, Kreiz said.</p><p class=\"\">The company will also consider increasing its prices, Kreiz said, planning to assess the market as the proposed tariffs play out and adapt accordingly.</p><p class=\"\">Companies have been scrambling to adjust their operations in the wake of the Trump administration's plans to impose tariffs. Automakers, for instance, have searched out new suppliers and have considered higher prices to offset the blow from looming tariffs on Canadian and Mexican imports.</p><p class=\"\">Mattel's sales and profit forecast for the current year came in ahead of what analysts expected, according to FactSet. It also follows better-than-expected fourth-quarter results, during which Kreiz said the toy industry stabilized and U.S. consumers were in a good place.</p><p class=\"\">Shares of Mattel rose 7% in late trading to $19.33. Through Tuesday's close, the stock had been up 1.9% over the past year.</p><p class=\"\">The El Segundo, Calif.-based company reported a profit of $140.9 million, or 42 cents a share, in the recent quarter, compared with $147.3 million, or 42 cents a share, a year earlier</p><p class=\"\">Adjusted per-share earnings came in at 35 cents, beating the 20 cents that analysts surveyed by FactSet were expecting.</p><p class=\"\">Revenue increased 1.6% to $1.65 billion, just ahead of the $1.63 billion that analysts had forecast.</p><p class=\"\">Among its main brands, Barbie posted a 14% drop in gross billings, which measures sales to retailers before adjustments. The loss was offset by a 15% increase for Hot Wheels and a 3% raise for Fisher Price.</p><p class=\"\">Kreiz attributed Barbie's decline largely to last year's results having been inflated due to the blockbuster \"Barbie\" movie. He forecast continued momentum across the company's Hot Wheels brand in the current year, in part citing recent partnerships with Formula One and Ferrari.</p><p class=\"\">For 2025, Mattel expects net sales to grow 2% to 3%, which comes after sales fell 1.1% last year. Analysts surveyed by FactSet modeled revenue of $5.5 billion, representing a 2.3% increase from 2024.</p><p class=\"\">The company guided for adjusted per-share earnings between $1.66 and $1.72, ahead of the $1.57 that analysts are looking for.</p><p class=\"\">Write to Connor Hart at connor.hart@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013263:0/",
            "pub_date": "2025-02-05 06:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204001416:0",
            "title": "Alphabet Revenue Misses Expectations. The Stock Is Down Sharply. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angela Palumbo</p><p class=\"\">Alphabet earnings beat Wall Street expectations, but revenue missed the mark.</p><p class=\"\">Alphabet reported fourth-quarter earnings of $2.15 a share on revenue of $96.47 billion. Analysts surveyed by FactSet were expecting the Google parent to post earnings of $2.13 a share on revenue of $96.68 billion.</p><p class=\"\">In the same period last year, Alphabet reported earnings of $1.64 a share on revenue of $86.3 billion.</p><p class=\"\">Cloud revenue in the quarter of $12 billion — a 30% increase from last year — just missed analyst estimates of $12.2 billion. This comes after Microsoft said on Jan. 29 that revenue in the second quarter from Azure and other cloud services increased by 31%, compared with 33% one quarter earlier.</p><p class=\"\">Youtube offered a bright spot for the company. Its advertising revenue of $10.47 billion beat estimates of $10.23 billion. Meta Platforms also reported better-than-expected fourth-quarter ad-revenue on Jan. 29.</p><p class=\"\">Similarly to fellow tech peers, Alphabet is spending significantly on generative artificial intelligence initiatives. The company reported capital expenditures in the quarter of $14.28 billion, above Wall Street's estimate of $13.26 billion and an increase from the $11 billion last year.</p><p class=\"\">CFO Anat Ashkenazi said on the company's earnings call that most of these investments were towards technical infrastructure, with the largest component being investments in servers and data centers.</p><p class=\"\">\"We are confident about the opportunities ahead, and to accelerate our progress, we expect to invest approximately $75 billion in capital expenditures in 2025,\" CEO Sundar Pichai said in the earnings release.</p><p class=\"\">Shares of Alphabet were down 7.9% in after-hours trading following the report.</p><p class=\"\">Massive spending on generative artificial intelligence has been a continuing theme. However, viral social-media posts last week said that DeepSeek had developed an AI model similar to OpenAI's ChatGPT for significantly less money than what U.S. tech companies have spent on AI. Experts have since decided the cost likely was higher than what has been reported, but there are still those who question whether tech giants need to keep spending as intensely as they have been.</p><p class=\"\">On top of clarification on the expected AI investments for next year, shareholders wanted to get updates about Alphabet's competitive stance. Google has remained king of search for years, but generative AI-powered chatbots have put its market share at risk. On top of ChatGPT and Meta AI, DeepSeek's chat model directly competes with Google's Gemini. Google announced Gemini 2.0 Flash in December, which has faster response times than its predecessor.</p><p class=\"\">When asked about his thoughts on the DeepSeek developments, Pichai said that while DeepSeek's team is \"tremendous,\" and doing \"very good work,\" Google's models \"are some of the most efficient models out there, including comparing to DeepSeek's V3 and R1.\"</p><p class=\"\">Looking ahead, investors are awaiting updates on the Department of Justice's antitrust case.</p><p class=\"\">A judge ruled in August that Google maintained a monopoly in general search services and general text advertising. The Justice Department has suggested a breakup of the company as a potential remedy.</p><p class=\"\">Write to Angela Palumbo at angela.palumbo@dowjones.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204001416:0/",
            "pub_date": "2025-02-05 06:38:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463549:0",
            "title": "Ibiden to Cut Cross-Shareholdings by Over 50% to Boost Capital Efficiency",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ibiden  plans to reduce its cross-shareholdings by more than 50% on a market value basis by March 31, 2024, under its medium-term management plan, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The move aims to enhance liquidity and capital efficiency. Proceeds will be allocated to strategic investments, business strengthening, and shareholder returns.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463549:0/",
            "pub_date": "2025-02-05 06:38:21",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013278:0",
            "title": "Nasdaq Net Change Percentage Gainers & Losers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              GAINERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Cumberland Pharm            CPIX      3.76     1.63     76.53    18,117,872 <br/>Lixiang Education ADR       LXEH      8.13     2.73     50.56       912,465 <br/>GrShr 2x Long PLTR Daily    PTIR    228.69    73.38     47.24     1,699,056 <br/>Direxion Dly PLTR Bull 2X   PLTU     48.53    15.54     47.11     2,592,075 <br/>Flexsteel Industries        FLXS     63.05    14.85     30.81       121,063 <br/>Exagen                       XGN      5.02     1.14     29.38     1,100,796 <br/>ModivCare                   MODV      4.80     0.96     25.00     2,050,003 <br/>Palantir Technologies       PLTR    103.83    20.09     23.99   230,122,030 <br/>Absci                       ABSI      4.35     0.65     17.57    12,373,104 <br/>Defiance Dly Target 2X Lg   SMCX     32.92     4.86     17.32     1,747,015 <br/> <br/>                              LOSERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Direxion Dly PLTR Bear 1X   PLTD     15.59    -4.89    -23.88     7,795,769 <br/>Twin Hospitality Cl A       TWNP     11.37    -2.64    -18.84       269,576 <br/>Conduit Pharmaceuticals      CDT      1.80    -0.40    -18.18       665,417 <br/>Atlantic International      ATLN      3.53    -0.68    -16.15        23,843 <br/>Premier Inc.                PINC     19.11    -3.29    -14.69     3,852,667 <br/>Bowen Acquisition           BOWN      4.16    -0.64    -13.33        16,951 <br/>PayPal Holdings             PYPL     77.73   -11.79    -13.17    58,596,133 <br/>Synaptics                   SYNA     74.34   -10.71    -12.59     2,740,077 <br/>Maze Therapeutics           MAZE     13.25    -1.75    -11.67       730,221 <br/>Alpha Modus Holdings Cl A   AMOD      2.32    -0.29    -11.11     8,252,019 <br/> <br/> <br/>Only includes stocks with a prior day close of $2 a share <br/>or higher and at least 2,000 shares traded today. <br/> <br/>Data are delayed at least 15 minutes. <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013278:0/",
            "pub_date": "2025-02-05 06:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013274:0",
            "title": "NYSE Most Active Issues",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              VOLUME ACTIVES <br/> <br/>COMPANY                   SYMBOL        VOLUME      LAST   CHANGE   PERCENT <br/>-------                   ------        ------      ----   ------   ------- <br/>Ford Motor                     F    68,522,400     10.16     0.27      2.73 <br/>Pfizer                       PFE    68,325,367     25.87    -0.33     -1.26 <br/>BigBear.ai                  BBAI    68,077,491      4.91     0.68     16.08 <br/>D-Wave Quantum              QBTS    67,204,420      5.78     0.02      0.35 <br/>Snap                        SNAP    61,475,382     11.60     0.43      3.85 <br/>International Paper           IP    58,004,755     53.89    -1.94     -3.47 <br/>Merck                        MRK    50,760,705     90.74    -9.05     -9.07 <br/>NIO ADR                      NIO    43,889,417      4.39     0.11      2.57 <br/>Vale ADR                    VALE    39,962,077      9.43     0.07      0.75 <br/>Amcor                       AMCR    39,760,199     10.05     0.49      5.13 <br/>fuboTV                      FUBO    38,115,828      4.58     0.42     10.10 <br/>Uber Technologies           UBER    33,456,360     69.75     2.46      3.66 <br/>Nu Holdings A                 NU    33,351,609     13.30     0.16      1.22 <br/>Bank of America              BAC    32,868,977     46.71     0.50      1.08 <br/>Transocean                   RIG    32,514,887      3.89     0.10      2.64 <br/>Itau Unibanco ADR           ITUB    32,062,011      5.85     0.09      1.61 <br/>AT&amp;T                           T    30,523,648     24.25     0.00      0.00 <br/>Ambev ADR                   ABEV    30,425,790      1.84     0.00      0.00 <br/>Alibaba Group ADR           BABA    29,772,594    102.35     3.74      3.79 <br/>Baytex Energy                BTE    27,731,523      2.47     0.12      5.11 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013274:0/",
            "pub_date": "2025-02-05 06:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013275:0",
            "title": "NYSE American Net Change Percentage Gainers & Losers",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              GAINERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Grupo Simec ADR              SIM     25.96     3.81     17.20         2,137 <br/>Eason Technology ADR         DXF     30.51     3.39     12.50       204,525 <br/>Solaris Resources           SLSR      3.50     0.24      7.36        38,750 <br/>Vizsla Silver               VZLA      2.20     0.14      6.80     2,273,960 <br/>Idaho Strategic Resources    IDR     13.60     0.84      6.58       313,638 <br/>51Talk Online Educ ADR       COE     21.16     1.17      5.85        22,068 <br/>Dakota Gold                   DC      2.43     0.13      5.65       297,097 <br/>Metalla Royalty &amp; Stream     MTA      3.04     0.15      5.19       468,898 <br/>Gran Tierra Energy           GTE      5.88     0.29      5.19       245,879 <br/>Myomo                        MYO      6.31     0.31      5.17       572,929 <br/> <br/>                              LOSERS <br/> <br/>COMPANY                   SYMBOL      LAST   CHANGE   PERCENT        VOLUME <br/>-------                   ------      ----   ------   -------        ------ <br/>Channel Therapeutics        CHRO      1.72    -0.41    -19.25       209,859 <br/>AtlasClear Holdings         ATCH      3.83    -0.65    -14.51       132,015 <br/>flyExclusive                FLYX      3.13    -0.31     -9.11        15,752 <br/>Battalion Oil               BATL      1.82    -0.18     -9.00       113,259 <br/>Serina Therapeutics          SER      4.62    -0.29     -5.91        16,484 <br/>Exodus Movement             EXOD     56.77    -2.82     -4.73        84,002 <br/>Avalon Holdings              AWX      3.37    -0.15     -4.20         8,388 <br/>High Roller Technologies    ROLR      4.55    -0.15     -3.19        14,317 <br/>Brazil Potash                GRO      4.55    -0.14     -2.99       209,491 <br/>Mobile Infrastructure       BEEP      3.93    -0.11     -2.72        21,287 <br/> <br/> <br/>Only includes stocks with a prior day close of $2 a share <br/>or higher and at least 2,000 shares traded today. <br/> <br/>Data are delayed at least 20 minutes. <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013275:0/",
            "pub_date": "2025-02-05 06:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013276:0",
            "title": "NYSE American Most Active Issues",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              VOLUME ACTIVES <br/> <br/>COMPANY                   SYMBOL        VOLUME      LAST   CHANGE   PERCENT <br/>-------                   ------        ------      ----   ------   ------- <br/>Azitra                      AZTR   247,939,579     0.324     0.05     16.34 <br/>DenisonMines                 DNN    51,407,990      1.85     0.10      5.71 <br/>B2Gold                       BTG    25,841,688      2.48     0.08      3.33 <br/>New Gold                     NGD    17,624,986      3.03     0.14      4.84 <br/>Ocean Power Technologies    OPTT    13,176,696    0.7423     0.07     10.12 <br/>Kairos Pharma               KAPA    11,670,882      1.74     0.22     14.47 <br/>Oragenics                   OGEN    11,251,546    0.2841    -0.01     -2.34 <br/>Equinox Gold                 EQX     9,573,554      6.61     0.04      0.61 <br/>Calidi Biotherapeutics      CLDI     9,527,770      1.32     0.27     25.71 <br/>Globalstar                  GSAT     9,122,153      1.54     0.04      2.67 <br/>KULR Technology Group       KULR     7,881,230      2.06     0.00      0.00 <br/>Comstock                    LODE     7,653,554    0.3902     0.01      2.96 <br/>Energy Fuels                UUUU     7,447,836      5.41     0.16      3.05 <br/>Silvercorp Metals            SVM     5,284,449      3.28     0.13      4.13 <br/>Senseonics Holdings         SENS     5,189,997      0.92     0.02      2.78 <br/>Uranium Energy               UEC     4,861,093      7.10     0.23      3.35 <br/>MAIA Biotechnology          MAIA     4,628,383      2.00     0.11      5.82 <br/>Northern Dynasty Minerals    NAK     4,413,537    0.7026     0.04      6.49 <br/>CleanCore Solutions         ZONE     3,542,832      1.28     0.26     25.48 <br/>Ur-Energy                    URG     2,946,610      1.09     0.05      4.81 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013276:0/",
            "pub_date": "2025-02-05 06:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013273:0",
            "title": "NASD Most Active Issues",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"> <br/>                              VOLUME ACTIVES <br/> <br/>COMPANY                   SYMBOL        VOLUME      LAST   CHANGE   PERCENT <br/>-------                   ------        ------      ----   ------   ------- <br/>NVIDIA                      NVDA   254,432,363    118.65     1.99      1.71 <br/>Captivision                 CAPT   245,446,745      1.05     0.61    139.18 <br/>Palantir Technologies       PLTR   230,122,030    103.83    20.09     23.99 <br/>Lottery.com                 LTRY   128,760,989    0.5876     0.28     88.33 <br/>Invivyd                     IVVD    96,480,148      1.25     0.19     17.92 <br/>Grab Holdings               GRAB    77,096,040      5.11     0.57     12.56 <br/>Lucid Group                 LCID    64,542,464      2.93     0.13      4.64 <br/>Advanced Micro Devices       AMD    59,052,285    119.50     5.23      4.58 <br/>PayPal Holdings             PYPL    58,596,133     77.73   -11.79    -13.17 <br/>Tesla                       TSLA    56,798,749    392.21     8.53      2.22 <br/>SoundHound AI               SOUN    52,589,667     15.71     1.47     10.32 <br/>iShares Bitcoin Trust ETF   IBIT    47,903,633     56.13    -1.45     -2.52 <br/>ProSh UltraPro Shrt QQQ     SQQQ    46,213,233     28.65    -1.07     -3.60 <br/>Apple                       AAPL    44,722,809    232.80     4.79      2.10 <br/>Intel                       INTC    44,722,108     19.29    -0.09     -0.46 <br/>Direxion TSLA Bull 2X       TSLL    43,716,567     24.97     1.01      4.22 <br/>Alphabet Cl A              GOOGL    42,231,005    206.38     5.15      2.56 <br/>ProShares UltraPro QQQ      TQQQ    41,743,042     83.65     2.93      3.63 <br/>Tilray Brands               TLRY    38,119,982      1.00     0.01      1.01 <br/>Comcast Cl A               CMCSA    37,943,815     33.55     0.36      1.08 <br/> <br/> <br/>Source: WSJ Market Data Group <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013273:0/",
            "pub_date": "2025-02-05 06:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV34X:0",
            "title": "ChampionX Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">ChampionX Corp  reported quarterly adjusted earnings of 50 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 44 cents.  The mean expectation of seven analysts for the quarter was for earnings of 49 cents per share. Wall Street expected results to range from 39 cents to 59 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 3.3% to $912.04 million from a year ago; analysts expected $913.61 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ChampionX Corp's reported EPS for the quarter was 43 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $82.77 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">ChampionX Corp shares had risen by 4.9% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 5.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"strong buy\" and the breakdown of recommendations is 6 \"strong buy\" or \"buy,\" no \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the oil related services and equipment peer group is  \"buy.\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for ChampionX Corp is $41.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 10:38 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.49</p></td><td><p class=\"\">0.50</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.46</p></td><td><p class=\"\">0.44</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.46</p></td><td><p class=\"\">0.37</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.40</p></td><td><p class=\"\">0.50</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV34X:0-championx-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 06:39:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV352:0",
            "title": "Enova International Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enova International Inc  reported quarterly adjusted earnings of $2.61​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $1.83.  The mean expectation of seven analysts for the quarter was for earnings of $2.27 per share. Wall Street expected results to range from $2.16  to $2.37 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 29.2% to $413.04 million from a year ago; analysts expected $730.04 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enova International Inc's reported EPS for the quarter was $2.30​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $63.7 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Enova International Inc shares had risen by 15.6% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 5 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the consumer lending peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Enova International Inc is $115.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 10:38 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">2.27</p></td><td><p class=\"\">2.61</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.31</p></td><td><p class=\"\">2.45</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.07</p></td><td><p class=\"\">2.21</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">1.72</p></td><td><p class=\"\">1.91</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV352:0-enova-international-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 06:39:16",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013285:0",
            "title": "New Zealand's Unemployment Rate Rises to Four-Year High — Update",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By James Glynn</p><p class=\"\">SYDNEY--New Zealand's unemployment rose to its highest level in four years in the final months of last year, highlighting the extent of its economic slowdown and locking in a further significant cut in interest rates when the central bank meets later this month.</p><p class=\"\">Unemployment rose to 5.1% in the fourth quarter, the highest it has been since the third quarter of 2020, when it stood at 5.2%, Stats NZ said Wednesday.</p><p class=\"\">Outside of the pandemic, the jobless rate rose to its highest level since 2016.</p><p class=\"\">The economy shed 32,000 jobs through calendar 2024, the largest annual fall in employment since 2009, it added.</p><p class=\"\">The Reserve Bank of New Zealand has been cutting interest rates aggressively since mid-2024, with senior bank officials indicating in recent months that more will be needed to restore momentum to the economy.</p><p class=\"\">A combination of soaring interest rates and a surge in the cost of living over recent years had seen New Zealand's move in and out of recession in that time.</p><p class=\"\">Recent GDP growth data was far weaker than most economists had expected, putting the RBNZ on track to deliver a further 50 basis-point cut in the official cash rate on Feb. 19, taking the total reduction in the official cash rate to 175 basis points since midway through last year.</p><p class=\"\">The OCR currently stands at 4.25%.</p><p class=\"\">The RBNZ has also pointed to growing uncertainty around the global economic outlook, and the fact that inflation has returned to target, as key reasons to ease policy settings.</p><p class=\"\">Wednesday's labor-market release should pave the way for the RBNZ to cut rates by another 50 basis points at its meeting in two weeks' time, said Abhijit Surya, economist at Capital Economics.</p><p class=\"\">\"And looking further ahead, we still expect the bank to eventually cut rates to 2.25%, well below the 3% terminal rate that most are predicting,\" he added.</p><p class=\"\">The underutilization rate, which measures untapped capacity in the labor market, rose to 12.1% in the fourth quarter from 11.6% in the third quarter.</p><p class=\"\">Men accounted for 85% of the annual decrease in employment, reflecting substantial falls in the male-dominated occupation groups of technicians and trades workers, and machinery operators and drivers, the data showed.</p><p class=\"\">Write to James Glynn at james.glynn@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013285:0/",
            "pub_date": "2025-02-05 06:40:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309466:0",
            "title": "3M to Pay Quarterly Dividend of $0.73 a Share, Payable March 12 to Shareholders of Record on Feb. 14",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309466:0/",
            "pub_date": "2025-02-05 06:31:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463547:0",
            "title": "Coca-Cola Bottlers Japan Buys Back 1.2 Million Shares in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Coca-Cola Bottlers Japan Holdings  repurchased 1.2 million shares for 2.81 billion yen in January, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The buyback is part of a program approved on Nov. 6, 2024, allowing the buyback of up to 20 million shares, or 11% of outstanding stock, for a maximum of 30 billion yen. </p><p class=\"\">As of Jan. 31, the company has acquired 3 million shares, spending 7.37 billion yen.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463547:0/",
            "pub_date": "2025-02-05 06:31:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013227:0",
            "title": "NETRAMARK PROVIDES BUSINESS UPDATE",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NETRAMARK PROVIDES BUSINESS UPDATE</p><p class=\"\">Canada NewsWire</p><p class=\"\">TORONTO, Feb. 4, 2025</p><p class=\"\">TORONTO, Feb. 4, 2025 /CNW/ - NetraMark Holdings Inc. (the \"Company\" or \"NetraMark\")   (Frankfurt: 8TV) a generative AI software leader in clinical trial analytics, is pleased to highlight recent corporate advancements; including a key leadership appointment, a major pharmaceutical collaboration, a strategic board addition, a strengthened financial position and a new marketing / investor relations engagement.</p><p class=\"\">Dr. Angelico Carta Appointed as Chief Strategy Officer</p><p class=\"\">As previously announced on December 11, 2024, NetraMark appointed Dr. Angelico Carta, co-founder of Worldwide Clinical Trials, as its Chief Strategy Officer. Dr. Carta brings over 35 years of experience in clinical research and pharmaceutical strategy, enhancing NetraMark's ability to expand partnerships and refine its go-to-market approach. His leadership is expected to play a critical role in advancing NetraMark's AI-driven capabilities in clinical trials and precision medicine.</p><p class=\"\">Strategic Collaboration with Top 5 Pharmaceutical Company</p><p class=\"\">As previously announced on December 9, 2024, NetraMark has entered into a pilot collaboration agreement with a Top 5 pharmaceutical company, as defined by market capitalization. The initiative aims to leverage NetraAI technology to uncover novel insights into patient populations, improving the client's development of treatments for autoimmune disorders. This collaboration aligns with one of the Company's core goals - validation of the technology through major collaborations and co-publishing opportunities.</p><p class=\"\">P.J. Haley Joins Board of Directors</p><p class=\"\">As previously announced on October 9, 2024, NetraMark welcomed P.J. Haley, Executive Vice President of Commercial at Exelixis, Inc., to its Board of Directors. With over 20 years of experience in oncology commercialization, market access, and strategic partnerships, Mr. Haley will help steer NetraMark's expansion into the oncology sector, aligning AI solutions with evolving industry needs.</p><p class=\"\">$1.16 Million Raised Through Warrant and Stock Option Exercises</p><p class=\"\">As previously announced on December 12, 2024, NetraMark strengthened its financial position in Q1 of this fiscal year through the exercise of warrants and stock options by their holders, raising $1,161,000. This capital infusion will support the continued development and expansion of NetraMark's AI solutions, designed to empower pharmaceutical companies with advanced insights for clinical trial success. The funding reinforces the company's ability to scale operations and drive innovation in precision medicine.</p><p class=\"\">Marketing, Public and Investor Relations</p><p class=\"\">NetraMark announces that it has extended the term of its original agreement (\"ARU Agreement\") with ARU Global Inc. (\"ARU\") to provide public relations services in an effort to increase public awareness of the Company. Certain services to be provided by ARU are anticipated to include \"investor relations activities\" under the policies of the Canadian Securities Exchange.  Any materials disseminated by ARU will require the prior written approval of the Company.</p><p class=\"\">The term of the ARU Agreement is extended to Mach 31, 2025. The ARU Agreement was also amended to increase compensation paid during the term to ARU, from $112,000 USD to $133,000 USD.  ARU is owned by Brian Uppal and is located at 17th Floor, PH Plaza 2000 50th Street Panama City, Panama and can be reached at 507-6532-8900 or brian@aruglobalinc.com. ARU does not have any interest, directly or indirectly, in NetraMark or its securities, or any right or intent to acquire such an interest.</p><p class=\"\">NetraMark also announces it has entered into an agreement with 1502656 B.C LTD. (\"BC Ltd.)\" to provide strategic digital media services, marketing (including awareness campaigns) and data analytical services to the Company (the \"Marketing Agreement\"). The term of the Marketing Agreement is for a period of six months commencing February 4, 2025. During the term of the Marketing Agreement, BC LTD. will be paid compensation equal to C$300,000.  BC LTD. and its principals are arm's length to the Company.  As of the date hereof, to the Company's knowledge, BC LTD. (including its directors and officers) do not own any securities of the Company. BC LTD. is located at 3849 154th Street Surrey, BC V3Z0V3, and can be reached at 604-317-2952 or nate@wagnergroup.media</p><p class=\"\">About NetraAI</p><p class=\"\">In contrast with other AI-based methods, NetraAI is uniquely engineered to include focus mechanisms that separate small datasets into explainable and unexplainable subsets. Unexplainable subsets are collections of patients that can lead to suboptimal overfit models and inaccurate insights due to poor correlations with the variables involved. The NetraAI uses the explainable subsets to derive insights and hypotheses (including factors that influence treatment and placebo responses, as well as adverse events) that have the potential to increase the chances of a clinical trial success.  Other AI methods lack these focus mechanisms and assign every patient to a class, even when this leads to \"overfitting\" which drowns out critical information that could have been used to improve a trial's chance of success.</p><p class=\"\">About NetraMark</p><p class=\"\">NetraMark is a company focused on being a leader in the development of Generative Artificial Intelligence (Gen AI)/Machine Learning (ML) solutions targeted at the Pharmaceutical industry. Its product offering uses a novel topology-based algorithm that has the ability to parse patient data sets into subsets of people that are strongly related according to several variables simultaneously. This allows NetraMark to use a variety of ML methods, depending on the character and size of the data, to transform the data into powerfully intelligent data that activates traditional AI/ML methods. The result is that NetraMark can work with much smaller datasets and accurately segment diseases into different types, as well as accurately classify patients for sensitivity to drugs and/or efficacy of treatment.</p><p class=\"\">For further details on the Company please see the Company's publicly available documents filed on the System for Electronic Document Analysis and Retrieval+ (SEDAR+).</p><p class=\"\">Forward-Looking Statements</p><p class=\"\">This press release contains \"forward-looking information\" within the meaning of applicable Canadian securities legislation including statements regarding the terms of ARU's engagement, the terms of BC Ltd.'s engagement, NetraMark's technology, benefits of new directors, officers, financial position and collaborations, the potential for accelerated growth and the potential value of our technology to pharmaceutical and biotechnology companies which are based upon NetraMark's current internal expectations, estimates, projections, assumptions and beliefs, and views of future events. Forward-looking information can be identified by the use of forward-looking terminology such as \"expect\", \"likely\", \"may\", \"will\", \"should\", \"intend\", \"anticipate\", \"potential\", \"proposed\", \"estimate\" and other similar words, including negative and grammatical variations thereof, or statements that certain events or conditions \"may\", \"would\" or \"will\" happen, or by discussions of strategy. Forward-looking information includes estimates, plans, expectations, opinions, forecasts, projections, targets, guidance, or other statements that are not statements of fact. The forward-looking statements are expectations only and are subject to known and unknown risks, uncertainties and other important factors that could cause actual results of the Company or industry results to differ materially from future results, performance or achievements. Any forward-looking information speaks only as of the date on which it is made, and, except as required by law, NetraMark does not undertake any obligation to update or revise any forward-looking information, whether as a result of new information, future events, or otherwise. New factors emerge from time to time, and it is not possible for NetraMark to predict all such factors.</p><p class=\"\">When considering these forward-looking statements, readers should keep in mind the risk factors and other cautionary statements as set out in the materials we file with applicable Canadian securities regulatory authorities on SEDAR+ at www.sedarplus.ca including our Management's Discussion and Analysis for the year ended September 30, 2024. These risk factors and other factors could cause actual events or results to differ materially from those described in any forward-looking information.</p><p class=\"\">The CSE does not accept responsibility for the adequacy or accuracy of this release.</p><p class=\"\">SOURCE NetraMark Holdings Inc.</p><p class=\"\">View original content to download multimedia: http://www.newswire.ca/en/releases/archive/February2025/04/c3701.html</p><p class=\"\">/CONTACT:</p><p class=\"\">Contact Information: Swapan Kakumanu - CFO | swapan@netramark.com</p><p class=\"\">Copyright CNW Group 2025</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013227:0/",
            "pub_date": "2025-02-05 06:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013237:0",
            "title": "Sterling Gains 0.26% to $1.2481 — Data Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">British pound/dollar: 1.2481 dollars per British pound (0.8012 British pound per dollar)</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Today the British pound gained 0.26% vs. the dollar</li><li class=\"listItem-bmN0_SHH\">Up for two straight sessions</li><li class=\"listItem-bmN0_SHH\">Up 0.70% over the last two sessions</li><li class=\"listItem-bmN0_SHH\">Largest two-day percentage gain since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 16.09% since the pre-Brexit vote level of 1.49 on Thursday, June 23, 2016</li><li class=\"listItem-bmN0_SHH\">Highest five pm New York rate since Monday, Jan. 27, 2025</li><li class=\"listItem-bmN0_SHH\">Off 6.96% from its 52-week high of 1.3415 hit Tuesday, Sept. 24, 2024</li><li class=\"listItem-bmN0_SHH\">Up 2.58% from its 52-week low of 1.2167 hit Friday, Jan. 17, 2025</li><li class=\"listItem-bmN0_SHH\">Down 0.94% vs the dollar from 52 weeks ago</li><li class=\"listItem-bmN0_SHH\">Year-to-date the British pound is down 0.26% vs the dollar</li></ul><p class=\"\">Data based on 5 p.m. ET values</p><p class=\"\">Source: Tullett Prebon and Dow Jones Market Data</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013237:0-sterling-gains-0-26-to-1-2481-data-talk/",
            "pub_date": "2025-02-05 06:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}