{
    "data": [
        {
            "id": "DJN_DN20250205005960:0",
            "title": "Alphabet Is Maintained at Overweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:23 GMT) </strong>Alphabet Price Target Cut to $210.00/Share From $215.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005960:0/",
            "pub_date": "2025-02-05 21:23:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309842:0",
            "title": "Luca Mining Achieves Target Throughputs at Mexican Mines",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Luca Mining  said Wednesday that it achieved target throughput rates at the Campo Morado zinc-copper-gold mine and the Tahuehueto gold-silver mine, both in Mexico. </p><p class=\"\">The company said it achieved throughput rates of 2,000 tonnes per day (tpd) at the Campo Morado zinc/copper/gold mine, and the mill is now consistently running at this rate, representing a 43% increase over the preceding six months. </p><p class=\"\">The next phase of optimization efforts will now focus on improving throughput to 2,400 tpd over the coming months. </p><p class=\"\">At Tahuehueto, Luca said mill throughput started to stabilize at the 1,000 tpd level. In January, the mill processed over 24,700 tonnes of ore despite a planned shutdown of over a week. </p><p class=\"\">In preparation for commercial production in early 2025, the company said it is working to ensure sufficient parts and commodity supply redundancy is in place for its operations through purchasing and stocking a new warehouse now under construction on site. </p><p class=\"\">\"We've been able to quickly increase production at both operations and we can clearly see a path forward for further increases ahead,\" CEO Dan Barnholden said. </p><p class=\"\">Luca's share price fell 1.1% on Tuesday to $0.91 on the TSXV.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309842:0/",
            "pub_date": "2025-02-05 21:23:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005967:0",
            "title": "Starboard Launches Proxy Fight at Kenvue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Rob Curran</p><p class=\"\">Activist investment firm Starboard Value has launched a proxy battle with pharmacy supplier Kenvue, running a slate of four board nominees including Starboard head Jeff Smith.</p><p class=\"\">Kenvue, a maker of over-the-counter medical products such as Band-Aids and Tylenol, was spun off by Johnson &amp; Johnson in a 2023 initial public offering. Shares of Kenvue are up by 1.6% in the last 12 months. Rival Haleon, which sells Advil, are up 14% over the same period.</p><p class=\"\">In a filing with the Securities and Exchange Commission, Starboard complimented the Kenvue franchise, but expressed disappointment with management and share-price performance.</p><p class=\"\">\"Despite the company's promising future prospects, Kenvue has suffered from persistent disappointing and deteriorating financial results, missed commitments, and ineffective board oversight, resulting in stock price underperformance and a significant valuation discount compared to peers,\" said Starboard, in its filing.</p><p class=\"\">Starboard's nominees are Michelle Millstone-Shroff, Cara Robinson, Bindu Shah and Smith.</p><p class=\"\">Millstone-Shroff was an executive at Bed Bath &amp; Beyond, including a role as president and chief operating officer of its buybuy Baby unit.</p><p class=\"\">Robinson was an executive at the beauty-products arm of consumer-products conglomerate Unilever.</p><p class=\"\">Shah is an executive at fashion brand Tory Burch.</p><p class=\"\">In October, Smith said that Kenvue should drill down on fixing its underperforming skin health and beauty segment that he believes is weighing on the company's overall performance. Smith also advocated improving the company's marketing strategy.</p><p class=\"\">Write to Rob Curran at rob.curran@dowjones.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005967:0/",
            "pub_date": "2025-02-05 21:24:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0L3:0",
            "title": "Russian firms under pressure from tough borrowing conditions",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    A quarter of Russian companies said tough borrowing conditions were the main factor limiting their development, major business union RSPP said on Wednesday. </p><p class=\"\">Interest rates at 21%, their highest in over 20 years, are weighing generally on the Russian economy, growth of which is expected to slow this year.</p><p class=\"\">Companies that responded to the Russian Union of Industrialists and Entrepreneurs' (RSPP) quarterly survey of the Russian economy and company activity, covering the end of last year, said a lack of working capital was the biggest overall issue. It was cited by 26%, up from 22% last quarter. </p><p class=\"\">Meanwhile, 25% said the difficulty of borrowing was a major issue, up from 11% in the previous quarter. </p><p class=\"\">Currency instability and the growing fiscal burden have also become increasing concerns for companies in recent months, the survey showed. </p><p class=\"\">The Bank of Russia next meets to set interest rates on Feb. 14, with analysts polled by Reuters expecting a hold at 21%, but for the bank to maintain cautious rhetoric.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0L3:0-russian-firms-under-pressure-from-tough-borrowing-conditions/",
            "pub_date": "2025-02-05 21:24:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309915:0",
            "title": "Wedbush Raises Price Target on Electronic Arts to $179 From $173, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Electronic Arts  has an average rating of overweight and mean price target of $146.45, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309915:0/",
            "pub_date": "2025-02-05 21:24:34",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309914:0",
            "title": "Daiwa Securities Adjusts Merck Price Target to $95 From $100",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Merck  has an average rating of overweight and mean price target of $116.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309914:0/",
            "pub_date": "2025-02-05 21:24:53",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX91qMzc:0",
            "title": "Creative Medical Technology Holdings Expands Collaboration with Greenstone Biosciences to Accelerate iPSCelz Pipeline Development",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PHOENIX, Feb.  05, 2025  (GLOBE NEWSWIRE) — <!-- -->Creative Medical Technology Holdings, Inc.  (“Creative Medical”), a clinical-stage biotechnology company advancing regenerative medicine solutions, today announced an expanded agreement with Greenstone Biosciences Inc. (“Greenstone”) to leverage Artificial Intelligence (AI) in further developing its human induced pluripotent stem cell (iPSC) platform for diabetes treatment.</p><p class=\"\">This strategic collaboration extends the progress made on Creative Medical’s proprietary hypoimmune iPSC technology, including its iPSC-derived pancreatic islet cells. These innovative cell lines, developed from Good Manufacturing Practice (GMP) grade human perinatal cells, are currently being used in clinical trials. By integrating AI-driven drug discovery, the partnership aims to identify small molecules that enhance insulin secretion, further refining the therapeutic potential of Creative Medical’s hypoimmunogenic iPSC-derived pancreatic islet cells. Additionally, the program will implement multi-gene editing to develop next generation hypoimmune iPSC lines with enhanced stealth, survival, and differentiation capabilities. These advancements will not only optimize pancreatic islet cell function but also expand the platform’s applications to other regenerative therapies, addressing critical unmet medical needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Addressing a Major Clinical Challenge</strong></p><p class=\"\">One of the most pressing challenges in stem cell-based therapies is the requirement for immunosuppression, which can lead to severe side effects, including mortality. By refining hypoimmune iPSC lines through AI-guided development, Creative Medical is actively working to overcome these barriers, paving the way for safer and more effective cell-based treatments for diabetes and other chronic conditions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Leadership Perspective</strong></p><p class=\"\">“Creative Medical is at the forefront of regenerative medicine, and our extended partnership with Greenstone Biosciences marks a significant milestone in our mission to develop transformative therapies,” said Timothy Warbington, President and CEO of Creative Medical.</p><p class=\"\"> “Dr. Wu and his team at Greenstone have been instrumental in validating and advancing our proprietary iPSC platform. By incorporating AI-driven methodologies, we estimate that this program will reduce R&amp;D time by approximately 50% compared to other methods and produce millions of dollars in cost savings.  We are poised to accelerate innovation, enhance therapeutic efficacy, and position ourselves as a leader in the evolving landscape of personalized medicine.” </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Advancing Multi-Gene Edited Hypoimmune iPSCs</strong></p><p class=\"\">The next phase of development focuses on multi-gene edited hypoimmune iPSCs—cells engineered with precise modifications to evade immune detection, improve survival, and optimize therapeutic potential. These cutting-edge advancements offer the potential to eliminate the need for immunosuppression, significantly improving patient outcomes in cell-based regenerative therapies.</p><p class=\"\">As Creative Medical continues to push the boundaries of regenerative medicine, this collaboration reinforces its commitment to leveraging AI and genetic engineering to address some of the most pressing challenges in modern healthcare.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Creative Medical Technology Holdings, Inc.</strong></p><p class=\"\">Creative Medical Technology Holdings, Inc. is a clinical-stage biotechnology company dedicated to developing groundbreaking regenerative therapies using stem cell and immune modulation technologies. The company’s pipeline targets a range of conditions, with a focus on diabetes, autoimmune disorders, orthopedic and neurological diseases. For more information, visit www.creativemedicaltechnology.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains forward-looking statements under the Private Securities Litigation Reform Act of 1995. These statements involve risks and uncertainties, including those detailed in the Company’s filings with the Securities and Exchange Commission. Forward-looking statements reflect the Company’s current views but are not guarantees of future results.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Creative Medical Technology Holdings, Inc.</p><p class=\"\">IR@CreativeMedicalTechnology.com</p><p class=\"\">Investor Relations:</p><p class=\"\">Devin Sullivan, Managing Director</p><p class=\"\">The Equity Group Inc.</p><p class=\"\">dsullivan@equityny.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX91qMzc:0-creative-medical-technology-holdings-expands-collaboration-with-greenstone-biosciences-to-accelerate-ipscelz-pipeline-development/",
            "pub_date": "2025-02-05 21:25:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309916:0",
            "title": "JPMorgan Adjusts Merck Price Target to $130 From $145",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Merck  has an average rating of overweight and mean price target of $116.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309916:0/",
            "pub_date": "2025-02-05 21:25:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309910:0",
            "title": "Market Chatter: TotalEnergies CEO Pouyanne Calls on EU to Secure Free Trade Deal to Guarantee US LNG Supply",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">TotalEnergies  Chief Executive Patrick Pouyanne said Wednesday that Europe should renege in talks with the US with the aim of securing a free-trade guarantee for liquefied natural gas, Reuters reported. </p><p class=\"\">Pouyanne told reporters that US LNG export capacity could double in coming years, presenting both an opportunity for Europe to wean itself off Russian energy and a risk of becoming dependent on another superpower, the report said. </p><p class=\"\">\"What happens if all of a sudden the US decides they must export less than they've done historically?\" he said, according to Reuters. \"We must not pass from a so-called over-dependence on Russia to an over-dependence on another country, even if it's an ally.\"</p><p class=\"\">EU member states have demanded guarantees of US natural gas supplies before barring imports of Russian gas, according to the report. </p><p class=\"\">TTE shares were 2.1% higher in recent premarket activity. </p><p class=\"\">(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309910:0/",
            "pub_date": "2025-02-05 21:25:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2464042:0",
            "title": "Tongdao Liepin Group's Unit Invest 80 Million Yuan in Structured Deposit Product",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Tongdao Liepin Group  through its subsidiary TD Elite (Tianjin) Information Technology subscribed for 80 million yuan of corporate structured deposit products from Xiamen International Bank on Wednesday, a same-day Hong Kong bourse filing said. </p><p class=\"\">The subscription was funded through the redeemed amount from previously subscribed structured deposits of the bank.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2464042:0/",
            "pub_date": "2025-02-05 21:25:31",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1DI:0",
            "title": "Ford's gas vehicles head to take on expanded role of leading EV unit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Ford  said on Wednesday the president of its gasoline vehicles business, Andrew Frick, would take on the additional role of leading its money-losing electric vehicle business.</p><p class=\"\">The company also said that Frick would continue to oversee Ford's commercial vehicles unit until a new leader is named.</p><p class=\"\">The Detroit-based automaker is expected to report a higher fourth-quarter profit later in the day. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1DI:0-ford-s-gas-vehicles-head-to-take-on-expanded-role-of-leading-ev-unit/",
            "pub_date": "2025-02-05 21:25:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW19K:0",
            "title": "Reservoir Media Forecast 2025 Revenue Between $155 Million To $158 Million",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Reservoir Media Inc :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">RESERVOIR MEDIA INC OUTLOOK 2025 REVENUE $155 MILLION - $158 MILLION</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RESERVOIR MEDIA INC OUTLOOK 2025 ADJUSTED EBITDA $61.5M - $64.5M</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW19K:0-reservoir-media-forecast-2025-revenue-between-155-million-to-158-million/",
            "pub_date": "2025-02-05 21:25:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309882:0",
            "title": "Banco Santander Brasil Q4 Net Profit, Revenue Increase",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Banco Santander Brasil , a unit of Spain's Banco Santander , reported Q4 net profit Wednesday of 3.86 billion Brazilian reais ($667 million), up from 2.20 billion reais a year earlier. </p><p class=\"\">Four analysts surveyed by FactSet expected 3.56 billion reais. </p><p class=\"\">Revenue for the quarter, expressed as the sum of net interest income and fees, was 21.49 billion reais, up from 18.79 billion reais a year earlier. </p><p class=\"\">Three analysts polled by FactSet expected 20.16 billion reais.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309882:0/",
            "pub_date": "2025-02-05 21:25:43",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkrs4lVn:0",
            "title": "White Pearl Technology Group AB terminates liquidity provider agreement",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>White Pearl Technology Group AB<p class=\"\">White Pearl Technology Group AB (\"WPTG\") announces the termination of its liquidity provider agreement with Pareto Securities AB. The last day of liquidity support services will be February 5, 2025.</p><p class=\"\">The purpose of the liquidity provider has been to increase the liquidity of stock trading and reduce the volatility of the Company's stock to facilitate trading. The Company has assessed that the need for a liquidity provider is now limited and has, therefore, terminated the agreement.</p><p class=\"\">For more information, please contact:</p><p class=\"\">Investor Relations Manager White Pearl Technology Group AB Email: ir@whitepearltech.com Phone: +46 707 340804</p><p class=\"\">The company's Certified Adviser is Amudova AB, email: info@amudova.se.</p><p class=\"\">About White Pearl Technology Group AB: White Pearl Technology Group AB (WPTG) is a global technology company specialising in digital transformation solutions. With a presence in over 30 countries and a team of more than 680 experts, WPTG helps organisations navigate the complexities of the digital age, offering services ranging from ICT and system integration to business software and digital innovation.</p><p class=\"\">https://news.cision.com/white-pearl-technology-group-ab/r/white-pearl-technology-group-ab-terminates-liquidity-provider-agreement%2Cc4101109</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkrs4lVn:0-white-pearl-technology-group-ab-terminates-liquidity-provider-agreement/",
            "pub_date": "2025-02-05 21:18:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNXcbRFGx:0",
            "title": "Cyabra Launches AI-Powered 'Insights' Feature, Safeguarding Brands and Governments Against AI-Driven Digital Disinformation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">False news stories are 70% more likely to be shared than true stories across digital platforms, and experts predict disinformation will become the top challenge for public and private sectors worldwide in 2025.</li><li class=\"listItem-bmN0_SHH\">Cyabra’s <em>Insights </em>feature equips organizations to quickly and confidently detect and comprehend digital threats.</li></ul><p class=\"\">New York, NY, Feb.  05, 2025  (GLOBE NEWSWIRE) —  Cyabra Ltd. (“Cyabra”), a leading AI platform for real-time disinformation detection, introduces <em>Insights</em>, a powerful new AI-feature designed to transform complex social media disinformation data into clear, actionable answers in seconds.</p><p class=\"\">False narratives, fake accounts, and AI-generated content are spreading faster than ever, costing businesses and governments billions annually and eroding public trust and reputations. With AI-generated disinformation spreading six times faster than the truth—especially during high-stakes events like elections and holiday seasons—the need for rapid-response tools has never been more critical. </p><p class=\"\"><em>Insights</em> takes the complexity out of disinformation detection by breaking down Cyabra’s robust data findings into intuitive visuals and an automated Q&amp;A format. In response to users' most common requests and questions, <em>Insights</em> empowers brands and governments to quickly uncover harmful narratives, identify fake accounts (bots), and understand how false content spreads—saving time, resources, and reputations during critical moments.</p><p class=\"\">“Every second matters when identifying and countering disinformation,” said Dan Brahmy, CEO and co-founder of Cyabra. “Insights turns vast amounts of data into clear, actionable knowledge, empowering our clients to uncover the real story behind the data and respond before the damage is done. It’s like having an expert analyst at your fingertips.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key Features of <em>Insights</em>:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Automated Disinformation Analysis:</strong> Identifies bots, fake profiles, and harmful narratives without manual input.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Clear, Actionable Visuals:</strong> Unveils trends, patterns, and key metrics with heatmaps and charts that anyone can understand.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">User-Friendly Q&amp;A Format:</strong> Answers critical questions about disinformation scans in seconds, helping users decide their next steps with confidence.</li></ul><p class=\"\">“Clients often ask, ‘What’s next?’ when confronting disinformation,” said Yossef Daar, CPO and co-founder of Cyabra. “Insights takes the guesswork out of analysis, giving users a straightforward, visual way to see where false narratives are spreading, who’s behind them, and what’s driving engagement. This enables them to respond to digital threats faster and more effectively.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">During beta testing, <em>Insights</em> enabled:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">A <strong class=\"root-Tkn6WL2y\">Fortune 500</strong> company to neutralize reputational damage in minutes after detecting a disinformation spike about its CEO.</li><li class=\"listItem-bmN0_SHH\">A<strong class=\"root-Tkn6WL2y\"> government agency</strong> to uncover and disrupt hashtags fueling disinformation campaigns, enabling quicker interventions.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><em>Insights</em></strong><strong class=\"root-Tkn6WL2y\"> is now available on Cyabra’s platform. </strong></p><p class=\"\">Cyabra has entered into a business combination agreement (the “Business Combination Agreement”) with Trailblazer Merger Corporation I  (“Trailblazer”), a blank-check special-purpose acquisition company.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Cyabra</strong></p><p class=\"\">Cyabra Strategy Ltd. (“Cyabra”) is a real-time AI-powered platform that uncovers and analyzes online disinformation and misinformation by uncovering fake profiles, harmful narratives, and GenAI content across social media and digital news channels. Cyabra’s AI protects corporations and governments against brand reputation risks, election manipulation, foreign interference, and other online threats. Cyabra’s platform leverages proprietary algorithms and NLP solutions, gathering and analyzing publicly available data to provide clear, actionable insights and real-time alerts that inform critical decision-making. Cyabra uncovers the good, bad, and fake online.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, visit</strong> <strong class=\"root-Tkn6WL2y\">www.cyabra.com</strong>. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media Contact: </strong></p><p class=\"\">Jill Burkes</p><p class=\"\">Jill@cyabra.com</p><p class=\"\">Signal Contact: Jillabra.24</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investor Relations Contact:</strong></p><p class=\"\">Miri Segal</p><p class=\"\">MS-IR</p><p class=\"\">msegal@ms-ir.com </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Trailblazer</strong></p><p class=\"\">Trailblazer Merger Corporation I  is a blank check company formed and entered into a merger, shared exchange, asset acquisition, stock purchase, recapitalization, reorganization, or other similar business combination with one or more businesses or entities. <strong class=\"root-Tkn6WL2y\">For more information, visit:</strong> www.trailblazermergercorp.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">This press release contains certain forward-looking statements within the meaning of the federal securities laws with respect to certain products that will be the subject of a proposed transaction between Trailblazer Merger Corporation I (\"Trailblazer\") and Cyabra Strategy Ltd. (\"Cyabra\"). All statements other than statements of historical facts contained in this press release, including statements regarding Cyabra's business strategy, products, research and development costs, plans and objectives of management for future operations, and future results of current and anticipated product offerings, are forward-looking statements. These forward-looking statements generally are identified by the words \"believe,\" \"project,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"strategy,\" \"future,\" \"opportunity,\" \"plan,\" \"may,\" \"should,\" \"will,\" \"would,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. These forward-looking statements are subject to a number of risks, uncertainties and assumptions, including, but not limited to, the following risks relating to the proposed transaction: the ability to complete the Business Combination or, if Trailblazer does not consummate such Business Combination, any other initial business combination; expectations regarding Cyabra’s strategies and future financial performance, including its future business plans or objectives, prospective performance and opportunities and competitors, revenues, products and services, pricing, operating expenses, market trends, liquidity, cash flows and uses of cash, capital expenditures, and Cyabra’s ability to invest in growth initiatives and pursue acquisition opportunities; the occurrence of any event, change or other circumstances that could give rise to the termination of the Business Combination Agreement; the outcome of any legal proceedings that may be instituted against Trailblazer or Cyabra following announcement of the Business Combination Agreement and the transactions contemplated therein; the inability to complete the proposed Business Combination due to, among other things, the failure to obtain Trailblazer stockholder approval; the risk that the announcement and consummation of the proposed Business Combination disrupts Cyabra’s current operations and future plans;  the ability to recognize the anticipated benefits of the proposed Business Combination; unexpected costs related to the proposed Business Combination; the amount of any redemptions by existing holders of Trailblazer’s common stock being greater than expected; limited liquidity and trading of Trailblazer’s securities; geopolitical risk and changes in applicable laws or regulations; the size of the addressable markets for Cyabra’s products and services; the possibility that Trailblazer and/or Cyabra may be adversely affected by other economic, business, and/or competitive factors; the ability to obtain and/or maintain the listing of Combined Company’s Common Stock on Nasdaq following the Business Combination; operational risk; and the risks that the consummation of the proposed Business Combination is substantially delayed or does not occur.</p><p class=\"\">Important Information for Investors and Stockholders</p><p class=\"\">Trailblazer will file a registration statement on Form S-4 with the SEC, which will include a proxy statement for Trailblazer's stockholders and a prospectus related to the securities of the combined company. After the registration statement is declared effective, the proxy statement/prospectus will be sent to all Trailblazer stockholders.</p><p class=\"\">INVESTORS AND STOCKHOLDERS OF TRAILBLAZER ARE URGED TO READ THE REGISTRATION STATEMENT, PROXY STATEMENT/PROSPECTUS, AND OTHER RELEVANT DOCUMENTS FILED OR TO BE FILED WITH THE SEC CAREFULLY WHEN THEY BECOME AVAILABLE, AS THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE TRANSACTION AND THE PARTIES INVOLVED.</p><p class=\"\">Once filed, free copies of these documents can be obtained from the SEC's website at  www.sec.gov. Additional information about Trailblazer can be found on its website at  www.trailblazermergercorp.com or by contacting info@trailblazermergercorp.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Participants in the Solicitation</strong></p><p class=\"\">Cyabra, Trailblazer, and their respective directors and executive officers may be deemed participants in the solicitation of proxies from Trailblazer stockholders regarding the transaction. Information about Trailblazer's directors and executive officers and their ownership of Trailblazer's securities is set forth in Trailblazer's most recent Annual Report on Form 10-K filed with the SEC, as modified or supplemented by any Form 3 or Form 4 filed with the SEC since the date of such filing. Other information regarding the interests of the participants in the proxy solicitation will be included in the proxy statement/prospectus pertaining to the proposed Transactions when it becomes available.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">No Offer or Solicitation</strong></p><p class=\"\">This press release does not constitute an offer to sell or a solicitation of an offer to buy any securities, or a solicitation of any vote or approval. No sale of securities shall occur in any jurisdiction in which such offer, solicitation, or sale would be unlawful before registration or qualification under applicable laws.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNXcbRFGx:0-cyabra-launches-ai-powered-insights-feature-safeguarding-brands-and-governments-against-ai-driven-digital-disinformation/",
            "pub_date": "2025-02-05 21:19:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309907:0",
            "title": "Wedbush Raises Price Target on Corsair Gaming to $12 From $10, Maintains Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Corsair Gaming  has an average rating of overweight and mean price target of $9, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309907:0/",
            "pub_date": "2025-02-05 21:19:01",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309908:0",
            "title": "UBS Adjusts Price Target on Gartner to $632 From $592, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Gartner  has an average rating of hold and mean price target of $574.11, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309908:0/",
            "pub_date": "2025-02-05 21:19:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1PN:0",
            "title": "\"More pay\": UK consumer eyes boost",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">STOXX 600 up 0.2%</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Santander, Novo Nordisk, GSK all gain on results</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nasdaq futures down 0.7%, S&amp;P500 futures down 0.4%</li></ul></span></div><span><p class=\"\">\"MORE PAY\": UK CONSUMER EYES BOOST</p><p class=\"\">The UK consumer is poised for a decent boost in disposable income, according to Jefferies analysts. </p><p class=\"\">As they put it, the emerging trend is one of \"Less Work, More Pay\", with their proprietary UK consumer cashflow model pointing to a 6% rise in disposable income in 2025-2026, driven by rising wages and sinking energy costs.     </p><p class=\"\">This trend, which follows a rise of just 1% of disposable income last year, is set to offset pressures from housing and backs their constructive view for disposable income-led growth along with their buy ratings for Tesco, Next and Sainsbury's.  </p><p class=\"\">The picture, however, is not all rosy.</p><p class=\"\">Jefferies says the UK job market has become more muted, with the autumn budget adding to the problems, and their real-time data supporting the view that lower-skilled workers will be hit.</p><p class=\"\">This means a selective approach focused on the market-share winners is warranted. </p><p class=\"\">\"The extent to which this worsening employment picture is anticipated by consumers... will remain a topic for debate, but our analysis of consumer trends hints that the marginal propensity to save may be slowing.\"</p><p class=\"\">*****  </p><p class=\"\">FOR EARLIER LIVE MARKETS POSTS</p><p class=\"\">FX TRADERS' HORIZONS \"AS SHORT AS THEY'VE EVER BEEN\" CLICK HERE</p><p class=\"\">GOLD MINERS: MIND THE GAP CLICK HERE </p><p class=\"\">BIG GAINERS BUT STOXX 600 FLAT CLICK HERE</p><p class=\"\">EUROPE BEFORE BELL: EARNINGS KEEP YOU BUSY CLICK HERE</p><p class=\"\">MARKETS CONFOUNDED BY TRUMP'S GAZA PROPOSAL CLICK HERE </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1PN:0-more-pay-uk-consumer-eyes-boost/",
            "pub_date": "2025-02-05 21:19:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309906:0",
            "title": "Leerink Partners Adjusts Merck Price Target to $113 From $118",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Merck  has an average rating of overweight and mean price target of $116.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309906:0/",
            "pub_date": "2025-02-05 21:19:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0N6:0",
            "title": "European stocks step out from US shadow in 2025, but for how long",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    European stocks have staged their best performance in a decade against Wall Street in the first six weeks of 2025, but hopes among some they can finally end years of underperformance could yet be dashed by long-standing structural challenges.</p><p class=\"\">Seizing on extreme company valuation gaps, investors are piling into European equities, eyeing several potential catalysts that might mean this rally is different from those before, which have typically fizzled fairly quickly.    </p><p class=\"\">Fund inflows into European stocks reached their second-highest in 25 years in January and major benchmarks continue to hit record highs, beating their U.S. counterparts, as investors look for the region's stars to finally align.</p><p class=\"\">The hope is that Germany might loosen its fiscal policy after elections this month, tensions in Ukraine could subside and U.S. tariffs might end up being less severe than feared. </p><p class=\"\">And the recent rout in stocks of Wall Street's artificial intelligence megacaps on the emergence of cheaper Chinese rivals suggests market leadership could expand to neglected sectors, in which Europe is particularly strong.</p><p class=\"\">Gains in Frankfurt, Zurich, London, Milan and Paris so far this year have propelled the broader STOXX 600  up by more than 5.5%, while the S&amp;P 500 has risen only 2.7%.</p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:797.7464788732394px;aspect-ratio:1.3295774647887324\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0N6-c69066dda428cdc1dfb1e077e9abf48d-resized.webp\" type=\"images/webp\"/><img alt=\"snapshot\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0N6-c69066dda428cdc1dfb1e077e9abf48d-resized.jpeg\" style=\"background-color:#1f1f1d\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Wall Street trails Europe</span></figcaption></figure></span></p><p class=\"\">LEG UP </p><p class=\"\">Marc Halperin, portfolio manager at Edmond de Rothschild AM, is upbeat, especially given the stretched investor positioning. </p><p class=\"\">\"Where is the marginal seller? It's hard to find because everyone is today largely underweight on Europe,\" said Halperin, who in December increased his euro zone cyclical stock holdings. </p><p class=\"\">Halperin anticipates a rebound in leading indicators, potential interest rate cuts from the European Central Bank and the U.S. Federal Reserve pausing, as well as a possible Ukraine ceasefire reducing energy costs.    </p><p class=\"\">\"Europe is focused on sectors like automotive, which have significant room to grow because they are depressed. This strong performance seen since the start of the year could last a little more in the weeks and months to come,\" he added. </p><p class=\"\">Research firm SentimenTrader notes that several technical metrics that reflect how broad a rally is - such as the 10-day advance/decline ratio and stocks that are trading above their 50-day moving averages - have spiked.</p><p class=\"\">This draws a pattern that historically has preceded a period of gains over the next one to three months, it said.</p><p class=\"\">Nordea strategist Hertta Alava, meanwhile, also anticipates further outperformance in the coming months as valuations are attractive and earnings growth is accelerating, which will narrow the gap with U.S. companies. </p><p class=\"\">At 14 times expected earnings, the MSCI Europe (.dMIEU00000NEU) trades at a near record discount of 37.5% to the MSCI USA (.dMIUS00000PUS), LSEG data shows. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:798.5915492957747px;aspect-ratio:1.3309859154929577\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0N6-3c9882f900e92a0f5488458d247d5297-resized.webp\" type=\"images/webp\"/><img alt=\"snapshot\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0N6-3c9882f900e92a0f5488458d247d5297-resized.jpeg\" style=\"background-color:#2e251c\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">Europe discount to US</span></figcaption></figure></span></p><p class=\"\">Since the late 1980s, U.S. stocks have increased by 25 times, while European stocks have risen by less than six.</p><p class=\"\">However, any further surge is unlikely to truly challenge Wall Street's long-term dominance. Europe has seen occasional rallies over the past 40 years, but these have tended to be short-lived, especially after the global financial crisis.</p><p class=\"\">Michele Morganti, strategist at Generali Investments, also notes lower growth in U.S. tech earnings and possible bolder China stimulus measures might allow for a shift towards Europe.</p><p class=\"\">But structural challenges remain, he said, adding: \"Europe still faces issues, such as less energy independence, poor governance ... fragmented energy and capital markets, lower population growth, and lower tech investments\".  </p><p class=\"\">European earnings growth this year is expected to accelerate significantly, to 7.9% from just 1% last year and following a 3.9% decline in 2023, LSEG IBES forecast show.</p><p class=\"\">In contrast, while U.S. earnings growth is expected to increase at a slower rate this year, it is still anticipated to be higher than Europe's, at 14.1%, from over 10% last year </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0N6:0-european-stocks-step-out-from-us-shadow-in-2025-but-for-how-long/",
            "pub_date": "2025-02-05 21:19:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005924:0",
            "title": "Spotify Technology Is Maintained at Overweight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(13:20 GMT) </strong>Spotify Technology Price Target Raised to $670.00/Share From $550.00 by Morgan Stanley</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005924:0/",
            "pub_date": "2025-02-05 21:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205007820:0",
            "title": "DeepSeek and tariffs have roiled the market. History shows deeper pullbacks are coming, this strategist says.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Barbara Kollmeyer</p><p class=\"\">But American corporations will keep the bull market going, says Truist's Keith Lerner</p><p class=\"\">Despite the bumps for Wall Street to kick off the new year, the S&amp;P 500 SPX has held up fairly well, still positive and just over 1% away from making a new high.</p><p class=\"\">Truist Advisory Services' chief market strategist Keith Lerner says the \"carousel of tariffs\" and DeepSeek-related headlines have upended markets, but things could get much rockier as he urges clients to not react to each one.</p><p class=\"\">While his \"market uptrend remains intact...the latest tariff developments underscore the potential for disruptions and broken pieces that we expected to be part of the investment narrative in 2025.\"</p><p class=\"\">In our call of the day, Lerner also cautions against rushing into buy on market dips caused by those newsy headlines. \"With stocks not far from all-time highs and after a strong January, it's premature to say this current setback presents a great buying opportunity,\" he told clients in a new note.</p><p class=\"\">Over the past 40 years, the market has averaged a maximum intra-year pullback of around 14%, said the strategist. Stocks have also been up in 33 of 40 of those years - 83% of the time.</p><p class=\"\">Positives for stocks? Lerner said they expect the U.S. economy to stay resilient in 2025, given how it weathered the pandemic, high inflation and the fastest Fed rate-hiking cycle in decades. He also notes a more balanced performance across the stock market so far with 10 of 11 large-cap sectors up this year.</p><p class=\"\">He expects earnings will deliver - this current earnings solid has been \"solid,\" with 79% of S&amp;P 500 companies reporting beating consensus earnings estimates-and exceeding those estimates by an average of 6%, he says.</p><p class=\"\">As for where investors should be keeping their money, Lerner says he's holding on to a \"longstanding U.S. equity bias relative to international markets,\" owing to stronger economic and earnings trends.</p><p class=\"\">Lerner prefers large-cap stocks over small-caps, due to strong balance sheets and \"more levers to pull to manage through challenging periods.\" And he also likes midcaps over small-caps, owing to stronger financial footing and better earnings trends.</p><p class=\"\">And he's focused on higher quality when it comes to fixed income, with \"tension between the potential of higher inflation offset by a flight to quality in the 10-year U.S. Treasury yield.\" A modest position in gold is also something he favor right now, and for some investors, allocating to alternative strategies such as hedge funds can help smooth out the bumps  he expects.</p><p class=\"\">The markets</p><p class=\"\">Nasdaq-100 futures (NQ00) are leading declines for U.S. stock futures (ES00) (YM00), with Treasury yields BX:TMUBMUSD10Y BX:TMUBMUSD02Y down and the dollar DXY off another 0.5%.</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Key asset performance                                                Last       5d      1m      YTD    1y <br/>   S&amp;P 500                                                              6037.88    -0.49%  2.18%   2.66%  21.87% <br/>   Nasdaq Composite                                                     19,654.02  -0.40%  0.84%   1.78%  25.91% <br/>   10-year Treasury                                                     4.49       -2.90   -19.80  -8.60  33.32 <br/>   Gold                                                                 2892.8     4.34%   7.94%   9.60%  41.05% <br/>   Oil                                                                  72.36      -0.89%  -1.31%  0.68%  -2.32% <br/>   Data: MarketWatch. Treasury yields change expressed in basis points </pre><p class=\"\">For more market updates plus actionable trade ideas for stocks, options and crypto, subscribe to MarketDiem by Investor's Business Daily.</p><p class=\"\">The buzz</p><p class=\"\">Alphabet's stock (GOOGL) is tumbling after a revenue miss and big plans for AI spending.</p><p class=\"\">AMD shares (AMD) are sliding after a disappointing outlook for its data-center business, as it won't give AI revenue forecasts anymore.</p><p class=\"\">Mattel (MAT) is jumping on upbeat profit and Barbie forecasts. A disappointing sales forecast is hitting Chipotle shares (CMG).</p><p class=\"\">Disney stock (DIS) is headed for a two-year high after an earnings beat and affirming its outlook.</p><p class=\"\">Uber (UBER) stock is dropping after part of its outlook disappointed investors. Disney shares (DIS) are headed for a two-year high after affirming its outlook and beating earnings.</p><p class=\"\">Ford (F) results and Costco (COST) sales coming after the close.</p><p class=\"\">The U.S. Post Office will stop accepting parcels from China, news that weighed on shares of Amazon.com (AMZN) and Temu owner PDD (PDD).</p><p class=\"\">Private-sector payroll data is coming at 8:15 a.m., the U.S. trade deficit at 8:30 a.m. and the Institute for Supply Management's services survey at 10 a.m. Among Fed speakers, we'll hear from Richmond Fed President Tom Barkin and Chicago Fed President Goolsbee.</p><p class=\"\">Best of the web</p><p class=\"\">Why central banks' hunger for gold shows 'no sign of being quelled' this year.</p><p class=\"\">Trump campaigned on ending foreign entanglements. Now he wants to own Gaza.</p><p class=\"\">The young techies assigned to help Musk slash size of U.S. government.</p><p class=\"\">The chart</p><p class=\"\">The above chart shows how gold miners continue to lag the precious metal (GC00), up 9.6% so far in 2025. TopDown Chart's head of research and founder Callum Thomas, who provided the chart, says gold miners have been in a 5-year trading range, and never caught up from a divergence with gold prices back in 2021. \"But with growth stocks looking increasingly overvalued and at risk in an environment of rising (geo)political risk, and gold prices going from strength to strength I think it's fair to expect some catch-up for miners,\" he writes.</p><p class=\"\">Top tickers</p><p class=\"\">These were the top-searched tickers on MarketWatch as of 6.a.m.:</p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">   Ticker  Security name <br/>   NVDA    Nvidia <br/>   TSLA    Tesla <br/>   AMD     Advanced Micro Devices <br/>   PLTR    Palantir Technologies <br/>   GOOGL   Alphabet <br/>   AAPL    Apple <br/>   GME     GameStop <br/>   TSM     Taiwan Semiconductor Manufacturing <br/>   AMZN    Amazon.com <br/>   MSFT    Microsoft </pre><p class=\"\">Random reads</p><p class=\"\">Egg-ceptional times: police are hunting thieves who stole $40,000 worth of eggs.</p><p class=\"\">A pig bites man story.</p><p class=\"\">No, Scotland will not ban cats, despite a recommendation to do so.</p><p class=\"\">Need to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. The emailed version will be sent out at about 7:30 a.m. Eastern.</p><p class=\"\">-Barbara Kollmeyer</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205007820:0/",
            "pub_date": "2025-02-05 21:20:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005929:0",
            "title": "BOE Expected to Cut Rates This Week, Keep Guidance Unchanged — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The Bank of England is expected to cut interest rates by 25 basis points to 4.50% on Thursday, TD Securities analysts say in a note. The BOE is likely to keep policy guidance unchanged, the analysts say. However, the likelihood of interest rate cuts at subsequent meetings is rising, TD Securities says. Markets place a 97% probability of a BOE rate cut this week, LSEG Refinitiv data shows. (miriam.mukuru@wsj.com.)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005929:0/",
            "pub_date": "2025-02-05 21:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005927:0",
            "title": "Acrivon Therapeutics Gets FDA Breakthrough Device Designation for Cancer Identification",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chris Wack</p><p class=\"\">Acrivon Therapeutics said the Food and Drug Administration has granted Breakthrough Device designation for its ACR-368 OncoSignature assay, an immunofluorescence assay for the identification of endometrial cancer patients who may benefit from ACR-368 treatment.</p><p class=\"\">The precision medicine company said the new designation reflects the FDA's determination that the device is reasonably expected to provide for more effective treatment or diagnosis of life-threatening or irreversibly debilitating human disease or conditions.</p><p class=\"\">The company said it sponsored a blind, third-party market research study, which showed strong interest in the emerging clinical profile of ACR-368.</p><p class=\"\">The Breakthrough Devices Program is intended to provide patients and health-care providers with timely access to medical devices by speeding up development, assessment and review for premarket approval, 510(k) clearance, and marketing authorization.</p><p class=\"\">Write to Chris Wack at chris.wack@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005927:0/",
            "pub_date": "2025-02-05 21:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1DQ:0",
            "title": "India's Sula Vineyards posts lower Q3 profit on weak urban demand",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    India's biggest winemaker Sula Vineyards  reported a 35% fall in third-quarter profit on Wednesday, as demand took a hit from a slowdown in urban consumption.</p><p class=\"\">Sula's consolidated net profit fell to 280.6 million rupees ($3.2 million) in the quarter ending Dec. 31, from 429.8 million rupees a year ago.</p><p class=\"\">Urban consumption fell to a two-year low in November, as persistently high food inflation, subdued wage growth and erratic weather patterns led consumers to pull back discretionary spending. Sula gets about 90% of its revenue from urban markets. </p><p class=\"\">Sales were also impacted due to elections in the western state of Maharashtra, which is among Sula's key markets, during the quarter, the company said. </p><p class=\"\">The winemaker's own brands segment, which contributes about 90% of the total revenue, saw a marginal 1% rise in revenue during the quarter. </p><p class=\"\">Its smaller wine tourism segment saw a 12% increase in revenue.</p><p class=\"\">Total revenue fell 0.4%, while total expenses rose about 11.4% from a year earlier.</p><p class=\"\">Sula's core profit margin contracted to 24.8% from 33.5% a year ago.</p><p class=\"\">($1 = 87.3580 Indian rupees)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1DQ:0-india-s-sula-vineyards-posts-lower-q3-profit-on-weak-urban-demand/",
            "pub_date": "2025-02-05 21:20:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309909:0",
            "title": "Goldman Sachs Adjusts Merck Price Target to $129 From $135",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Merck  has an average rating of overweight and mean price target of $116.58, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309909:0/",
            "pub_date": "2025-02-05 21:20:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309896:0",
            "title": "Wedbush Cuts Price Target on Chipotle Mexican Grill to $64 From $69, Keeps Outperform Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Chipotle Mexican Grill  has an average rating of overweight and mean price target of $66.39, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309896:0/",
            "pub_date": "2025-02-05 21:13:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005832_20250205005864:0",
            "title": "Ford Motor: Sherry House Becomes Chief Financial Officer as Planned Effective Feb. 6 >F",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005832_20250205005864:0/",
            "pub_date": "2025-02-05 21:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005832_20250205005877:0",
            "title": "Ford Motor: Ford China President, CEO Sam Wu Adds Responsibility for International Markets Group >F",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005832_20250205005877:0/",
            "pub_date": "2025-02-05 21:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205005870:0",
            "title": "Charles River Labs Is Maintained at Equal-Weight by Morgan Stanley",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205005870:0/",
            "pub_date": "2025-02-05 21:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}