{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309550:0",
            "title": "Equinor Q4 Adjusted Earnings Rise, Revenue Falls; Plans Up to $5 Billion Share Buybacks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Equinor  reported Q4 adjusted earnings Wednesday of $0.63 per share, up from $0.62 a year earlier. </p><p class=\"\">Analysts polled by FactSet expected $0.74. </p><p class=\"\">Revenue and other income for the quarter was $27.65 billion, down from $29.05 billion a year earlier. Comparable analyst estimates weren't immediately available. </p><p class=\"\">The company said it is cutting investment outlook to renewables and low carbon solutions to around $5 billion in total after project financing for 2025-2027. It is also reducing expected capacity in renewables to 10 to 12 gigawatt by 2030. </p><p class=\"\">Equinor also announced share repurchases of up to $5 billion for 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309550:0/",
            "pub_date": "2025-02-05 18:01:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463896:0",
            "title": "China Extends Service-Sector Expansion in January: PMI Report",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's services economy started 2025 in growth territory, driven by new business, reported S&amp;P Global on Wednesday. </p><p class=\"\">The seasonally adjusted Caixin/S&amp;P Global China services purchasing managers index (PMI) posted at 51.0 in January, down from 52.2 in December 2024, but still above the 50-marker that separates growth from expansion, reported S&amp;P Global, citing its monthly survey. </p><p class=\"\">The positive performance in January \"extended the period of expansion that commenced in January 2023,\" added S&amp;P Global. </p><p class=\"\">\"Higher new business, underpinned by improvements in underlying demand and successful business development efforts, supported the rise in services activity at the start of 2025,\" said S&amp;P Global. \"This included foreign demand, with new export business returning to growth after falling at the end of 2024.\"</p><p class=\"\">China's service providers, however, cut payrolls in January, finding remaining workers were adequate to demand. \"The lack of capacity pressure therefore led to further job shedding in the service sector at the start of the year. Both resignations and redundancies contributed to the fastest decline in services employment in China since April last year,\" explained S&amp;P Global. </p><p class=\"\">China's service providers were optimistic regarding the year ahead. Sentiment \"in the Chinese service sector was positive at the start of 2025. Firms expressed hopes that business growth plans and supportive government policies can support sales in the next 12 months,\" said S&amp;P Global. </p><p class=\"\">The China PMI was compiled by S&amp;P Global from surveys sent to 650 private and state-owned services companies from January 9 through January 23. </p><p class=\"\">In addition, China's January composite PMI, a combination of the nation's manufacturing and services sectors, logged at 51.1 in January, down from 51.4 in December, but still above neutral. </p><p class=\"\">The China January composite PMI \"extended the period of continuous expansion to 15 months,\" said S&amp;P Global. </p><p class=\"\">China's enterprise managers were optimistic in January, but cautious on pricing. \"A broad-based improvement in business optimism was observed at the start of the year. That said, firms were unwilling to raise prices despite an increase in average input prices. Selling prices fell at the quickest pace in four months at the start of 2025,\" advised S&amp;P Global.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463896:0/",
            "pub_date": "2025-02-05 18:02:58",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002617_20250205003006:0",
            "title": "Santander Chair: Interest Rates Don't Matter as Much as People Think",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002617_20250205003006:0/",
            "pub_date": "2025-02-05 18:03:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0DV:0",
            "title": "South Korea's industry ministry temporarily bans access to DeepSeek on security concerns, official says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    South Korea's industry ministry has temporarily banned employee access to Chinese artificial intelligence startup DeepSeek due to security concerns, a ministry official said on Wednesday, as the government urges caution on generative AI services. </p><p class=\"\">    The government issued a notice on Tuesday calling for ministries and agencies to exercise caution about using AI services including DeepSeek and ChatGPT at work, officials said.  </p><p class=\"\">        State-run Korea Hydro &amp; Nuclear Power said it had blocked use of AI services including DeepSeek earlier this month. </p><p class=\"\">Tech giant Kakao Corp has told its employees to refrain from using DeepSeek due to security concerns, a company spokesperson said on Wednesday.</p><p class=\"\">The temporary ban makes South Korea the latest government to warn about DeepSeek. </p><p class=\"\">Last month, Australian Treasurer Jim Chalmers called on Australians to be cautious when using the Chinese AI model while U.S. officials are also looking at DeepSeek's national security implications.</p><p class=\"\">South Korea's information privacy watchdog plans to ask DeepSeek about how the personal information of users is managed.</p><p class=\"\">Chinese startup DeepSeek's launch of its latest AI models sent shockwaves through the tech world. The company says its models are on a par or better than products developed in the United States at a fraction of the cost.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0DV:0-south-korea-s-industry-ministry-temporarily-bans-access-to-deepseek-on-security-concerns-official-says/",
            "pub_date": "2025-02-05 18:03:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX64hymG:0",
            "title": "Nextrope Secures Funding to Build an AI Model for Web3 Security",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX64hymG-0b1c92446f68f9966c13c15e524beba0-resized.webp\" type=\"images/webp\"/><img alt=\"photo_2025-02-05 15.06.08\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_GNX64hymG-0b1c92446f68f9966c13c15e524beba0-resized.jpeg\" style=\"background-color:#343b2a\"/></picture></div></figure></span></p><p class=\"\">WARSAW, Poland, Feb.  05, 2025  (GLOBE NEWSWIRE) — Blockchain security is evolving, and Nextrope is leading the way with an AI-driven platform designed to audit and enhance smart contract security. With a <strong class=\"root-Tkn6WL2y\">project value of $1 million</strong>, this initiative is set to raise the standards of Web3 security. The development is <!-- -->co-financed by the Polish Agency for Enterprise Development (PARP) under the <strong class=\"root-Tkn6WL2y\">European Funds for a Modern Economy</strong> program.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AI-Powered Protection for Smart Contracts</strong></p><p class=\"\">As DeFi, DAOs, and Web3 applications continue to grow, smart contracts remain vulnerable to security flaws that have already led to billions in losses. Nextrope is tackling this challenge with an <!-- -->AI-driven model that identifies risks, optimizes gas fees, and enhances contract efficiency with unparalleled accuracy. Traditional audits rely on static analysis and manual reviews, while this platform integrates <!-- -->advanced machine learning, behavioral profiling, and methodologies inspired by physics and computational sciences to detect vulnerabilities before they become exploits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Academic-Backed Innovation</strong></p><p class=\"\">What sets this project apart is its <strong class=\"root-Tkn6WL2y\">scientific approach</strong>—bringing in <!-- -->researchers and experts in physics and computational modeling to refine AI-driven security techniques. By combining theoretical knowledge with real-world blockchain applications, the platform pushes the boundaries of what automated audits can achieve, making <!-- -->smart contract security more adaptive and proactive.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Redefining Security Standards for Web3</strong></p><p class=\"\">Most security tools struggle to detect complex contract vulnerabilities. Nextrope’s AI model not only <strong class=\"root-Tkn6WL2y\">analyzes threats in real-time</strong> but also <strong class=\"root-Tkn6WL2y\">adapts to emerging attack patterns</strong>, ensuring long-term resilience for blockchain applications. This makes it one of the most <!-- -->advanced security solutions for Ethereum, Polygon, and Solana-based contracts.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p><p class=\"\">This initiative, <!-- -->co-financed under the European Funds for a Modern Economy, underscores Nextrope’s commitment to advancing <strong class=\"root-Tkn6WL2y\">AI-driven blockchain security</strong>. By 2026, the company aims to <!-- -->establish a new benchmark for smart contract auditing, ensuring that <!-- -->Web3 projects can be built with confidence and security.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Nextrope</strong></p><p class=\"\">Nextrope is a <strong class=\"root-Tkn6WL2y\">blockchain development company</strong> specializing in <!-- -->DeFi, smart contract security, and AI-driven fintech solutions. With a strong track record in <strong class=\"root-Tkn6WL2y\">Web3 innovation</strong>, the company is focused on <strong class=\"root-Tkn6WL2y\">pioneering AI-powered blockchain security</strong>. Learn more at Nextrope.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact:</strong></p><p class=\"\">Next Enterprises</p><p class=\"\">contact@nextrope.com</p><p class=\"\">Disclaimer: This content is provided by Nextrope. The statements, views and opinions expressed in this column are solely those of the content provider. The information provided in this press release is not a solicitation for investment, nor is it intended as investment advice, financial advice, or trading advice. It is strongly recommended you practice due diligence, including consultation with a professional financial advisor, before investing in or trading cryptocurrency and securities. Please conduct your own research and invest at your own risk.</p><p class=\"\">Photos accompanying this announcement are available at</p><p class=\"\">https://www.globenewswire.com/NewsRoom/AttachmentNg/ef57bb12-ecbb-48f1-a401-37d295ffcf7f</p><p class=\"\"> https://www.globenewswire.com/NewsRoom/AttachmentNg/f80d2d1c-57c1-4fbc-b90b-f9373a740c69</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nextrope</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Nextrope</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Backed by European Innovation Funding</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX64hymG:0-nextrope-secures-funding-to-build-an-ai-model-for-web3-security/",
            "pub_date": "2025-02-05 18:03:26",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUC56W6JS:0",
            "title": "Unilever Appoints Zoe Yujnovich As Independent Non-Exec Director",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Unilever PLC :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">UNILEVER PLC  - DIRECTORATE CHANGE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">UNILEVER PLC - APPOINTS ZOE YUJNOVICH AS INDEPENDENT NON-EXECUTIVE DIRECTOR</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUC56W6JS:0-unilever-appoints-zoe-yujnovich-as-independent-non-exec-director/",
            "pub_date": "2025-02-05 18:03:55",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309551:0",
            "title": "Crude Oil Prices Fall on Higher-Than-Expected U.S. Inventories, Trade War Concerns",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crude oil prices fell early Wednesday after the U.S. recorded another increase in crude inventories, exacerbating concerns about a new trade war between the China and the U.S. </p><p class=\"\">Brent crude lost 0.9% to US$75.55/barrel and West Texas Intermediate crude fell 0.8% to US$72.09/b at last look. WTI at one point fell to its lowest level since Dec. 31 after China announced retaliatory tariffs on U.S. imports of oil, liquefied natural gas and coal, Reuters said in a Wednesday report. </p><p class=\"\">Higher-than-expected U.S. crude stock increases weighted down the market with a jump of 5.03 million barrels in the week ended Jan. 31, market sources told Reuters, citing the American Petroleum Institute. Gasoline inventories also gained 5.43 million barrels, the sources said. </p><p class=\"\">Rising inventories signal consumption weakness, which add to market concerns about the impact of tariffs on economic and energy demand outlooks, Reuters said in the report. </p><p class=\"\">Losses were somewhat capped by Trump restoring the \"maximum pressure\" campaign on Iran to curb its nuclear program, the report said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309551:0/",
            "pub_date": "2025-02-05 18:04:11",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0ER:0",
            "title": "COMMENT-US jobs report sneaks onto dollar radar",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    With the eyes of the foreign exchange world focused on tariff news from the White House, the monthly U.S. employment report is receiving less attention than it normally would.</p><p class=\"\">That may change when the report is released on Friday at 1330 GMT, especially if January's non-farm payrolls number comes in much better or worse than expected. </p><p class=\"\">The Reuters poll consensus forecast for January's NFP number is 170,000, to follow December's 256,000 - which was much higher than predicted.</p><p class=\"\">Another NFP beat would be a boost for hawks, including Nomura, who expect the Fed to keep rates on hold through year-end - a prediction which could lift the dollar if it becomes the consensus view.</p><p class=\"\">Whereas an NFP miss could get doves cooing for a Fed rate cut before June, to the detriment of the greenback. </p><p class=\"\">On Tuesday, the USD was negatively impacted by the news that U.S. job openings fell by the most in 14 months in December, by 556,000 to 7.6 million.</p><p class=\"\">Related comment:    </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1007.8602620087337px;aspect-ratio:1.6797671033478894\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0ER-e7dbea61031a21900ef7b7ac752871ac-resized.webp\" type=\"images/webp\"/><img alt=\"=usd\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0ER-e7dbea61031a21900ef7b7ac752871ac-resized.jpeg\" style=\"background-color:#302f2d\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">USD</span></figcaption></figure></span></p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0ER:0-comment-us-jobs-report-sneaks-onto-dollar-radar/",
            "pub_date": "2025-02-05 18:04:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW10O:0",
            "title": "Ares promotes Kipp deVeer and Blair Jacobson to co-presidents - FT",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">-- Source link: https://tinyurl.com/22ce98no</p><p class=\"\">-- Note: Reuters has not verified this story and does not vouch for its accuracy</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW10O:0-ares-promotes-kipp-deveer-and-blair-jacobson-to-co-presidents-ft/",
            "pub_date": "2025-02-05 18:05:04",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446723:0",
            "title": "Eurozone Producer Prices Rise for 3rd Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Producer prices in the Eurozone increased 0.4% month-over-month in December 2024, following a 1.7% jump in November, in line with market expectations.</p><p class=\"\">It was the third consecutive monthly rise in producer prices due to energy costs (1.4% vs 5.6%), intermediate goods (0.1% vs -0.1%), capital goods (0.1% vs flat reading in November), durable consumer goods (0.2% vs -0.2%) and non-durable consumer goods (0.1%, the same as in November).</p><p class=\"\">Among the bloc's largest economies, producer prices rose 1% in France, 0.9% in Spain, and 0.8% in Italy but fell 0.1% in Germany.</p><p class=\"\">Year-on-year, producer prices in the Euro Area were unchanged, after a 1.2% drop.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446723:0-eurozone-producer-prices-rise-for-3rd-month/",
            "pub_date": "2025-02-05 18:05:22",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463936:0",
            "title": "Vodafone Group Launches Cash Tender Offer for Outstanding Multi-currency Notes",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Vodafone Group  launched a cash tender offer for all of its certain outstanding multi-currency notes, according to a Wednesday release. </p><p class=\"\">The British telecommunications group will determine the purchase price of the notes based on the note series. The offer will close the offer on Feb. 13, with settlement expected on Feb. 18. </p><p class=\"\">The offer includes 1 billion euros each of 1.875% notes due Sept. 11, 2025, and 1.125% notes due Nov. 20, 2025; 1.75 billion euros of 2.200% notes due Aug. 25, 2026; 750 million euros of 0.900% notes due Nov. 24, 2026; and 500 million euros of 1.500% notes due July 24, 2027. </p><p class=\"\">It also covers the 250 million pounds sterling of notes due Dec. 4, 2025; 850 million Norwegian kroner each of 3.215% notes due Nov. 27, 2025, and 3.115% notes due March 1, 2027; 500 million kroner of 2.925% notes due July 6, 2027; HK$455 million of 2.850% notes due June 28, 2027; HK$1.12 billion of 2.640% notes due Sept. 13, 2027; 175 million francs of 0.625% notes due March 15, 2027; and AU$450 million 4.200% notes due Dec. 13, 2027.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463936:0/",
            "pub_date": "2025-02-05 18:05:32",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002985:0",
            "title": "Singapore Most Actives",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                                     Volume        Close       Change     % Change <br/> <br/>  Rex International Holding      66,620,600         0.15        +0.01        +7.09 <br/>  Oceanus Group                  41,198,300         0.01         unch         unch <br/>  Genting Singapore              20,114,300         0.74        -0.02        -1.99 <br/>  ISOTeam                        18,900,400         0.06        +0.00        +6.90 <br/>  Singapore Telecom              16,625,895         3.21        -0.02        -0.62 <br/>  Yangzijiang Shipbuilding       15,848,000         3.07        +0.06        +1.99 <br/>  Seatrium                       15,000,100         2.15         unch         unch <br/>  Zhongxin Fruit &amp; Juice         12,417,000         0.04        +0.00       +10.26 <br/>  Wilton Resources               12,239,600         0.01         unch         unch <br/>  RH Petrogas                    11,662,600         0.16        +0.01        +4.46 <br/>  Marco Polo Marine              10,457,400         0.06         unch         unch <br/>  GSS Energy                      9,654,200         0.01         unch         unch <br/>  Thai Beverage                   9,511,700         0.53        -0.01        -0.93 <br/>  Mermaid Maritime                9,193,700         0.13        +0.01        +5.56 <br/>  Koh Bros Eco Engineering        8,146,900         0.04        +0.00        +7.69 <br/>  Wilmar International            8,118,700         3.25        +0.07        +2.20 <br/>  H2G Green                       7,916,000         0.01         unch         unch <br/>  Tuan Sing Holdings              6,824,800         0.32        +0.01        +3.28 <br/>  CapitaLand Investment           6,788,200         2.45        -0.01        -0.41 <br/>  Geo Energy Resources            6,625,900         0.27        -0.01        -1.82 <br/>  SATS Ltd                        6,607,200         3.25        -0.04        -1.22 <br/>  Advanced Sys Automation         6,000,800         0.01         0.00        -8.33 <br/>  Yangzijiang Finl Hldg           5,788,700         0.47        +0.00        +1.08 <br/>  Spackman Entertainment          5,000,000         0.00         0.00       -50.00 <br/>  Yoma Strategic Holdings         4,741,900         0.07         unch         unch <br/>  Thomson Medical Group           4,502,000         0.05         unch         unch <br/>  Wee Hur Holdings                4,123,700         0.49        +0.01        +1.03 <br/>  HS Optimus Holdings             4,000,000         0.00         unch         unch <br/>  King Wan                        3,770,200         0.03        +0.00        +3.03 <br/>  Raffles Medical Group           3,712,600         0.84        +0.01        +0.60 <br/>  ComfortDelGro                   3,615,900         1.40        +0.01        +0.72 <br/>  Singapore Airlines              3,534,800         6.34        -0.03        -0.47 <br/>  Oversea-Chinese Banking         3,397,700        17.17        -0.09        -0.52 <br/>  Keppel                          3,379,000         6.68        +0.05        +0.75 <br/>  AEM Holdings                    3,173,500         1.45         unch         unch <br/>  V2Y                             3,055,000         0.01         unch         unch <br/>  DBS Group Holdings              3,023,400        44.32        -0.10        -0.23 <br/>  Yanlord Land Group              2,979,600         0.58        +0.01        +1.77 <br/>  Golden Agri-Resources           2,878,600         0.25         unch         unch <br/>  Hongkong Land Holdings          2,852,600         4.32        +0.01        +0.23 <br/>  Meta Health                     2,750,000         0.01        +0.00       +16.67 <br/>  OKH Global                      2,580,000         0.03         unch         unch <br/>  AJJ Medtech Holdings            2,000,000         0.00         unch         unch <br/>  CNMC Goldmine Holdings          1,961,300         0.31        +0.01        +1.64 <br/>  Singapore Post                  1,913,100         0.56         unch         unch <br/>  Totm Technologies               1,888,100         0.03         unch         unch <br/>  CSE Global                      1,805,600         0.45         unch         unch <br/>  Riverstone Holdings             1,778,300         1.05        +0.03        +2.94 <br/>  SembCorp Industries             1,775,300         5.39        -0.01        -0.19 <br/>  GKE Corp                        1,681,900         0.09         0.00        -2.15 <br/>Prices in S$ <br/>Source: FactSet <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002985:0/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV189:0",
            "title": "PREVIEW: Disney seen reporting increase in rev in results before the bell",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of Walt Disney  were down 0.6% in afternoon trading, with the co expected to report an increase in rev in its qtrly results to be released before the opening bell Wed</p><p class=\"\">** Analysts expect qtrly rev to rise to $24.62 bln vs $23.55 bln a yr ago and earnings of $1.45/shr vs $1.22 a yr ago, according to LSEG</p><p class=\"\">** Jefferies analysts earlier this week wrote they see risks to the co's fiscal year 2025 guidance \"due to the launch of Epic Universe\"</p><p class=\"\">** In November, DIS offered robust multi-year guidance</p><p class=\"\">** Of the 34 analysts who cover DIS, 24 recommend a \"strong buy\" or \"buy,\" nine recommend a \"hold\" and one recommends a \"sell\"</p><p class=\"\">** The median 12-mth PT is $125.55; the stock was last at $113.29</p><p class=\"\">** Last week, Nielsen's latest report showed that Walt Disney maintained its lead in U.S. TV viewing share in December, bolstered by holiday movie marathons and strong performances across its cable networks</p><p class=\"\">** Including the session move, DIS shares are up 1.7% YTD while the Dow Jones industrial average  is up 4.8%</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV189:0-preview-disney-seen-reporting-increase-in-rev-in-results-before-the-bell/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002970:0",
            "title": "News Highlights: Top Global Markets News of the Day - Wednesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Morgan Stanley's finally given up on the idea the Fed will cut in March. What went wrong.</strong></p><p class=\"\">Morgan Stanley has now given up on its contrarian stance the Federal Reserve will cut interest rates in March.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">The Rich Are Moving Assets Abroad. What's Prompting the Shift.</strong></p><p class=\"\">Some wealthy Americans are motivated by the changing political landscape under President Donald Trump, or they want to protect their assets if the U.S. economy weakens.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China's Lunar New Year Travel, Spending Boom Offer Positive Signs</strong></p><p class=\"\">Tourism revenues in China during the eight-day holiday that ended Tuesday rose 7.0% in year-over-year terms, while the number of domestic trips rose 5.9%, state media reported.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">China PMI Gauge Signals Softer Services Sector Growth</strong></p><p class=\"\">Despite the slowdown, the measure remained above the 50 mark that separates activity contraction from expansion, and where it has been since January 2023.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">French Industry Ends 2024 in the Doldrums</strong></p><p class=\"\">Total manufacturing output was 0.7% lower on month in December, an unexpected drop that has contributed to a backsliding in the eurozone's second-largest economy.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy Is More Exposed Than Ever to a Trade War</strong></p><p class=\"\">U.S. energy is a much bigger industry than it was in President Donald Trump's first term.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Gold Demand Rose to Fresh High in 2024, Report Says</strong></p><p class=\"\">The record demand was driven by central banks and investors as geopolitical and economic uncertainty continued apace.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Postal Service Halts Shipments of China Parcels</strong></p><p class=\"\">The U.S. moves to halt the international parcel service popular with Chinese merchants.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">What Do Trump's First Weeks Tell Us About His China Strategy?</strong></p><p class=\"\">The executive orders and actions taking aim at Beijing suggest a focus less framed around ideology than under the Biden administration.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fed Vice Chair Jefferson Urges Patience on Rate Cuts</strong></p><p class=\"\">Federal Reserve Vice Chair Philip Jefferson said that a solid economy and labor market, paired with elevated inflation, means there's no rush to cut.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002970:0/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002969:0",
            "title": "News Highlights: Top Company News of the Day - Wednesday at 5 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Nissan to Reject Honda Deal to Create World's No. 3 Automaker</strong></p><p class=\"\">Shares in Nissan fell while Honda stock closed higher, reflecting investor views that Nissan was more likely to benefit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tesla Stock Is Falling. California Might Be Turning Against Elon Musk.</strong></p><p class=\"\">Investors are looking for evidence Musk's politics are hurting Tesla. It's hard to find, but California might be turning against Musk-slowly.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Google's Revenue Growth Slows, Sending Shares Down</strong></p><p class=\"\">The tech giant's fast-growing cloud-computing business decelerated last quarter. Shares were off more than 7% after hours.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">AMD's AI Revenue Jumps, But Misses Estimates</strong></p><p class=\"\">The Santa Clara, Calif., chip maker posted a profit of $482 million compared with $667 million, a year earlier. For the current quarter, AMD guided for revenue between $6.8 billion and $7.4 billion.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novo Nordisk Expects Slowing Sales Growth This Year</strong></p><p class=\"\">The Danish pharmaceutical company expects sales growth to slow this year as capacity constraints, intensifying competition and pricing pressure drag on sales of its blockbuster weight-loss and diabetes drugs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Toyota Boosts Earnings Guidance, to Set Up China EV Unit</strong></p><p class=\"\">Toyota Motor sold 10.8 million vehicles globally in 2024, retaining its position as the world's biggest carmaker.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Watch Arm's Earnings for Clues on What DeepSeek Means for AI</strong></p><p class=\"\">The company makes money by licensing its chip designs to semiconductor companies and smartphone makers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mondelez International Expects 2025 Earnings to Drop Amid Soaring Cocoa Costs</strong></p><p class=\"\">The company is specifically focused on its chocolate business as it navigates cocoa cost inflation, Chief Executive Dirk Van de Put said. The company previously said it expects to raise prices.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Disney Earnings Are Up Next. Watch for This Number.</strong></p><p class=\"\">Theme parks have been a concern for analysts, amid signs that U.S. consumer spending is on the wane.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Santander Plans $10.4 Billion in Buybacks After Results Beat Expectations</strong></p><p class=\"\">Spain's biggest bank by assets was also confident it would be able to boost profitability again in 2025, raising a target despite projecting broadly stable revenue for the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002969:0/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW0UK:0",
            "title": "Hapag-Lloyd says it can cope with U.S.-China tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Container shipping liner Hapag-Lloyd  will be able to cope with the advent of U.S. tariffs on Chinese products, its chief executive told reporters on Tuesday.</p><p class=\"\">\"It is too early to push the panic button,\" CEO Rolf Habben Jansen said in the remarks published on Wednesday, when additional 10% tariffs kicked in, and made before U.S. President Donald Trump proposed for his country to take over the Gaza Strip.</p><p class=\"\">\"Fortunately we are able to react when transport flows change,\" he said, adding foreseeable events were easier to handle than the unexpected ones, such as the Red Sea crisis when the Iran-backed Houthi militants launched attacks on vessels passing the Suez Canal in November 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW0UK:0-hapag-lloyd-says-it-can-cope-with-u-s-china-tariffs/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX5CjXN5:0",
            "title": "GPTBots.ai Integrates DeepSeek’s Janus-Pro, Elevating AI Image Generation for Enterprise Applications",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">HONG KONG, Feb.  05, 2025  (GLOBE NEWSWIRE) — GPTBots.ai, a leading enterprise AI agent platform, has announced the integration of <strong class=\"root-Tkn6WL2y\">DeepSeek’s Janus-Pro</strong> into its ecosystem as an <strong class=\"root-Tkn6WL2y\">Open Tool</strong>, further expanding its comprehensive suite of AI capabilities. This integration follows the recent addition of DeepSeek’s R1 large language model (LLM), reinforcing GPTBots.ai’s position as a leader in delivering cutting-edge AI solutions tailored for enterprises.</p><p class=\"\">Janus-Pro, part of DeepSeek’s groundbreaking image model family, has set a new benchmark in AI image generation. Known for its <!-- -->hyper-realistic outputs, contextual understanding, and seamless style adaptation, Janus-Pro excels in creating visually stunning and contextually accurate images. It also offers advanced capabilities like <!-- -->multi-modal input processing, enhanced image consistency, and rapid rendering, making it ideal for industries such as marketing, e-commerce, and design. By integrating Janus-Pro as an Open Tool, GPTBots empowers businesses to unlock new creative possibilities while streamlining visual content creation.</p><p class=\"\">An Extensive Toolkit Empowering Enterprise AI Agents</p><p class=\"\">GPTBots offers <strong class=\"root-Tkn6WL2y\">a comprehensive suite of tools</strong> designed to enable enterprises to build intelligent AI agents that automate workflows, enhance customer interactions, and optimize operations. These tools are categorized into <strong class=\"root-Tkn6WL2y\">My Tools</strong> (custom-built tools tailored to specific business needs) and <strong class=\"root-Tkn6WL2y\">Open Tools</strong> (pre-configured tools accessible to all users).</p><p class=\"\">With the addition of Janus-Pro as an Open Tool, GPTBots’ ecosystem now includes a wide range of tools, such as:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">LinkedIn Tools</strong>: LinkedIn Find Company and LinkedIn Find Person for professional networking and lead generation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">HubSpot Tools</strong>: HubSpot Contacts, HubSpot Company, HubSpot Deals, and HubSpot Tickets for seamless CRM and sales management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">DALL-E 3 and CogView</strong>: Advanced image generation tools for creative and business applications.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Google Search Pro</strong>: Enhanced search capabilities for retrieving accurate and actionable information.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Google Video</strong>: For creating and managing engaging video content.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">WhatsApp API Message</strong>: For efficient customer communication and engagement.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">EngageLab Email Sender</strong>: Automating email campaigns for marketing and customer outreach.</li></ul><p class=\"\">These tools represent just a fraction of the <strong class=\"root-Tkn6WL2y\">extensive library of Open Tools</strong> available on GPTBots, ensuring businesses have access to the most relevant and impactful solutions for their unique needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Why Janus-Pro is a Game-Changer</strong></p><p class=\"\">The integration of Janus-Pro into GPTBots.ai brings unparalleled value to enterprises by enabling:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Enhanced Marketing Campaigns</strong>: Generate visually compelling advertisements and promotional materials with ease.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Streamlined Product Design</strong>: Create prototypes and design concepts faster and more efficiently.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Improved Customer Engagement</strong>: Deliver personalized and visually appealing content to captivate target audiences.</li></ul><p class=\"\">“Integrating Janus-Pro into our platform aligns perfectly with our mission to provide enterprises with the most advanced and versatile AI tools,” said Jerry Yin, VP of GPTBots.ai. “This addition not only enhances our image generation capabilities but also empowers businesses to innovate, adapt, and thrive in an increasingly competitive landscape.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Empowering Enterprises with </strong><strong class=\"root-Tkn6WL2y\">GPTBots.ai</strong></p><p class=\"\">GPTBots is designed to simplify AI adoption for businesses, offering a no-code/low-code platform that enables users to deploy AI agents quickly and effectively. With features like <!-- -->enterprise-grade SLA guarantees, role-based access control, and seamless integration with popular business systems, GPTBots ensures businesses can focus on achieving their goals without worrying about technical complexities.</p><p class=\"\">By combining tools like Janus-Pro, LinkedIn, HubSpot, and Google Video, GPTBots provides enterprises with a unified platform to automate workflows, enhance customer experiences, and drive growth. Whether it’s creating high-quality visual content, managing customer relationships, or optimizing marketing strategies, GPTBots empowers businesses to achieve more with less effort.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About </strong><strong class=\"root-Tkn6WL2y\">GPTBots.ai</strong></p><p class=\"\">GPTBots.ai is an enterprise AI agent platform that empowers businesses to streamline operations, enhance customer experiences, and drive growth. Offering end-to-end AI solutions across customer service, knowledge search, data analysis, and lead generation, GPTBots enables enterprises to harness the full potential of AI with ease. With seamless integration into various systems, and support for scalable, secure deployments, GPTBots is dedicated to reducing costs, accelerating growth, and helping businesses thrive in the AI era.</p><p class=\"\">For more information, visit www.gptbots.ai.</p><p class=\"\">Media Contact:</p><p class=\"\">Silvia</p><p class=\"\">Senior Marketing Manager</p><p class=\"\">marketing@gptbots.ai</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX5CjXN5:0-gptbots-ai-integrates-deepseek-s-janus-pro-elevating-ai-image-generation-for-enterprise-applications/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002958:0",
            "title": "Elizabeth Warren Urges Trump to Act on Big Banks Unfairly Closing Customer Accounts — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Alexander Saeedy</p><p class=\"\">Elizabeth Warren agrees with President Trump about something.</p><p class=\"\">The Democratic senator from Massachusetts told Trump on Tuesday that she thinks the White House should take action to stop what she said were discriminatory practices by the country's biggest banks, according to a letter from her office that was viewed by The Wall Street Journal.</p><p class=\"\">Trump brought the subject to the fore last month when he suggested at the World Economic Forum in Davos, Switzerland, that Bank of America and JPMorgan Chase were unfairly closing conservatives' bank accounts.</p><p class=\"\">Those comments set off a political firestorm and the Senate Banking Committee convened a hearing on the matter for Wednesday.</p><p class=\"\">Warren said that her office has identified thousands of examples of consumers losing access to their bank accounts and that she wants the president to take action to stop the practice.</p><p class=\"\">\"There are times when a bank has a legitimate reason, and a legal obligation, to freeze or close a bank account,\" Warren wrote in her letter to the White House, ahead of the Senate Banking Committee hearing. \"But banks may be implementing these legal obligations in a sloppy and overbroad manner.\"</p><p class=\"\">Banks say they don't discriminate against customers on the basis of their backgrounds or beliefs. They are required by law to report suspicious activity to regulators, and they face the risk of fines and litigation if they don't close accounts with ties to criminal activity. But unexplained account closures have led conservative groups and crypto firms to allege that many Americans are being unfairly targeted.</p><p class=\"\">\"Banks are required to manage risk and satisfy their regulators, which can also restrict banks from sharing why an account has been closed,\" said Austin Anton, a spokesman for the Bank Policy Institute, an industry group for American banks. \"An important part of the solution is fixing the regulatory structure.\"</p><p class=\"\">Warren's alignment with Trump shows a growing coalition across party lines that wants to try to stop unfair account closures.</p><p class=\"\">Conservative criticism of banks has been building since banks embraced diversity policies after the murder of George Floyd in 2020. A Republican-led committee in Congress alleged that banks profiled conservative and religious Americans as potential domestic terrorists when they turned over information about thousands of customers after the Jan. 6, 2021, riot at the U.S. Capitol.</p><p class=\"\">Progressives have their own gripes with the banking industry. Warren in her letter said the banks have been unfairly shutting down accounts linked to formerly incarcerated individuals or on the basis of their customers' religion.</p><p class=\"\">Warren identified more than 8,000 regulatory complaints from consumers who alleged their bank accounts were improperly closed over the past three years. She said most of the closures were by the four biggest U.S. banks: JPMorgan Chase, Bank of America, Citigroup and Wells Fargo.</p><p class=\"\">She said the best way for the president to take action was to support the Consumer Financial Protection Bureau, a federal agency she helped design in the wake of the 2008 financial crisis. Earlier this week, Treasury Secretary Scott Bessent took over as the agency's acting director and halted its enforcement and rule-making actions.</p><p class=\"\">Warren also said the White House could join with the Federal Reserve, the Federal Deposit Insurance Corp., and other regulators to adjust anti-money-laundering rules that could be causing improper account closures.</p><p class=\"\">Write to Alexander Saeedy at alexander.saeedy@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002958:0/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE58TDnQ:0",
            "title": "Castore partners with GXO to support its logistics operations globally",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Teamwear, merchandise and high-quality mainline sportswear will be distributed through GXO’s expert logistics services</p><p class=\"\">GXO will distribute teamwear to Oracle Red Bull Racing, McLaren F1, Everton FC, <!-- -->Glasgow Rangers, England Cricket and many more high-profile sports teams and individual athletes</p><p class=\"\">LONDON, U.K. and EINDHOVEN, The Netherlands, Feb.  05, 2025  (GLOBE NEWSWIRE) — GXO Logistics, Inc. , the world’s largest pure-play contract logistics provider, announced today that it has expanded its partnership with Castore, the performance sportswear brand, to operate warehousing and transportation in the UK, US and Europe.</p><p class=\"\">GXO has been providing logistics services to Castore’s business in the UK since April 2024, distributing teamwear to a variety of sporting teams and individuals, including Oracle Red Bull Racing, McLaren F1, Everton FC, the England Cricket teams, as well as Olympic silver medallist Adam Peaty.</p><p class=\"\">Following the successful launch of the UK operation, Castore is expanding its partnership with GXO which will use its global scale to provide logistics operations in the Netherlands with plans to expand to the U.S.</p><p class=\"\">Alongside teamwear, GXO distributes product to wholesale customers that sell team merchandise and high-quality sportswear, whilst also providing retail distribution to more than 20 Castore stores across Europe. Additionally, GXO is responsible for fulfilling and managing the transport of all e-commerce sales globally.</p><p class=\"\">“It is fantastic to partner with a like-minded and fast-growing brand,” said Richard Cawston, Chief Revenue Officer, GXO. “We’re proud that Castore recognised our expertise in fashion and sportswear, trusting their logistics to us. We will bring our capabilities in warehousing and transport services to support Castore’s continuing growth. Our flexible systems have already helped improve efficiencies and, with our transport capabilities, we can deliver seamless and streamlined fulfilment. It’s brilliant that our success in the UK has given us the opportunity to grow our partnership so Castore can access our global network as they grow in Europe and the U.S.”</p><p class=\"\">Adrian Harris, Chief Supply Chain Officer of Castore: “As Castore continues its fast-paced growth, we want to ensure we work with partners to support and strengthen our ambitions to be one of the world’s highest performance sportswear brands. We’re confident that GXO is the right logistics partner to manage our existing operations in the UK, and across our global network, with an experienced team and world-class systems to meet our needs.”</p><p class=\"\">In the UK, GXO and Castore worked seamlessly to deliver a rapid implementation, rolling out a new dedicated warehouse management system within eight weeks of contract signing. </p><p class=\"\">GXO will provide both warehousing and managed transport solutions to Castore, integrating both elements of the supply chain to ensure a continuous operation from start to finish. An integrated operations model allows businesses to unlock greater economies of scale and reduces the risk of disruption as products flow seamlessly from the warehouse to transport. </p><p class=\"\">GXO offers an integrated solution of services to Castore, including returns, courier management, personalisation and building relationships with Castore’s brand partners to ensure the seamless distribution of product.</p><p class=\"\">With GXO’s courier management team now responsible for parcel delivery administration in the UK&amp;I, Castore is able to remain laser-focused on creating the highest quality sportswear products for teams and customers.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GXO Logistics</strong></p><p class=\"\">GXO Logistics, Inc.  is the world’s largest pure-play contract logistics provider and is capitalizing on the rapid growth of ecommerce and automation. GXO is committed to providing a world-class, diverse workplace for more than 130,000 team members in more than 970 facilities totaling approximately 200 million square feet. The company partners with the world’s leading blue-chip companies to solve complex logistics challenges with technologically advanced supply chain and ecommerce solutions. GXO is headquartered in Greenwich, Connecticut, USA. Visit GXO.com for more information and connect with GXO on LinkedIn, X, Facebook, Instagram and YouTube.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Castore</strong></p><p class=\"\">Castore is a performance sportswear brand and end-to-end digital retailing platform for global sports teams. Castore’s Team Sports platform manages the full omni-channel retailing (online, offline, event-based) operations for selected partners and has a proven approach for growing revenues through product quality, supply chain innovation and fan engagement. ​​Team Sports partners include McLaren F1; Oracle Red Bull Racing; England Cricket Board, Everton FC, Glasgow Rangers, Bayer Leverkusen, Feyenoord, Sevilla FC, Athletic Club (Bilbao), Saracens Rugby and Republic of Ireland Football. Castore’s Mainline brand crafts high-quality sportswear using advanced materials and precision engineering designed to improve athlete performance. </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media contacts</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">GXO</strong></p><p class=\"\">Jack Woodhead</p><p class=\"\">+44 (0)7929104482</p><p class=\"\">jack.woodhead@gxo.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Castore</strong></p><p class=\"\">castore@teneo.com<strong class=\"root-Tkn6WL2y\"> </strong></p><p class=\"\"> <strong class=\"root-Tkn6WL2y\">Attachment</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Castore partners with GXO to support its logistics operations globally      </li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE58TDnQ:0-castore-partners-with-gxo-to-support-its-logistics-operations-globally/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX7hNYfq:0",
            "title": "Aurora Mobile’s GPTBots.ai Integrates DeepSeek’s Janus-Pro",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SHENZHEN, China, Feb.  05, 2025  (GLOBE NEWSWIRE) — Aurora Mobile Limited  (“Aurora Mobile” or the “Company”), a leading provider of customer engagement and marketing technology services in China, today announced that its leading enterprise AI agent platform, GPTBots.ai, has integrated <strong class=\"root-Tkn6WL2y\">DeepSeek’s Janus-Pro</strong> into its ecosystem as an <strong class=\"root-Tkn6WL2y\">Open Tool</strong>, further expanding its comprehensive suite of AI capabilities. This integration follows the recent addition of DeepSeek’s R1 large language model (LLM), reinforcing GPTBots.ai’s position as a leader in delivering cutting-edge AI solutions tailored for enterprises.</p><p class=\"\">Janus-Pro, part of DeepSeek’s groundbreaking image model family, has set a new benchmark in AI image generation. Known for its <!-- -->hyper-realistic outputs, contextual understanding, and seamless style adaptation, Janus-Pro excels in creating visually stunning and contextually accurate images. It also offers advanced capabilities like <!-- -->multi-modal input processing, enhanced image consistency, and rapid rendering, making it ideal for industries such as marketing, e-commerce, and design. By integrating Janus-Pro as an Open Tool, GPTBots empowers businesses to unlock new creative possibilities while streamlining visual content creation.</p><p class=\"\">An Extensive Toolkit Empowering Enterprise AI Agents</p><p class=\"\">GPTBots offers <strong class=\"root-Tkn6WL2y\">a comprehensive suite of tools</strong> designed to enable enterprises to build intelligent AI agents that automate workflows, enhance customer interactions, and optimize operations. These tools are categorized into <strong class=\"root-Tkn6WL2y\">My Tools</strong> (custom-built tools tailored to specific business needs) and <strong class=\"root-Tkn6WL2y\">Open Tools</strong> (pre-configured tools accessible to all users).</p><p class=\"\">With the addition of Janus-Pro as an Open Tool, GPTBots’ ecosystem now includes a wide range of tools, such as:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">LinkedIn Tools</strong>: LinkedIn Find Company and LinkedIn Find Person for professional networking and lead generation.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">HubSpot Tools</strong>: HubSpot Contacts, HubSpot Company, HubSpot Deals, and HubSpot Tickets for seamless CRM and sales management.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">DALL-E 3 and CogView</strong>: Advanced image generation tools for creative and business applications.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Google Search Pro</strong>: Enhanced search capabilities for retrieving accurate and actionable information.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Google Video</strong>: For creating and managing engaging video content.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">WhatsApp API Message</strong>: For efficient customer communication and engagement.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">EngageLab Email Sender</strong>: Automating email campaigns for marketing and customer outreach.</li></ul><p class=\"\">These tools represent just a fraction of the <strong class=\"root-Tkn6WL2y\">extensive library of Open Tools</strong> available on GPTBots, ensuring businesses have access to the most relevant and impactful solutions for their unique needs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Empowering Enterprises with GPTBots.ai</strong></p><p class=\"\">GPTBots is designed to simplify AI adoption for businesses, offering a no-code/low-code platform that enables users to deploy AI agents quickly and effectively. With features like <!-- -->enterprise-grade SLA guarantees, role-based access control, and seamless integration with popular business systems, GPTBots ensures businesses can focus on achieving their goals without worrying about technical complexities.</p><p class=\"\">By combining tools like Janus-Pro, LinkedIn, HubSpot, and Google Video, GPTBots provides enterprises with a unified platform to automate workflows, enhance customer experiences, and drive growth. Whether it’s creating high-quality visual content, managing customer relationships, or optimizing marketing strategies, GPTBots empowers businesses to achieve more with less effort.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About GPTBots.ai</strong></p><p class=\"\">GPTBots.ai is a complementary general-purpose LLM AI bot featuring private data input and continuous fine-tuning, which can replace 'rule-based' chatbots, improve user experience, and reduce costs. GPTBots.ai aims to provide users with an end-to-end business platform that can seamlessly integrate robots into existing applications and workflows via plug-ins. GPTBots.ai also allow users to have great access to, and more efficiently and effectively using, AIGC to improve overall corporate productivity and output quality.</p><p class=\"\">To know more, please visit https://www.gptbots.ai.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Aurora Mobile Limited</strong></p><p class=\"\">Founded in 2011, Aurora Mobile  is a leading provider of customer engagement and marketing technology services in China. Since its inception, Aurora Mobile has focused on providing stable and efficient messaging services to enterprises and has grown to be a leading mobile messaging service provider with its first-mover advantage. With the increasing demand for customer reach and marketing growth, Aurora Mobile has developed forward-looking solutions such as Cloud Messaging and Cloud Marketing to help enterprises achieve omnichannel customer reach and interaction, as well as artificial intelligence and big data-driven marketing technology solutions to help enterprises' digital transformation.</p><p class=\"\">For more information, please visit https://ir.jiguang.cn/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Safe Harbor Statement</strong></p><p class=\"\">This announcement contains forward-looking statements. These statements are made under the “safe harbor” provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as “will,” “expects,” “anticipates,” “future,” “intends,” “plans,” “believes,” “estimates,” “confident” and similar statements. Among other things, the Business Outlook and quotations from management in this announcement, as well as Aurora Mobile’s strategic and operational plans, contain forward-looking statements. Aurora Mobile may also make written or oral forward-looking statements in its reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including but not limited to statements about Aurora Mobile’s beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement, including but not limited to the following: Aurora Mobile’s strategies; Aurora Mobile’s future business development, financial condition and results of operations; Aurora Mobile’s ability to attract and retain customers; its ability to develop and effectively market data solutions, and penetrate the existing market for developer services; its ability to transition to the new advertising-driven SAAS business model; its ability to maintain or enhance its brand; the competition with current or future competitors; its ability to continue to gain access to mobile data in the future; the laws and regulations relating to data privacy and protection; general economic and business conditions globally and in China and assumptions underlying or related to any of the foregoing. Further information regarding these and other risks is included in the Company’s filings with the Securities and Exchange Commission. All information provided in this press release and in the attachments is as of the date of the press release, and Aurora Mobile undertakes no duty to update such information, except as required under applicable law.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information, please contact:</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Aurora Mobile Limited</strong>E-mail: ir@jiguang.cn</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Christensen</strong></p><p class=\"\">In China</p><p class=\"\">Ms. Xiaoyan Su</p><p class=\"\">Phone: +86-10-5900-1548</p><p class=\"\">E-mail: Xiaoyan.Su@christensencomms.com</p><p class=\"\">In U.S.</p><p class=\"\">Ms. Linda Bergkamp</p><p class=\"\">Phone: +1-480-614-3004</p><p class=\"\">Email: linda.bergkamp@christensencomms.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX7hNYfq:0-aurora-mobile-s-gptbots-ai-integrates-deepseek-s-janus-pro/",
            "pub_date": "2025-02-05 18:00:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Obi3mJtwa:0",
            "title": "Highlights of Stadshypotek's Annual Report January-December 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">JANUARY-DECEMBER 2024 COMPARED WITH JANUARY-DECEMBER 2023During the second half of 2024, parts of Stadshypotek's Finnish internationalbranch were divested.</p><p class=\"\">Stadshypotek's operating profit decreased by SEK 559m, or 6%, to SEK 8,739m(9,298). Net interest income fell by SEK 222m to SEK 11,990m, (12,212), mainlydue to decreased margins arising from the fierce competition in the mortgageloan market. In Sweden, net interest income decreased by SEK 499m, while intheNorwegian branch net interest income increased by SEK 366m.</p><p class=\"\">Of the net interest income, SEK 1,054m (688) was attributable to the branch inNorway and SEK 396m (469) to the branch in Finland. Excluding the Finnishbranch, which is in the process of being divested, net interest incomedecreasedby SEK 133m to SEK 11,593m (11,726). Net gains/losses on financialtransactionsdecreased by SEK 222m to SEK 468m (690).</p><p class=\"\">Expenses rose by SEK 224m to SEK -2,624m (-2,400). This was mainlyattributableto SEK -111m of capital losses relating to the partial divestment of theFinnishoperations, as well as to an increase in the compensation paid to the parentcompany in relation to the sale and administration of mortgage loans.</p><p class=\"\">Net credit losses totalled SEK 104m (-95). The credit loss ratio correspondedto-0.01% (0.01) of lending.</p><p class=\"\">LENDING</p><p class=\"\">Compared to the close of the corresponding period during the previous year,loans to the public increased by 0%, or SEK 2bn, and stood at SEK 1,583bn(1,581). In Sweden, loans to the public increased by 1%, or SEK 12bn, to SEK1,407bn (1,395).</p><p class=\"\">FUNDING</p><p class=\"\">Issues of Stadshypotek's bond programme in Swedish kronor totalled a nominalSEK104.8bn (143.8) during the period. During the period, a nominal volumetotallingSEK 113.7bn (89.8) matured or was repurchased. The carrying amount ofoutstanding Swedish kronor bonds was SEK 614.6bn (619.6) at the end of theperiod.</p><p class=\"\">Issues of foreign currency bonds under the EMTCN programme totalled EUR 0.8bn(1.0). The outstanding volumes at the end of the period were nominally EUR8.2bn(8.7) and GBP - bn (-).</p><p class=\"\">The outstanding volume in the US programme totalled USD - bn (-) at the end ofthe period. Issues in NOK totalled NOK 7.0bn (8.0). The out- standing volumeatthe end of the period totalled NOK 29.0bn (27.0).</p><p class=\"\">CAPITAL ADEQUACY</p><p class=\"\">According to CRR 575/2013, the total capital ratio was 16.6% (18.5) while thecommon equity tier 1 ratio was 11.6% (12.9). Further information on capitaladequacy is provided in note 19, Capital adequacy.</p><p class=\"\">RATINGS</p><p class=\"\">Stadshypotek's ratings remained unchanged during the entire period.</p><p class=\"\">Stadshypotek        Covered    Long-term   Short-term                    bondsMoody's             Aaa        -           P-1Standard &amp; Poor's   -          AA-         A-1+Fitch               -          AA          F1+</p><p class=\"\">Stockholm February 5, 2025</p><p class=\"\">Cecilia HasselboChief Executive Stadshypotek AB</p><p class=\"\">This information is of the type that Stadshypotek is obliged to make publicpursuant to the Swedish Securities Markets Act. The information was submittedfor publication through the agency of the contact person set out above, at11:00a.m. CET on 5 February 2025.</p><p class=\"\">For more information about Stadshypotek please go to www.handelsbanken.com</p><p class=\"\">https://newsweb.oslobors.no/message/637756</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Obi3mJtwa:0-highlights-of-stadshypotek-s-annual-report-january-december-2024/",
            "pub_date": "2025-02-05 18:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSl4Zc0a:0",
            "title": "Corsia Releases Car Shipping Price Calculator and Online Booking Software",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Today vehicle transportation starts online. Customers search for car shipping companies, check prices, discuss solutions and then book their service. Customer software is a must and why Corsia has released its new price calculator and online booking system - to answer customers' needs.</p><p class=\"\">ST. PETERSBURG, FLORIDA / ACCESS Newswire / February 5, 2025 / For over a decade, Corsia Logistics has been a trusted name in vehicle shipping, serving private and business customers across the U.S. and internationally. Since 2013, the team has upheld a five-star reputation by delivering exceptional customer service and reliable transport solutions. To further enhance its offerings, Corsia is launching a custom car shipping cost calculator and online booking system. This innovative software is designed to accurately predict prices and simplify the reservation process, reaffirming Corsia's commitment to outstanding service and realistic market prices.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:865.3521126760563px;aspect-ratio:1.4422535211267606\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_ACSl4Zc0a-59f5dcccb0ada447a9b470dbe4e09491-resized.webp\" type=\"images/webp\"/><img alt=\"Corsia car shipping\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-05:newsml_ACSl4Zc0a-59f5dcccb0ada447a9b470dbe4e09491-resized.jpeg\" style=\"background-color:#948075\"/></picture></div></figure></span></p><strong class=\"root-Tkn6WL2y\">Corsia car shipping</strong><p class=\"\">Shipping a Lamborghini Aventador - enclosed auto transport</p><p class=\"\">A car shipping cost calculator must account for a range of variables that influence pricing. The process begins with factors like distance and the type of car carrier, followed by the vehicle's type and condition. Crucial details such as pick-up and delivery locations and the desired shipping time frame also play a significant role. Corsia's car shipping cost calculator goes a step further by incorporating the exact make and model of each vehicle, a key factor in determining a realistic and accurate price. By leveraging a detailed database where every make and model is meticulously price-marked, Corsia ensures its quotes are among the most accurate in the market.</p><p class=\"\">The next feature of Corsia's software is the online booking system, which presents customers with two pricing options upon receiving a quote. The first option, the 'Discounted Cash Price,' allows customers to pay only a reservation fee upfront and the remaining balance upon delivery to the carrier. The second option, the 'Regular Price,' enables customers to pay the full amount online at the time of booking. Importantly, the system does not require immediate payment; a card is simply placed on file. This allows customers the freedom to switch from cash price or regular price at any time before a car carrier is assigned.</p><p class=\"\">ABOUT CORSIA</p><p class=\"\">Corsia is a nationwide auto transport company servicing all states, including Alaska and Hawaii. Corsia offers free vehicle shipping quotes and reliable services. Since 2013, the company has earned the trust of thousands of private and business customers from across the country. Shippers can find information about how car shipping works on their website at www.corsia.us and get a price and book online.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information</strong></p><p class=\"\">Vasi Atanasova</p><p class=\"\"><em>Markating Executive</em></p><p class=\"\">vasi@corsia.us</p><p class=\"\">(818) 850-5250</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Corsia Logistics</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSl4Zc0a:0/",
            "pub_date": "2025-02-05 18:00:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0ES:0",
            "title": "Middle East Crude - Benchmarks rise after Trump restores pressure on Iran",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Middle East crude benchmarks Oman, Dubai and Murban ticked up on Wednesday, after President Donald Trump's renewed push to eliminate Iranian crude exports.</p><p class=\"\">Trump on Tuesday restored his \"maximum pressure\" campaign on Iran that includes efforts to drive its oil exports down to zero in order to stop Tehran from obtaining a nuclear weapon.</p><p class=\"\">Meanwhile, spot trade for the Middle East market increased on Wednesday as China came back from a week-long Lunar New Year holiday.</p><p class=\"\">SINGAPORE CASH DEALS</p><p class=\"\">Cash Dubai's premium to swaps rose 7 cents to $3.59 a barrel.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">SELLER-BUYER</p></td><td><p class=\"\">PRICE ($/BBL)</p></td></tr><tr><td><p class=\"\">RELIANCE-PETROCHINA</p></td><td><p class=\"\">78.30</p></td></tr><tr><td><p class=\"\">RELIANCE-VITOL</p></td><td><p class=\"\">78.30</p></td></tr><tr><td><p class=\"\">RELIANCE-VITOL</p></td><td><p class=\"\">78.35</p></td></tr><tr><td><p class=\"\">RELIANCE-PETROCHINA</p></td><td><p class=\"\">78.35</p></td></tr><tr><td><p class=\"\">RELIANCE-BP</p></td><td><p class=\"\">78.39</p></td></tr><tr><td><p class=\"\">RELIANCE-PETROCHINA</p></td><td><p class=\"\">78.40</p></td></tr><tr><td><p class=\"\">SHELL-PETROCHINA</p></td><td><p class=\"\">78.40</p></td></tr><tr><td><p class=\"\">SHELL-BP</p></td><td><p class=\"\">78.39</p></td></tr></tbody></table></div><p class=\"\">PRICES ($/BBL)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td><p class=\"\">CURRENT</p></td><td><p class=\"\">PREV SESSION</p></td></tr><tr><td><p class=\"\">GME OMAN</p></td><td><p class=\"\">78.37</p></td><td><p class=\"\">77.41</p></td></tr><tr><td><p class=\"\">GME OMAN DIFF TO DUBAI</p></td><td><p class=\"\">3.57</p></td><td><p class=\"\">3.49</p></td></tr><tr><td><p class=\"\">CASH DUBAI</p></td><td><p class=\"\">78.39</p></td><td><p class=\"\">77.44</p></td></tr></tbody></table></div><p class=\"\">NEWS</p><p class=\"\">French oil major TotalEnergies  reported a 15% drop in fourth-quarter earnings, closing out a year marked by low oil prices and weak fuel demand that were partially offset by higher electricity sales and liquefied natural gas trading.</p><p class=\"\">Equinor  raised its 2030 oil and gas output forecast and scaled back plans for renewable energy capacity expansion, while reporting a smaller-than-expected decline in profit for the final quarter of 2024.</p><p class=\"\">Oil major BP  is expected to spend up to $25 billion over the lifetime of a project to redevelop four Kirkuk oil and gas fields, a senior Iraqi oil official told Reuters, as Baghdad seeks to win back foreign investment.</p><p class=\"\">A Ukrainian drone attack overnight sparked a fire at an oil depot in Russia's southern region of Krasnodar that has since been extinguished, regional officials said.</p><p class=\"\">Fuel oil margins climbed after U.S. President Donald Trump reimposed a tougher policy on Iran, though trade sources expect a short-lived rally amid unclear supply disruption, while softer China demand and broader tariff concerns weighed on sentiment.</p><p class=\"\">For crude prices, oil product cracks and refining margins, please click on the RICs below.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">Brent                    </p></td><td><p class=\"\">(BRENTSGMc1)</p></td></tr><tr><td><p class=\"\">Dubai                    </p></td><td><p class=\"\">(DUBSGSWMc2)</p></td></tr><tr><td><p class=\"\">GME Oman                 </p></td><td><p class=\"\">(OQc1)</p></td></tr><tr><td><p class=\"\">Brent/Dubai EFS          </p></td><td><p class=\"\">(DUB-EFS-1M)</p></td></tr><tr><td><p class=\"\">PRODUCT CRACKS</p></td><td></td></tr><tr><td><p class=\"\">Fuel oil crack           </p></td><td><p class=\"\">(FO180SGCKMc1)</p></td></tr><tr><td><p class=\"\">Gasoil crack             </p></td><td><p class=\"\">(GO10SGCKMc1)</p></td></tr><tr><td><p class=\"\">Naphtha crack            </p></td><td><p class=\"\">(NAF-SIN-CRK) </p></td></tr><tr><td><p class=\"\">Gasoline crack</p></td><td><p class=\"\">(GL92-SIN-CRK)</p></td></tr><tr><td><p class=\"\">Complex refining margins </p></td><td><p class=\"\">(REF/MARGIN1)</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0ES:0-middle-east-crude-benchmarks-rise-after-trump-restores-pressure-on-iran/",
            "pub_date": "2025-02-05 18:00:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0E4:0",
            "title": "TotalEnergies CEO says US financing for Mozambique LNG project expected in coming weeks",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    TotalEnergies  CEO Patrick Pouyanne said on Wednesday that financing from the United States for its $20 billion Mozambique LNG project is expected to be approved in coming weeks, with other credit agencies to follow in the months after.</p><p class=\"\">The company is waiting for loan re-approvals from the United States, UK and Dutch export credit agencies before lifting a force majeure on the project that has been in place since 2021.</p><p class=\"\">Speaking to journalists after reporting fourth-quarter earnings, Pouyanne said he expected a prior loan approval to be restored fairly quickly under the Trump administration.</p><p class=\"\">He added that the project completion date would need to be pushed back to 2029-2030, from a previously planned 2027.</p><p class=\"\">The U.S. Export-Import Bank had previously agreed a $4.7 billion loan for the project but it needs to be re-approved, after construction on the project was frozen in 2021 due to violent unrest in the northern Cabo Delgado region near the project site — before any disbursements were made.</p><p class=\"\">Pouyanne said that Britain, which has pledged around $800 million to $1 billion, is looking to see if it has a legal right to exit, but noted it had already signed a contract on the financing.</p><p class=\"\">\"I am waiting to see how they will explain it to us,\" he said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0E4:0-totalenergies-ceo-says-us-financing-for-mozambique-lng-project-expected-in-coming-weeks/",
            "pub_date": "2025-02-05 18:00:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002933:0",
            "title": "Market Talk Roundup: Latest on U.S. Politics",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering U.S. politics. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">0450 ET - Base metal prices are mixed, with LME three-month copper flat at $9,174 a metric ton and LME three-month aluminum down 0.5% at $2,615 a ton. Metal prices rebounded on-week as the U.S. pushed back Canadian and Mexican tariffs one month, but trade tensions and global growth risks are still pressing, RBC Capital Markets' Sam Crittenden says. The U.S. imposed another Chinese import tariff of 10%, while China retaliated with fresh levies, including critical mineral export restrictions. President Trump and China's President Xi will talk over the coming days and U.S. tariffs won't be implemented until Feb. 10, so they could strike a deal before implementation, Crittenden writes. Tariff uncertainty has prompted a significant disconnect between LME and U.S. commodities exchange Comex copper pricing, with the market factoring in more potential trade disputes, the analyst adds. (joseph.hoppe@wsj.com)</p><p class=\"\">0337 ET - The Canadian dollar rises to a two-week high against the U.S. dollar as it continues to recover after President Trump agreed to pause a 25% tariff on Canada, ING's Francesco Pesole says in a note. The Canadian dollar could rise further if tariff risks are entirely priced out, he says. There is a residual 1% risk premium embedded into USD/CAD. \"That said, we are not sure markets will or should move to a completely optimistic stance on the U.S.-Canada trade spat.\" There are no clear hints Canada will be spared from another round of potential universal tariffs. USD/CAD could fall to 1.42 in the short-term but risks remain skewed to 1.45 this summer. USD/CAD falls to a low of 1.4289. (renae.dyer@wsj.com)</p><p class=\"\">1828 ET - Are China's 15% tariffs on U.S. coal meaningful for coal markets? That's the question posed by Morgan Stanley, which concludes any impact would be mostly be felt in metallurgical coal prices. Commodities strategist Helen Amos says China accounts for a relatively small share of U.S. coal exports. Still, U.S. exports of thermal and metallurgical coal to China increased over 2024. Morgan Stanley estimates tariffs would raise costs for around 3.4 million tons of thermal coal, representing less than 1% of traded volumes, and around 10.7 million tons of metallurgical coal, or some 3% of traded volumes. \"We see negligible or only modest potential price impact of China's coal import tariffs, given both coal markets are currently well supplied,\" Morgan Stanley says. \"But we watch for more meaningful shifts in met coal trade flows.\" (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1711 ET - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1517 ET - Oil futures put in a mixed performance with Chinese retaliatory tariffs on U.S. LNG and oil pressuring U.S. benchmark crude. WTI settles down 0.6% at $72.70 a barrel, while international benchmark Brent edges up 0.3% to $76.20 a barrel. The Chinese tariff on $5 billion of U.S. energy imports suggests a \"softer tone of the response\" to the U.S. tariffs, Alex Hodes of StoneX says in a note. \"The tariffs are also not expected to come into play until Feb. 10, leaving room for negotiations between the two nations.\" (anthony.harrup@wsj.com)</p><p class=\"\">1424 ET - Gold jumps to a record high, with the front-month contract rising 0.7% to $2,853.30 a troy ounce. The move keeps gold's positive momentum going, after it recorded net outflows in last week's trading, according to data from JPMorgan Global Commodities Research. The firm says that for the week ended Jan. 31, open interest in precious metals fell 4.6%, or by $11.3 billion. The firm attributes the decline to outflows in gold contracts, but uncertainty around trade tariffs is pushing investors back into the safe haven asset. Year-to-date, continuous gold futures have risen nearly 9%. (kirk.maltais@wsj.com)</p><p class=\"\">1252 ET - Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p><p class=\"\">1149 ET - Base metal prices rise, with LME three-month copper up 0.5% at $9,158.50 a metric ton and LME three-month aluminum up 0.6% at $2,636.50 a ton. The market has bounced back from losses incurred by President Trump's proposed tariffs on Canada and Mexico, which have been postponed a month after last-minute agreements on Monday. An additional 10% China tariff has proceeded. This has eased market worries of reduced industrial growth and demand. Canada and Mexico are significant suppliers to the U.S. across the whole base-metals complex, ranging from around 20% of copper imports to nearly half of its aluminum imports. News of the delay also sent the U.S. dollar lower, a tailwind for metals as it becomes cheaper for international buyers to purchase dollar-denominated commodities. (joseph.hoppe@wsj.com)</p><p class=\"\">1141 ET - Gold futures rise, having set a fresh record slightly earlier in the session. Futures are up 0.5% at $2,871.60 a troy ounce, having peaked at $2,874.50 in European late afternoon trading. The precious metal has traded in a relatively narrow range, with rising U.S. bond yields and a stronger dollar limiting the upward rally, XS.com's Rania Gule says in a note. That said, concerns about potential economic fallout from President Trump's tariffs and other inflationary policies provide strong support for gold as a safe-haven asset, Gule writes. The overall upward trend for gold remains intact, and any corrective pullbacks should be seen as buying opportunities as supportive factors haven't fundamentally changed, Gule says. As markets remain uncertain, gold will likely stay a focus for investors both as a hedge and an investment opportunity, Gule adds. (joseph.hoppe@wsj.com)</p><p class=\"\">1056 ET - Shares of big food companies dip after Robert F. Kennedy Jr. clears a Senate Finance Committee vote on his prospective leadership of Health and Human Services. While Kennedy said he supported vaccines in his Senate testimony, aiming to calm concerns over some of his past criticisms, he reiterated concerns about processed foods, which he's blamed for exacerbating chronic disease. Kraft Heinz recently down 2.3%, with other food stocks like Campbell's, JM Smucker and General Mills down around 2%. ( jacob.bunge@wsj.com; @jacobbunge)</p><p class=\"\">1031 ET - Century Communities expects tariffs to have a greater impact on the remodel market, says Executive VP Jim Francescon in an interview. The Denver home builder adds that it's continuing to work with its suppliers but stressed that things remain fluid. \"Typically suppliers will keep a number of months of supply on hand. So if this is just a short-term negotiating tactic, the new home builders may not even feel it,\" says Francescon. While the U.S. paused plans for 25% tariffs on imports from Mexico and Canada for one month, a 10% levy on imports from China went into effect today. Shares rise 2.2% to $76.29, recouping most of the previous sessions losses. (denny.jacob@wsj.com; @pennedbyden)</p><p class=\"\">1010 ET - Lean hog futures on the CME are higher in early trading, with the most-active contract up 0.8%. Traders appear to be pulling back from the steep selling seen to start the week, with contract limits in today's session extended to 6 cents a pound after the limit-down close Monday, following a drop of 4 cents a pound. While the hog market recalibrates amid tariff turmoil, there exists fundamental pressure points for hog demand. Pork carcass cutout prices shed 94 cents per hundredweight on Monday, according to USDA data, following a strong start to 2025 pricewise. Live cattle futures are down 0.2%. (kirk.maltais@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002933:0/",
            "pub_date": "2025-02-05 17:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205002932:0",
            "title": "Base Metal Prices Mixed as Trade Tensions Continue to Unnerve Market — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Base metal prices are mixed, with LME three-month copper flat at $9,174 a metric ton and LME three-month aluminum down 0.5% at $2,615 a ton. Metal prices rebounded on-week as the U.S. pushed back Canadian and Mexican tariffs one month, but trade tensions and global growth risks are still pressing, RBC Capital Markets' Sam Crittenden says. The U.S. imposed another Chinese import tariff of 10%, while China retaliated with fresh levies, including critical mineral export restrictions. President Trump and China's President Xi will talk over the coming days and U.S. tariffs won't be implemented until Feb. 10, so they could strike a deal before implementation, Crittenden writes. Tariff uncertainty has prompted a significant disconnect between LME and U.S. commodities exchange Comex copper pricing, with the market factoring in more potential trade disputes, the analyst adds. (joseph.hoppe@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205002932:0/",
            "pub_date": "2025-02-05 17:51:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446721:0",
            "title": "UK Private Sector Activity Growth Revised Down",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global UK Composite PMI rose to 50.6 in January of 2025 from 50.4 in the previous month, recovering from a 14-month low, revised lower from the preliminary estimate of 50.9 but ahead of the initial market expectations of no expansion at 50.</p><p class=\"\">The reading pointed to two consecutive years of expansion in British private sector activity, solely carried by service providers during January (50.8 vs 51.1 in December of 2024), which offset a slower contraction for manufacturers (48.3 vs 47).</p><p class=\"\">Still, new work at the aggregate level fell at the fastest pace since 2023, with companies citing poor underlying demand as clients limited non-essential spending.</p><p class=\"\">Consequently, job shedding at the aggregate level was the steepest since the global financial crisis more than 15 years ago, when excluding the momentary pandemic shock.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446721:0-uk-private-sector-activity-growth-revised-down/",
            "pub_date": "2025-02-05 17:51:08",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463932:0",
            "title": "Fredun Pharmaceuticals' Net Profit Rises in Fiscal Q3",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fredun Pharmaceuticals'  net profit rose to 53.3 million Indian rupees in the fiscal third quarter from 42.2 million rupees a year ago, according to a BSE filing on Tuesday by the pharmaceutical company. </p><p class=\"\">Earnings per share during the quarter ended Dec. 31, 2024, climbed to 11.29 rupees from 8.99 rupees a year earlier. </p><p class=\"\">Income from operations in fiscal Q3 jumped year on year to 1.02 billion rupees from 866.5 million rupees, the filing said.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463932:0/",
            "pub_date": "2025-02-05 17:51:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OW01P:0",
            "title": "Everest’s AM Best ratings unchanged after $1.7bn reserve strengthening",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - AM Best has said Everest’s $1.7bn reserve strengthening for year-end 2024 is not expected to have a material impact on the Bermudian’s risk-adjusted capitalization as the agency said its A+ financial strength and 'aa-' long-term issuer credit ratings remain unchanged.</p><p class=\"\">Everest announced the record reserve charge on in late January ahead of its Q4 and full year 2024 earnings.</p><p class=\"\">In a statement, the firm noted that the reserve strengthening primarily reflects unfavourable loss trends in its US casualty business, including on more recent accident years.</p><p class=\"\">It added that its analysis shows that Everest’s operating performance trends remain “in line” with other companies assessed at the “adequate” level on a five-year basis, including the impact of the reserve actions.</p><p class=\"\">“Management has already implemented initiatives to improve underwriting and reserving trends going forward, which could result in a decline in top line premium. However, AM Best does not anticipate that this will have a material impact on the current business profile assessment of Everest,” the note continued.</p><p class=\"\">AM Best said it recognises that social inflation trends – and to a lesser extent economic inflation – have driven reserve development across the US casualty (re)insurance market for the past several calendar years.</p><p class=\"\">“That trend appears likely to continue for the foreseeable future, as there are no clear signs suggesting any dissipation of key factors that are currently promoting social inflation,” it continued.</p><p class=\"\">The ratings agency said it will continue to monitor Everest’s reserve adequacy and overall profitability following the reserve charge and ongoing underwriting actions to improve the performance of its casualty book.</p><p class=\"\">It added that should the (re)insurer have to take additional, material reserve strengthening in the near to medium term, AM Best could revisit the potential impact on Everest’s ratings.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OW01P:0-everest-s-am-best-ratings-unchanged-after-1-7bn-reserve-strengthening/",
            "pub_date": "2025-02-05 17:51:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0DZ:0",
            "title": "COMMENT-Gold is the new king of currencies",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Gold has surged to a record high this month and for the time being is the new king of currencies.</p><p class=\"\">While it is unlikely gold can usurp the dollar altogether, it has certainly far outperformed the greenback since the shock investors received when they piled into the greenback in 2022.</p><p class=\"\">In that year demand was so great that investment in the dollar became overcrowded, resulting in an abrupt reversal. While the dollar has risen again it has been far surpassed by gold.</p><p class=\"\">The greenback which reached its highest point since 2006 in January - highest for available data - has risen roughly 6% from 2022's low, but is only around 1% above 2022's peak.</p><p class=\"\">Gold has rocketed from just above $1600/oz in October 2022 toward $2900/oz this month has virtually doubled in the same period.</p><p class=\"\">This stratospheric rise could be the result of changes in foreign exchange reserves where central banks are seeking ways to mitigate risks stemming from a reserve currency that is booming even when the U.S. is at the epicentre of concerns. </p><p class=\"\">That is the case now with investors fretting over the policies of the new Trump administration, and was also the case during the U.S. banking crisis in 2023 and the global financial crisis in 2008.</p><p class=\"\">Many of the nations with the largest reserves that may be subject to change are politically opposed to the United States. Should they refocus on a more durable and liquid asset that is supported by a big economy, like China's yuan, the shift from the dollar could be much more significant.     </p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0DZ:0-comment-gold-is-the-new-king-of-currencies/",
            "pub_date": "2025-02-05 17:51:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}