{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309038:0",
            "title": "Toro's HammerHead Trenchless Acquires ProKASRO Services USA",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Toro's  HammerHead Trenchless division said Tuesday it has acquired ProKASRO Services USA, a provider of robotic solutions and rehabilitation equipment for underground water and wastewater infrastructure repair. </p><p class=\"\">Financial details weren't disclosed. </p><p class=\"\">HammerHead said it will continue to market trenchless pipe rehabilitation and replacement products under the ProKASRO USA brand, while keeping operations in Colorado.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309038:0/",
            "pub_date": "2025-02-05 00:17:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309047:0",
            "title": "Paramount Resources Maintained at Outperform at BMO; Price Target Kept at C$40.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BMO Capital Markets on Tuesday reiterated its outperform rating on the shares of Paramount Resources  and its C$40.00 price target. </p><p class=\"\">\" We believe Paramount is a unique E&amp;P business with a number of non-producing/hard-to-value assets that have generally been ignored by investors (especially its long-duration holdings in Cavalier, Sinclair and its Horn River/Liard Basin gas prospects). With the closing of its recently announced Montney disposition to Ovintiv, the company will now shift gears and primarily focus on the development of its Duvernay properties and Sinclair. With high-growth inventory, no debt, and a strong management team, investors should be excited to see the next growth wedge unfold for the company,\" analyst Jeremy McCrea wrote.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309047:0/",
            "pub_date": "2025-02-05 00:17:51",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008371:0",
            "title": "Saia Is Maintained at Outperform by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:18 GMT) </strong>Saia Price Target Cut to $540.00/Share From $560.00 by Raymond James</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008371:0/",
            "pub_date": "2025-02-05 00:18:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0J9:0",
            "title": "Microsoft sued by software company Veeva over 'Viva' branding",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pharmaceutical software company Veeva Systems  has sued Microsoft  in California federal court, alleging Microsoft's Viva business software infringes its trademarks.</p><p class=\"\">Veeva told the courton Monday that Microsoft Viva, a suite of applications for employee communication and engagement, will cause consumer confusion with Veeva's software.</p><p class=\"\">Veeva asked the court to force the tech giant to stop using its Viva branding and requested an unspecified amount of monetary damages.</p><p class=\"\">Spokespeople for Microsoft did not immediately respond to a request for comment on Tuesday. A Veeva spokesperson said the company is confident in its case and looks forward to \"resolving the issue.\"</p><p class=\"\">Pleasanton, California-based Veeva specializes in cloud-based software for the pharmaceutical industry. Its products include software for managing customer relationships, content management and data analysis.</p><p class=\"\">The complaint said that Microsoft offers similar business management and collaboration software under the Viva name. Veeva said Microsoft's similarly named software will cause market confusion, and noted that news articles and transcripts of Microsoft earnings calls have referred to its software as \"Veeva.\"</p><p class=\"\">The case is Veeva Systems Inc v. Microsoft Corp, U.S. District Court for the Northern District of California, No. 3:25-cv-01110.</p><p class=\"\">For Veeva: Morgan Smith and Douglas Rettew of Finnegan Henderson Farabow Garrett &amp; Dunner</p><p class=\"\">For Microsoft: attorney information not yet available</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0J9:0-microsoft-sued-by-software-company-veeva-over-viva-branding/",
            "pub_date": "2025-02-05 00:18:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MO:0",
            "title": "China ADRs recover despite tit-for-tat tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** U.S.-listed shares of Chinese companies rise </p><p class=\"\">** Most shares recover from dip in previous session after U.S. President Donald Trump suspends tariffs on Mexico and Canada, shares broadly unfazed by implementation of 10% tariffs on all Chinese imports </p><p class=\"\">** Beijing responds with tariffs on U.S. imports and targets several U.S. companies</p><p class=\"\">** U.S. trade adviser Peter Navarro says Trump to speak with China's Xi later on Tuesday </p><p class=\"\">** E-commerce firms Alibaba Group Holding , JD.com Inc  and PDD Holdings  rise 4.5%, 5.2% and 8.9%, respectively</p><p class=\"\">** Gaming stocks Bilibili Inc  jumps 7.8%, search engine giant Baidu Inc  gains 8.8% </p><p class=\"\">** EV firms jump, tracking gains in Hong Kong-listed EV stocks: Li Auto Inc  up 7.5%, Nio Inc  gains 4.4%</p><p class=\"\">** Xpeng Inc  jumps 8.8% after co says it delivered 30,350 smart EVs in January, representing a 268% increase year-on-year</p><p class=\"\">** China ETFs rise: IShares MSCI China ETF  gains 3.1% and on track for best day in nearly two months</p><p class=\"\">** China Large-Cap ETF  gains 3%, KraneShares CSI China Internet ETF  up 4.3% </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MO:0-china-adrs-recover-despite-tit-for-tat-tariffs/",
            "pub_date": "2025-02-05 00:18:27",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0L1:0",
            "title": "GH Research slides on planned stock sale to fund depression treatments",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    **  Shares of GH Research  down 20.5% to $14.30 on Tues as co seeks equity to fund development of its treatments for depression  </p><p class=\"\">    ** GHRS shares surged 70% to close at $17.99 on Mon after co said its depression therapy, GH001, met main goals of mid-stage study  </p><p class=\"\">    ** After the bell Mon,     Ireland-based biotech commenced $150 mln stock offering  </p><p class=\"\">    ** It plans to use net offering proceeds to invest in research, clinical and technical development of current and/or additional product candidates, according to the SEC filing  </p><p class=\"\">    ** Cantor, Stifel and RBC acting as jt bookrunners for the offering  </p><p class=\"\">    ** With ~52 mln shares outstanding, co has current market cap of roughly $760 mln  </p><p class=\"\">    ** Stock ended 2024 at $7  </p><p class=\"\">    ** All 5 analysts covering GHRS are bullish with median PT of $37, LSEG data shows  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0L1:0-gh-research-slides-on-planned-stock-sale-to-fund-depression-treatments/",
            "pub_date": "2025-02-05 00:18:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008378:0",
            "title": "Euro Covered Bonds Supply Likely to Decline in 2025 — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Supply of covered bonds by European banks is expected to decline in 2025, partly due to weak economic growth, ING's Marine Leleux says in a note. ING expects supply of euro-denominated covered bonds to drop by 7 billion euros ($7.24 billion) this year versus 2024. A high number of redemptions due this year could mean bond refinancing dominates covered-bond supply this year, she says.(miriam.mukuru@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008378:0/",
            "pub_date": "2025-02-05 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008376:0",
            "title": "AstraZeneca Sales, Core EPS Seen Rising — Earnings Preview",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Helena Smolak</p><p class=\"\">AstraZeneca is scheduled to report results for the fourth quarter on Thursday. Here is what you need to know.</p><p class=\"\">SALES FORECAST: The British pharmaceutical giant's total sales are expected to be $14.2 billion for the three months ended Dec. 31, up from $12.02 billion in the same quarter a year prior, according to a company-compiled consensus based on 19 analysts' estimates.</p><p class=\"\">CORE EARNINGS PER SHARE: Core earnings per share are expected to rise to $2.07 from $1.45 the year prior, according to the same consensus.</p><p class=\"\">AstraZeneca's stock is up 7.9% since the start of 2024.</p><p class=\"\">WHAT TO WATCH</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">PIPELINE &amp; OUTLOOK: Market watchers will closely monitor AstraZeneca's confidence in the potential of its experimental drug for advanced lung cancer datopotamab deruxtecan, Jefferies analysts said. Industry watchers also eye AstraZeneca's development strategy and differentiation of its obesity portfolio, Jefferies said. The company's 2025 outlook will be crucial as this year sees more than 10 key late-stage trials, UBS analysts said.</li><li class=\"listItem-bmN0_SHH\">CHINA: Investors' focus will lie on the impact of the continuing anti-corruption investigation into some of AstraZeneca's employees in China on its sales in the country, according to Jefferies. The company is under regulatory scrutiny in China as part of an anticorruption crackdown by authorities after its top executive in the region was detained and while other employees are subject to an investigation about illegal importation of cancer drugs and patient data collection.</li></ul><p class=\"\">Write to Helena Smolak at helena.smolak@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008376:0/",
            "pub_date": "2025-02-05 00:19:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0TN:0",
            "title": "Russian central bank blames sanctions, weak rouble, poor harvest for inflation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">New Western sanctions, a weaker rouble and a lower harvest were to blame for Russia's high inflation rate in December 2024 and January 2025, the Russian central bank said in a report published on Tuesday.</p><p class=\"\">Inflation, which reached 9.5% in 2024, has emerged as the biggest economic challenge for Russian authorities as the country approaches the fourth year of what it calls \"a special military operation\" in Ukraine.</p><p class=\"\">Prices, driven by rising costs of food and housing, increased by 1.14% from the start of the year to Jan. 27, with most analysts predicting that inflation will exceed the central bank's full-year forecast of 4.5%-5.0%. </p><p class=\"\">\"Significant contributions to the rise in prices are made by supply-side factors related to new sanctions restrictions, the indexation of regulated prices, tariffs and fees, and a decrease in harvest,\" the central bank said. </p><p class=\"\">\"In December, the pass-through of the earlier depreciation of the rouble into prices also intensified,\" it added. </p><p class=\"\">The regulator said that it was important to adhere to approved parameters of the 2025 state budget in order to control inflation. The parameters for the 2024 budget were adjusted to increase the deficit twice during the year.</p><p class=\"\">The regulator also said that maintaining high economic growth rates was no longer possible in an environment of scarce labour and production capacity while a further stimulus would push the economy into recession. </p><p class=\"\">\"This implies that there is actually no choice between continuing rapid economic growth accompanied by high inflation on one hand, and economic slowdown and disinflation on the other,\" the regulator said. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0TN:0-russian-central-bank-blames-sanctions-weak-rouble-poor-harvest-for-inflation/",
            "pub_date": "2025-02-05 00:19:35",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0TZ:0",
            "title": "Movistar to invest $500 mln in Venezuela to boost cell service",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Telecoms company Movistar will invest $500 million in Venezuela over two years, Movistar Venezuela president Jose Luis Rodriguez said in an interview with Venezuela's telecommunications regulator published on Tuesday. </p><p class=\"\">Movistar, a subsidiary of Spain's Telefonica, will make a $250 million investment in each of the next two years to expand 4G and 5G service, Rodriguez said. </p><p class=\"\">\"We have to strive to improve all our smart platforms, which we have been doing for some time now,\" the executive said. \"Technology is advancing much faster than we might assume and we have to be very up to speed.\"</p><p class=\"\">Movistar has 8.8 million users in Venezuela, according to official data, which represents approximately 42% of the country's mobile phone market. </p><p class=\"\">Many companies have held off investments amid Venezuela's economic collapse in recent years, but relaxed regulations and an informal dollarization beginning in 2019 have created room for greater investment. </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0TZ:0-movistar-to-invest-500-mln-in-venezuela-to-boost-cell-service/",
            "pub_date": "2025-02-05 00:19:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250202001199:0",
            "title": "How the U.S.-Canada-Mexico Tariffs Will Work — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Chao Deng</p><p class=\"\">The U.S. and China entered a new trade war on Tuesday, with tariffs of 10% going into effect on Chinese goods. Beijing struck back with 10%-15% levies that will take effect Feb. 10 on select American goods, including coal and liquefied natural gas, crude oil, agricultural machinery and pickup trucks. Beijing also said it was opening an antitrust probe into Google and tightening export controls for five key minerals without singling out any particular country.</p><p class=\"\">Mexico and Canada on Monday reached separate agreements with President Trump to pause tariffs on their exports to the U.S. for 30-days, staving off a larger trade war for the time being.</p><p class=\"\">Over the weekend, the Trump administration had said it would levy 25% import tariffs on goods from the two countries. But then Canada agreed to put 10,000 front-line personnel on its border with the U.S., while Mexico agreed to supply 10,000 Mexican soldiers on the Mexican border, as part of their efforts to appease Trump.</p><p class=\"\">How the trade disputes will play out isn't certain. But here are answers to a few fundamental questions about how tariffs work, and their immediate impact on American businesses and consumers:</p><p class=\"\">Who pays the tariffs?</p><p class=\"\">The firms importing the goods, many of which are American individuals and businesses, will pay for the tariffs.</p><p class=\"\">Who bears the ultimate burden of the tariffs however isn't so straightforward. An American importer can pass along the cost of tariffs to American businesses or consumers by raising its prices. Alternatively, a foreign exporter might ultimately shoulder the burden if it cuts prices to avoid losing sales.</p><p class=\"\">If the tariffs prompt U.S. companies to turn to other countries for imports, those levies can be avoided, of course. In those instances, however, Canadian, Mexican and Chinese workers might lose jobs. Under that scenario, Americans would also likely pay higher prices, with more goods coming from alternative suppliers that face higher costs. If production shifts to the U.S., Americans would likely pay higher prices as well, though some of that would likely go toward the wages and profits of other Americans.</p><p class=\"\">What sort of goods will be affected if tariffs are imposed?</p><p class=\"\">U.S. tariffs apply to all Chinese imports and come on top of levies that were previously applied to select Chinese goods. Consumer goods like Chinese electronics — and electronics from U.S. firms made in China — and toys are likely to get more costly.</p><p class=\"\">But the American crude oil and coal that China has announced tariffs on may not see a huge impact because China is far from U.S.'s largest customer for the commodities.</p><p class=\"\">If U.S. tariffs on Mexico and Canada go into effect, prices of many more items would rise for American consumers, including cars, gas and fresh vegetables.</p><p class=\"\">Since the U.S. buys billions of dollars of lumber from Canada, the cost of home construction might go up. The U.S. also relies to a significant degree on Canada to supply its frozen french fries. Mexican grocery goods from tequila, to avocados and tomatoes are also likely to get higher price tags, potentially affecting millions of American households.</p><p class=\"\">Which firms will feel the impact?</p><p class=\"\">During Trump's first term, American firms had an opportunity to apply for exemptions from tariffs. And many were granted. For instance, Apple won tariff exemptions for some of its China-made products.</p><p class=\"\">Whether there will be a process to apply for exemptions this time around is unclear. A senior administration official told reporters on Saturday that there will be no exemptions to the tariffs. Instead, the duties will be in place until the White House is satisfied that the trading partners have scrubbed out the illicit fentanyl moving into the U.S.</p><p class=\"\">How do these tariffs compare with those from Trump's first term?</p><p class=\"\">They look to be much bigger.</p><p class=\"\">The 10% additional tariffs on China apply to all of the country's exports to the U.S., which totaled around $401.4 billion in the first 11 months of 2024, according to Census Bureau data. Tariffs imposed by the U.S. in 2018 and 2019 — during Trump's first term — covered nearly two-third of all imports from China, or roughly $370 billion in annual goods.</p><p class=\"\">The hit from Trump's threatened, 25% tariffs on goods from Canada and Mexico will be significant, if those tariffs ultimately take effect. In January through November of 2024, the U.S. imported $466.6 billion worth of goods from Mexico and $377.2 billion worth of goods from Canada.</p><p class=\"\">During Trump's first term, his administration imposed tariffs on steel and aluminum from Canada and Mexico for about one year. Tariffs he announced on all imports from Mexico were averted after a new free-trade agreement was hashed out by the U.S., Mexico and Canada (USMCA).</p><p class=\"\">This round of action by Trump also targets the \"de minimis\" loophole which allows shipments valued under $800 to enter the U.S. duty-free. Use of the trade provision has ballooned in recent years, partly through the explosive growth of Chinese e-commerce merchants. The U.S. will suspend this loophole for Canada, because of concerns that packages from there aren't being properly inspected under the exemption.</p><p class=\"\">What should we expect moving forward?</p><p class=\"\">Negotiation, and possibly more twists and turns, judging from how this has played out so far.</p><p class=\"\">President Trump said Monday the 10% additional tariffs on China are just \"an opening salvo.\" On the campaign trail, he threatened tariffs as high as 60% on Chinese imports. Trump  is slated to talk with Chinese leader Xi Jinping Tuesday about a potential tariff pause, according to White House trade adviser Peter Navarro.</p><p class=\"\">The 30-day tariff reprieves for Mexico and Canada were announced after Mexican President Claudia Sheinbaum pledged national guard troops to help stop migration into the U.S. and Canadian Prime Minister Justin Trudeau said his country would also implement a border plan in coordination with the U.S. to stop the flow of fentanyl.</p><p class=\"\">Staving off tariffs permanently depends on how negotiations with the Trump administration go. Before the agreements, Canada's Trudeau said his country would retaliate with 25% tariffs on more than $105 billion of U.S. goods. Mexico's Sheinbaum had threatened tariffs and nontariff measures.</p><p class=\"\">Tit-for-tat tariffs by all three countries wouldn't only put U.S. imports but hundreds of billions worth of U.S. exports on the line. In January through November of 2024, the U.S. exported $322.2 billion worth of goods to Canada, $309.4 billion worth of goods to Mexico, and $131 billion to China.</p><p class=\"\">Write to Chao Deng at chao.deng@wsj.com</p><p class=\"\">This explanatory article may be updated periodically.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250202001199:0/",
            "pub_date": "2025-02-05 00:20:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309034:0",
            "title": "Mineralys Completes Enrollment in Mid-Stage Hypertension Trial",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Mineralys Therapeutics  said Tuesday it has completed enrollment in the phase 2 trial of lorundrostat for the treatment of hypertension in subjects with chronic kidney disease and albuminuria. </p><p class=\"\">The clinical-stage biopharmaceutical company said it continues to expect topline data from the trial in Q2 of 2025.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309034:0/",
            "pub_date": "2025-02-05 00:20:03",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX1F7rLH:0",
            "title": "Trading Meets Luxury: Bybit Kazakhstan Brings Unmatched Prizes to Local Crypto Traders",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1F7rLH-5c4aa6e8b7b042328b7bcf907a290b9b-resized.webp\" type=\"images/webp\"/><img alt=\"Bybit Fintech FZE\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025-02-04:newsml_GNX1F7rLH-5c4aa6e8b7b042328b7bcf907a290b9b-resized.jpeg\" style=\"background-color:#705f46\"/></picture></div></figure></span></p><p class=\"\">ALMATY, Kazakhstan, Feb.  04, 2025  (GLOBE NEWSWIRE) — Bybit, the world’s second-largest cryptocurrency exchange by trading volume, is redefining the way users join the crypto trading journey. In a new event from now until Feb. 28, 2025, Bybit.kz is offering <!-- -->Tesla Model 3, Rolex watches, popular cryptocurrencies, and <strong class=\"root-Tkn6WL2y\">Apple gadgets</strong>.</p><p class=\"\">The two-part event allows traders to start small for a chance to win big:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">New users may join the <strong class=\"root-Tkn6WL2y\">Sign Up, Deposit, and Win</strong> event with $100 or more in deposit. Successful participants who register on <strong class=\"root-Tkn6WL2y\">Bybit.kz</strong>, sign up for the event, and deposit at least $100, will automatically enter a Lucky Draw. Additionally, extra perks await for users who hit specific deposit milestones.</li><li class=\"listItem-bmN0_SHH\">All eligible users may take part in the <strong class=\"root-Tkn6WL2y\">Trade Your Way to Grand Prizes</strong> event, vying for top-tier prizes by meeting trading goals during the event period. Those who achieve the required trading volumes will be eligible for rewards like the <strong class=\"root-Tkn6WL2y\">Tesla Model 3</strong>, <strong class=\"root-Tkn6WL2y\">Rolex watches</strong>, and trending cryptocurrencies. The higher the stake, the better their chances of winning.</li></ul><p class=\"\">\"We're excited to offer both the crypto community in Kazakhstan an opportunity to get onboard the Bybit trading journey,\" said Joan Han, Sales and Marketing Director at Bybit. \"This event is not only about rewards, but about bringing together a vibrant community of traders eager to make the most of their experience.\"</p><p class=\"\">Since obtaining the license to operate in Kazakhstan in Sep. 2024, Bybit Kazakhstan has been fully committed to supporting Kazakhstan’s growing crypto and blockchain ecosystem. Bybit Kazakhstan’s launch marks a major step in bringing cutting-edge crypto solutions to the region, with the goal of empowering local traders, entrepreneurs, and institutions. As a global leader in digital assets, Bybit aims to foster a secure, transparent, and user-friendly trading environment that aligns with the regulatory framework and the values of the Kazakh market.</p><p class=\"\">Registration is required. For the full terms and conditions of the event, users may visit: Grand Start With Bybit Kazakhstan. </p><p class=\"\">#Bybit / #TheCryptoArk</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Bybit</strong></p><p class=\"\">Bybit is the world’s second-largest cryptocurrency exchange by trading volume, serving a global community of over 60 million users. Founded in 2018, Bybit is redefining openness in the decentralized world by creating a simpler, open, and equal ecosystem for everyone. With a strong focus on Web3, Bybit partners strategically with leading blockchain protocols to provide robust infrastructure and drive on-chain innovation. Renowned for its secure custody, diverse marketplaces, intuitive user experience, and advanced blockchain tools, Bybit bridges the gap between TradFi and DeFi, empowering builders, creators, and enthusiasts to unlock the full potential of Web3. Discover the future of decentralized finance at Bybit.com.</p><p class=\"\">For more details about Bybit, please visit Bybit Press</p><p class=\"\">For media inquiries, please contact: media@bybit.com </p><p class=\"\">For updates, please follow: Bybit's Communities and Social Media</p><p class=\"\">Discord | Facebook | Instagram | LinkedIn | Reddit | Telegram | TikTok | X | Youtube</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Head of PR</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tony Au</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">tony.au@bybit.com</strong></p><p class=\"\">A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/368796c7-1da2-4f89-8beb-45a0e3edce7c</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit Fintech FZE</strong></p> <!-- --> <p class=\"\"><strong class=\"root-Tkn6WL2y\">Bybit Fintech FZE</strong></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX1F7rLH:0-trading-meets-luxury-bybit-kazakhstan-brings-unmatched-prizes-to-local-crypto-traders/",
            "pub_date": "2025-02-05 00:20:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV1MW:0",
            "title": "Centene falls on higher Q4 Medicaid costs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Shares of health insurer Centene  fall 3.50% to $62.55 </p><p class=\"\">** Co reports Q4 medical loss ratio - the percentage of premiums spent on medical care - of 93.4% in its Medicaid business </p><p class=\"\">** Costs for health insurers which offer Medicaid plans for lower income individuals have been elevated due to an influx of sicker patients after the end of pandemic era policy</p><p class=\"\">** \"We think the stock reaction reflects the fact that the core Medicaid medical loss ratio came in worse than expected in Q4\"- Stephens analyst Scott Fidel </p><p class=\"\">** Co however beats Q4 adj.profit estimates helped by a settlement related to its plans it offers through the Affordable Care Act</p><p class=\"\">** Reports Q4 adj.profit of 80 cents per share, beating estimates of 49 cents per share as per data compiled by LSEG </p><p class=\"\">** Co leaves its forecast of adj. 2025 profit of greater than $7.25 per share unchanged</p><p class=\"\">** CNC fell 18.4% in 2024 </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV1MW:0-centene-falls-on-higher-q4-medicaid-costs/",
            "pub_date": "2025-02-05 00:13:23",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OV0SA:0",
            "title": "COMMENT-RBA, tariff risks still plague AUD/USD despite bullish techs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    AUD/USD rallied above the 21-day moving average and struck a 2-session high Tuesday but the pair's upside may be limited due to threats from RBA rate cuts and ongoing U.S.-China trade tensions.</p><p class=\"\">Australia price increases cooled according to Q4 CPI data which helped send interest rates broadly lower as investors pulled forward expectations for rate cuts to begin with the February 18 decision priced at 82% probability for a 25bps cut.</p><p class=\"\">Trade tensions escalated as China retaliated on the U.S. by imposing tariffs of 15% and 10% on selected imports, but U.S. President Donald Trump and Chinese President Xi Jinping are expected to hold a call, which could defuse the situation. </p><p class=\"\">Should an agreement be reached, riskier assets and AUD/USD could rally sharply.</p><p class=\"\">An AUD/USD rally would validate technical signals highlighting upside risks.</p><p class=\"\">Daily and monthly RSIs are rising after they diverged on the 58-month low struck Monday.</p><p class=\"\">A monthly bull hammer has formed and two consecutive daily bull hammers have been put in place.</p><p class=\"\">The monthly bull hammer formed after the 76.4% Fibo of the 0.5510-0.8007 rally was pierced. That Fibo is frequently a retracement level where existing trends reverse.</p><p class=\"\">AUD/USD bulls may be rewarded handsomely if trade tensions ease and the RBA leans less dovish than rate markets expect.</p><p class=\"\">For more click on </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:672.6744186046511px;aspect-ratio:1.121124031007752\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.webp\" type=\"images/webp\"/><img alt=\"audusd\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OV0SA-b78413e548cc28ea40c3eba5afc647e5-resized.jpeg\" style=\"background-color:#e3e3e3\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">audusd</span></figcaption></figure></span></p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OV0SA:0-comment-rba-tariff-risks-still-plague-aud-usd-despite-bullish-techs/",
            "pub_date": "2025-02-05 00:13:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L6N3OV0KE:0",
            "title": "Aon: D&O price declines decelerate slightly sequentially to 10.6% in Q4",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">(The Insurer) - Aon’s latest US D&amp;O pricing index shows the average price per million decreased by 10.6 percent year on year in Q4, which was a slight sequential deceleration from the 11.1 percent drop in the third quarter of 2024.</p><p class=\"\">The pricing index decreased to 1.26 from 1.41 in the prior-year quarter.</p><p class=\"\">The decrease in Q4 2024 marked the 11th consecutive quarterly year-on-year price decrease, following a period of 17 quarterly pricing increases over the prior four years.</p><p class=\"\">However, Aon believes a better comparison is to look at only those programs that renewed in both the fourth quarters of 2024 and 2023. On that basis, pricing decreased 4.3 percent.</p><p class=\"\">Primary policy pricing down 3.5%</p><p class=\"\">The broker also said that looking at only primary policies in the quarter that renewed with the same limit and deductible as the prior year eliminates some “noise” and focuses only on those policies that renewed on a “like-for-like” basis. </p><p class=\"\">The overall price change for primary policies renewing with the same limit and deductible in the fourth quarter was down 3.5 percent. The average price decrease was 8 percent, while the average price increase was 10 percent. </p><p class=\"\">In the fourth quarter 60 percent of primary policies received a price decrease, 29 percent of policies renewed “flat” and 11 percent of companies received a price increase. </p><p class=\"\">Aon also noted that 95 percent of primary policies renewed with the same limit in Q4 2024, and 91 percent of policies renewed with the same deductible. </p><p class=\"\">Historically, the percentage of clients renewing with the same limit was in the mid- to high 90s, and the percentage of clients renewing with the same deductible was in the low to mid-90s.</p><p class=\"\">“Concurrently with the primary layer rate increases that started in first-quarter 2018, the percentage of clients renewing with both the same limit and deductible had been dropping steadily,” Aon said.</p><p class=\"\">“After bottoming out in third-quarter 2020, that percentage has returned to more historical levels. For the fourth quarter of 2024, 88 percent of clients renewed with the same limit and deductible as the prior-year quarter,” it continued.</p><p class=\"\">Despite movements in limit and deductible levels, 97 percent of primary policies renewed with the same carrier in Q4 2024.</p><p class=\"\">On average, primary policies that renewed with the same limit, deductible and carrier experienced a 3.8 percent premium decrease in Q4.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L6N3OV0KE:0-aon-d-o-price-declines-decelerate-slightly-sequentially-to-10-6-in-q4/",
            "pub_date": "2025-02-05 00:14:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008357:0",
            "title": "Palantir Shares Surge to All-Time High as Growth, Outlook Upstages Competitors",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Katherine Hamilton</p><p class=\"\">Shares of Palantir Technologies hit an all-time high after the company's earnings blew past Wall Street's expectations and the company showed it's on track for stronger growth than some of its competitors.</p><p class=\"\">The stock climbed 25% to $104.98 after touching a record high of $106.91 on Tuesday morning, making it the best performer on the S&amp;P 500 and Nasdaq 100. The shares are on pace for their largest percentage increase in a year, and the stock has seen an almost five-fold increase in price in the last 52 weeks.</p><p class=\"\">Palantir's earnings showed no signs of growth deceleration heading into 2025, outshining Microsoft and ServiceNow's forecasts. The artificial intelligence company expects revenue to expand roughly 36% in the first quarter, on par with growth in the fourth quarter.</p><p class=\"\">Competitors, by contrast, posted mixed results and saw their stock prices fall after reporting results last week. Microsoft's earnings beat analysts' expectations, but declining growth in its Azure cloud infrastructure unit gave investors pause. ServiceNow forecast slightly slower revenue growth in its first quarter compared with a 21% rise in the fourth quarter.</p><p class=\"\">Palantir's U.S. revenue was one of its best performing metrics with a 52% increase, and the company expects the same level of growth this year. Business in the U.S. has nearly five times the number of commercial customers compared with three years ago and is still growing, Chief Revenue and Legal Officer Ryan Taylor said. Palantir also signaled that any boost from the Trump administration's Department of Government Efficiency wasn't included in its 2025 guidance, UBS analysts led by Karl Keirstead said in a note.</p><p class=\"\">Palantir's pricing structure may help insulate it from any AI price deflation from falling model costs related to DeepSeek, the UBS analysts said.</p><p class=\"\">The company said it has been ready for the affect that a cost-efficient AI product like DeepSeek would have on the market. For the past two years, Palantir has argued that open- and closed-source AI models are becoming more similar and performance will eventually converge, Chief Technology Officer Shyam Sankar said.</p><p class=\"\">\"With the release of DeepSeek R1, that has gone from a contrarian position to consensus,\" Sankar said.</p><p class=\"\">Write to Katherine Hamilton at katherine.hamilton@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008357:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309043:0",
            "title": "Novo Nordisk on Lookout for Next-Generation Obesity Drug Candidates, The Wall Street Journal Reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309043:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008356:0",
            "title": "News Highlights: Top Global Markets News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Beijing's Retaliation Intensifies Trade War With U.S.</strong></p><p class=\"\">China's tariff increases and other countermeasures were mostly symbolic and apparently designed to project strength while leaving the door open to talks.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Job openings fall close to 4-year low. Finding work gets harder.</strong></p><p class=\"\">It's gotten harder for the unemployed to find work. Job openings in the U.S. fell at the end of 2024 to the second-lowest level since the end of the pandemic</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Stocks Rise Despite Tariff Concerns</strong></p><p class=\"\">U.S. stocks staged a small recovery despite China's retaliation against the new U.S. tariffs.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">RFK Jr. Clears Committee Vote, Putting Him on Track to Become Health Secretary</strong></p><p class=\"\">The committee was scheduled to vote on Tuesday morning.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Antitrust Shouldn't Become Trade War Weapon, EU Says</strong></p><p class=\"\">Competition enforcement is not a tool to be used in trade disputes, the European Commission said after U.S. tariffs triggered a tit-for-tat reaction from China.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">A U.S.-EU Trade War Would Threaten World's Richest Economic Relationship</strong></p><p class=\"\">European leaders call for cooperation with Trump but say they are ready to fight.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">EU Must Accept Transactional Global Relationships, Commission Chief Von Der Leyen Says</strong></p><p class=\"\">European officials need to manage diplomatic negotiations in a more volatile geopolitical environment, the commission president said in reference to a possible trade war between the bloc and the U.S.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">XRP, Bitcoin Prices Slide. Why China's Trump Tariffs Standoff Is Hitting Cryptos.</strong></p><p class=\"\">Digital-asset prices slid after Beijing said it would hit back with levies of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">India's Budget Plots Path for Sustainable Growth</strong></p><p class=\"\">Focus now turns to policy execution, with economists watching to see if policymakers can deliver on their aim of supporting growth without sacrificing fiscal prudence or financial stability.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008356:0-news-highlights-top-global-markets-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008355:0",
            "title": "News Highlights: Top Financial Services News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Direct Lenders Face Rising Default Risks, Analysis Firm KBRA Says</strong></p><p class=\"\">Highly leveraged middle-market borrowers with worsening business performance face higher default risks unless rates drop and asset sale activities recover.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Are Markets Underestimating the Tariff Problem?</strong></p><p class=\"\">Investors who see President Trump's new trade war as more bark than bite have so far been proven right. This could be a problem.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Raiffeisen Swings to Loss on Provision, Deconsolidation</strong></p><p class=\"\">The lender has been contending with a provision booked through its Russian subsidiary and the deconsolidation of Belarusian assets.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">BNP Paribas Earnings Grow; Raises Dividend</strong></p><p class=\"\">The lender intends to buy back more than 1 billion euros worth of shares after posting an earnings rise.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UBS to Boost Buybacks as Net Profit Beats Expectations</strong></p><p class=\"\">The group plans to repurchase $1 billion of its stock in the first half and buy back up to an additional $2 billion in the second.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trump Signs Order to Create U.S. Sovereign-Wealth Fund</strong></p><p class=\"\">The president said the fund could be used to help keep TikTok operating.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Financial Services Roundup: Market Talk</strong></p><p class=\"\">Find insight on BNP Paribas, UBS, Kasikornbank and more in the latest Market Talks covering Financial Services.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Vanguard Is Delivering Its Biggest Fee Cut Ever. New CEO Salim Ramji Explains Why.</strong></p><p class=\"\">The asset manager says the move at 87 funds will save investors $350 million this year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Bessent Takes Helm of Consumer Finance Watchdog, Orders Halt to Work</strong></p><p class=\"\">Treasury Secretary Scott Bessent is ordering a freeze to work at the Consumer Financial Protection Bureau, after being named its acting director by President Trump</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008355:0-news-highlights-top-financial-services-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008354:0",
            "title": "News Highlights: Top Energy News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil prices fall after U.S. imposes tariffs on China, Beijing retaliates</strong></p><p class=\"\">Oil futures fell Tuesday as the U.S. implemented an additional 10% tariff on China imports and Beijing retaliated with measures of its own.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">OMV's Net Profit Rises Despite Weak Refining Margins</strong></p><p class=\"\">The oil-and-gas company's refining margin fell to $5.9 a barrel, compared with $9.9 a barrel a year ago.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Energy &amp; Utilities Roundup: Market Talk</strong></p><p class=\"\">Find insight on OMV, Origin Energy, Galp Energia and more in the latest Market Talks covering Energy and Utilities.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Oil Rises as Trump's Tariffs Raise Supply Fears</strong></p><p class=\"\">Prices jumped on concerns that U.S. tariffs against its major trade partners could disrupt supplies and raise prices at the pump.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon Enters the Electricity Business, Takes a Swipe at Nuclear</strong></p><p class=\"\">Exxon says it can compete with nuclear, because the gas power plants it intends to build would capture carbon emissions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">U.S. Frackers and Saudi Officials Tell Trump They Won't Drill More</strong></p><p class=\"\">The president says lower prices could solve a range of problems, but finds early resistance in the oil market.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Exxon, Chevron Yearly Profits Down as Investor Payouts Hit Fresh Highs</strong></p><p class=\"\">Annual profits fell, but the oil giants made record distributions to shareholders as production rose to historic levels in key regions.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Orsted Replaces CEO as Wind Industry Faces Challenges</strong></p><p class=\"\">The company said it is parting ways with Mads Nipper as it grapples with supply-chain bottlenecks, high financing costs and President Trump's opposition to wind power.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Tariffs Won't Sink Canadian Oil Companies</strong></p><p class=\"\">The U.S. has become reliant on their crude, and Canada has ways to limit any financial hit.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Shell Keeps $3.5 Billion Buyback Amid Earnings Miss</strong></p><p class=\"\">The oil-and-gas company's adjusted earnings fell more than expected, weighed by lower oil prices and refining margins.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008354:0-news-highlights-top-energy-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008353:0",
            "title": "News Highlights: Top Company News of the Day - Tuesday at 11 AM ET",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">Merck Shares Hit After Guidance Falls Short, Gardasil Challenge</strong></p><p class=\"\">The drugmaker's guidance was affected by a pause in shipments of its top-selling vaccine to China from February through at least the middle of the year.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Okta to Cut 3% of Workforce to Reallocate Resources Toward Growth Priorities</strong></p><p class=\"\">The digital identity verification provider will recognize $11 million in restructuring charges during the fourth quarter, which will primarily be paid in the first quarter of fiscal 2026.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Novartis Sets High Bar in Pursuit of Obesity Deals, CEO Says</strong></p><p class=\"\">The Swiss pharmaceutical company has set a high bar for any potential obesity-treatment acquisition as it scans the market for deals to fill its drug pipeline and power sales growth into the 2030s, CEO Vas Narasimhan said in an interview.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PepsiCo Revenue Slips on Volume Drop for Frito-Lay, Quaker</strong></p><p class=\"\">PepsiCo recorded a higher quarterly profit despite a small drop in revenue as volumes in its main North American segments declined.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estée Lauder to Cut Up to 7,000 Jobs</strong></p><p class=\"\">The cosmetics company has been struggling with weak demand, especially in Asia.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Fox Plans to Launch New Streaming Service by Year-End</strong></p><p class=\"\">The offering, which will include news and sports content, is the company's biggest foray yet into subscription streaming.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Pfizer Stock Rises on Fourth-Quarter Earnings Beat and Reaffirmed Guidance</strong></p><p class=\"\">CEO Albert Bourla says Pfizer has met the strategic goals it had set for itself in 2024, and that it was 'executing transformative changes.'</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Archer Daniels Midland laying off up to 700 in face of uncertain profit</strong></p><p class=\"\">The company says 2025 guidance reflects \"weaker\" market view on biofuel and trade-policy turmoil.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">PayPal posts an earnings beat, but another metric is weighing on its stock</strong></p><p class=\"\">PayPal's stock is down 6%, with an analyst noting that growth in branded-checkout volume seems to have trailed buy-side expectations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Spotify Reports First Full-Year Profit</strong></p><p class=\"\">Price increases and cost discipline helped the audiostreaming giant pivot from heavy spending on growth to sustained profits.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"> </strong></p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008353:0-news-highlights-top-company-news-of-the-day-tuesday-at-11-am-et/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008360:0",
            "title": "Here's What Could Cost More Under Trump's Tariffs on China — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Joseph De Avila</p><p class=\"\">President Trump's 10% tariff on all Chinese goods could lead to more expensive goods for a host of products sold in the U.S., including electronics, apparel and medicine. Here's some items that could see higher prices.</p><p class=\"\">Smartphones: While previously exempt from earlier tariffs imposed during the first Trump administration and the Biden administration, smartphones would now be more expensive due to the across-the-board 10% tariff on Chinese-made goods.</p><p class=\"\">Tools: Tools made in China such as sledgehammers already have a 25% import tariff upon arrival in the U.S. An additional tariff will raise costs for importers and possibly pass through to stores and consumers.</p><p class=\"\">Toys: More than 80% of toys sold in the U.S. are made in China, according to the Toy Association, an industry group. A 10% import tariff on Chinese goods would raise the retail price of Tonka trucks from about $29.99 today to between $34.99 and $39.99, according to Basic Fun, the toy's manufacturer.</p><p class=\"\">Prescription Drugs: The U.S. imported $6 billion worth of pharmaceutical products from China in 2023, according to Trading Economics. Generic manufacturers rely on a global supply chain to make their medicines and will be squeezed to absorb new costs, said the Association for Accessible Medicines, which represents generic pharmaceutical manufacturers. Tariffs will make pharmaceutical production even harder, it said.</p><p class=\"\">Groceries: China imports a wide variety of food into the U.S. including fruits and vegetables, meat and cereals. Tariffs will lead to higher prices for food that will pass to shoppers, said FMI, the Food Industry Association.</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008360:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008361:0",
            "title": "Dycom Is Maintained at Strong Buy by Raymond James",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:15 GMT) </strong>Dycom Price Target Raised to $215.00/Share From $210.00 by Raymond James</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008361:0/",
            "pub_date": "2025-02-05 00:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_AQN2K0IE4:0",
            "title": "Table-Non-competitive bids for U.S. 42-day cash management bills",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Feb 4 (Reuters) - Below are results from non-competitive bids on U.S. 42-Day Cash Management Bills</p><p class=\"\">Security              42-day cash management billsIssue Date            Feb 06, 2025CUSIP                 912797KJ5Maturity Date         March 20, 2025Offering Amount     $85,000,000,000Non Comps Accepted     $348,666,000Tentative Tendered*    $348,666,000Approximate Comp Remaining     $84,651,334,000SOMA Tendered**                  $0</p><p class=\"\">*Total of Non-comps accepted and FIMA**SOMA - Bids from Federal Reserve in the System Open Market Account</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_AQN2K0IE4:0-table-non-competitive-bids-for-u-s-42-day-cash-management-bills/",
            "pub_date": "2025-02-05 00:15:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSsrGbGa:0",
            "title": "Valsoft Enters the Latin American Market with the Acquisition of VHL Sistemas",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Pioneering cloud-based solutions for notary management across Brazil</p><p class=\"\">MONTREAL, QC / ACCESS Newswire / February 4, 2025 / Valsoft Corporation Inc. (\"Valsoft\"), a Canadian company specializing in the acquisition and development of vertical market software businesses, is pleased to announce its first acquisition in Latin America with the purchase of VHL Sistemas Ltda (VHL Sistemas), a leading provider of cloud-based notary management solutions.</p><p class=\"\">Based in Brazil, VHL Sistemas has established itself as a trusted name in the notary space, delivering cutting-edge technology to optimize productivity, enhance usability, and ensure information security. Its flagship platform, Asgard, has set a benchmark for operational efficiency, enabling transparency and security for notaries and their clients across the region.</p><p class=\"\">\"This acquisition marks an exciting milestone for Valsoft as we expand into Latin America,\" said Costa Tagalakis, Investment Partner at Valsoft. \"VHL Sistemas represents everything we look for in a company-a strong product, an innovative approach, and a highly experienced management team. We are thrilled to partner with them to further enhance their offerings and grow their presence across Brazil.\"</p><p class=\"\">\"For the past decade, VHL Sistemas has led innovation in the Brazilian notary sector,\" said Jonathan Cleiton Alves, Partner and CEO of VHL. \"Joining forces with Valsoft represents an exciting new chapter, as we leverage their resources and expertise to accelerate innovation, strengthen our solutions, and expand our impact, while continuing to simplify complex processes and ensure efficiency and security for our clients.\"</p><p class=\"\">This acquisition not only signifies Valsoft's entry into the dynamic Latin American market, with a strong base in Brazil, but also underscores its commitment to fostering growth and innovation in vertical market software. Valsoft is excited to work with VHL Sistemas leadership team to strategically focus on geographic expansion and further strengthening VHL's position as a leader in its field.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About VHL Sistemas</strong></p><p class=\"\">Founded in 2015, VHL Sistemas specializes in creating advanced technological solutions tailored to the notary sector. Their cloud-based solutions, including the flagship Asgard platform, are designed to optimize productivity, enhance usability, and provide unparalleled information security. VHL is committed to fostering an environment of security, authenticity, and transparency for its clients and employees. For more information, visit: https://vhlsistemas.com.br/.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Valsoft</strong></p><p class=\"\">Valsoft acquires and develops vertical market software companies that deliver mission-critical solutions. A key tenet of Valsoft's philosophy is to invest in established businesses and foster an entrepreneurial environment that shapes a company into a leader in its respective industry. Unlike private equity and VC firms, Valsoft does not have a predefined investment horizon and looks to buy, hold, and create value through long-term partnerships with existing management and customers. Learn more at www.valsoftcorp.com.</p><p class=\"\">Valsoft was represented internally by Oliver Gray (Senior Legal Counsel), David Felicissimo (General Counsel), and Elisa Marcon (Corporate Paralegal). Externally, Valsoft was represented by Lefosse Advogados. VHL Sistemas was represented by Píer Partners and Teixeira Freire Advogados.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media contact information</strong>:</p><p class=\"\">Communications and Public Relations</p><p class=\"\">Valsoft Corporation</p><p class=\"\">communication@valsoftcorp.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Valsoft Corporation</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSsrGbGa:0/",
            "pub_date": "2025-02-05 00:15:13",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309023:0",
            "title": "BlackBerry Completes Sale of Cylance Assets to Arctic Wolf",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">BlackBerry  and Arctic Wolf said that Arctic Wolf has completed the acquisition of BlackBerry's Cylance endpoint security assets. </p><p class=\"\">Under the terms of the transaction, announced in December, BlackBerry will receive $160 million in cash and about 5.5 million Arctic Wolf shares. </p><p class=\"\">Shares of BlackBerry were up 4.5% in recent trading.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309023:0/",
            "pub_date": "2025-02-05 00:05:48",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "gurufocus:cb63fb7c6094b:0",
            "title": "Spotify Beats Q4 Estimates, Raises Forecasts as User Growth Accelerates",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Spotify  shares soared 9.82% to $603 as of 10:55 a.m. ET Tuesday after the company reported better-than-expected Q4 earnings and raised guidance for the current quarter.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Q4 Earnings &amp; Growth Highlights</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Net income: 367 million (1.76 per share) vs. 70 million loss (0.36 per share) YoY</li><li class=\"listItem-bmN0_SHH\">Total revenue: 4.24 billion (+16% YoY), beating consensus of 4.16 billion</li><li class=\"listItem-bmN0_SHH\">Total MAUs: 675 million (+12% YoY), exceeding Bloomberg estimate of 664.94 million</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 263 million (+11% YoY), above estimates of 259.99 million</li><li class=\"listItem-bmN0_SHH\">Average revenue per premium user: 4.85, up 5% YoY</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\">Upbeat Q1 2025 Guidance</strong></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Total MAUs: 678 million, surpassing Bloomberg's estimate of 677.71 million</li><li class=\"listItem-bmN0_SHH\">Revenue forecast: 4.2 billion, ahead of the 4.18 billion consensus</li><li class=\"listItem-bmN0_SHH\">Gross margin: 31.5% vs. 31.2% expected</li><li class=\"listItem-bmN0_SHH\">Premium subscribers: 265 million, exceeding expectations of 259.27 million</li><li class=\"listItem-bmN0_SHH\">Operating income: 548 million, beating analysts' projection of 460.1 million</li></ul><p class=\"\">Spotify's strong user and revenue growth boosted investor confidence, driving shares higher as the company continues expanding its premium subscriber base and improving profitability.</p></span></div>",
            "link": "https://www.tradingview.com/news/gurufocus:cb63fb7c6094b:0-spotify-beats-q4-estimates-raises-forecasts-as-user-growth-accelerates/",
            "pub_date": "2025-02-05 00:05:58",
            "source": "GuruFocus",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "barchart:12019ead6094b:0",
            "title": "Lean Hog Futures Prices Were Hit Hard by the U.S.-Mexico Trade Row. Will Hog Bulls Again Show Resilience?",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">April lean hog <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/quotes/HEJ25\" rel=\"nofollow\" target=\"_blank\">(HEJ25)</a> futures prices dropped the <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30746212/hogs-go-limit-down-as-tariff-fever-takes-hold\" rel=\"nofollow\" target=\"_blank\">daily permissible trading limit of $4.00</a> a hundredweight on Monday following weekend news that President Donald Trump’s administration was set to <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.barchart.com/story/news/30737606/trump-agrees-to-pause-tariffs-on-canada-and-mexico-after-they-pledge-to-boost-border-enforcement\" rel=\"nofollow\" target=\"_blank\">implement new tariffs</a> on its major trading partners, including Mexico. The specter of reduced U.S. pork shipments to Mexico, which accounts for over 25% of total U.S. pork exports, would likely lead to more abundant domestic pork supplies and drive hog prices lower in the coming months.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:877.9026217228464px;aspect-ratio:1.463171036204744\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-06c5d107d0b55e9aba6f43a673cbc03a-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\">Just last week, April lean hog futures hit a seven-week high of $92.75, which is just shy of the contract high of $93.60 scored in December of last year. However, last Friday, hog futures traders began to sense new trade tariffs on Mexico, Canada and China were not going to be avoided and prices dropped sharply. Then came Monday’s limit-down trading action. On Tuesday, lean hog futures have an expanded daily trading limit of $6.00</p><p class=\"\">On Monday morning, Trump and Mexican President Claudia Sheinbaum agreed to delay any new tariffs until March 1. However, the U.S. maintained its tariffs against China that took effect Tuesday. China, also a U.S. pork importer, immediately launched targeted tariffs in what is being called a controlled retaliation. China’s limited response to the U.S. duty of an additional 10% tariff on all Chinese imports underscores the attempt by Chinese officials to engage in talks that could avert an all-out U.S.-China trade war. China’s new tariffs against the U.S. will not take effect until Feb. 10, giving both parties time to try and reach a deal. Trump said he will speak with Chinese leader Xi Jinping in the next few days. </p><p class=\"\">Hog traders will continue to closely monitor the Trump trade tariff situation, which remains very fluid.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Hog Market Bulls Have Been Tough When the Going Gets Rough</strong></p><p class=\"\">The lean hog futures market bulls in recent months have shown keen price-rebounding resilience during significant price setbacks. Such could be the case again following what may turn out to be just a knee-jerk overreaction to the Trump tariff threats.</p><p class=\"\">On the positive fundamental side of the lean hog futures and cash hog (HEY00) markets, futures prices have been supported by continued strength in the CME Lean Hog Index. The latest CME index is up $0.29 to $83.77 as of Feb. 3. The cash index has gained $3.34 from the seasonal low scored on Jan. 9. Pork cutout (KMG25) value has also been climbing, despite cutout falling $0.94 to $93.81 on Monday amid the limit-down trade in hog futures.</p><p class=\"\">Last week’s U.S. hog slaughter was estimated at 2.574 million head, which is a 4.5% decline from last year at the same time. Combined with the week prior’s large year-over-year reduction in slaughter, it suggests that hog supplies are tighter than the USDA projected in its December quarterly hogs and pigs report. The agency at that time reported there were 75.8 million hogs and pigs on U.S. farms, up 1% from December 2023, but down slightly from Sept. 1, 2024.</p><p class=\"\">Seasonally, the hog market has had a pattern of price gains into mid- to late-February from annual lows in late December or early January. Also, the late Easter holiday this year may keep retailers and packing plants buying hams for Easter dinner through early March. </p><p class=\"\">The cash hog and futures markets are likely to be significantly influenced by price action in the cash cattle (GFY00) (LEY00) and futures markets in the coming weeks. Last week, live (LEJ25) and feeder cattle (GFH25) futures markets hit record highs, as did the weekly average cash cattle price. If the cattle markets have or are close to posting major peaks, retailers may decide to pass on to consumers their increased costs for wholesale beef. That could create better consumer-substitution demand for pork at the meat counter. This could buy the hog market bulls some more time until the grilling season begins in late spring and consumer demand for pork rises.<span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:887.1859296482412px;aspect-ratio:1.4786432160804022\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.webp\" type=\"images/webp\"/><img alt=\"\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/barchart:12019ead6094b-b999e7d295530ce0d83ac5acfa66cd1f-resized.jpeg\" style=\"background-color:#f8f8f8\"/></picture></div></figure></span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Trading Late This Week Likely Will be Extra Important</strong></p><p class=\"\">As of this writing Tuesday morning, April lean hog futures prices were posting a decent rebound from Monday’s limit-down trade. How the lean hog futures market closes on Friday (prices near the weekly high or near the weekly low) may be a good indicator for price-trending direction during the rest of February.</p><p class=\"\"><em>On the date of publication, Jim Wyckoff did not have (either directly or indirectly) positions in any of the securities mentioned in this article. All information and data in this article is solely for informational purposes. For more information please view the Barchart Disclosure Policyhere. </em></p><p class=\"\"> More news from Barchart </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Cattle and Hogs in Q4 and 2024 - Where are they Heading in 2025?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Protein Prices Heading as the Offseason for Demand Approaches?</li><li class=\"listItem-bmN0_SHH\">Where are Animal Proteins Prices Heading in Q3 and Beyond?</li><li class=\"listItem-bmN0_SHH\">Can the Meats Rally During the Peak Season in 2024?</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/barchart:12019ead6094b:0-lean-hog-futures-prices-were-hit-hard-by-the-u-s-mexico-trade-row-will-hog-bulls-again-show-resilience/",
            "pub_date": "2025-02-05 00:06:06",
            "source": "Barchart",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008298:0",
            "title": "United Airlines Is Maintained at Positive by Susquehanna",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(16:07 GMT) </strong>United Airlines Price Target Raised to $130.00/Share From $120.00 by Susquehanna</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008298:0/",
            "pub_date": "2025-02-05 00:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}