{
    "data": [
        {
            "id": "DJN_DN20260227011895:0",
            "title": "United and American Fight at Chicago's O'Hare Draws Federal Scrutiny — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Dean Seal</span></p><p class=\"\"><span>The Federal Aviation Administration is looking to cut flights this summer at Chicago's O'Hare International Airport, where United Airlines and American Airlines are currently duking it out for supremacy.</span></p><p class=\"\"><span>The agency said Friday it would hold a meeting next week to discuss flight restrictions that could ease potential overscheduling and flight delays at O'Hare, which ranks among the busiest airports in the U.S.</span></p><p class=\"\"><span>The prospect of cuts comes as United and American have been in a monthslong battle for gates and passengers.</span></p><p class=\"\"><span>United was allocated five additional gates at O'Hare last year and is planning to boost its daily departures there by more than 34% this summer. American added new destinations from O'Hare and is looking to increase its summer schedule by 10% from a year ago. The competition between carriers could result in lower fares for travelers, analysts have said.</span></p><p class=\"\"><span>But the FAA said the proposed flight plans during the coming summer season, which runs from March 29 to Oct. 25, could compromise the airport's operations.</span></p><p class=\"\"><span>O'Hare currently runs about 100 departures and 100 arrivals every hour, with about 2,800 total operations a day. The increases expected this summer would push that figure to nearly 3,100 on peak days, the agency said, citing data-provider Cirium.</span></p><p class=\"\"><span>\"The proposed increase is significant and would stress the runway, terminal and air traffic control systems at the airport,\" the FAA said in its federal register notice for the meeting.</span></p><p class=\"\"><span>American applauded the decision on Friday, saying in a statement that the FAA can now \"achieve an improved customer experience for passengers.\"</span></p><p class=\"\"><span>United said it appreciated the FAA and Transportation Department's leadership in convening the meeting and \"look[s] forward to a collaborative discussion.\"</span></p><p class=\"\"><span>The meeting is open to the Chicago Department of Aviation and all U.S. carriers, the FAA said.</span></p><p class=\"\"><span>Write to Dean Seal at dean.seal@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011895:0/",
            "pub_date": "2026-02-28 07:50:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:90fd26e72094b:0",
            "title": "Aardvark Therapeutics Becomes Next Pharma Player To Quit Prader-Willi Syndrome Drug Development Efforts",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Aardvark was studying the efficacy and safety of ARD-101 as a treatment for hyperphagia in patients with Prader-Willi Syndrome in the trial.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>In September, Acadia Pharmaceuticals scrapped development of intranasal Carbetocin after it failed to meet the key goals in a late-stage PWS trial.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Soleno Therapeutics’ VYKAT XR is the first approved treatment specifically for hyperphagia in PWS patients.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Aardvark Therapeutics (AARD) dived 53% after hours on Friday after the company announced that it is voluntarily pausing its late-stage trial in Prader-Willi Syndrome (PWS).</span></p><p class=\"\"><span>The company was studying the efficacy and safety of ARD-101 as a treatment for hyperphagia in patients with Prader-Willi Syndrome in the trial. Prader-Willi syndrome is a rare genetic neurodevelopmental disorder caused by an abnormality in the gene expression on chromosome 15, estimated to occur in one in every 15,000 live births. The disorder is defined by hyperphagia, an intense, persistent sensation of hunger, which could be life-threatening.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Why Is Aardvark Pausing Trial?</span></strong></p><p class=\"\"><span>The company said that the decision was based on certain cardiac observations made during routine safety monitoring in a healthy volunteer study. The company is reviewing the data to determine next steps, it said, while adding that it has also paused enrollment and dosing in the trial as it completes its evaluation.</span></p><p class=\"\"><span>The firm also added that it no longer expects data from the trail in the third quarter of 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Other Names To Quit PWS Drug Development</span></strong></p><p class=\"\"><span>In September, Acadia Pharmaceuticals </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/acadia-pharmaceuticals-investigational-drug-for-rare-genetic-disorder-fails-in-late-stage-study/chD1Gf0R33B\" rel=\"nofollow\" target=\"_blank\">scrapped</a><span> development of intranasal Carbetocin after it failed to meet the key goals in a late-stage PWS trial.</span></p><p class=\"\"><span>The company then said that intranasal Carbetocin did not demonstrate a statistically significant improvement over placebo to week 12 on the Hyperphagia Questionnaire for Clinical Trials and also announced its intent to stop investigating the drug further.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Soleno’s Approved Drug</span></strong></p><p class=\"\"><span>Soleno Therapeutics, meanwhile, received FDA approval of VYKAT XR in early 2025, making it the first approved treatment specifically for hyperphagia in PWS patients.</span></p><p class=\"\"><span>However, in August, Scorpion Capital revealed a short position against Soleno stock, alleging several risks associated with Vykat XR, including high risk of pre-diabetes/diabetes, pulmonary edema, and congestive heart failure. Scorpion Capital also stated that it intends to submit an emergency Citizen Petition shortly, requesting that the FDA urge Soleno to conduct a voluntary recall of Vykat XR from the market.</span></p><p class=\"\"><span>Weeks later, in September, the company </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/news-articles/markets/equity/soleno-therapeutics-stock-tanks-after-patient-treated-with-drug-dies/chwklo0RdHG\" rel=\"nofollow\" target=\"_blank\">stated</a><span> in a filing with the Securities and Exchange Commission that it is aware of a serious adverse event reported in the U.S. Food and Drug Administration’s (FDA) Adverse Event Reporting System (FAERS) involving a deceased patient. However, the existence of a report in the data does not establish causation, the company said.</span></p><p class=\"\"><span>Soleno said that its assessment of the death is the same as the treating physician, who said that the death is not related to the treatment with Vykat XR.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>On Stocktwits, retail sentiment around AARD rose from ‘bullish’ to ‘extremely bullish’ territory over the past 24 hours, while message volume increased from ‘low’ to ‘extremely high’ levels.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/AARD\" rel=\"nofollow\" target=\"_blank\">AARD stock</a><span> has dropped 7% over the past 12 months. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:90fd26e72094b:0/",
            "pub_date": "2026-02-28 07:52:27",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN311:0",
            "title": "Braemar Hotels & Resorts Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc </span><span> reported a quarterly adjusted loss of 63 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of -47 cents.  The lone analyst forecast for the quarter was for a loss of 51 cents per share. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue fell 4.5% to $165.56 million from a year ago; analysts expected $159.25 million. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc's reported EPS for the quarter was a loss of 67 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported a quarterly loss of $45.96 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Braemar Hotels &amp; Resorts Inc shares had risen by 7.0% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts was unchanged in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is no \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" The average consensus recommendation for the specialized reits peer group is  \"buy.\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Braemar Hotels &amp; Resorts Inc is $4.00, about 27.2% above its last closing price of $2.91</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 11:53 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>-0.02</span></p></td><td><p class=\"\"><span>-0.02</span></p></td><td><p class=\"\"><span>Met</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>-0.15</span></p></td><td><p class=\"\"><span>-0.19</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>0.11</span></p></td><td><p class=\"\"><span>0.09</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.36</span></p></td><td><p class=\"\"><span>0.40</span></p></td><td><p class=\"\"><span>Beat</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN311:0-braemar-hotels-resorts-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 07:53:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:eab81abf5094b:0",
            "title": "Wilton Resources Inc. Announces Grant of Stock Options",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - </span><strong class=\"root-Tkn6WL2y\"><span>Wilton Resources Inc. </span><span> (the \"Corporation\") </span></strong><span>announces that on February 27, 2026, the board of directors of the Corporation granted 1,223,805 stock options (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Options</span></strong><span>\") to purchase common shares in the capital of the Corporation (\"</span><strong class=\"root-Tkn6WL2y\"><span>Shares</span></strong><span>\") to certain directors, officers and consultants of the Corporation. The Options vest on the date of issuance and are exercisable for a period of five years from the date of grant at an exercise price of $0.30 per Share. Each grant of Options is subject to the approval of the TSX Venture Exchange. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Wilton Resources Inc.</span></strong></p><p class=\"\"><span>Richard Anderson</span></p><p class=\"\"><span>Chief Executive Officer</span></p><p class=\"\"><span>(403) 619 6609</span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:eab81abf5094b:0-wilton-resources-inc-announces-grant-of-stock-options/",
            "pub_date": "2026-02-28 07:54:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227010093:0",
            "title": "Trump Ends Federal Use of Anthropic's AI as Pentagon Labels It Security Risk — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Amrith Ramkumar</span></p><p class=\"\"><span>The federal government will stop working with the artificial intelligence company Anthropic, President Trump said, marking a dramatic escalation of the government's clash with the company over its AI models.</span></p><p class=\"\"><span>\"I am directing every federal agency in the United States government to immediately cease all use of Anthropic's technology. We don't need it, we don't want it and will not do business with them again!\" Trump said in a post on Truth Social.</span></p><p class=\"\"><span>The Department of Defense and other agencies using Anthropic's Claude models will have a six-month phaseout period, he said, adding that there would be civil and criminal consequences if the company isn't helpful during the transition.</span></p><p class=\"\"><span>The move comes shortly before a 5:01 p.m. deadline for Anthropic to let the military use its models in all lawful use cases, a concession the company has refused to make.</span></p><p class=\"\"><span>Trump and administration officials have attacked the company for being too \"woke,\" taking exception to its push for AI regulations and its links to organizations that are big Democratic donors.</span></p><p class=\"\"><span>Anthropic didn't immediately respond to a request for comment. The company said Thursday it wouldn't meet the Pentagon's conditions but was \"ready to continue our work to support the national security of the United States.\"</span></p><p class=\"\"><span>Trump's announcement appears to indicate that the administration is canceling Anthropic's contract with the Pentagon, which is worth up to $200 million. The company had sought to have protections written into the deal against the use of its models for autonomous weapons and mass domestic surveillance. The military has said it should have final authority to decide how the technology can be used within the law.</span></p><p class=\"\"><span>Pentagon officials had threatened to invoke the Defense Production Act to force Anthropic to comply and to label it a supply-chain risk, impairing its ability to work with other government contractors.</span></p><p class=\"\"><span>Broadening the clash to include all federal agencies takes the Anthropic fight to a much larger scale than its spat with the Pentagon. The company's Claude models are being used across the government to do everything from summarize documents to analyze data. Pausing those functions to swap in alternatives could set back the government's AI and modernization efforts, AI experts have said.</span></p><p class=\"\"><span>Pentagon officials have criticized Anthropic leaders including Chief Executive Dario Amodei for seeking control over the military's operations. After Claude was used in the Venezuela raid to capture former President Nicolás Maduro, an Anthropic employee asked a counterpart at data-mining firm Palantir, its partner, about how the technology was used. Defense Department officials learned about the exchange and viewed it as a challenge to the department's prerogative to have final say in operational matters.</span></p><p class=\"\"><span>\"The administration had legitimate principled concerns about the ability of private actors to project control over its use of technology,\" said Dean Ball, a former Trump administration AI adviser who is now a senior fellow at the Foundation for American Innovation think tank.</span></p><p class=\"\"><span>Anthropic has said the Palantir question was part of routine technical discussion between partners.</span></p><p class=\"\"><span>In a Tuesday meeting with Amodei at the Pentagon, Defense Secretary Pete Hegseth threatened to use emergency powers to get Anthropic to do what the military wants, an approach that some AI analysts said could have a chilling effect on other partnerships.</span></p><p class=\"\"><span>Ball said that if the military is only canceling the contract, the administration's approach strikes the right balance.</span></p><p class=\"\"><span>Trump's moves come as other AI companies grapple with their own red lines. OpenAI Chief Executive Sam Altman  told staff Thursday that the company was working with the Defense Department to see if its models could be used in classified settings while maintaining the same safety guardrails Anthropic has, The Wall Street Journal reported. Employees at Google and OpenAI signed an online petition urging their companies to maintain the same red lines.</span></p><p class=\"\"><span>Elon Musk's xAI is currently the only AI company besides Anthropic with approval to be used in classified settings, but government agencies have raised concerns about its reliability and how quickly it can be substituted after Claude was embedded in the Pentagon for many months.</span></p><p class=\"\"><span>The Trump administration and Anthropic have been feuding since the start of Trump's second term. The company hired several top Biden administration officials, proposed AI regulations and guardrails and criticized the president for exporting AI chips to China, actions that upset administration officials including David Sacks, the White House AI czar.</span></p><p class=\"\"><span>Last summer, the administration put out an executive order on \"woke AI,\" saying the government had an \"obligation not to procure models that sacrifice truthfulness and accuracy to ideological agendas.\" Anthropic was widely seen as a target of the order. The company has said it isn't woke or political and previously called such attacks baseless.</span></p><p class=\"\"><span>The Pentagon has said it didn't want to use Claude for autonomous weapons, mass surveillance or other illegal uses, but that it needs to have full control over the technology it deploys.</span></p><p class=\"\"><span>Write to Amrith Ramkumar at amrith.ramkumar@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227010093:0/",
            "pub_date": "2026-02-28 07:55:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_Tnw8DS7nS:0",
            "title": "Giant Mining Corp. Engages Big Sky Exploration for Up to 10,000 Feet of Multi-Phase 2026 Drilling at Majuba Hill, Nevada",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>(TheNewswire)</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"></ul></ul><p class=\"\"><span>VANCOUVER, BC — February 27, 2026– TheNewswire — Giant Mining Corp. (CSE: BFG | OTC:BFGFF | FWB: YW5 | CSE: BFG.WT.A | CSE: BFG.WT.B.) (“Giant Mining”or the “Company”) is pleased to announce ithas engaged Big Sky Exploration, LLC (“Big Sky”) forits 2026 Maiden Core diamond drilling program (the “Core Program”)at the Majuba Hill Copper Deposit (“Majuba Hill”), acopper, silver, and gold project in Pershing County, Nevada. </span></p><p class=\"\"><span>Big Sky, which operates throughout the western UnitedStates, provided high-quality core drilling services at Majuba Hill in2024 and 2025. The Company has made the requiredadvance payment to ensure a timely start for thePhase 1 Core Program.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure1: Big Sky Drilling</span><br/><span>Equipment on Site during 2025 drill campaign</span><br/></p><p class=\"\"><br/><span>“We are pleased to secure the</span><br/><span>services of Big Sky Exploration, whose experienced crews have</span><br/><span>demonstrated safe, efficient, and cost-effective drilling performance</span><br/><span>at Majuba Hill,” said David Greenway, President &amp; CEO of Giant</span><br/><span>Mining Corp. “With a refined geological model, secured funding, and</span><br/><span>a clearly defined drill strategy, we are positioned to advance</span><br/><span>systematic exploration at our Nevada copper project. Majuba Hill is a</span><br/><span>U.S.-based copper and critical metals project aligned with the White</span><br/><span>House’s focus on strengthening domestic critical mineral supply</span><br/><span>chains and enhancing U.S. resource security. Our team is focused on</span><br/><span>disciplined execution of the 2026 drill program as we continue to</span><br/><span>evaluate the broader potential of the system.”</span><br/></p><p class=\"\"><br/><span>As previously announced on January</span><br/><span>30th,</span><br/><span>2026, the Company has planned an upto 10,000 feet (3,048 meters) of drilling in a multi phased diamonddrill program.</span></p><p class=\"\"><span>The multi phased drilling and exploration Program isanticipated to include</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phase 1 – Up to 5,000 feet (1,524 meters) core drillprogram </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Underground mapping and sampling </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Additional Surface Sampling for additional follow updrill targeting </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Phase 2 – Up to 5,000 feet (1,524 meters) core drillprogram </span></p></li></ul><p class=\"\"><span>The drilling and exploration program will be guided bymore than 100 previous drill holes totaling over 89,000 feet ofdrilling and will include input from RESPEC Engineering. Reviews ofthe 2024–2025 exploration results, including drilling, surfacegeological mapping, and geochemical sampling, have identified numerousmineralized breccia bodies (See NR dated January 16,</span><br/><span>2024). Drillintercepts returned elevated copper and silver values, as well asintervals of anomalous gold. Mineralization is commonly associatedwith hydrothermal-magmatic tourmaline matrix breccias and the marginsof breccia pipes. Further drilling is required to determine the extentand continuity of mineralization.</span></p><p class=\"\"><span>Alignment With U.S. Domestic SupplyObjectives</span></p><p class=\"\"><span>Majuba Hill is in the exploration stage, and theCompany believes that the discovery-driven, staged exploration, anddrilling programs provide a technically sound framework for advancingthe project which is aligned with U.S. critical-mineralpriorities.</span></p><p class=\"\"><span>Click Image To View Full Size</span></p><p class=\"\"><span>Figure2: Majuba Hill Phase 1</span><br/><span>Drill Target Areas </span><br/></p><p class=\"\"><br/><span>Quality Assurance/Quality Control</span><br/><span>(“QA/QC”) </span><br/></p><p class=\"\"><br/><span>Historical drilling results referenced herein were</span><br/><span>previously disclosed by the Company in accordance with National</span><br/><span>Instrument 43-101 – Standards of Disclosure for Mineral Projects.</span><br/><span>Analytical work was performed by ALS USA Inc. (\"ALS\"), an</span><br/><span>ISO/IEC 17025 accredited prep laboratory located in Elko, Nevada.</span><br/><span>Industry standard quality assurance and quality control (QA/QC)</span><br/><span>procedures included the insertion of certified reference materials,</span><br/><span>blanks, and duplicates at regular intervals within the sample stream.</span><br/><span>The Qualified Person has reviewed and verified the data underlying the</span><br/><span>historical results referenced in this release.</span><br/></p><p class=\"\"><br/><span>Qualified Person</span><br/></p><p class=\"\"><br/><span>The scientific and technical information contained in</span><br/><span>this news release has been reviewed and approved by E.L. “Buster”</span><br/><span>Hunsaker III, CPG 8137, a non-independent consulting geologist who is</span><br/><span>a “Qualified Person” as such term is defined under National Instrument 43-101 – Standards</span><br/><span>of Disclosure for Mineral Projects (“NI</span><br/><span>43-101”).</span><br/></p><p class=\"\"><br/><span>Majuba Hill’s critically important</span><br/><span>characteristics are as follows:</span><br/></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Location:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Nevada, USA — a globally top-ranked miningjurisdiction, ranked #1 in the Fraser Institute’s 2022 Annual Surveyof Mining Companies.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Project Size:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>9,684 Acres</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Infrastructure:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The Majuba Hill property is located 113 road kilometers(70 miles) southwest of Winnemucca, Nevada, and 251 kilometers (156miles) northeast of Reno. It is accessible via well-maintained countyroads from the Imlay, Nevada exit on U.S. Interstate 80, followed by a23-mile drive west. People, roads, power, and water are fundamentalconsiderations for infrastructure, and Majuba Hill already benefitsfrom a strong foundation in all these areas. This existinginfrastructure provides a significant advantage, offering substantialcost savings compared to more remote projects.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>History:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Historical Producer</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Drilling:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Approximately 89,395 feet of drilling to date. Roughreplacement value of drilling USD $12.1 Million using currentcosts.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Mineralization:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The project shows indications of a potentially large Cu– Ag +/- Au mineralized body with many features in common with bothlarge porphyry copper, silver, and gold projects; however, furtherdrilling is required to determine the extent and grade ofmineralization.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Expandability:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The IP survey, deep drilling, and step-out drillingindicate significant expansion potential, with mineralization open inall directions.</span></p></td></tr><tr><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>Fully Financed:</span></p></td><td colspan=\"1\" rowspan=\"1\"><p class=\"\"><span>The Company has secured funding for its next phase ofdrilling at Majuba Hill.</span></p></td></tr></tbody></table></div><p class=\"\"><br/><span>About Giant Mining Corp.</span><br/></p><p class=\"\"><br/><span>Giant Mining is focused on identifying, acquiring, and</span><br/><span>advancing late-stage copper and copper/silver/gold projects to meet</span><br/><span>the growing global demand for critical metals. This demand is driven</span><br/><span>by initiatives like the Green New Deal in the United States and</span><br/><span>similar climate-focused programs worldwide, which require substantial</span><br/><span>amounts of copper, silver, and gold for electric vehicles, renewable</span><br/><span>energy infrastructure, and the modernization of clean and affordable</span><br/><span>energy systems.</span><br/></p><p class=\"\"><br/><span>The Company’s flagship asset is the Majuba Hill</span><br/><span>Copper, Silver, and Gold District, located 156 miles (251 km) from</span><br/><span>Reno, Nevada. Majuba Hill benefits from a mining-friendly regulatory</span><br/><span>environment and strong local infrastructure. While still an</span><br/><span>exploration-stage asset, the geological footprint and scale of</span><br/><span>mineralization indicate that further work is clearly justified and</span><br/><span>that the system may host significant copper potential. </span><br/></p><p class=\"\"><br/><span>With a strengthened technical framework, supportive</span><br/><span>jurisdiction, and funded exploration program, Giant Mining is focused</span><br/><span>on advancing Majuba Hill through systematic drilling and technical</span><br/><span>evaluation. The Company remains committed to responsible exploration,</span><br/><span>technical transparency, and creating long-term shareholder value</span><br/><span>through discovery-focused exploration.</span><br/></p><p class=\"\"><br/><span>Neither the Canadian Securities</span><br/><span>Exchange nor its Market Regulator (as that term is defined in the</span><br/><span>policies of the Canadian Securities Exchange) accepts responsibility</span><br/><span>for the adequacy or accuracy of this release.</span><br/></p><p class=\"\"><span>Click Image To View Full Size </span></p><p class=\"\"><span>On Behalf of the Board of Giant Mining Corp.</span></p><p class=\"\"><span>“David Greenway”</span></p><p class=\"\"><span>David C. Greenway </span></p><p class=\"\"><span>President &amp; CEO</span></p><p class=\"\"><span>For further information, please contact:</span></p><p class=\"\"><span>E: info@giantminingcorp.com</span></p><p class=\"\"><span>P: 1 (236) 788-0643</span></p><p class=\"\"><span>VISIT OUR WEBSITE FOR MORE DETAILS</span></p><p class=\"\"><span>www.giantminingcorp.com</span></p><p class=\"\"><span>LIKE AND FOLLOW</span></p><p class=\"\"><span>Instagram, Facebook, Twitter, LinkedIn</span></p><p class=\"\"><br/><span>DOWNLOAD INVESTOR INFORMATION</span><br/></p><p class=\"\"><br/><span>Click Here</span><br/></p><p class=\"\"><br/><span>Forward-Looking Statements</span><br/></p><p class=\"\"><br/><span>This news release contains</span><br/><span>forward-looking information, including but not limited to statements</span><br/><span>regarding planned exploration activities and anticipated</span><br/><span>outcomes.</span><br/></p><p class=\"\"><br/><span>This news release contains certain</span><br/><span>forward‐looking information. Such information</span><br/><span>involves known and unknown risks, uncertainties and other factors that</span><br/><span>may cause actual results, performance or achievements to be materially</span><br/><span>different from those implied by statements herein, and therefore these</span><br/><span>statements should not be read as guarantees of future performance or</span><br/><span>results. All forward‐looking statements are</span><br/><span>based on the Company’s current beliefs as well as assumptions made</span><br/><span>by and information currently available to it as well as other factors.</span><br/><span>Readers are cautioned not to place undue reliance on these</span><br/><span>forward‐looking statements, which speak only as of</span><br/><span>the date of this press release. Due to risks and uncertainties,</span><br/><span>including the risks and uncertainties identified by the Company in its</span><br/><span>public securities filings, actual events may differ materially from</span><br/><span>current expectations. These statements involve known and unknown</span><br/><span>risks, including exploration, metallurgical, permitting,</span><br/><span>environmental, commodity price, and market risks. The Company</span><br/><span>disclaims any intention or obligation to update or revise any</span><br/><span>forward‐looking statements, whether as a result of</span><br/><span>new information, future events or otherwise.</span><br/></p><p class=\"\"><br/><span>###</span><br/></p><p class=\"\"><span>Copyright (c) 2026 TheNewswire - All rights reserved.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_Tnw8DS7nS:0-giant-mining-corp-engages-big-sky-exploration-for-up-to-10-000-feet-of-multi-phase-2026-drilling-at-majuba-hill-nevada/",
            "pub_date": "2026-02-28 07:55:03",
            "source": "The newswire.ca",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:a79701387094b:0",
            "title": "Delivra Health and Its Brands LivRelief (TM) and Dream Water (TM) Report Results for Second Quarter of Fiscal 2026",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><em><span>Year to date sales growth of Dream Water® E-commerce of 26% offset by a decline of Dream Water® Retail of 4% compared to same period last year</span></em></p><p class=\"\"><em><span>Year to date sales growth of LivRelief™ E-commerce of 28 % offset by a decline in LivRelief™ Retail of 29% compared to same period last year</span></em></p><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Delivra Health Brands Inc. </span><span> (OTCQB: DHBUF) (\"</span><strong class=\"root-Tkn6WL2y\"><span>Delivra Health</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\"), a consumer packaged goods company uniquely positioned in the health and wellness sector, is pleased to announce its financial and operating results for the three and six months ended December 31, 2025 (\"</span><strong class=\"root-Tkn6WL2y\"><span>Q2 2026</span></strong><span>\"). The Delivra Health portfolio features innovative brands Dream Water® and LivRelief™, which deliver relief from common health issues such as sleeplessness, chronic pain and anxiety.</span></p><p class=\"\"><span>During the first half of fiscal 2026, the Company has seen encouraging momentum in its targeted e-commerce strategy and continued growth within the Dream Water® brand. Year-to-date e-commerce sales increased 26% for Dream Water® and 28% for LivRelief™, reflecting strong consumer engagement and repeat purchasing behavior. At the same time, overall revenue has been impacted by temporary shifts in customer ordering patterns across certain retail markets, along with the transition of our licensed LivRelief™ Infused distribution channel. While these factors have created near-term variability in reported results, underlying consumer demand for the Company's core brands remains solid, and management is actively addressing fluctuations in distribution timing and engaging in channel optimization to stabilize and accelerate growth in the second half of fiscal 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Management Commentary</span></strong></p><p class=\"\"><span>\"While our results this quarter reflect temporary timing variability in certain retail markets, we are encouraged by the strength of our core business fundamentals. Our targeted e-commerce strategy continues to deliver measurable growth, our U.S. expansion remains a key driver, and consumer demand for both Dream Water® and LivRelief™ continues to develop,\" said Gord Davey, President and Chief Executive Officer of Delivra Health Brands Inc. \"We are focused on disciplined execution — strengthening distribution, optimizing customer mix, advancing innovation, and investing in scalable revenue channels. As we move through the second half of fiscal 2026, our priority remains clear: stabilize retail ordering patterns, reignite growth in licensed markets, and continue expanding high-margin direct-to-consumer and U.S. retail opportunities. We believe these initiatives position us well to return to consistent revenue growth while maintaining financial responsibility.\"</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights for the Three Months Ended December 31, 2025</span></strong></p><p class=\"\"><em><span>(</span><strong class=\"root-Tkn6WL2y\"><span>Expressed in thousands of Canadian dollars, except share and per share amounts)</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net revenue:</span></strong><span> In the three months ended December 31, 2025, the Company reported total net revenue of $2,433 as compared to $2,754 in same period last year, representing approximately a $321 or 12% decrease. This net decrease was primarily due to lower sales of Dream Water® in the U.S. and Canada by $183, lower sales of LivRelief™ OTC by $93 impacted by the timing of customer ordering patterns and partially, offset by growing ecommerce LivRelief™ OTC sales, and finally lower sales of LivRelief™ Infused topical creams by $45 due to the transition to a new licensed distribution partner. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross profit and gross profit margin:</span></strong><span> In the three months ended December 31, 2025, the Company reported gross profit of $972 and a gross profit margin of 40% as compared to $1,294 and 47% in the same period last year. The decrease in gross profit is driven by lower revenue and higher product cost due to price increases by certain vendors and the reduction in gross profit margin was the result of a different product and customer mix in this quarter compared to same quarter last year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</span></strong><span>: In the three months ended December 31, 2025, the Company reported expenses of $1,391 as compared to $1,544 in the same period last year, representing a $153 or 10% decrease. The decrease was mainly driven by lower investments in marketing campaigns and digital marketing programs of $182 or 32%, offset by a slight increase in general and administrative costs of $29 or 3% mainly driven by increased investments in investor relation programs. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> In the three months ended December 31, 2025, the Company reported Adjusted EBITDA of $(369) as compared to $(194) in the same period last year. This reduction in Adjusted EBITDA is the result of lower sales volume and gross profit as explained above. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Financial Highlights for the Six Months Ended December 31, 2025</span></strong></p><p class=\"\"><em><span>(</span><strong class=\"root-Tkn6WL2y\"><span>Expressed in thousands of Canadian dollars, except share and per share amounts)</span></strong></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Net revenue:</span></strong><span> In the six months ended December 31, 2025, the Company reported total net revenue of $5,640 compared to $5,917 in same period last year, representing a $277 or 5% decrease. This decrease was due to higher sales of Dream Water® in the U.S and Canada by $29 offset by lower sales of LivRelief™ OTC of $61 impacted by the timing of customer ordering patterns and finally lower sales of $245 of LivRelief™ Infused topical creams due to the transition to a new distribution channel in Canada. These declines were partially offset by increased e-commerce sales of LivRelief™ OTC by 28% and Dream Water® products in Canada and USA by 26% driven by strong consumer demand and online marketing. The Company is currently reviewing its market distribution strategy for licensed LivRelief™ Infused products and intends to resume its growth strategy in the second half of fiscal 2026 and fiscal 2027.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gross profit and gross profit margin:</span></strong><span> In the six months ended December 31, 2025, the Company reported year-to-date gross profit of $2,473 and a gross profit margin of 44% as compared to $2,891 and 49% in same period last year. The reduction in gross profit and gross profit margin was the result of a change in customer mix and product cost and mix. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses including selling, general and administrative (\"SG&amp;A\") expenses and excluding non-cash items</span></strong><span>: In the six months ended December 31, 2025, the Company reported expenses of $2,838 compared to $3,149 in the same period last year, representing a 10% decrease. Prior year fiscal 2025 first half sales and marketing expenses were higher than the first half of fiscal 2026 sales and marketing expenses by $426 or 34% given that the Company released in November 2024 two major marketing campaigns, 'Shush Your Mind' for Dream Water® and 'Quiets Chronic Pain' for LivRelief™. General and administrative costs were higher in the first half of fiscal 2026 compared with same period last year by $115 or 6% mainly as a result of higher investor relation programs and higher professional and consulting services offset by lower salaries costs. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span>:</span></strong><span> In the six months ended December 31, 2025, the Company reported Adjusted EBITDA of $(313) compared to $(176) in the same period last year, representing a $(137) year-over-year reduction. This reduction in Adjusted EBITDA was mainly driven by lower sales volume and lower gross profit as discussed above. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Summary of Key Financial Results </span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>Continued operations:</span></td><td><strong class=\"root-Tkn6WL2y\"><span>$</span></strong></td><td><span>$</span></td><td><strong class=\"root-Tkn6WL2y\"><span>$</span></strong></td><td><span>$</span></td></tr><tr><td><span>Net revenue</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,433 </span></strong></td><td><span> 2,754 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 5,640 </span></strong></td><td><span> 5,917 </span></td></tr><tr><td><span>Cost of sales</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 1,411 </span></strong></td><td><span> 1,404 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 3,115 </span></strong></td><td><span> 2,944 </span></td></tr><tr><td><span>Inventory write-down</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 50 </span></strong></td><td><span> 56 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 52 </span></strong></td><td><span> 82 </span></td></tr><tr><td><span>Gross profit</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 972 </span></strong></td><td><span> 1,294 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,473 </span></strong></td><td><span> 2,891 </span></td></tr><tr><td><span>Expenses excluding non-cash expenses</span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,391</span></strong></td><td><span>1,544</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,838</span></strong></td><td><span>3,149</span></td></tr><tr><td><span>Depreciation and amortization and share based compensation</span></td><td><strong class=\"root-Tkn6WL2y\"><span>31</span></strong></td><td><span>397</span></td><td><strong class=\"root-Tkn6WL2y\"><span>107</span></strong></td><td><span>794</span></td></tr><tr><td><span>Total expenses</span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,422 </span></strong></td><td><span>1,941 </span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,945</span></strong></td><td><span>3,943 </span></td></tr><tr><td><span>Loss from operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (450)</span></strong></td><td><span> (647)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (472)</span></strong></td><td><span> (1,052)</span></td></tr><tr><td><span>Other (expense) income</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 39</span></strong></td><td><span> (165)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (30) </span></strong></td><td><span> (236) </span></td></tr><tr><td><span>Net gain (loss) from continued operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (411)</span></strong></td><td><span> (812)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (502)</span></strong></td><td><span> (1,288)</span></td></tr><tr><td><span>Net gain (loss) per share - basic </span></td><td><strong class=\"root-Tkn6WL2y\"><span>(0.01)</span></strong></td><td><span>(0.03)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>(0.02)</span></strong></td><td><span>(0.04)</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Adjusted EBITDA</span></strong><strong class=\"root-Tkn6WL2y\"><span>(1)</span></strong><strong class=\"root-Tkn6WL2y\"><span> (non-IFRS measure) </span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>Loss from operations</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (450)</span></strong></td><td><span> (647)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (472)</span></strong></td><td><span> (1,052)</span></td></tr><tr><td><span>Inventory write-down</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 50 </span></strong></td><td><span> 56 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 52 </span></strong></td><td><span> 82 </span></td></tr><tr><td><span>Depreciation and amortization</span></td><td><span> - </span></td><td><span> 326 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 27 </span></strong></td><td><span> 652 </span></td></tr><tr><td><span>Share-based compensation</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 31 </span></strong></td><td><span> 71 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 80 </span></strong></td><td><span> 142 </span></td></tr><tr><td><span>Adjusted EBITDA(1)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (369)</span></strong></td><td><span> (194)</span></td><td><strong class=\"root-Tkn6WL2y\"><span> (313)</span></strong></td><td><span> (176)</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Expenses excluding non-cash items</span></strong></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the three months endedDecember 31</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>For the six months endedDecember 31</span></strong></td></tr><tr><td><span>($000's, except share and per share amounts)</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2025</span></strong></td><td><span>2024</span></td></tr><tr><td><span>General and administration</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 998 </span></strong></td><td><span> 969 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 2,026 </span></strong></td><td><span> 1,911 </span></td></tr><tr><td><span>Sales and marketing</span></td><td><strong class=\"root-Tkn6WL2y\"><span> 393 </span></strong></td><td><span> 575 </span></td><td><strong class=\"root-Tkn6WL2y\"><span> 812 </span></strong></td><td><span> 1,238 </span></td></tr><tr><td><span>Total </span></td><td><strong class=\"root-Tkn6WL2y\"><span>1,391</span></strong></td><td><span>1,544</span></td><td><strong class=\"root-Tkn6WL2y\"><span>2,838</span></strong></td><td><span>3,149</span></td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Delivra Health Brands Inc.</span></strong></p><p class=\"\"><span>Helping people take control of their health with alternative wellness solutions is what energizes the Delivra Health team! The Delivra Health portfolio features innovative brands like Dream Water® and LivRelief™, which deliver relief from common everyday issues like chronic pain, anxiety, and sleeplessness. Delivra Health products have allowed millions of customers to reclaim their mobility, energy, and in turn, quality of life. The websites of the Company's two subsidiaries are </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/MqygRTqvYB\" rel=\"nofollow\" target=\"_blank\">Dream Water®</a><span> and </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/bg1L0c1gwy\" rel=\"nofollow\" target=\"_blank\">LivRelief</a><span>TM. For more information, please visit </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/3KkALce4M0\" rel=\"nofollow\" target=\"_blank\">www.delivrahealthbrands.com</a><span>. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Non-IFRS Measures, Reconciliation and Discussion</span></strong></p><p class=\"\"><span>This press release contains references to \"Adjusted EBITDA\" which is a non-International Financial Reporting Standards (\"</span><strong class=\"root-Tkn6WL2y\"><span>IFRS</span></strong><span>\") financial measure. Adjusted EBITDA is a measure of the Company's loss from operations before interest, taxes, depreciation, and amortization and adjusted for share-based compensation, common shares issued for services, fair value effects of accounting for biological assets and inventories, asset impairment and write-downs, and other non-cash items, and is a non-IFRS measure.</span></p><p class=\"\"><span>This measure can be used to analyze and compare profitability among companies and industries, as it eliminates the effects of financing and capital expenditures. It is often used in valuation ratios and can be compared to enterprise value and revenue. This measure does not have any standardized meaning according to IFRS and, therefore, may not be comparable to similar measures presented by other companies.</span></p><p class=\"\"><span>There are no comparable IFRS financial measures presented in Delivra Health's financial statements. Reconciliations of the supplemental non-IFRS measure are presented in the Company's management discussion and analysis for the three and six months ended December 31, 2025 (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Q2 2026 MD&amp;A</span></strong><span>\"). This non-IFRS financial measure is presented because management has evaluated the financial results both including and excluding the adjusted items and believes that the non-IFRS financial measure presented provides additional perspective and insights when analyzing the core operating performance of the business. The Company believes that the supplemental measure provides information which is useful to shareholders and investors in understanding the Company's performance and may assist in the evaluation of the Company's business relative to that of its peers.</span></p><p class=\"\"><span>The non-IFRS financial measure should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with the IFRS financial measures presented in the Company's financial statements. For more information, please see \"Adjusted EBITDA (non-IFRS measure)\" and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A, which is available under the Company's SEDAR+ profile on www.sedarplus.ca.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Notes:</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>This is a non-IFRS reporting measure. For a reconciliation of this measure to the nearest IFRS measure, see \"Adjusted EBITDA (non-IFRS measure)\" and \"Non-IFRS Measures\" in the Q2 2026 MD&amp;A.</span></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Cautionary Note Regarding Forward-Looking Statements</span></strong></p><p class=\"\"><span>This news release contains \"forward-looking information\" and \"forward-looking statements\" (collectively, \"forward-looking statements\") within the meaning of the applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates, and projections as at the date of this news release. Any statement that involves discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often but not always using phrases such as \"expects\", or \"does not expect\", \"is expected\", \"anticipates\" or \"does not anticipate\", \"plans\", \"budget\", \"scheduled\", \"forecasts\", \"estimates\", \"believes\" or \"intends\" or variations of such words and phrases or stating that certain actions, events or results \"may\" or \"could\", \"would\", \"might\" or \"will\" be taken to occur or be achieved) are not statements of historical fact and may be forward-looking statements. In this news release, forward-looking statements include, among other things, statements with respect to the Company's products offering relief from chronic pain, anxiety, and sleeplessness, impacts of the Company's latest marketing campaigns, expectations regarding expansion opportunities including the Company's U.S. expansion, ongoing consumer demand for the Company's products, stabilization of retail ordering patterns, expectations regarding increases in the Company's revenues and profitability, increases in consumer demand, the Company's ability to expand high-margin direct-to-consumer and U.S. retail opportunities, and the Company's growth objectives and strategy, growth in new markets, and new distribution channels.</span></p><p class=\"\"><span>These forward-looking statements are based on reasonable assumptions and estimates of management of the Company at the time such statements were made. Actual future results may differ materially as forward-looking statements involve known and unknown risks, uncertainties, and other factors which may cause the actual results, performance, or achievements of the Company to materially differ from any future results, performance, or achievements expressed or implied by such forward-looking statements. Such factors, among other things, include: fluctuations in general macroeconomic conditions; fluctuations in securities markets; expectations regarding the size of the cannabis markets where the Company operates; changing consumer habits; the ability of the Company to successfully achieve its business objectives; plans for expansion; political and social uncertainties; inability to obtain adequate insurance to cover risks and hazards; employee relations and the presence of laws and regulations that may impose restrictions on cultivation, production, distribution, and sale of cannabis and cannabis-related products in the markets where the Company operates. Although the forward-looking statements contained in this news release are based upon what management of the Company believes, or believed at the time, to be reasonable assumptions, the Company cannot assure shareholders that actual results will be consistent with such forward-looking statements, as there may be other factors that cause results not to be as anticipated, estimated or intended. Readers should not place undue reliance on the forward-looking statements and information contained in this news release. The Company assumes no obligation to update the forward-looking statements of beliefs, opinions, projections, or other factors, should they change, except as required by law.</span></p><p class=\"\"><span>Additional information regarding this and other risks and uncertainties relating to the Company's business are contained under the heading \"Risk Factors\" in the Company's annual information form dated March 2, 2021, and under the heading \"Risks and Uncertainties\" in the Q2 2026 MD&amp;A filed under the Company's profile on SEDAR+ at www.sedarplus.ca.</span></p><p class=\"\"><em><span>Neither TSX-V nor its Regulation Services Provider (as that term is defined in the policies of the TSX-V) accept responsibility for the adequacy or accuracy of this release.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Investor Relations:</span></strong></p><p class=\"\"><span>Jack Tasse</span></p><p class=\"\"><span>Chief Financial Officer</span></p><p class=\"\"><span>IR@delivrahealth.com</span></p><p class=\"\"><span>1-877-915-7934</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:a79701387094b:0-delivra-health-and-its-brands-livrelief-tm-and-dream-water-tm-report-results-for-second-quarter-of-fiscal-2026/",
            "pub_date": "2026-02-28 07:45:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2948080:0",
            "title": "ZOMDF: Profitability targeted for 2027, with strong R&D and product innovation fueling growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>R&amp;D and product innovation remain central, with TRUFORMA, VetGuardian, and TRUVIEW platforms driving growth and market expansion. Financial performance is improving, with profitability targeted for 2027 and breakeven possible by end of 2026. Human health entry will focus on partnerships and contract manufacturing.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2948080:0-zomdf-profitability-targeted-for-2027-with-strong-r-d-and-product-innovation-fueling-growth/",
            "pub_date": "2026-02-28 07:45:43",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011891:0",
            "title": "Netflix Walks Away a Winner After Losing Warner Bros. to Paramount — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>The big winner from the battle for Warner Bros. Discovery was the loser, Netflix, which bowed out after Paramount Skydance submitted a higher bid for the media company.</span></p><p class=\"\"><span>Other competitors, like Comcast, could be winners, too, amid further media consolidation.</span></p><p class=\"\"><span>Paramount is paying a stiff price, and its winning bid may turn out to be a Pyrrhic victory. It offered $31 a share in cash for Warner Bros., a deal that values the company's equity at $81 billion plus about $29 billion of assumed net debt.</span></p><p class=\"\"><span>Netflix shares rose 22%, to $96, this past week as investors expressed relief that the company wouldn't go forward with its richly priced offer for Warner Bros.' movie studio and streaming assets, including HBO. The acquisition would have saddled Netflix with over $50 billion of new debt and changed what had been a winning, organic, growth-focused narrative around the stock.</span></p><p class=\"\"><span>There could be more upside in Netflix stock, given that it traded at $103 before it reached a surprise deal for Warner Bros. on Dec. 5. One of the positives for Netflix is that it will pocket a $2.8 billion breakup fee.</span></p><p class=\"\"><span>\"Back to Simply Dominating\" was the title of Wolfe Research analyst Peter Supino's note on Thursday after Netflix decided not to match the Paramount offer. Supino lifted his price target to $110 from $95.</span></p><p class=\"\"><span>Netflix, trading for about 30 times projected 2026 earnings, isn't a bargain, but profits per share are expected to rise at a 20% clip in the coming years.</span></p><p class=\"\"><span>Looking at other affected stocks, investors may want to steer clear of what will be a heavily leveraged Paramount and take a hard look at Comcast, the cable industry leader that owns NBCUniversal.</span></p><p class=\"\"><span>Comcast wasn't involved in the Warner Bros. battle, but it could take part in the next round of media consolidation or an alternative transaction.</span></p><p class=\"\"><span>There has been pressure on Comcast CEO and controlling shareholder Brian Roberts to dismantle NBCUniversal after its spinoff of some cable properties, including CNBC and MSNOW (formerly MSNBC), into Versant Media in early January. Now that Netflix has passed on Warner Bros., it could consider buying NBCU assets such as the Universal movie studio or the Peacock streaming service.</span></p><p class=\"\"><span>LightShed Partners analyst Rich Greenfield told CNBC on Friday morning that investors were barraging him with emails about the Comcast scenario after Netflix declined to match the Paramount offer late on Thursday.</span></p><p class=\"\"><span>Comcast shares, at about $31, trade cheaply at just eight times projected 2026 earnings on concerns about broadband competition. Supino thinks a separation of NBCU could add $10 a share or more to Comcast's stock price, given the lofty price that the business could garner.</span></p><p class=\"\"><span>Paramount stock surged 21%, to $13.51, on Friday as investors reacted favorably to the Warner deal.</span></p><p class=\"\"><span>The immediate investor reaction appeared to be this: While Paramount is paying a high price for Warner Bros., the $31-a-share deal value was less than the $33-a-share figure or higher that some thought Paramount needed to pay to win.</span></p><p class=\"\"><span>The Paramount run-up could also be fueled in part by short covering with short interest of 51 million shares, about 15% of the public float.</span></p><p class=\"\"><span>There was bullish news late on Friday when Paramount said that it would issue $47 billion of equity at $16.02 a share to help finance the Warner transaction. The equity deal is fully backed by the Ellison family and RedBird Capital Partners, the current controlling shareholders of Paramount, with a roughly 70% economic state.</span></p><p class=\"\"><span>That sale is at a 19% premium to Paramount's closing price on Friday and represents a big vote of confidence by key holders in the value of Paramount stock. Large equity sales often come at a discount to the market price.</span></p><p class=\"\"><span>Paramount's share count is set to increase by about 2.9 billion, bringing the total to about four billion, Barron's estimates.</span></p><p class=\"\"><span>Paramount stock amounts to a leveraged play on the success of the Warner deal, which Wall Street is betting will pass regulatory scrutiny because President Donald Trump likes Oracle Chairman Larry Ellison and is probably happy that Warner's CNN cable business will be controlled by the Ellison family, including Larry's son, Paramount CEO David Ellison. Trump has criticized CNN for what he views as its left-leaning news coverage.</span></p><p class=\"\"><span>Assuming the deal closes, Paramount will carry an estimated $90 billion of debt, seven times projected 2026 earnings before interest, taxes, depreciation, and amortization, or Ebitda, before cost savings and various corporate streamlining initiatives. That's double the debt/Ebitda ratio that most companies seek to maintain.</span></p><p class=\"\"><span>Paramount is banking on quickly getting those cost savings of $6 billion annually — a high level relative to about $12 billion of projected 2026 Ebitda — and rapidly deleveraging its balance sheet.</span></p><p class=\"\"><span>There are better opportunities in media than Paramount. Walt Disney trades for $106, down 5% in the past year. Its shares sell for just 15 times projected 2026 earnings and 10 times projected 2026 Ebitda, with a better franchise in most respects than Paramount, led by Disney's powerhouse theme-parks business.</span></p><p class=\"\"><span>Paramount has a tough road to navigate. It needs to get regulatory approval for the Warner deal, which isn't a sure thing due to likely U.S., state, and international inquiries, wrote Seaport analyst David Joyce on Friday. Assuming the deal closes in 12 months, Paramount will need to integrate a much larger company, cut significant costs, and wrestle with ongoing erosion in the core media and cable parts of both Paramount and Warner.</span></p><p class=\"\"><span>That's a tall order for David Ellison. The 43-year-old was running Skydance, a media and entertainment business with just $1 billion of annual sales, a year ago. The Skydance deal for Paramount closed last August. Backed by his father's wealth, David Ellison has parlayed his tiny Skydance into the No. 3 media and entertainment company behind Netflix and Disney.</span></p><p class=\"\"><span>Bigger may not be better.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011891:0/",
            "pub_date": "2026-02-28 07:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011882:0",
            "title": "First Trust Advisors L.P. Announces Distributions for Exchange-Traded Funds",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>WHEATON, Ill.--(BUSINESS WIRE)--February 27, 2026--</span></p><p class=\"\"><span>First Trust Advisors L.P. (\"FTA\") announces the declaration of the monthly distributions for certain exchange-traded funds advised by FTA.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>The following dates apply to today's distribution declarations: </span><br/><span> </span><br/><span>            Expected Ex-Dividend Date:             March 2, 2026 </span><br/><span>            Record Date:                           March 2, 2026 </span><br/><span>            Payable Date:                          March 3, 2026 </span><br/><span> </span><br/><span> </span><br/><span>                                                                    Ordinary </span><br/><span>                                                                     Income </span><br/><span>                                                                    Per Share </span><br/><span>Ticker    Exchange   Fund Name                         Frequency      Amount </span><br/><span>-------  ----------  --------------------------------  ----------  ----------- </span><br/><span> </span><br/><span>ACTIVELY MANAGED EXCHANGE-TRADED FUNDS </span><br/><span> </span><br/><span>First Trust Exchange-Traded Fund </span><br/><span>                     FT Vest Bitcoin Strategy &amp; </span><br/><span>DFII     NYSE Arca    Target Income ETF                 Monthly      $0.1995 </span><br/><span>                     FT Vest Gold Strategy Target </span><br/><span>IGLD      Cboe BZX    Income ETF(R)                     Monthly      $0.4962 </span><br/><span> </span><br/><span>First Trust Exchange-Traded Fund IV </span><br/><span>                     FT Vest High Yield &amp; Target </span><br/><span>HYTI     NYSE Arca    Income ETF                        Monthly      $0.1645 </span><br/><span>                     FT Vest Investment Grade &amp; </span><br/><span>LQTI     NYSE Arca    Target Income ETF                 Monthly      $0.1464 </span><br/><span>                     FT Vest 20+ Year Treasury &amp; </span><br/><span>LTTI     NYSE Arca    Target Income ETF                 Monthly      $0.1408 </span><br/><span> </span><br/><span>First Trust Exchange-Traded Fund VIII </span><br/><span>                     FT Vest U.S. Equity Buffer &amp; </span><br/><span>XIDE      Cboe BZX    Premium Income ETF - December     Monthly      $0.1562 </span><br/><span>                     FT Vest U.S. Equity Buffer &amp; </span><br/><span>XIJN      Cboe BZX    Premium Income ETF - June         Monthly      $0.1788 </span><br/><span>                     FT Vest U.S. Equity Buffer &amp; </span><br/><span>XIMR      Cboe BZX    Premium Income ETF - March        Monthly      $0.1636 </span><br/><span>                     FT Vest U.S. Equity Buffer &amp; </span><br/><span>XISE      Cboe BZX    Premium Income ETF - September    Monthly      $0.1517 </span><br/><span> </span><br/><span> </span><br/><span> </span></pre><p class=\"\"><span>FTA is a federally registered investment advisor and serves as the Fund's investment advisor. FTA and its affiliate First Trust Portfolios L.P. (\"FTP\"), a FINRA registered broker-dealer, are privately-held companies that provide a variety of investment services. FTA has collective assets under management or supervision of approximately $319 billion as of January 31, 2026 through unit investment trusts, exchange-traded funds, closed-end funds, mutual funds and separate managed accounts. FTA is the supervisor of the First Trust unit investment trusts, while FTP is the sponsor. FTP is also a distributor of mutual fund shares and exchange-traded fund creation units. FTA and FTP are based in Wheaton, Illinois.</span></p><p class=\"\"><span>You should consider the investment objectives, risks, charges and expenses of a Fund before investing. Prospectuses for the Funds contain this and other important information and are available free of charge by calling toll-free at 1-800-621-1675 or visiting https://www.ftportfolios.com. A prospectus should be read carefully before investing.</span></p><p class=\"\"><span>Principal Risk Factors: You could lose money by investing in a fund. An investment in a fund is not a deposit of a bank and is not insured or guaranteed. There can be no assurance that a fund's objective(s) will be achieved. Investors buying or selling shares on the secondary market may incur customary brokerage commissions. Please refer to each fund's prospectus and Statement of Additional Information for additional details on a fund's risks. The order of the below risk factors does not indicate the significance of any particular risk factor.</span></p><p class=\"\"><span>Past performance is no assurance of future results. Investment return and market value of an investment in a Fund will fluctuate. Shares, when sold, may be worth more or less than their original cost.</span></p><p class=\"\"><span>A Fund's shares will change in value, and you could lose money by investing in a Fund. An investment in a Fund is not a deposit of a bank and is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other governmental agency. There can be no assurance that a Fund's investment objectives will be achieved. An investment in a Fund involves risks similar to those of investing in any portfolio of equity securities traded on exchanges. The risks of investing in each Fund are spelled out in its prospectus, shareholder report, and other regulatory filings.</span></p><p class=\"\"><span>ETF shares may only be redeemed directly from a fund by authorized participants in very large creation/redemption units. ETF shares may trade at a discount to net asset value and possibly face delisting.</span></p><p class=\"\"><span>Securities of small- and mid-capitalization companies may experience greater price volatility and be less liquid than larger, more established companies whereas large capitalization companies may grow at a slower rate than the overall market.</span></p><p class=\"\"><span>A fund that effects all or a portion of its creations and redemptions for cash rather than in-kind may be less tax efficient.</span></p><p class=\"\"><span>Current market conditions risk is the risk that a particular investment, or shares of the fund in general, may fall in value due to current market conditions. For example, changes in governmental fiscal and regulatory policies, disruptions to banking and real estate markets, actual and threatened international armed conflicts and hostilities, and public health crises, among other significant events, could have a material impact on the value of the fund's investments.</span></p><p class=\"\"><span>A fund normally distributes income it earns, so a fund may be required to reduce its distributions if it has insufficient income. Distributions in excess of a Fund's current and accumulated earnings and profits will be treated as a return of capital. There may be other circumstances when all or a portion of a Fund's distribution is treated as a return of capital, for example, there are times when Fund securities are sold to cover a derivative position that generated all or a portion of the distribution that could lead to a return of capital.</span></p><p class=\"\"><span>A fund is susceptible to operational risks through breaches in cyber security. Such events could cause a fund to incur regulatory penalties, reputational damage, additional compliance costs associated with corrective measures and/or financial loss.</span></p><p class=\"\"><span>Trading FLEX Options involves risks different than, and possibly greater than, investing directly in securities. A Target Outcome fund may experience substantial downside for FLEX Option positions and certain FLEX Option positions may expire worthless. There can be no guarantee that a liquid secondary market will exist for the FLEX Options and the FLEX Options may be less liquid than exchange-traded options.</span></p><p class=\"\"><span>In managing a fund's investment portfolio, the portfolio managers will apply investment techniques and risk analyses that may not have the desired result.</span></p><p class=\"\"><span>Market risk is the risk that a particular security, or shares of a fund in general may fall in value. Securities are subject to market fluctuations caused by such factors as general economic conditions, political events, regulatory or market developments, changes in interest rates and perceived trends in securities prices. Shares of a fund could decline in value or underperform other investments as a result. In addition, local, regional or global events such as war, acts of terrorism, spread of infectious disease or other public health issues, recessions, natural disasters or other events could have significant negative impact on a fund.</span></p><p class=\"\"><span>A fund classified as \"non-diversified\" may invest a relatively high percentage of its assets in a limited number of issuers. As a result, a fund may be more susceptible to a single adverse economic or regulatory occurrence affecting one or more of these issuers, experience increased volatility and be highly concentrated in certain issuers.</span></p><p class=\"\"><span>A fund and a fund's advisor may seek to reduce various operational risks through controls and procedures, but it is not possible to completely protect against such risks. A fund also relies on third parties for a range of services, including custody, and any delay or failure related to those services may affect a fund's ability to achieve its objectives.</span></p><p class=\"\"><span>A fund with significant exposure to a single asset class, country, region, industry, or sector may be more affected by an adverse economic or political development than a broadly diversified fund.</span></p><p class=\"\"><span>Certain funds have characteristics unlike many other traditional investment products and may not be appropriate for all investors.</span></p><p class=\"\"><span>The investment strategy is designed to deliver returns that match, or for the X series are approximately twice those of, the reference asset if a fund's shares are bought on the day on which a fund enters into the Flexible Exchange Options(R) (\"FLEX Options\") (i.e., the first day of a Target Outcome Period) and held until those FLEX Options expire at the end of the Target Outcome Period subject to a pre-determined upside cap, while limiting downside losses. If the Underlying ETF experiences gains during a Target Outcome Period, a fund will not participate in those gains on a one-to-one basis or beyond the cap. If an investor does not hold its fund shares for an entire Target Outcome Period, the returns realized by that investor may not match those a fund seeks to achieve. In the event an investor purchases fund shares after the first day of a Target Outcome Period or sells shares prior to the expiration of the Target Outcome Period, the value of that investor's investment in fund shares may not be buffered against a decline in the value of the reference asset and may not participate in a gain in the value of the reference asset up to the cap for the investor's investment period. A shareholder may lose their entire investment.</span></p><p class=\"\"><span>Commodity prices can have a significant volatility and exposure to commodities can cause the value of a fund's shares to decline or fluctuate in a rapid and unpredictable manner.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011882:0/",
            "pub_date": "2026-02-28 07:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011885:0",
            "title": "BANCO SANTANDER (BRASIL) S.A Publicly-Held Company with Authorized Capital",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>CNPJ/MF: 90.400.888/0001-42</span></p><p class=\"\"><span>NIRE: 35.300.332.067</span></p><p class=\"\"><span>NOTICE TO THE MARKET</span></p><p class=\"\"><span>Filing of Form 20-F</span></p><p class=\"\"><span>SÃO PAULO, Feb. 27, 2026 /PRNewswire/ — Banco Santander (Brasil) S.A. (\"Santander Brasil\") announces that its Annual Report on Form 20-F (the \"20-F\"), reporting its financial and operational data for 2025, was filed with the U.S. Securities and Exchange Commission, or the SEC, and with the Brazilian Securities and Exchange Commission, the Comissão de Valores Mobiliários, or CVM, on February 27, 2026. The document has been posted on Santander Brasil's website, https://www.santander.com.br/ri.</span></p><p class=\"\"><span>The 20-F contains detailed information about Santander Brasil, including certifications under the U.S. Sarbanes-Oxley Act, which attest to the effectiveness of Santander Brasil's internal controls and procedures. Santander Brasil's independent auditors, PricewaterhouseCoopers Auditores Independentes Ltda., issued an audit opinion on the financial statements and the effectiveness of internal controls over financial reporting as of December 31, 2025.</span></p><p class=\"\"><span>Santander Brasil's shareholders may receive a hard copy of this document, which contains the Company's complete audited financial statements, free of charge, upon request. Requests should be directed to:</span></p><p class=\"\"><span>Investor Relations Department: Av. Presidente Juscelino Kubitschek, 2235 - 26 Floor, 04543-011 - São Paulo / SP — Brasil, Phone: +55 (11) 3553 3300, E-mail: ri@santander.com.br</span></p><p class=\"\"><span>São Paulo, February 27, 2026</span></p><p class=\"\"><span>Gustavo Alejo Viviani</span></p><p class=\"\"><span>Investor Relations Officer</span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/banco-santander-brasil-sa-publicly-held-company-with-authorized-capital-302700030.html</span></p><p class=\"\"><span>SOURCE BANCO SANTANDER (BRASIL) S.A.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011885:0/",
            "pub_date": "2026-02-28 07:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011887:0",
            "title": "AV, Inc. to Announce Third Quarter of Fiscal Year 2026 Earnings and Host Conference Call",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>ARLINGTON, Va.--(BUSINESS WIRE)--February 27, 2026--</span></p><p class=\"\"><span>AeroVironment, Inc. (\"AV\") </span><span> will report its financial results for the third quarter of fiscal year 2026, which ended January 31, 2026, after the market closes on March 10, 2026. Management will host a conference call and live audio webcast at 4:30 p.m. Eastern Time that same day to discuss the results.</span></p><p class=\"\"><span>The call will be led by Wahid Nawabi, AV's chairman, president, and chief executive officer; Kevin P. McDonnell, executive vice president and chief financial officer; and Denise Pacioni, head investor relations officer.</span></p><p class=\"\"><span>Investors may access the conference call by registering through the following link up to 10 minutes before the event begins:</span></p><p class=\"\"><span>Conference Call Details</span></p><p class=\"\"><span>Date: March 10, 2026</span></p><p class=\"\"><span>Time: 4:30 p.m. ET | 1:30 p.m. PT | 2:30 p.m. MT | 3:30 p.m. CT</span></p><p class=\"\"><span>Participant registration URL:</span></p><p class=\"\"><span>https://register-conf.media-server.com/register/BI42ffd1d0f4154de3b038f735824a329c</span></p><p class=\"\"><span>The live audio webcast will also be accessible via the Investor Relations section of AV's website, http://investor.avinc.com. Please access the site 15 minutes before the event to ensure any necessary software is downloaded.</span></p><p class=\"\"><span>Audio Replay</span></p><p class=\"\"><span>An audio replay and transcript of the event will be archived on the Investor Relations section of the company's website shortly after the event: http://investor.avinc.com.</span></p><p class=\"\"><span>ABOUT AEROVIRONMENT, INC.</span></p><p class=\"\"><span>AeroVironment (\"AV\") </span><span> is a defense technology leader delivering integrated capabilities across air, land, sea, space, and cyber. The company develops and deploys autonomous systems, precision strike systems, counter-UAS technologies, space-based platforms, directed energy systems, and cyber and electronic warfare capabilities--built to meet the mission needs of today's warfighter and tomorrow's conflicts. With a national manufacturing footprint and a deep innovation pipeline, AV delivers proven systems and future-defining capabilities with speed, scale, and operational relevance.</span></p><p class=\"\"><span>For more information visit: www.avinc.com.</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260227222046/en/</span></p><p class=\"\"><span>CONTACT:    INVESTOR CONTACT</span></p><p class=\"\"><span>Denise Pacioni</span></p><p class=\"\"><span>AeroVironment</span></p><p class=\"\"><span>ir@avinc.com</span></p><p class=\"\"><span>MEDIA CONTACT</span></p><p class=\"\"><span>BJ Koubaroulis</span></p><p class=\"\"><span>AeroVironment</span></p><p class=\"\"><span>pr@avinc.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011887:0/",
            "pub_date": "2026-02-28 07:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:c0ac8b652094b:0",
            "title": "ION Announces Proposed Continuation to British Columbia",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Lithium ION Energy Limited </span><span> (FSE: ZA4) (\"</span><strong class=\"root-Tkn6WL2y\"><span>ION</span></strong><span>\" or the \"</span><strong class=\"root-Tkn6WL2y\"><span>Company</span></strong><span>\") is pleased to announce that ION has called a special shareholders' meeting for March 31, 2026. </span></p><p class=\"\"><span>At this meeting, the Company will put forth a resolution to continue the Company's corporate jurisdiction from the Province of Alberta to the Province of British Columbia (the \"</span><strong class=\"root-Tkn6WL2y\"><span>Continuation</span></strong><span>\"). Subject to obtaining shareholder approval of the Continuation, the Company will be subject to the corporate jurisdiction of the Province of British Columbia. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On behalf of the Board</span></strong></p><p class=\"\"><span>Sreenath Didugu</span></p><p class=\"\"><span>CEO</span></p><p class=\"\"><span>sdidugu@qcap.com.au</span></p><p class=\"\"><em><span>Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this news release.</span></em></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Forward-looking Statements </span></strong></em></p><p class=\"\"><em><span>Certain information contained herein constitutes \"forward-looking information\" under Canadian securities legislation. Forward-looking information includes, but is not limited to, the Continuation and the completion of the proposed actions on the timing described herein and receipt of TSXV approval for the proposed actions. Generally, forward-looking information can be identified by the use of forward-looking terminology such as \"will\", \"intends\", \"intention\", \"anticipates\" or variations of such words and phrases or statements that certain actions, events or results \"will\" occur. Forward-looking statements are based on the opinions and estimates of management as of the date such statements are made and they are from those expressed or implied by such forward-looking statements or forward-looking information subject to known and unknown risks, uncertainties and other factors that may cause the actual results to be materially different, including receipt of all necessary regulatory approvals. Although management of the Company have attempted to identify important factors that could cause actual results to differ materially from those contained in forward-looking statements or forward-looking information, there may be other factors that cause results not to be as anticipated, estimated or intended. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. The Company will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:c0ac8b652094b:0-ion-announces-proposed-continuation-to-british-columbia/",
            "pub_date": "2026-02-28 07:49:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZN1CK:0",
            "title": "Canada's Olympia Financial 2025 revenue falls",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Overview</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Canada trust services firm's 2025 revenue fell 4% due to decreased trust income</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Net earnings and comprehensive income for 2025 decreased 17% to C$19.86 mln</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Service revenue rose 5% to C$50 mln due to account growth</span></p></li></ul><p class=\"\"><span>Outlook</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Olympia Financial Group did not provide specific guidance for future quarters or full year</span></p></li></ul><p class=\"\"><span>Result Drivers</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>TRUST INCOME DECLINE - Revenue decreased due to lower trust income, impacted by reduced interest rates on trust fund placements</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>SERVICE REVENUE GROWTH - Service revenue increased due to account growth within the IAS division</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>EXPENSE INCREASES - Total expenses rose due to computer system upgrades and higher legal fees, partially offset by lower wage costs</span></p></li></ul><p class=\"\"><span>Company press release: </span></p><p class=\"\"><span>Key Details</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>Metric</span></p></td><td><p class=\"\"><span>Beat/Miss</span></p></td><td><p class=\"\"><span>Actual</span></p></td><td><p class=\"\"><span>Consensus Estimate</span></p></td></tr><tr><td><p class=\"\"><span>FY Revenue</span></p></td><td></td><td><p class=\"\"><span>C$98.86 mln</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Basic EPS</span></p></td><td></td><td><p class=\"\"><span>C$8.25</span></p></td><td></td></tr><tr><td><p class=\"\"><span>FY Service Revenue</span></p></td><td></td><td><p class=\"\"><span>C$50 mln</span></p></td><td></td></tr></tbody></table></div><p class=\"\"><span>Analyst Coverage</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The one available analyst rating on the shares is \"buy\"</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Olympia Financial Group Inc is C$166.83, about 37.8% above its February 27 closing price of C$121.10</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The stock recently traded at 14 times the next 12-month earnings vs. a P/E of 14 three months ago</span></p></li></ul><p class=\"\"><span>For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:reuters.support@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">reuters.support@thomsonreuters.com</a><span>.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZN1CK:0-canada-s-olympia-financial-2025-revenue-falls/",
            "pub_date": "2026-02-28 07:42:32",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011866:0",
            "title": "Canada Says OpenAI's Safety Pledges Lack Details — 2nd Update",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Paul Vieira</span></p><p class=\"\"><span>OTTAWA--OpenAI's pledges to strengthen security protocols are missing key details including how they will be implemented, Canada's minister in charge of artificial intelligence said.</span></p><p class=\"\"><span>Minister for Artificial Intelligence Evan Solomon is also demanding greater clarity on OpenAI's operations, including how troubling interactions with the ChatGPT chatbot are escalated, and how privacy considerations are balanced with public safety.</span></p><p class=\"\"><span>Solomon issued a statement Friday, roughly 24 hours after OpenAI wrote to the minister and pledged to bolster safety protocols. OpenAI said that with the changes, it would have referred the account belonging to Jesse Van Rootselaar to police if it was discovered today. Police have identified Van Rootselaar as the suspect in a deadly school shooting in Tumbler Ridge, British Columbia that left eight dead and dozens injured.</span></p><p class=\"\"><span>The Wall Street Journal has reported that OpenAI considered alerting Canadian law-enforcement authorities about interactions between Van Rootselaar and ChatGPT. OpenAI shut down Van Rootselaar's ChatGPT account after detecting a violation of its policy but didn't notify police.</span></p><p class=\"\"><span>Solomon said he's also scheduled to speak to OpenAI Chief Executive Sam Altman next week. A spokesman for Solomon said the timing and location have yet to be determined.</span></p><p class=\"\"><span>A meeting with Solomon marks the second senior Canadian politician Altman has agreed to speak with. British Columbia Premier David Eby said he's also set to speak to Altman, and Eby added he wants the CEO to be cognizant of the pain that families in Tumbler Ridge are feeling.</span></p><p class=\"\"><span>A spokesperson for OpenAI confirmed that Altman has scheduled meeting with both Messrs. Solomon and Eby.</span></p><p class=\"\"><span>Online platforms have long debated how to balance questions of privacy with public safety in their decisions to alert law enforcement about certain users. That debate has now pulled in the AI companies that power the chatbots to which people are confiding the most intimate details of their private thoughts and lives.</span></p><p class=\"\"><span>In its letter to Solomon, OpenAI divulged that Van Rootselaar had a second ChatGPT account. Among OpenAI's pledges is a commitment to strengthen detection systems to prevent efforts to evade safeguards.</span></p><p class=\"\"><span>Taylor Owen, a public-policy professor at Montreal's McGill University with a specialty in media and ethics, said OpenAI has now publicly acknowledged its previous safety protocols were inadequate, and that Van Rootselaar's ability to create a second account discloses a previously unknown system error.</span></p><p class=\"\"><span>\"It means the threshold that governed the original decision, the one that resulted in Canadian police not being contacted about violent content flagged by the company's own systems, was one the company itself now considers inadequate,\" Owen said. OpenAI's pledges, he added, follows a pattern among social-media platforms \"where product safety changes come only after an incident forces them.\"</span></p><p class=\"\"><span>Solomon said he will press Altman about ensuring the pledges are fully implemented and enforced.</span></p><p class=\"\"><span>\"We will be seeking further clarity on how human review is conducted and whether Canadian context and best practices are appropriately embedded in those decisions,\" the minister said.</span></p><p class=\"\"><span>Solomon added that intends to meet other major digital platforms in the coming weeks to advocate for a consistent approach on protecting youths and the public.</span></p><p class=\"\"><span>Write to Paul Vieira at paul.vieira@wsj.com</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011866:0/",
            "pub_date": "2026-02-28 07:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011877:0",
            "title": "Sturm, Ruger & Company, Inc. to Report Fourth Quarter and Year-End 2025 Financial Results on Monday, March 2",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>MAYODAN, N.C.--(BUSINESS WIRE)--February 27, 2026--</span></p><p class=\"\"><span>Sturm, Ruger &amp; Company, Inc. </span><span> will announce its financial results for the fourth quarter and year-end 2025 and file its Annual Report on Form 10-K on Monday, March 2, 2026, after the close of the stock market.</span></p><p class=\"\"><span>That evening, Sturm, Ruger will host a webcast at 4:30 p.m. ET to discuss the fourth quarter and year-end 2025 operating results. Interested parties can listen to the webcast via this link or by visiting Ruger.com/corporate. Those who wish to ask questions during the webcast will need to pre-register prior to the meeting.</span></p><p class=\"\"><span>The Form 10-K will be available on the SEC website at SEC.gov and the Ruger website at Ruger.com/corporate as soon as practicable after the filing. Concurrent with the filing of the Form 10-K, an earnings release containing the 2025 financial statements will be issued. We urge investors to read our complete Form 10-K in order to have adequate information to make informed investment decisions.</span></p><p class=\"\"><span>About Sturm, Ruger &amp; Co., Inc.</span></p><p class=\"\"><span>Sturm, Ruger &amp; Co., Inc. is one of the nation's leading manufacturers of rugged, reliable firearms for the commercial sporting market. With products made in America, Ruger offers consumers almost 800 variations of more than 40 product lines, across the Ruger, Marlin and Glenfield brands. For over 75 years, Sturm, Ruger &amp; Co., Inc. has been a model of corporate and community responsibility. Our motto, \"Arms Makers for Responsible Citizens(R),\" echoes our commitment to these principles as we work hard to deliver quality and innovative firearms.</span></p><p class=\"\"><span>The Company may, from time to time, make forward-looking statements and projections concerning future expectations. Such statements are based on current expectations and are subject to certain qualifying risks and uncertainties, such as market demand, sales levels of firearms, anticipated castings sales and earnings, the need for external financing for operations or capital expenditures, the results of pending litigation against the Company, the impact of future firearms control and environmental legislation, and accounting estimates, any one or more of which could cause actual results to differ materially from those projected. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date made. The Company undertakes no obligation to publish revised forward-looking statements to reflect events or circumstances after the date such forward-looking statements are made or to reflect the occurrence of subsequent unanticipated events.</span></p><p class=\"\"><span>Sturm, Ruger &amp; Co., Inc. \"Arms Makers for Responsible Citizens(R)\"</span></p><p class=\"\"><span>View source version on businesswire.com: https://www.businesswire.com/news/home/20260227495435/en/</span></p><p class=\"\"><span>CONTACT:    Sturm, Ruger &amp; Co., Inc.</span></p><p class=\"\"><span>700 S Ayersville Rd</span></p><p class=\"\"><span>Mayodan, NC 27027</span></p><p class=\"\"><span>www.ruger.com</span></p><p class=\"\"><span>203-259-7843</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011877:0/",
            "pub_date": "2026-02-28 07:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011825_20260227011825:0",
            "title": "National Presto Industries 2025 Sales $503.5M",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011825_20260227011825:0/",
            "pub_date": "2026-02-28 07:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:2ef000090094b:0",
            "title": "Olympia Financial Group Inc. Announces 2025 Annual Results",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Calgary, Alberta--(Newsfile Corp. - February 27, 2026) - Olympia Financial Group Inc. </span><span> (\"Olympia\") today announces its operating and financial results for the year ended December 31, 2025.</span></p><p class=\"\"><span>The audited financial statements and notes, as well as management's discussion and analysis, are now available on SEDAR (</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/ZEj3RhMzGg\" rel=\"nofollow\" target=\"_blank\">www.sedarplus.ca</a><span>).</span></p><p class=\"\"><span>Results from operations for the year ended December 31, 2025, include the following (compared to operations for the year ended December 31, 2024):</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total net earnings and comprehensive income decreased 17% to $19.86 million from $23.92 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total revenue decreased 4% to $98.86 million from $102.92 million mainly due to a decrease in trust income.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Service revenue increased 5% to $50.00 million from $47.78 million mainly due to an increase in monthly and transaction fees related to account growth within the IAS division.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Trust, interest, and other income decreased 11% to $48.87 million from $55.14 million mainly due to a decrease in interest rates on trust fund placements made over the previous 12 months. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Total expenses increased 1% to $72.51 million from $71.94 million mainly due to computer system upgrades utilizing advanced AI and business process automation, as well as higher legal fees. These increases were partially offset by lower operational wage costs.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Basic and diluted earnings per share attributable to shareholders of Olympia decreased 17% to $8.25 per share from $9.94 per share.</span></p></li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Olympia Financial Group Inc.</span></strong></p><p class=\"\"><span>Olympia conducts most of its operations through its subsidiary Olympia Trust Company, a non-deposit taking trust company. Olympia Trust Company is licensed to conduct trust activities in Alberta, British Columbia, Saskatchewan, Manitoba, Quebec, Newfoundland and Labrador, Prince Edward Island, New Brunswick, and Nova Scotia. Olympia Trust Company administers self-directed registered plan accounts, corporate trust, and transfer agency services. Olympia also provides currency exchange and global payment services through its subsidiary Olympia Currency and Global Payments Inc., and offers private health services plans and information technology services to exempt market dealers, registrants, and issuers through its subsidiary Olympia Benefits Inc.</span></p><p class=\"\"><span>Olympia's common shares are listed on the Toronto Stock Exchange under the symbol \"OLY\".</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For further information, please contact:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Olympia Financial Group Inc.</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Craig Skauge, Executive Vice President</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jennifer Urscheler, Chief Financial Officer </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Phone: (403) 261-0900</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Fax: (403) 261-7523</span></strong></p><p class=\"\"><em><strong class=\"root-Tkn6WL2y\"><span>Statements Regarding Forward Looking Information</span></strong></em></p><p class=\"\"><em><span>Certain portions of this press release as well as other public statements by Olympia contain \"forward-looking information\" within the meaning of applicable Canadian securities legislation, which is also referred to as \"forward-looking statements\", which may not be based on historical fact. Wherever possible, words such as \"will\", \"plans,\" \"expects,\" \"targets,\" \"continue\", \"estimates,\" \"scheduled,\" \"anticipates,\" \"believes,\" \"intends,\" \"may,\" and similar expressions or statements that certain actions, events or results \"may,\" \"could,\" \"would,\" \"might\" or \"will\" be taken, occur or be achieved, have been used to identify forward-looking information. Forward-looking statements contained in Olympia's public disclosure include, without limitation, Olympia's earnings expectations, fee income, expense levels, general economic, political and market factors in North America and internationally, interest and foreign exchange rates, global equity and capital markets, business competition, technological change, changes in government regulations, unexpected judicial or regulatory proceedings, catastrophic events, and Olympia's ability to complete strategic transactions and other factors. In addition, this news release contains forward-looking statements relating to the monthly dividend payments to holders of Olympia common shares.</span></em></p><p class=\"\"><em><span>All material assumptions used in making forward-looking statements are based on management's knowledge of current business conditions and expectations of future business conditions and trends, including their knowledge of the current interest rate and liquidity conditions affecting Olympia and the Canadian economy. Certain material factors or assumptions are applied by Olympia in making forward-looking statements, including without limitation, factors and assumptions regarding interest and foreign exchange rates, availability of key personnel, the effect of competition, government regulation of its business, computer failure or security breaches, future capital requirements, acceptance of its products in the marketplace, its operating cost structure, the current tax regime and the ability of Olympia to obtain necessary third-party and governmental approvals, as applicable.</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:2ef000090094b:0-olympia-financial-group-inc-announces-2025-annual-results/",
            "pub_date": "2026-02-28 07:32:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011825_20260227011828:0",
            "title": "National Presto Industries 2025 EPS $4.63 >NPK",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011825_20260227011828:0/",
            "pub_date": "2026-02-28 07:32:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011837:0",
            "title": "Paramount Issuing $47 Billion of Equity at Nearly 20% Premium to Current Stock Price — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Andrew Bary</span></p><p class=\"\"><span>Paramount Skydance received a big vote of confidence from its controlling shareholders, including the Ellison family, when they agreed to fully back an equity offering to help fund the company's deal for Warner Bros. Discovery at a big premium above Paramount's stock price.</span></p><p class=\"\"><span>Late Friday, Paramount outlined some of the financial highlights of its $110 billion deal for Warner Bros at $31 a share in cash. The deal values Warner Bros. equity at $81 billion, plus about $29 billion in assumed net debt.</span></p><p class=\"\"><span>One unanswered question until now has been the terms of Paramount's equity raise to help fund the deal.</span></p><p class=\"\"><span>The company said that it would issue $47 billion of equity--above a prior estimate of about $41 billion--at an offering price of $16.02 a share. That's a 19% premium above Paramount's closing stock price of $13.51 on Friday. The company's shares surged 21% Friday as investors reacted favorably to Paramount's victory in the takeover battle on Thursday, when Netflix dropped out of the bidding.</span></p><p class=\"\"><span>Paramount said the $47 billion deal consisting of class B shares is being \"fully backed\" by the Ellison family and Redbird Capital Partners, the current controlling shareholders in Paramount who now own about 70% of the company's 1.1 billion outstanding shares. The Ellison family is led by Oracle chairman and billionaire Larry Ellison and his son David, the Paramount CEO.</span></p><p class=\"\"><span>There also is a $54 billion debt financing commitment from a group of lenders.</span></p><p class=\"\"><span>Paramount said the equity may include \"other strategic and financial partners.\" The breakdown of the equity buyers doesn't appear to have been set yet.</span></p><p class=\"\"><span>Investors reacted favorably, with Paramount stock up 3% in after-hours trading to nearly $14 a share.</span></p><p class=\"\"><span>Paramount is set to issue 2.9 billion shares in the equity raise, lifting its share count to about 4 billion, Barron's estimates.</span></p><p class=\"\"><span>Big equity offerings often are done at a discount to the market price. That's why the Paramount equity sale is so notable and bullish.</span></p><p class=\"\"><span>Paramount said that existing Paramount holders will be able to participate in a rights offering to buy up to $3.25 billion of new class B shares at $16.02 a share, the same price at which the equity offering is being priced.</span></p><p class=\"\"><span>There now isn't incentive for Paramount holders to participate in that rights deal — but if the stock rallies, it could become attractive.</span></p><p class=\"\"><span>Paramount now has a thin public float of about 300 million shares, with the Ellisons and RedBird controlling about 800 million shares.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011837:0/",
            "pub_date": "2026-02-28 07:33:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-27:newsml_PLX7F50ED:0",
            "title": "BRIEF-Olympia Financial Group FY Revenue CAD 98.86 Million",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Feb 27 (Reuters) - Olympia Financial Group FY service revenue CAD 50 million.</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>FY basic EPS CAD 8.25</span></li><li class=\"listItem-bmN0_SHH\"><span>FY net income CAD 19.86 million</span></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-27:newsml_PLX7F50ED:0-brief-olympia-financial-group-fy-revenue-cad-98-86-million/",
            "pub_date": "2026-02-28 07:33:33",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011825_20260227011840:0",
            "title": "National Presto Industries: Housewares/Small Appliance Sales Hurt by 'Retailers' Reluctance to Accept Tariff-Induced Price Increases'",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span class=\"placeholder-diQOvrPB\">This news item displays a headline only and has no other text.</span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011825_20260227011840:0/",
            "pub_date": "2026-02-28 07:34:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZN1AL:0",
            "title": "Dominican Republic has over 150 million tons of rare earth deposits, president says",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>The Dominican Republic has identified rare earth deposits that could position the Caribbean nation as a significant future supplier of minerals critical to high-tech industries, President Luis Abinader said on Friday.</span></p><p class=\"\"><span>Preliminary studies indicate gross deposits exceeding 150 million tons of rare earth elements, comprising 17 metals that can be used in semiconductors, aerospace applications, and military equipment, according to a government statement.</span></p><p class=\"\"><span>During his annual State of the Nation address to Congress, Abinader set a goal to finish assessing mineral deposits this year and certify reserves by early next year, a necessary step for large-scale extraction and refining.</span></p><p class=\"\"><span>     It is unclear how much of the 150 million tons could be viable for commercialization.</span></p><p class=\"\"><span>The president linked development of the deposits to a broader strategy of energy transformation and \"responsible use of natural resources,\" which he said would strengthen Dominican sovereignty, reduce external dependence, cut emissions and boost competitiveness.</span></p><p class=\"\"><span>The United States has signaled strong interest in the Dominican deposits, located in the border province of Pedernales.</span></p><p class=\"\"><span>U.S. Secretary of State Marco Rubio said in February last year that the world will need access to such resources to develop key technologies in this century, and stressed that the rare earths \"belong to the Dominican Republic and its people,\" while offering U.S. support as a partner in their development. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZN1AL:0-dominican-republic-has-over-150-million-tons-of-rare-earth-deposits-president-says/",
            "pub_date": "2026-02-28 07:37:50",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:5d8630ff6094b:0",
            "title": "Brookfield Property Partners Completes 2025 Annual Filings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>BROOKFIELD NEWS, Feb. 27, 2026 (GLOBE NEWSWIRE) -- Brookfield Property Partners announced today that it has filed its 2025 annual report on Form 20-F, including its audited financial statements for the year ended December 31, 2025, with the SEC on EDGAR as well as with the Canadian securities authorities on SEDAR+. These documents are also available at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=JMW8aRhnlsS_w6iN4RLzRJLriU0IxpfReXgPiy29Zjf12x8FkNbspaXsrZICmLGNJb8QORL8gHxep9ODoMeHWrrVdv3rIE-SvBiqNfYnn-I=\" rel=\"nofollow\" target=\"_blank\">bpy.brookfield.com</a><span>.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Brookfield Property Partners</span></strong></p><p class=\"\"><span>Brookfield Property Partners is one of the world’s premier real estate companies. We own and operate iconic properties in the world’s major markets, and our global portfolio includes office, retail, multifamily, logistics, hospitality, single-family rentals, manufactured housing, student housing and self-storage.</span></p><p class=\"\"><span>Brookfield Property Partners is a subsidiary of Brookfield Corporation </span><span>, </span><span>. More information is available at </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=PwXwAui1h315TSRpyuZYPWc5RFXvyoFBwO0E49ZY6CJrDag0nbJQeU7ZG1mrbdu9R8jJ1MgMGz6PMVEw0EUEGzppqF26fkW24j6kOqVm5us=\" rel=\"nofollow\" target=\"_blank\">www.brookfield.com</a><span>. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact:</span></strong></p><p class=\"\"><span>Keren Dubon</span></p><p class=\"\"><span>Investor Relations</span></p><p class=\"\"><span>Tel:212</span><span>-618-3440</span></p><p class=\"\"><span>Email: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=UtfqBUhlAogub64xXFaDxLHIB0PeXDqfbaYbaOmsTjvZ0CVIBXt1M1nUyVmTR59RfyMtqYOFsSSW-_2YPf9sIfp-Br0hbPrHaTwD_RzS5cn9gvSvQ9qh-1ywdTuVrfOc\" rel=\"nofollow\" target=\"_blank\">keren.dubon@brookfield.com </a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:5d8630ff6094b:0-brookfield-property-partners-completes-2025-annual-filings/",
            "pub_date": "2026-02-28 07:23:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:3a1fe1a1e094b:0",
            "title": "Dan Ives Calls Nvidia, AMD, Micron, Microsoft, Amazon ‘Winners’ As Software Nears Bottom",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Despite the “brutal” week, Ives said in the interview that the period will be looked upon as an opportunity in the future as long as the AI companies follow through on their capex spending. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Ives called Nvidia a “stunner,” citing its stellar results, and attributed the downturn in the stock to “nervous” tech investors. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>He highlighted that 10% of Azure customers have gone down the AI path, which he predicted would bring in an incremental revenue of $35 billion to $40 billion for Microsoft.</span></li></ul></span></div><span><p class=\"\"><span>Dan Ives, managing director at Wedbush Securities, said on Friday that the software stocks under pressure may be at a turning point.</span></p><p class=\"\"><span>“I think software is going to start to bottom here, especially after the Anthropic event, Salesforce, ServiceNow and others,” Ives said in an interview with CNBC.</span></p><p class=\"\"><span>“These are the times to look at who are the winners on chips. Nvidia, AMD, Micron. Who are the winners on the hyperscalers side? Microsoft, Amazon, and others,” he said.</span></p><p class=\"\"><span>“AI ghost narrative where good is bad and bad is worse,” Ives added.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The Opportunity</span></strong></p><p class=\"\"><span>Despite the “brutal” week, Ives said in the interview that the period will be looked upon as an opportunity in the future as long as the AI companies follow through on their capex spending.</span></p><p class=\"\"><span>He added that the outcome would ultimately depend on “where the spending is on the enterprise and the AI,” which he said would dictate the movement of these stocks over the next 12-24 months.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On Nvidia</span></strong></p><p class=\"\"><span>Ives specifically elaborated on three stocks — Nvidia Corp. (NVDA), Microsoft Corp. (MSFT), and Amazon.com (AMZN).</span></p><p class=\"\"><span>The Wedbush Securities managing director called Nvidia a “stunner,” citing its stellar results. He attributed the downturn in the stock to “nervous” tech investors.</span></p><p class=\"\"><span>“This is a stock I’d expect should be $210-$215,” Ives said. “This is a turbulent period, but our thesis is unchanged,” he said, reiterating the firm’s bullish stance on the stock.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/nvda\" rel=\"nofollow\" target=\"_blank\">Shares of NVDA</a><span> have declined about 9% since posting earnings on Wednesday, while having climbed more than 47% in the past year.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>On Microsoft And Amazon</span></strong></p><p class=\"\"><span>Ives also reiterated Wedbush’s take on Microsoft, one of the top picks of the year at the firm. He highlighted that 10% of Azure customers have gone down the AI path, which he predicted would bring in an incremental revenue of $35 billion to $40 billion for the company.</span></p><p class=\"\"><span>“Microsoft is probably the most disconnected stock that I’ve seen in the last few years relative to what it's trading at,” he said. “And I think numbers are significantly underestimated,” he added, saying it was a “massive head-scratcher” for trading below $400. </span></p><p class=\"\"><span>Ives also said that Amazon, in parts, has been the “most-attractive” it has been in the past four-to-five years, touting CEO Andy Jassy’s contribution to be working for the company.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/msft\" rel=\"nofollow\" target=\"_blank\">MSFT shares</a><span> have remained relatively flat in the past year, while </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/amzn\" rel=\"nofollow\" target=\"_blank\">shares of AMZN</a><span> have risen 1% in the same period.</span></p><p class=\"\"><span>Also Read: Nvidia Shares Will Be Rewarding Over The Long-Term, Says Gene Munster, Citing Strong Fundamentals</span><em><span> </span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:3a1fe1a1e094b:0/",
            "pub_date": "2026-02-28 07:26:58",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260227014798:0",
            "title": "Private-credit 'cockroaches' and the AI 'scare trade' hammered stocks in February. Here's what else has investors shaken up.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Joseph Adinolfi, Joy Wiltermuth and Isabel Wang</span></p><p class=\"\"><span>A plethora of issues pushed U.S. stocks lower in the final trading session of a rough month</span></p><p class=\"\"><span>The S&amp;P 500 stumbled amid a turbulent February for stocks</span></p><p class=\"\"><span>Stocks were caught up Friday in a whirlwind of market-moving headlines, making for a wild final trading day in a rough month for U.S. equities.</span></p><p class=\"\"><span>The penultimate day of February saw President Trump signal that the U.S. military remains ready to strike Iran. There also were more problems on the inflation and private-credit fronts, with shares of financial stocks - banks and asset managers alike - selling off hard.</span></p><p class=\"\"><span>Investors largely blamed the collapse of U.K.-based mortgage lender Market Financial Solutions for reviving fears about more \"cockroaches\" to come in the private-credit industry. But there was also an announcement from Apollo Global Management (APO) that it had reduced a dividend at a private-credit fund and re-evaluated some asset values due to challenges with its loan portfolio.</span></p><p class=\"\"><span>The KBW Nasdaq Bank Index BKX fell nearly 5% to cap off the month. Shares of Blue Owl Capital (OWL) fell nearly 6%, while Apollo's stock was down more than 8%, FactSet data showed. Blue Owl spooked investors earlier in February when it limited investor withdrawals and sold $1.4 billion in private-credit assets, including some software loans.</span></p><p class=\"\"><span>Other issues for investors arrived ahead of the opening bell, including a troubling inflation report that showed wholesale prices rose by 0.5% in January - faster than the 0.3% increase economists had expected. Meanwhile, what some have called the artificial-intelligence \"fear trade\" remained in full effect.</span></p><p class=\"\"><span>\"Investors are readjusting their risk budget right now in a risk-off mood on Friday, and that the AI momentum is now becoming AI anxiety,\" said Brian Mulberry, chief market strategist at Zacks Investment Management.</span></p><p class=\"\"><span>A 'shoot first, ask questions later' market</span></p><p class=\"\"><span>Software stocks and megacap technology players like Nvidia (NVDA) continued to struggle on Friday, adding to their already punishing losses over the past month. This time, semiconductor stocks - particularly highflying memory names like Sandisk (SNDK) and Micron Technology (MU), which have soared recently while software has plunged - joined in the selling as well.</span></p><p class=\"\"><span>Stocks trading outside of the U.S. mostly continued to trundle higher in February, with big gains particularly in the South Korean market. But in the U.S., a dour mood has been underscored by a couple of apparent contradictions, as Jay Hatfield, a portfolio manager at Infrastructure Capital Advisors, pointed out during a conversation with MarketWatch.</span></p><p class=\"\"><span>First, sentiment in certain corners of the market has soured dramatically, even though the S&amp;P 500 SPX finished Friday roughly 2 percentage points shy of record territory. Second, there are seemingly contradictory narratives causing havoc within the technology sector, the largest and most important sector for the U.S. equity market's overall stability.</span></p><p class=\"\"><span>Megacap tech stocks are struggling as investors balk at the massive spending on AI infrastructure, seemingly worried about the possibility that the return on investment might be too weak to justify the tremendous cost. Recent earnings reports from Microsoft (MSFT) and Amazon.com (AMZN) elicited negative reactions from investors, while even blockbuster earnings from Nvidia earlier this week weren't enough to turn the tide.</span></p><p class=\"\"><span>Meanwhile, fears that AI might be so successful it turns whole industries on their heads have hammered shares of software companies, asset managers, commercial real-estate and brokerage firms, cybersecurity companies, and even transportation and logistics firms.</span></p><p class=\"\"><span>\"These ideas don't even make sense internally - but they're all out there, and all of these companies are going down,\" Hatfield told MarketWatch Friday. \"This is a 'shoot first, ask questions later' kind of market.\"</span></p><p class=\"\"><span>A Substack post penned by Citrini Research that went viral Monday was widely credited with inspiring the worst selloff in stocks in three weeks. The report envisioned an economy in 2028 where AI is successful enough to cause widespread white-collar job destruction, without new industries emerging to absorb displaced workers.</span></p><p class=\"\"><span>\"AI has been disrupting a different segment of the economy on a daily basis,\" said Michael Hans, chief investment officer at Citizens Wealth, in a phone interview Friday. He noted that \"the narrative has been shifting\" away from talk of huge productivity gains from AI to worries over potential job losses and damage to the economy.</span></p><p class=\"\"><span>A puzzling bid for bonds</span></p><p class=\"\"><span>There also has been a sudden bid for bonds. Instead of Treasury yields rising on signs that inflation might be rearing back up, the benchmark 10-year rate BX:TMUBMUSD10Y slipped below the 4% threshold on Friday.</span></p><p class=\"\"><span>Read: The bond market has been doing something strange despite a hot inflation report</span></p><p class=\"\"><span>Inflation can be kryptonite for bonds. But lately, inflation and the timing of any future Federal Reserve interest-rate cuts have taken a backseat to investors seeking safety from the selloff in software names, said Sweta Singh, a portfolio manager at City Different Investments.</span></p><p class=\"\"><span>\"It's the legacy [software-as-a-service] scared money that is being parked into the Treasury market,\" Singh told MarketWatch.</span></p><p class=\"\"><span>This dynamic has also helped bonds shrug off the Supreme Court's decision to rule most of President Trump's tariffs illegal, Singh noted. The ruling raised new questions about the size of U.S. fiscal deficits.</span></p><p class=\"\"><span>In other haven plays, the U.S. dollar DXY failed to gain ground Friday against a basket of rival currencies, despite Trump saying he would \"love not to\" attack Iran. Yet gold (GC00,) which global central banks have been stockpiling as a dollar alternative, has been playing second fiddle to silver (SI00) as investors grow more nervous about a splintering world order. Both metals saw their largest monthly gains on record in February, Dow Jones Market Data showed.</span></p><p class=\"\"><span>A \"panic\" rotation has also helped boost shares of defensive stocks in the consumer-staples sector. Investors trawling for value stocks have also boosted shares of energy and materials names.</span></p><p class=\"\"><span>See: February's 'panic' rotation in stocks sets the stage for more tumult in March</span></p><p class=\"\"><span>Both the S&amp;P 500 and the Nasdaq Composite COMP finished in the red on Friday, and both indexes capped off their worst monthly drop since March 2025, according to Dow Jones Market Data. The tech-heavy Nasdaq has now fallen during three of the past four months.</span></p><p class=\"\"><span>Yet it wasn't all bad news. The blue-chip Dow Jones Industrial Average DJIA managed to eke out a gain for the month - taking its winning streak to 10 months, its longest such run since January 2018.</span></p><p class=\"\"><span>-Joseph Adinolfi -Joy Wiltermuth -Isabel Wang</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260227014798:0/",
            "pub_date": "2026-02-28 07:30:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260227011823:0",
            "title": "Moody's Puts Paramount on Review for Downgrade to Junk — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Heather Gillers</span></p><p class=\"\"><span>Moody's Investors Services said Friday it is placing Paramount Global on review for a downgrade following parent company, Paramount Skydance's winning bid to buy to Warner Bros. Discovery. Paramount Global carried Moody's lowest investment grade rating of Baa3 so a downgrade would push the company into speculative grade territory, or \"junk\" status.</span></p><p class=\"\"><span>Moody's said that while buying Warner Bros. will improve margins and add revenue diversity for Paramount Skydance, it will also \"materially increase\" leverage and complexity in the company's debt load. Integrating the two companies will also bring challenges, the ratings firm said.</span></p><p class=\"\"><span>Paramount Skydance offered $31 a share to purchase the company, a bid rival competitor Netflix declined to match.</span></p><p class=\"\"><span>This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260227011823:0/",
            "pub_date": "2026-02-28 07:30:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tmx_newsfile:9291e0bb3094b:0",
            "title": "IMPACT Silver Corp: Invitation to PDAC 2026 Booth 2505",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Vancouver, British Columbia--(Newsfile Corp. - February 27, 2026) - Visit </span><strong class=\"root-Tkn6WL2y\"><span>IMPACT Silver Corp</span></strong><span> </span><span> (OTCQB: ISVLF) at Booth #2505 at the Prospectors &amp; Developers Association of Canada’s (PDAC) Convention at the Metro Toronto Convention Centre (MTCC) from Sunday, March 1 to Wednesday, March 4, 2026.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About IMPACT Silver Corp</span></strong></p><p class=\"\"><span>ABOUT IMPACT SILVER IMPACT Silver Corp. </span><span> is a successful producer-explorer with two mining projects in Mexico. 1/ Royal Mines of Zacualpan Silver-Gold District: IMPACT owns 100% of the 211 km2 Zacualpan project in central Mexico where four producing underground silver mines and one open pit mine feed the central 500 tpd Guadalupe processing plant. 2/ To the south, the Capire Project includes a 200 tpd processing pilot plant adjacent to an open pit silver mine with an NI 43-101 inferred mineral resource of over 4.5 million ounces silver, 48 million lbs zinc and 21 million lbs lead in 1,786,000 tonnes grading 79g/t Ag, 1.22% Zn and 0.54% Pb (see IMPACT news release dated January 18, 2016, for details and QP statement). Company engineers are reviewing Capire for a potential restart of operations to leverage improving commodity prices. Over the past 19 years, IMPACT has developed multiple exploration zones into commercial production and has produced over 13.7 million ounces of silver, generating revenue of more than $307 million, with no long-term debt. 3/ Plomosas Zinc-Lead-Silver District: Plomosas is a high-grade zinc producer in northern Mexico with exploration upside potential. The Company recently restarted mining operations and is ramping up production. Exploration potential at Plomosas is along the 6 km long structure. This is in addition to other exploration targets on the 3,019-hectare property including untested copper-gold targets with indications of high-grade material at surface. Regionally, Plomosas lies in the same mineral belt as some of the largest carbonate replacement deposits in the world. George Gorzynski, PEng, a director of the Company, is a Qualified Person within the meaning of NI 43-101 and has approved the technical information contained in this news release.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About PDAC</span></strong></p><p class=\"\"><span>The World’s Premier Mineral Exploration &amp; Mining Convention is the leading convention for people, governments, companies and organizations connected to mineral exploration. In addition to meeting more than 1,100 exhibitors, 2,500 investors and 26,000 attendees in person in 2024, participants could also attend programming, courses and networking events.</span></p><p class=\"\"><span>The annual convention is held in Toronto, Canada. It has grown in size, stature and influence since it began in 1932 and today is the event of choice for the world’s mineral industry.</span></p><p class=\"\"><span>For more information and/or to register for the conference please visit: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/0p3ADHkPLK\" rel=\"nofollow\" target=\"_blank\">https://www.pdac.ca/convention</a><span>.</span></p><p class=\"\"><span>We look forward to seeing you there.</span></p><p class=\"\"><span>For further information:</span></p><p class=\"\"><em><span>IMPACT Silver Corp</span></em></p><p class=\"\"><em><span>Jerry Huang</span></em></p><p class=\"\"><em><span>7788677909</span></em></p><p class=\"\"><em><span>jerry@impactsilver.com</span></em></p><p class=\"\"><em><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://api.newsfilecorp.com/redirect/RYpNZiO1N5\" rel=\"nofollow\" target=\"_blank\">www.impactsilver.com</a></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/tmx_newsfile:9291e0bb3094b:0-impact-silver-corp-invitation-to-pdac-2026-booth-2505/",
            "pub_date": "2026-02-28 07:30:00",
            "source": "TMX Newsfile",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZN30O:0",
            "title": "Vistra Corp reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Vistra Corp </span><span> reported quarterly adjusted earnings of 54 cents​​ per share for the quarter ended December 31, lower than the same quarter last year, when the company reported EPS of 94 cents.  The mean expectation of eleven analysts for the quarter was for earnings of $2.35 per share. Wall Street expected results to range from $1.07  to $5.64 per share.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Revenue rose 13.5% to $4.58 billion from a year ago; analysts expected $5.79 billion. </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Vistra Corp's reported EPS for the quarter was 54 cents​.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The company reported quarterly net income of $185 million.</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Vistra Corp shares had risen by 9.6% this quarter.</span></p></li></ul><p class=\"\"><span>FORECAST CHANGES</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The mean earnings estimate of analysts had risen by about 1.1% in the last three months.​ </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>In the last 30 days, four analysts negatively revised earnings estimates</span></p></li></ul><p class=\"\"><span>RECOMMENDATIONS</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 19 \"strong buy\" or \"buy,\" 1 \"hold\" and no \"sell\" or \"strong sell.\" </span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>Wall Street's median 12-month price target for Vistra Corp is $229.50, about 24.2% above its last closing price of $173.89</span></p></li></ul><p class=\"\"><span>This summary was machine generated from LSEG data February 27 at 11:30 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a><span>)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\"><span>QUARTER ENDING</span></p></td><td><p class=\"\"><span>ESTIMATE </span></p></td><td><p class=\"\"><span>ACTUAL</span></p></td><td><p class=\"\"><span>BEAT, MET, MISSED</span></p></td></tr><tr><td><p class=\"\"><span>Dec. 31 2025 </span></p></td><td><p class=\"\"><span>2.35</span></p></td><td><p class=\"\"><span>0.54</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Sep. 30 2025 </span></p></td><td><p class=\"\"><span>2.10</span></p></td><td><p class=\"\"><span>1.75</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Jun. 30 2025 </span></p></td><td><p class=\"\"><span>1.22</span></p></td><td><p class=\"\"><span>0.71</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr><tr><td><p class=\"\"><span>Mar. 31 2025 </span></p></td><td><p class=\"\"><span>0.65</span></p></td><td><p class=\"\"><span>-0.93</span></p></td><td><p class=\"\"><span>Missed</span></p></td></tr></tbody></table></div></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZN30O:0-vistra-corp-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2026-02-28 07:30:53",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:d05020e25094b:0",
            "title": "Hawaiian Electric Shares Are Higher Today – Know Why",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The company said that Hawaiian Electric’s net income for the fourth quarter of 2025 was $44 million compared to net income of $46 million in the fourth quarter of 2024. </span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The holding and other companies’ net loss was $45 million in 2025 compared to $96 million in 2024.</span></li></ul></span></div><span><p class=\"\"><span>Hawaiian Electric Industries shares rose on Friday after it swung to profit in the fourth quarter compared to the loss of $68 million reported in the year-ago quarter. </span></p><p class=\"\"><span>Shares in the company jumped 1.5% at the time of writing. </span></p><p class=\"\"><span>Hawaiian Electric Industries and its other companies’ net loss was $45 million in 2025 compared to $96 million in 2024. The lower net loss for the year was primarily due to expenses taken in 2024 related to strategic reviews, and lower Maui wildfire expenses, the company said.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Q4 Earnings</span></strong></p><p class=\"\"><span>The company said that its fourth quarter 2025 net income was $40 million, or $0.23 per share, compared to a net loss of $68 million, or $0.40 per share in 2024. Analysts on average expected a profit of $0.4 per share, as per data from fiscal.ai. </span></p><p class=\"\"><span>“Our core utility business continued to perform well in 2025, operating efficiently and maintaining financial strength while making the critical investments necessary to ensure safe, reliable and resilient service to our communities,” said CEO Scott Seu. </span></p><p class=\"\"><span>“We also saw the utility reaching a 37% renewable portfolio standard in 2025, putting us on track to meet the 40% RPS by 2030 statutory requirement. HEI continues to be well-positioned to execute our commitment to a stronger, more resilient and more financially healthy future,” he added. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hawaiian Electric</span></strong></p><p class=\"\"><span>The company said that its unit Hawaiian Electric’s net income for the fourth quarter of 2025 was $44 million compared to net income of $46 million in the fourth quarter of 2024. </span></p><p class=\"\"><span>The company said that the decrease was primarily driven by the pre-tax items including $7 million in higher interest expense, $1 million in higher O&amp;M expenses and $1 million in higher depreciation expense.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Did Stocktwits Users React?</span></strong></p><p class=\"\"><span>Retail sentiment around HEI trended in ‘bullish’ territory amid ‘high’ message volume. </span></p><p class=\"\"><span>One bullish user wrote, “...they are back on track as they were when the stock was $45, this is an easy buy for me here”.</span></p><p class=\"\"><span>https://stocktwits.com/JMJTrading/message/646163982</span></p><p class=\"\"><span>Shares in the company have risen 46.2% over the past year. </span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:d05020e25094b:0/",
            "pub_date": "2026-02-28 07:21:07",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        }
    ]
}