{
    "data": [
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN4k6JSf:0",
            "title": "Invitation to Haypp Group’s presentation of Full Year report 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">On 13 February at 09:00 CET, Haypp Group will host an audiocast in English. Haypp Group is represented by CEO Gavin O’Dowd and CFO Peter Deli, who will present the Full Year report 2024 and answer questions. The report for will be published at 07:45 CET the same day.</p><p class=\"\">To participate in the webcast or for further information:</p><p class=\"\">https://haypp-group.events.inderes.com/q4-report-2024</p><p class=\"\">To participate in the teleconference:</p><p class=\"\">https://conference.inderes.com/teleconference/?id=5005819</p><p class=\"\">The presentation will also be available at https://hayppgroup.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information and contact</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Markus Lindblad</strong></p><p class=\"\">Head of External Affairs:</p><p class=\"\">+46(0)708153983</p><p class=\"\">markus.lindblad@hayppgroup.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Erik Bloomquist</strong></p><p class=\"\">Head of Investor Relations:</p><p class=\"\">+44(0)7525421916</p><p class=\"\">erik.bloomquist@hayppgroup.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Certified Advisor</strong></p><p class=\"\">FNCA Sweden AB</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN4k6JSf:0-invitation-to-haypp-group-s-presentation-of-full-year-report-2024/",
            "pub_date": "2025-02-05 19:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_MFN3fx6zg:0",
            "title": "Heba reporting strong income from property management FY 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Heba is reporting strong income from property management for FY 2024. Income from property management was SEK 216m (271), well above the target of SEK 200m. Excluding commonhold apartment income in 2023, performance is on par with the company’s best years. The full-year effect of the sale in 2023 of properties that generated almost SEK 100m in rental income is now fully integrated.</p><p class=\"\">The NOI margin FY increased to 72% as compared to 71% in 2023. The change in the value of properties for FY 2024 was SEK 37.9m (-1,084.5), corresponding an uptick of 0.3% (-6.9).</p><div class=\"blockquote-xrkxvh37\">Heba’s full-year performance in 2024 is a sign of strength and shows that we are doing things right. We have outperformed our target for the year. We have a modern property portfolio in attractive locations and a strong financial position. We now have our sights set on the future and are continuing our efforts towards sustainable growth while meeting the needs for housing and community service properties, Patrik Emanuelsson, CEO Heba Fastighets AB.</div><p class=\"\">Energy use had been reduced to a record-low 75 kWh/m2 by the end of the year. The work to reach the target of 40 kWh/m2 in 2030 is ongoing.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures 1 October - 31 December 2024:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Profit for the period amounted to SEK 106.6m (-57.8), corresponding to SEK 0.65 (-0.35) per share.</li><li class=\"listItem-bmN0_SHH\">Income from property management was SEK 46.9m (47.8). The decrease is related to poorer performance in jointly controlled entities and higher interest expenses due to higher interest-bearing liabilities.</li><li class=\"listItem-bmN0_SHH\">Rental income amounted to SEK 143.8m (128.8).</li><li class=\"listItem-bmN0_SHH\">Net operating income (NOI) was SEK 100.9m (86.9).</li><li class=\"listItem-bmN0_SHH\">The change in the value of properties was SEK 70.5m (-80.7).</li><li class=\"listItem-bmN0_SHH\">Heba took ownership in Q4 of an elderly care facility comprising 54 apartments in Enköping.</li></ul><p class=\"\"><strong class=\"root-Tkn6WL2y\">Key figures FY 2024:</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Profit for the year amounted to SEK 98.7m (-712.3), corresponding to SEK 0.60 (-4.31) per share.</li><li class=\"listItem-bmN0_SHH\">Income from property management was SEK 215.5m (270.7). The performance is on par with income from property management in 2023 excluding commonhold apartment income in jointly controlled entities.</li><li class=\"listItem-bmN0_SHH\">Rental income amounted to SEK 561.8m (565.7).</li><li class=\"listItem-bmN0_SHH\">Net operating income (NOI) was SEK 403.8m (402.1).</li><li class=\"listItem-bmN0_SHH\">The change in the value of properties was SEK 37.9m (-1,084.5).</li><li class=\"listItem-bmN0_SHH\">The board of directors proposes a dividend of SEK 0,52 (0.52) per share.</li><li class=\"listItem-bmN0_SHH\">Heba took ownership in Q4 of an elderly care facility comprising 54 apartments in Enköping.</li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_MFN3fx6zg:0-heba-reporting-strong-income-from-property-management-fy-2024/",
            "pub_date": "2025-02-05 19:00:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkrc1Z8Zk:0",
            "title": "Etteplan's Financial Statement Release for 2024 to be published on February 12, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Etteplan<p class=\"\">ETTEPLAN OYJ, Investor News, February 5, 2025, at 1.00 p.m.</p><p class=\"\">Etteplan’s Financial Statement Release for 2024 to be published on February 12, 2025</p><p class=\"\">Etteplan Oyj will publish its Financial Statement Release for 2024 on Wednesday February 12, 2025 at approximately 13.00 (EET). The release and related presentation material will be available in Finnish and in English on the Company’s website at www.etteplan.com after the publishing.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Conference call and live webcast</strong></p><p class=\"\">Etteplan’s President and CEO Juha Näkki will present the Company’s result for 2024 in a conference call and a live webcast, held in English language, on February 12, 2025 starting at 14.30 (EET).</p><p class=\"\">Questions can be asked in Finnish and in English after President and CEO’s presentation only through conference call connection. Participants must register through this link https://palvelu.flik.fi/teleconference/?id=50051395 to ask questions through the conference call lines. After registering the participant will receive a teleconference number and a code to join the call. The participants are asked to press *5 to join the queue for questions.</p><p class=\"\">Juha Näkki’s presentation can be followed as a live webcast on https://etteplan.events.inderes.com/q4-2024 . The webcast starts at 14.30 (EET). A recording of the webcast will be available later at www.etteplan.com.</p><p class=\"\">Espoo, February 5, 2025</p><p class=\"\">Etteplan Oyj</p><p class=\"\">For more information, please contact:</p><p class=\"\">Outi Torniainen, SVP, Marketing and Communications, tel, +358 10 307 3302</p><p class=\"\">DISTRIBUTION:</p><p class=\"\">Nasdaq Helsinki</p><p class=\"\">Major media</p><p class=\"\">www.etteplan.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Etteplan in brief</strong></p><p class=\"\">Etteplan is a growing technology service company with the purpose of bringing people and technologies together to change things for the better. Together with our customers, we are building a world where every system, process, and product can be made smarter, more efficient, and more sustainable. Our customers include world's leading companies in the manufacturing industry.</p><p class=\"\">In 2023, we had a turnover of EUR 360.0 million and around 4,000 professionals in Finland, Sweden, the Netherlands, Germany, Poland, Denmark and China. Etteplan's shares are listed on Nasdaq Helsinki Ltd under the ETTE ticker. www.etteplan.com</p><p class=\"\">https://news.cision.com/etteplan/r/etteplan-s-financial-statement-release-for-2024-to-be-published-on-february-12--2025%2Cc4097755</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkrc1Z8Zk:0-etteplan-s-financial-statement-release-for-2024-to-be-published-on-february-12-2025/",
            "pub_date": "2025-02-05 19:00:07",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr53SBjp:0",
            "title": "UPM's Board of Directors has resolved to establish a new employee share savings arrangement and approved the commencement of new annual plans within UPM share incentive arrangements",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>UPM-Kymmene Oyj<p class=\"\">UPM-Kymmene Corporation Stock Exchange Release (Other information disclosed according to the rules of the Exchange)              5 February 2025 at 13:00 EET</p><p class=\"\">UPM’s Board of Directors has resolved to establish a new employee share savings arrangement and approved the commencement of new annual plans within UPM share incentive arrangements</p><p class=\"\">Employee Share Savings Arrangement</p><p class=\"\">UPM’s Board of Directors has resolved to establish a new Employee Share Savings Arrangement and approved the commencement of the first plan 2025-2028 under the arrangement.</p><p class=\"\">The Employee Share Savings Arrangement is targeted at employees of UPM-Kymmene Corporation and its subsidiaries in the countries where it is legally and administratively feasible.</p><p class=\"\">The purpose of the arrangement is to engage company employees, increase their interest towards company performance and long-term value creation and to align the interests of employees and shareholders. </p><p class=\"\">The Employee Share Savings Arrangement consists of annually commencing plans, subject to the approval of the Board of Directors of UPM in each case, each one comprising of a 12-month savings period and a two-year holding period following the savings period. The employees will have an opportunity to save a proportion of their salaries and invest those savings in UPM shares. The savings will be used to acquire UPM shares from the market quarterly after the publication dates of the respective interim reports. As a reward UPM grants the participating employees a gross reward of one (1) matching share for each two (2) savings shares acquired with their savings. The delivery of the share reward is subject to the continuation of the employment or service and holding of acquired savings shares for the duration of the holding period. Additionally, each employee participating in the first commencing savings period will be rewarded ten (10) free gross shares after the 12-month savings period in July 2026, provided that the employee has not stopped their savings during the savings period and is employed the whole savings period. The applicable taxes will be deducted before the shares are delivered to the participants. Share delivery will be executed by using already existing shares and the arrangement, therefore, has no dilutive effect.</p><p class=\"\">The first savings period is from 1 July 2025 to 30 June 2026. The holding period starts at the initial acquisition of savings shares and ends on 30 June 2028. The maximum monetary amount that all participants collectively may save during the savings period is EUR 22,0 million. The calculatory maximum number of matching shares (gross) and free shares (gross) for the first plan is approximately 478,100, calculated at the prevalent share price provided that the plan limit is met. The estimated maximum expense for the plan, based on UPM’s current share value, is EUR 15,5 million in total. The final number of matching shares depends on the employees’ participation and savings rate in the arrangement, and the fulfilment of the prerequisites for receiving matching shares, as well as the number of shares acquired from the market with savings. The final number of free shares depends on the employees’ participation and the fulfilment of the conditions for receiving free shares.</p><p class=\"\">Deferred Bonus Arrangement</p><p class=\"\">UPM’s Board of Directors has approved the commencement of a new plan for the period 2025–2027 within the company’s Deferred Bonus Arrangement.</p><p class=\"\">The Deferred Bonus Arrangement consists of annually commencing new plans subject to the approval of the Board of Directors of UPM in each case.</p><p class=\"\">The Deferred Bonus Arrangement is targeted at key employees of the Company.</p><p class=\"\">The earning criteria for the Deferred Bonus Plan for the period 2025-2027 are based on the Group and each business area’s EBITDA. The plan for the period 2025–2027 consists of a one-year earning period (2025) and a two-year restriction period following thereafter (2026–2027).</p><p class=\"\">The  Deferred Bonus Plan for the period 2025–2027 covers in total 317 participants. The maximum number of shares (gross) for the plan period in case all the set earning criteria are met in full is approximately 510,300 shares calculated at the prevalent share price. The estimated maximum cost for the plan period is EUR 14,3 million. The estimated maximum number of shares represents the gross value of the rewards of which the applicable taxes will be deducted before the shares are delivered to the participants.</p><p class=\"\">Share delivery will be executed by using already existing shares and the plan, therefore, has no dilutive effect. Besides the attainment of the earning criteria the reward under the plan is subject to the continuation of the employment. The share rewards earned on the basis of the plan for the period 2025–2027 will be delivered in 2028.</p><p class=\"\">Restricted Share Arrangement</p><p class=\"\">UPM’s Board of Directors has approved the commencement of new plan for the period 2025–2028 within the company’s Restricted Share Arrangement.</p><p class=\"\">The Restricted Share Arrangement consists of annually commencing new plans subject to the approval of the Board of Directors of UPM in each case.</p><p class=\"\">The Restricted Share Arrangement is used as a commitment instrument for individually selected participants in specific recruitment and retention situations. The Restricted Share Arrangement is targeted at the President and CEO, Group Executive Team members and other selected members of the senior management. The President and CEO is not eligible to receive a reward from this Arrangement for retention purposes.</p><p class=\"\">The plan for the period 2025-2028 consists of four consecutive years and is divided into the grant period and the vesting period. The grant period comprises the first year of each plan (2025) during which rewards can be granted to the participants. Vesting period comprises the three-year period following the end of a grant period (2026-2028) during which share rewards are delivered in instalments to the participants. The first instalment of the reward shall be delivered no earlier than one year after the date the participant was nominated to the plan.</p><p class=\"\">The share rewards based on the plan 2025–2028 will be delivered to participants in annual instalments by the end of 2028. Share delivery will be executed by using already existing shares and, therefore, has no dilutive effect.</p><p class=\"\">The maximum number of shares that may be granted under the Restricted Share Plan 2025–2028 is 500,000 shares (gross). The maximum number of shares represents the gross value of the rewards of which the applicable taxes will be deducted before the shares are delivered to the participants. No earning criteria is applied to the Restricted Share Arrangement and the delivery of the share reward is subject to the continuation of the employment or service.</p><p class=\"\">In addition to the Restricted Share Arrangement UPM has also Performance Share Arrangement targeted at the President and CEO, Group Executive Team members and other selected members of the senior management. Share reward under this arrangement is subject to the achievement of predefined earning criteria.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM, Media Relations</strong></p><p class=\"\">Mon-Fri 9:00-16.00 EET</p><p class=\"\">Tel. +358 40 588 3284</p><p class=\"\">media@upm.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">UPM</strong></p><p class=\"\">We deliver renewable and responsible solutions and innovate for a future beyond fossils across six business areas: UPM Fibres, UPM Energy, UPM Raflatac, UPM Specialty Papers, UPM Communication Papers and UPM Plywood. As the industry leader in responsibility, we are committed to the UN Business Ambition for 1.5°C and the science-based targets to mitigate climate change. We employ 15,800 people worldwide and our annual sales are approximately EUR 10.3 billion. Our shares are listed on Nasdaq Helsinki Ltd. UPM Biofore – Beyond fossils. www.upm.com</p><p class=\"\">Follow UPM on X | LinkedIn | Facebook | YouTube | Instagram | #UPM #biofore #beyondfossils</p><p class=\"\">https://news.cision.com/upm-kymmene-oyj/r/upm-s-board-of-directors-has-resolved-to-establish-a-new-employee-share-savings-arrangement-and-appr%2Cc4100857</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr53SBjp:0-upm-s-board-of-directors-has-resolved-to-establish-a-new-employee-share-savings-arrangement-and-approved-the-commencement-of-new-annual-plans-within-upm-share-incentive-arrangements/",
            "pub_date": "2025-02-05 19:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkrbt4n4B:0",
            "title": "Mandatum now included in the OMXH25 ESG Responsible[TM] index",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Mandatum Oyj<p class=\"\">Press release, 5 February 2025 at 1:00 p.m. EET </p><p class=\"\">Mandatum has now been included in the OMXH25 ESG ResponsibleTM index, which covers the most traded stocks on the Helsinki Stock Exchange with emphasis on sustainability. Mandatum was added to the index in the latest update on 3 February 2025.</p><p class=\"\">The OMXH25 ESG ResponsibleTM index includes the most traded stocks listed on Nasdaq Helsinki that meet certain ESG criteria. Among others, the fulfilment of these criteria is based on the Sustainalytics rating (source: Nasdaq Index Methodology). The Sustainalytics ESG Risk Rating is one of the most well-known metrics describing companies' sustainability efforts, which investors use to assess companies' ESG risks.</p><p class=\"\">Mandatum succeeded well in the Sustainalytics ESG Risk Rating updated in December 2024, ranking in the low ESG risk category (13.6). Among companies in the asset management and custody services subindustry, Mandatum’s result was in the top two percent. The results have been good also in other sustainability assessments. In the MSCI assessment updated in November 2024, Mandatum achieved an ESG rating of \"AA,\" which reflects a company that is a leader in its industry in managing ESG risks and opportunities. ISS ESG, on the other hand, awarded Mandatum Prime status in October 2024. In addition to high-quality ESG ratings, Mandatum also achieved excellent results in several categories in the UN PRI assessment, which measures the UN Principles for Responsible Investment.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Additional information:</strong> </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Investors</strong></p><p class=\"\">Lotta Borgström  </p><p class=\"\">VP, Investor Relations  </p><p class=\"\">Tel. +358 50 022 1027 </p><p class=\"\">lotta.borgstrom[a]mandatum.fi </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Media</strong></p><p class=\"\">Niina Riihelä  </p><p class=\"\">SVP, Communications, Brand and Sustainability </p><p class=\"\">Tel. +358 40 728 1548 </p><p class=\"\">niina.riihela[a]mandatum.fi    </p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Mandatum in brief</strong> </p><p class=\"\">Mandatum is a major financial services provider that combines expertise in wealth management and life insurance. Mandatum offers clients a wide array of services covering asset and wealth management, savings and investment, compensation and rewards as well as pension plans and personal risk insurance. Mandatum offers services to corporate, retail, institutional and wealth management clients. At the centre of Mandatum's success are highly skilled personnel, a strong brand as well as a proven investment track record. </p><p class=\"\">mandatum.fi/en/group</p><p class=\"\">Copyright ©2025 Sustainalytics, a Morningstar company. All rights reserved. This publication includes information and data provided by Sustainalytics and/or its content providers. Information provided by Sustainalytics is not directed to or intended for use or distribution to India-based clients or users and its distribution to Indian resident individuals or entities is not permitted. Morningstar/Sustainalytics accepts no responsibility or liability whatsoever for the actions of third parties in this respect. Use of such data is subject to conditions available at <em>https://www.sustainalytics.com/legal-disclaimers/</em></p><p class=\"\">https://news.cision.com/mandatum-oyj/r/mandatum-now-included-in-the-omxh25-esg-responsible-tm--index%2Cc4100930</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkrbt4n4B:0-mandatum-now-included-in-the-omxh25-esg-responsible-tm-index/",
            "pub_date": "2025-02-05 19:00:08",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463965:0",
            "title": "EPI (Holdings) Proposes Share Consolidation",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">EPI (Holdings)  is proposing a capital reorganization involving a share consolidation and capital reduction, according to a Tuesday bourse filing. </p><p class=\"\">Under the consolidation, every 10 issued shares of the company will be consolidated into one share. That would bring down the company's existing 5.2 billion issued shares to 524 million. </p><p class=\"\">The oil explorer will then reduce the par value of each issued consolidated share from HK$0.10 to HK$0.01 by canceling HK$0.09 of the paid-up capital on each consolidated share. </p><p class=\"\">After the capital reduction, EPI will have an authorized share capital of HK$1 billion divided into 100 billion new shares with a par value of HK$0.01 each, with 524,034,404 new shares in issue. </p><p class=\"\">The move aims to boost the stock price of EPI as the recent trading prices of its shares have fallen below HK$0.10, which is considered trading at extremity under Hong Kong listing rules.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463965:0/",
            "pub_date": "2025-02-05 19:00:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1BK:0",
            "title": "Kulicke and Soffa Industries Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Kulicke and Soffa Industries Inc  reported quarterly adjusted earnings of 37 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 30 cents.  The mean expectation of five analysts for the quarter was for earnings of 28 cents per share. Wall Street expected results to range from 28 cents to</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue fell 3% to $166.12 million from a year ago; analysts expected $165.00 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Kulicke and Soffa Industries Inc's reported EPS for the quarter was $1.51​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $81.64 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Kulicke and Soffa Industries Inc shares had fallen by 7.0% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 14.8% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no earnings estimate revisions by analysts covering the company.</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 3 \"strong buy\" or \"buy,\" 2 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the semiconductor equipment &amp; testing peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Kulicke and Soffa Industries Inc is $50.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 10:59 a.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.28</p></td><td><p class=\"\">0.37</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.35</p></td><td><p class=\"\">0.34</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.30</p></td><td><p class=\"\">0.35</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.24</p></td><td><p class=\"\">-0.95</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1BK:0-kulicke-and-soffa-industries-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 19:00:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309592:0",
            "title": "Europe May Face Less Competition for U.S. Natural Gas Due to China Tariffs, Commerzbank Says",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">China's 15% tariff on liquefied natural gas imports from the U.S. will likely limit the competition between Asia and Europe for the fuel, Commerzbank said in a Tuesday note. </p><p class=\"\">This comes as a continued high level of withdrawals from natural gas storage facilities in Europe fuel concerns and push European gas to nearly 55 euros per megawatt-hour, the bank noted. </p><p class=\"\">The legal requirement of an EU-wide minimum fill level of 50% for the start of February has been barely met at 53%, Commerzbank said. There remains nearly two months until the end of the withdrawal season. </p><p class=\"\">High withdrawals mean a correspondingly higher requirement for adding gas to storage facilities in the summer months, the bank said. </p><p class=\"\">China is the largest buyer in the global LNG market and accounts for 18% of imports, according to the International Gas Union. However, China sources primarily from Australia and Qatar and only 4.5% of its LNG imports came from the U.S. in 2023.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309592:0/",
            "pub_date": "2025-02-05 19:00:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463967:0",
            "title": "Atome Advances Financing of Green Fertilizer Project in Paraguay",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atome  said Wednesday that financing arrangements for its green fertilizer project in Villeta, Paraguay, are \"coming together\" after a recent visit to the country. </p><p class=\"\">The green fertilizer projects company said the visit included meetings with senior ministers from Paraguay and international funding institutions under its funding consortium. </p><p class=\"\">The flagship project aims to produce 260,000 tonnes of green fertilizer annually.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463967:0/",
            "pub_date": "2025-02-05 19:00:26",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0G3:0",
            "title": "COMMENT-Huge option hedging can magnetise EUR/USD 1.0400-50",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Traders managing FX volatility through options often hedge their currency exposure with cash, which can influence and anchor the spot market near key strike levels as expiries approach.</p><p class=\"\">Soon-to-expire FX option strikes typically generate the biggest hedging flows and since EUR/USD's recovery from Monday's 1.0125 low, it finds itself within a 1.0400-50 zone, where the bulk of soon-to-expire FX option strikes reside.</p><p class=\"\">There are 815 million euros of 1.0400 strikes and a massive 2.2 billion euros of 1.0420-30 strikes expiring at the 10 a.m. New York cut/1500 GMT on Wednesday.</p><p class=\"\">Thursday has over 4 billion euros expiring between 1.0400-15 and there are 1.7 billion euros of 1.0400 strikes expiring on Friday.</p><p class=\"\">The biggest nearby EUR/USD strikes expiring next week are on Monday at 1.0400 for 2.5 billion euros and 1.0450-55 for 5 billion euros. Tuesday at 1.0400 for 1.7 billion euros and 1.0450 for 2.5 billion euros and on Friday at 1.0400 for 3.6 billion euros. </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:598.75px;max-width:1200px;aspect-ratio:2.0041753653444676\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0G3-e4155b13728a5bed6fa72ce185bcbbb0-resized.webp\" type=\"images/webp\"/><img alt=\"EUR/USD FX option strikes expiring Feb 5-14\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L1N3OW0G3-e4155b13728a5bed6fa72ce185bcbbb0-resized.jpeg\" style=\"background-color:#1f1d1c\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">EUR/USD FX option strikes expiring Feb 5-14</span></figcaption></figure></span></p><p class=\"\">For more click on </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0G3:0-comment-huge-option-hedging-can-magnetise-eur-usd-1-0400-50/",
            "pub_date": "2025-02-05 19:00:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW15S:0",
            "title": "Italy's budget watchdog cuts growth estimates as problems mount",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">        Italy's growth this year and next will be weaker than the government's official targets, the country's budget watchdog  said on Wednesday, casting a shadow over prospects for the euro zone's third largest economy.  </p><p class=\"\">The Parliamentary Budget Office (UPB) cut its gross domestic product (GDP) estimates to 0.7% in 2024 and 0.8% this year, down from projections made in October of 0.8% and 1% respectively.</p><p class=\"\">    The Italian economy is expected to grow by 0.9% in 2026, it said.  </p><p class=\"\">    Italy's Treasury sees gross domestic product growing by 1% in 2024, 1.2% this year and 1.1% in 2026.  </p><p class=\"\">    National statistics institute ISTAT will issue full-year 2024 GDP data on March 3.  </p><p class=\"\">    In a blow to Prime Minister Giorgia Meloni's government, economic activity is losing traction despite the arrival in Rome's coffers of regular installments of billions of euros in post-COVID 19 recovery funds from the European Union.  </p><p class=\"\">    Italy's economy stagnated in the fourth quarter of last year from the previous three months,     preliminary data showed     last week, marking the second straight quarter of zero growth.  </p><p class=\"\">    UPB said its downward revision was mainly due to \"higher gas prices and trade tensions.\"  </p><p class=\"\">    U.S. President Donald Trump has announced sweeping tariffs on goods from Mexico, Canada and China - the United States' three biggest trade partners - and has also said tariffs with the European Union would \"definitely happen.\"  </p><p class=\"\">    Italy's problems are compounded by its vulnerability to risks of an energy shock, as the country imports around 95% of the gas it consumes per year.  </p><p class=\"\">    \"The recovery in Italian household confidence, which had characterised the first three quarters of 2024, came to a halt towards the end of last year. This reflects the deterioration in assessments of the general economic situation, with expectations being downgraded,\" UPB said.  </p><p class=\"\">    The worsening outlook comes as the Treasury is preparing to review a raft of macroeconomic estimates in April in its multi-year Document of Economy and Finance (DEF).  </p><p class=\"\">    Although lower growth reduces tax revenues, putting pressure on Italy's strained public finances, the Treasury has so far denied the need for further budget consolidation to reach commitments agreed with European Union authorities.  </p><p class=\"\">    Rome has pledged to bring its budget deficit below the European Union's 3% of GDP ceiling in 2026 from 3.8% targeted in 2024.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW15S:0-italy-s-budget-watchdog-cuts-growth-estimates-as-problems-mount/",
            "pub_date": "2025-02-05 19:00:30",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309600:0",
            "title": "Earnings Flash (ATS.TO) ATS  (Canada) Reports Q3 Adjusted EPS $0.32, vs. FactSet Est of C$0.35",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309600:0/",
            "pub_date": "2025-02-05 19:00:38",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463973:0",
            "title": "Crisil Affirms AA- Rating on Global Health's Bank Loans; Outlook Positive",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Crisil affirmed its long-term rating on Global Health's  bank loan facilities at AA-, and short-term rating on the same financing at A1+. </p><p class=\"\">The rating outlook was positive, according to a Wednesday filing with Indian bourses.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463973:0/",
            "pub_date": "2025-02-05 19:00:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309589:0",
            "title": "Guggenheim Adjusts Price Target on Alphabet to $215 From $220, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet  has an average rating of overweight and mean price target of $216.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309589:0/",
            "pub_date": "2025-02-05 18:52:41",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW16C:0",
            "title": "Hapag-Lloyd says it can cope with U.S.-China tariffs",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">CEO says company can respond to changed trade flows</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Believes U.S. have an interest in economic growth</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Expects Hapag-Lloyd to slightly grow above market</li></ul></span></div><span><p class=\"\">    Container shipping liner Hapag-Lloyd  will be able to cope with the advent of U.S. tariffs on Chinese products, its chief executive told reporters on Tuesday.</p><p class=\"\">\"It is too early to push the panic button,\" CEO Rolf Habben Jansen said in the remarks published on Wednesday, when additional 10% tariffs kicked in, and made before U.S. President Donald Trump proposed that his country to take over the Gaza Strip.</p><p class=\"\">\"Fortunately we are able to react when transport flows change,\" he said, adding foreseeable events were easier to handle than the unexpected ones, such as the Red Sea crisis when the Iran-backed Houthi militants launched attacks on vessels passing the Suez Canal in November 2023.</p><p class=\"\">The tariffs imposed by Trump on China so far should not change the flow of goods too much, said Habben Jansen, who heads the world’s fifth-biggest container company.    In Trump’s first term between 2017 and 2021, he also applied tariffs but global trade had developed well nevertheless, said Habben Jansen. </p><p class=\"\">    \"The U.S. President also wants the U.S. economy to grow. They will need more goods for that,\" he said.    Shipping, a proxy for trade and a health measure of the world economy, could see transport volumes rise between 2.8% and 3% in 2025, he said.    Hapag-Lloyd is expected to grow slightly above the industry average, he added.     The company's Gemini co-operation with Danish peer Maersk  started on Feb. 1, bringing together a network of 340 ships on seven trade corridors.    In preliminary earnings for 2024 issued last week, the company said it saw earnings     quadruple in the fourth quarter    , contributing to a slight rise in annual profit.    Comprehensive 2024 earnings will be released on March 20.  </p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW16C:0-hapag-lloyd-says-it-can-cope-with-u-s-china-tariffs/",
            "pub_date": "2025-02-05 18:53:05",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309588:0",
            "title": "US Equity Futures Slump Premarket as Investors Await ISM Services After Big-Tech Earnings Overnight Hit Sentiment",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309588:0/",
            "pub_date": "2025-02-05 18:53:09",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0DP:0",
            "title": "Copper gains while aluminium retreats on concern about more supply",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Copper prices edged up to their highest in more than a week on Wednesday on a softer dollar while aluminium retreated as raw material prices slumped, raising expectations of more supply.</p><p class=\"\">Three-month copper  on the London Metal Exchange (LME) was up 0.1% at $9,160 a metric ton at 1030 GMT after touching the highest since Jan. 27 at $9,204.</p><p class=\"\">Copper was supported by a weaker dollar index , which was weighed down by a jump in the yen. </p><p class=\"\">A softer dollar makes commodities priced in the U.S. currency less expensive for buyers using other currencies. </p><p class=\"\">The most-active copper contract on the Shanghai Futures Exchange (SHFE)  dipped 0.3% to 75,290 yuan ($10,342.60) a ton on the first day of trading since the Lunar New Year holidays.</p><p class=\"\">LME aluminium  fell 0.9% to $2,613.50 a ton. The metal, used in transport, packaging and construction, had hit its strongest in more than two months on Jan. 20, partly due to worries about shortages of raw material alumina and resulting high prices.</p><p class=\"\">\"The bullishness in aluminium was a bit overdone. With alumina prices a lot lower, there is quite a strong incentive to boost output,\" said Dan Smith, head of research at Amalgamated Metal Trading.</p><p class=\"\">Alumina prices (SAOc1) on SHFE have dropped by a third so far this year to 3,588 yuan per ton after hitting record highs last year.</p><p class=\"\">Smith was also sceptical that there would be strict observance of a government cap on aluminium smelter production in China of 45 million tons a year.</p><p class=\"\">\"I have this hunch that maybe that's not going to be quite as watertight as you might think. It wouldn't surprise me if the supply side in China surprises a bit on the upside.\"</p><p class=\"\">Among other metals, LME zinc  eased 1% to $2,779.50 a ton while lead  climbed 0.7% to $1,984, nickel  gained 0.4% to $15,335 and tin  added 0.9% to $30,530.</p><p class=\"\">($1 = 7.2796 Chinese yuan)</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0DP:0-copper-gains-while-aluminium-retreats-on-concern-about-more-supply/",
            "pub_date": "2025-02-05 18:53:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309584:0",
            "title": "Citigroup Upgrades NXP Semiconductors to Neutral From Sell, Adjusts Price Target to $210 From $200",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NXP Semiconductors  has an average rating of overweight and mean price target of $249.31, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309584:0/",
            "pub_date": "2025-02-05 18:53:20",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW171:0",
            "title": "Zloty firms before Polish interest rate decision",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    The Polish zloty firmed on Wednesday to its highest this week, ahead of Poland's interest rate decision, with no change expected, while other Central Eastern European currencies edged higher against a broadly weaker dollar.</p><p class=\"\">All economists polled by Reuters expect the National Bank of Poland to keep the base rate on hold at 5.75%. The bank has left rates unchanged since October 2023 with its governor Adam Glapinski in January delaying the prospect of easing due to fears of elevated inflation at the end of 2025.</p><p class=\"\">By 1024 GMT the Polish zloty  was up 0.2% against the euro, trading at 4.2040, off of an almost seven-year high of 4.1975 hit in late January.</p><p class=\"\">\"There is no doubt that the (rate-setter) meeting will not bring a change in the level of interest rates, as, according to even the most dovish MPC members, conditions for starting a discussion about rate cuts will only emerge after the publication of the March inflation projection,\" Santander Bank Polska analysts said in a note.</p><p class=\"\">The zloty's gains since Tuesday morning ran parallel to the US dollar's weakening against the euro, they said, adding this may have been linked to the postponement of U.S. tariffs on its neighbours.</p><p class=\"\">According to a note from ING BSK analysts, the lack of a flash estimate for Polish inflation in January means the main piece of news for rate-setters since their previous meeting was the preliminary GDP estimate for 2024.</p><p class=\"\">\"It suggests a clear improvement in economic conditions in the fourth quarter of 2024, which may support no change in the hawkish rate,\" they said, but added that the Polish zloty's strong levels could also be a consideration for the rates path.</p><p class=\"\">In Hungary, the forint  firmed 0.2% to 406.05 per euro, trading at its highest levels since November.</p><p class=\"\">Elsewhere, data on Wednesday showed Czech retail sales climbing by 6.2% year-on-year in December and posting the strongest rise in almost three years.</p><p class=\"\">The Czech crown  gained 0.1% to the euro to 25.1450, pulling away from its lowest since mid-January touched on Monday at 25.27.</p><p class=\"\">The Romanian leu  was flat at 4.9767 per euro</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td colspan=\"6\"><p class=\"\">CEE MARKETS SNAPSHOT AT  1124 CET                                                                                                   </p></td></tr><tr><td colspan=\"2\"><p class=\"\">CURRENCIES                                 </p></td><td><p class=\"\">Latest trade</p></td><td><p class=\"\">Previous close</p></td><td><p class=\"\">Daily change</p></td><td><p class=\"\">Change in 2025</p></td></tr><tr><td><p class=\"\">Czech crown</p></td><td><p class=\"\"></p></td><td><p class=\"\">25.1450</p></td><td><p class=\"\">25.1580</p></td><td><p class=\"\"> +0.05%</p></td><td><p class=\"\"> +0.25%</p></td></tr><tr><td><p class=\"\">Hungary forint</p></td><td><p class=\"\"></p></td><td><p class=\"\">406.1500</p></td><td><p class=\"\">407.0000</p></td><td><p class=\"\"> +0.21%</p></td><td><p class=\"\"> +1.30%</p></td></tr><tr><td><p class=\"\">Polish zloty</p></td><td><p class=\"\"></p></td><td><p class=\"\">4.2040</p></td><td><p class=\"\">4.2105</p></td><td><p class=\"\"> +0.15%</p></td><td><p class=\"\"> +1.73%</p></td></tr><tr><td><p class=\"\">Romanian leu</p></td><td><p class=\"\"></p></td><td><p class=\"\">4.9767</p></td><td><p class=\"\">4.9770</p></td><td><p class=\"\"> +0.01%</p></td><td><p class=\"\">-0.00%</p></td></tr><tr><td><p class=\"\">Serbian dinar</p></td><td><p class=\"\"></p></td><td><p class=\"\">116.9300</p></td><td><p class=\"\">117.0300</p></td><td><p class=\"\"> +0.09%</p></td><td><p class=\"\"> +0.02%</p></td></tr><tr><td colspan=\"6\"><p class=\"\">Note: daily change calculated from 1800 CET                                                                                                 </p></td></tr><tr><td colspan=\"6\"></td></tr><tr><td colspan=\"2\"><p class=\"\">STOCKS                                           </p></td><td><p class=\"\">Latest</p></td><td><p class=\"\">Previous close</p></td><td><p class=\"\">Daily change</p></td><td><p class=\"\">Change in 2025</p></td></tr><tr><td><p class=\"\">Prague</p></td><td><p class=\"\">(.PX)</p></td><td><p class=\"\">1863.01</p></td><td><p class=\"\">1864.7600</p></td><td><p class=\"\">-0.09%</p></td><td><p class=\"\"> +5.84%</p></td></tr><tr><td><p class=\"\">Budapest</p></td><td><p class=\"\"></p></td><td><p class=\"\">84797.34</p></td><td><p class=\"\">84940.65</p></td><td><p class=\"\">-0.17%</p></td><td><p class=\"\"> +6.90%</p></td></tr><tr><td><p class=\"\">Warsaw</p></td><td><p class=\"\"></p></td><td><p class=\"\">2406.74</p></td><td><p class=\"\">2414.96</p></td><td><p class=\"\">-0.34%</p></td><td><p class=\"\"> +9.80%</p></td></tr><tr><td><p class=\"\">Bucharest</p></td><td><p class=\"\"></p></td><td><p class=\"\">17068.16</p></td><td><p class=\"\">16965.31</p></td><td><p class=\"\"> +0.61%</p></td><td><p class=\"\"> +2.08%</p></td></tr><tr><td colspan=\"6\"></td></tr><tr><td colspan=\"2\"><p class=\"\">BONDS                                                                                             </p></td><td><p class=\"\">Yield (bid)</p></td><td><p class=\"\">Yield change</p></td><td><p class=\"\">Spread vs Bund</p></td><td><p class=\"\">Daily change in spread</p></td></tr><tr><td><p class=\"\">Czech Rep 2-year</p></td><td><p class=\"\">(CZ2YT=RR)</p></td><td><p class=\"\">3.4730</p></td><td><p class=\"\">-0.0060</p></td><td><p class=\"\"> +145bps</p></td><td><p class=\"\"> +3bps</p></td></tr><tr><td><p class=\"\">Czech Rep 5-year</p></td><td><p class=\"\">(CZ5YT=RR)</p></td><td><p class=\"\">3.5540</p></td><td><p class=\"\">-0.0260</p></td><td><p class=\"\"> +142bps</p></td><td><p class=\"\"> +1bps</p></td></tr><tr><td><p class=\"\">Czech Rep 10-year</p></td><td><p class=\"\">(CZ10YT=RR)</p></td><td><p class=\"\">3.8780</p></td><td><p class=\"\">-0.0190</p></td><td><p class=\"\"> +152bps</p></td><td><p class=\"\"> +2bps</p></td></tr><tr><td><p class=\"\">Poland 2-year</p></td><td><p class=\"\">(PL2YT=RR)</p></td><td><p class=\"\">5.2720</p></td><td><p class=\"\">-0.0040</p></td><td><p class=\"\"> +325bps</p></td><td><p class=\"\"> +3bps</p></td></tr><tr><td><p class=\"\">Poland 5-year</p></td><td><p class=\"\">(PL5YT=RR)</p></td><td><p class=\"\">5.5770</p></td><td><p class=\"\">-0.0730</p></td><td><p class=\"\"> +345bps</p></td><td><p class=\"\">-4bps</p></td></tr><tr><td><p class=\"\">Poland 10-year</p></td><td><p class=\"\">(PL10YT=RR)</p></td><td><p class=\"\">5.8750</p></td><td><p class=\"\">-0.0230</p></td><td><p class=\"\"> +352bps</p></td><td><p class=\"\"> +2bps</p></td></tr><tr><td colspan=\"6\"></td></tr><tr><td colspan=\"2\"><p class=\"\">FORWARD RATE AGREEMENTS</p></td><td><p class=\"\">3x6</p></td><td><p class=\"\">6x9</p></td><td><p class=\"\">9x12</p></td><td><p class=\"\">3M interbank</p></td></tr><tr><td><p class=\"\">Czech Rep</p></td><td><p class=\"\">(CZKFRA), (PRIBOR=)</p></td><td><p class=\"\">3.59</p></td><td><p class=\"\">3.42</p></td><td><p class=\"\">3.36</p></td><td><p class=\"\">3.83</p></td></tr><tr><td><p class=\"\">Hungary</p></td><td><p class=\"\">(HUFFRA), (BUBOR=)</p></td><td><p class=\"\">6.88</p></td><td><p class=\"\">6.73</p></td><td><p class=\"\">6.53</p></td><td><p class=\"\">6.50</p></td></tr><tr><td><p class=\"\">Poland</p></td><td><p class=\"\">(PLNFRA), (WIBOR=)</p></td><td><p class=\"\">5.80</p></td><td><p class=\"\">5.43</p></td><td><p class=\"\">5.07</p></td><td><p class=\"\">5.86</p></td></tr><tr><td colspan=\"6\"><p class=\"\">Note: FRA quotes are for ask prices                                                                                                                          </p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW171:0-zloty-firms-before-polish-interest-rate-decision/",
            "pub_date": "2025-02-05 18:53:46",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309591:0",
            "title": "Daiwa Securities Adjusts Price Target on Microsoft to $533 From $520, Keeps Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Microsoft  has an average rating of buy and mean price target of $508.88, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309591:0/",
            "pub_date": "2025-02-05 18:53:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNE8HQc3W:0",
            "title": "Hansen Trade Experiences Strong Growth, Strategic Market Expansion",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Energy companies across the Nordics and Western Europe, including the United Kingdom, are benefiting from the modular software offered by Hansen Trade, being showcased at E-World 2025</p><p class=\"\">MELBOURNE, Australia, Feb.  05, 2025  (GLOBE NEWSWIRE) — Hansen Technologies , a leading global provider of software and services to the energy, utilities, communications, and media industries, is excited to announce significant and continued growth for Hansen Trade. Fuelled by the solution's unique capabilities, advanced automation tools, and proven track record, Hansen Trade is increasingly the preferred option for energy traders in the Day-Ahead, Intraday, and Ancillary Service markets. Hansen will showcase its energy trading and data management solutions at E-World, taking place in Essen from February 11th–13th.</p><p class=\"\">Hansen Trade, designed to enrich trading strategies and overall market performance, helps position organisations to expand their activities to operate across multiple markets simultaneously, the emerging <em>multi-market optimisation</em> capability. Over the past year, Hansen Trade has been embraced by new customers such as Stockholm Exergi alongside other organisations in Norway, Sweden, and the United Kingdom. Simultaneously, Hansen continues to deepen relationships with numerous existing customers adding Hansen Trade modules to their toolkits, including Bixia, Fortum, Malarenergi, Skellefteå Kraft, Tampereen Energia, and Varberg Energi.</p><p class=\"\">“The energy trading market is one of the most dynamic out there. It demands a laser focus on conceiving and delivering innovative solutions to help companies be as competitive as they can,” explains <!-- -->David Castree, President, Energy &amp; Utilities Division at Hansen. “We are thrilled that so many organisations across Europe and the Nordic region are turning to Hansen and Hansen Trade to support them navigate this rapidly evolving market.”</p><p class=\"\">Leveraging an intuitive, user-friendly interface and robust automation tools, Hansen Trade streamlines trading operations through its seamless integration with major trading exchanges such as EPEX SPOT, Nord Pool, and Transmission System Operator (TSO) markets. Maximising asset utilisation and performance, Hansen Trade enhances operational agility for the growing Balance Responsible Party (BRP) community. The robust flexibility and performance of Hansen Trade have received widespread praise from customers, many of whom are now expanding their usage into new regions and markets, and developing additional operational scenarios</p><p class=\"\">“Our commitment has always been to equip energy traders with the best tools to thrive in this fast-paced market,” Castree added. “The momentum we are experiencing reflects the dedication of our team and the partnerships we've cultivated with our customers. We are excited about the future and how we can continue to be an innovative partner of choice.”</p><p class=\"\">At E-world 2025, Hansen joins forces with powercloud, our recently acquired billing platform provider optimised for the German market. Now, in one booth, visitors can learn, discuss, and debate pragmatic solutions to the critical challenges facing the entire energy market value chain, ranging from energy trading and data management to customer billing, market communication, and regulatory compliance.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Hansen Trade</strong></p><p class=\"\">Part of the Hansen Suite for Energy &amp; Utilities, Hansen Trade operates as a cloud-based modular SaaS solution designed to meet the scalability and flexibility demands of the evolving energy trading market. As a premier software platform for energy traders in Europe's short-term physical markets, Hansen Trade enables clients to automate trading positions, minimise imbalance costs, optimise asset performance, and expertly navigate the Day-Ahead, Intraday, and Ancillary Service markets. Trusted by energy professionals across the Nordics and beyond, Hansen Trade is committed to innovation and customer success.</p><p class=\"\">For more information, visit www.hansencx.com</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNE8HQc3W:0-hansen-trade-experiences-strong-growth-strategic-market-expansion/",
            "pub_date": "2025-02-05 18:54:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003356:0",
            "title": "Clorox Is Maintained at Neutral by DA Davidson",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(10:54 GMT) </strong>Clorox Price Target Cut to $169.00/Share From $171.00 by DA Davidson</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003356:0/",
            "pub_date": "2025-02-05 18:54:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309587:0",
            "title": "Citigroup Upgrades Molson Coors Beverage to Neutral From Sell, Adjusts Price Target to $57 From $47",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Molson Coors Beverage  has an average rating of hold and mean price target of $62.67, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309587:0/",
            "pub_date": "2025-02-05 18:54:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309590:0",
            "title": "Jefferies Upgrades Cardinal Health to Buy From Hold, Adjusts Price Target to $150 From $140",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Cardinal Health  has an average rating of overweight and mean price target of $144.71, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309590:0/",
            "pub_date": "2025-02-05 18:54:39",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:G2463964:0",
            "title": "Life Science REIT Leases Remaining Space at Rolling Stock Yard in UK",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Life Science REIT  leased a fully fitted space at Rolling Stock Yard in the UK to CFDX, bringing the building to 100% occupancy. </p><p class=\"\">The neuroscience company signed an eight-year lease for the 5,100 square-foot space at 110 pounds sterling per square foot, with a four-year break clause, the real estate investment trust said Wednesday.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:G2463964:0/",
            "pub_date": "2025-02-05 18:54:46",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW1AW:0",
            "title": "Gold miners: mind the gap",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><div class=\"summary-pIO_GYwT\"><div class=\"summaryTitle-pIO_GYwT\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">STOXX flat</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Santander, Novo Nordisk, GSK all gain on results</li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\">Nasdaq futures down 1%, S&amp;P500 futures down 0.5%</li></ul></span></div><span><p class=\"\">        GOLD MINERS: MIND THE GAP</p><p class=\"\">Gold  is shining bright. </p><p class=\"\">The precious metal has been hitting one record high after another this year, spurred by central bank buying and safe-haven demand. The latest peak this morning at $2,869.68 per ounce.</p><p class=\"\">Yet, gold miners are having less of a ride and for J.P.Morgan this means current prices still offer a good entry point, given the strong outlook for the metal, particularly if trade tensions and tariff risks continue to unsettle markets.    </p><p class=\"\">\"Although recent investor marketing indicates a bullish gold outlook is widely shared, there is less conviction or consensus on how to be positioned in the sub-sector,\" note JPM analysts.</p><p class=\"\">\"Thus, we still see a compelling entry point for the EMEA Gold Miners given they screen exceptionally cheap with &gt;10% FCF yields and pose fewer operational risks following recent guidance updates,\" they added in a research note.</p><p class=\"\">JPM notes that since reiterating its bullish view three months ago, gold has risen around 4% and gold miners are largely flat. Its top pick is now Fresnillo . </p><p class=\"\"><span class=\"container-S5VA5POt\"><figure><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-S5VA5POt\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:798.6091794158554px;aspect-ratio:1.3310152990264257\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW1AW-96847f8138ecd93c7b250cafef86bfd9-resized.webp\" type=\"images/webp\"/><img alt=\"snapshot\" class=\"image-gDIex6UB image-S5VA5POt\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2025:newsml_L8N3OW1AW-96847f8138ecd93c7b250cafef86bfd9-resized.jpeg\" style=\"background-color:#221e1c\"/></picture></div><figcaption class=\"caption-S5VA5POt\"><span class=\"copyright-S5VA5POt\">Thomson Reuters</span><span class=\"description-S5VA5POt\">gold</span></figcaption></figure></span></p><p class=\"\">(Danilo Masoni)</p><p class=\"\">*****     </p><p class=\"\">FOR EARLIER LIVE MARKETS POSTS</p><p class=\"\">BIG GAINERS BUT STOXX 600 FLAT CLICK HERE</p><p class=\"\">EUROPE BEFORE BELL: EARNINGS KEEP YOU BUSY CLICK HERE</p><p class=\"\">MARKETS CONFOUNDED BY TRUMP'S GAZA PROPOSAL CLICK HERE</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW1AW:0-gold-miners-mind-the-gap/",
            "pub_date": "2025-02-05 18:55:21",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205003319:0",
            "title": "Varonis Systems Price Target Maintained With a $67.00/Share by Needham",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205003319:0/",
            "pub_date": "2025-02-05 18:46:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309571:0",
            "title": "Trade, Tech Outlooks Roil Asian Stock Markets",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Asian stock markets churned Wednesday on evolving China-US trade tensions and after tempered earnings-reports overnight from US-based tech titans Alphabet (GOOG, GOOGL) and Advanced Micro Devices (AMD). </p><p class=\"\">Traders also weighed an announcement by the US Postal Service that it was was suspending inbound parcels from China and Hong Kong, pending resolution of certain tariff issues. </p><p class=\"\">Hong Kong and Shanghai finished in the red, although Tokyo inched ahead. Other regional exchanges were mixed, but with Seoul and Taiwan hitting the upside. </p><p class=\"\">In Japan, the Nikkei 225 opened higher but waned, and finished up only 0.1% as a firming yen undercut export issues. </p><p class=\"\">The benchmark Nikkei 225 rose 33.11 to 38,831.48, although losing issues outnumbered gainers 124 to 98. </p><p class=\"\">Leading the upside was video-game maker Bandai Namco, up 13.7%, while Yokogama Electric declined 7.1%, with both moves following earnings reports. </p><p class=\"\">In economic news, real wages in December in Japan rose 0.6% on year, although real wages declined for the full year 2024, off 0.2% from 2023, reported the Ministry of Health, Labor and Welfare. </p><p class=\"\">In other news, the Japan services purchasing managers index (PMI) rose to 53.0 in January, up from 50.9 in December 2024, and rising further above the 50-marker that separates growth from contraction, reported S&amp;P Global, citing its monthly survey. </p><p class=\"\">The nation's composite PMI, a combination of the services and manufacturing sectors, rose to 51.1 in January, up from 50.5. </p><p class=\"\">In Hong Kong, the Hang Seng Index opened lower and could not recover, finishing off 0.9% as traders weighed Beijing-Washington tensions and the earnings season. </p><p class=\"\">The broad gauge Hang Seng fell 192.87 to 20,597.09, as losing issues outnumbered gainers 67 to 15. The Hang Seng TECH Index lost 1% on the day, while the Mainland Properties Index fell 1.4%. </p><p class=\"\">Leading the upside was computer-maker Lenovo, gaining 4%, while Nongfu Spring declined 6.9%. </p><p class=\"\">On the mainland, the Shanghai Composite reopened after New Year holidays and fell 0.7% to 3,229.49. </p><p class=\"\">In economic news, the seasonally adjusted Caixin/S&amp;P Global China services purchasing managers index (PMI) posted at 51.0 in January, down from 52.2 in December, reported S&amp;P Global. </p><p class=\"\">China's January composite PMI logged at 51.1 in January, down from 51.4 in December. </p><p class=\"\">On the other regional exchanges, the S. Korean KOSPI rose 1.1%; the Taiwan TWSE inclined 1.6%; the Australian ASX 200 inclined 0.5%; the Singapore Straits Times Index fell 0.2%, and the Thai Set declined 1.1%. In late trading in Mumbai, the Sensex was down 0.4%. </p><p class=\"\">In other news, India's services purchasing managers index (PMI) posted at 56.5 in January, down from 59.3 in December, reported S&amp;P Global. </p><p class=\"\">India's January composite PMI logged at 57.7 in January, down from 59.2 in December.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309571:0-trade-tech-outlooks-roil-asian-stock-markets/",
            "pub_date": "2025-02-05 18:48:13",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3309582:0",
            "title": "CBOE Volatility Index Jumps 2% Pre-Bell Ahead of ISM Services as Big Tech Results Disappoint Overnight",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3309582:0/",
            "pub_date": "2025-02-05 18:48:23",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW0V4:0",
            "title": "Street View: PepsiCo needs more fizz to battle challenging snack market",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">**  PepsiCo  forecast annual profit below expectations and missed quarterly revenue estimates on Tuesday, as the company battles weak demand for its sodas and snacks such as Lay's in the U.S., its largest market</p><p class=\"\">** PEP shares up 0.7% at $144.5 premarket</p><p class=\"\">FLAT FIZZ IN THE SODA AISLE</p><p class=\"\">** RBC (\"sector perform\", PT: $164) believes PEP should consider refranchising its bottling operations in North America</p><p class=\"\">** Morgan Stanley (\"equal-weight,\" PT: $168) says co's overall sales growth is slow due to weak performance in North America's snack category and losses in the PEP's beverage market share</p><p class=\"\">** J.P.Morgan (\"neutral,\" PT: $158) says the U.S. snacking market is becoming more challenging and PEP's absolute earnings performance have been negatively affected by the stronger dollar in recent years</p><p class=\"\">** Morningstar (fair value: $174) sees growth potential in zero-sugar recipes and protein drinks but expect co to also invest in promotions in value-focused channels to boost sales volume</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW0V4:0-street-view-pepsico-needs-more-fizz-to-battle-challenging-snack-market/",
            "pub_date": "2025-02-05 18:48:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        }
    ]
}