{
    "data": [
        {
            "id": "tag:reuters.com,2026-02-28:newsml_EM9n44KTa:0",
            "title": "YBS SA - Raport kwartalny za IV kwartał",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Additional attachments can be found below:</span></p><p class=\"\"><span>20260228_173346_0000001410_0000065177.pdf</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM8cydsta\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p><p class=\"\"><span>20260228_173346_0000001410_0000065178.xhtml</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://newsfile.refinitiv.com/getnewsfile/v1/story?guid=urn:newsml:reuters.com:20260228:nEM5h9yZMa\" rel=\"nofollow\" target=\"_blank\">newsfile.refinitiv.com/getnewsfile/v1/story</a></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_EM9n44KTa:0-ybs-sa-raport-kwartalny-za-iv-kwarta/",
            "pub_date": "2026-03-01 00:34:01",
            "source": "Polish Emitent",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO0A1:0",
            "title": "India braces for hotter-than-normal summer, more heatwave days expected",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>India is set to experience a hotter-than-normal summer this year, with heatwave days during March and May expected to exceed the seasonal average, the weather office said on Saturday.</span></p><p class=\"\"><span>In March, the first month of the summer season, minimum temperatures are likely to remain above average across most areas, said Mrutyunjay Mohapatra, director-general of the India Meteorological Department (IMD).</span></p><p class=\"\"><span>In February, both maximum and minimum temperatures were above average, making it the fifth-warmest February since records began in 1901, according to IMD data.</span></p><p class=\"\"><span>Winter crops such as wheat, rapeseed, and chickpeas are planted from October to December and require cold weather conditions throughout their growth cycle for optimal yields.</span></p><p class=\"\"><span>Above-average temperatures in March could affect the grain size of maturing winter-sown crops, potentially reducing yields, said a Mumbai-based dealer with a global trade house.</span></p><p class=\"\"><span>India, the world's second-largest wheat producer and biggest importer of edible oils, is counting on bumper 2026 crops to export surplus wheat and cut costly imports of palm, soy and sunflower oils.</span></p><p class=\"\"><span>\"Above-normal heatwave days are expected over most parts of the country during March to May 2026,\" said Mohapatra.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO0A1:0-india-braces-for-hotter-than-normal-summer-more-heatwave-days-expected/",
            "pub_date": "2026-03-01 00:21:28",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2955229:0",
            "title": "PNPN: Ultra-pure graphene, scalable tech, and regulatory wins set stage for rapid commercial growth",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Graphene production technology enables ultra-pure, high-speed material at low cost, with regulatory approvals and strategic partnerships positioning for rapid commercial expansion. Large-scale orders and Nasdaq listing are anticipated, with strong margins and a robust patent portfolio.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2955229:0-pnpn-ultra-pure-graphene-scalable-tech-and-regulatory-wins-set-stage-for-rapid-commercial-growth/",
            "pub_date": "2026-03-01 00:24:37",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSqKR0Ca:0",
            "title": "New to The Street to Broadcast Executive Leadership Interviews Featuring Medicus Pharma Ltd. (NASDAQ:MDCX), CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. (NASDAQ:VVOS), and Virtuix Holdings ($VTIX) on Bloomberg Television Tonight at 6:30 PM EST",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The Show Will Also Air Across Latin America and MENA 1230 pm local time.</span></p><p class=\"\"><span>NEW YORK CITY, NEW YORK / ACCESS Newswire / February 28, 2026 / New to The Street will broadcast nationally tonight at 6:30 PM EST on Bloomberg Television, featuring executive leadership interviews with Medicus Pharma Ltd. </span><span>, CitroTech (NYSE:CITR), Vivos Therapeutics, Inc. </span><span>, and Virtuix Holdings (NASDAQ:VTIX).</span></p><p class=\"\"><span>The program will air across Bloomberg's U.S. platform and will also broadcast throughout Latin America and the Middle East &amp; North Africa (MENA), expanding global visibility for each company's strategic initiatives and growth outlook.</span></p><p class=\"\"><span>Each executive interview delivers in-depth discussion around corporate strategy, market positioning, upcoming catalysts, and long-term value creation. The show continues to connect innovative public companies with a global investor audience through structured, recurring national exposure.</span></p><p class=\"\"><span>In addition to national television distribution, the segments will be amplified across New to The Street's digital ecosystem, including its 4.4M+ subscriber YouTube channel - the largest YouTube subscriber base in the public-company media space - along with integrated distribution across X, LinkedIn, Instagram, and Facebook.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About New to The Street</span></strong></p><p class=\"\"><span>New to The Street is a 17-year-old financial television brand broadcasting weekly as sponsored programming across multiple linear television networks, including Bloomberg Television and Fox Business. The platform delivers long-form executive interviews filmed from premier financial venues including the NYSE and Nasdaq MarketSite.</span></p><p class=\"\"><span>With over 4.4 million YouTube subscribers - the largest dedicated subscriber base in the public company media category - New to The Street combines national television reach, global broadcast distribution across the U.S., Latin America, and MENA, and a powerful digital amplification engine.</span></p><p class=\"\"><span>New to The Street TV can be viewed on YouTube at:</span></p><p class=\"\"><span>https://youtube.com/@newtothestreettv?si=JdWxFdCXg6smGoiz</span></p><p class=\"\"><span>The platform provides predictable, recurring visibility designed to support corporate growth narratives and investor engagement.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broadcast Details:</span></strong></p><p class=\"\"><span>6:30 PM EST - Bloomberg Television</span></p><p class=\"\"><span>Also airing across Latin America and MENA</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For media inquiries:</span></strong></p><p class=\"\"><span>Monica Brennan</span></p><p class=\"\"><span>Monica@NewtoTheStreet.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE:</span></strong><span> New to The Street</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSqKR0Ca:0/",
            "pub_date": "2026-03-01 00:30:00",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "eqs:4ad92aa33094b:0",
            "title": "CGTN: How China's path of democracy safeguards people's rights and interests",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span> </span></p><p class=\"\"><span>CGTN/ Key word(s): Miscellaneous </span></p><p class=\"\"><span> CGTN: How China's path of democracy safeguards people's rights and interests </span></p><p class=\"\"><span> 28.02.2026 / 16:55 CET/CEST</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><em><span>Ahead of China's annual key political meetings – the Two Sessions, CGTN published an article elaborating how China's whole-process people's democracy works at the grassroots level and how it safeguards the rights and interests of the people. Through a comprehensive introduction of China's democratic practice, the article stresses that this approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</span></em></p><p class=\"\"><span>BEIJING, Feb. 28, 2026 /PRNewswire/ -- A legislative outreach office in Shanghai's Changning District, established in 2015 in the Hongqiao Subdistrict by the Legislative Affairs Commission of the Standing Committee of the National People's Congress (NPC), has become a landmark in China's democratic progress.</span></p><p class=\"\"><span>Residents can offer suggestions and feedback on legislative work close to home. Through this office, the opinions of local residents gathered by legislators were relayed to higher levels and taken into consideration during the legislation process.</span></p><p class=\"\"><span>The Shanghai neighborhood has come to epitomize the country's whole-process people's democracy following a visit by Chinese President Xi Jinping in November 2019, when he coined the term for the first time.</span></p><p class=\"\"><span>As of 2025, the Legislative Affairs Commission of the NPC Standing Committee had established 54 such outreach offices across the country, and there were more than 7,800 such offices established by provincial or municipal legislatures. These platforms have served as vital bridges between residents and lawmakers, ensuring that democratic participation is embedded in the legislative process.</span></p><p class=\"\"><span>While Western democracies often equate democracy with elections, China's whole-process people's democracy ensures public participation throughout the entire process of governance, covering all aspects of the democratic process and all sectors of society. This approach fosters broad and continuous participation, ensuring that governance decisions reflect the collective will and evolving needs of society.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Extensive participation</span></strong></p><p class=\"\"><span>China's whole-process people's democracy integrates democratic practices across all government levels and at every stage of policymaking – from election and consultation to decision-making, implementation and oversight.</span></p><p class=\"\"><span>It is embodied in the Two Sessions – the annual meetings of China's top legislature, the NPC and the top political advisory body, the National Committee of the Chinese People's Political Consultative Conference (CPPCC). Thousands of NPC deputies and CPPCC National Committee members convene in Beijing to deliberate on and discuss major policies and governance matters, representing a broad cross-section of society.</span></p><p class=\"\"><span>Over the years, innovation and creativity in grassroots democracy across urban and rural areas nationwide have become more dynamic than ever, unleashing great vitality at the grassroots level. From \"courtyard meeting halls\" and \"bench meetings\" to offline \"roundtable meetings\" and online \"deliberation groups,\" these pragmatic democratic practices based on local characteristics have provided sustained momentum for the development of China's democracy.</span></p><p class=\"\"><span>In 2025, various departments of the State Council handled a total of 8,754 suggestions from NPC deputies and 4,868 proposals from CPPCC National Committee members, accounting for 95.6 percent and 97.3 percent of the total number of suggestions and proposals, respectively, according to a press conference held by the State Council Information Office on Friday. In particular, these departments adopted more than 4,900 suggestions and proposals from deputies and members, and issued more than 2,200 related policies and measures.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Pooling wisdom for 15th Five-Year Plan</span></strong></p><p class=\"\"><span>The drafting of China's 15th Five-Year Plan (2026–2030) for economic and social development provides another vivid example. Deliberations on the draft outline are among the most closely watched items on the agenda of this year's Two Sessions.</span></p><p class=\"\"><span>On Friday, a key leadership meeting was held to discuss a draft outline of the 15th Five-Year Plan and a draft government work report to be submitted by the State Council to the upcoming annual session of the national legislature for review.</span></p><p class=\"\"><span>Formulating the 15th Five-Year Plan has been a process of practicing whole-process people's democracy. From May 20 to June 20 last year, China launched an online public consultation to gather opinions for its next five-year plan. The initiative drew over 3.11 million valid submissions, yielding more than 1,500 constructive suggestions across 27 topics.</span></p><p class=\"\"><span>A summary of these findings was reviewed by Xi and submitted to the Party leadership, ensuring that citizens' voices were heard at the highest level. By September, a total of 2,112 suggestions had been collected from various regions, departments and sectors, resulting in 218 revisions to the document.</span></p><p class=\"\"><span>This broad-based participation demonstrates that national development strategies are rooted in public will, gathering strong momentum for Chinese modernization.</span></p><p class=\"\"><span>\"This whole-process people's democracy China is carrying out aligns with the goal of putting the people at the center. It enables them to decide and feel that they are the protagonists of the historical process that is taking place in China and the beneficiaries of the transformations that are happening,\" said Argentine sociologist Marcelo Rodriguez, director of the Hector P. Agosti Center for Marxist Studies and Training.</span></p><p class=\"\"><em><span>For more information, please click:</span></em><em><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=88ee8d8aa88c6831835d3eff048aa265&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://news.cgtn.com/news/2026-02-27/How-China-s-path-of-democracy-safeguards-people-s-rights-and-interests-1L6w4JWN8yI/p.html</a></em></p><p class=\"\"><span> View original content:</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=75f6d603c3e165880007ea4782f3ac5f&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">https://www.prnewswire.co.uk/news-releases/cgtn-how-chinas-path-of-democracy-safeguards-peoples-rights-and-interests-302700197.html</a></p><p class=\"\"><span> 28.02.2026 CET/CEST Dissemination of a Corporate News, transmitted by </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=2be925ac0334ae7b4f51fbaee4a6daf0&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS News</a><span> - a service of </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=redirect&amp;url=f5d50dc7e8798b6eb177f7955e598e60&amp;application_id=2283322&amp;site_id=airport_aws~~~7cc68db1-74de-43c8-af69-2ae0a97efdc3&amp;application_name=news\" rel=\"nofollow\" target=\"_blank\">EQS Group</a><span>.</span></p><p class=\"\"><span>The issuer is solely responsible for the content of this announcement.</span></p><p class=\"\"><span>The EQS Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.</span></p><span> </span><p class=\"\"><span>2283322 28.02.2026 CET/CEST </span><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>Saving the news in databases or any forwarding of the news to third parties in a commercial context or for commercial purposes is only permitted with the prior written consent of EQS Group AG.</span></div></section></p></span></div></div>",
            "link": "https://www.tradingview.com/news/eqs:4ad92aa33094b:0-cgtn-how-china-s-path-of-democracy-safeguards-people-s-rights-and-interests/",
            "pub_date": "2026-02-28 23:55:22",
            "source": "EQS",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3SG039:0",
            "title": "ADNOC says operations continuing without interruption",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Abu Dhabi National Oil Company (ADNOC) said on Saturday that its operations were continuing without interruption. </span></p><p class=\"\"><span>In response to questions after the U.S. and Israeli strikes on Iran, a spokesperson for ADNOC said the company was closely monitoring the situation and coordinating with relevant authorities.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3SG039:0-adnoc-says-operations-continuing-without-interruption/",
            "pub_date": "2026-03-01 00:04:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:summary_document_transcript:quartr.com:2955094:0",
            "title": "PNPN: Ultra-pure graphene, rapid scale-up, and Nasdaq listing drive strong growth prospects",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Graphene production technology enables ultra-fast electron flow and industry-leading purity, validated by independent testing. Recent regulatory approvals and strategic partnerships position the company for rapid commercialization, high profitability, and a Nasdaq listing by end of Q2.</span></p><p class=\"\"><span>Based on </span></p><section class=\"variant-secondary-aHOVUrmQ disclaimer-fdvjGD1u\"><b class=\"heading-wrapper-aHOVUrmQ\"><span class=\"heading-aHOVUrmQ\">Disclaimer</span></b><div class=\"content-aHOVUrmQ link-with-underline-aHOVUrmQ\"><span>This is an AI-generated summary and may contain inaccuracies. Please verify any important information with the original source.</span></div></section></span></div></div>",
            "link": "https://www.tradingview.com/news/urn:summary_document_transcript:quartr.com:2955094:0-pnpn-ultra-pure-graphene-rapid-scale-up-and-nasdaq-listing-drive-strong-growth-prospects/",
            "pub_date": "2026-03-01 00:07:25",
            "source": "Quartr",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_S8N3V404Y:0",
            "title": "OPEC+ may consider 411,000 bpd oil output boost, sources say after Iran strike",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>    OPEC+ is likely to consider a larger oil output increase of 411,000 barrels per day at its imminent meeting, two sources familiar with OPEC+ thinking said on Saturday, after the U.S. and Israel launched </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/world/iran-crisis-live-explosions-tehran-israel-announces-strike-2026-02-28/\" rel=\"nofollow\" target=\"_blank\">military strikes</a><span> on Iran.</span></p><p class=\"\"><span>Eight members of the grouping of the Organization of the Petroleum Exporting Countries and allies including Russia were already scheduled to meet on Sunday.</span></p><p class=\"\"><span>Delegates had earlier said the eight would probably agree to a modest increase of 137,000 bpd for April, as the group prepares for summer demand and as crude prices had risen on expectations of a U.S. attack on Iran, which happened on Saturday. </span></p><p class=\"\"><span>Both sources, who declined to be identified by name, said an increase of 411,000 bpd was now being considered.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_S8N3V404Y:0-opec-may-consider-411-000-bpd-oil-output-boost-sources-say-after-iran-strike/",
            "pub_date": "2026-02-28 23:45:17",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_ACSKpgFpa:0",
            "title": "Understanding Common Dental Issues That Develop Over Time in Richardson, TX",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>NEW YORK CITY, NEW YORK / ACCESS Newswire / February 28, 2026 / Some dental issues don't appear overnight; they develop gradually and show symptoms over time. Yes, many are preventable or manageable, but you have to catch them early before they deteriorate, which highlights the importance of regular dental visits. Dental issues can be a result of poor oral hygiene, and this is what your dentist in Richardson, TX, can monitor and address before it leads to more serious problems. In this article, we'll discuss the most common dental issues, their causes, symptoms, and prevention tips.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Tooth decay in different life stages</span></strong></p><p class=\"\"><span>Also known as dental caries, tooth decay is a dental disease that can affect people of all ages. It occurs when bacteria and acids break down tooth enamel, creating cavities. This process is most often caused by the long-term consumption of sugary and acidic foods, such as sweets and soda. Other habits, including brushing too hard, not brushing enough, and bruxism, can also cause tooth decay.</span></p><p class=\"\"><span>Plaque can also develop around pre-existing dental work, such as crowns and fillings. Over time, the tooth or restorations start to wear down and form gaps through which bacteria can enter.</span></p><p class=\"\"><span>Catching tooth decay early makes treatment simpler and prevents future complications. Early signs of tooth decay include tooth sensitivity, mild pain, and black, brown, or white spots on the enamel. Tooth decay can be prevented by routine dentist visits and regular brushing and flossing with fluoride toothpaste and mouthwash to help prevent cavities and strengthen enamel.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Gum disease progression</span></strong></p><p class=\"\"><span>Gum disease is a condition in which gum tissue recedes, exposing the root of the tooth. In the early stage, called gingivitis, the gum appears red or swollen and can bleed when you brush or floss. At this stage, the condition is reversible with thorough oral cleaning by a dentist. If left untreated, it can progress to periodontitis, where the gums pull away from the teeth, leading to bone loss and eventually permanent tooth loss. If such progression occurs, it causes irreversible jawbone loss, which affects multiple teeth and broader overall health issues. Treating gum disease typically involves periodontal therapy, improved at-home oral care, and regular monitoring by a Richardson dentist.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Dry mouth and its effects</span></strong></p><p class=\"\"><span>Saliva plays a major role in maintaining oral health. It protects your teeth from decay by constantly washing away food particles, neutralizing all harmful acids, and controlling bacteria in the mouth. Dry mouth is a condition more prevalent among the elderly. Saliva production naturally decreases as a person ages, but taking certain medications, such as some used to treat high blood pressure, cancer, high cholesterol, and others, can also reduce the amount of saliva you produce.</span></p><p class=\"\"><span>Dry mouth leads to gum irritation, tooth decay, and difficulties in tasting, eating, and speaking. Luckily it can be managed by always staying hydrated or chewing sugar-free gum or lozenges to stimulate saliva. You can also discuss possible medication alternatives with your dentist.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Jawbone loss</span></strong></p><p class=\"\"><span>Jawbone loss occurs gradually and is primarily caused by missing teeth. When the jawbone isn't stimulated by chewing pressure from teeth, it gradually shrinks. It is also caused by advanced gum disease and natural aging.</span></p><p class=\"\"><span>When the jawbone shrinks, it changes the shape of the face while making future dental work more difficult, and can also weaken the support of the remaining teeth. Traditional dentures may also become loose and ill-fitting as the jawbone recedes. The best way to prevent this is to ensure you replace any missing tooth, get early treatment of gum disease, and consider dental implants to help stimulate the bone.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How regular dental care helps</span></strong></p><p class=\"\"><span>Visiting your Richardson dentist regularly ensures you detect problems early, leading to simpler treatment and positive outcomes before the condition becomes serious. It also gives you access to professional cleanings that remove buildup like plaque, while fluoride treatments strengthen teeth. Your dentist can also give you advice that can help prevent future problems.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>The bottom line</span></strong></p><p class=\"\"><span>Most dental issues develop gradually; that is why early detection and treatment prevent serious problems. To protect your long-term oral health, find a \"dentist near me\" and schedule a checkup today.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact Information:</span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Name</span></strong><span>: Sonakshi Murze</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Email</span></strong><span>: Sonakshi.murze@iquanti.com</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Job Title</span></strong><span>: Manager</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>SOURCE</span></strong><span>: iQuanti</span></p><p class=\"\"><span>View the original press release on ACCESS Newswire</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_ACSKpgFpa:0/",
            "pub_date": "2026-03-01 00:00:02",
            "source": "Acceswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:ca45c7dd2094b:0",
            "title": "Bitcoin Historical Cycle Pattern Points To $31,500 Bottom Target – Details",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Bitcoin price struggles persist as the premier cryptocurrency is yet to break above the key $70,000 resistance zone, suggesting the market remains at risk of a deeper correction. Notably, popular market analyst Yonsei_dent has shared an observation that backs these bearish investors’ expectations. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Supply In Profit Metric Shows Potential 75% Drawdown </span></strong></strong></p><p class=\"\"><span>In a Quicktake post on CryptoQuant, Yonsei_dent has identified a potential price bottom of the present market cycle, considering the meltdown in recent months. Since October, the leading cryptocurrency has lost over 45% of its market value, with prices dropping as low as $60,000 from an all-time high of $126,000.</span></p><p class=\"\"><span>Using the Supply In Profit on-chain indicator, Yonsei_dent maps out the possible extent of Bitcoin’s price decline when in the bottom zone, based on historical cycle drawdown periods. For context, the Supply in Profit measures the portion of the total circulating Bitcoin whose current market price is higher than the price at which those coins last moved.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:1066.6666666666667px;aspect-ratio:1.7777777777777777\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-94873c6a76ddf11158092a131c682ca6-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-94873c6a76ddf11158092a131c682ca6-resized.webp\" style=\"background-color:#f8f7f5\"/></picture></div></button></figure><p class=\"\"><span>It’s an important cycle indicator, as the Supply in Profit approaches extreme highs when near cycle tops, and compresses sharply when near cycle lows. Yonsei_dent explains that the duration of Bitcoin Supply in Profit in the bottom zone in 2022 was six months. During this market cycle, Bitcoin had initially hit an all-time high of $69,000 before crashing by 77% to around $15,500.</span></p><p class=\"\"><span>According to the market analyst, if the same length of the bottom phase was placed on the current price chart, it represents a 70%-75% drawdown price projection for the present market cycle. In this case, Bitcoin is expected to find a price low within a range of $31,500 – $38,000, suggesting a further potential 41%-51% decline from the current market prices.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:717.4468085106383px;aspect-ratio:1.195744680851064\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-a898de23dcbe8b341814ebc4c32d2739-resized.webp\" type=\"image/webp\"/><img alt=\"Bitcoin\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/newsbtc:ca45c7dd2094b-a898de23dcbe8b341814ebc4c32d2739-resized.webp\" style=\"background-color:#f0efef\"/></picture></div></button></figure><p class=\"\"><strong class=\"root-Tkn6WL2y\"><strong class=\"root-Tkn6WL2y\"><span>Bitcoin Price Overview </span></strong></strong></p><p class=\"\"><span>At the time of writing, Bitcoin trades at $63,553 following a 5.84% loss in the last 24 hours. Meanwhile, its daily trading volume is up by a minor 0.54% and valued at $40.04 billion. The premier cryptocurrency also reports a negative performance on its weekly and monthly charts, with respective losses of 6.21% and 27.11%. Unless the market bulls convincingly reclaim the long standing $70k resistance, market sentiment is likely to remain fragile and prices vulnerable to additional downside or prolonged consolidation in the near term.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:ca45c7dd2094b:0-bitcoin-historical-cycle-pattern-points-to-31-500-bottom-target-details/",
            "pub_date": "2026-03-01 00:00:07",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_PexbphjKa:0",
            "title": "Half-year financial statements as of December 31, 2025: Economic development continues",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA</span></strong></p><p class=\"\"><span>by Björn Bäring</span></p><p class=\"\"><em><span>Business news for the stock market</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA: Half-year financial statements as of December 31, 2025: Economic development continues</span></strong></p><span>[ PDF ]</span><p class=\"\"><span>Berlin (pta000/28.02.2026/17:00 UTC+1)</span></p><p class=\"\"><span>Hertha BSC has published its half-year financial statements as of December 31, 2025, reporting a positive result.</span></p><p class=\"\"><span>The half-yearly financial statements as of December 31, 2025, are available on the Hertha BSC website.</span></p><p class=\"\"><span>(end)</span></p><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><th><span>Emitter:</span></th><td><span>Hertha BSC GmbH &amp; Co. KGaAHanns-Braun-Straße 214053 BerlinGermany</span></td><td rowspan=\"7\"></td></tr><tr><th><span>Contact Person:</span></th><td><span>Björn Bäring</span></td></tr><tr><th><span>Phone:</span></th><td><span>+49 30 300 928 0</span></td></tr><tr><th><span>E-Mail:</span></th><td><span>bjoern.baering@herthabsc.de</span></td></tr><tr><th><span>Website:</span></th><td><span>www.herthabsc.com</span></td></tr><tr><th><span>ISIN(s):</span></th><td><span>SE0011337054 (Bond)</span></td></tr><tr><th><span>Stock Exchange(s):</span></th><td><span>Free Market in Frankfurt, Hamburg, Hannover, Munich, Stuttgart, Tradegate BSX</span></td></tr><tr><th><span>Other Stock Exchanges:</span></th><td><span>Stockholm (SWE)</span></td><td></td></tr></tbody></table></div><p class=\"\"><span>[ source: https://www.pressetext.com/news/1772294400516 ]</span></p><p class=\"\"><span>(c) pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext. Archive: https://www.pressetext.com/channel/Adhoc The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_PexbphjKa:0-half-year-financial-statements-as-of-december-31-2025-economic-development-continues/",
            "pub_date": "2026-03-01 00:00:47",
            "source": "pressetext",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026-02-28:newsml_Pexc6vbQa:0",
            "title": "PTA-News: Hertha BSC GmbH & Co. KGaA: Half-year financial statements as of December 31, 2025: Economic development continues",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Hertha BSC GmbH &amp; Co. KGaA</span></strong></p><p class=\"\"><span>by Björn Bäring</span></p><span>Business news for the stock market Berlin (pta/28.02.2026/17:00) - Hertha BSC has published its half-year financial statements as of December 31, 2025, reporting a positive result. The half-yearly financial statements as of December 31, 2025, are available on the Hertha BSC website ( https://www.herthabsc.com/en/club/nordic-bonds-investor-relations). (end) emitter: Hertha BSC GmbH &amp; Co. KGaA address: Hanns-Braun-Straße 2, 14053 Berlin country: Germany contact person: Björn Bäring phone: +49 30 300 928 0 e-mail: bjoern.baering@herthabsc.de website: www.herthabsc.com ISIN(s): SE0011337054 (bond) stock exchanges: open market (free market) in Frankfurt, free market in Hamburg, free market in Hannover, free market in Munich, free market in Stuttgart; open market in Tradegate BSX other stock exchanges: Stockholm (SWE) pressetext Nachrichtenagentur GmbH Ad-hoc and financial news distributed by pressetext.adhoc. Archive: http://adhoc.pressetext.com The emitter is responsible for the content. Contact: adhoc@pressetext.com or +43-1-81140-0.</span></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026-02-28:newsml_Pexc6vbQa:0-pta-news-hertha-bsc-gmbh-co-kgaa-half-year-financial-statements-as-of-december-31-2025-economic-development-continues/",
            "pub_date": "2026-03-01 00:00:49",
            "source": "pressetext",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0D3:0",
            "title": "Iran war throws oil market into biggest crisis in decades: Bousso ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Ron Bousso</span></p><p class=\"\"><span>    Global energy markets face one of their gravest shocks in decades as joint U.S. and Israeli strikes on Iran and Tehran’s retaliatory missile attacks across the Gulf disrupt oil exports from the world’s most important producing region.</span></p><p class=\"\"><span>The scale of the disruption will likely be determined by the duration of the conflict, but for now the threat and the uncertainty are already enough to severely impact flows from the region that accounts for 20% of global oil supplies.</span></p><p class=\"\"><span>Barring a swift resolution, oil prices will likely see steep increases when trading opens on Monday morning. Benchmark Brent crude oil prices rose in recent weeks to around $70 a barrel, their highest since August 2025 as investors braced for military confrontation in the Middle East.</span></p><p class=\"\"><span>The United States and Israel carried out military strikes on Iran on Saturday, targeting senior leaders and plunging the Middle East into a widening conflict. U.S. President Donald Trump said the attacks would eliminate a security threat to the United States and give Iranians an opportunity to topple their rulers.</span></p><p class=\"\"><span>For now, there is no confirmed damage to oil and gas infrastructure from retaliatory Iranian strikes. </span></p><p class=\"\"><span>Explosions were reported in the United Arab Emirates and Kuwait, two major oil exporters. Meanwhile, Qatar, the world’s second-largest exporter of liquefied natural gas, said it intercepted missiles aimed at the country.</span></p><p class=\"\"><span>Blasts were also heard in Bahrain and near Iran’s Kharg Island, the terminal through which about 90% of its crude exports normally flow, although shipping data suggests Tehran had transferred most of the oil stored there onto tankers in recent days.</span></p><p class=\"\"><span>Crucially, there have so far been no reports of disruptions to shipping through the Strait of Hormuz, the narrow waterway between Iran and Oman that handles nearly 20 million barrels per day of crude oil and refined products.</span></p><figure class=\"container-CvWHk7Ya\"><button class=\"previewButton-CvWHk7Ya\"><div class=\"preview-gDIex6UB fixedHeight-gDIex6UB preview-CvWHk7Ya\" style=\"height:inherit;margin:0 auto;max-height:600px;max-width:872.9508196721312px;aspect-ratio:1.4549180327868854\"><picture class=\"picture-gDIex6UB\"><source src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZO0D3-c103a5cb0afbde8ee0388db1fb908b84-resized.webp\" type=\"image/webp\"/><img alt=\"Middle East oil exports\" class=\"image-gDIex6UB image-CvWHk7Ya\" loading=\"lazy\" role=\"presentation\" src=\"https://s3.tradingview.com/news/image/tag:reuters.com,2026:newsml_L6N3ZO0D3-c103a5cb0afbde8ee0388db1fb908b84-resized.webp\" style=\"background-color:#d39992\"/></picture></div></button><figcaption class=\"caption-CvWHk7Ya\"><span class=\"copyright-CvWHk7Ya\">Thomson Reuters</span><span class=\"description-CvWHk7Ya\">Middle East oil exports</span></figcaption></figure><p class=\"\"><span>CAUTION MEANS DISRUPTION</span></p><p class=\"\"><span>But the absence of physical damage may not matter much.</span></p><p class=\"\"><span>The risk that tankers could be stranded inside the Gulf, north of Hormuz, or that vessels could be targeted, is already enough to force producers, traders and shippers to rethink movements of oil and LNG. Reuters has reported that some oil majors and trading houses have suspended shipments through the strait for several days.</span></p><p class=\"\"><span>That caution is unlikely to ease until there is far greater confidence in the safety of the region’s sea lanes.</span></p><p class=\"\"><span>Tanker freight rates, which had already been climbing as tensions escalated, are set to rise further. Benchmark rates for very large crude carriers from the Middle East to China have more than tripled since the start of the year, reflecting both heightened risk and the shrinking pool of willing vessels.</span></p><p class=\"\"><span>The key questions now are whether energy infrastructure will be directly targeted and how quickly the U.S. military can secure shipping routes across the Gulf and the Strait of Hormuz.</span></p><p class=\"\"><span>It is worth noting that the Strait of Hormuz has never been fully blocked.</span></p><p class=\"\"><span>While Iran is unlikely to sustain a prolonged blockade, it has the capability to disrupt traffic temporarily. The U.S. Navy would almost certainly respond swiftly, but even short-lived attacks or mine-laying operations could have outsized effects on prices and supply.</span></p><p class=\"\"><span>Such tactics would not be unprecedented. During the 1980s Iran-Iraq war, Iran attacked commercial shipping and U.S. naval vessels, prompting President Ronald Reagan to deploy U.S. forces to escort tankers in Operation Earnest Will. More recently, in late 2007 and early 2008, there were repeated confrontations between Iranian and U.S. naval forces. And in April 2023, Iran's navy seized the Advantage Sweet crude tanker, chartered by Chevron, in the Gulf of Oman. The vessel was released more than a year later.</span></p><p class=\"\"><span>GLOBAL SUPPLY CUSHION</span></p><p class=\"\"><span>The global oil market is relatively well supplied today, after production from the United States, Brazil, Canada and other countries rose in recent years.</span></p><p class=\"\"><span>Saudi Arabia, the world’s top oil exporter, has also not sat idle in the face of the risk to supply. In recent days the kingdom increased crude shipments, which are set to exceed 7 million barrels per day in February, the highest since April 2023, according to shipping analytics firm Kpler.</span></p><p class=\"\"><span>OPEC+, which comprises the Organization of the Petroleum Exporting Countries and allies like Russia, is expected to agree on an output increase during a meeting on Sunday.</span></p><p class=\"\"><span>Of course, disruptions to export routes from the Middle East could negate much of the production increases from regional producers, though Saudi and the UAE have some alternative export routes.</span></p><p class=\"\"><span>The scale of the U.S. and Israeli strikes, and Trump’s language, suggest Washington is bracing for a sustained military campaign aimed at severely weakening Iran’s leadership.</span></p><p class=\"\"><span>How threatened Iran's leadership feels may determine whether it escalates further by attacking a broader range of targets across the region, including oilfields, export terminals and processing facilities.</span></p><p class=\"\"><span>But even without that worst-case scenario, the conflict is already set to disrupt vital energy supplies from the Middle East in ways not seen for decades.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0D3:0-iran-war-throws-oil-market-into-biggest-crisis-in-decades-bousso/",
            "pub_date": "2026-03-01 00:03:12",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "the_block:04ee43423094b:0",
            "title": "Fresh accounts netted $1 million on Polymarket hours before US airstrikes on Iran: Bubblemaps",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Onchain analytics firm Bubblemaps flagged six Polymarket wallets on Saturday that profited a combined $1 million by betting on a U.S. military strike against Iran, with most accounts created and funded within 24 hours of the attack.</span></p><p class=\"\"><span>The wallets all purchased \"yes\" shares on the Polymarket contract \"US strikes Iran by February 28, 2026?\" hours before the U.S. and Israel launched coordinated airstrikes early Saturday morning. President Donald Trump confirmed \"massive and ongoing\" military operations against Iran, which the Department of War has dubbed \"Operation Epic Fury.\"</span></p><p class=\"\"><span>Bubblemaps described the group as \"suspected insiders\" who made $1.2 million. The Block reviewed all six flagged Polymarket profiles, including their closed positions and per-trade profit-and-loss breakdowns. The wallets' combined net profit totals $989,191, according to the Profit/Loss figures displayed on each profile.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Winning wallets — and one big loser</span></strong></p><p class=\"\"><span>The largest wallet in the cluster recorded a net profit of $494,375 across four predictions. The account bought 560,680 \"yes\" shares on the Feb. 28 contract at 10.8 cents each, spending roughly $60,816 and earning a $499,864 profit when the contract resolved to \"yes.\" It also won $11,286 on a March 1 contract. However, the wallet lost $13,515 on a bet that the strike would come by February 27, which did not resolve in its favor.</span></p><p class=\"\"><span>A second wallet, \"Planktonbets,\" posted a net profit of $173,907 across seven predictions. Its main position was 200,747 \"yes\" shares on the Feb. 28 contract at 13.2 cents, which returned $174,234 in profit. The account also placed small losing bets on daily \"next strike\" contracts for Feb. 19 and 20, suggesting repeated attempts to time the exact date.</span></p><p class=\"\"><span>\"Dicedicedice\" placed a single bet and earned $119,964 in net profit. The account bought 149,955 \"yes\" shares on the Feb. 28 contract at 20 cents, a 400% return.</span></p><p class=\"\"><span>\"Neodbs\" also placed one bet and achieved the highest percentage return of any wallet in the group: 900%. The account bought 98,838 shares on the Feb. 28 contract at 10 cents, spending $9,884 and netting $88,954.</span></p><p class=\"\"><span>A wallet using the username \"nothingeverhappens911\" posted $66,436 in net profit across two bets, both winners. It held 40,000 \"yes\" shares on the Feb. 28 contract at 19 cents and 45,320 shares on the March 1 contract at 24.9 cents.</span></p><p class=\"\"><span>A sixth wallet, listed only as \"Anon\" on Polymarket, made a single bet: 55,556 \"yes\" shares on the Feb. 28 contract at 18 cents. It earned $45,556 in net profit, a 456% return. All six wallets now show $0 in positions value, indicating they have fully exited.</span></p><p class=\"\"><span>Some traders lost big on the announcement of the U.S. strikes against Iran. Trader \"anoin123\" profited $2 million in prior months from betting against strikes, Lookonchain said, but the account lost $6.5 million in one day following the strikes, \"going from $2M+ in profit to $4.5M+ in losses.\"</span></p><p class=\"\"><span>\"It’s almost impossible to be 100% certain [of insider knowledge] in these cases, but given the size of the bets, the freshly funded wallets, and the timing around the bets, it felt convincing enough for us to share,\" Bubblemaps CEO Nicolas Vaiman told The Block. </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>A growing pattern of suspected insiders</span></strong></p><p class=\"\"><span>Suspected insider trading on Polymarket's geopolitical markets is not new. In January, a freshly created account wagered roughly $32,000 on the ouster of Venezuelan President Nicolás Maduro, purchasing shares at around 7 cents before the U.S. military operation was publicly announced. That trade yielded more than $400,000 in profit within 24 hours, prompting Rep. Ritchie Torres to introduce the Public Integrity in Financial Prediction Markets Act of 2026, which would bar federal officials from trading prediction market contracts tied to government policy.</span></p><p class=\"\"><span>Earlier this month, Israeli prosecutors filed indictments against an Israel Defense Forces reservist and a civilian for allegedly using classified military intelligence to bet on Polymarket. The pair reportedly wagered on the timing of Israel's strike on Iran during the June 2025 Twelve-Day War, earning over $150,000 in combined profits. They face charges of severe security offenses, bribery, and obstruction of justice.</span></p><p class=\"\"><span>Just days ago, suspected insiders made over $1 million betting on a Polymarket contract tied to blockchain investigator ZachXBT's probe into crypto trading platform Axiom, according to Lookonchain. The most profitable wallet in that case turned a five-figure bet into nearly half a million dollars.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Broader implications</span></strong></p><p class=\"\"><span>The Bubblemaps findings come as Polymarket faces mounting regulatory and political pressure over the integrity of its geopolitical markets. The \"US strikes Iran by...?\" family of contracts has generated over $529 million in total trading volume since December 2025, making it one of the most heavily traded markets on the platform.</span></p><p class=\"\"><span>Polymarket CEO Shayne Coplan has previously defended the presence of informed traders on the platform, telling CBS News that insiders \"having an edge on the market is a good thing\" because it accelerates price discovery. The company secured CFTC approval to operate as a regulated exchange in the U.S. in late 2025.</span></p><p class=\"\"><span>Rival platform Kalshi has publicly endorsed the Torres bill and sought to distance itself from Polymarket's approach, with CEO Tarek Mansour noting Kalshi applies NYSE- and Nasdaq-style insider trading rules. Mansour said on X Friday that \"regulated prediction markets are not allowed to do war markets\" in response to Democratic Senator Chris Murphy's X post announcing he is \"working on legislation to ban corrupt and destabilizing prediction markets.\" </span></p><p class=\"\"><span>Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in other companies in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current financial disclosures.</span></p><p class=\"\"><span>© 2026 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice.</span></p><span> </span></span></div></div>",
            "link": "https://www.tradingview.com/news/the_block:04ee43423094b:0-fresh-accounts-netted-1-million-on-polymarket-hours-before-us-airstrikes-on-iran-bubblemaps/",
            "pub_date": "2026-02-28 23:47:13",
            "source": "The Block",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L1N3ZO09D:0",
            "title": "Berkshire CEO Abel assures investors after taking baton from Buffett, with 'fortress-like' balance sheet ",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel pledges to maintain fortress balance sheet</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel emphasizes trust, Berkshire values</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Berkshire reports declining profit for Q4, full year</span></li></ul></span></div><span><p class=\"\"><span>By Jonathan Stempel</span></p><p class=\"\"><span>    Berkshire Hathaway's </span><span> new chief executive Greg Abel moved to put his stamp on the conglomerate with his first annual letter to shareholders on Saturday, pledging to maintain its \"fortress-like\" balance sheet while upholding the values of his predecessor and mentor, </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.reuters.com/news/picture/idUSRTS32X5D/\" rel=\"nofollow\" target=\"_blank\">Warren Buffett</a><span>.</span></p><p class=\"\"><span>Abel, 63, said he would not rush to deploy Berkshire's near-record $373.3 billion cash stake, though it gave the company plenty of \"dry powder,\" and that he had no plans to begin paying dividends, which Buffett also opposed. Berkshire has also repurchased none of its own stock since the spring of 2024.</span></p><p class=\"\"><span>\"I recognize how you want us to succeed together, and to do so in the right way,\" Abel wrote. \"My role is to ensure our liquidity levels and capital deployment remain intentional and deliberate.\"</span></p><p class=\"\"><span>Abel also paid homage to Buffett, 95, who stepped down at year-end after 60 years as chief executive. Buffett remains chairman and goes to Berkshire's offices five days a week.</span></p><p class=\"\"><span>\"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen,\" Abel wrote. \"To invest in Berkshire has long been a vote of trust in our founder – a trust that now rests with Berkshire.\"</span></p><p class=\"\"><span>ABEL TRIES TO SHOW CONTINUITY</span></p><p class=\"\"><span>Abel said Berkshire's culture and values will continue \"into perpetuity,\" and signaled no changes in its decentralized structure where its dozens of businesses operate largely without interference from him.</span></p><p class=\"\"><span>He also said Berkshire, which owns the BNSF railroad, had \"no interest\" in buying another major railroad, and acknowledged pressures facing the PacifiCorp utility from litigation over wildfires in Oregon.</span></p><p class=\"\"><span>\"PacifiCorp is not an insurer of last resort and should not be treated as a deep pocket,\" Abel wrote.</span></p><p class=\"\"><span>Cathy Seifert, an analyst at CFRA Research, said Abel's letter might be reassuring to investors.</span></p><p class=\"\"><span>\"He needed to show a degree of continuity, that the Berkshire franchise would continue despite the change in leadership, and it would be business as usual,\" she said. \"In my opinion, he hit the mark.\"</span></p><p class=\"\"><span>PROFIT DECLINES</span></p><p class=\"\"><span>Berkshire also reported declining profit for both the fourth quarter and the full year, after taking write-downs for longstanding investments in packaged food company Kraft Heinz </span><span> and Occidental Petroleum </span><span>.</span></p><p class=\"\"><span>Quarterly operating profit fell 30% to $10.2 billion. Including changes in the value of equity holdings led by Apple </span><span> and American Express </span><span>, net income fell 3% to $19.2 billion.</span></p><p class=\"\"><span>For all of 2025, operating profit fell 6% to $44.49 billion, while net income fell 25% to $67 billion.</span></p><p class=\"\"><span>Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire is not selling.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L1N3ZO09D:0-berkshire-ceo-abel-assures-investors-after-taking-baton-from-buffett-with-fortress-like-balance-sheet/",
            "pub_date": "2026-02-28 23:37:29",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002356:0",
            "title": "Stanley Druckenmiller says this is how he'd build a portfolio from scratch right now",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>By Barbara Kollmeyer</span></p><p class=\"\"><span>AI is no longer playing a starring role, says the widely followed investor</span></p><p class=\"\"><span>Stanley Druckenmiller, shown in July 2017 at a conference in Sun Valley, Idaho, revealed in an interview on Friday with Morgan Stanley where he's seeing opportunities right now.</span></p><p class=\"\"><span>Stanley Druckenmiller says artificial intelligence is no longer playing a starring role in his investments, as he focuses more on hard assets like copper and a more diversified portfolio of stocks.</span></p><p class=\"\"><span>The closely followed investor, who runs the Duquesne Family Office, made the comments in an interview for \"Hard Lessons,\" a Morgan Stanley podcast that was published on Friday. He was asked by liana Bouzali, Morgan Stanley's global head of derivatives, distribution and structuring, how he would construct a hedge-fund portfolio from scratch today.</span></p><p class=\"\"><span>Druckenmiller said such portfolio building would take into account a strengthening U.S. economy and potential for Fed rate cuts, though, given highly valued equities, he prefers longer positions in a more \"eclectic basket of stocks.\" The AI trade to him is not longer so big, he added.</span></p><p class=\"\"><span>\"[O]ur portfolio,\" he indicated, over the past three years, had been \"very much AI-driven. We still have dribs and drabs of AI around, but it's not driving the engine anymore, to some extent,\" said Druckenmiller. He's still excited, he said, about the opportunity for \"massive disruption and massive change\" in the next three or four years, which would be a plus for any hedge fund starting now.</span></p><p class=\"\"><span>Don't miss: The week, FOBO - 'fear of becoming obsolete' because of AI - became real for workers and markets</span></p><p class=\"\"><span>\"Macro has been dead for 10 or 15 years,\" he observed. \"I don't think that's the case anymore.\"</span></p><p class=\"\"><span>Druckenmiller said he's still got \"big positions in Japan and Korea,\" with some of that in AI. The iShares MSCI Japan ETF EWJ is up 40% over a one-year span, and the iShares MSCI Korea ETF EWY up 55%, versus a gain of 15% for the S&amp;P 500 SPX. A 13F filing released earlier this month showed Druckenmiller's family office also made a well-time bet on the iShares MSCI Brazil ETF EWZ in the final quarter of 2025.</span></p><p class=\"\"><span>Earlier this week: The milestones keep coming for the world's hottest stock market</span></p><p class=\"\"><span>Also read: U.S. stocks are falling behind. It could be the beginning of an epic shift toward global markets.</span></p><p class=\"\"><span>\"We're bearish on the U.S. dollar, mainly because [it has been] sort of [at] the top of the historic range in terms of purchasing power, and foreigners are way, way overloaded in dollars,\" he added. Whether that's a sell-America trade or just buying fewer U.S. assets, he expects the currency DXY will weaken.</span></p><p class=\"\"><span>As for copper (HG00), up 32% over the past 52 weeks and up 6% in 2026, Druckenmiller said it's \"not a genius trade\" but makes sense given supply will be pretty tight over the next eight years, with extra demand from AI and data centers. He said his family office is not investing big in copper miners but keeps rolling over exposure to front-month copper, and it has gold (GC00) exposure, though, in that case, for geopolitical rather than industrial reasons.</span></p><p class=\"\"><span>See: Trump calls for regime change after U.S.-Israel attack on Iran. Markets should brace for more than June's brief military campaign.</span></p><p class=\"\"><span>Gold is up 84% over the last year, having seen a historic rally.</span></p><p class=\"\"><span>Druckenmiller said that, given his family office's long exposure to lots of risk assets, it's keeping a short position in bonds, which wouldn't be a big moneymaker unless he's right and the economy sees disinflationary growth.</span></p><p class=\"\"><span>\"If I'm wrong and the strong growth creates inflation - it wouldn't be that unusual if the Fed were to cut into a booming economy for inflation to take off, particularly with what's going on with commodities. So I'm open-minded to that. But we create a matrix, and the bonds are helpful in both ways,\" he said.</span></p><p class=\"\"><span>The interview with Druckenmiller was conducted on Jan. 30, just ahead of the February ascent of an AI fear trade that pummeled software and other sectors exposed to artificial-intelligence technology. Investors have also been piling into bond markets on fears that AI advances will decimate the job market, while hotter-than-expected producer prices have clouded hopes for Federal Reserve interest-rate cuts.</span></p><p class=\"\"><span>U.S. stocks plunged on Friday after the PPI data pointed to worryingly persistent inflation.</span></p><p class=\"\"><span>Don't miss: Any chance of a Fed interest-rate cut in 2026 is 'evaporating before our very eyes' with Iran war set to stoke oil prices</span></p><p class=\"\"><span>Druckenmiller said contrarianism is \"overrated,\" and he isn't bothered by exposure to a crowded trade. But he also flagged past mistakes, such as buying Nvidia (NVDA) in the first half of 2022 but then cutting his stake in mid-2024.</span></p><p class=\"\"><span>He also discussed a big bet on biotech, highlighting how the market has been undervaluing one pick, Teva Pharmaceuticals (TEVA), of which he became more enthusiastic following a meeting with its management. The \"best use case out there of AI is biotech, through drug discovery, diagnostics, monitoring - everything,\" Druckenmiller said, noting that that sector has \"been on its butt for like four years.\"</span></p><p class=\"\"><span>Read on: Private-credit 'cockroaches' and the AI 'scare trade' hammered stocks in February. Here's what else has investors shaken up</span></p><p class=\"\"><span>-Barbara Kollmeyer</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002356:0/",
            "pub_date": "2026-02-28 23:38:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002323:0",
            "title": "This could be Nvidia's next big move, with the stock in search of a positive catalyst",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Emily Bary</span></p><p class=\"\"><span>A report says Nvidia is planning a new chip platform that seeks to address evolving customer needs as the AI era transitions more toward inference workloads</span></p><p class=\"\"><span>Nvidia, led by Jensen Huang, struck a major licensing deal with startup Groq late last year, and soon investors may see the early fruits of that arrangement.</span></p><p class=\"\"><span>A historic earnings beat wasn't enough to lift Nvidia's stock. What about a brand new chip platform?</span></p><p class=\"\"><span>The Wall Street Journal reported late on Friday that the company is soon planning to debut an inference-oriented chip platform that brings in technology designs from Groq, the startup that Nvidia (NVDA) struck a $20 billion licensing deal with at the end of last year. Through that deal, Nvidia also brought Groq employees, like founder Jonathan Ross, on board.</span></p><p class=\"\"><span>Nvidia didn't immediately respond to a MarketWatch request for comment.</span></p><p class=\"\"><span>The rumored new platform, which the WSJ said is due to be announced during Nvidia's annual GTC developer event in March, could mark an acknowledgment of the changing world of artificial-intelligence chips, the report suggested. Nvidia is by far the dominant maker of graphics processing units, which have largely powered the AI revolution so far. But Alphabet (GOOGL) and other Broadcom (AVGO) partners have been working on their own custom chips that are cheaper and potentially more targeted to AI's new era.</span></p><p class=\"\"><span>See also: Why Nvidia's stock fell despite a historic earnings beat</span></p><p class=\"\"><span>Specifically, customers are turning to AI chips more for inference, which is the process by which models reach conclusions based on information that's new to them. The WSJ report noted that customers increasingly want less expensive and more efficient processors for these sorts of workloads.</span></p><p class=\"\"><span>Groq has been known for making language-processing units, or LPUs. \"Unlike the GPU, the LPU is a deterministic, low-power processor,\" wrote Cantor Fitzgerald analyst C.J. Muse after the companies struck their licensing and \"acqui-hire\" deal in December.</span></p><p class=\"\"><span>\"LPU strengths? Extremely low-latency, energy-efficient single user token per second, one of the fastest in the market,\" Muse wrote. But the chips make use of a kind of superfast memory that has limited capacity, meaning that lots of racks would be needed.</span></p><p class=\"\"><span>Don't miss: Nvidia's earnings report is just a prelude to what should really matter for investors</span></p><p class=\"\"><span>At the time, Muse thought that Groq's newfound presence within Nvidia would \"enable even greater share of the inference market, particularly for the next leg of the AI infrastructure buildout - real-time workloads like robotics and autonomy.\"</span></p><p class=\"\"><span>Nvidia's stock, meanwhile, has been in search of a positive catalyst. Shares are down 5% so far this year, with an upbeat earnings announcement from earlier in the week unable to sway investors. The PHLX Semiconductor index is up 14% over the course of 2026 to date. Chip-sector investors this year have been particularly enamored by makers of memory products and equipment for semiconductor manufacturing.</span></p><p class=\"\"><span>Analysts have said that GTC could end up helping Nvidia's stock, as the company has perhaps what could be its most market-moving updates for the big event.</span></p><p class=\"\"><span>See also: Trump blacklists Anthropic - and OpenAI swoops in</span></p><p class=\"\"><span>-Emily Bary</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002323:0/",
            "pub_date": "2026-02-28 23:24:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000008:0",
            "title": "Berkshire Hathaway Operating Earnings Fell 30% in Fourth Quarter. There Were No Stock Buybacks. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andrew Bary</span></p><p class=\"\"><span>Berkshire Hathaway's operating profits after taxes fell 30% in the fourth quarter to $10.2 billion, depressed by a drop of more than 50% in insurance underwriting profits and lower insurance investment income.</span></p><p class=\"\"><span>The company bought back none of its own stock in the period, continuing a trend that began in May 2024.</span></p><p class=\"\"><span>Berkshire's cash and equivalents stood at $373 billion at the end of 2025, down from a peak of $381 billion at the end of September.</span></p><p class=\"\"><span>Adjusting for the timing of some Treasury bill purchases at the end of the third quarter, Berkshire's cash levels were higher at year-end than on Sept. 30.</span></p><p class=\"\"><span>Berkshire took a non-cash writedown of its equity stake in Kraft Heinz of $4.5 billion in the fourth quarter, capping a total of $8.3 billion of writedowns on that equity stake during 2025. Berkshire was carrying the 27% stake in Kraft Heinz at $8.6 billion at year-end 2025. That's close to the current market value of around $8 billion. The writedowns reflected the weakness in Kraft stock during 2025, when it fell about 20%.</span></p><p class=\"\"><span>Berkshire filed earlier this year to potentially sell some or all of that Kraft interest, but has not made any sales yet.</span></p><p class=\"\"><span>Berkshire's operating earnings after taxes per share fell 30% to about $7,093 per class A share in the fourth quarter relative to the year-earlier period. That fell well short of the FactSet consensus of $8,400 per A share.</span></p><p class=\"\"><span>The lack of stock buybacks in the fourth quarter is a mild disappointment to Berkshire investors, but not a surprise. Analysts hadn't expected the company to repurchase shares during Warren Buffett's final three months as CEO. He was succeeded at the start of 2026 by Greg Abel, while Buffett remains chairman.</span></p><p class=\"\"><span>Berkshire also wasn't a buyer of its stock during January, Barron's calculates, based on the share count on Jan. 31 disclosed in Berkshire's 10-K report released Saturday. There were about 1.438 million shares of class A equivalent shares outstanding at year-end with class B shares converted to an equivalent amount of class A stock. Only about 35% of Berkshire's stock is now in the original class A shares.</span></p><p class=\"\"><span>The lack of stock buybacks indicates that the company doesn't view the stock as cheaply valued; Berkshire will repurchase its shares when it views them trading as a discount to the stock's intrinsic value \"conservatively determined,\" Abel said in his shareholder letter released Saturday morning.</span></p><p class=\"\"><span>Berkshire's book value rose about 3% during the fourth quarter to about $499,000 per class A share, Barron's calculates. Berkshire stock now trades for about 1.5 times year-end 2025 book value, in line with its average price/book ratio in the past few years.</span></p><p class=\"\"><span>Berkshire's total after-tax earnings in the fourth quarter were down about 2% to $19.2 billion. That figure reflects both operating income of Berkshire's businesses, and investment gains, mostly unrealized.</span></p><p class=\"\"><span>Berkshire chairman Buffett tells investors to focus on the operating profits, due to variability of investment gains from quarter to quarter.</span></p><p class=\"\"><span>The drop in Berkshire's fourth-quarter operating profits is somewhat overstated, because the company includes in operating earnings non-cash currency swings mostly related to the company's yen-denominated debt that funds its equity ownership of five Japanese trading companies. Adjust for the currency swings, and the drop in earnings was about 28%. There were about $600 million of currency gains in the fourth quarter against $1.2 billion in the year-earlier period. Berkshire generates those non-cash gains when the dollar rises relative to the Japanese yen.</span></p><p class=\"\"><span>What Berkshire calls other income, which includes the currency swings, was down to $159 million in the fourth quarter from $1.8 billion in the prior period. Strip out the other incom, and operating profits after taxes would have been down about 20% year over year, Barron's calculates.</span></p><p class=\"\"><span>Insurance underwriting results fell 54% to $1.6 billion in the fourth quarter.</span></p><p class=\"\"><span>Insurance investment income was down 25% to $3.1 billion in the period. The decline in insurance investment income overstates the drop in Berkshire's total investment income, because the company has shifted a significant chunk of investments to the parent company from the insurance units.</span></p><p class=\"\"><span>The parent company had about $127 billion of cash and equivalents at year-end 2025, up from around $96 billion a year earlier. Having cash at the parent company gives Berkshire more financial flexibility, since insurance regulators can limit cash that can be upstreamed from insurance units.</span></p><p class=\"\"><span>Berkshire's parent-company investment income roughly doubled in the fourth quarter to $927 million.</span></p><p class=\"\"><span>Berkshire held a total of $321 billion of Treasury bills at year-end 2025, making it one of the largest holders in the world.</span></p><p class=\"\"><span>Earnings at the Burlington Northern Santa Fe railroad rose 7% to more than $1.3 billion in the period, while profits after taxes at Berkshire Hathaway Energy, the company's big utility unit, were down 5% in the fourth quarter to $691 million. Profits rose 3% to $3.4 billion at the company's diversified manufacturing service and retailing segment.</span></p><p class=\"\"><span>Insurance float stood at $176 billion at year-end, up $5 billion during 2025.</span></p><p class=\"\"><span>Berkshire was a net seller of stocks for the third straight year in 2025, as Buffett and his investment managers Ted Weschler and Todd Combs (Combs left Berkshire in December) found few major opportunities. The company was a net seller in the fourth quarter of about $3.5 billion of equities, selling $7 billion and buying $3.5 billion.</span></p><p class=\"\"><span>For the year, Berkshire was a net seller of about $14 billion of stocks in 2025, $134 billion in 2024 (when it unloaded much of its Apple equity stake) and $24 billion in 2023, Barron's calculates based on data in the 10-K released Saturday.</span></p><p class=\"\"><span>Berkshire's equity portfolio stood at about $298 billion at year-end, and more than $315 billion when including the company's equity interests in Kraft Heinz and Occidental Petroleum.</span></p><p class=\"\"><span>Berkshire's class A shares finished Friday at $757,000 and the class B stock at $504.95. The A shares are up 0.3% so far in 2026, slightly behind the S&amp;P 500 index's total return of about 0.6%.</span></p><p class=\"\"><span>Write to Andrew Bary at andrew.bary@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000008:0/",
            "pub_date": "2026-02-28 22:43:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "investorplace:d4e020856094b:0",
            "title": "The Closest Thing to a Time Machine: My Top 3 Reasons I Love Earnings",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>I was ten years old the first time I saw Back to the Future in a movie theater.</span></p><p class=\"\"><span>It was the summer of 1985. I remember sitting in that red fabric seat, feet barely flat on the floor, popcorn and Coke balanced carefully in my lap – no cup holders back then. The lights dimmed, the projector hummed, and for the next two hours I was somewhere else entirely.</span></p><p class=\"\"><span>There’s a lot to like: the iconic car and soundtrack, the fantastic performances and sharp humor. But the thing that burned into my brain wasn’t the car or the jokes.</span></p><p class=\"\"><span>It was the clock tower. What a great scene…</span></p><p class=\"\"><span>The storm is rolling in. The cable is stretched across the street. Doc is shouting at Marty that lightning would strike at exactly 10:04 p.m. Not maybe. Not possibly. Exactly.</span></p><p class=\"\"><span>As a kid, that idea felt – well, electric. Lightning — something wild and uncontrollable — suddenly had a schedule. A time. A place. All you had to do was be standing in the right spot with the right mechanism, and you could harness it to change the course of your history.</span></p><p class=\"\"><span>I didn’t know it then, but that scene lodged itself somewhere deep.</span></p><p class=\"\"><span>Years passed. School, college, careers. The movie became a cultural touchstone for a generation. But the idea stayed with me — the idea that chaos isn’t always chaos. Sometimes it’s structured. Sometimes it’s scheduled.</span></p><p class=\"\"><span>Fast forward to my early days as a trader.</span></p><p class=\"\"><span>Instead of a movie screen, I was staring at price charts.</span></p><p class=\"\"><span>Markets are loud. There’s always a headline, always a hot take, always someone shouting about the next big thing.</span></p><p class=\"\"><span>You turn your screen on and a stock is up 18% on some headline you didn’t see coming. Another one gaps down 12% overnight. By the time you read the news and understand what happened, the move is over and it feels like the ship has already sailed.</span></p><p class=\"\"><span>It can feel random. It can feel unfair. It can feel like everyone else knew something you didn’t.</span></p><p class=\"\"><span>But then I realized something that took me back to that theater in 1985…</span></p><p class=\"\"><span>Not all volatility is random.</span></p><p class=\"\"><span>Some of it is scheduled.</span></p><p class=\"\"><span>Some of it comes with a timestamp.</span></p><p class=\"\"><span>And if you know when and where the lightning is going to strike — if you build the right mechanism in advance — you don’t need to control the storm.</span></p><p class=\"\"><span>You just need to be ready for it…</span></p><p class=\"\"><span>Very early in my career I developed a deep love and appreciation for the simple earnings trade.</span></p><p class=\"\"><span>They represent one of the rare moments in the market where uncertainty becomes structured. Sitting at the intersection of expectation, volatility, and psychology, they channel forces that drive price movement more than any headline ever could.</span></p><p class=\"\"><span>And just like that clock tower scene – when you approach it correctly, it transforms what feels like chaos into potentially life-changing opportunities.</span></p><p class=\"\"><span>So today I’m going to share with you the three biggest reasons earnings setups are some of my favorite trades a person can take.</span></p><p class=\"\"><span>No. 1 – We Know When Volatility Will Hit</span></p><p class=\"\"><span>If you’ve made it this far, then you’ve probably already figured out that I love earnings trades because they answer two of the toughest questions a trader can face: “Where” and “when.”</span></p><p class=\"\"><span>Most market volatility feels random. A Fed comment hits the tape. A geopolitical headline breaks. A CEO says something off-script on television. You’re reacting after the fact.</span></p><p class=\"\"><span>With earnings we’re a lot like Doc and Marty – we know exactly where and when that lightning-fast volatility is set to hit.</span></p><p class=\"\"><span>So now that we have the earnings date, we know the right time and the right place. What we still need is the right mechanism.</span></p><p class=\"\"><span>No. 2 – High Probability Trade Setups</span></p><p class=\"\"><span>In the movie, knowing where the lightning will strike isn’t enough. They have to capture it and direct it into the flux capacitor. So they build a wiring rig — a cable system designed to channel 1.21 gigawatts of raw energy into the back of the DeLorean.</span></p><p class=\"\"><span>In earnings trades, that wiring rig is the trade structure itself — specifically, straddles and strangles.</span></p><p class=\"\"><span>When traders think about earnings, most of them immediately start debating direction. “They’re going to beat. Guidance will be strong. Buy calls!” “This one looks weak. Buy puts!”</span></p><p class=\"\"><span>The problem is that the market is already debating those things, too. Expectations are baked into the price before the company ever reports. A “beat” doesn’t guarantee a rally. A “miss” doesn’t guarantee a drop. What matters is how reality compares to what was already priced in.</span></p><p class=\"\"><span>Early on, I realized that trying to outguess Wall Street on direction wasn’t a consistent edge. What was more interesting was how options were priced relative to the stock’s historical post-earnings moves.</span></p><p class=\"\"><span>That’s where straddles and strangles come in.</span></p><p class=\"\"><span>A straddle involves buying a call and a put at the same strike price and expiration. You’re positioned for a significant move either up or down, because one side gains value as the stock moves sharply away from that strike.</span></p><p class=\"\"><span>A strangle is similar, but the call and put are purchased at different strike prices — typically out of the money. This structure usually costs less upfront than a straddle, but still benefits if the stock makes a large enough move in either direction.</span></p><p class=\"\"><span>In both cases, the goal isn’t to predict where the stock goes.</span></p><p class=\"\"><span>It’s to position for how far it moves.</span></p><p class=\"\"><span>Instead of betting on up or down, we structure trades that benefit from movement itself. If history shows a stock regularly moves 8%, 10%, sometimes 15% after earnings, but the options market is pricing in a much smaller move, that’s a pricing discrepancy.</span></p><p class=\"\"><span>Now we’re not asking, “Will they beat?”</span></p><p class=\"\"><span>We’re asking, “Is this move underpriced?”</span></p><p class=\"\"><span>That shift changes everything. It removes the emotional tug-of-war of being right or wrong on direction and replaces it with a probabilistic framework focused on volatility — the kind of preparation that turns our lightning strike into something useful.</span></p><p class=\"\"><span>No. 3 – Repeatable Process</span></p><p class=\"\"><span>My third and final reason I love earnings trades is that they’re not a one-off opportunity. This isn’t about catching a single lucky move.</span></p><p class=\"\"><span>Earnings season starts all over again each quarter. Four times a year, the entire cycle repeats itself. Expectations build. Companies report. Volatility expands.</span></p><p class=\"\"><span>It’s the next best thing to having a time machine.</span></p><p class=\"\"><span>And because we have a battle-tested approach we’ve spent the past two years putting together some of the best trades of my career.</span></p><p class=\"\"><span>We can scan for names with a history of large post-earnings moves, compare implied volatility to those historical moves, and structure defined-risk trades that align with that data. And we can size them in a way that assumes some losses are part of the distribution.</span></p><p class=\"\"><span>Then we do it again next quarter.</span></p><p class=\"\"><span>This isn’t about hitting a grand slam every time. It’s about operating with a framework that gives us a statistical edge over a series of trades.</span></p><p class=\"\"><span>That’s how professionals think. They don’t rely on one outcome. They rely on process.</span></p><p class=\"\"><span>That’s the Power of Earnings</span></p><p class=\"\"><span>When probabilities move, but price and volatility haven’t caught up yet, that gap becomes actionable. That’s where opportunity lives.</span></p><p class=\"\"><span>Earnings season is where this strategy really shines. </span></p><p class=\"\"><span>So far this quarter, my closed trades are running at a 60% win rate, with an average return of 85.76% over roughly 31 days. And just last week, we closed out a 300% win on our Fastly (FSLY) earnings strangle.</span></p><p class=\"\"><span>That’s when expectations collide with reality. When analyst forecasts meet hard numbers. When hype either gets validated — or breaks.</span></p><p class=\"\"><span>And when expectations are even slightly misaligned, stocks can move violently.</span></p><p class=\"\"><span>So far this season, we’ve already captured multiple double- and triple-digit percentage gains by focusing on one thing: Real money flow, not headlines.</span></p><p class=\"\"><span>We look for moments when institutional positioning and probability signals start to diverge from consensus expectations. Then we structure trades around that gap.</span></p><p class=\"\"><span>I’ve already used these signals to identify rapid moves in stocks like:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>SunRun (151% in 2 days)</span></li><li class=\"listItem-bmN0_SHH\"><span>BHP (189% in 17 days)</span></li><li class=\"listItem-bmN0_SHH\"><span>Alphatec Holdings (213% in 2 weeks)</span></li><li class=\"listItem-bmN0_SHH\"><span>Fastly (300%+ in just over a month)</span></li><li class=\"listItem-bmN0_SHH\"><span>Snap (375%+ combined in about 2 months)</span></li></ul><p class=\"\"><span>That’s the repeatable edge we exploit.</span></p><p class=\"\"><span>And right now, another setup is forming at the intersection of prediction-market probability shifts and under-the-radar earnings catalysts. In a new presentation, I’m walking through three high-conviction opportunities developing in sectors most investors aren’t paying attention toyet.</span></p><p class=\"\"><span>If the market has ever felt random to you, this will show you that it doesn’t have to be.</span></p><p class=\"\"><span>Watch the presentation and see how we position ourselves when we know exactly where — and when — the lightning is going to strike.</span></p><p class=\"\"><span>Remember, the creative trader wins.</span></p><p class=\"\"><span>More from InvestorPlace</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://investorplace.com/smartmoney/2026/02/invest-smart-market-loses-mind/?utm_source=tradingview&amp;utm_medium=editorial\" rel=\"nofollow\" target=\"_blank\">How to Invest Smartly When the Market Loses Its Mind</a></li><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://investorplace.com/smartmoney/2026/02/markets-move-on-belief-not-facts/?utm_source=tradingview&amp;utm_medium=editorial\" rel=\"nofollow\" target=\"_blank\">Markets Move on Belief – Not Facts</a></li><li class=\"listItem-bmN0_SHH\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://investorplace.com/smartmoney/2026/02/biggest-tech-winners-rarely-look-obvious/?utm_source=tradingview&amp;utm_medium=editorial\" rel=\"nofollow\" target=\"_blank\">Why the Biggest Tech Winners Rarely Look Obvious at First</a></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/investorplace:d4e020856094b:0-the-closest-thing-to-a-time-machine-my-top-3-reasons-i-love-earnings/",
            "pub_date": "2026-02-28 23:05:00",
            "source": "InvestorPlace",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA4KSHYS:0",
            "title": "Merck & Co Inc Says FDA Sets PDUFA Date Of June 19, 2026 For Welireg And Keytruda",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Merck &amp; Co Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>KEYTRUDA® (PEMBROLIZUMAB) PLUS WELIREG® (BELZUTIFAN) GIVEN AS ADJUVANT THERAPY REDUCED THE RISK OF DISEASE RECURRENCE OR DEATH BY 28% COMPARED TO KEYTRUDA MONOTHERAPY IN CERTAIN PATIENTS WITH EARLIER-STAGE RENAL CELL CARCINOMA (RCC)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - KEYTRUDA PLUS WELIREG REDUCES RISK OF RECURRENCE OR DEATH BY 28%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - FDA ACCEPTS PRIORITY REVIEW FOR WELIREG AND KEYTRUDA COMBINATION</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - FDA SETS PDUFA DATE OF JUNE 19, 2026 FOR WELIREG AND KEYTRUDA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA4KSHYS:0-merck-co-inc-says-fda-sets-pdufa-date-of-june-19-2026-for-welireg-and-keytruda/",
            "pub_date": "2026-02-28 23:08:22",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L8N3ZO0LQ:0",
            "title": "Dolce & Gabbana spotlights \"Identity\" with all‑black Milan runway",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div><span><p class=\"\"><span>Italian luxury label Dolce &amp; Gabbana unveiled an almost entirely black collection at Milan Fashion Week on Saturday, drawing on elements that define the house's roots and identity.</span></p><p class=\"\"><span>Pop superstar Madonna, who recently fronted the brand’s advertising campaign for two new fragrances, watched the show from the front row.</span></p><p class=\"\"><span>The fashion house has made substantial investments in its beauty division, which it brought in‑house three years ago, even as demand for high‑end goods has softened.</span></p><p class=\"\"><span>The show, titled “Identity”, opened with a series of coats and jackets featuring backs that replicated their buttoned fronts.</span></p><p class=\"\"><span>Italian designers Domenico Dolce and Stefano Gabbana dressed models in tailored suits and see‑through black lace dresses, often worn with shawls and mid‑calf socks, paired with low lace‑up shoes or stiletto heels.</span></p><p class=\"\"><span>“Identity is the ultimate luxury — a language built on roots that are still alive: Sicily as emotion, black as strength, lace as intimacy, tailoring as authority,” they wrote in the press notes.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L8N3ZO0LQ:0-dolce-gabbana-spotlights-identity-with-all-black-milan-runway/",
            "pub_date": "2026-02-28 23:11:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "newsbtc:8c33f1fcc094b:0",
            "title": "Bitcoin In The Line Of Fire: Price Dips To $63k As US, Israel Launch Strikes On Iran",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>The missiles started flying, and so did the sell orders. Within hours of the US and Israel launching coordinated strikes on Iran, Bitcoin had dropped as much as 3.8% to $63,038, Ethereum had fallen nearly 9%, and more than 152,000 traders had been liquidated across crypto markets. With traditional stock and bond markets closed for the weekend, digital assets absorbed the full force of the panic — alone.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>US And Israel Hit Iran’s Military And Nuclear Sites</span></strong></p><p class=\"\"><span>US President Donald Trump confirmed on Friday that the US had begun what he described as “major combat operations” against Iran, with strikes aimed at the country’s missile systems, naval assets, and nuclear infrastructure.</span></p><p class=\"\"><span>Reports say Israel’s Defense Minister Israel Katz described the operation as a preemptive move, with both governments coordinating the assault. The scale and speed of the attack caught many off guard, and Iran’s response came quickly.</span></p><div class=\"container-n2KCMK3i\" data-qa-id=\"tweet-widget-container\"><blockquote class=\"blockquote-n2KCMK3i\"><div class=\"header-n2KCMK3i\"><span class=\"profile-n2KCMK3i\"><div class=\"avatar-n2KCMK3i\"></div><div class=\"name-n2KCMK3i\">CNN</div><div class=\"username-n2KCMK3i\">@CNN</div></span><span aria-hidden=\"true\" class=\"logo-n2KCMK3i\" role=\"img\"><svg height=\"28\" viewbox=\"0 0 28 28\" width=\"28\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"M19.75 5h3.07l-6.7 7.62L24 23h-6.17l-4.84-6.3L7.46 23H4.4l7.17-8.16L4 5h6.33l4.37 5.75L19.75 5Zm-1.24 16h1.7L9.54 7H7.7l10.8 14Z\" fill=\"currentColor\"></path></svg></span></div><div class=\"description-n2KCMK3i\"><p class=\"\"><span>The US is carrying out strikes on Iran, two US officials tell CNN. Follow live updates: </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/pG6pfrPwlm\" rel=\"nofollow\" target=\"_blank\">https://t.co/pG6pfrPwlm</a><span> </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://t.co/vPGeQ9ILHp\" rel=\"nofollow\" target=\"_blank\">pic.twitter.com/vPGeQ9ILHp</a></p></div><span class=\"date-n2KCMK3i\">Feb 28, 2026</span><span class=\"border-n2KCMK3i\"></span><span class=\"socials-n2KCMK3i\"></span><a href=\"https://twitter.com/CNN/status/2027643466038026372\" rel=\"nofollow noopener noreferrer\"></a></blockquote><div></div></div><p class=\"\"><span>According to reports, Iran launched waves of missiles and drones targeting not just Israel but American military installations across the Gulf region. A US base in Bahrain was reportedly struck. Qatar and the UAE said their defense systems intercepted projectiles flying over their territory.</span></p><p class=\"\"><span>Explosions were heard in Dubai. Bahrain shut its airspace entirely. Iran’s semi-official Tasnim news agency declared that all US bases and interests across the region would be considered legitimate targets.</span></p><p class=\"\"><span>The conflict, by Saturday morning, had spread well beyond Iranian and Israeli borders.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Crypto Markets Take The Hit Traditional Markets Cannot Yet Feel</span></strong></p><p class=\"\"><span>Stocks, bonds, and commodities markets were closed. Crypto was not. Bitcoin trades around the clock, every day of the week, which made it the only major financial market available to absorb the weekend’s fear.</span></p><p class=\"\"><span>The selling was fast and broad. Reports say roughly $128 billion in total market value was wiped across digital assets in the hours following the strike confirmation.</span></p><p class=\"\"><span>Bitcoin fell from around $66,000 to as low as $63,038 before settling near $64,000. Ethereum dropped below $1,850. XRP slid 8% to trade near $1.29. Solana, Dogecoin, Cardano, and Chainlink each recorded losses of between 8% and 12%.</span></p><p class=\"\"><span>According to CoinGlass data, Bitcoin futures liquidations reached approximately $192 million, with futures trading volume surging to around $68.27 billion — a sign that derivatives markets were amplifying the move rather than spot sellers driving it alone. Total liquidations across all crypto assets hit $515 million within 24 hours.</span></p><p class=\"\"><span>The Fear and Greed Index, a widely watched measure of market sentiment, fell to 14 — deep inside extreme fear territory.</span></p><p class=\"\"><em><span>Featured image from Getty Images, chart from TradingView</span></em></p></span></div></div>",
            "link": "https://www.tradingview.com/news/newsbtc:8c33f1fcc094b:0-bitcoin-in-the-line-of-fire-price-dips-to-63k-as-us-israel-launch-strikes-on-iran/",
            "pub_date": "2026-02-28 23:00:00",
            "source": "NewsBTC",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20260228002298:0",
            "title": "Berkshire Hathaway shrinks cash pile in Buffett's last act as CEO. Here's how successor Greg Abel is now looking to spend.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Tomi Kilgore</span></p><p class=\"\"><span>Company's cash hoard at end of 2025 - which Abel noted was not a sign of an investment retreat - was down 2.1% from September to $373.3 billion</span></p><p class=\"\"><span>Berkshire Hathaway's cash holdings have dipped, and the new CEO, Greg Abel, is evaluating opportunities.</span></p><p class=\"\"><span>It's Greg Abel's Berkshire Hathaway now, but the last act of Warren Buffett as CEO appears to have been putting some of the conglomerate's record cash hoard to work.</span></p><p class=\"\"><span>And in the first annual shareholder letter not penned by Buffett in 60 years, Abel said he is currently evaluating other opportunities, but will remain patient and disciplined in making investments, even in Berkshire's own stock (BRK.B) (BRK.A).</span></p><p class=\"\"><span>Abel assured shareholders that the way decisions are made, and how capital is allocated under his watch, will continue on the path set by Buffett \"into perpetuity.\"</span></p><p class=\"\"><span>Berkshire's annual report released early Saturday showed that the cash held as of Dec. 31 was $373.31 billion, down from the record $381.67 billion held at the end of the third quarter but still up 11.7% from the end of 2024.</span></p><p class=\"\"><span>\"Many times in Berkshire's history, some observers have suggested that our substantial cash position signals a retreat from investing,\" Abel wrote. \"It does not.\"</span></p><p class=\"\"><span>And while Abel said share repurchases were an \"important capital-allocation option,\" the company didn't buy back any stock during the fourth quarter, extending that trend to six quarters.</span></p><p class=\"\"><span>Berkshire's stock was little-changed during the fourth quarter, while the S&amp;P 500 index SPX rose 2.4%. So far this year, the stock has edged up 0.5% to match the S&amp;P 500's performance.</span></p><p class=\"\"><span>Following are some key insights from Abel's letter to shareholders.</span></p><p class=\"\"><span>Investments in Japan are as important as U.S. holdings</span></p><p class=\"\"><span>Abel noted that a large portion of Berkshire's equity investments are held in a small number of U.S. companies, notably investments in Apple (AAPL), American Express (AXP), Coca-Cola (KO) and Moody's (MCO). The total market value of those holdings was $158.6 billion as of Dec. 31.</span></p><p class=\"\"><span>\"This concentrated approach will continue, with limited activity in these holdings, though we may significantly adjust a holding if we see fundamental changes in its long-term economic prospects,\" Abel wrote.</span></p><p class=\"\"><span>The same methodology in choosing investments in American companies is used in finding opportunities in Japan, \"which we view as comparable to our major U.S. holdings in importance and long-term value-creation opportunity.\"</span></p><p class=\"\"><span>The largest Japan holdings, with a total market value of $35.37 billion, are Mitsubishi (JP: 8058), Itochu (JP: 8001), Mitsui &amp; Co. (MITSY), Marubeni (MARUY) and Sumitomo (SSUMY).</span></p><p class=\"\"><span>Earnings fall for the quarter and year</span></p><p class=\"\"><span>Net income in the latest quarter fell 2.5% from the same period a year ago to $19.2 billion.</span></p><p class=\"\"><span>Operating earnings, which exclude investment gains and other nonrecurring items, declined 29.8% to $10.2 billion for the quarter, and were down 6.2% for the year to $44.5 billion.</span></p><p class=\"\"><span>Abel noted, however, that while 2025 earnings showed a decline, they were above the $37.5 billion in earnings Berkshire has averaged over the past five years, which he said underscores the durability of Berkshire's operating business, while also showing there's room for improvement.</span></p><p class=\"\"><span>Buffett remains a fixture at the office</span></p><p class=\"\"><span>Here's how Abel's first shareholder letter started: \"Warren Buffett is arguably the greatest investor of all time, with generations benefiting from his investment acumen.\"</span></p><p class=\"\"><span>He said, however, that Buffett shouldn't be viewed solely as an investment guru. What will endure, according to his successor as CEO, is how he ran his businesses, and how he treated shareholders as partners.</span></p><p class=\"\"><span>And Buffett may no longer be running the business, but Abel reminded shareholders that Buffett will still be in the office \"five days a week\" as chairman, and will continue to have a say in which stocks Berkshire buys.</span></p><p class=\"\"><span>-Tomi Kilgore</span></p><p class=\"\"><span>This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20260228002298:0/",
            "pub_date": "2026-02-28 23:02:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_TUA6RPDLY:0",
            "title": "Merck Says Welireg Plus Lenvima Reduces Risk Of Disease Progression By 30%",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>Merck &amp; Co Inc </span><span>:</span></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>WELIREG® (BELZUTIFAN) PLUS LENVIMA® (LENVATINIB) REDUCED THE RISK OF DISEASE PROGRESSION OR DEATH BY 30% COMPARED TO CABOZANTINIB IN CERTAIN PREVIOUSLY TREATED PATIENTS WITH ADVANCED RENAL CELL CARCINOMA (RCC)</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - WELIREG PLUS LENVIMA REDUCES RISK OF DISEASE PROGRESSION BY 30%</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - WELIREG PLUS LENVIMA SHOWS SIGNIFICANT IMPROVEMENT IN PROGRESSION-FREE SURVIVAL</span></p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\"><span>MERCK &amp; CO INC - FDA ACCEPTS REVIEW OF TWO SUPPLEMENTAL NDAS FOR WELIREG PLUS LENVIMA</span></p></li></ul></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_TUA6RPDLY:0-merck-says-welireg-plus-lenvima-reduces-risk-of-disease-progression-by-30/",
            "pub_date": "2026-02-28 23:03:09",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2026:newsml_L6N3ZO0B7:0",
            "title": "Berkshire Hathaway profit falls on lower insurance income, writedown",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Berkshire took $4.5 billion writedown for Occidental</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Net seller of stocks, no buybacks in Q4</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Abel pledges to continue Buffett's legacy</span></li></ul></span></div><span><p class=\"\"><span>By Jonathan Stempel</span></p><p class=\"\"><span>Berkshire Hathaway </span><span> on Saturday said operating profit fell in the fourth quarter, reflecting lower income from its insurance operations, and wrote down a longstanding investment in Occidental Petroleum </span><span>.</span></p><p class=\"\"><span>The quarter was Warren Buffett's last as the conglomerate's chief executive, a job now held by Greg Abel. Buffett remains chairman.</span></p><p class=\"\"><span>Berkshire also reported ending 2025 with $373.3 billion of cash, giving Abel the firepower to make the kind of major acquisitions that eluded Buffett over the last decade.</span></p><p class=\"\"><span>It was also the thirteenth consecutive quarter in which Berkshire sold more stocks than it bought, and the sixth with no share buybacks.</span></p><p class=\"\"><span>Quarterly operating profit fell 30% to $10.2 billion, or about $7,092 per Class A share, from $14.53 billion a year earlier.</span></p><p class=\"\"><span>Net income fell 3% to $19.2 billion from $19.69 billion, as the writedown and lower operating profit offset the value of Berkshire's holdings in Apple </span><span>, American Express </span><span> and other stocks.</span></p><p class=\"\"><span>ABEL PAYS TRIBUTE TO BUFFETT</span></p><p class=\"\"><span>For the full year, operating profit fell 6% to $44.49 billion, while net income fell 25% to $89 billion.</span></p><p class=\"\"><span>Buffett had long urged investors to ignore fluctuations in Berkshire's net income, which reflect accounting rules that require Berkshire to report gains and losses on stocks that Berkshire isn't selling.</span></p><p class=\"\"><span>In his first annual letter to Berkshire shareholders, Abel paid tribute to his mentor, calling Buffett a \"remarkable CEO\" and \"arguably the greatest investor of all time\" and pledging to maintain his discipline in determining how to invest Berkshire's capital.</span></p><p class=\"\"><span>\"We are committed to strengthening the great legacy built by Warren Buffett and his business partner Charlie Munger, ensuring it endures through our commitment to excellence , Abel wrote, referring to Berkshire's late vice chairman. \"I recognize how you want us to succeed together, and to do so in the right way.\"</span></p><p class=\"\"><span>Berkshire's $4.5 billion writedown for Occidental reflected its belief that the recent decline in the oil company's stock price was not \"temporary,\" though it said it had no intention to sell any of its stock.</span></p><p class=\"\"><span>The writedown was Berkshire's second in 2025, in addition to a writedown of its investment in Kraft Heinz </span><span>.</span></p><p class=\"\"><span>Quarterly insurance profit fell 38% to $4.63 billion.  Falling interest rates reduced income on Berkshire's cash, while pricing pressures limited the willingness of the Geico auto insurer and reinsurance businesses to add customers.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2026:newsml_L6N3ZO0B7:0-berkshire-hathaway-profit-falls-on-lower-insurance-income-writedown/",
            "pub_date": "2026-02-28 23:00:37",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:0f7467978094b:0",
            "title": "Cogent Biosciences Highlights Additional Data with Six Bezuclastinib Posters from SUMMIT Trial at 2026 AAAAI Annual Meeting",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><em><span>Bezuclastinib mean TSS reduction deepens to –32.0 points at 48 weeks of treatment with further improvement shown across all measured symptoms</span></em></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><em><span>99% of patients achieve &gt;50% reduction in serum tryptase at 48 weeks, with 83% rate of normalization</span></em></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><em><span>Strong evidence of bezuclastinib’s potential as first disease modifying agent for NonAdvSM patient population given clear correlation between objective measures of disease burden and symptomatic improvement</span></em></li></ul></span></div><span><p class=\"\"><span>WALTHAM, Mass. and BOULDER, Colo., Feb. 28, 2026 (GLOBE NEWSWIRE) -- </span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=Detg4Z9xRfuTe6vapeoVl1wJCsh8r8YbjKtwJ9sO8i_3tWRnTv9EngcVChDor8OiFuE37Avwt1FCT7vDs4uvTyP2bGFqC_kKHDSxnJgzWvs=\" rel=\"nofollow\" target=\"_blank\">Cogent Biosciences, Inc.</a><span> </span><span>, a biotechnology company focused on developing precision therapies for genetically defined diseases, today announced additional clinical results from the pivotal SUMMIT trial with bezuclastinib in patients with NonAdvanced Systemic Mastocytosis (NonAdvSM) at the American Academy of Allergy Asthma &amp; Immunology (AAAAI) Annual Meeting. As previously reported, bezuclastinib demonstrated clinically meaningful and highly statistically significant improvements across the primary and all key secondary endpoints. New results highlight the deepening of clinical benefit over longer treatment duration, the benefit of bezuclastinib in populations with high unmet need, and bezuclastinib’s impact on bone mineral density as additional evidence of disease modification.</span></p><p class=\"\"><span>“The additional SUMMIT data presented at AAAAI today reinforce our belief that bezuclastinib can rapidly and meaningfully improve a wide variety of symptoms that impact the daily lives of patients with NonAdvanced SM,” said Andrew Robbins, Cogent’s President and Chief Executive Officer. “These posters underscore the significance of our findings and build upon the data we shared at ASH last year. Adding</span></p><p class=\"\"><span>all these results together, bezuclastinib’s profile continues to be a very active, well-tolerated option for NonAdvSM patients, which we believe has the opportunity to become the preferred standard of care.”</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Data Highlights from the SUMMIT Posters</span></strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Treatment with bezuclastinib resulted in rapid, durable, statistically significant symptomatic improvements which continued to deepen out to 48 weeks:</span></strong><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Patients on bezuclastinib reported a -32.0 point mean change in TSS, representing a 56% relative improvement in TSS from baseline</span></li><li class=\"listItem-bmN0_SHH\"><span>86% of patients achieved a clinically meaningful threshold of 30% improvement in symptoms</span></li><li class=\"listItem-bmN0_SHH\"><span>99% of patients had at least 50% reduction in serum tryptase, with 83.3% of patients achieving normalization</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Patients treated with bezuclastinib reported clear improvements across all relevant organ systems as evidenced by relative improvement at 48 weeks:</span></strong></li></ul><div class=\"tableContainer-VG8_37yK\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><strong class=\"root-Tkn6WL2y\"><span>Symptom/Domain</span></strong></td><td><strong class=\"root-Tkn6WL2y\"><span>Mean Change from Baseline</span></strong></td><td colspan=\"2\"><strong class=\"root-Tkn6WL2y\"><span>Relative Improvement from Baseline</span></strong></td></tr><tr><td><span>Dermatologic</span></td><td><span>-13.94</span></td><td colspan=\"2\"><span>-65.0%</span></td></tr><tr><td><span>Neurocognitive</span></td><td><span>-12.77</span></td><td colspan=\"2\"><span>-53.6%</span></td></tr><tr><td><span>Gastrointestinal</span></td><td><span>-6.63</span></td><td colspan=\"2\"><span>-62.5%</span></td></tr><tr><td><span>Pain</span></td><td><span>-5.43</span></td><td colspan=\"2\"><span>-45.8%</span></td></tr><tr><td><span>Fatigue</span></td><td><span>-3.02</span></td><td colspan=\"2\"><span>-41.3%</span></td></tr></tbody></table></div><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Bezuclastinib demonstrates strong evidence of disease modification in NonAdvSM patients based on:</span></strong><span> </span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><span>Significant correlation shown between serum tryptase reduction and symptomatic improvement as measured by TSS (primary endpoint), all symptom domains, and 10/11 individual symptoms</span></li><li class=\"listItem-bmN0_SHH\"><span>Clinically meaningful improvements in bone mineral density (BMD) at week 24 for patients treated with bezuclastinib, regardless of baseline bone health severity.</span></li><li class=\"listItem-bmN0_SHH\"><span>50% of patients reported a dose reduction and/or discontinuation of best supportive care medicines during the treatment period at week 48</span></li></ul><span> </span></li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\"><span>Bezuclastinib demonstrates consistent biomarker and symptomatic improvement in patients with smoldering SM, a subgroup of NonAdvSM with high unmet need.</span></strong></li></ul><p class=\"\"><span>As previously reported, bezuclastinib demonstrated a favorable safety and tolerability profile, supporting its potential for chronic use in patients with NonAdvSM. </span></p><p class=\"\"><span>Copies of Cogent’s data presentations from the AAAAI Annual Meeting will be available in the Posters and Publications section of the company’s website at cogentbio.com.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)</span></strong></p><p class=\"\"><span>Cogent also announced today that, on February 25, 2026, the Compensation Committee of Cogent’s Board of Directors, made up entirely of independent directors, approved the grants of “inducement” equity awards to three new employees under the company’s 2020 Inducement Plan with a grant date of February 25, 2026. The awards were approved in accordance with Listing Rule 5635(c)(4) of the corporate governance rules of the Nasdaq Stock Market. The employees received, in the aggregate, (i) nonqualified options to purchase 24,000 shares of Cogent common stock and (ii) 21,000 restricted stock units (RSUs). Each option has a 10-year term, an exercise price equal to the closing price of Cogent’s common stock on the grant date, and a 4-year vesting schedule with 25% vesting on the 1-year anniversary of the grant date and the remainder vesting in equal monthly installments over the subsequent 36 months, provided such employee remains employed through each such vesting date. The RSUs vest annually in equal installments over 4 years from the grant date, provided such employee remains employed through each such vesting date.</span><strong class=\"root-Tkn6WL2y\"><span> </span></strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Cogent Biosciences, Inc.</span></strong></p><p class=\"\"><span>Cogent Biosciences is a biotechnology company focused on developing precision therapies for genetically defined diseases. The most advanced clinical program, bezuclastinib, is a selective tyrosine kinase inhibitor that is designed to potently inhibit the KIT D816V mutation as well as other mutations in KIT exon 17. KIT D816V is responsible for driving systemic mastocytosis, a serious disease caused by unchecked proliferation of mast cells. Exon 17 mutations are also found in patients with advanced gastrointestinal stromal tumors (GIST), a type of cancer with strong dependence on oncogenic KIT signaling. The company also has an ongoing Phase 1 study of its novel internally discovered FGFR2/3 inhibitor. In addition, the Cogent Research Team is developing a portfolio of novel targeted therapies to help patients fighting serious, genetically driven diseases targeting mutations in ErbB2, PI3Kα, KRAS and JAK2. Cogent Biosciences is based in Waltham, MA and Boulder, CO. Visit our website for more information at www.cogentbio.com. Follow Cogent Biosciences on social media: </span><strong class=\"root-Tkn6WL2y\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=V9vYsxka-isZnE80B1MrKAKEcUntuQt6-MsYerCNzBxyDeLTCnFeW2rgio0xLOEs1qIb0pjIsXBu_N3S9eTLwQuH9fmweuAzfGKvD4iGMqrQ4usgaDH8gl3YvfPAacqeVIuLw0Nx2lBsegxIpUIPV4XbJiv5U6dPbWSHaLXnVbRjMFogThlr0VrAHQFiw4geyMar0ptTMr6BbiEB2fXclJhnxYjeQSPU5wDs83hlPcwySJ-gkIWlB-UEamcOpsRQFs1UHyGzx4-SId_LQM15Dea-tBkY10fNOuddgr0qX_EUQ3Basysz8t1DTm3iJP8hF9x0qfrAJ3pVabetRVwy0m9gz7oQMNPYPLC6AXNzRMUKkRuHAjHHO1qIWjjKLwKxJqTMSAE4u7Ahhf7bvyu_jcQ8GXMfVwPZ-rTKx5pCWbljmT0S2Da3l7ZJNV_DIhF7RgU6IxXCPO1hVMSkRAbRaZfokofV97kfae822kGtda1gLSQjEaYwdizPTQDkTWMBVVVHL19H6q9tBGbbnA4dueHHGSR4daJ-64PLrwE8Y2xB7YbGqg9JQYUAx7NC3TD4guf-K2o-2xBFb5at5AUGHSUGER6cBwA6TgX3tOdSXTagXxa3OUgSbyiJEXExF_7q5NpA60U5m3ee5d7kgN-5Qz9pIUGfFlTTUGv-1niYSSo3qJxILP54fjNHULt1hfZFDykaqvWy2VzUrINecIvnu5883rukoZvF4c59lQDyZCriXNYtoZACx8VygHFjQTUNuQMMrhKTO80mwzxqCejLhiqkWtXo-tkhxtjlCEmgEvV69r-44RPIJiEC7YZt-Lmi6Us1i3BDspRceUlOcT2ZcR8oLAv2fnDXVrDE4y0dyY5bBZVnE1j3Oxk8q9yLHqPNd_G5-PMRXjcaK4-G72dmRZAsQI0D_slVr1ao_jvInEVnlocvEB3rqlb7cOfKFl4ZxnygEAjZcSw9n4SQXhOkV_18O1JuyS1rK1fGgGFF-T8goZwBVy77KxawYR_WEVaGjHAdBsk3StpMaHoIpiwZmg==\" rel=\"nofollow\" target=\"_blank\">X</a></strong><span> (formerly known as Twitter) and </span><strong class=\"root-Tkn6WL2y\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=uUGgCq9ad6sBSKfNMCQ9Wes_cDVjW4spsBDyZRgAwLG6DMF5_prWrKOsafC925C4bVDm7LbhDa-pmuvV1wM1vz8Hyp_ZCL5vgnbw55s8BCRGdRdERHSmqVPYt6Mwz-svuiSm_dMX9FpxeVoQhaA8OSa_pM84ZxPAu-dsuW-KkwczMERtaae-ChjID6d7K9qUAYlJfvVPhera41poDlREBKANjzywIXQDcxm8gtlznIM_J7Zn8d2l-roe81wIsAQ2pYNlzBqNpuZvWu5yQH6Yjd0MdsDoX_0TQIcYlul6-SI0ujAHo5leYDgyH-yk-_C3Tnbjs2PC_VMrWci7_b9tlxM34ZmCIL_j3vNzVRDCJMnfTR-n0Sqqvv2trC8KOKGnd_K3ibvgMQM5PnR5SOWrj87Uq1qLTNvoFJkLZjrFeeUTzKOdaeXx1cfUOqgzOHDQtvqGjPWcftcj2rizwDOQyAWYRqTsH1Ui0cXYnUeLQjY=\" rel=\"nofollow\" target=\"_blank\">LinkedIn</a></strong><span>. Information that may be important to investors will be routinely posted on our website and </span><strong class=\"root-Tkn6WL2y\"><span>X</span></strong><span>.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Forward Looking Statements</span></strong></p><p class=\"\"><span>This press release contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding: bezuclastinib’s potential to be the first disease modifying agent for patients with NonAdvSM; the company’s belief that bezuclastinib can rapidly and meaningfully improve a wide variety of symptoms that impact the daily lives of patients with NonAdvSM; the company’s belief that bezuclastinib has the opportunity to become the preferred standard of care for patients with NonAdvSM; and the potential for bezuclastinib’s chronic use in patients with NonAdvSM. The use of words such as, but not limited to, \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"might,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"target,\" \"will,\" or \"would\" and similar words expressions are intended to identify forward-looking statements. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based on our current beliefs, expectations and assumptions regarding the future of our business, future plans and strategies, our clinical results, the rate of enrollment in our clinical trials and other future conditions. New risks and uncertainties may emerge from time to time, and it is not possible to predict all risks and uncertainties. No representations or warranties (expressed or implied) are made about the accuracy of any such forward-looking statements. We may not actually achieve the forecasts or milestones disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements. Such forward-looking statements are subject to a number of material risks and uncertainties including but not limited to those set forth under the caption \"Risk Factors\" in Cogent's most recent Quarterly Report on Form 10-Q filed with the SEC. Any forward-looking statement speaks only as of the date on which it was made. Neither we, nor our affiliates, advisors or representatives, undertake any obligation to publicly update or revise any forward-looking statement, whether as result of new information, future events or otherwise, except as required by law. These forward-looking statements should not be relied upon as representing our views as of any date subsequent to the date hereof.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Contact:</span></strong></p><p class=\"\"><span>Christi Waarich</span></p><p class=\"\"><span>Senior Director, Investor Relations</span></p><p class=\"\"><span>christi.waarich@cogentbio.com</span></p><p class=\"\"><span>617-830-1653</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:0f7467978094b:0-cogent-biosciences-highlights-additional-data-with-six-bezuclastinib-posters-from-summit-trial-at-2026-aaaai-annual-meeting/",
            "pub_date": "2026-02-28 22:45:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "globenewswire:f4b589049094b:0",
            "title": "Goliath Resources Proposes to Extend Term of Warrants Held by McEwen Inc.",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>TORONTO, Feb. 28, 2026 (GLOBE NEWSWIRE) -- </span><strong class=\"root-Tkn6WL2y\"><span>Goliath Resources Limited (TSX-</span><span>V:GOT</span><span> </span><span>OTCQX:GOTRF</span><span> </span><span>FSE:B4IF</span><span> (“Goliath” or the “Company”) </span></strong><span>announces that it has applied to the TSX Venture Exchange (the “TSXV”) to extend the term of an aggregate of 2,590,673 common share purchase warrants of the Company (the “Warrants”), with each Warrant being exercisable to acquire one common share of the Company (each a “Warrant Share”) at a price of $2.50 per Warrant Share. As disclosed by the Company in a news release dated March 10, 2025, the Warrants were issued by the Company on March 10, 2025 in connection with a $10,000,000 strategic non-brokered private placement of 5,181,347 units of the Company (“Units”) to McEwen Inc. </span><span> </span><span> (“McEwen”), an arm’s length party to the Company, at a deemed price of C$1.93 per Unit, in exchange for the issuance to the Company of an aggregate of 868,056 shares of common stock of McEwen (“McEwen Shares”) at a deemed price of C$11.52 per McEwen Share.</span></p><p class=\"\"><span>The Warrants are scheduled to expire on March 10, 2026. Subject to acceptance by the TSXV, the Company will extend the expiry date of the warrants by six months to September 10, 2026. All other terms and conditions of the Warrants, including the exercise price, will remain unchanged.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>About Goliath Resources Limited</span></strong></p><p class=\"\"><span>Goliath Resources is an explorer of precious metals projects in the highly prospective Golden Triangle of Northwestern British Columbia. All of its projects are in high quality geological settings and geopolitical safe jurisdictions amenable to mining in Canada. Goliath is a member and active supporter of CASERM which is an organization that represents a collaborative venture between Colorado School of Mines and Virginia Tech. In 2025, Goliath completed its largest drill campaign to date for a total of 64,364 meters. It is fully funded for a similar sized drill program in 2026. The Company’s key strategic cornerstone shareholders include Crescat Capital, Waratah Capital Advisors, McEwen Inc. </span><span> </span><span>, a Global Commodity Group (Singapore), Rob McEwen, Eric Sprott and Larry Childress.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>For more information please contact: </span></strong></p><p class=\"\"><span>Goliath Resources Limited </span></p><p class=\"\"><span>Mr. Roger Rosmus </span></p><p class=\"\"><span>Founder and CEO </span></p><p class=\"\"><span>Tel: +1.416.488.2887</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=RGkqZgcWenpBXIJcYDi4bhqBZvCN6OSUzfErE0RVIc8H5tM82_cv-DEHLCSrTVT0GTaFcGnQYWWzo0gYEySURfPFVSRQajHJgpC-_x3H7LIuk5P-Ic0S7moqVFdZL_gF\" rel=\"nofollow\" target=\"_blank\">roger@goliathresources.com</a><span> </span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.globenewswire.com/Tracker?data=kaehsF86f7IHLoqY5iLGLQxkKiVDG0SUX4KqixRGLXCw6fXUDHO16WNUC3s6qFhcmtfJ2JixVCxQJZbKesZ5DWd_9L8vTtMZTwuTCc8SViYguadfv0VoNOdY3hkb1Dfo\" rel=\"nofollow\" target=\"_blank\">www.goliathresourcesltd.com</a><span> </span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Disclaimer for Forward-Looking Statements</span></strong></p><p class=\"\"><em><span>Certain statements contained in this press release constitute forward-looking information. These statements relate to future events or future performance. The use of any of the words “could”, “intend”, “expect”, “believe”, “will”, “projected”, “estimated” and similar expressions and statements relating to matters that are not historical facts are intended to identify forward-looking information and are based on Goliath’s current belief or assumptions as to the outcome and timing of such future events. Actual future results may differ materially. In particular, this release contains forward-looking information relating to, among other things: the extension of the term of the Warrants; and TSXV approval of the extension of the term of the Warrants. Various assumptions or factors are typically applied in drawing conclusions or making the forecasts or projections set out in forward-looking information. Those assumptions and factors are based on information currently available to Goliath. Although such statements are based on management's reasonable assumptions, there can be no assurance that the proposed transactions will occur, or that if the proposed transactions do occur, will be completed on the terms described above.</span></em></p><p class=\"\"><em><span>The forward-looking information contained in this release is made as of the date hereof and Goliath is not obligated to update or revise any forward-looking information, whether as a result of new information, future events or otherwise, except as required by applicable securities laws. Because of the risks, uncertainties and assumptions contained herein, investors should not place undue reliance on forward-looking information. The foregoing statements expressly qualify any forward-looking information contained herein.</span></em></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Neither the TSXV nor its Regulation Services Provider (as that term is defined in the policies of the TSXV) accepts responsibility for the adequacy or accuracy of this release.</span></strong></p></span></div></div>",
            "link": "https://www.tradingview.com/news/globenewswire:f4b589049094b:0-goliath-resources-proposes-to-extend-term-of-warrants-held-by-mcewen-inc/",
            "pub_date": "2026-02-28 22:38:00",
            "source": "GlobeNewswire",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000750:0",
            "title": "BIGLARI HOLDINGS INC. NEWS RELEASE",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>San Antonio, TX, Feb. 28, 2026 /PRNewswire/ — Biglari Holdings Inc.'s (</span><span>; BH) 2025 Annual Report to the shareholders has been posed on the Internet, where it can be accessed at www.biglariholdings.com. The report includes Sardar Biglari's annual letter to shareholders.</span></p><p class=\"\"><span>Biglari Holdings Inc.'s earnings for the fourth quarter and full year of 2025 and 2024 are summarized below.  To become fully apprised of our results, shareholders should carefully study our 10-K, which has been posted at www.biglariholdings.com.</span></p><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\"><span> </span><br/><span>(dollars in thousands) </span><br/><span>                                Fourth Quarter           Year Ended December 31, </span><br/><span>                         ----------------------------  --------------------------- </span><br/><span>                             2025           2024           2025          2024 </span><br/><span>                         -------------  -------------  ------------  ------------- </span><br/><span>Pre-tax operating </span><br/><span> earnings                $     (1,739)  $       3,896  $     18,782   $     32,569 </span><br/><span>Investment gains </span><br/><span> (losses)                     (62,319)       (21,856)      (66,473)       (40,723) </span><br/><span>Income taxes                    14,205          7,687        10,203          4,395 </span><br/><span>                         -------------  -------------  ------------  ------------- </span><br/><span>Net earnings (loss)       $   (49,853)   $   (10,273)  $   (37,488)  $     (3,759) </span><br/><span>                         =============  =============  ============  ============= </span><br/><span> </span></pre><p class=\"\"><span>Analysis of Results:</span></p><p class=\"\"><span>Investments affect our reported quarterly earnings based on their carrying value. We do not regard the quarterly or annual fluctuations in our investments to be meaningful. Therefore, our operating businesses are best analyzed before the impact of investment gains. As a consequence, in the preceding table we separate earnings of our operating businesses from our investment gains.</span></p><p class=\"\"><span>At December 31, 2025, our book value per Class A Equivalent share was $2,059.32. (Class B shares have 1/5(th) the economic rights of Class A shares.)</span></p><p class=\"\"><span>About Biglari Holdings Inc.</span></p><p class=\"\"><span>Biglari Holdings Inc. is a holding company owning subsidiaries engaged in a number of diverse business activities, including property and casualty insurance and reinsurance, licensing and media, restaurants, and oil and gas.</span></p><p class=\"\"><span>Comment on Regulation G</span></p><p class=\"\"><span>This press release contains certain non-GAAP financial measures. In addition to the GAAP presentations of net earnings, Biglari Holdings defines pre-tax operating earnings outside of the investment gains/losses of the Company.</span></p><p class=\"\"><span>Risks Associated with Forward-Looking Statements</span></p><p class=\"\"><span>This news release may include \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and other federal securities laws. These statements are based on current expectations and are subject to a number of risks and uncertainties that could cause actual results to differ markedly from those projected or discussed here. Biglari Holdings cautions readers not to place undue reliance upon any such forward-looking statements, for actual results may differ materially from expectations. Biglari Holdings does not update publicly or revise any forward-looking statements even if experience or future changes make it clear that any projected results expressed or implied therein will not be realized. Further information on the types of factors that could affect Biglari Holdings and its business can be found in the Company's filings with the SEC.</span></p><p class=\"\"><span>View original content:https://www.prnewswire.com/news-releases/biglari-holdings-inc-news-release-302700189.html</span></p><p class=\"\"><span>SOURCE Biglari Holdings Inc.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000750:0/",
            "pub_date": "2026-02-28 22:45:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "stocktwits:04c3f867a094b:0",
            "title": "‘Renounce Nuclear Ambitions,’ Trump Warns Iran While Nuclear Shares Turn Volatile",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><div class=\"summary-diQOvrPB\"><div class=\"summaryTitle-diQOvrPB\">Key points:</div><span><ul class=\"list-bmN0_SHH\"><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>DJT was down 2.28% in after-hours trading, despite high discussion on Stocktwits.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>The stock became highly discussed on Stocktwits, but it was still down 2.28% after hours, with neutral sentiment.</span></li><li class=\"listItem-bmN0_SHH listItem--lightning-bmN0_SHH\"><span>Nuclear stocks moved up and down, and traders had mixed views about how the tensions could affect the market.</span></li></ul></span></div><span><p class=\"\"><span>Shares of Trump Media &amp; Technology Group (DJT) fell on Friday after President Donald Trump gave a strong speech about Iran in which he said the regime must \"never have a nuclear weapon\" and warned that the U.S. would take more military action if Tehran didn't give up its nuclear goals.</span></p><p class=\"\"><span>Trump said in his speech that the US is carrying out a \"massive and ongoing operation\" to get rid of threats from Iran that are about to happen. He promised to destroy Iran's missile infrastructure and stop proxy forces from operating in the region. He said that Iran “rejected every opportunity to renounce their nuclear ambitions, and we can't take it anymore.”</span></p><p class=\"\"><span>He said that the campaign was important for U.S. national security and told Iran's security forces to put down their weapons, promising them immunity or \"certain death.\"</span></p><p class=\"\"><span>After the speech, DJT's retail popularity rose, and it became the most talked-about stock on Stocktwits, as traders reacted to rising global tensions.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/DJT/sentiment\" rel=\"nofollow\" target=\"_blank\">Trump Media &amp; Technology Group (DJT)</a><span> was down 2.28% in after-hours trading on Saturday. On Stocktwits, the retail sentiment around DJT remained in ‘neutral’ territory, with chatter at ‘high’ levels over the past day.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>Nuclear Stocks Show Mixed Movement In After-hours</span></strong></p><p class=\"\"><span>On the other hand, nuclear power-related stocks showed mixed after-hours price movements and volatility.</span><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/CEG\" rel=\"nofollow\" target=\"_blank\"> Constellation Energy (CEG)</a><span> ended the day with a 1.95% increase. After hours, it fell by 0.28%.</span></p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://stocktwits.com/symbol/VST\" rel=\"nofollow\" target=\"_blank\">Vistra Corp (VST)</a><span> closed down 1.66%, and then dropped to $173.40, down 0.28%, in extended trade. BWX Technologies (BWXT) ended the day at $205.98, down 0.61%. After hours, it was almost flat at $206.00.</span></p><p class=\"\"><span>Centrus Energy (LEU) fell 3.97% and then rose 0.15% after hours. Cameco (CCJ) rose a little to 0.19% and then rose 0.24% after the bell. NuScale Power (SMR) dropped 3.60% to $12.85 and stayed the same in after-hours trading. Oklo (OKLO), on the other hand, dropped 8.86% to $62.95 and then dropped a little more to $62.80, down 0.24%, in extended hours.</span></p><p class=\"\"><strong class=\"root-Tkn6WL2y\"><span>How Stocktwits Community Responded</span></strong></p><p class=\"\"><span>Retail commentary showed that people had mixed feelings. Some traders said that long-term instability could help nuclear energy as part of a long-term energy security strategy.</span></p><p class=\"\"><span>https://www.stocktwits.com/redsstocktwits/message/646195210</span></p><p class=\"\"><span>https://www.stocktwits.com/AZ_09/message/646194942</span></p><p class=\"\"><span>Some people said that if the conflict gets worse, the risk to the whole market could outweigh any sector-specific tailwinds.</span></p><p class=\"\"><span>https://www.stocktwits.com/I_HODL_GOLD/message/646195221</span></p><p class=\"\"><span>As tensions between countries rise, traders seem more interested in whether the situation will escalate into a long-term military campaign and how defense, energy, and risk assets will react over the next few sessions.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/stocktwits:04c3f867a094b:0/",
            "pub_date": "2026-02-28 22:39:56",
            "source": "Stocktwits",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20260228000733:0",
            "title": "How Greg Abel's First Letter to Berkshire Shareholders Is Different — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-nzzZVyQ3 content-nzzZVyQ3\"><div class=\"symbolsContainer-uFduEtAF logosContainer-diQOvrPB\" data-no-swipe=\"true\"></div><div><span><p class=\"\"><span>By Andy Serwer</span></p><p class=\"\"><span>This morning for the first time in 60 years, Berkshire Hathaway shareholders are reading the company's annual stockholder letter — and it isn't written by Warren Buffett. Instead, the letter is authored by Berkshire's new CEO, 63-year-old Greg Abel.</span></p><p class=\"\"><span>This year's letter comes in at 18 pages, significantly longer than Buffett's letters, which tended to run 10-15 pages. In it, Abel lays out what he considers to be Berkshire's company culture and he walks shareholders through its operating businesses. The comprehensive nature of the report might reflect Abel's desire to show investors he is fully knowledgeable of Berkshire's ins and outs — and that he has a firm grip on his remit.</span></p><p class=\"\"><span>\"I am actually pretty impressed,\" says Macrae Sykes, a longtime Berkshire watcher and portfolio manager at Gabelli Financial Services Opportunities ETF (GABF). \"I give him a gold medal for laying out the technical aspects of the company. The letter is very comprehensive, his knowledge is incredible which is not a surprise, but still impressive to see.\"</span></p><p class=\"\"><span>For decades, Buffett, 95, wrote what became a much-anticipated and much-pored over communication, highly-valued both for its analysis of Berkshire, markets, and sometimes even humanity, as well as its folksy wisdom. Though Buffett remains company chairman, he stepped down as CEO on Jan. 1. In a November news release, Buffett noted that he \"will no longer be writing Berkshire's annual report.\" (A February communication confirmed \"the annual report will include Greg Abel's first annual letter to shareholders.\") And so what was long \"the chairman's letter\" at Berkshire has been replaced, for the time being at least, by the CEO's letter.</span></p><p class=\"\"><span>Expectations have been high amongst Berkshire watchers over this year's letter, with two broad and obvious questions front and center: Exactly which company and business issues will Abel address in his first letter, and how is the tone, style, and even length of the letter different from Buffett's?</span></p><p class=\"\"><span>First question first. What did Abel focus on? He begins the letter not surprisingly with a tribute to Buffett, writing that Buffett \"is arguably the greatest investor of all time, with generations benefiting from his investment acumen. He has also been a remarkable CEO... (To Warren's great frustration, this letter begins with these observations — yet we all know they are true.)\"</span></p><p class=\"\"><span>In the company culture section, Abel cites a letter he sent to employees \"emphasiz[ing] that Berkshire's culture and values remain unchanged and will continue into perpetuity.\"</span></p><p class=\"\"><span>Here, Abel also points to the company's decentralized model, its integrity, financial strength, and capital discipline. In the latter section, Abel says the company may make share repurchases — but would not be paying a dividend at this time, which some investors had anticipated.</span></p><p class=\"\"><span>Sykes notes, though, that Abel says this is subject to board review. \"That leaves the door open,\" Sykes says. In the letter, Abel also speaks to the company's risk management, and name-checks that unit's top executive, Ajit Jain, 74. He makes no mention of Jain retiring, which some investors wondered about, but says Jain would be on stage with the CEO at the company's annual meeting in Omaha in May.</span></p><p class=\"\"><span>Next Abel speaks to Berkshire's performance, walking investors through the health of the company's operating business units. As for its investment portfolio, where investors might be seeking clarity as to who is directly overseeing it going forward, Abel writes that \"equity investments are fundamental to our capital allocation activities; responsibility ultimately resides with me as CEO. Ted Weschler manages about 6% of our investments, including a portion of the portfolio formerly overseen by Todd Combs. Ted's impact extends beyond these investments, as he continues to play a broader role in assessing significant opportunities, providing valuable input on our businesses, and supporting Berkshire in various other ways.\"</span></p><p class=\"\"><span>As part of the letter, Abel also welcomes new CFO Chuck Chang, succeeding Marc Hamburg, and Mike O'Sullivan as Berkshire's first general counsel. The letter closes with Abel describing the upcoming annual meeting, stressing continuity with previous ones.</span></p><p class=\"\"><span>The letter's last line — \"We move forward with great intent and purpose\" — resonated with Sykes. \"I love how he concluded,\" Sykes says. \"It's a wonderful way to end the letter, and gives you lots of confidence.\"</span></p><p class=\"\"><span>There were items that Abel does not address. The letter does not speak directly to any plans he might have concerning Berkshire's massive cash trove of $373 billion as of 2025 year-end, more than any other American company's. Nor does he say will buy stock Berkshire stock for himself, as his ownership of company stock is tiny compared to Buffett's $150 billion stake in the company.</span></p><p class=\"\"><span>Stylistically, Abel's letter differs from Buffett's in ways one might expect. It contains fewer of the homilies or folksy tales for which Buffett was famous. (Not even any metaphors about ice hockey, a sport with which the Canadian-native Abel is enamored.) Nor are there any stories about Berkshire vice chairman Charlie Munger, who passed away in late 2023.</span></p><p class=\"\"><span>Another changed facet is that veteran business journalist, Carol Loomis, is no longer editing Berkshire's letter to shareholders, as she did for Buffett beginning in 1977. Loomis, 96, and Buffett, who still play bridge together online, would go back and forth for weeks as part of the editing process before the letter came out. Those days are no more, though, and as Buffett no longer writes the letter, Loomis no longer edits it.</span></p><p class=\"\"><span>The Berkshire letter to shareholders is Greg Abel's baby now.</span></p><p class=\"\"><span>Write to Andy Serwer at andy.serwer@barrons.com</span></p><p class=\"\"><span>This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</span></p></span></div></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20260228000733:0/",
            "pub_date": "2026-02-28 22:31:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}