{
    "data": [
        {
            "id": "tradingview:e91a5ad1dec96:0",
            "title": "Visa CEO Ryan McInerney Sells 8,620 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Mcinerney Ryan</td></tr><tr><td>Relationship</td><td>Chief Executive Officer</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$2,930,800</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1578261/000112760225003035/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Visa's Chief Executive Officer, Ryan McInerney, sold 8,620 shares of Class A Common Stock on February 3, 2025, at a price of $340.0 per share, totaling $2,930,800. Following the transaction, McInerney no longer directly owns any shares of Visa but retains indirect ownership of 247,326 shares through the Ryan and Angela McInerney Trust. The sale was executed under a Rule 10b5-1 trading plan established on April 25, 2024.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1578261/000112760225003035/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">VISA INC. [ V ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:e91a5ad1dec96:0-visa-ceo-ryan-mcinerney-sells-8-620-shares/",
            "pub_date": "2025-02-05 07:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:40e988d372549:0",
            "title": "Neurocrine Biosciences Executives and Directors Sell Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><thead><tr><th>Reporter Name</th><th>Relationship</th><th>Type</th><th>Amount</th><th>SEC Filing</th></tr></thead><tbody><tr><td>Abernethy Matt</td><td>Chief Financial Officer</td><td>Sell</td><td>$196,135</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1724097/000091447525000020/xslF345X05/wk-form4_1738708264.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr><tr><td>Benevich Eric</td><td>Chief Commercial Officer</td><td>Sell</td><td>$184,598</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1643653/000091447525000021/xslF345X05/wk-form4_1738708526.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Matt Abernethy, Chief Financial Officer of Neurocrine Biosciences, sold 1,283 shares of common stock on January 31, 2025, at a weighted average price of $152.8728 per share, totaling $196,135. The sale was conducted under a Rule 10b5-1 trading plan adopted on September 1, 2022. Following the transaction, Abernethy directly owns 32,681 shares of Neurocrine Biosciences.</p><p class=\"\">Eric Benevich, Chief Commercial Officer of Neurocrine Biosciences, sold 1,207 shares of common stock on January 31, 2025, at a weighted average price of $152.94 per share, totaling $184,598. Following the transaction, Benevich directly owns 41,919 shares of the company. The sale was conducted under a Rule 10b5-1 trading plan adopted on September 12, 2022.</p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:40e988d372549:0-neurocrine-biosciences-executives-and-directors-sell-shares/",
            "pub_date": "2025-02-05 07:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:718eb78e82f10:0",
            "title": "Halozyme Therapeutics Director Sells 5,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Henderson Jeffrey William</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$281,516</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1324015/000141588925003006/xslF345X05/form4-02042025_110227.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Jeffrey William Henderson, a Director at Halozyme Therapeutics, sold 5,000 shares of common stock on February 3, 2025. The transactions were executed at weighted average prices of $55.943 and $56.405, totaling $281,516. Following these sales, Henderson directly owns 38,611 shares of the company. The sales were made under a pre-arranged trading plan adopted on September 17, 2024.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1324015/000141588925003006/xslF345X05/form4-02042025_110227.xml\" rel=\"nofollow\" target=\"_blank\">HALOZYME THERAPEUTICS, INC. [ HALO ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:718eb78e82f10:0-halozyme-therapeutics-director-sells-5-000-shares/",
            "pub_date": "2025-02-05 07:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:e0ec6caadc419:0",
            "title": "Golden Matrix Group Insider Acquires 50,000 Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Milovanovic Aleksandar</td></tr><tr><td>Relationship</td><td>10% Owner</td></tr><tr><td>Type</td><td>Purchase</td></tr><tr><td>Amount</td><td>$90,000</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2016463/000147793225000695/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Aleksandar Milovanovic, a 10% owner of Golden Matrix Group, purchased 50,000 shares of common stock at $1.8 per share, totaling $90,000. Following this transaction, Milovanovic directly owns 77,834,303 shares of the company. This transaction was reported in a Form 4 filed with the SEC.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/2016463/000147793225000695/xslF345X05/form4.xml\" rel=\"nofollow\" target=\"_blank\">Golden Matrix Group, Inc. [ GMGI ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:e0ec6caadc419:0-golden-matrix-group-insider-acquires-50-000-shares/",
            "pub_date": "2025-02-05 07:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tradingview:2c55c9b231a62:0",
            "title": "Affirm Holdings Director Keith Rabois Sells Shares",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Reporter Name</td><td>Rabois Keith</td></tr><tr><td>Relationship</td><td>Director</td></tr><tr><td>Type</td><td>Sell</td></tr><tr><td>Amount</td><td>$967,011</td></tr><tr><td>SEC Filing</td><td><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1820953/000162828025003803/xslF345X05/wk-form4_1738710210.xml\" rel=\"nofollow\" target=\"_blank\">Form 4</a></td></tr></tbody></table></div><p class=\"\">Keith Rabois, serving as a Director for Affirm Holdings, sold 16,086 shares of Class A Common Stock on February 3, 2025, under a Rule 10b5-1 trading plan adopted on September 12, 2024. The transactions occurred at weighted average prices ranging from $57.93 to $60.68 per share, totaling $967,011. Following these transactions, Rabois directly owns 77,608 shares of Affirm Holdings.</p><p class=\"\">SEC Filing: <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/1820953/000162828025003803/xslF345X05/wk-form4_1738710210.xml\" rel=\"nofollow\" target=\"_blank\">Affirm Holdings, Inc. [ AFRM ] - Form 4 - Feb. 04, 2025</a></p></span></div>",
            "link": "https://www.tradingview.com/news/tradingview:2c55c9b231a62:0-affirm-holdings-director-keith-rabois-sells-shares/",
            "pub_date": "2025-02-05 07:10:01",
            "source": "TradingView",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013647:0",
            "title": "Royal Caribbean Group Initiated at Hold by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(23:12 GMT) </strong>Royal Caribbean Group Price Target Announced at $250.00/Share by Loop Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013647:0/",
            "pub_date": "2025-02-05 07:12:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013658:0",
            "title": "Global Equities Roundup: Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The latest Market Talks covering Equities. Published exclusively on Dow Jones Newswires throughout the day.</p><p class=\"\">1814 ET - California increased its minimum wages for fast-food workers last year, prompting restaurants to increase prices and hurt their sales in the process. Chipotle Mexican Grill said sales in its restaurants and across the industry remain depressed in the state as a result. Chipotle said it's holding off additional price increases for now beyond a nationwide 2% increase taken in December. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1724 ET - Brambles may disappoint some investors by deciding against upgrading its annual guidance at its first-half result announcement, according to its bull at UBS. Analyst Andre Fromyhr writes in a note that the stronger U.S. dollar makes Brambles' free cashflow guidance more challenging than when it was announced. Even so, he expects the global pallet giant to maintain guidance. Fromyhr reckons that Brambles needs to consistently deliver US$800 million annual free cashflow without strong price growth or dropping capex before the stock rerates further. UBS lifts its target price 18% to A$22.50 and keeps a buy rating on the stock, which is at A$19.26 ahead of the open. (stuart.condie@wsj.com)</p><p class=\"\">1714 ET - Profit margins of Australian companies have probably already troughed at mid-cycle levels, UBS says. Many of Australia's biggest listed companies will report earnings this month, giving investors the chance to do a pulse check on trading conditions. Strategist Richard Schellbach highlights prior concerns about companies' ability to maintain profit margins. But these concerns were unfounded, UBS says, as management was able to pass costs on to their customers. \"The latest monthly data points still show business selling prices moving commensurately with their input costs,\" UBS says. And with the unemployment rate remaining low over the past six months, \"this dynamic of being able to pass through costs remains favorable in most industries,\" UBS adds. (david.winning@wsj.com; @dwinningWSJ)</p><p class=\"\">1711 ET - Mexican chain Chipotle Mexican Grill is known for its guacamole, and is working to source its avocados and other supplies beyond Mexico to keep providing it. The company said in a 4Q earnings call that it now sources goods from Colombia, Peru and the Dominican Republic, with half of its avocados coming from Mexico. Tariffs on supplies from Mexico are a looming threat for U.S. companies. Chipotle said it would have a financial hit if the tariffs come to pass. (heather.haddon@wsj.com; @heatherhaddon)</p><p class=\"\">1658 ET - NextDC's bull at Citi sees a lack of contract announcements and not worries over the impact of DeepSeek as the most likely explanation for the data-center operator's share-price underperformance. Analyst Siraj Ahmed acknowledges that the stock has lagged peers, but tells clients in a note that the accelerated fit-out of Melbourne centers suggests that new contract wins are probably on the way. He cuts his target price on the stock by 6.5% to A$18.70 but reiterates his buy rating. Shares are at A$14.74 ahead of the open. (stuart.condie@wsj.com)</p><p class=\"\">1656 ET - Mondelez International said it expects adjusted earnings per share to decline about 10% in 2025 due to cocoa cost inflation. The Chicago-based food and snack company produces Oreo, Toblerone and Cadbury chocolate, among other cocoa-based products. High cocoa prices have forced the snack giant to raise some prices in recent quarters. \"Our teams are well-equipped to stay agile and take the necessary actions to navigate this challenging operating environment,\" CEO Dirk Van de Put said. Shares fall 4.5% after hours. (roshan.fernandez@wsj.com)</p><p class=\"\">1629 ET - Australian shares look set to reclaim some of their recent tariff-driven losses when the local market opens. ASX futures are up by 0.6% ahead of Wednesday's session, suggesting that the S&amp;P/ASX 200 benchmark index will rally from its 1.9% decline across consecutive losses so far this week. U.S. indices provided a positive lead, bouncing despite China's announcement of retaliatory tariffs. The DJIA rose 0.3%, the S&amp;P 500 gained 0.7%, and the Nasdaq Composite put on 1.35%. ASX 200 companies scheduled to report earnings on Wednesday include Beach Energy. Real-estate investor BWP Trust said its first-half profit rose almost threefold on the same time a year earlier. (stuart.condie@wsj.com)</p><p class=\"\">1604 ET - Major stock indexes rise as the delay on tariffs on imports from Mexico and Canada for a month, eases some concerns over a multi-front trade war. The Trump administration did implement tariffs on China which struck back with levies of its own on certain American goods, an antitrust probe into Google and restrictions on Chinese exports of key minerals. Robert F. Kennedy Jr.'s nomination to lead the Health and Human Services Department advances to the full Senate, putting pressure on shares of big food companies and vaccine makers. DJIA gains 134 points, or 0.3%, to 44556, the S&amp;P 500 rises 0.7% to 6037 and the Nasdaq climbs 1.4% to 19654. (patrick.sullivan@wsj.com)</p><p class=\"\">1333 ET - Autonomous-vehicle company Cruise confirms it will lay off about half of its workforce. \"We are grateful for their passion and contributions to help us reach this stage, and our focus is on supporting them into their next chapter with severance packages and career support,\" a company spokesperson says in an emailed statement. \"While not an easy decision, we are focused on combining efforts with General Motors to accelerate autonomy at scale on personal autonomous vehicles.\" The layoffs come as GM announces the completion of its acquisition of Cruise, stating the company moving forward will work collaboratively on autonomous-vehicle technology and advanced driver assistance systems for personal vehicles. GM shares rise 1.4%. (connor.hart@wsj.com)</p><p class=\"\">1252 ET - Tariffs would certainly dampen Ball's current outlook, Chief Executive Dan Fisher says on a call with analysts. The aluminum-can maker has spent the better part of the last few weeks renegotiating deals with its Chinese aluminum suppliers in an attempt to mitigate a $40 million to $50 million issue, he says: \"I think we've got that resolved down to a couple million dollars.\" The larger concern now revolves around consumer sentiment. Consumers are already pretty stressed, Fisher says, adding that higher costs stemming from a 25% tariff would stifle demand and be a headwind to growth. Shares fall 8% after Ball reports a decline in 4Q sales and logs a loss. (connor.hart@wsj.com)</p><p class=\"\">1247 ET - PepsiCo turned in mixed results for 4Q as strong international growth was offset by softer-than-expected results in North America, Edward Jones analyst Brittany Quatrochi says in a research note. Trends in North America are still sluggish as consumers continue to seek out value, which has been cutting into salty snack sales, the analyst says. The company is also still recovering from a product recall at Quaker, she says. Given its challenges with the U.S. consumer, PepsiCo is guiding for 2025 earnings growth to be weaker than its long-term outlook, the analyst says. Shares fall 4.4% to $143.71. (dean.seal@wsj.com)</p><p class=\"\">1232 ET - PayPal handily topped 4Q earnings estimates and approved a major new stock buyback, but investors seem caught up on shifts at its behind-the-scenes payment processing unit Braintree, Susquehanna analyst James Friedman says in a research note. Total payment volume growth at Braintree decelerated from 30% in FY 2023 to 2% in 4Q and could turn negative, Friedman says, as clients weigh whether to re-sign their contracts with Braintree following recent price changes. \"Investors are anxious about perceived market share loss and are worried Braintree will not pivot,\" Friedman says. Shares fall 11% to $79.65. (dean.seal@wsj.com)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013658:0/",
            "pub_date": "2025-02-05 07:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013656:0",
            "title": "California Wage Increases Hurt Chipotle — Market Talk",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">California increased its minimum wages for fast-food workers last year, prompting restaurants to increase prices and hurt their sales in the process. Chipotle Mexican Grill said sales in its restaurants and across the industry remain depressed in the state as a result. Chipotle said it's holding off additional price increases for now beyond a nationwide 2% increase taken in December. (heather.haddon@wsj.com; @heatherhaddon)</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013656:0/",
            "pub_date": "2025-02-05 07:14:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX14yR7x:0",
            "title": "QMC Metering Solutions Reaffirms Independence and Commitment to Customer Partnerships",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">LAS VEGAS, Feb.  04, 2025  (GLOBE NEWSWIRE) — QMC Metering Solutions, a privately owned leader in metering systems, wishes to clarify recent questions in the marketplace regarding our ownership and affiliations. We want to assure our valued customers and partners that QMC remains an independent company, fully focused on delivering the high-quality metering products and services you have come to trust.</p><p class=\"\">As a privately owned company, QMC operates independently, enabling us to focus entirely on our customers' needs and drive innovation without external influence. Although we highly value strong industry partnerships, QMC is not owned by any billing companies, does not provide billing services, and has no plans to do so. The organization is managed by a dedicated group of individual Board members and shareholders.</p><p class=\"\">“Our independence is an integral part of who we are as a company,” said Stew Hutton, President of QMC Metering Solutions USA. “It enables us to remain agile, customer-focused, and innovative in how we serve our clients. We’re grateful for the trust our partners place in us and are committed to continuing to earn that trust every day.”</p><p class=\"\">For over 30 years, QMC has been dedicated to supporting billing companies, utilities, property managers, and contractors across North America with reliable and innovative metering solutions. From water and energy metering to advanced data collection systems, QMC is proud to deliver best-in-class technology designed to empower businesses and improve utility management.</p><p class=\"\">As we move forward, QMC remains committed to the partnerships we’ve built and to helping our customers succeed. We are proud of our independence, as it allows us to focus solely on providing the very best solutions to our clients.</p><p class=\"\">For more information about QMC Metering Solutions and our suite of innovative products and services, please visit qmeters.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About QMC Metering Solutions</strong></p><p class=\"\">QMC Metering Solutions is a trusted provider of high-accuracy metering systems designed to support utility management and efficiency. Privately owned and operated, QMC offers a range of products and services to customers across North America. With a focus on quality, innovation, and customer satisfaction, QMC empowers businesses to optimize utility usage and operations.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Truety</strong></p><p class=\"\">QMC provides quality metering hardware for multi-family developers and manufactured housing. With over 30 years' of experience in the metering industry, QMC is proud to present our newest solution, Truety. Truety combines accurate metering data with utility-grade submeters, eliminating the guesswork in tenant billing. No missing data, no estimates, no disputes. Deploy and bill faster and more efficiently with Truety.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Information:</strong></p><p class=\"\">Stew Hutton</p><p class=\"\">President, QMC Metering Solutions USA, QMC Metering Solutions</p><p class=\"\">stew@qmeters.com</p><p class=\"\">(415) 770-2246</p><p class=\"\">qmeters.com</p><p class=\"\">A video accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/cad3dab3-3314-4f28-b3c8-9836fb97a154</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX14yR7x:0-qmc-metering-solutions-reaffirms-independence-and-commitment-to-customer-partnerships/",
            "pub_date": "2025-02-05 07:14:41",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV38X:0",
            "title": "Champion Homes Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Champion Homes Inc  reported quarterly adjusted earnings of $1.04​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 82 cents.  The mean expectation of six analysts for the quarter was for earnings of 81 cents per share. Wall Street expected results to range from 77 cents to 84 cents per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 15.3% to $644.93 million from a year ago; analysts expected $587.54 million. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Champion Homes Inc's reported EPS for the quarter was $1.06​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $61.54 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Champion Homes Inc shares had risen by 4.1% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had risen by about 0.6% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, there have been no negative revisions of earnings estimates</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 4 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the homebuilding peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Champion Homes Inc is $94.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:14 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">0.81</p></td><td><p class=\"\">1.04</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">0.81</p></td><td><p class=\"\">0.93</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">0.74</p></td><td><p class=\"\">0.89</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.68</p></td><td><p class=\"\">0.62</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV38X:0-champion-homes-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:14:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013663:0",
            "title": "Late-Trading Activity (4 p.m. - 6 p.m. Eastern Time)",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><pre class=\"preformatted-zagxxLT_\" data-no-swipe=\"true\">                     TUESDAY      MONDAY      FRIDAY    THURSDAY   WEDNESDAY <br/>Issues Traded          6,646       6,650       6,812       6,493       6,450 <br/>Advances               2,053       3,014       2,214       2,183       2,364 <br/>Declines               2,560       1,743       2,291       2,495       2,032 <br/>Unchanged              2,033       1,893       2,307       1,815       2,054 <br/>Advancing Volume 242,344,183 422,256,673 355,549,777 167,696,420 347,811,192 <br/>Declining Volume 282,566,715 128,877,260 285,846,782 183,837,682 174,443,039 <br/>Total Volume     662,602,883 626,204,323 847,511,466 412,753,915 608,499,536 <br/> <br/>LATE MOST ACTIVE ISSUES <br/>ISSUE                   EXCH   VOL(000s)        LAST     NET CHG       % CHG <br/>NVIDIA                  (Nq)    21,643.7      118.88       +0.23        +0.2 <br/>Snap                     (N)    21,512.1       12.28       +0.68        +5.9 <br/>AdvMicroDevices         (Nq)    19,680.6      109.35      â€”10.15        â€”8.5 <br/>IntlPaper                (N)    18,670.4       53.89        unch         ... <br/>GrShr2xLongAMDDly        (Nq)    10,710.3        6.07       â€”1.24       â€”17.0 <br/>Alphabet A              (Nq)    10,584.6      189.88      â€”16.50        â€”8.0 <br/>Intel                   (Nq)    10,253.7       19.24       â€”0.05        â€”0.3 <br/>Comcast A               (Nq)     7,228.5       33.70       +0.15        +0.4 <br/>PG&amp;E                     (N)     6,900.8       15.38       +0.20        +1.3 <br/>Alphabet C              (Nq)     6,692.1      191.73      â€”15.98        â€”7.7 <br/>LumenTech                (N)     5,869.3        5.52       +0.48        +9.5 <br/>DirexSemiBl3            (NA)     5,816.3       26.00       â€”0.25        â€”1.0 <br/>Apple                   (Nq)     5,414.7      231.88       â€”0.92        â€”0.4 <br/>Carnival                 (N)     4,809.1       27.07       â€”0.02        â€”0.1 <br/>PalantirTech            (Nq)     4,521.3      102.78       â€”1.05        â€”1.0 <br/>Amazon.com              (Nq)     3,435.1      238.50       â€”3.56        â€”1.5 <br/>BankofAmerica            (N)     3,341.5       46.61       â€”0.10        â€”0.2 <br/>SPDR S&amp;P 500            (NA)     3,274.9      599.89       â€”1.89        â€”0.3 <br/>PattersonUTIEn          (Nq)     3,245.2        8.21        unch         ... <br/>Verizon                  (N)     3,151.2       39.84       +0.03        +0.1 <br/>Chipotle                 (N)     3,139.0       56.10       â€”2.92        â€”4.9 <br/>SuncorEnergy             (N)     3,063.3       38.01       â€”0.14        â€”0.4 <br/>Broadcom                (Nq)     2,988.1      233.20      +10.77        +4.8 <br/>JD.com                  (Nq)     2,980.5       41.20       +0.04        +0.1 <br/>NuHoldings               (N)     2,757.6       13.29       â€”0.01        â€”0.1 <br/>BP                       (N)     2,756.9       31.62       â€”0.02        â€”0.1 <br/>iShBitcoin              (Nq)     2,283.8       55.28       â€”0.85        â€”1.5 <br/>Amcor                    (N)     2,274.5       10.02       â€”0.03        â€”0.3 <br/>iShMSCIBrazil           (NA)     2,266.7       25.70       +0.25        +1.0 <br/>ItauUnibanco             (N)     2,214.8        5.84       â€”0.01        â€”0.2 <br/> <br/>LATE PRICE PERCENTAGE GAINERS <br/>ISSUE                   EXCH   VOL(000s)        LAST     NET CHG       % CHG <br/>DefDlyTarget2XLg        (Nq)       201.9       30.68       +2.82       +10.1 <br/>DirexAVGOBull2X         (Nq)        92.5       33.13       +3.04       +10.1 <br/>LumenTech                (N)     5,869.3        5.52       +0.48        +9.5 <br/>DirexGooglBr1X          (Nq)       195.0       12.06       +0.88        +7.9 <br/>EnphaseEnergy           (Nq)     1,409.8       71.13       +4.88        +7.4 <br/>Mattel                  (Nq)       171.7       19.25       +1.18        +6.5 <br/>LibertyBroadbandC        (Nq)       202.8       80.71       +4.83        +6.4 <br/>GrShr1xShAMDDly         (Nq)       162.8       17.20       +0.97        +6.0 <br/>Snap                     (N)    21,512.1       12.28       +0.68        +5.9 <br/>SynchronyFinl            (N)       166.9       69.50       +3.58        +5.4 <br/>O-I Glass                (N)       146.0       12.35       +0.62        +5.3 <br/>iShMSCIACWI             (Nq)        76.4      127.36       +6.06        +5.0 <br/>CCC Intelligent         (Nq)       109.5       11.50       +0.54        +4.9 <br/>Broadcom                (Nq)     2,988.1      233.20      +10.77        +4.8 <br/>SpringWorks             (Nq)       633.7       40.25       +1.85        +4.8 <br/> <br/>LATE PRICE PERCENTAGE LOSERS <br/>ISSUE                   EXCH   VOL(000s)        LAST     NET CHG       % CHG <br/>FMC                      (N)       614.9       44.50       â€”9.54       â€”17.7 <br/>GrShr2xLongAMDDly        (Nq)    10,710.3        6.07       â€”1.24       â€”17.0 <br/>Lev2XLgAMDDly           (Nq)        53.4       11.62       â€”2.31       â€”16.6 <br/>DirexGooglBl2x          (Nq)     1,341.2       44.89       â€”8.41       â€”15.8 <br/>OscarHealth              (N)     1,296.6       13.49       â€”1.79       â€”11.7 <br/>Intapp                  (Nq)        75.6       65.10       â€”8.41       â€”11.4 <br/>A10Networks              (N)        97.5       18.40       â€”1.88        â€”9.3 <br/>AdvMicroDevices         (Nq)    19,680.6      109.35      â€”10.15        â€”8.5 <br/>Alphabet A              (Nq)    10,584.6      189.88      â€”16.50        â€”8.0 <br/>Alphabet C              (Nq)     6,692.1      191.73      â€”15.98        â€”7.7 <br/>ColumbiaSportswr        (Nq)        51.9       79.40       â€”6.46        â€”7.5 <br/>MatchGroup              (Nq)     1,472.1       34.00       â€”2.47        â€”6.8 <br/>UnumGroup                (N)       138.4       71.00       â€”4.95        â€”6.5 <br/>Corteva                  (N)       172.1       62.00       â€”3.70        â€”5.6 <br/>BrandywineRealty         (N)       108.6        5.08       â€”0.28        â€”5.2 <br/> </pre></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013663:0/",
            "pub_date": "2025-02-05 07:15:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463555:0",
            "title": "Japan Hotel REIT Says No Talks on Hyatt Regency Tokyo Acquisition",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Japan Hotel REIT Investment  said it is not in discussions to acquire the Hyatt Regency Tokyo, refuting recent media reports suggesting a potential deal, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The company and its asset manager, Japan Hotel REIT Advisors, have not engaged in any talks or considerations regarding the property, it said in a statement.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463555:0/",
            "pub_date": "2025-02-05 07:15:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV180:0",
            "title": "Hut 8 Corp In Jan, Bitcoin Produced Was 65 BTC",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Hut 8 Corp :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">HUT 8 CORP: IN JAN, BITCOIN PRODUCED  WAS 65 BTC, BITCOIN HELD IN RESERVE OF 10,208 BTC</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV180:0-hut-8-corp-in-jan-bitcoin-produced-was-65-btc/",
            "pub_date": "2025-02-05 07:06:19",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OV2E4:0",
            "title": "Atmos Energy reports higher quarterly profit",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Atmos Energy  posted a rise in first-quarter profit on Tuesday, as the natural gas utility benefited from higher rates.</p><p class=\"\">During the reported quarter, the company implemented, or received approval to implement ratemaking regulatory actions which resulted in an increase in annual operating income of $150.5 million.</p><p class=\"\">Higher rates boosted operating income in its distribution segment by 12.7% to $316.1 million, from the previous year.</p><p class=\"\">Growth in residential customers and increased industrial load also helped the segment's quarterly performance.</p><p class=\"\">Atmos delivers natural gas to about 3 million distribution customers across eight U.S. states.</p><p class=\"\">The company, which also operates about 5,700 miles of transmission pipelines in Texas, said quarterly operating earnings in its pipeline and storage unit rose 20.9% to $143.4 million, from the previous year.</p><p class=\"\">It reaffirmed its full-year profit forecast range of $7.05 to $7.25 per share.</p><p class=\"\">The Dallas, Texas-based company's net income rose to $351.9 million, or $2.23 per share, in the quarter ended Dec. 31, from $311.3 million, or $2.08 cents per share, a year earlier.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OV2E4:0-atmos-energy-reports-higher-quarterly-profit/",
            "pub_date": "2025-02-05 07:06:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204008949:0",
            "title": "Snap Reports Surprise Profit. The Stock is Rising. — Barrons.com",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Adam Levine</p><p class=\"\">Snapchat-parent Snap reported strong fourth-quarter earnings results Tuesday afternoon. Its shares rose in after-hours trading.</p><p class=\"\">After years of GAAP losses, Snap surprised with earnings-per-share of 1 cent versus a 15 cent loss the year before. Wall Street analysts expected a loss of four cents.</p><p class=\"\">Driving the profit was cost discipline. \"We came within or below our full-year cost structure guidance across all key metrics,\" Snap said in a letter to shareholders.</p><p class=\"\">Users for the quarter were at 453 million, in-line with expectations, and up 9% from 2023. Average revenue per user was also in-line at $3.44, up 5%.</p><p class=\"\">Revenue for the quarter reached $1.56 billion, above expectations of $1.55 billion, and up 14% on the year. As has become common with mature social networks, growth was led be markets outside North America, with European revenue up 20% on the year, and the rest of the world up 35%.</p><p class=\"\">Snap's revenue outlook range for the first quarter was $1.33 billion to $1.360 billion, up 12% from 2024 at the midpoint. Analysts have been expecting $1.33 billion analysts.</p><p class=\"\">User guidance was for 459 million, up 9% on the year — in excess of expectations of 451 million.</p><p class=\"\">Snap stock was up around 10% in after-hours trading following the release.</p><p class=\"\">This is breaking news. Read a preview of Snap's earnings below and check back for more analysis soon.</p><p class=\"\">Snapchat-parent Snap has a lot riding on the company's earnings seemingly every quarter. That could continue Tuesday, when the company is scheduled to report fourth-quarter earnings after the close.</p><p class=\"\">Since 2020, the company's stock has moved by an absolute average of 22% the day after earnings reports. After the fourth quarter 2021 release, the stock was up 59%. Two quarters later, it was down 39%. Last quarter shares rose by 16% after earnings.</p><p class=\"\">\"Snap shares don't trade on traditional valuation metrics like near-term GAAP EPS, Free Cash Flow or even Ebitda,\" Wells Fargo analyst Ken Gawrelski says. \"As a result, shares are exceptionally volatile as it feels like there is a referendum every earnings print on future growth.\"</p><p class=\"\">Oppenheimer analyst Jason Helfstein notes that there is \"reasonably high short interest\" in the stock, and investors entering or exiting those positions after the earnings release can have a large effect.</p><p class=\"\">He also sees TikTok's saga — will they be banned in the U.S. or not? — as another contributing factor to the volatility. Finally, he noted that Snap's direct response advertising has lagged behind digital ad leaders Alphabet and Meta Platforms, a point of frustration for investors.</p><p class=\"\">Gawrelski has a Buy rating and a $15 price target. Helfstein has a Hold rating and no price target. A quarter of analysts have the equivalent of a Buy, and 68% have a Hold rating. Just three out of 44 analysts have a Sell. The average price target is $13.06.</p><p class=\"\">Sales growth accelerated through the first three quarters of 2024. For the fourth quarter, Wall Street expects $1.55 billion in sales, up 14% from last year, driven by a 9% rise in users and a 5% rise in average revenue per user. Three months ago, Snap guided to $1.54 billion in revenue at the midpoint.</p><p class=\"\">In the 39 quarters that have been reported publicly by Snap, it has seen positive earnings per share once, back in 2021. But it has been able to keep last-twelve-months free cash flow positive, and occasionally uses some of it for share repurchases, including three of the last four quarters.</p><p class=\"\">For the fourth quarter, Wall Street expects the company to report a loss of four cents loss-per-share, up from a loss of 15 cents a year ago, with free cash flow of $161 million.</p><p class=\"\">Write to Adam Levine at adam.levine@barrons.com</p><p class=\"\">This content was created by Barron's, which is operated by Dow Jones &amp; Co. Barron's is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204008949:0/",
            "pub_date": "2025-02-05 07:07:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463569:0",
            "title": "Piedmont Lithium's Spodumene Concentrate Shipped Rises in Q4, 2024",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Piedmont Lithium  shipped 55,700 dry metric tons (dmt) of spodumene concentrate in the fourth quarter of 2024 from its North American Lithium operations (NAL), up from 31,500 dmt in the third quarter, according to a Wednesday filing with the Australian bourse. </p><p class=\"\">The spodumene concentrate produced at NAL fell to 50,922 dmt in the quarter, down from 52,141 dmt in the previous quarter. </p><p class=\"\">Despite the fall in production for the quarter, the company says it is on track to achieve Sayona Mining's  production guidance for the current year of 190,000 dmt to 210,000 dmt for its merged entity with the company.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463569:0/",
            "pub_date": "2025-02-05 07:07:18",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_TUA3PVNXZ:0",
            "title": "3M Board Declares Quarterly Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">3M Co :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M BOARD DECLARES QUARTERLY DIVIDEND</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M CO - DECLARES QUARTERLY DIVIDEND OF $0.73 PER SHARE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">3M CO - AUTHORIZES REPURCHASE OF UP TO $7.5 BILLION OF COMMON STOCK</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_TUA3PVNXZ:0-3m-board-declares-quarterly-dividend/",
            "pub_date": "2025-02-05 07:07:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_GNX72GlpV:0",
            "title": "Bitdeer Announces Strategic Acquisition of 101 MW Site and Gas-fired Power Project in Alberta to Deliver the Industry’s First Fully-Vertically Integrated Bitcoin Mining Site",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SINGAPORE, Feb.  04, 2025  (GLOBE NEWSWIRE) — Bitdeer Technologies Group  (“<strong class=\"root-Tkn6WL2y\">Bitdeer</strong>” or the “<strong class=\"root-Tkn6WL2y\">Company</strong>”), a world-leading technology company for blockchain and high-performance computing, today announced the successful close of the acquisition of a fully licensed and permitted 101 MW site and gas-fired power project situated on 19 acres of land near Fox Creek, Alberta in an all-cash transaction for $21.7 million. The site has potential to scale to 1 GW of power, reflecting Alberta’s abundant energy resources, supportive regulatory posture and pro-business environment.</p><p class=\"\">The 101 MW gas-fired power project includes all permits and licenses required to construct an on-site natural gas power plant, as well as approval for a 99 MW grid interconnection with Alberta Electric System Operator (“AESO”). Bitdeer will develop and construct the power plant in partnership with a leading Engineering, Procurement and Construction (“EPC”) company and is expected to be energized by Q4 2026.</p><p class=\"\">Concurrently, the Company plans to build 99 MW of datacenter capacity for Bitcoin mining. This newly acquired site and power generation project provides the Company a unique opportunity to become the world’s first fully-vertically integrated Bitcoin miner at scale and potentially achieve some of the lowest Bitcoin mining production costs in the industry.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Strategic Benefits</strong></p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Full vertical integration: </strong>The Company will have control of the land, power generation, electrical and datacenter infrastructure as well as using its own internally developed and manufactured Bitcoin mining machines. The Company can deploy approximately [9] EH/s of its SEALMINER A3 mining machines upon completion, which are anticipated to have industry leading machine-level efficiency of 11-12 J/TH.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Low Power Costs:</strong> Projected energy production costs of approximately $20 to $25 per MWh1, based on current gas prices.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Sustainability &amp; Potential Carbon Credit Upside:</strong> As part of the project acquisition, Bitdeer will deploy a carbon utilization system that captures CO2 making the project a net zero carbon producer. This initiative aims to offset Canada’s carbon tax obligations and may generate future revenue through carbon credits.</li><li class=\"listItem-bmN0_SHH\"><strong class=\"root-Tkn6WL2y\">Energy Cost Optimization &amp; Revenue Flexibility:</strong> The Company expects to curtail and sell power back to the Alberta grid to stabilize prices during periods of high demand. The Company estimates this could potentially optimize costs even further.</li></ul><p class=\"\">“We are really excited about planting roots in Alberta, our first site in Canada. This acquisition is the culmination of extensive collaboration with multiple government agencies and the Canadian Blockchain Consortium. It marks a significant step in our strategy to become the first fully-vertically integrated Bitcoin miner, giving us unmatched control over costs, energy efficiency, and scalability,” said Haris Basit, Chief Strategy Officer at Bitdeer. “By combining our own power generation, SEALMINER mining machines and opportunistic grid participation, we believe this site will set a new benchmark for industry unit economics.”</p><p class=\"\">Regarding the project, Danielle Smith, Premier of Alberta said, “We are so pleased to welcome the world’s first net-zero, fully integrated off-grid Bitcoin mining facility — right here in Alberta. Today’s investment is another sign that Alberta continues to be a leader in technology and innovation not only across the country, but across the world. If you want to do business and have a plan to bring your own power, then Alberta is the place for you.”</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Estimated Costs and Development Timeline </strong></p><p class=\"\">The Company plans to commence site preparation and initial infrastructure development in Q2 2025 and energization in Q4 2026.</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Asset</td><td>Actual and Estimated Costs</td></tr><tr><td>101 MW Fox Creek Site and 19-acre land near Fox Creek, Alberta</td><td>$21.7 million cash</td></tr><tr><td>Gas-fired power plant</td><td>~$90 million</td></tr><tr><td>Electrical &amp; datacenter infrastructure</td><td>$300K per MW or ~$30 million</td></tr><tr><td colspan=\"2\"> </td></tr></tbody></table></div><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Bitdeer Technologies Group</strong>Bitdeer is a world-leading technology company for blockchain and high-performance computing industry. Bitdeer is committed to providing comprehensive computing solutions for its customers. The Company handles complex processes involved in computing such as equipment procurement, transport logistics, datacenter design and construction, equipment management, and daily operations. The Company also offers advanced cloud capabilities to customers with high demand for artificial intelligence. Headquartered in Singapore, Bitdeer has deployed datacenters in the United States, Norway, and Bhutan. To learn more, visit https://ir.bitdeer.com/ or follow Bitdeer on X @ BitdeerOfficial and LinkedIn @ Bitdeer Group.</p><p class=\"\">Investors and others should note that Bitdeer may announce material information using its website and/or on its accounts on social media platforms, including X, formerly known as Twitter, Facebook, and LinkedIn. Therefore, Bitdeer encourages investors and others to review the information it posts on the social media and other communication channels listed on its website.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Forward-Looking Statements</strong></p><p class=\"\">Statements in this press release about future expectations, plans, and prospects, as well as any other statements regarding matters that are not historical facts, may constitute “forward-looking statements” within the meaning of The Private Securities Litigation Reform Act of 1995. The words “anticipate,” “look forward to,” “believe,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “plan,” “potential,” “predict,” “project,” “should,” “target,” “will,” “would” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. Actual results may differ materially from those indicated by such forward-looking statements as a result of various important factors, including factors discussed in the section entitled “Risk Factors” in Bitdeer’s annual report on Form 20-F, as well as discussions of potential risks, uncertainties, and other important factors in Bitdeer’s subsequent filings with the U.S. Securities and Exchange Commission. Any forward-looking statements contained in this press release speak only as of the date hereof. Bitdeer specifically disclaims any obligation to update any forward-looking statement, whether due to new information, future events, or otherwise. Readers should not rely upon the information on this page as current or accurate after its publication date.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For investor and media inquiries, please contact:</strong></p><p class=\"\">Investor Relations</p><p class=\"\">Orange Group</p><p class=\"\">Yujia Zhai</p><p class=\"\">bitdeerIR@orangegroupadvisors.com</p><p class=\"\">Public Relations</p><p class=\"\">BlocksBridge Consulting</p><p class=\"\">Nishant Sharma</p><p class=\"\">bitdeer@blocksbridge.com</p><p class=\"\">1 Assumes natural gas costs of ~$2.06 / GJ, plus regular maintenance and O&amp;M</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_GNX72GlpV:0-bitdeer-announces-strategic-acquisition-of-101-mw-site-and-gas-fired-power-project-in-alberta-to-deliver-the-industry-s-first-fully-vertically-integrated-bitcoin-mining-site/",
            "pub_date": "2025-02-05 07:07:56",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACSnQkfZa:0",
            "title": "Olympic Values Education: Celebrating the Milestone of 12 Million Children Reached in India",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 4, 2025 / International Olympic Committee</p><p class=\"\">International Olympic Committee news</p><p class=\"\">The International Olympic Committee (IOC)'s Olympic Values Education Programme (OVEP) reached a major milestone last week: now in its third year of implementation in India, OVEP has engaged more than 12 million children across the country.</p><p class=\"\">To mark the occasion, the Olympic Museum, which manages the programme, welcomed children and teachers from Assam, India, to Lausanne, Switzerland, one year after OVEP was implemented in their state. The delegation, organised through the Abhinav Bindra Foundation Trust (ABFT), participated in the museum's 43rd annual Olympic Week, which features sports and cultural activities for kids.</p><p class=\"\">View additional multimedia and more ESG storytelling from International Olympic Committee on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: International Olympic Committee</p><p class=\"\">Website: https://www.3blmedia.com/profiles/international-olympic-committee</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> International Olympic Committee</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACSnQkfZa:0/",
            "pub_date": "2025-02-05 07:08:06",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OV1AP:0",
            "title": "Databricks Acquires Bladebridge Technology And Talent",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Databricks:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">DATABRICKS: ACQUIRES BLADEBRIDGE TECHNOLOGY AND TALENT; IN PAST YEAR DATABRICKS SQL REVENUE GREW OVER 150%, SURPASSING $600 MILLION RUN RATE</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">DATABRICKS: EXPECTS TO CROSS $3 BILLION REVENUE RUN RATE AND BE FREE CASH FLOW POSITIVE IN Q4 ENDING JAN 31, 2025</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OV1AP:0-databricks-acquires-bladebridge-technology-and-talent/",
            "pub_date": "2025-02-05 07:08:14",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013504:0",
            "title": "South Korea Inflation Accelerates to 2.2% in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Kwanwoo Jun</p><p class=\"\">South Korea's headline inflation accelerated at a faster-than-expected pace in the first month of the year to stay above the central bank's 2% target.</p><p class=\"\">The benchmark consumer-price index rose 2.2% in January from a year earlier, following a 1.9% gain in December, on higher prices for groceries and energy products, the country's statistics office said Wednesday.</p><p class=\"\">The latest print, the highest since July, beat the median forecast from 11 economists in a Wall Street Journal poll tipping a 2.0% gain for January.</p><p class=\"\">The pickup in price growth was largely led by Lunar New Year holiday-driven demand for agricultural and fishery products as well as higher gasoline and diesel prices, according to analysts.</p><p class=\"\">Compared with the prior month, the index gained 0.7% in January, also beating the median forecast in the WSJ poll for a 0.5% increase. In December, consumer prices rose 0.4% from the previous month.</p><p class=\"\">Core CPI, which strips out volatile food and energy prices, rose 1.9% from a year earlier in January and gained 0.5% from the previous month.</p><p class=\"\">Write to Kwanwoo Jun at kwanwoo.jun@wsj.com</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013504:0/",
            "pub_date": "2025-02-05 07:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013605:0",
            "title": "Norwegian Cruise Line Initiated at Hold by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(23:09 GMT) </strong>Norwegian Cruise Line Price Target Announced at $26.00/Share by Loop Capital</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013605:0/",
            "pub_date": "2025-02-05 07:09:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013613:0",
            "title": "PBCO Announces Cash Dividend",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PBCO Announces Cash Dividend</p><p class=\"\">MEDFORD, Ore.--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">PBCO Financial Corporation (OTCPK: \"PBCO\"), the holding company (Company) of People's Bank of Commerce (Bank), today announced that it has declared a cash dividend representing 15% of 2024 year-end net income, or $0.229 per share. The $0.229 dividend will be paid on March 5, 2025, to shareholders of record February 19, 2025 and will be rounded up to the nearest full cent upon payment. \"I am pleased to announce that this represents the first cash dividend paid to shareholders since 2009. The Company remains well capitalized by regulatory capital standards,\" reported Julia Beattie, President and CEO.</p><p class=\"\">As of December 31, 2024, the Company reported total assets of $798.6 million, total deposits of $673.8 million, and shareholder's equity of $87.6 million. The Company reported net income of $8.1 million, or earnings per share of $1.52, for the year-end 2024.</p><p class=\"\">About PBCO Financial Corporation</p><p class=\"\">PBCO Financial Corporation's stock trades on the over-the-counter market under the symbol PBCO. Additional information about the Company is available in the investor section of the Company's website at: www.peoplesbank.bank.</p><p class=\"\">Founded in 1998, People's Bank of Commerce is a full-service, commercial bank headquartered in Medford, Oregon with branches in Albany, Ashland, Central Point, Eugene, Grants Pass, Jacksonville, Klamath Falls, Lebanon, Medford, and Salem.</p><p class=\"\">\"Safe Harbor\" Statement under the Private Securities Litigation Reform Act of 1995:</p><p class=\"\">This release includes forward-looking statements intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally can be identified by phrases such as People's Bank or its management \"believes,\" \"expects,\" \"anticipates,\" \"foresees,\" \"forecasts, \" \"estimates\" or other words or phrases of similar import. Similarly, statements herein that describe People's Bank's business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. All such forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those in forward-looking statements.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204195175/en/</p><p class=\"\">CONTACT:    Julia Beattie, President &amp; CEO</p><p class=\"\">(541) 608-8920</p><p class=\"\">julia.beattie@peoplesbank.bank</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013613:0/",
            "pub_date": "2025-02-05 07:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013635:0",
            "title": "Carnival Initiated at Hold by Loop Capital",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013635:0/",
            "pub_date": "2025-02-05 07:10:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OV37X:0",
            "title": "American Financial Group Inc reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc  reported quarterly adjusted earnings of $3.12​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of $2.84.  The mean expectation of seven analysts for the quarter was for earnings of $3.10 per share. Wall Street expected results to range from $2.71  to $3.61 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 6.8% to $1.85 billion from a year ago; analysts expected $1.72 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc's reported EPS for the quarter was $3.03​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $255 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">American Financial Group Inc shares had fallen by 0.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 1.3% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"hold\" and the breakdown of recommendations is 2 \"strong buy\" or \"buy,\" 5 \"hold\" and no \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the property &amp; casualty insurance peer group is also \"hold\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for American Financial Group Inc is $150.00 </p><p class=\"\">This summary was machine generated from LSEG data February 4 at 11:00 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">3.10</p></td><td><p class=\"\">3.12</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">2.47</p></td><td><p class=\"\">2.31</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">2.45</p></td><td><p class=\"\">2.56</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">2.70</p></td><td><p class=\"\">2.76</p></td><td><p class=\"\">Beat</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OV37X:0-american-financial-group-inc-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 07:00:59",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013523:0",
            "title": "Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Organigram to Report First Quarter Fiscal 2025 Results on February 11, 2025</p><p class=\"\">TORONTO--(BUSINESS WIRE)--February 04, 2025--</p><p class=\"\">Organigram Holdings Inc.  , the parent company of Organigram Inc. (together, the \"Company\" or \"Organigram\"), a leading licensed producer of cannabis, announced today it will report earnings results for its first quarter fiscal 2025 ended December 31, 2024, on Tuesday, February 11, 2025, prior to market open.</p><p class=\"\">The Company will host a conference call to discuss its results with details as follows:</p><p class=\"\">Date: Tuesday, February 11, 2025</p><p class=\"\">Time: 8:00 am Eastern Time</p><p class=\"\">To register for the conference call, please use this link:</p><p class=\"\">https://registrations.events/direct/Q4I967665</p><p class=\"\">To ensure you are connected for the full call, we suggest registering a day in advance or at minimum 10 minutes before the start of the call. After registering, a confirmation will be sent through email, including dial in details and unique conference call codes for entry. Registration is open through the live call.</p><p class=\"\">To access the webcast:</p><p class=\"\">https://events.q4inc.com/attendee/638837238</p><p class=\"\">Participants will receive their details via email.</p><p class=\"\">A replay of the webcast will be available within 24 hours after the conclusion of the call at https://www.organigram.ca/investors and will be archived for a period of 90 days following the call.</p><p class=\"\">About Organigram Holdings Inc.</p><p class=\"\">Organigram Holdings Inc. is a NASDAQ Global Select Market and TSX listed company whose wholly-owned subsidiaries include Organigram Inc., a licensed cultivator of cannabis and manufacturer of cannabis-derived goods in Canada, and recently acquired Motif Labs Ltd., a licensed cannabis processor.</p><p class=\"\">Organigram is focused on producing high-quality, indoor-grown cannabis for patients and adult recreational consumers in Canada, as well as developing international business partnerships to extend the Company's global footprint. Organigram has also developed a portfolio of legal adult-use recreational cannabis brands, including Edison, Big Bag O' Buds, SHRED, Monjour and Trailblazer. Organigram operates facilities in Moncton, New Brunswick and Lac-Supérieur, Québec, with a dedicated manufacturing facility in Winnipeg, Manitoba. As a result of the acquisition of Motif Labs Ltd. on December 6, 2024, the Company now operates two additional cannabis processing facilities in Southwestern Ontario; one in Aylmer and the other in London. The facility in Aylmer houses best-in-class CO2 and Hydrocarbon extraction capabilities, and is optimized for formulation refinement, post-processing of minor cannabinoids, and pre-roll production. The facility in London will be optimized for labelling, packaging, and national fulfillment. The Company is regulated by the Cannabis Act and the Cannabis Regulations (Canada).</p><p class=\"\">This news release contains forward-looking information. Often, but not always, forward-looking information can be identified by the use of words such as \"plans\", \"expects\", \"estimates\", \"intends\", \"anticipates\", \"believes\" or variations of such words and phrases or state that certain actions, events, or results \"may\", \"could\", \"would\", \"might\" or \"will\" be taken, occur or be achieved. Forward-looking information involves known and unknown risks, uncertainties and other factors that may cause actual results, events, performance or achievements of Organigram to differ materially from current expectations or future results, performance or achievements expressed or implied by the forward-looking information contained in this news release. Risks, uncertainties and other factors involved with forward-looking information could cause actual events, results, performance, prospects and opportunities to differ materially from those expressed or implied by such forward-looking information include factors and risks as disclosed in the Company's most recent annual information form, management's discussion and analysis and other Company documents filed from time to time on SEDAR+ (see www.sedarplus.ca) and filed or furnished to the Securities and Exchange Commission on EDGAR (see www.sec.gov). Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Although the Company believes that the assumptions and factors used in preparing the forward-looking information in this news release are reasonable, undue reliance should not be placed on such information and no assurance can be given that such events will occur in the disclosed time frames or at all. The forward-looking information included in this news release are made as of the date of this news release and the Company disclaims any intention or obligation, except to the extent required by law, to update or revise any forward-looking information, whether as a result of new information, future events or otherwise.</p><p class=\"\">View source version on businesswire.com: https://www.businesswire.com/news/home/20250204831799/en/</p><p class=\"\">CONTACT:    For Media enquiries:</p><p class=\"\">Megan McCrae, Senior Vice President — Global Brands and Corporate Affairs</p><p class=\"\">megan.mccrae@organigram.ca</p><p class=\"\">For Investor Relations enquiries:</p><p class=\"\">Max Schwartz, Director of Investor Relations</p><p class=\"\">investors@organigram.ca</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013523:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250204013527:0",
            "title": "Aware Taps Amlani to Be New CEO",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Sabela Ojea</p><p class=\"\">Aware named Ajay Amlani its new chief executive officer.</p><p class=\"\">The provider of biometrics software products, services, and solutions on Tuesday said that Amlani replaces Robert Eckel, who in October agreed to leave the company by the end of 2024.</p><p class=\"\">Amlani brings nearly two decades of experience at the intersection of government, private sector innovation, and identity technology, the company said. Most recently, Amlani served as the head of the Americas region at iProov, a smaller competitor in the digital identity company space based in London.</p><p class=\"\">Write to Sabela Ojea at sabela.ojea@wsj.com; @sabelaojeaguix</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250204013527:0/",
            "pub_date": "2025-02-05 07:01:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-04:newsml_ACS839zCa:0",
            "title": "Early Warning Report - Shares of Jade Leader Corp",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">CALGARY, AB / ACCESS Newswire / February 4, 2025 /</strong> This press release is being disseminated as required by National Instrument 62-103 - The Early Warning System and Take over Bid and Insider Reporting Issues regarding the disposition and acquisition of securities of Jade Leader Corp. (\"Jade Leader\").</p><p class=\"\">On February 4, 2025, Normand Goupil (\"Mr. Goupil\"), purchased pursuant to a private placement, a total of 2,500,000 Common Shares or 3.3% of the issued and outstanding shares on an undiluted basis of Jade Leader for cash consideration of $100,000 or $0.04 per Common Share. Following the share purchase Mr. Goupil will beneficially own, control or have direction over, directly or indirectly, an aggregate of 10,044,000 Common Shares representing 13.4% of the issued and outstanding Common Shares as well as hold 1,500,000 Warrants (representing 15.1% on a partly diluted basis, assuming the exercise of all Warrants held by Mr. Goupil). Mr. Goupil's acquisition represents an approximately 2.3% increase in his ownership and or control over Common Shares of Jade Leader on a partially diluted basis, assuming no further common shares of Jade have been issued. The Common Shares are being acquired for investment purposes and in the future, he may further decrease or increase his beneficial ownership of the securities of Jade Leader.</p><p class=\"\">A copy of the early warning report will be available on Jade Leader's Sedar profile at <strong class=\"root-Tkn6WL2y\">www.sedar.com</strong><strong class=\"root-Tkn6WL2y\">.</strong></p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For Further Information Contact:</strong></p><p class=\"\">info@jadeleader.ca</p><p class=\"\">Or Jean Pierre Jutras, President</p><p class=\"\">at 1.403.233.0464</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> Jade Leader Corp.</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-04:newsml_ACS839zCa:0/",
            "pub_date": "2025-02-05 07:01:11",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:G2463553:0",
            "title": "SKY Perfect JSAT Reports 2.6 Million SKY PerfecTV! Subscribers as of End-January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">SKY Perfect JSAT Holdings  reported 2.6 million subscribers to its SKY PerfecTV! pay-TV service at the end of January, a decline of 16,131 from the prior month, according to a Tuesday filing on the Tokyo Stock Exchange. </p><p class=\"\">The main SKY PerfecTV! service saw a net drop of 10,242 users to 1.9 million, while the premium service fell by 5,889 to 649,703. The optical fiber-based re-transmission service added 7,681 subscribers, reaching 2.8 million households.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:G2463553:0/",
            "pub_date": "2025-02-05 07:01:25",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250204:A3309491:0",
            "title": "Neurocrine Biosciences Insider Sold Shares Worth $413,967, According to a Recent SEC Filing",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kevin Charles Gorman, Director, on January 31, 2025, sold 2,707 shares in Neurocrine Biosciences  for $413,967. Following the Form 4 filing with the SEC, Gorman has control over a total of 517,030 common shares of the company, with 517,030 shares held directly. </p><p class=\"\">SEC Filing:</p><p class=\"\"><a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"https://www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml\" rel=\"nofollow\" target=\"_blank\">www.sec.gov/Archives/edgar/data/914475/000091447525000031/xslF345X05/wk-form4_1738709906.xml</a></p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250204:A3309491:0/",
            "pub_date": "2025-02-05 07:01:42",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}