{
    "data": [
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310050:0",
            "title": "UBS Adjusts Price Target on Alphabet to $209 From $211, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Alphabet  has an average rating of overweight and mean price target of $216.47, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310050:0/",
            "pub_date": "2025-02-05 22:43:56",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007276:0",
            "title": "Cummins Is Maintained at Neutral by Baird",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:44 GMT) </strong>Cummins Price Target Raised to $407.00/Share From $395.00 by Baird</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007276:0/",
            "pub_date": "2025-02-05 22:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007278:0",
            "title": "Capri Holdings Is Maintained at Market Perform by Telsey Advisory Group",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:44 GMT) </strong>Capri Holdings Price Target Maintained With a $23.00/Share by Telsey Advisory Group</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007278:0/",
            "pub_date": "2025-02-05 22:44:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW1A3:0",
            "title": "Timken India Dec-Quarter Net PAT at 743 Million Rupees",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Timken India Ltd :</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">TIMKEN INDIA DEC-QUARTER NET PAT 743 MILLION RUPEES</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">TIMKEN INDIA DEC-QUARTER REVENUE FROM OPERATIONS 6.71 BILLION RUPEES</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW1A3:0-timken-india-dec-quarter-net-pat-at-743-million-rupees/",
            "pub_date": "2025-02-05 22:44:01",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310052:0",
            "title": "Citigroup Adjusts PayPal Holdings Price Target to $98 From $97, Maintains Buy Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal Holdings  has an average rating of overweight and mean price target of $95.22, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310052:0/",
            "pub_date": "2025-02-05 22:44:08",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1N2:0",
            "title": "Australia's Macquarie to wind down US debt capital markets arm, Bloomberg reports",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Australia's Macquarie  is set to shutter its U.S. debt capital markets arm, in a move that would impact roughly 80 jobs, Bloomberg News reported on Wednesday, citing unnamed sources with knowledge of the matter.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1N2:0-australia-s-macquarie-to-wind-down-us-debt-capital-markets-arm-bloomberg-reports/",
            "pub_date": "2025-02-05 22:44:40",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310054:0",
            "title": "AtkinsRealis Group Initiated at Buy at Stifel GMP, Price Target Set at C$98.00",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Stifel GMP on Wednesday initiated coverage of construction and engineering company AtkinsRealis Group  with a buy rating and a C$98.00 price target. </p><p class=\"\">\"We are initiating coverage on ATRL with a BUY rating and $98.00/sh target price. There are near-term items that can drive share performance such as (1) bolt-on M&amp;A and (2) further margin improvement. However, we remain transfixed on the ~$4.6 bn of capital flexibility after the sale of the company's interest in Highway 407 ETR, which could provide a pathway to $123/sh over the medium term. This would result in a share price return profile of 18-20% per annum, which we view as attractive given its market cap and stability of earnings,\" analyst Ian Gillies wrote.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310054:0/",
            "pub_date": "2025-02-05 22:44:50",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "te_news:446780:0",
            "title": "Canada Service Activity Contracts for the 2nd Month",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">The S&amp;P Global Canada Services PMI recorded 49.0 in January 2025, slightly up from 48.2 in December 2024, marking the second consecutive contraction in service sector activity.</p><p class=\"\">The decline was attributed to falling new business and subdued market demand, with clients hesitant due to budget concerns and economic uncertainties.</p><p class=\"\">New export business also continued to decline, experiencing its sharpest drop in four years.</p><p class=\"\">Despite the downturn, firms reduced staffing levels for the first time in four months, as backlogs of work continued to decline.</p><p class=\"\">Input cost inflation remained high, driven by rising wage costs and input prices, although output charge inflation was relatively modest compared to operating expenses.</p><p class=\"\">Confidence for the year ahead remained below historical trends, with businesses hopeful that lower interest rates would help stimulate demand and economic growth.</p></span></div>",
            "link": "https://www.tradingview.com/news/te_news:446780:0-canada-service-activity-contracts-for-the-2nd-month/",
            "pub_date": "2025-02-05 22:45:00",
            "source": "Trading Economics",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_SN20250205005134:0",
            "title": "10-, 30-year yields fall to new 2025 lows on risk of all-out war in Middle East",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Jamie Chisholm</p><p class=\"\">Bond yields fell early Wednesday as fears about tariff-driven inflationary pressures subsided somewhat and investors awaited important updates on the health of the U.S. economy.</p><p class=\"\">What's happening</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">The yield on the 2-year Treasury BX:TMUBMUSD02Y dipped 0.6 basis points to 4.210%. Yields move in the opposite direction to prices.</li><li class=\"listItem-bmN0_SHH\">The yield on the 10-year Treasury BX:TMUBMUSD10Y fell 2 basis points to 4.490%.</li><li class=\"listItem-bmN0_SHH\">The yield on the 30-year Treasury BX:TMUBMUSD30Y slipped 2.4 basis points to 4.725%.</li></ul><p class=\"\">What's driving markets</p><p class=\"\">The benchmark 10-year Treasury yield traded below 4.5%, the lowest since mid-December, as concerns dwindled that a tariff war between the U.S. and many of it's biggest trading partners would revive inflationary pressures.</p><p class=\"\">\"Investors have grown hopeful that the tariff delays for Mexico and Canada will mean that tariffs are ultimately avoided, whether that's via further delays or some kind of deal,\" said Henry Allen, strategist at Deutsche Bank.</p><p class=\"\">\"If that does transpire, then that would avoid a major trade shock that hits growth and raises U.S. inflation, hence the more positive market reaction over the last 24 hours,\" Allen added.</p><p class=\"\">As tariff angst cools, for now, traders can turn their attention to important U.S. economic updates over the next few sessions.</p><p class=\"\">The service sector accounts for about three-quarters of U.S. GDP, and so the  S&amp;P final services PMI survey for January, due at 9:45 a.m. Eastern, and the ISM services report for January, at 10:00 a.m., will be closely watched.</p><p class=\"\">The health of the labor market will also be in focus when the ADP survey of private sector employment for January is released at 8:15 a.m. The critical nonfarm payroll report will be published on Friday.</p><p class=\"\">\"[The] U.S. ISM services PMI figure is probably the most interesting, with the index expectedly largely unchanged at 54.0 in January, and the employment sub-index likely to be used as a gauge of where Friday's nonfarm payrolls figure may fall,\" said Michael Brown, senior research strategist at Pepperstone.</p><p class=\"\">Fed Vice Chair Philip Jefferson late Tuesday said he continued to see a gradual reduction in the level of interest rates but that there no need to be in a hurry to change its stance.</p><p class=\"\">Here are some of the other potential bond market catalysts for traders to consider on Wednesday:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">8:30 a.m. U.S. trade deficit for December.</li><li class=\"listItem-bmN0_SHH\">9:00 a.m. Richmond Fed President Tom Barkin speaks.</li><li class=\"listItem-bmN0_SHH\">1:00 p.m. Chicago Fed President Goolsbee speaks.</li><li class=\"listItem-bmN0_SHH\">3:00 p.m. Fed Governor Michelle Bowman speaks.</li></ul><p class=\"\">Finally, dealers will be keeping an eye on the Treasury's quarterly refunding announcement at 8:30 a.m. There has been chatter that the Treasury may shift its debt management strategy away from Treasury bills and toward longer-term debt, according to Stephen Stanley, chief U.S. economist at Santander.</p><p class=\"\">\"As things currently stand, Treasury has time before a meaningful shift in the coupon auction schedule becomes urgent,\" said Stanley.</p><p class=\"\">\"In my view, debt managers could wait until late 2025 or perhaps even into early 2026, depending on how the fiscal outlook evolves (though the new team may choose to make changes before then if they dislike the status quo). For now, consider the Treasury to be running on autopilot,\" Stanley added.</p><p class=\"\">-Jamie Chisholm</p><p class=\"\">This content was created by MarketWatch, which is operated by Dow Jones &amp; Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_SN20250205005134:0/",
            "pub_date": "2025-02-05 22:45:00",
            "source": "MarketWatch",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310057:0",
            "title": "JPMorgan Adjusts Diamondback Energy's Price Target to $205 From $195",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Diamondback Energy  has an average rating of buy and mean price target of $213.30, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310057:0/",
            "pub_date": "2025-02-05 22:45:02",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310053:0",
            "title": "Jefferies Adjusts PayPal Holdings Price Target to $80 From $90, Maintains Hold Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">PayPal Holdings  has an average rating of overweight and mean price target of $95.22, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310053:0/",
            "pub_date": "2025-02-05 22:45:04",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_ACSRXBnHa:0",
            "title": "One Year Since the YOG Gangwon 2024: Celebrating Youth, Sport and Culture",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><em><strong class=\"root-Tkn6WL2y\">International Olympic Committee news</strong></em></p><p class=\"\">NORTHAMPTON, MA / ACCESS Newswire / February 5, 2025 / 19 January will mark one year since the Opening Ceremony of the Winter Youth Olympic Games (YOG) Gangwon 2024, the beginning of an event that highlighted outstanding athletic performances, the remarkable dedication of volunteers, and the engagement of young people in sport. K-pop performances played a prominent role in the Opening and Closing Ceremonies of Gangwon 2024, as well as the Let's Play Winter Festival, showcasing Korean culture both domestically and internationally.</p><p class=\"\">The Winter YOG Gangwon 2024 brought together over 1,800 talented young athletes representing 78 National Olympic Committees (NOCs). Featuring 7 sports and 15 disciplines, the event attracted some 270,000 spectators across nine venues. Taking advantage of the winter sports legacy created by PyeongChang 2018, the organisers made use of 7 out of 12 venues from the Olympic Winter Games. The YOG were widely enjoyed by local fans, as reflected in a survey where 86% rated their experience an 8 or higher out of 10.</p><p class=\"\">Gangwon 2024 not only excelled on-site, but also set new standards for digital engagement. It surpassed previous YOG records on the Olympics' digital platforms, attracting over 810,000 online users and amassing 323 million engagements across the official @Olympics channels.</p><p class=\"\">To commemorate the one-year anniversary of the YOG Gangwon 2024 and celebrate their successful hosting, Gangwon Province is organising a special \"Homecoming Day\" event for its volunteer community. The celebration features a variety of activities, including sports and cultural events, discussions with Olympic medallists and live concerts. Additionally, the <strong class=\"root-Tkn6WL2y\">Gangwon 2024 virtual volunteers' community page</strong> has been launched, providing a dedicated platform for volunteers to stay connected with each other and remain engaged with the Olympic community.</p><p class=\"\">Gangwon 2024 was also marked by the dedication of its volunteer community. A total of 1,984 volunteers contributed to the Games across various zones, including event and ceremony protocol, athlete support, sports management, media coordination and regional guidance. These volunteers gained invaluable experience in organising a major sporting event, while enjoying the opportunity to witness spectacular performances firsthand. The IOC President, Thomas Bach, expressed his gratitude to the <strong class=\"root-Tkn6WL2y\">\"Gangwon Shine Crew\"</strong> for their remarkable efforts in a video message to Gangwon 2024 volunteers.</p><p class=\"\">Building on the legacy of the <strong class=\"root-Tkn6WL2y\">PyeongChang 2018 Winter Games</strong>, the PyeongChang Legacy Foundation (PLF) drove a variety of initiatives to inspire athletes and young people from around the world to engage in winter sports. These efforts led to impressive results, with 39 participants of PLF projects qualifying for the Winter YOG, two of whom, from developing winter nations, went on to win medals at Gangwon 2024. Agnes Campeol from Thailand won a silver medal in women's monobob, while Jonathan Lourimi of Tunisia took home a silver in men's monobob.</p><p class=\"\">Among these initiatives, the \"<strong class=\"root-Tkn6WL2y\">New Horizons Academy,</strong>\" organised by the PyeongChang Memorial Foundation and PyeongChang County, aims to promote winter sports globally. The programme focuses on supporting athletes from countries with limited winter sports infrastructure, offering them the opportunity to train at specialised camps. Of the young athletes who attended these camps, 25 - representing five sports and nine NOCs, including Colombia, Thailand and Tunisia - went on to compete at Gangwon 2024.</p><p class=\"\">The Dream Programme, a legacy initiative from PyeongChang 2018, plays an important role in bolstering sports participation and ensuring accessibility for all. Held annually for 10 days between January and February, the programme provides immersive training opportunities for youngsters aged 13 to 23 from developing countries. Since 2004, the initiative has hosted 2,500 participants from 97 nations, with 150 of them going on to become international athletes. Notably, 14 athletes who competed in Gangwon 2024 were alumni of this programme.</p><p class=\"\">Since the pre-YOG period, Gangwon 2024 has prioritised introducing local youth to winter sports and providing opportunities for accessible sports practice. Since 2020, the Soohorang and Bandabi Sports Camps have engaged 30,000 students, including 12,263 in the season leading up to the Games. These camps provided equal opportunities for disabled and non-disabled participants, featuring activities such as Olympic values education, cultural immersion, and Para ice hockey.</p><p class=\"\">The PyeongChang 2018 Legacy Foundation, which created tangible benefits through diverse cultural and educational initiatives ahead of the YOG, has evolved into the PyeongChang 2018 and Gangwon 2024 Legacy Foundation. This transition aims to ensure the delivery of long-term benefits of the YOG. Eight legacy programmes from Gangwon 2024 will continue, promoting sport among future generations and creating lasting benefits for the host region.</p><p class=\"\">View additional multimedia and more ESG storytelling from International Olympic Committee on 3blmedia.com.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">Contact Info:</strong></p><p class=\"\">Spokesperson: International Olympic Committee</p><p class=\"\">Website: https://www.3blmedia.com/profiles/international-olympic-committee</p><p class=\"\">Email: info@3blmedia.com</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">SOURCE:</strong> International Olympic Committee</p><p class=\"\">View the original press release on ACCESS Newswire</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_ACSRXBnHa:0/",
            "pub_date": "2025-02-05 22:45:31",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0RA:0",
            "title": "Brazil trucks clog up key transshipment facility as soy export program off to slow start",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">A large grain transshipment hub linking the heart of Brazil's farm country to the port of Santos has been clogged up by trucks unable to quickly unload grains, a truckers transportation lobby told Reuters this week.</p><p class=\"\">Lines with as many as 3,500 trucks have formed at the Rondonopolis facility in Mato Grosso, which is operated by Rumo , according to a statement from ANATC, which represents 2.2 million truckers.</p><p class=\"\">\"The situation is alarming. Unloading time can take up to 24 or even 48 hours,\" Carley Welter, institutional director at ANATC, said in the statement.</p><p class=\"\">Logistics disruptions come as Brazil's soybean export program is off to a slow start. According to shipping data, Brazil's soy exports in January fell to 1.3 million tons from 2.4 million tons in the same month last year. </p><p class=\"\">Grains exporters lobby Anec said on Wednesday that rains have disrupted soy harvesting, the flow of trucks and ship loading  times, which could reduce Brazil's soy export volumes in February. </p><p class=\"\">Rumo said truck lines formed at Rondonopolis in late January but noted that the situation is now normal, with no bottlenecks. </p><p class=\"\">\"The unloading system works through a scheduling service and truck drivers' punctuality is key to avoid queues and minimize waiting time,\" Rumo said.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0RA:0-brazil-trucks-clog-up-key-transshipment-facility-as-soy-export-program-off-to-slow-start/",
            "pub_date": "2025-02-05 22:45:39",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L4N3OW1L5:0",
            "title": "FMC shares sink on lower quarterly revenue forecast",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">** Agrichemicals firm FMC's  shares sink 34% to $35.64 </p><p class=\"\">** FMC posted Q4 2024 profit of $1.79 cents per share after the markets closed on Tuesday, compared with analysts' average estimate of $1.6 cents per share - data compiled by LSEG</p><p class=\"\">** But it forecast Q1 2025 revenue below Wall Street estimates </p><p class=\"\">** \"Another year of inventory destocking will lead to lower sales and profit growth and reduced free cash flow generation. Management's guidance for free cash flow generation is less than its dividend payment. This puts the dividend at risk should sales and profits come in below guidance\" - Morningstar analyst Seth Goldstein </p><p class=\"\">** Brokerage cuts PT on FMC to $95 from $110</p><p class=\"\">** Morgan Stanley cuts PT to $46 from $70 on \"ongoing financial performance challenges, execution risk associated with the new strategy and elevated debt leverage\"</p><p class=\"\">** Bank of America cuts PT to $48 from $61 and downgrades stock to \"underperform\" from \"neutral\"</p><p class=\"\">    ** Says \"earnings release highlighted additional broader and company-specific challenges which in our view raise FMC's risk profile substantially\"   </p><p class=\"\">** FMC is down 28% YTD</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L4N3OW1L5:0-fmc-shares-sink-on-lower-quarterly-revenue-forecast/",
            "pub_date": "2025-02-05 22:38:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW212:0",
            "title": "Tesla sees German car sales plunge in January",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Tesla  sold almost 60% fewer cars in Germany in January than in the year-earlier period, as the U.S. electric vehicle maker faces a test of popularity amid headline-grabbing political involvement by its billionaire CEO Elon Musk.    </p><p class=\"\">German road traffic agency KBA's website on Wednesday showed the number of newly registered Tesla cars fell 59.5% to 1,277 in January, while the overall German market was down just 2.8% at slightly more than 207,000 vehicles during the month.</p><p class=\"\">The overall segment of battery-electric vehicles, where Tesla is competing, however, gained popularity in January, with sales up 53.5% at almost 34,500 vehicles across all brands.</p><p class=\"\">KBA did not give reasons for the developments in car sales.</p><p class=\"\">Car registration data in Sweden and Norway earlier this week also showed that Tesla lost market share there in January.</p><p class=\"\">A total of 405 new Teslas were registered in Sweden last month, down 44% from January 2024, while registrations in Norway fell to 689, a decline of 38% over the same period, despite soaring overall demand for cars in the two countries.</p><p class=\"\">In addition to his strong backing for U.S. President Donald Trump, Musk has also voiced polarising opinions on politics in Europe and beyond, drawing criticism from European capitals, including Norway's prime minister and Germany's chancellor.</p><p class=\"\">Musk, who also runs the X social media platform, has dismissed criticism against him as an affront to democracy and free speech.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW212:0-tesla-sees-german-car-sales-plunge-in-january/",
            "pub_date": "2025-02-05 22:38:42",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_FWN3OW0YW:0",
            "title": "Citi Raises Q1, Q2 TTF and JKM Gas Price Forecasts",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">CITI RESEARCH: </p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAISES PRICE FORECASTS FOR 1Q25 AND 2Q25 TTF TO $15.4/MMBTU (€51/MWH) AND $15.0/MMBTU</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">RAISES PRICE FORECASTS FOR 1Q25 AND 2Q25 JKM TO $14.4 AND $15.0/MMBTU</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS WITH NEW US LNG EXPORT TERMINALS COMING ONLINE FROM 2025 ONWARDS, EUROPEAN TTF NATURAL GAS AND JKM LNG PRICES ARE LIKELY ENTERING ANOTHER DOWN CYCLE POST 2026</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS REMAINS BEARISH ON 2026 TTF-HH SPREADS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS LONG-TERM IMPLICATIONS OF RISING US LNG EXPORTS ON HENRY HUB ARE MORE COMPLICATED, DUE TO THE POSSIBILITY OF US LNG CURTAILMENTS </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS WE REMAIN CONSTRUCTIVE ON LONG-TERM HENRY HUB PRICES EVEN AFTER THE BREAKTHROUGH OF DEEPSEEK THAT UNDERMINES AI POWER DEMAND FORECASTS</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">SAYS ASIAN DEMAND IS SET TO REMAIN WEAK THROUGH 1Q DESPITE THE BRIEF COLD SHOT IN NORTH EAST ASIA IN 1H FEB DUE TO HIGH LNG PRICES AND TEPID MACRO ECONOMY</p></li></ul></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_FWN3OW0YW:0-citi-raises-q1-q2-ttf-and-jkm-gas-price-forecasts/",
            "pub_date": "2025-02-05 22:38:51",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310017:0",
            "title": "Canadian Pacific, USW Canada Reach Tentative Accord on New Contract",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canadian Pacific Kansas City  Wednesday said the railroad company has reached a tentative four-year collective agreement with United Steelworkers representing around 6000 of its clerical and intermodal employees in Canada. </p><p class=\"\">Details of the tentative collective agreement were not immediately disclosed and will not be released until the agreement has been ratified, the company said. The deal is the company's third in Canada during 2025, the company said. </p><p class=\"\">The USW Canada did not immediately respond to a message from MT Newswires on Wednesday seeking comment about the proposed contract agreement.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310017:0/",
            "pub_date": "2025-02-05 22:38:54",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX2NfBXV:0",
            "title": "VCI Global Announces Development of Groundbreaking AI Aggregator Platform Integrating DeepSeek, ChatGPT, and Leading AI Agents",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KUALA LUMPUR, Malaysia, Feb.  05, 2025  (GLOBE NEWSWIRE) — VCI Global Limited  (“VCI Global,” or the “Company”), a leading innovator in AI-driven enterprise solutions, today announced the development of a next-generation AI aggregator platform. Designed to streamline AI integration, the platform will provide seamless access to major AI models, such as DeepSeek, OpenAI’s ChatGPT, Anthropic’s Claude, Google Gemini, Mistral AI, and other emerging AI technologies.</p><p class=\"\">According to research by Future Market Insights Inc., global AI platforms sales are projected to reach approximately US$150 billion by 2034, reflecting a compound annual growth rate (CAGR) of over 20% from 2024 to 2034. Meanwhile, the AI agents market is expected to grow to nearly US$50 billion by 2030, primarily driven by advancements in natural language processing. According to Markets and Markets, this sector is set to experience a remarkable CAGR of almost 50% between 2024 and 2030.</p><p class=\"\">The rising demand for AI solutions highlights businesses’ increasing reliance on AI models for decision-making, automation, and customers engagement. VCI Global’s AI aggregator will streamline multi-model integration, enhancing efficiency and performance. The platform will be deployed across Asia, Europe, and United States, catering to industries such as finance, healthcare, customer service, and e-commerce.</p><p class=\"\">AI Aggregator: The Future of Enterprise AI Integration</p><p class=\"\">The VCI Global AI aggregator platform offers:</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\">Multi-AI Access – Connect effortlessly to ChatGPT, DeepSeek, Anthropic’s Claude, Google Gemini, Mistral AI, and open-source alternatives through a single interface.</li><li class=\"listItem-bmN0_SHH\">Cost Optimization – Dynamically select the most efficient AI models based on pricing, response quality, and latency to optimize resource allocation.</li><li class=\"listItem-bmN0_SHH\">Customization and Automation – Route AI requests to the most suitable models for specific tasks, such as leveraging ChatGPT for natural language processing and DeepSeek for research-driven queries.</li><li class=\"listItem-bmN0_SHH\">Enterprise-Grade Security and Compliance – Ensure regulatory adherence with built-in data encryption, advanced privacy controls, and region-specific compliance for businesses in Europe, the United States, and Asia.</li></ul><p class=\"\">Development Underway, Market Launch Targeted</p><p class=\"\">VCI Global’s development team is actively working on the platform, with a planned launch by the fourth quarter of 2025. The company is collaborating with AI developers, enterprises, and industry experts to ensure the platform delivers maximum value to corporations, developers, and technology providers.</p><p class=\"\">“Our AI aggregator platform will transform how enterprises interact with AI technologies by simplifying integration and enabling businesses to seamlessly leverage the most suitable AI models for their specific needs, while scaling their AI capabilities without being locked into a single provider,” said Dato’ Victor Hoo, Group Executive Chairman and Chief Executive Officer of VCI Global.</p><p class=\"\">About VCI Global Limited</p><p class=\"\">VCI Global is a diversified global holding company with a strategic focus on AI &amp; Robotics, Fintech, Cybersecurity, Renewable Energy, and Capital Market Consultancy. With a strong presence in Asia, Europe, and the United States, VCI Global is committed to driving technological innovation, sustainable growth, and financial excellence across multiple industries.</p><p class=\"\">For more information on the Company, please log on to https://v-capital.co/. </p><p class=\"\">Cautionary Note Regarding Forward-Looking Statements</p><p class=\"\">This press release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company’s ability to grow its business and other statements that are not historical facts, including statements which may be accompanied by the words “intends,” “may,” “will,” “plans,” “expects,” “anticipates,” “projects,” “predicts,” “estimates,” “aims,” “believes,” “hopes,” “potential” or similar words. These forward-looking statements are based only on our current beliefs, expectations, and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks, and changes in circumstances that are difficult to predict and many of which are outside of our control. Therefore, you should not rely on any of these forward-looking statements. Actual results could differ materially from those described in these forward-looking statements due to certain factors, including without limitation, the Company’s ability to achieve profitable operations, customer acceptance of new products, the effects of the spread of coronavirus (COVID-19) and future measures taken by authorities in the countries wherein the Company has supply chain partners, the demand for the Company’s products and the Company’s customers’ economic condition, the impact of competitive products and pricing, successfully managing and, general economic conditions and other risk factors detailed in the Company’s filings with the United States Securities and Exchange Commission (“SEC”). The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake any responsibility to update the forward-looking statements in this release, except in accordance with applicable law.</p><p class=\"\">CONTACT INFORMATION:</p><p class=\"\">For media queries, please contact:</p><p class=\"\">VCI GLOBAL LIMITED</p><p class=\"\">enquiries@v-capital.co</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX2NfBXV:0-vci-global-announces-development-of-groundbreaking-ai-aggregator-platform-integrating-deepseek-chatgpt-and-leading-ai-agents/",
            "pub_date": "2025-02-05 22:39:00",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007244:0",
            "title": "S&P 500, Nasdaq Fall at Open; Google, AMD in Focus — WSJ",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">By Angus Berwick</p><p class=\"\">After a flurry of tariff news, an old reliable - earnings season - is back in the spotlight. Investors are poring over results from Google parent Alphabet and chip maker Advanced Micro Devices, which each disappointed investors.</p><p class=\"\">The S&amp;P 500 and Nasdaq Composite fell Wednesday morning, while the Dow industrials were little changed. Major indexes had rebounded Tuesday, clawing back most of the previous session's losses, despite the escalating U.S.-China trade war.</p><p class=\"\">China's response to U.S. tariffs was considered by Wall Street to be fairly tame, with new levies imposed on a slim slice of American goods. Some analysts cautioned, however, that investors might be underestimating the risk of a lengthier trade spat.</p><p class=\"\">In recent market action:</p><p class=\"\">Earnings drove some big moves. Shares in Alphabet, AMD and Uber all fell sharply, while Mattel stock jumped.</p><p class=\"\">U.S. Treasury yields edged lower, after the 10-year note settled Tuesday at 4.511%. The Treasury said it wasn't planning to step up debt issuance anytime soon.</p><p class=\"\">Chinese stock indexes saw small losses. Benchmarks in mainland China reopened after a long New Year break.</p><p class=\"\">Bitcoin prices fell to around $99,000.</p><p class=\"\">Write to Angus Berwick at angus.berwick@wsj.com</p><p class=\"\">This item is part of a Wall Street Journal live coverage event. The full stream can be found by searching P/WSJL (WSJ Live Coverage).</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007244:0/",
            "pub_date": "2025-02-05 22:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "DJN_DN20250205007242:0",
            "title": "Lancaster Colony Is Maintained at Equal-Weight by Stephens & Co.",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\"><strong class=\"root-Tkn6WL2y\">(14:39 GMT) </strong>Lancaster Colony Price Target Raised to $200.00/Share From $196.00 by Stephens &amp; Co.</p></span></div>",
            "link": "https://www.tradingview.com/news/DJN_DN20250205007242:0/",
            "pub_date": "2025-02-05 22:39:00",
            "source": "Dow Jones Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310041:0",
            "title": "UBS Adjusts Price Target on Fair Isaac to $1,950 From $2,100, Maintains Neutral Rating",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Fair Isaac  has an average rating of hold and mean price target of $2,020.69, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310041:0/",
            "pub_date": "2025-02-05 22:39:55",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_GNX2Xryhs:0",
            "title": "SmartCentres Closes $300 Million Series AB Senior Unsecured Debenture Issue",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">NOT FOR DISTRIBUTION IN THE UNITED STATES OR OVER UNITED STATES WIRE SERVICES</p><p class=\"\">TORONTO, Feb.  05, 2025  (GLOBE NEWSWIRE) — SmartCentres Real Estate Investment Trust (“SmartCentres” or the “Trust”) (TSX:SRU.UN) announced today that it has closed its previously announced private placement of $300 million aggregate principal amount of 4.737% Series AB senior unsecured debentures. The Series AB debentures will mature on August 5, 2031. The debentures were offered on an agency basis by a syndicate of agents led by Scotiabank, CIBC Capital Markets, Desjardins Securities, RBC Capital Markets and TD Securities as joint bookrunners, and National Bank Financial, Mizuho Securities, BMO Capital Markets and Casgrain as co-managers. Morningstar DBRS has provided SmartCentres with a credit rating of BBB with a stable trend relating to the debentures.</p><p class=\"\">The net proceeds to SmartCentres from the sale of the Series AB debentures, will be used to refinance existing debt, including the repayment of its $160 million Series N senior unsecured debentures due February 6, 2025, the repayment of its revolving credit line and for general corporate purposes.</p><p class=\"\">This press release shall not constitute an offer to sell, or the solicitation of an offer to buy, any securities in any jurisdiction. The debentures offered have not been and will not be registered under the U.S. Securities Act of 1933 and state securities laws. Accordingly, the debentures may not be offered or sold to U.S. persons except pursuant to applicable exemptions from registration requirements.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About SmartCentres</strong></p><p class=\"\">SmartCentres is one of Canada’s largest fully integrated REITs, with a best-in-class and growing mixed-use portfolio featuring 195 strategically located properties in communities across the country. SmartCentres has approximately $11.9 billion in assets consisting of income producing value-oriented retail, purpose-built rental, first-class office and self-storage properties. SmartCentres owns 35.3 million square feet of leasable space with 98.5% in place and committed occupancy, on 3,500 acres of owned land across Canada.</p><p class=\"\">For more information, please visit www.smartcentres.com or contact:</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td>Mitchell Goldhar</td><td>Peter Slan</td></tr><tr><td>Executive Chairman and CEO</td><td>Chief Financial Officer</td></tr><tr><td>(905) 326-6400 ext. 7674</td><td>(905) 326-6400 ext. 7571</td></tr><tr><td>mgoldhar@smartcentres.com </td><td>pslan@smartcentres.com </td></tr></tbody></table></div><p class=\"\">Certain statements in this Press Release are \"forward-looking statements\" that reflect management's expectations regarding the Trust's future growth, results of operations, performance and business prospects and opportunities. More specifically, certain statements including, but not limited to, statements related to the anticipated use of proceeds of the offering, and statements that contain words such as \"could\", \"should\", \"can\", \"anticipate\", \"expect\", \"believe\", \"will\", \"may\" and similar expressions and statements relating to matters that are not historical facts, constitute \"forward-looking statements\". These forward-looking statements are presented for the purpose of assisting the Trust's Unitholders and financial analysts in understanding the Trust's operating environment and may not be appropriate for other purposes. Such forward-looking statements reflect management's current beliefs and are based on information currently available to management.</p><p class=\"\">However, such forward-looking statements involve significant risks and uncertainties. A number of factors could cause actual results to differ materially from the results discussed in the forward-looking statements, including risks associated with potential acquisitions not being completed or not being completed on the contemplated terms, public health crises, real property ownership and development, debt and equity financing for development, interest and financing costs, construction and development risks, and the ability to obtain commercial and municipal consents for development. These risks and others are more fully discussed under the heading “Risks and Uncertainties” and elsewhere in SmartCentres’ most recent Management’s Discussion and Analysis, as well as under the heading “Risk Factors” in SmartCentres’ most recent annual information form. Although the forward-looking statements contained in this Press Release are based on what management believes to be reasonable assumptions, SmartCentres cannot assure investors that actual results will be consistent with these forward-looking statements. The forward-looking statements contained herein are expressly qualified in their entirety by this cautionary statement. These forward-looking statements are made as at the date of this Press Release and SmartCentres assumes no obligation to update or revise them to reflect new events or circumstances unless otherwise required by applicable securities legislation.</p><p class=\"\">Material factors or assumptions that were applied in drawing a conclusion or making an estimate set out in the forward-looking information may include, but are not limited to: a stable retail environment; a continuing trend toward land use intensification, including residential development in urban markets and continued growth along transportation nodes; access to equity and debt capital markets to fund, at acceptable costs, future capital requirements and to enable our refinancing of debts as they mature; that requisite consents for development will be obtained in the ordinary course, construction and permitting costs consistent with the past year and recent inflation trends.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_GNX2Xryhs:0-smartcentres-closes-300-million-series-ab-senior-unsecured-debenture-issue/",
            "pub_date": "2025-02-05 22:39:58",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025-02-05:newsml_Wkr6V5hW5:0",
            "title": "Clean Motion establishes sales operations in Spain",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span>Clean Motion AB<p class=\"\">Jonsered, Sweden: Clean Motion is taking the next step in its European expansion by launching sales operations in Spain. The region is expected to become a key market for the company's solar-powered transport solution, EVIG, where the growing demand for sustainable transportation, combined with favorable climate conditions, creates an ideal business environment.</p><p class=\"\">Clean Motion is establishing sales operations in Spain with a base in Marbella. The aim of this initiative is to allow customers to experience EVIG firsthand and make it more accessible to the local market. Initially, the focus will be local, but it is set to expand further across Southern Europe.</p><p class=\"\">As part of this effort, Massimiliano Marangi joins Clean Motion as Sales Manager South Europe, taking responsibility for sales directed towards the Southern European market. With a background in micromobility and international sales, he brings expertise, experience, and a strong network that will strengthen Clean Motion’s presence in the region.</p><p class=\"\">“The Iberian Peninsula, and particularly Southern Spain, is an optimal location for EVIG. With abundant sunshine and a growing demand for electric vehicles, we see strong business potential for our solution. We are now establishing a local presence to strengthen our position in the region and build a scalable business for the future,” says Christoffer Sveder, Chief Commercial Officer at Clean Motion.</p><p class=\"\">The region is increasingly investing in zero-emission transport solutions. Marbella, a hub for innovation and green initiatives, serves as the perfect entry point for expansion in Spain. The establishment in Spain is part of the company’s strategy to accelerate the sales of EVIG across Europe.</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">For more information please contact:</strong></p><p class=\"\">Louise Jeansson</p><p class=\"\">Chief Communications &amp; Marketing Officer</p><p class=\"\">louise.jeansson@cleanmotion.se</p><p class=\"\"><strong class=\"root-Tkn6WL2y\">About Clean Motion AB</strong></p><p class=\"\">Clean Motion AB is a Swedish company that manufactures and sells truly sustainable vehicles for cities. The vehicles are locally produced and based on energy and resource efficiency to maximize the adoption of electric vehicles globally. The company's vision is to offer city mobility powered by solar energy and therefore provides lightweight electric vehicles with low energy consumption to meet the urban transportation challenges of the 21st century. Clean Motion AB is listed on the First North Growth Market at Nasdaq Stockholm. The Certified Adviser is G&amp;W Fondkommission. For further information, please visit: www.cleanmotion.se</p><p class=\"\">https://news.cision.com/clean-motion-ab/r/clean-motion-establishes-sales-operations-in-spain%2Cc4101164</p><p class=\"\">Clean-Motion-Massimiliano-Marangi-PM</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025-02-05:newsml_Wkr6V5hW5:0-clean-motion-establishes-sales-operations-in-spain/",
            "pub_date": "2025-02-05 22:40:03",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310043:0",
            "title": "December Brings Canada's First Trade Surplus Since February 2024, Says TD",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Canada's merchandise trade balance tallied a first-in-ten-month surplus of C$708 million in December, while November's deficit was revised higher to C$986 million from $323 million reported earlier, noted TD on Wednesday. </p><p class=\"\">Merchandise exports accelerated to 4.9% month on month from 1.9% in November, with gains reported by eight out of 11 sectors. Energy exports, driven by higher crude oil prices, were once again the biggest driver of exports, accelerating to 9.5% month over month. Exports of metal and non-metallic mineral products (+9.2% month over month) and motor vehicles and parts (+3.9%) also added admirably to the headline tally. </p><p class=\"\">Merchandise imports also moved higher for a third straight month, up by 2.3% month over month in December. The biggest gains came from consumer goods (+4.7% month over month), metal and non-metallic mineral products (+8.7%) and industrial machinery (+5.0% m/m). </p><p class=\"\">In volume terms, merchandise exports rose by 2.6% month over month while imports edged higher by 0.2%. </p><p class=\"\">Canada's merchandise trade surplus with the United States widened to C$11.3 billion in December from C$8.2 billion the month prior. </p><p class=\"\">Trade finished the quarter on a strong note, with goods likely providing an improved trajectory for Q4 gross domestic product growth, stated TD. Trade-related uncertainty has likely led companies to stockpile inventories, temporarily boosting trade. </p><p class=\"\">Statistics Canada's ongoing transition in trade-related data means these figures should be interpreted with caution, pointed out the bank. </p><p class=\"\">While the immediate threat of U.S. tariffs on Canadian exports has been delayed until next month, the outlook remains uncertain as tariffs are still on the table, added TD. Any future tariffs will have negative consequences for economic growth, though the ultimate effect will depend on depth, breadth, duration and retaliation.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310043:0/",
            "pub_date": "2025-02-05 22:40:15",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW219:0",
            "title": "Kenya central bank cuts main lending rate to 10.75%",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Kenya's central bank cut its benchmark lending rate (KECBIR=ECI) by 50 basis points to 10.75% on Wednesday, its monetary policy committee said.</p><p class=\"\">The decision was in line with the forecast of a Reuters poll of four economists.</p><p class=\"\">The central bank also cut banks' Cash Reserve Ratio by 100 basis points to 3.25% to support a lowering of lending rates, the committee said in a statement.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW219:0-kenya-central-bank-cuts-main-lending-rate-to-10-75/",
            "pub_date": "2025-02-05 22:40:18",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310045:0",
            "title": "Wolfe Research Adjusts Capital One Financial's Price Target to $251 From $228",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">Capital One Financial  has an average rating of overweight and mean price target of $218.61 according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310045:0/",
            "pub_date": "2025-02-05 22:40:36",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L8N3OW23C:0",
            "title": "Performance Food Group Co reports results for the quarter ended December 31 - Earnings Summary",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">Performance Food Group Co  reported quarterly adjusted earnings of 98 cents​​ per share for the quarter ended December 31, higher than the same quarter last year, when the company reported EPS of 90 cents.  The mean expectation of fourteen analysts for the quarter was for earnings of $1.05 per share. Wall Street expected results to range from 94 cents to $1.15 per share.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Revenue rose 9.4% to $15.64 billion from a year ago; analysts expected $15.50 billion. </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Performance Food Group Co's reported EPS for the quarter was 27 cents​.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The company reported quarterly net income of $42.4 million.</p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">Performance Food Group Co shares had risen by 7.2% this quarter.</p></li></ul><p class=\"\">FORECAST CHANGES</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The mean earnings estimate of analysts had fallen by about 0.2% in the last three months.​ </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">In the last 30 days, one analyst negatively revised an earnings estimate</p></li></ul><p class=\"\">RECOMMENDATIONS</p><ul class=\"list-bmN0_SHH list--padded-bmN0_SHH\"><li class=\"listItem-bmN0_SHH\"><p class=\"\">The current average analyst rating on the shares is \"buy\" and the breakdown of recommendations is 10 \"strong buy\" or \"buy,\" 5 \"hold\" and 1 \"sell\" or \"strong sell.\" </p></li><li class=\"listItem-bmN0_SHH\"><p class=\"\">The average consensus recommendation for the food retail &amp; distribution peer group is also \"buy\"</p></li></ul><p class=\"\">Wall Street's median 12-month price target for Performance Food Group Co is $100.00 </p><p class=\"\">This summary was machine generated from LSEG data February 5 at 02:31 p.m. UTC. ​All figures in US dollars unless otherwise stated. (For questions concerning the data in this report, contact Estimates.Support@lseg.com. For any other questions or feedback, contact <a class=\"link-zw5jRdec icon-zw5jRdec\" href=\"http://mailto:RefinitivNewsSupport@thomsonreuters.com\" rel=\"nofollow\" target=\"_blank\">RefinitivNewsSupport@thomsonreuters.com</a>)</p><div class=\"tableWrapper-pIO_GYwT\"><table class=\"table-VG8_37yK\" data-no-swipe=\"true\"><tbody><tr><td><p class=\"\">QUARTER ENDING</p></td><td><p class=\"\">ESTIMATE </p></td><td><p class=\"\">ACTUAL</p></td><td><p class=\"\">BEAT, MET, MISSED</p></td></tr><tr><td><p class=\"\">Dec. 31 2024 </p></td><td><p class=\"\">1.05</p></td><td><p class=\"\">0.98</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Sep. 30 2024 </p></td><td><p class=\"\">1.22</p></td><td><p class=\"\">1.16</p></td><td><p class=\"\">Missed</p></td></tr><tr><td><p class=\"\">Jun. 30 2024 </p></td><td><p class=\"\">1.37</p></td><td><p class=\"\">1.45</p></td><td><p class=\"\">Beat</p></td></tr><tr><td><p class=\"\">Mar. 31 2024 </p></td><td><p class=\"\">0.84</p></td><td><p class=\"\">0.80</p></td><td><p class=\"\">Missed</p></td></tr></tbody></table></div></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L8N3OW23C:0-performance-food-group-co-reports-results-for-the-quarter-ended-december-31-earnings-summary/",
            "pub_date": "2025-02-05 22:32:36",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "tag:reuters.com,2025:newsml_L1N3OW0LR:0",
            "title": "Brazil's 2024 industrial output notches annual gain but drops at year-end",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">    Industrial production in Brazil expanded in 2024, official data showed on Wednesday, but a third consecutive monthly drop in December reinforced signs of an economic slowdown. </p><p class=\"\">Production rose 3.1% for the full year, statistics agency IBGE said, the best performance since 2021 - when the Brazilian economy was recovering from the pandemic - but lost steam late in the year as financial conditions tightened. </p><p class=\"\">Industrial output fell 0.3% in December from November, slightly less than the 0.5% decline projected in a Reuters poll. </p><p class=\"\">The monthly result corroborates expectations of a loss of economic momentum at the end of 2024 and a potential slowdown in 2025, economists say.</p><p class=\"\">The loss of dynamism in the sector is \"largely explained by the tightening of monetary policy,\" IBGE's survey manager Andre Macedo said in a statement, also citing currency depreciation and high inflation.</p><p class=\"\">Brazil's central bank in its latest monetary policy decision hiked interest rates by 100 basis points to 13.25% and signaled a matching increase at its next meeting, as policymakers seek to curb rising consumer prices.</p><p class=\"\">\"After peaking in June, Brazil's industry slowed down in the second half of the year and could be in negative territory in 2025 due to high interest rates and an expected drop in demand,\" lender Inter's chief economist Rafaela Vitoria said.</p><p class=\"\">On a yearly basis, production in December grew 1.6%, IBGE said, above the 1.1% rise forecast in the Reuters poll.</p></span></div>",
            "link": "https://www.tradingview.com/news/reuters.com,2025:newsml_L1N3OW0LR:0-brazil-s-2024-industrial-output-notches-annual-gain-but-drops-at-year-end/",
            "pub_date": "2025-02-05 22:32:38",
            "source": "Reuters",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310009:0",
            "title": "TSX Brief: Up 70 Pts Early Wednesday, After Index Edged Higher Tuesday",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310009:0-tsx-brief-up-70-pts-early-wednesday-after-index-edged-higher-tuesday/",
            "pub_date": "2025-02-05 22:32:49",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        },
        {
            "id": "urn:newsml:mtnewswires.com:20250205:A3310032:0",
            "title": "Oppenheimer Cuts Price Target on KKR to $169 From $171",
            "description": "<div class=\"body-KX2tCBZq body-pIO_GYwT content-pIO_GYwT\"><span><p class=\"\">KKR  has an average rating of overweight and mean price target of $171.56, according to analysts polled by FactSet.</p></span></div>",
            "link": "https://www.tradingview.com/news/mtnewswires.com:20250205:A3310032:0/",
            "pub_date": "2025-02-05 22:32:59",
            "source": "MT Newswires",
            "kind": 1,
            "language": "en"
        }
    ]
}